[
    {
        "full_article": "Secretary of State Marco Rubio has confirmed that there is an ongoing programme in the United States to revoke the visas of foreign students who are “taking activities that are counter to our national interest, to our foreign policy”. Reports suggest that several hundred visas have been revoked, which include those held by Indian students. These reports also indicate that the U.S. government is using surveillance of social media activity as a basis for these revocations. Mr. Rubio also referenced the more troubling aspects of the Gaza war protests — Jewish students were reportedly harassed or university buildings were occupied. In his view, if an action would justify denying a visa at the application stage, it is grounds for revocation after issuance. However, this development raises concerns about the U.S. government’s stance on the free speech rights of foreign nationals who reside in the country legally. Not all those affected by these visa revocations have been disruptive. The right to free speech is enshrined in the First Amendment to the U.S. Constitution. Although the amendment explicitly restricts Congress from curtailing speech, it has long been interpreted broadly. It protects “people”, not just “citizens” — though the distinction may have been less defined at the time of its writing.Whether this right extends to foreign nationals legally present in the U.S. remains a grey area. Various laws — from those of the late 18th century to more recent regulations concerning the impact on U.S. foreign policy — have placed limits on such expression. Yet, historically, foreign students have often been vocal critics of U.S. domestic and foreign policies without facing punitive action. And, university administrations have generally defended the free speech rights of students and academics. Despite its imperfections — both historic, such as the internment of Japanese Americans during the Second World War, and ongoing, such as systemic racial inequalities — the U.S. has been a beacon of liberal values and due process. These are principles admired around the world, often more than its material wealth or professional opportunities. For many, it is the commitment to values such as free speech that makes the U.S. exceptional. That commitment now appears to be at risk. The U.S. system of checks and balances, which guards against the abuse of power, should assert itself — perhaps through judicial intervention — to rein in the overreach by the Trump administration and preserve the freedoms that define American democracy and inspire large parts of the world.\r Published - April 01, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        interior policy\n                    \n                            /                      \n                        \n                        students\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        university\n                    \n                            /                      \n                        \n                        human rights\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        Japan\n                    \n                            /                      \n                        \n                        history",
        "headline_1": "Alarming shift: on the U.S. government and free speech rights",
        "headline_2": "Donald Trump’s executive overreach calls for judicial intervention",
        "link": "https://www.thehindu.com/opinion/editorial/alarming-shift-on-the-us-government-and-free-speech-rights/article69395901.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-04-2025"
    },
    {
        "full_article": "The violent protests in Kathmandu on Friday, which left two dead, dozens injured and saw arson and looting, were spearheaded by fringe political forces such as the royalist Rastriya Prajatantra Party. Though long relegated to the political margins, the royalist camp has managed to seize upon growing disillusionment with the political establishment. The series of pro-monarchist rallies and demonstrations have been drawing crowds across Kathmandu and other cities, signalling an undercurrent of dissatisfaction with the republic, which is surprising and concerning. Nearly two decades ago, Nepal made a decisive break from monarchy, an institution that had shaped its identity for over 240 years. This was neither a moment of spontaneous outrage nor a casual shift, but the culmination of years of discontent. The turning point came with the royal massacre at Narayanhiti Palace in June 2001, which irreparably damaged the monarchy’s image. When Gyanendra Shah ascended the throne after his brother’s death, he attempted to reassert absolute authority and return Nepal to the pre-1990 political order. His power grab and crackdown on democratic forces triggered a backlash. The tide turned definitively when Maoist rebels abandoned an armed struggle to join the mainstream democratic process. Their integration, along with the withdrawal of international support — particularly Indian — for the monarchy, sealed the institution’s fate. A democratically elected Constituent Assembly (CA) was formed, and in 2008, passed a near-unanimous resolution declaring Nepal to be a federal democratic republic. Despite the political volatility, which included two iterations of the CA before the Constitution was promulgated in 2015, Nepal has remained a constitutional republic. Since 2008, power has primarily alternated among the Nepali Congress, which has led the fight for democracy since the fall of the Rana regime; the Communist Party of Nepal (Unified Marxist-Leninist), the largest of the leftist parties; and the former Maoist rebels. However, chronic instability, opportunistic alliances, poor governance, and self-serving leadership have plagued the system. The hopes of the CA for inclusive development and justice have largely gone unfulfilled.Even so, most Nepalis remain acutely aware of the authoritarianism and injustices that characterised the monarchist era. The recent surge in pro-monarchy sentiment is a regressive response to democratic disillusionment. The government must move swiftly to hold accountable those responsible for the recent violence, including any role played by Mr. Shah. At the same time, the ruling party and the opposition must rise to the occasion, restoring public faith by demonstrating the strength, responsiveness, and integrity of parliamentary democracy. That is the surest antidote to calls for a return to monarchy. Published - April 01, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Nepal\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        imperial and royal matters\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        parliament",
        "headline_1": "No to regression: on protests in Nepal, pro-monarchy sentiment",
        "headline_2": "Disenchantment with Nepal’s political parties is exploited by reactionaries",
        "link": "https://www.thehindu.com/opinion/editorial/no-to-regression-on-protests-in-nepal-pro-monarchy-sentiment/article69395916.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-04-2025"
    },
    {
        "full_article": "By Arup Mitra\nWhy does Kali look so ferocious? Why she is so different from other goddesses? Why does she reside in the graveyard? The standard explanation adheres to tantrism, which is different from Vedic perception. However, bhaktivadis, followers of the path of pure devotion, may interpret Kali phenomenon from a different angle.\nBestowing all comforts in life, Kali, the mother, takes refuge in a place which is discarded by all. Where unwanted stuff is thrown away or cremated becomes her abode. Here, she remains watchful to secure those who have lost their lives. She is there to rejuvenate life for which she must attain victory over death. She is constantly fighting with death, the ferocious one, and hence, she must appear more ferocious than death. With her victory over death, she leads resurrection, thus symbolising ‘creative destruction’, a term which Vivekananda used in his lectures in US.\nRelatives are fond of a person when he is alive, but his corpse is disposed of at the earliest. The true mother takes remains of the rejected body and adores them by making them a part of her formal manifestation. She conveys that nothing is lost, nothing is a waste; even the cadaver is a part of her appearance. Garland of heads of the dead is placed around her neck and hands are tied together to form the outfit of goddess who wins over death. She would bring back life soon. Earth accepts everything and converts it to soil, making it more fertile, which is why Wordsworth had perceived nature as God.\n\nHere is the true mother who is trying to kill disillusions and unravel the path to eternity. What is disillusion? It is nothing but death. It is the biggest noisemaker, disturbing peace and tranquillity that one can experience. You will find there is only one ocean of eternal light, throbbing with life.\nShe is the embodiment of eternal affection, fondly encompassing every minute detail and offering the ability to understand all that remains mysterious and dark. Within that gloom, all shades of light are embedded. Vitality is rooted in what appears to be dispiritedness. Hence darkness, which otherwise would have been taken as lifelessness, is the symbol of vigour. Indeed, why Kali is conceptualised as dark and dynamic.\nAt the confluence of Vaishnavism and Shakta tradition, Kali appears as Krishn and vice versa. The eternal love flowing like the music from a flute during blossoms with spring all around merges with the essence of vitality hidden in dimness and obscurity, a unique integration of light and shadow.\nSalvation lies in the discovery of the union of entire manifestation, overcoming all differences. Only the outer layer is different; else, one Brahmn pervades the entire universe, as Ramakrishna Paramhans explained. Our narrow thoughts, discriminatory attitude and incomplete understanding beget insurmountable limitedness in our approach to understanding reality. Kali constantly reminds us of this constriction. She stands with what folklore interprets as witches, those rejected by our social system.\n\n",
        "headline_1": "Kali stands with those rejected by social system",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/kali-stands-with-those-rejected-by-social-system/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-04-2025"
    },
    {
        "full_article": "A strong and resilient financial system is the bedrock on which the edifice of economic prosperity of a nation is built. Reserve Bank of India is the custodian of our financial system. It completed 90 years of its journey yesterday. The theme for our 90th year was ‘Stability, Trust and Growth’.It embodies all that RBI stands for.\nIt is apt we introspect on the past and how we can better discharge our mandate of ensuring monetary and financial stability; enhancing trust in the financial system; and supporting economic growth and improving the well-being of our people.\nRead full story on TOI+\n\n",
        "headline_1": "‘RBI: Stability, trust, growth’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/rbi-stability-trust-growth/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-04-2025"
    },
    {
        "full_article": "RSS’s Hosabale is muddying a clear position laid out by his boss Bhagwat. And SC needs to act as well  \nRSS senior Dattatreya Hosabale’s remark that organisation members, in personal capacity, can engage with movements to “reclaim” temples/land in Kashi and Mathura is in stark contrast to organisation chief Bhagwat’s call last Dec to not go looking for “temples beneath every mosque”. Of course, Hosabale added that RSS would not be aligned with any such movement, that members must “avoid societal discord”. Last Dec, Bhagwat was clear that it wasn’t “acceptable” that “every day” a new dispute was “being raked up”. Noting that people must live in harmony, he’d said “after Ram Mandir, some think they can become leaders of Hindus by raking up similar issues in new places…It cannot continue.” That India “runs per the Constitution.” To that end, Hosabale’s dual signalling is contradictory, not quite the “clarification” he sought it to be.\nThis makes it all the more important for Supreme Court to settle the related issue in court at the earliest. In 2021, SC allowed a challenge to the validity of the Places of Worship (Special Provisions) Act. The 1991 law was enacted to prevent conversion of religious places and maintain their “religious character” as it existed at Independence, with Ram Janmabhoomi-Babri Masjid dispute the sole exception. In its 2019 Ayodhya judgment, SC was emphatic about the legislation – that “Parliament mandated in no uncertain terms that history and its wrongs shall not be used…to oppress the present and the future.” In allowing that petition, SC unleashed a rash of attempts to “reclaim” shrines “invaded” and “encroached” upon by “fundamentalist invaders”. Violence in Sambhal spurred SC’s stay on “surveys” of such perceived disputes. SC must prioritise the case that’s really wasteful of court time. It’s dangerous to entertain grievances over acts, real or perceived, that are centuries old, and against which Parliament passed a legislation. The matter should be settled once and for all.  \n\n",
        "headline_1": "Don’t litigate history",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/dont-litigate-history/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-04-2025"
    },
    {
        "full_article": "On the games they play with daughters \nAll Indian moms wish they lived on 221B Baker Street. While resisting capes and pipes most of the time, they share with Sherlock his feverish stalking of suspect, which in many cases happens to be a daughter, their own. ‘Follow that girl,’ they say, jumping into a cab. Since daughters are onto their moms, mothers are soon waiting with a sarcastic smile at the wrong address.\nRecent news of even a supercop mommy tailing her child only reinforces this stereotype of hypervigilant parent. Many an evening is spent staring at the location daughter is currently at via iPhone and the two ticks that refuse to turn blue on the last text sent. A game mothers and daughters cheerily play in both public or private is the blame game. A game that peaks in fitting rooms of shopping malls where every outfit on each other is greeted with a brutal frankness. Needless to add, they buy all clothes the other disliked the most. ‘I did everything for you!’ hisses ma. ‘Who asked you to?’ snaps beti.\nIn phone calls that go on for hours, matriarchs take turns not only to lull each other to sleep with copious complaints about their baby girls, but also enlist, during a careful gap in wakefulness, the other’s support for mutual espionage. No father need apply for Watson’s position. Watsons are usually picked from friend circles or relatives, someone who will drop everything and pursue the suspect for you. Fathers are traditionally deemed useless owing to a specific kind of blindness when it comes to any female offspring they sired. While dads cannot see past their daughters’ stunning beauty and extraordinary IQ, mothers briskly vouch for the same daughters’ idiocy when it comes to men and attribute their plain Jane looks to paternal genes.\nDo all girls turn into their mothers? Which would mean carrying forward an intricate surveillance system inherited via acute maternal hysteria. ‘You are so like your mom’ is a comment that elicits awkward silences worldwide. If delivered by a love interest a lack of physical intimacy is sure to follow. But then mothers are routinely told by daughters how like their own mothers they are, leaving mothers secretly assured of how like them the said daughter will soon become. Because women who grew up lying to their mothers are not going to take what their daughters say as gospel truth.\n\n",
        "headline_1": "Mommy dearests",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/mommy-dearests/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-04-2025"
    },
    {
        "full_article": "Recent media reports suggest that the Public Administration Reform Commission of Bangladesh has proposed dividing the country into four administrative provinces as a means of decentralisation, aiming to establish a more efficient administrative system. However, it remains unclear whether this proposal also entails replacing the existing unitary parliamentary democracy with a federal system of governance. While federalism may be advantageous for vast nations such as the US, Russia, Indonesia, and India—where diverse social, cultural, and religious groups coexist—it is entirely unnecessary for a small and relatively homogeneous country like Bangladesh. A unitary parliamentary democracy remains the most suitable model for our governance.\nWhat Bangladesh truly requires is an effective and manageable administrative framework rather than an expansion of the flawed system we currently endure. The administrative structure we have inherited, dating back to colonial rule in 1793, is profoundly obsolete and continues to hinder national progress, exacerbating poverty and contributing to social, cultural, and political deterioration. No modern, civilised nation retains such an antiquated system, which bestows excessive power upon administrative officials—such as upazila nirbahi officers (UNOs), deputy commissioners (DCs), and divisional commissioners—who function almost as viceroys. While certain superficial modifications have been made, the core structure remains largely unchanged and retains its colonial character. A comprehensive and fundamental restructuring is long overdue.\nIt is imperative that we dismantle this antiquated framework and transfer all administrative authority to the union parishad (UP), thereby eliminating the district and upazila administrative tiers. The UP should be reconstituted as the primary governing authority at the local level. Urban and rural areas alike should be divided into UPs, with all members and the chairperson elected through a party-list proportional representation system (PRS), where feasible. The UP should function as a robust local legislative body, complemented by a fully autonomous administrative unit tasked with implementing and enforcing its decisions. This unit would oversee essential public services, including primary and secondary education, healthcare, infrastructure, law and order, social welfare, and employment opportunities for both men and women. In essence, the UP would bear direct responsibility for the well-being of every citizen. A more in-depth discussion of the advantages of a strengthened UP system warrants further exploration.\nBy abolishing the offices of the DCs and UNOs, we would effectively curtail excessive bureaucratic dominance, ensuring that governance is truly by the people and for the people. Rather than being subjected to distant bureaucratic rule, citizens would be served by locally accountable representatives within the UP.\nDividing Bangladesh into four provinces would necessitate an expansion of the bureaucracy at both the central and provincial levels, inevitably leading to increased administrative expenditures, corruption, nepotism, and favouritism. The long-term financial, social, and moral transformation of Bangladesh—particularly in rural areas—can only be achieved through a robust local government, not through the reinforcement of the colonial administrative \"iron frame.\" Advanced nations owe much of their stability and efficiency to the strength of their local governance structures. The US and UK, despite their imperfections, remain effective democracies largely due to the resilience of their local government systems.\nIntroducing a federal structure in Bangladesh would be catastrophic, not only due to the financial burden of sustaining multiple layers of government but also because of the nation's low levels of education and the deeply entrenched culture of political corruption. Such a transition would drive Bangladesh towards fragmentation, particularly given its sensitive geopolitical reality.\nTherefore, Bangladesh requires a strong central government wherein authority is concentrated within a single national framework—eschewing regional governments while ensuring that local UPs are empowered to function under national directives. Laws and governance must remain uniform across the nation and should be executed solely by the local government (UP) through its own independent administrative apparatus. The sooner we abolish the ineffective and corrupt DC and UNO offices, the sooner Bangladesh can progress towards a truly people-centric governance system, underpinned by an efficient and accountable UP administration.\nTayeb Husain is a retired college teacher and business executive based in Sweden.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Should Bangladesh be divided into four provinces?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/should-bangladesh-be-divided-four-provinces-3860651",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-04-2025"
    },
    {
        "full_article": "In the early 2000s, when I was studying at Jahangirnagar University, on many afternoons, I would board the university bus to Dhaka and get off at Shahbagh, heading straight to Amar Ekushey Boi Mela, the largest book fair in the country. But entering the fair wasn't always easy. Sometimes, the queue stretched all the way opposite the Faculty of Fine Arts.\nThe moment I would enter the fair, the scent of new books, the hustle of stall arrangements, and the sheer curiosity in the eyes of the visitors would engulf me. The fair was a grand festival, a place where writers, publishers, and readers were intertwined in an unspoken bond. Some waited eagerly for their favourite author's latest book, while others wandered in search of old classics. The air buzzed with literary discussions—\"How are this year's books?\"; \"Which publisher is leading the sales?\"; or \"Has your favourite writer's new novel been released yet?\"\nThe fair also became a meeting place for familiar faces—be it authors, poets, literary enthusiasts or long-lost friends. As the afternoon faded into evening, the atmosphere grew even more magical. The sky turned crimson, the fairgrounds echoed with footsteps, book launches took place on the main stage, and poetry reading sessions would often unfold nearby. Many strolled around with book-filled bags, savouring the scent of freshly printed pages as they carefully selected their next read. Somewhere in a quiet corner, a reader flipped through pages of poetry, while another stood at a stall scanning the shelves for a cherished writer's new release. Some simply gathered with friends and engaged in deep conversations about literature and life.\nThe fair offered something rare: the chance for writers and readers to connect directly. The authors, whose words captivated readers all year long, were now present in person. Book signings, launch events, and lively discussions created a space for an intimate literary exchange. Writers themselves often admitted that no other event allowed them to experience the love of their readers so closely.\nFor us, the book fair was not just an event; it was a reflection of our love for Bangla language and literature, an emotion, a culture. In the month of February—so deeply tied to our history of linguistic sacrifice—the fair symbolised a deep-rooted connection to our heritage. The entire event carried an essence that made us feel as though we weren't just there to buy books; we were there to embrace our language, to immerse ourselves in literature.\nBack in my university days, I didn't have the money to buy books. I would circle the fairgrounds a few times before heading back to campus. But before leaving, I would always stop by the north gate of Baitul Mukarram, where a vast street-side book market thrived. If one searched diligently, treasures could be found—classic books priced as low as Tk 10.\nYears passed. Eventually, I found myself returning to the fair every year, now with a bag filled with books. I would share my excitement on social media, posting pictures of my new finds. The books I collected in February became my reading material for the rest of the year. No matter where my work took me, I always slipped a book into my bag. I was like an ant gathering food for the year—except I was gathering stories, ideas, and inspiration.\nFor publishers, too, the fair was a beacon of opportunity. It provided a platform for new authors to see their dreams materialise, allowing publishers to gauge the pulse of readers. Many publishers relied on this event to make a profit.\nBut then, this year, I came across a troubling report about the 2025 fair, published by a newspaper called Bonik Barta. It revealed that book sales this year had been the lowest in recent memory. Even major publishing houses suffered a drastic decline. Prothoma Prokashon saw a 60 percent drop in sales. Panjeree Publications, which sold Tk 95 lakh worth of books last year, managed only Tk 65 lakh this year. Adarsha Prokashoni's sales fell from Tk 60 lakh to Tk 30 lakh, while The University Press Limited (UPL) also experienced a steep decline from Tk 60 lakh to Tk 30 lakh. Batighar barely maintained its figures, while Adorn Publications, Genius Publications, Kakoli Prokashoni, Salahuddin Boighar, and others saw their sales cut in half. Even the Bangla Academy, which had sold books worth Tk 1.36 crore last year, recorded a sharp fall to Tk 61 lakh.\nThis decline was shocking, especially since expectations had been high following the fall of a long-oppressive regime in August last year. The assumption was that, with renewed enthusiasm, people would flock to the fair and book sales would surge. But instead, both footfall and sales plummeted.\nWhy did this happen? Some attributed it to a drop in book releases this year. Others pointed to the rise of online book purchases—people now trusted digital platforms, finding them more convenient and reliable. Then, there was the growing issue of book piracy. Illegal websites continued to upload PDFs of new releases, making it easier for readers to access books for free. The dominance of social media and short-form content on platforms like YouTube, Facebook, and Instagram further contributed to declining reading habits. The distractions were endless, and books, it seemed, were losing their place in people's lives.\nBut these weren't new problems. These trends had been building for years. So why did sales nosedive so drastically this year?\nPerhaps the biggest reason was that this year's fair had been reduced to a general marketplace, losing its literary essence. Reports circulated of stalls selling sarees, bangles, cosmetics, and even street food inside the fairgrounds. The fair was transformed into a bazaar rather than a literary sanctuary.\nPolitical controversies further alienated readers. Early in the fair, an image of the ousted prime minister's being used in a dustbin went viral. This incident led many supporters of her political party to boycott the fair. Meanwhile, the fairgrounds saw frequent disruptions by mobs. Banning of certain books and harassment of a publisher sent another chilling message.[4]  Controversies surrounding the Bangla Academy Literary Awards—where recipients were announced and then abruptly removed—added to the chaos.\nEven the vibrant children's section, once a highlight of the fair, felt underwhelming this year. Previously, kids could immerse themselves in colourful books, comics, and stories that nurtured their love for reading. But that presence was noticeably diminished.\nThe Amar Ekushey Boi Mela is deeply rooted in our history, born to commemorate the sacrifices of the 1952 Language Movement. What began in 1972 as a small initiative by the Bangla Academy gradually evolved into a grand literary festival. Over the years, it expanded beyond the academy grounds into the vast open spaces of Suhrawardy Udyan. It became a place where thousands of readers gathered, their hands filled with book lists, their hearts filled with dreams.\nThe book fair is not merely about buying books—it is about ideas, perspectives, and a love for language. And as long as Bangalees exist, this fair must endure.\nBut to ensure its survival, we must keep it above controversy. At a time when books are already struggling for relevance, we cannot afford to let the one event that still inspires readers slip away. If interest in this fair fade, the loss will be irreparable.\nMohammed Norul Alam Raju is a researcher and development activist pursuing higher studies in development policy and management in Belgium. He can be contacted at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Can our month-long book fair survive the test of time?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/can-our-month-long-book-fair-survive-the-test-time-3860386",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-04-2025"
    },
    {
        "full_article": "As Ramadan draws to a close, let us carry forward the valuable lessons it instils in us. As a nation, we should strive to be more charitable, moderate, and grateful—virtues that Ramadan inspires. These values should not be confined to the month of fasting but should guide our actions throughout the year, fostering a more compassionate and just society. Let us hope that, as the month of Ramadan nears its end, we will have rekindled these values within ourselves and, indeed, passed them on to others.\nAt the same time, the joyous occasion of Eid-ul-Fitr is fast approaching. In anticipation of celebrating with their loved ones, tens of thousands of people have already begun leaving Dhaka by train, bus, and launch. Reports indicate that this year's Eid journey has been relatively smoother for most travellers, thanks to the strategic measures implemented by the authorities. The introduction of special train and bus services, along with enhanced traffic management, has helped ease congestion. We commend the government for its efforts to improve the transport sector and hope that such measures continue to be refined and expanded in the future.\nHowever, despite these improvements, there have been reports of passengers being overcharged in certain areas. We urge the authorities to remain vigilant and take strict action against those exploiting travellers during this festive season. Additionally, with a significant exodus from major cities—particularly Dhaka—law enforcement agencies must remain extra cautious to ensure that law and order are maintained. The risk of accidents, extortion, and theft increases during this period, and it is crucial for security personnel to remain on high alert on highways, in public transport hubs, and across both urban and rural areas.\nWe also call on citizens to prioritise their safety and security during this time. Travellers should be cautious while commuting and follow traffic and safety guidelines. Moreover, as we embrace the spirit of Eid, let us extend a helping hand to those less fortunate. Many underprivileged individuals struggle to partake in the celebrations due to financial constraints. We urge individuals, businesses, and organisations to come forward with donations, food assistance, and support so that the joy of Eid is shared by all, regardless of economic status.\nEid-ul-Fitr is a time of unity, compassion, and generosity. Let us ensure that these values remain at the core of our actions—not just during Eid, but throughout the year—so that Bangladesh continues to progress as a nation built on empathy, harmony, and social responsibility. We wish everyone a safe and joyous Eid.\n",
        "headline_1": "Wishing all a safe and joyous Eid",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/wishing-all-safe-and-joyous-eid-3860341",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-04-2025"
    }
]