[
    {
        "full_article": "Jammu and Kashmir bore the brunt of Pakistan’s response to Operation Sindoor, and Union Home Minister Amit Shah rightly focused on both security and development during his visit to Poonch, where residential areas were hit by shelling from across the border. A comprehensive relief package is planned alongside the construction of more underground shelters for civilians. The J&K government is still in the process of assessing damages, but Poonch was by far the worst-affected district. A preliminary report submitted by a committee set up by the BJP to the Ministry of Home Affairs identified 1,500 houses — 690 in Poonch and 534 in Uri — that were damaged in the indiscriminate shelling. At least 18 civilians — 14 in Poonch alone — lost their lives. Pakistani shelling hit towns in Poonch, Baramulla, Kupwara and Rajouri, and the damage to civilian infrastructure was considerable. Mr. Shah on Friday visited the affected regions, expressed solidarity with the people, and handed out job appointment letters to the kin of those who lost their lives. Earlier, the Leader of the Opposition, Rahul Gandhi, and representatives of the Trinamool Congress visited the victims.These border residents felt heard, their sense of fear dissipated to some extent, and their morale boosted by these visits. The Indian Army’s statement on the India and Pakistan ceasefire “not having an expiry date” is reassuring for the border residents. Life is limping back to normalcy with residents returning to their homes, many of them shattered by the shelling. The J&K government is struggling to meet the demands of the affected population. This was evident from the relief amount approved up to ₹1.2 lakh to fully damaged houses. The affected and displaced residents described it as “insufficient” for them to return to their once-concrete and multi-storey houses. Against this backdrop, Mr. Shah’s promise of a relief package is a ray of hope. Around 9,500 bunkers — 8,000 in the Jammu division and 1,500 in the Kashmir Valley — have been built by the Centre so far. However, there is a growing demand for individual bunkers in sparsely located populations in border areas of J&K, especially in the Kashmir Valley, to ensure civilians manage to shift to safer locations immediately in case of shelling by Pakistan. The Centre and the elected government in J&K should work in tandem to help border residents who are in distress. Published - May 31, 2025 01:08 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Jammu and Kashmir\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025",
        "headline_1": "Rebuilding J&K: On Amit Shah’s visit",
        "headline_2": "Civilians need physical and economic security to recover from the shelling",
        "link": "https://www.thehindu.com/opinion/editorial/rebuilding-jk-on-amit-shahs-visit/article69638862.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-06-2025"
    },
    {
        "full_article": "India’s factory output performance measured monthly by the Index of Industrial Production (IIP) and released by the Ministry of Statistics and Program Implementation (MoSPI) slowed to an eight-month low of 2.7% in April, at the start of fiscal 2026. It also marked a steep decline, almost halving from last April’s 5.2% growth. This correlates with the monthly gauge of the eight core sectors by the Ministry of Commerce and Industry, which posted a 0.5% growth in April, also an eight-month low. More significantly, it is a steep decline from last April’s 6.9%. The eight core sectors make up about 40% of the weight of items included in the IIP. This comes on the back of a 4% growth in industrial output for the last fiscal, which was the lowest in the past four years. Of particular concern is the contraction in mining by 0.2%, the first since August 2024. While the absolute value of mining exports has risen in the past decade from $25 billion in FY15 to $42 billion in FY25, its share in exports has fallen from 8.1% to 5.1%. This still constitutes a not-so-insignificant share in India’s overall goods exports at a time of great trade volatility. However, both manufacturing and power production also slowed to 3.4% (4.2%) and 1.1% (10.2%), respectively, in April.While trade and tariff-related uncertainties are most likely to have impacted goods output, the continuing contraction in consumer non-durables’ output for the third consecutive month suggests persistently low rural consumption, as essentials such as food make up a significant portion of consumer non-durables. This is a clear indication that despite retail inflation hitting an almost 6-year low at 3.16% in April, it has not translated into higher spending power for rural communities, where consumer non-durables have the most demand. Food prices contracted for the sixth straight month to 2.14%, which led to below MSP rates for most staples at mandis. The government must focus on raising rural incomes by implementing MSPs for farm produce more systematically. This would aid in increasing rural consumption. However, a surge in capital goods output to 20.3% in April, albeit from a low base, indicates confidence in the domestic economy as investors continue with their plans to diversify exports, attempting to rely less on the U.S. With trade-related sectors expected to continue to stay volatile in the near-term, the Centre must push the private sector to increase capital expenditure at home. This will increase incomes, and aid in raising consumption demand. Export-oriented sectors must also aim to ring-fence themselves from tariff, price and supply chain shocks by ensuring a robust domestic presence, while also diversifying outside the traditional export regions of the U.S. and the EU. Published - May 31, 2025 01:05 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        economic indicator",
        "headline_1": "Steep decline: On the Index of Industrial Production",
        "headline_2": "Rural consumption remains poor despite the lowering of inflation",
        "link": "https://www.thehindu.com/opinion/editorial/steep-decline-on-the-index-of-industrial-production/article69638881.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-06-2025"
    },
    {
        "full_article": "India’s pushback to Pakistan’s provocation in Pahalgam is an inflection point in regional geopolitics. There are big-picture lessons that must be absorbed to reorient Indian statecraft in a rapidly changing international and regional setting.\nThe Sino-Pakistan axis has acquired an operational reality that is difficult to ignore and not straightforward to counter. Most strategists recognise that India’s conventional superiority over Pakistan means little in the context of controlled limited conflicts that are likely to occur under the nuclear shadow. For all practical purposes, Pakistan is a near-peer military competitor. This is now further complicated by the presence of China’s military industrial complex that can selectively tilt the scales in Pakistan’s favour. China’s PLA, whose primary mission is to deny access to and potentially defeat the US in the Taiwan Straits, has spent the past decade modernising its forces for such a scenario. The focus has been on developing capabilities such as modern sensors, electronic intelligence satellites, electronic warfare, long range air-to-air missiles, and advanced tactical-combat aircraft. It is apparent that some of these capabilities have made their way to the Pakistan military.\n\nBuild on thaw: While the Sino-Pak axis is worrying, there is room to wean China away from Pakistan\nChina can buttress Pakistan’s conventional power to keep pace and perhaps even surpass India in select areas in the future. What works to India’s advantage is that unlike US and NATO hardware that come with well-known caveats and geopolitical risks, our ‘no-strings attached’ partnership with Russia’s advanced military -industrial complex allows the Indian military to integrate its growing indigenous capacities with select high-technology systems to maintain a qualitative edge.\nThis being said, it is futile for India to engage in an all-out arms race (in essence, with China) or frantically build up conventional power. Strategic nuclear and conventional deterrence for major contingencies is robust and expected to strengthen over time. Remember, the main challenge is countering asymmetric warfare with the new doctrine of assured and calibrated cost imposition on Pakistan. The means can vary over time — from the conventional to the sub-conventional to non-traditional areas like water security. There are obvious limits to China’s ability to protect Pakistan from the blowback of its asymmetric warfare.\nThere are larger questions that Indian policymakers can no longer brush under the carpet. Why did the Sino-Pak axis acquire such momentum in recent years? And, should India do anything to reshape Beijing’s calculations in the subcontinent?\nFirst, there is no doubt that India’s declared China-centric alignment with the US over the past decade was the lightning rod for Beijing to deepen ties with Rawalpindi much beyond its traditional partnership model. But the US had no desire to open a geopolitical front with China in the subcontinent and did little to shore up India’s regional position. The US was primarily interested in drawing India into an extra-regional maritime role to support its security goals in the Western Pacific.\nQuite extraordinarily then, the Chinese counter to India’s bold balance of power move with the US not only went unchallenged in the subcontinent, it actually led to a tacit convergence between Washington and Beijing on upholding Pakistan’s basic position in the regional order and the primacy of the Pakistan army at home. Nothing demonstrated this stark geopolitical reality to Delhi more than the recent crisis.\nCan Indian statecraft arrest the deterioration in the regional chessboard that is partly the result of miscalculation from its own geostrategies? Beijing’s primary geopolitical threats emanate from its eastern seaboard and will only grow over time. There is room to wean China away from Pakistan and bring Beijing’s regional policy back towards a balance that is acceptable to Delhi. For this to occur, India must build on the 2024 thaw reached between the two leaderships and explore the possibility of a framework to normalise India-China relations.\nAs for the US, the normal will be different with or without Trump. There is no scope for a balance-of-power play with the US in the subcontinent.\nIt was self-deception to imagine India could simply ride American power to emerge as South Asia’s leading power. That outcome will have to be earned the way all regional and great powers acquired their material and normative strength — through broadening the domestic industrial, technological and human capital base of the Indian economy while intelligently leveraging the international environment. There is no other way in our multipolar age.\nIndia doesn’t have to get bogged down in a low-level game with the Pakistan army. Nor should India swing into a proxy crusader against a rising China whose sights are set on countering the US in the Western Pacific. This crisis is an opportunity to craft a sophisticated grand strategy for a multipolar world. Only geopolitical incompetence can disrupt the India story from its long-range goals.\n\n",
        "headline_1": "US, Pak, China: The post-Sindoor world calls for a strategic reset",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/us-pak-china-the-post-sindoor-world-calls-for-a-strategic-reset/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-06-2025"
    },
    {
        "full_article": "One advantage/disadvantage of being old is that I lived through what is history to so many others. President Trump adores William McKinley, the 25th US president, for his tariffs, but at 78, he is way too young to have lived behind a properly high tariff wall. I, on the other hand, lived in the India of the 1970s, when we had managed to kill almost all international trade through a combination of tariffs and other rules for importing (non-tariff barriers in trade parlance).\nI mostly experienced trade barriers through the important lens of chocolate. India, for reasons I do not claim to understand, did not grow much cocoa in those days, despite having many areas that seem suitable for that crop based on where else it grows. So, all the cocoa was imported and the exorbitant duties made it expensive. To keep the chocolate affordable for ordinary middle-class kids like me, Cadbury’s used minimal amounts of cocoa.\n\nIllustration credit: Cheyenne Olivier (France)\nThe net result was something milky and intensely sweet, not unlike most Indian confections, but chocolate mostly only in name. The trouble was that I had tasted the real deal, courtesy some of my parents’ kind friends who either lived abroad or had gone on a visit. And it tasted very different — there was a bitterness and depth to them that was unmistakable.\nOn our occasional trip to Kolkata’s crumbling ‘New Market’, or to movie theaters in its vicinity, I would notice men in tight pants who were clearly trying to attract my mother’s attention (and failing). Fairly soon, I figured out that they were selling various smuggled items, mostly watches, perfumes and CHOCOLATE. I could see from the print on the wrapper that though it said Cadbury’s, this was a different breed. My instincts told me that my mother would not take kindly to the idea of buying contraband Cadbury’s, but it was hard to shake off the desire to try it out.\nAs I grew into teenage, my understanding of the gains from trade became less one-dimensional. For one, I was more aware of how people around me dressed, and it became clear that there were jeans and jeans. Those that flopped a bit, like mine, and the ones exuded a steely foreign firmness. I remember admiring the new pair that a neighbour was wearing and his telling me, very proudly, “impotted”, which to me sounded like impotent. I started giggling, at which point he got very huffy and commented on my apparent tendency to be jealous, which to be fair, I was a bit. All that has changed now. According to some industry estimates, India is the third largest exporter of denim in the world. Unfortunately, we still don’t have our global brand of jeans, but there is no doubt about the quality of the denim. For one, I am biased but I think my friend Suket Dhir makes some of the most stylish denim products I see anywhere.\nThere are two more or less standard theories of what changed. One that we heard a lot in India before the opening of the economy in 1991 is that we need the pressure from imports to force our producers to get to global quality. My colleague David Atkins, with Amit Khandelwal from Columbia University and Adam Osman from the University of Illinois, participated in a randomised experiment in which some carpet manufacturers in Egypt that had previously produced only for the domestic market, were connected to potential importers abroad. It took some time for them to get going, but eventually, they started exporting and making more money, and perhaps more interestingly, weaving higher-quality carpets in the same amount of time. The authors called this learning-by-exporting.\nThe alternative view is sometimes described, confusingly, as learning-by-doing. It is better described as learning-by-not-importing. The idea is that it takes some time to learn how to produce quality, and if you are new to the business, there is an apprenticeship period where the competition from abroad might make it impossible to sell profitably. Knowing that they are in for a prolonged period of loss before things turn around, firms may not take on certain products that would otherwise be natural for their country to produce.\nThis argues for temporarily shielding domestic firms from foreign competition to allow them to find their feet. The idea goes back at least to Alexander Hamilton, author of the Federalist papers and now a subject of a great musical, and is often referred to as the “infant industry argument”.\nA recent paper in the American Economic Review by Reka Juhasz finds support for this theory in France during the Napoleonic wars. Before the war, France was slow to adopt mechanised cotton spinning technology developed in Britain. Instead, they imported British cotton yarn. A war-time blockade of British manufacturers changed that, especially in the north of France. This was where trade was particularly effectively blocked, unlike in the south, where exports from Britain continued to seep in. Juhasz shows that this difference in access to British cotton leads to an interesting reversal. The south, the part of France which had more mechanised spinning before the war, fell behind the north during the blockade. After the war ended and trade resumed, the north kept its lead and managed to compete successfully with the cotton from across the Channel. The infant industry grew up. It didn’t need protection anymore.\nThe timing of take-off in the Indian denim industry is consistent with a learning-by-exporting view, since it mostly happened after liberalisation in 1991. However, given that the industry actually started in the 1980s behind the tariff wall, it is possible to argue that the trade barriers helped the infant industry to get prepared to meet global competition. The take-off still happened after the economy opened up, perhaps because importing the machines and other inputs for making denim became much easier after 1991.\nI remember working with locally available inputs in the 1970s, the goal in my case being to replicate the Black Forest cake that I had loved at the then-famous Kolkata restaurant called Skyroom. I had my prized can of Himachali cherries for the filling, but the chocolate batter made from several slabs of domestic chocolate refused to look anything like the rich brown viscous liquid that they showed in the photo, and I eventually gave up. Perhaps it was a bit the same for the denim-makers.\nWhether it is helping the exporters or stopping the imports, the intervention is meant to be temporary, just long enough that the industry can get going. The traditional position of economists is that if a country needs permanent refuge behind a high tariff wall to keep a particular sector going, it is probably better to shut down and focus on whatever the country is good at. Exports of successful products can pay for the imports of the ones that don’t do well.\nPoliticians, including President Trump, often have a very different view on this. The problem is that trade has winners and losers, and they are not the same people. In the US, the big winners are relatively well-educated people who live on the coast; the losers are less educated residents of the middle of the country. The winners win more than the losers lose, economists would say, so why not tax the former to compensate the latter? The catch is that the US, unlike many European countries, has no tradition of large-scale redistribution through taxes and transfers. Instead, Trump wants to permanently block the imports of a wide range of products in the hope that it “reshores” the industries that were lost due to trade and brings back the associated jobs to the mid-Western workers.\nAt one level, this is not very different from what we do in India to protect the livelihoods of farmers: we have essentially permanent tariffs of 35% or more on things like corn, which is what annoys the US. At another level, however, it is vastly more audacious. We are merely trying to keep the farmers in business: Trump wants firms to start new businesses, businesses that have been gone for a generation or more, and create jobs. They will need fresh, large investments and newly trained workers. Buyers will need to be willing to pay the premium and swallow the lowered quality, like we did in India in my youth. Retailers will need to not look for alternatives, if not from China, from Brazil or Rwanda. Managers will need to hire workers rather than deploy robots to do all the work. The investors will need to believe that this new regime will last, and they won’t fall victim to some new deal that the President (or the next President) likes better.\nThe reshoring probably won’t happen. But in its name, the world economy is being upended; no one knows where it will land. In the meanwhile, I remain on the lookout for shifty men on Boston streets selling illicit bags of the wonderful Chinese black walnuts and sweet salty candied plums.\nThis is part of a monthly column by Nobel-winning economist Abhijit Banerjee\n\n",
        "headline_1": "Trade wars and chocolate bars, what India of the 1970s can teach Trump",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/tasting-economics/trade-wars-and-chocolate-bars-what-india-of-the-1970s-can-teach-trump/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-06-2025"
    },
    {
        "full_article": "Several developments have taken place over the last two weeks concerning Centre-state relations. One, Tamil Nadu sued the Union govt in the Supreme Court for withholding over Rs 2,000 crore under the Samagra Shiksha Scheme. It claimed the Centre was surreptitiously linking the implementation of the three-language formula to the disbursement of education funds. Two, the NITI Aayog chaired its tenth governing council meeting but three Opposition CMs decided to give it a miss. In the absence of the Planning Commission and the complete neglect of the Inter-State Council, this is the only platform where all the CMs, the PM, and Union ministers meet each other.\nThree, even inter-state language wars are escalating as another kerfuffle in Bengaluru over a bank manager refusing to speak Kannada revealed. This time, several political leaders got involved. On social media, all war-related national integration was quickly replaced by the generic north-south flame wars.\n\nCheque, mate? TN CM MK Stalin with Modi. The state’s decision to sue the Union will have broader implications\nWhile the PM stressed the idea of Team India to realise the goal of Viksit Bharat 2047, these instances highlight yet again that cooperative federalism is merely a nice-sounding idea thus far. What we need are structures in which real cooperation can happen. Here are four such ideas that could be worth considering.\n1 | An ‘umpire’ for bargaining\nThis idea comes from economist Dr M Govinda Rao. He writes in his book, Studies in Indian Public Finance, that India lacks an institution that can act as a credible umpire between various states (horizontal bargaining), and between the states and Centre on the other (vertical bargaining).\nThe National Development Council, created for this purpose, is defunct. The Inter-State Council hasn’t met for the last eight years. The Rajya Sabha no longer functions as the council of states and Union finance commissions are dissolved after making their recommendations. The NITI Aayog is yet to establish itself as an institution that speaks for the states and the Union equally. The GST Council is perhaps the only remaining bargaining and negotiation platform in our federal structure, but its mandate is limited to sharing taxes on consumption.\nThe result is that we have no functional institution to truly champion cooperative federalism. One model to consider is Vijay Kelkar’s idea of a NITI Aayog 2.0, one which has fiscal powers to allocate conditional funds to states for long-term transformational goals. But there’s a risk that such powers could transform NITI Aayog 2.0 into a Planning Commission 2.0, restricting the states’ fiscal autonomy. Thus, we need a debate to construct a new institution for cooperative federalism.\n2 | More funds with less strings\nAll federalism debates almost exclusively focus on just one issue: horizontal devolution, i.e. the formula used for sharing resources between states. It also gets inaccurately framed as a ‘north vs south’ debate — how the taxes collected from the south are frittered away in the north. But the problem really lies in vertical devolution i.e. how the tax resources are split between the Union govt and all states as a whole. If the Union govt keeps less money to itself, all states stand to gain together.\nThis is why the TN petition has broader implications beyond who wins this case. It is an opportunity to increase vertical devolution to states. As long as there are centrally sponsored schemes, which are designed by Union ministries and only implemented by states, the Centre is within its rights to change the scheme’s design. States must demand that grand schemes falling under the state and concurrent lists be scrapped and that they receive untied funds instead. This way, they an decide their priorities while the Union can focus on a select few centrally sponsored schemes, mainly focused on states that need its help. This point was raised by the TN CM at the NITI Aayog meet as well.\n3 | All-party delegations to states\nAs the recurring language wars illustrate, trust levels between states are dipping. Lok Sabha seat reapportionment stemming from delimitation; charges of unfair fiscal redistribution; and the insider-outsider debates sparked by local reservations will only worsen the situation. Like India’s all-party delegations meant for global outreach after the Pahalgam attack, we need a domestic mechanism where states send delegations to other states explaining their visions for development and growth. Such efforts could perhaps bridge the gap.\n4 | Union-state sub-groups\nAnother interesting idea comes from Andhra CM Chandrababu Naidu, who proposed three sub-groups at NITI Aayog on GDP growth, population management, and leveraging artificial intelligence. While these themes are not set in stone, this approach could allow states to partner with each other and with the Centre.\nCreating a Team India ain’t easy, but it could happen with the right systems in place.\n\n",
        "headline_1": "What TN case tells us about the need to ease Centre-state friction",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/what-tn-case-tells-us-about-the-need-to-ease-centre-state-friction/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-06-2025"
    },
    {
        "full_article": "David vs Goliath is a favoured metaphor for depicting rivalries. In the Indo-Pak scenario too, the metaphor fits perfectly – one of the Indian David facing off against the Pakistani Goliath. Counterintuitive framing? Not really. The basic datum is as follows. India has a lot more to lose – pace of growth, migration of nearly 1bn Indians to upper middle-income status, more opportunities in exciting areas of AI, semiconductors, as well as old economy areas like manufacturing. In comparison, Pakistan is an economic basket case. Opportunity costs for India are far higher. Ergo, the room for manoeuvre and amount of capability brought to bear are a lot less for India than for Pakistan in a conflict scenario. In short, when it comes to a hot conflict, it’s the Indian David facing off against the Pakistani Goliath.\nIn effect, this praxis of David and Goliath informs India’s Pak policy more than anything else. As the David, India’s not trying big, heroic outcomes. On the contrary, the overarching aim is modest – create a security umbrella under which India’s progress can continue uninterrupted. In that pursuit, the Indian state’s responses, including the more overt versions in the last decade, have been game theoretic. Change the decision calculus to force Pakistan to recalibrate its own boards. Process of recalibration hopefully buys India longer periods free of dramatic, large terror attacks.\nRead full story on TOI+\n\n",
        "headline_1": "Why India doesn’t need a war to counter Pakistan",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/why-india-doesnt-need-a-war-to-counter-pakistan/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-06-2025"
    },
    {
        "full_article": "The ordeals faced by many Dhaka dwellers on Thursday and Friday, who experienced heavy rainfall due to a depression at the Bay, give an idea of the suffering we may face in the coming days. Many commuters were stuck in traffic jams throughout the city for hours, while others had to navigate the precarious roads that became waterlogged. Continuous rain submerged many areas such as Shantinagar, Mirpur, Shewrapara, Green Road, Nilkhet and parts of Old Dhaka.\nDhaka's horrendously poor drainage system has continued to be a bane for its dwellers despite the ambitious Tk 262 crore investment by the two city corporations over four years (till 2024) to solve the waterlogging problem. The project included constructing 334.19 km of drainage infrastructure, including culverts and drains.\nBut the main reason for Dhaka to experience such debilitating waterlogging is the indiscriminate filling of water bodies and canals, a result of unplanned urbanisation and corruption of authorities responsible for preventing encroachment. Flood flow zones have been filled up, so there is nowhere the water can be held during heavy rains. A report published by this daily cited a study that revealed Dhaka has lost 3,440 acres of its designated flood flow zones, retention areas, and water bodies. Although some canals have been cleaned recently, the problem still persists as tertiary drains connected to them have not been upgraded.\nExperts have stressed that the WASA 2015 Drainage Master Plan needs to be revised in keeping with the changing rain patterns caused by climate change. We urge the authorities to prioritise the cleaning and desilting of canals and other water bodies and making sure that whatever flood flow zones remain are free from encroachment. The drainage network also needs to be expanded to cover all areas. Both city corporations must devote their efforts to carry out these cleaning drives.\nFuture infrastructure development, moreover, must be more resilient and should include elevated roads, flood barriers, and efficient drainage systems. All urban development in the future must be in alignment with flood risk management. The authorities must also create awareness among the public about not littering water bodies. Fines should be introduced for littering and blocking drains and canals. As residents of the city, we also have a responsibility to keep it clean and free from waterlogging.\n",
        "headline_1": "Dhaka still not prepared for the rains",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/dhaka-still-not-prepared-the-rains-3907986",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-06-2025"
    },
    {
        "full_article": "As in many other sectors in Bangladesh, it often takes little time to undertake projects to build or expand infrastructure in the health sector, but properly staffing these facilities can take years, sometimes even a decade or so. The Barguna General Hospital, upgraded from a 100-bed to a 250-bed facility in 2013, has been suffering from this ailment—a chronic manpower shortage lasting 12 years.\nAccording to a report, nearly half of the 233 sanctioned posts at the hospital—including doctors, consultants, nurses, medical officers, and mortuary staff—remain vacant. Most of the unfilled positions are among medical officers, doctors, and senior consultants. Alarmingly, there is only one senior consultant—an anaesthesiologist—despite there being 10 sanctioned posts. This means departments such as cardiology, orthopaedics, gynaecology, medicine, paediatrics, pathology, surgery, ENT, and ophthalmology have no senior consultants. Ironically, patients usually require a specialist's consultation for issues involving the heart, bones, reproductive health, and other critical areas before they ever need an anaesthesiologist.\nThere is also a dire shortage of medical officers (with 22 out of 29 positions vacant) and doctors (with 39 out of 55 vacant). Even basic medical consultation has become difficult to obtain, and patients are frequently referred to hospitals in Barishal or Dhaka. What, then, is the point of expanding a hospital if it cannot serve the local community? We have consistently emphasised the importance of decentralising healthcare to make it more accessible and affordable. But how can this be achieved in the absence of sufficient recruitments, or when medical professionals avoid serving in towns and rural areas? While it is true that such locations often lack the amenities found in major cities, these areas will never develop if essential public services, like healthcare, are not provided. The lack of access to proper, timely care often pushes patients towards private clinics, where they must pay exorbitant fees.\nBangladesh already has one of the lowest doctor-to-patient ratios in South Asia, and the uneven distribution of medical professionals worsens the situation for those living outside cities. The health sector also suffers from chronic underfunding and underutilisation of allocated resources. Against this backdrop, the need for a comprehensive overhaul of public healthcare cannot be stressed enough. Achieving this will require more than just government policy or political will; it demands the sincerity and commitment of medical professionals, too. Those who take the Hippocratic Oath must also rise to the occasion.\n",
        "headline_1": "Staff shortages in hospitals are worsening the healthcare crisis",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/staff-shortages-hospitals-are-worsening-the-healthcare-crisis-3907836",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-06-2025"
    },
    {
        "full_article": "Social psychologists refer to this phenomenon as the \"bystander effect.\" In a moment of crisis, a victim is likely to get less support in the presence of a group of individuals or witnesses. The bystanders simply assume that someone else in the crowd will intervene. This diffusion of responsibility reinforces mutual denial, allowing the perpetrator to thrive.\nI was trying to make sense of the endless pixelated images on social media where young men are seen carrying machetes in the open, snatching mobiles or personal goods from cars or rickshaws. They prowl like hyenas in the city jungle. Yet, there is no visible intervention from the bystanders, and little follow-up by police. Our urban experiences have taught us that interventions may prove to be costly and are unlikely to change anything. This reflects in our defence mechanism: while I can risk my life to apprehend one of the perpetrators, they will likely return to the streets due to legal loopholes. Therefore, it's safer to share my dashcam footage, video recorded on mobile phones, or CCTV clips than to act.\nThe collective numbness contradicts the spirit with which the masses stormed the streets in July last year. Now, we pray: dear God, let me not be the next victim, the one to bleed or die in public or lose my gadgets that store my privacy. Our silent prayers take the form of a hapless sigh or an emotional social media post or comment. We scroll, hoping our digital virality will conjure some police action.\n\nOur moral muscle has atrophied. We are back to a Darwinian maxim: survival of the fittest. The foundation of civility, the social contract of solidarity, is in danger of disappearing. With survival as the dominant civic impulse, democracy and its paraphernalia are at risk. Law and Order is a press conference that premiered at 3am at the home minister's theatre. The number of crimes is on the rise. Even official figures by the police depict a dismal scenario. The dull stats and numbers get some human faces when video footage becomes available. Nothing in the country moves without public outrage. Law enforcement agencies don't react unless a protest is significant enough to capture the government's attention. The actors who have entered the political stage after the fall of the Awami League regime are reading from the old script. The government occasionally apprehends a few low-level criminals, neglecting the underlying causes of chaos. Even the much-hyped Operation Devil Hunt brought little relief to public fear.\nSome blame the rise in crimes on the 700 prisoners out of the 2,200 who escaped on and after August 5. Officials also accuse the fallen regime of conspiring to harm the reputation of the interim government. But when organised crimes occur in broad daylight, we need to question the impunity with which these criminals operate. Claiming that organised crime networks are taking advantage of temporary fragility in governance is an argument without substance. The government has had enough time to address the political vacuum that reportedly weakened institutional checks. It is the job of the authority to uplift the morale of its forces and give them a clear directive on deliverables.\nWe have already seen how some high-density urban corridors in Mohammadpur, Mirpur, Jatrabari, Farmgate, Gulshan, and Khilgaon have become crime hotspots. Attacks frequently target the blind spots under the Hanif Flyover, metro stations, and the elevated expressway. The pattern of attack in locations that act as choke points in the city's mobility grid signals the operational control of the criminals. They are deliberately targeting places with lower police visibility, crowd fluidity, or symbolic value. Most of these muggers and attackers are in their teens and early 20s. Many of them were probably protected earlier by some Awami League bosses. In the absence of patrons, these muggers and attackers have now opportunistically switched their allegiance. Their motivations are more economic than ideological.\n\nThe use of narcotic substances is another issue. The porous border allows drugs to become easily accessible. With law enforcement agencies focused on mitigating bigger political problems, drug culture among the youth gangs is on the rise. Reports suggest that these gangs are even using police as their agents. Several reported incidents have implicated law enforcement agencies or former uniformed men in robberies, muggings, and kidnappings. Corrupt police officials have become a part of the problem.\nEven when victims go to report muggings or thefts, police seem more worried about the spike in their reported statistics. Social media posts become substitutes for formal complaints. It is a shame that the police only act when a footage goes viral or when the media speaks out. Those running the country should realise that their inaction undermines the state's moral legitimacy.\nIs it, then, appropriate to hold the general public accountable for their bystander effect? Our expectation of someone else acting in the face of an ongoing crime symbolises both our delusion about the legal system and our own defence mechanism. Often, the criminals nabbed by police get bail and return to the streets. Such judicial leniency or loopholes can frustrate and discourage the police, who often risk their lives to nab criminals. Without fast-track trials or stronger prosecutorial arms, deterrence is practically null. And for juvenile offenders, correction centres often serve as incubators for future crimes rather than being places where they are reformed.\nLet us also not lose sight of the sociological drivers. The economy is still in a state of disrepair. Unemployment is at a record high. Soaring commodity prices push the youth to survival crime. The disillusionment following the uprising has left many of them feeling rudderless. They observe how one group of their peers with political connections receives preferential treatment over the other. With the disappearance of the former regime, old patronage networks are dissolved. Many of the foot soldiers are now on their own. In summary, we have entered a period where survival takes precedence over civics. We want to be bystanders with a prayer on our lips: dear God, let not the next victim be me!\nDr Shamsad Mortuza is professor of English at Dhaka University.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Rising crime, institutional failure, and the bystander effect",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/rising-crime-institutional-failure-and-the-bystander-effect-3907756",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-06-2025"
    },
    {
        "full_article": "We are concerned by the findings of a report by this daily that has revealed how our public health system is failing expectant mothers. Despite a surge in deliveries nationwide—rising from 2.79 million in 2023 to 3.03 million in 2024—there hasn't been a proportionate increase in the use of relevant health services. Recent data from the Medical Education and Family Welfare Division show a steady decline in antenatal check-ups, deliveries, contraception use, and postnatal care in public hospitals and clinics. Of the deliveries recorded, government health facilities have handled just over six percent. That fewer women are turning to public facilities—the most accessible and affordable source of care—means they, and their babies, are more likely to face serious health risks without timely medical intervention.\nFurther details from our report help provide a clearer picture. For example, while the WHO now recommends eight antenatal care (ANC) visits during pregnancy, in Bangladesh, even the older target of four is becoming harder to meet, with only 5.14 lakh pregnant women receiving the recommended ANC visits in 2023-24—less than half the number recorded four years earlier. Postnatal care has followed the same downward trend, as has the use of contraception. Meanwhile, experts have cited shortages of medical personnel, essential drugs, equipment, and ICU beds that continue to plague public facilities, along with limited awareness among expectant mothers. These deficits are most dangerous for women with high-risk pregnancies, especially in rural areas where the maternal mortality rate remains significantly above the national average.\nThe experiences of the women cited in our report also highlight the urgency of proper and timely care for pregnancy-related complications. To address the crisis, we need a multi-pronged intervention from the authorities. First, it is vital that the government allocates more resources to public maternal healthcare, recruiting and training staff, expanding ICU capacity, and ensuring an adequate supply of essential drugs. Second, local-level facilities need to be strengthened so that women aren't forced to travel long distances for emergency care. Third, there must be sufficient awareness campaigns to educate families on the importance of antenatal and postnatal check-ups, especially in rural areas where misconceptions about pregnancy persist. Access and awareness must happen simultaneously for us to turn the current trend around.\n",
        "headline_1": "Expectant mothers deserve better from public healthcare",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/expectant-mothers-deserve-better-public-healthcare-3906126",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 01, 2025 00:00:00  \nThe rise of startups within the cottage, micro, small, and medium enterprise (CMSME) sector has been a bright spot for the economy in recent years. This CMSME sector remains the backbone of economic growth and job creation as it accounts for roughly 30 per cent of the country's GDP and employs nearly 85 per cent of its industrial workforce. What's worrying, however, is that a concerning number of new businesses in this industry don't make it past their first year or two in operation. There is a clear gap between the sector's promise and performance as a result of this high rate of attrition, which prevents the sector from reaching its full potential. This fragility lays bare the unique challenges that startups in the country must grapple with.\nOne major obstacle that causes many CMSMEs to fail early is their inability to identify and reach target markets. Far too often, entrepreneurs rely on outdated, word-of-mouth promotion while neglecting the potential of digital tools. Many also lack a firm grasp of key business fundamentals such as branding, pricing strategies, consumer behaviour and effective packaging design. In an increasingly competitive market, this limits their reach and customer engagement. Moreover, insufficient budgets for advertising and promotion further marginalise their products in both domestic and international markets. While the SME Foundation has made commendable efforts by organising fairs and facilitating participation in international trade exhibitions, these initiatives simply aren't enough to address the deeper structural gaps in entrepreneurial capacity and market knowledge. Even the most innovative ventures will struggle to evolve into sustainable enterprises when they lack strong connections to the market. \nAnother significant challenge is the absence of tailored institutional support and policy frameworks. In a labour-intensive economy like Bangladesh's where formal employment opportunities are scarce, strengthening CMSMEs can drive inclusive growth, reduce poverty and enhance women's economic participation, especially as women represent 6.47 per cent of SME entrepreneurs. However, these businesses are often left to weather the storms of market competition without adequate support. Institutional training in business skills, marketing and customer engagement is notably absent. Moreover, the existing Competition Commission has done little to curb the dominance of large enterprises, further weakening CMSME competitiveness. Some government initiatives such as refinancing schemes and credit guarantees show promise but their full impact is yet to be realised. For example, the disbursement of stimulus packages has fallen short of targets in later phases and the sector's overall contribution to GDP remains stagnant compared to some neighbouring countries. This suggests a notable disparity between policy objectives and their execution on the ground. \nTo reverse the tide of early business failures and boost growth, the government must attend to the issues that held back CMSME sector from thriving. Entrepreneurs need continuous, practical training in core business skills, tailored to industry needs and delivered through accessible platforms like online courses and community workshops. Policy support must also be streamlined to ease access to raw materials and strengthen market linkages at the grassroots level. As proposed by industry leaders, establishing dedicated SME product exhibition centres would create vital spaces for showcasing products and direct interaction with buyers. Furthermore, effective enforcement of the Competition Law 2012 and strengthening the Competition Commission are crucial to ensure a level playing field and prevent large industrial groups from crowding out smaller enterprises. With the right support in market research, branding and digital integration, it is possible for the country to create an enabling ecosystem that will transform its CMSME industry into a lasting driver of employment and growth.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Painful development of CMSME startups",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/painful-development-of-cmsme-startups-1748705193",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       June 01, 2025 00:00:00  \nFor the third consecutive year, the country's economic growth rate has declined, reflecting the sluggish trend in the overall development scenario. The national statistical agency released the primary estimate of the Gross Domestic Product (GDP) for the current fiscal year (FY25) last week. It showed that the GDP growth rate declined to 3.97 per cent in FY25 from 4.22 per cent in FY24. Earlier in FY23, the growth rate was 5.78 per cent, significantly lower than 7.10 per cent in FY22.\nThe latest decline in the growth rate is predictable and also realistic. Unlike the previous years when the now-ousted Hasina regime used to manipulate data to show inflated figures of economic growth, no such thing happened this time. The national statistical agency collects, calculates and releases the data of national accounts independently and professionally. \nThe provisional estimate of GDP growth of around 4 per cent is close to projections made by three international financial institutions. The World Bank projected that Bangladesh's economy would grow by 3.30 per cent in the current fiscal year. The International Monetary Fund (IMF) predicted a figure of 3.76 per cent, while the Asian Development Bank (ADB) mentioned 3.90 per cent. The Bangladesh Bank, the country's central bank, projected that the economic growth rate may hover at the 4.0 to 5.0 per cent range in FY25. Bangladesh Bank, in its half-yearly Monetary Policy Statement (MPS), released in January last, also cautioned that the growth outlook did not appear optimistic due to various challenges.\nThe latest estimate also showed that the agriculture growth rate declined sharply to 1.79 per cent in the current fiscal year from 3.30 per cent in the past fiscal year. The poor performance of farm activities had a significant impact on overall economic output. The services sector also experienced sluggish growth in the current fiscal year, recording a modest growth of 5.09 per cent from 5.37 per cent in FY24. The industrial sector, however, posted a modest rise in growth to 4.34 per cent in FY25 from 3.51 per cent last year. \nOne needs to keep in mind that the current fiscal year began amid heavy turbulence due to a student-led mass uprising against the oppressive rule of Sheikh Hasina. To supress the mass movement, the autocratic regime resorted to brutal killings, and at least 1,400 people sacrificed their lives. More than 20,000 people were injured, and many were intimidated by the brutal force of the Hasina regime. Nevertheless, the mass uprising finally compelled her to step down and flee on August 5 to take shelter in India. On August 8, an interim government took charge led by Nobel laureate Professor Muhammad Yunus. It took a couple of months to restore law and order and bring business back to normal, although economic activities, severely disrupted during July and August, have been struggling to recover fully.\n\nThe interim government has, however, initiated several reform measures to fix the various loopholes in the country's macroeconomic management. During the Hasina regime, poor governance led to an increase in bad loans, making the financial sector vulnerable and fuelling capital flight from the country. Data manipulation was also widespread to conceal the weaknesses of macroeconomic mismanagement, such as the sharp depletion of foreign exchange reserves. Fixing the problems within a short period is difficult, and the interim government has faced a daunting challenge in doing so. \nAgainst this backdrop of sluggish economic growth and fractured economic management, finance adviser Dr Salehuddin Ahmed will present the national budget for the next fiscal year (FY26) tomorrow. It will be a televised placement as there is no parliament in the country. The finance adviser is likely to keep the budget outlay at Tk 7.0 trillion, which is 12 per cent less than the original outlay of the FY25 budget, which was Tk 7.97 trillion.\nThe core challenge for the finance adviser is to focus on containing inflationary pressure, creating environment for investment, and providing rooms for job creation. As the interim government is not obsessed with growth, it gives him some necessary space to manoeuvre the fiscal measures. The indication is already there that the adviser has decided to reduce duties and value-added taxes (VAT) on a good number of products and services. The minimum threshold of tax-free income will also be increased to adjust the real income with high inflation. With the continuation of the tight monetary stance to contain inflation, well-coordinated fiscal measures will ease the pressure of inflation in the near future. \nThe budget is faced with a pressing challenge-the urgent need to create sufficient jobs for the millions of people in the country. According to the International Labour Organization (ILO), Bangladesh has a labour force of 71 million, with a labour participation rate of 49.5 per cent. The youth unemployment rate is a staggering 16.8 per cent, and the share of youth not in employment, education or training is a concerning 30.9 per cent. The ILO's recent caution that youth unemployment in Bangladesh is expected to remain high further underscores the urgency of the situation. The finance adviser's plan for job creation, to be revealed tomorrow after the budget is presented, is eagerly awaited. \nTo create necessary jobs for millions of youths, the country needs more investment in the manufacturing and services sectors. The provisional estimate of BBS showed that the investment-GDP ratio declined to 29.38 per cent in the current fiscal year from 30.70 per cent last year. The alarming thing is that the ratio of private investment declined sharply to 22.48 per cent from 23.96 per cent during the period under review. This decline in private investment has a direct impact on job creation, as it hampers the growth of businesses and the expansion of job opportunities. The decline in investment is a reflection of lower business confidence, and the trend has been persisting for the last couple of years. The net inflow of annual foreign direct investment (FDI) also declined by 13 per cent last year, marking the third consecutive year of a decline in foreign investment. Therefore, the next budget needs to outline some visible measures to attract investment.\nIt's important to remember that budgetary measures alone are not enough to attract investment. A stable socio-political environment is equally crucial. Investors, particularly foreign investors, seek stability to ensure the sustainability of their investments in the medium and long term. While the interim government's efforts to improve the investment climate are commendable, the current situation has yet to provide a positive signal for long-term investment. If the dust takes longer to settle, the rise in investment will inevitably be delayed.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Budget amid lower growth",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/budget-amid-lower-growth-1748705339",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       June 01, 2025 00:00:00  \nIn line with the July uprising's resounding mandate to reform the state, the interim government is undertaking a series of institutional reforms - including the reconstruction of the National Revenue Board and the enactment of the Public Service (Amendment) Ordinance - aimed at strengthening institutional capacity, ensuring accountability, and promoting good governance. Unfortunately, these vital structural reforms have met resistance from within - particularly from officials who are either accustomed to the existing systems or have a vested interest in maintaining the status quo.\nTake, for example, the recently issued Revenue Policy and Revenue Management Ordinance, which separates revenue policy-making and tax collection. This reform was crucial to prevent the same individuals from both formulating and executing tax policy, a scenario that had led to a deeply entrenched conflict of interest.\nHowever, since the ordinance was issued in May, NBR officers have been protesting. They abstained from work for weeks and, at one stage, even threatened to halt all customs-related activities across all ports, which has prompted the government to assure them of fulfilling their demand. They have withdrawn their strike following the government's assurances to meet their demand, but are now demanding the removal of the NBR chairman. They have declared NBR Chairman Abdur Rahman Khan as persona non grata at the revenue building until he is removed. \nHere it needs to be mentioned that the protesting officials claim they support the need for reform and do not oppose the division of the NBR in principle. Their main demand is that the newly formed policy division be led and staffed by officials from the existing Tax, VAT, and Customs departments. But if this demand is fulfilled, it fundamentally defeats the purpose of the separation. If both policy formulation and implementation are controlled by the same group of officials, the underlying conflict of interest remains intact - rendering the entire reform initiative meaningless.\nThe prolonged stalemates in the revenue department, as well as at the secretariat, have already sparked anxiety and frustration among the public. All stakeholders must remember that the July uprising has fuelled a national desire for reform across various sectors. The protesting government employees must be careful not to position themselves in opposition to the reforms that people overwhelmingly support. At the same time, the growing instability within public offices increasingly appears to serve the interests of certain vested groups seeking to derail the government's broader reform agenda. The protesting officials, therefore, must ensure that their movement is not exploited to further any political objectives.\nExerting undue pressure on a government entrusted with the responsibility of state reformation not only disrupts the essential functions of governance but also violates moral and administrative norms. From a moral standpoint, it is unjustifiable for public servants - whose salaries are funded by taxpayers - to abandon their duties and hold the public hostage to advance their own interests. It must be remembered that the state does not exist to serve the interests of government employees or any other groups. Its primary responsibility is to ensure the utmost efficiency of the institutions and the welfare of the people at large. The smooth functioning of state institutions and public service delivery cannot be subject to the whims of any particular cadre of employees. Public servants in service-oriented institutions have a moral duty to uphold their commitments to the people. Abandoning that duty and holding public life hostage to advance their petty self-interest is totally unacceptable. While it's essential that reforms are implemented in consultation with the employees and that their legitimate concerns are addressed, public servants must not be allowed to obstruct reform by paralysing government offices and holding the public hostage.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Self-serving protests undermine national interest",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/self-serving-protests-undermine-national-interest-1748705411",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 01, 2025 00:00:00  \n\nThe Khamarbari intersection, situated at the eastern end of Manik Mia Avenue in the heart of Dhaka, remains one of the busiest junctions in the city due to its proximity to the Parliament, the National Institute of Ophthalmology, and several other key offices. As a circular roundabout facilitating one-way traffic, it plays an important role in reducing congestion in this high-traffic zone.\nHowever, the current condition of the intersection is disappointing. The central island is weedy and lacks any structured railing or modern design. As a result, the space appears neglected and unpleasant.\nGiven its strategic location and symbolic significance, this roundabout holds great potential to reflect the essence of our agricultural heritage. Surrounding the intersection are numerous agriculture-related institutions, including the Department of Agricultural Extension (DAE), Krishibid Institution Bangladesh (KIB), Department of Livestock Services (DLS), Soil Resource Development Institute (SRDI), Bangladesh Agricultural Research Council (BARC), Bangladesh Jute Research Institute (BJRI), and Bangladesh Agricultural Development Corporation (BADC).\nConsidering this, the intersection could be transformed into a landscaped island that celebrates our agrarian roots. A symbolic sculpture, such as a vertical emblem of a rice panicle-representing our staple food-could be placed at the centre. This could be surrounded by scientifically arranged seasonal crops like rice, jute, maize, mustard, and others, adding educational and aesthetic value. Such a transformation would not only enhance the city's image but also offer urban dwellers, especially the youth, a glimpse into the nation's agricultural legacy.\nKrishibid Institution Bangladesh (KIB), in collaboration with Dhaka North City Corporation (DNCC), could take the lead in implementing this vision. Alternatively, agricultural companies might consider sponsoring the beautification project, incorporating their logos or taglines in an appropriate manner.\nLet us adorn our road islands and intersections with elements that reflect our cultural and traditional values, and maintain them with the care they deserve.\nMd. Refatul Hossain\nAdditional Director (retd.)\nDepartment of Agricultural Extension (DAE)\nFaridpur Region\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Beautification of Khamarbari intersection",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/beautification-of-khamarbari-intersection-1748705425",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-06-2025"
    }
]