[
    {
        "full_article": "State surveillance must be subject to systemic checks and supervision and not mirror the nefarious activities of the dark underworld. As a Supreme Court of India Bench pointed out, the question is not whether the state can use spyware, but who could be its legitimate targets. The Bench, during a hearing on the alleged surveillance of politicians, judges, religious leaders, civil servants and journalists by some state entity, was evidently seeking to curtail arbitrary use of the powers and tools of surveillance. The government has neither confirmed nor denied that it uses Pegasus, an Israel-made military grade spyware that is sold only to state agencies, which was used to target a wide range of people. The matter reached the Court after global revelations about the existence and the use of this tool, and it appointed a technical committee whose investigation was constrained by a lack of cooperation from alleged targets and the government. Several high-profile users of the iPhone, the primary target of Pegasus, continued to get security alerts from the manufacturer that they were targets of suspected state surveillance, even as the matter was before the judiciary. States the world over have used extra-legal measures to snoop on targets that tried to firewall their communication using rapidly evolving technologies. Terrorists and other non-state actors, and criminals are using encryption and other advanced technologies to evade detection as they plot to harm the wider society. Without adequate legal and technological wherewithal, the state would be ineffective in dealing with emerging national security threats. In this context, and particularly against the backdrop of the terrorist attack in Pahalgam in Jammu and Kashmir, the Court has framed a relevant question.The tendency of the government to arbitrarily invoke national security in defence of a brazen denial of due process and transparency in law enforcement has been called out by the Court in the past. There is also the disturbing trend of government actors routinely labelling political opponents as anti-nationals. If the state is to claim more surveillance powers, corresponding and robust guardrails must also be engineered. National security cannot be an excuse for executive arbitrariness and a violation of individual rights and dignity. Protocols that ensure that clearly defined standards and steps are followed in surveillance must be established. Once the security concerns are overcome, and within appropriate timelines, these processes should be subject to oversight by other branches of government and the public at large. At any rate, no state agency can have the authority to interfere in the democratic politics of the country, or stifle dissenting voices and activism. While trying to tackle an uncertain security environment, the compass of India’s constitutional democracy must stay firm. Published - May 01, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Pegasus surveillance\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        judge\n                    \n                            /                      \n                        \n                        religion and belief\n                    \n                            /                      \n                        \n                        media\n                    \n                            /                      \n                        \n                        mobile phones\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        democracy",
        "headline_1": "​Secret threats: On state surveillance and democracy",
        "headline_2": "The state must not stifle democratic dissent in the name of national security",
        "link": "https://www.thehindu.com/opinion/editorial/secret-threats-on-state-surveillance-and-democracy/article69510349.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-05-2025"
    },
    {
        "full_article": "A recent report analysing public funded research and development institutions in India had some pointers that should raise an alarm. In several of the 244 institutions studied, there was a decrease in the number of permanent, scientific staff in 2022-23 compared to the previous year. There were also fewer organisations in 2022-23 compared to the previous year that reported hiring permanent staff. The institutes together had 19,625 contractual staff and 12,042 permanent staff in 2022-23. Not surprisingly, the slowdown in hiring was made up by hiring scientific research personnel on short-term contracts. These contractual staff were a 14% rise over 2021-22. The very fact that contractual workers exceed permanent staff in scientific institutions is a matter of concern. This data emerges from a study commissioned by the Office of the Principal Scientific Adviser and the institutions studied, do not include the ‘strategic sectors’, such as defence, atomic energy and space which consume the lion’s share of India’s research and development expenditure. As a report of the Parliamentary Standing Committee on Science, Technology and Environment tabled in Parliament last month observed, nearly three in five of the posts sanctioned for scientific personnel at one of India’s top institutes for basic science research, the Tata Institute of Fundamental Research (TIFR), are unfilled. The TIFR is primarily funded by the Department of Atomic Energy. Further, the parliamentary report found that, on average, one in four of sanctioned posts at the key atomic energy research institutions and nuclear power plants was vacant. Clearly the rot runs deep.On the one hand, the government has announced missions to develop quantum computers and develop foundational artificial intelligence models. It has also declared its intent to align research and development towards industry-specific research. However none of this will bear fruit without scientists, particularly young researchers who are engaged full-time, having long careers at institutions doing cutting-edge research. The government had once set up institutions such as the Indian Institutes of Science Education and Research (IISER) and introduced four-year undergraduate programmes in basic science, precisely because the incentives then were not strong enough to retain potential scientists. India needs to ensure that the conditions for research, such as respectable salaries, funds and equipment to do good research, are made available more widely.\r Published - May 01, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        research\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        science (general)\n                    \n                            /                      \n                        \n                        defence\n                    \n                            /                      \n                        \n                        nuclear power\n                    \n                            /                      \n                        \n                        space programme\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        government",
        "headline_1": "​Leaky pipeline: On India and permanent scientific staff",
        "headline_2": "India must ensure it retains the services of committed scientists",
        "link": "https://www.thehindu.com/opinion/editorial/leaky-pipeline-on-india-and-permanent-scientific-staff/article69510848.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-05-2025"
    },
    {
        "full_article": "SC calls digital access to services a fundamental right, but making that work is very tough\nDigital access to services is a fundamental right, Supreme Court said on Wednesday. If you get news and entertainment from the net, catch up with friends on social media, bank and book cabs online, you might not feel the significance of this judgment, but ask your domestic help who can’t get a subsidised gas cylinder even now.\nThe bench of Justices JB Pardiwala and R Mahadevan was hearing two PILs where the petitioners’ physical – not financial or educational – disadvantages barred access to digital services. One of them, an acid attack survivor with severe facial disfigurement, failed her bank’s KYC because she couldn’t blink her eyes – an RBI-mandated requirement. The other had 100% visual impairment. While they had sought modified KYC norms, SC went a step further and addressed the bigger issue of inclusion.\nThe right to life and liberty – Article 21 of the Constitution – includes the right to live with dignity, and earn a livelihood. While bringing digital access to services under Article 21 – because “access to essential services, governance, education, healthcare and economic opportunities are (sic) increasingly mediated through digital platforms” – SC said, “bridging digital divide is no longer a matter of policy discretion but imperative for a life of dignity”. It also mentioned the “principle of substantive equality” – the need to remove the root causes of inequality.\nOnline learning during the pandemic brought home the reality of digital inequality. Children from well-to-do families could continue learning during lockdowns, but the majority couldn’t because they didn’t have laptops, internet and online courses. Since then, many services have gone online, usually resulting in reduced walk-in facilities. This disadvantages poor people and senior citizens who are not net-savvy. Where they could talk to, say, bank staff in the local language, online services may be available in only one or two languages. There’s also the issue of internet access. India claims 86% tele-density, but only 59% of rural India is online. And only 4.5% of Indians are on wired broadband. That’s important because last year India enforced 84 internet shutdowns affecting mobile internet users. SC has made the right move on guaranteeing digital access, but the ball is in govt’s court.\n\n",
        "headline_1": "Service guarantee",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/service-guarantee/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-05-2025"
    },
    {
        "full_article": "It’s now more toxic than exotic\nThe East Is Red was a 1965 musical extravaganza hailing Mao Zedong’s shaping of Chinese Communist Party. Its title song (‘Dongfang Hong’ in the original) became Cultural Revolution’s unofficial national anthem. And also unofficially that of Bengal’s ultra-Leftin those lal-salaam days of ‘China’s Chairman amader (our) Chairman.’ However the east is now more in the red. The fault lies not only with colonies-and-credit-grabbing West. If the sun has been setting on it, we only are to blame. Centre and town-planners alike.\n‘Neglect of the east’ was a cri de coeur,‘cry phrom the haart’ long before Mamata raised her fist against fiscal unfairness. This stuck record of ’60s Calcutta found an unlikely avatar when I lived in Bombay for the next decade. Handling ‘News in Pictures’ at Illustrated Weekly, I’d get an avalanche of images for calamities in remote corners of the world. But for floods in Orissa, photographic drought.\nThe Red Fortress barricaded itself during Jyoti babu’s long hold. Then,‘for one, brief and shining moment’, his quasi-capitalist successor Buddhadeb Bhattacharya promoted the state as gateway to emergent east, Land of the Rising Tigers. Now Bengal Tigress wants to get it out of the red by bringing in the world via Biswa Bangla melas.\nCountry, state, city, same to same. For companies, ‘Going south’ means downward slope. For urban wannabes, it means upward mobility, whether in Mumbai, Kolkata or Delhi. In the first, west is also best. East is not a socially leavening agent anywhere.\nMumbai, city of Kipling’s birth and early childhood, seems determined to honour his dire ‘twain shall never meet’ prediction. Engineering marvels keep linking its west with south. But central city’s eastern flank remains unseen, unserved by Viksit Bharat’s breathless forerunners. Despite the fact that space and sea-views of these once-depressed dock and mill areas are now manna for heavy-breathing developers and muse of their hyperventilating hoardings.\nStepchild east waits in cautious hope for the Sewri-Worli connector that will speed it to the blandishments of west and south. But braces for monumental disruption, diversion – and extra dollop of delays.\n                                            ***\nAlec Smart said, “The whole world (and planet) is sending a desperate May Day call.”\n\n",
        "headline_1": "Red-faced East",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/red-faced-east/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-05-2025"
    },
    {
        "full_article": "GOI has joined the caste count brigade. The politics is clear, economic usefulness isn’t\nThe Centre’s decision to include caste enumeration in the next Census is not unexpected – it had already signalled its willingness last Sept. Opposition bloc had drummed up its demand ahead of Lok Sabha 2024 elections. Caste is at the heart of India’s politics. And there’s no doubt that enumerating caste as part of the Census will help with accurate information – size, literacy levels, occupational structures. It will immediately be visible if a caste is denied basic facilities and infra. But what will be done with all that knowledge? BJP ally Nitish Kumar’s survey of caste in Bihar – where elections will be held later his year – was released in Oct 2023. It found 63% of the state’s 13cr population belonged to castes listed under Extremely Backward Classes (EBC) and OBC categories.\nQuestion is: How has Nitish Kumar’s govt used its survey for targeted interventions in the two years since release of the data? Further, caste sizes will always remain a hot potato. It’s what Karnataka CM Siddaramaiah is grappling with – political accusations from both Congress and BJP that the data is “inaccurate”. Caste enumeration is of little use if the outcome is limited to power politics.\nTruth is, govts have limited capacity to wholesale improve socio-economic inequalities. Caste numbers are most likely to spur agitations for more quotas in the name of affirmative action – all that govts can seemingly do. To pull people out of economic backwardness demands investment, meaningful & relevant education and training & good jobs for youth. Without these pillars, for which govts act as enablers, no matter how much the data collected and collated, it’s status quo for those discriminated against and forced to remain socially backward. Fundamental to progress is availability and access to justice, law & order, education, health and mobility. A caste census is not essential to ensure this. Further, fears that a caste census can be an “identity trap” must be dealt with – perhaps the enumeration should include a column “no caste”. And now the big question: when will the Census be held? The cabinet briefing didn’t indicate a time. Numbers far more vital to policymaking than caste count need serious updating.\n\n",
        "headline_1": "Not who but what",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/not-who-but-what/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-05-2025"
    },
    {
        "full_article": "There’s no need to stamp out public debates over what New Delhi should do post-Pahalgam. Politics will inform some debates. That’s natural. Debates, in fact, can be useful as the government considers options\nThe Pahalgam massacre of tourists has unified India in many ways. There is widespread condemnation of terrorists, who were clearly backed by state and/or non-state actors in Pakistan.\n\nAnger among Indians is palpable, and PM gave vent to it when he said the perpetrators and their handlers will face “unimaginable” retribution.\nRead the full story on TOI+.\n\n",
        "headline_1": "Jaw-jaw & war-war",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/jaw-jaw-war-war/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-05-2025"
    },
    {
        "full_article": "Kalaketu, a hunter belonging to the lowly Kirāṭa community, is the hero of the Ākheṭik Khanḍa (Book of the Hunter) of Mukundaram Chakrabarti's Canḍīmaṅgal (c.1579). Along with his wife Phullara, Kalaketu ekes out a meagre existence by hunting and selling forest products in local markets. One day, Goddess Canḍī visits the couple and chastises them for slaying the other animals of the forest, who are also under Canḍī's protection. She blesses Kalaketu and Phullara with a lumpsum and orders them to clear the forest in nearby Gujarat and establish a kingdom there. This initial wealth attracts many day-laborers and erstwhile forest-dwellers to the region. By their unremitting toil, a city and market are founded.\nIt proves difficult, however, to get people to settle down in the city. Kalaketu again seeks Canḍī's help, who floods the neighboring kingdom of Kalinga, but even that does not lead to immediate migration. Residents of Kalinga decide to make Gujarat their new home only when their king insists on collecting all taxes even after the flood, and when people hear that Kalaketu offers tax-free settlement for seven years and charges no extra levies on festivals, salt, and police protection. Once Kalaketu's modality of rule becomes common knowledge, his kingdom flourishes in no time, but with that comes new problems.\nA Kayastha headman by the name of Bhām̐ṛu Datta (ভাঁড়ু দত্ত) insinuates himself into Kalaketu's service using well-honed skills of flattery, and immediately begins treating people in the duty-free market with contempt. Bhām̐ṛu steals and tries to exact duties from Kalaketu's subjects, even beats them if necessary, despite having received rent-free lands himself. Upon receiving complaints from his subjects, Kalaketu banishes Bhām̐ṛu from Gujarat and the headman becomes intent on exacting revenge. He goes forthwith to the king of neighboring Kalinga and warns him of the upstart lower-caste king in Gujarat. Bhām̐ṛu reports that Kalaketu's people live in harmony and wealth is produced at a fast pace. If this is allowed to continue, Bhām̐ṛu says, then Kalinga will soon be deserted!\nThe king of Kalinga is furious and exclaims that there cannot be two kings in one kingdom! He begins a war with Kalaketu, which the latter eventually loses despite initial victories. The king has half a mind to execute Kalaketu but decides to imprison him at the request of the courtiers who suspect that Kalaketu is merely Canḍī's vessel. Indeed, it is only Canḍī's divine intervention that gets Kalaketu out of jail and revives the lives of all those who had fallen in battle. Bhām̐ṛu Datta is punished for his misdeeds, and Gujarat returns to its erstwhile vibrant and flourishing state.\nFast forward two centuries. January 1778. Calcutta. The Kayastha Raja Nabakrishna Deb (1732-1797) complains to the British colonial state that petty merchants and shopkeepers (tahbazaris) have been deserting his legally established market. The tahbazaris have been provoked, Nabakrishna insists, by the upstart Madan Dutt, who has dared to establish a market on his land without a charter issued by the state! By the customary law of the land, Dutt's market should, therefore, be immediately abolished.\nThe company-state is unsure about the best course of action. Its confusion is compounded by multiple petitions from the shopkeepers, vendors, and landowners of Sutanuti against Nabakrishna's depredations. In light of myriad grants bestowed by the government on the Raja since the early 1770s, the petitioners fear for the \"security\" and \"liberty\" of their property and the ability to dispose of their property freely. They plead for such liberty to be granted to them by the government and bemoan the \"arbitrary\" authority and \"unjust\" exactions of Nabakrishna.\nThe Raja, for his part, doubles down and swears that the petitioners against him are largely \"poor\" and \"ignorant,\" and that the \"highest\" inhabitants (of the city) with a \"better\" disposition have not petitioned against him. Nabakrishna also reminds the state that he dutifully pays taxes and that no government in Bengal has ever allowed a private landowner to establish a market without a legal charter and customary taxation.\nA lengthy legal battle ensues and lasts the whole year. Madan Dutt argues that he simply rents out land, which is his private property to do as he pleases. The shopkeepers and tahbazaris claim that they rent land from Madan Dutt because the duties in Nabakrishna's market are five, ten, or even fifteen times higher! Indeed, many shopkeepers argue that Dutt has not established a market at all, because neither the dām (a duty in money on each shop) nor the tolā (a duty in kind on the articles of sale) are collected on Dutt's land. The transaction between Dutt and his tenants is between two private parties freely disposing of their property, to which neither the state nor Nabakrishna should object.\nIt's December 1778, and the state is unable to prove either that Madan Dutt is occupying the land illegally or that he is surreptitiously collecting duties. Company officials agree that these are private transactions and a man may let his land for whatever rent he can get. Unable to find a legal principle to abolish Dutt's \"market,\" the state falls back on a consequentialist argument: Ifsuch actions go unpunished, then the state and local persons of authority (such as Nabakrishna) will gradually lose their property right over the disposal of property! In January 1779, based on this thin argument, the state orders that the shops on Dutt's ground be razed. Property is thus destroyed in the name of property.\nReflect, for a moment, on the uncanny similarity between these two stories. If we ignore the constant presence of divine agency in Mukunda's Canḍīmaṅgal and its upbeat ending, and then replace Kalaketu with Madan Dutt, Kalaketu's subjects with the tahbazaris and shopkeepers on Dutt's land, Bhām̐ṛu Datta with Nabakrishna, and the king of Kalinga with the British East India Company, we arrive at the structure – albeit not the exact content – of the legal battle of 1778. The similarities in structure and motivations are undeniable, and Bhām̐ṛu Dutta and Nabakrishna Deb hail from the same caste! Is this a mere coincidence?\nI think not. Mukundaram's text belongs to one of the most distinctive genres of medieval Bangla literature – the Maṅgalkābyas (literally, \"poems of well-being\") – composed between the late-fifteenth and early-nineteenth centuries by the rural, relatively poor Brahmans of south-western Bengal. Scholars of these texts have noted that the Maṅgalkābyas present a complex picture of the contemporary social landscape, and they ruminate on the possibility of subaltern actors challenging caste and gender norms. Moreover, the problems discussed in Maṅgalkābyas often referred to actual historical ones, and the audience was expected to actively engage with and evaluate the logical and ethical valence of arguments made by the characters.\nIf this is true, then it follows that a basic socio-political problem in early modern Bengal – that those with substantial property and authority exercised a property right over the disposal of other people's property – was neither restricted to urban settings like Calcutta nor radically new in 1778. Even in rural western Bengal – where the Maṅgalkābyas were performed – the problem was important and recognized as such. Otherwise, it could hardly have found such a clear expression in Mukunda's text.\nWe can go even further to link the social and economic contexts of the two stories. Bengal underwent major socio-economic as well as political transformations between the sixteenth and eighteenth centuries. Vast amounts of fallow and forest lands were brought under the plough with remarkable vigor, first in the western and south-western frontiers of the province in the sixteenth century, and then in the east throughout the seventeenth and eighteenth centuries. This was paralleled by the expansion of marketing and the establishment of new markets, and some of the markets founded in the late sixteenth century were still functioning two centuries later. In short, the stakes of being able to access land and markets more freely increased dramatically. Unsurprisingly, this led to caste struggle, since the control of access to land and markets – along with the regulation of sexuality – had always been the practical basis for reproducing caste hierarchies. Indeed, the efflorescence of Vaishnavism in sixteenth-century Bengal should also be read against this historical background.\nThe eighteenth century, of course, witnessed the rise of an extractive colonial empire after 1765. As a result, scholars often tend to read all events after that date as bearing the stamp only of colonial power. I have argued elsewhere in detail, however, that the conflict of 1778 cannot be reduced to the question of colonial governance. While the impulses of the revenue-hungry state demonstrate its illiberal character, the critique of arbitrary exactions must be read as a critique of practices that reproduced caste. Close attention to the history of settlement in Calcutta and clues thrown up by the colonial archive – such as Nabakrishna calling his opponents poor and ignorant – allow us to conclude that the tahbazaris of 1778 belonged to middling and lower castes. Nabakrishna was a Kayastha, one of the three elite castes of medieval Bengal along with Brahmans and Vaidyas, and his tendency to act in authoritative and extractive ways embarrassed even colonial officials at times. Although Madan Dutt was a wealthy businessman (his caste background is unclear), Dutt's social status cannot explain the sustained political struggle of the tahbazaris.\nThe history of caste and caste struggle, in short, cuts across the colonial/pre-colonial divide. Socio-cultural transformations from the sixteenth century onwards inspired critiques of caste, and those worst affected by \"arbitrary\" impositions challenged their legitimacy. In Calcutta, aspirations for alternative institutional arrangements took the form of unprecedented commercial cooperation between peoples of multiple ethnicities, and the Calcutta Mayor's Court established in 1726 sought to model itself on the legal culture of the Atlantic colonies. The city became a refuge for people fleeing the arbitrary exactions of landed elites and the Bengal Nawabs, and evidence from the conflict of 1778 shows that in the years leading up to 1765, many South Asian merchants allied with the radical bourgeois faction within the East India Company that sought to establish a liberal commercial order in Bengal.\nA bourgeois revolution, therefore, was once an incipient political possibility in Bengal, and the contingent failure of this possibility explains the illiberal character of the post-1765 empire. Kalaketu's story in the Canḍīmaṅgal and the conflict of 1778 show us that precisely because the stakesof an open marketplace were large and recognized as such by subaltern actors, caste struggle found an ally in the radical bourgeoisie. Historians of South Asia have either failed or been reluctant to chart such aspirations and the political alliances they gave rise to, preferring instead to see liberal modernity as either a colonial imposition or a matter of concern only for elite figures such as Rammohan Roy. It is time to ask why this has been the case and to go beyond the inadequate historical memories that have been bequeathed to us. The nineteenth century certainly marks a violent break in our history, but we cannot recognize the stakes of this break if we do not understand the nature of the social and political possibilities that were closed off by illiberal colonialism.\nAnirban Karakis a Collegiate Assistant Professor in the Social Sciences Collegiate Division at the University of Chicago.\n\n",
        "headline_1": "Subaltern Aspirations in Early Modern Bengal",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/focus/news/subaltern-aspirations-early-modern-bengal-3884076",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-05-2025"
    },
    {
        "full_article": "We agree with the Centre for Policy Dialogue's (CPD) observation that the government's failure to form an education reform commission has been a significant misstep—one that is proving costlier amid persistent turmoil in many colleges and universities, driven largely by student grievances. The latest unrest involves polytechnic students, who have been protesting for months and are now enforcing a \"complete shutdown\" of their institutions until a roadmap for implementing their six-point demand is formulated. Earlier, it was the turn of KUET, which has remained closed since a violent clash broke out on February 18, leading to huge academic disruptions, student suspensions, dormitory break-ins, and even face-offs between students and teachers over the former's demand for the VC's removal, which has been subsequently met.\nThis pattern has been repeated on many other campuses since the July uprising. While it is true that the continued turmoil over student grievances has a lot to do with their newfound power of mobilisation, shrinking the space for negotiation and compromise, a reform commission could have given all involved a sense of direction away from reactive policies. It could have helped address many of the systemic issues plaguing our educational institutions, providing a new, modern vision for the sector. The question is, why hasn't the interim government formed it even after being in power for nearly nine months?\nAt a media briefing on Tuesday, the CPD's Debapriya Bhattacharya claimed to have proposed forming a high-level reform committee to the education adviser in March. This newspaper, too, has published a number of commentaries advocating for such a commission. But for reasons unknown to us, the government decided against it, even though it set up 11 other commissions.\nThe CPD's proposal was more in line with the demands of polytechnic students as it envisioned a reform committee to overhaul the technical education sector and align it better with market needs. Despite the sector's potential for leveraging our economic transformation, poor planning and monitoring as well as a lingering bias towards general education have meant that Bangladesh is lagging behind its SDG target of ensuring wider and fairer access to quality technical education by 2030, according to CPD. In so doing, we are also failing our technical graduates as many of them remain unprepared for the job market, thanks to outdated training, curriculum mismatches, etc.\nWe, therefore, urge the government to take immediate steps to form an education reform commission, or separate, subject-specific committees, especially focused on higher education. Given the turbulence our educational landscape has witnessed and the course correction it requires amid changing realities globally, the authorities must go for significant reforms instead of always acting under pressure, which may cause further damage in the long term.\n",
        "headline_1": "Polytechnic crisis shows why an education reform commission is urgent",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/polytechnic-crisis-shows-why-education-reform-commission-urgent-3884041",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-05-2025"
    },
    {
        "full_article": "Sometimes a photograph does more than capture a moment. It reshapes how we think about presence, power, and leadership. It does not explain, it does not argue, but it lingers, working on us in ways we may not immediately register. That seems to be the case with the recent image of Tarique Rahman, the acting chairman of Bangladesh Nationalist Party (BNP), who has remained in exile since 2008, seated quietly with a cat. The photo circulated widely on social media. Viewers responded with curiosity, warmth, and even admiration. But its significance lies less in surface charm than in what it allows us, or perhaps invites us, to imagine.\nIn Bangladesh's political culture, leadership is often marked by confrontation. Visibility tends to mean protest, and legitimacy is typically demonstrated through rhetorical force. Authority is asserted through volume, repetition, and spectacle. A quiet image like this disrupts that familiar rhythm. There is no urgency, no slogan, no posturing. Instead, we see stillness and ease. A scene that, at first glance, appears apolitical begins to suggest something else: that leadership can project confidence through composure rather than command.\nIn Media and the Restyling of Politics: Consumerism, Celebrity and Cynicism, political theorists have noted this shift as part of a broader transformation in how leadership is performed. Symbolic gestures often carry more weight than speeches in an age shaped by digital media. People respond less to manifestos and more to emotional tone—to the atmosphere a figure creates, and the impression of steadiness or imbalance they leave behind. Presence now depends as much on how a leader makes people feel about themselves as on what they formally say or do. In that sense, what might seem like a fleeting moment of domestic stillness is, in another light, a calculated shift in tone. The image reframes the political figure not through assertion or debate, but through atmosphere, inviting viewers to imagine a softer, more composed side of leadership.\nOf course, performance and sincerity are not opposites. Not all performance is manipulative, and not all sincerity is unfiltered. However it came to circulate, the image now functions as more than a snapshot. It reflects intention, reveals personality, and resonates with broader meaning. In politics, as in art, the line between the posed and the real is rarely fixed.\nAmong younger citizens, particularly those fatigued by the formal language of party politics, such a gesture may resonate more than a manifesto. It does not demand allegiance or approval. It simply appears, allowing space for quieter forms of connection to take root. In a climate often defined by exhaustion and mistrust, even that suggestion can carry emotional weight.\nThe presence of the cat introduces a quiet contrast to the usual political image. It does not pose or perform. It simply stays close, at ease. In doing so, it helps shape the emotional tone of the scene. Cats are not easily coaxed into comfort. They respond to trust, not command. The fact that it sits calmly beside the political figure adds a layer of familiarity to the image, hinting at a kind of unspoken equilibrium between figure and animal. It gestures toward stability, but does so in silence.\nYet, images do not circulate in isolation. They enter political landscapes already shaped by memory, uncertainty, and the accumulation of unanswered questions. And this particular image, for all its charm, arrives under the shadow of a prolonged and unaddressed absence.\nTarique Rahman is no longer under legal sanction. The courts have cleared the way for his return. Yet, he remains outside the country. His online presence has grown more active. His digital persona seems more carefully managed. But his physical absence is no longer a side note. It has become central to how both allies and critics understand his political identity.\nPolitical theory reminds us that presence is not only physical; it is also ethical. To be present is to stand within the same space as those one claims to represent. It is to share their risks, frustrations, and hopes. Legitimacy comes not only from consent, but from visible accountability.\nThe reason behind Tarique's absence from the country remains unclear. Some point to strategic caution, others to unresolved tensions within the party. Some refer to informal pressures that operate outside the law. Still others speculate about personal or family considerations. All may carry some truth. But politics does not wait for resolution. In the silence, interpretations emerge, and they harden into public perception.\nThis context matters even more now. Tarique Rahman increasingly speaks of reform, restructuring, and renewal. His recent statements suggest a new political tone, possibly even a new direction. To some, this may signal growth, a departure from earlier modes of rhetoric. But these reflections, however genuine, are still voiced from afar. And distance inevitably dilutes conviction. If these words were spoken from within the country, and if they were followed by action, they would be heard differently. They would carry not just the idea of reform, but the burden of responsibility.\nWe live in a time where symbolic gestures can carry great political power. But symbols cannot bear the full weight of public trust. Emotional resonance matters, but it must be matched by embodied presence and real decisions.\nThe cat may sit calmly. The photo may soften perception. But presence, if it is to have meaning, must become more than an image. It must take form in a shared political reality.\nAnd in politics, the questions that go unanswered do not vanish. They gather force. Like a tiger crouching in the tall grass, they wait.\nKazi ASM Nurul Huda is associate professor of philosophy at the University of Dhaka. He can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "In the company of a cat",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-company-cat-3883966",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-05-2025"
    },
    {
        "full_article": "When we discuss water crisis in rural Bangladesh, we often talk about the coastal belt where approximately three crore people across 19 districts are said to lack access to safe drinking water. Women in these districts, including Khulna, Satkhira, and Bagerhat, often walk for miles carrying pitchers in search of water, their plight exacerbated by rising sea levels and erratic weather patterns that have pushed saltwater further inland, contaminating more groundwater sources. While this crisis is rightly recognised, even if solutions continue to be elusive, the plight of communities in the hills—including women—who also suffer from a similar crisis remains largely absent from national conversations.\nA recent report by this daily rightly turns the focus on women in Rangamati hills. Aptly titled \"Drops of water, waves of suffering,\" the report highlights the dual crisis involving shrinking water sources and women's backbreaking journeys to them. Women and girls in remote villages and hamlets have to walk for hours and miles to fetch water from wells that are steadily drying up. There are physical and emotional toll to be paid for these exhaustive trips: chronic back and knee pain, injuries, and dangers from wild animals and slippery trails. Another toll of this invisible labour involves risks of gender-based violence and missed opportunities for female students. In some areas, the crisis is so severe that villagers must cross rivers by boat to reach water sources.\nUnfortunately, this daily grind of women carrying heavy pitchers remains largely unrecognised, and unaddressed. Even though people in the Chittagong Hill Tracts (CHT) have historically struggled with water scarcity, thanks to limited or unequal access to wells, springs, and streams, the crisis has been exacerbated by deforestation and environmental degradation, unsustainable agricultural practices, and, of course, climate change. The lack of more reliable water sources like tube wells or rainwater harvesting infrastructure, as well as the challenges of transporting water across mountainous terrains, are adding to their struggles. This should be addressed with priority.\nPeople in the hills need long-term solutions, not scattered efforts. For them, the crisis is not just of water. Given how profoundly it impacts them, it is also a life crisis, a public health emergency, and a human rights issue.\n",
        "headline_1": "Do not ignore the women suffering in silence for water",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/do-not-ignore-the-women-suffering-silence-water-3881896",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 01, 2025 00:00:00  \nThe International Workers' Day popularly known as May Day has its origin in the United States of America but the day is not observed in that country or in Canada. This anachronism issues from the rival political systems of capitalism and socialism favoured by the US and the socialist bloc led by the Soviet Union. While an international federation of socialist groups and trade unions in 1889 decided to commemorate the Haymarket labour unrest and the following riot in which both workers and law enforcers died, America started distancing itself from the event's celebration. It was the first organised protest against labour exploitation and demand for eight working hours a day. If the socialists wanted to unite workers all across the world with the explicit aim of promoting socialism, the US under President Grover Cleveland, true to its capitalist character, felt unease with the socialist origin of the Haymarket tragedy in Chicago. So, Cleveland signed legislation on June 28, 1894 for official celebration of the Labor Day on the first Monday of September in recognition of labour movement and workers' contributions. \nHowever, in large parts of the world, including the West Europe, the May Day did not lose its appeal. Yet the designation of two separate days for observance of workers' rights and contributions to economic and human progress has certainly undermined its international sway. The US and Canada, with the former leading the world economy so long, have successfully deflated the attempt to have a united workers' platform or front that would be stronger as an international bargaining agency outside of the International Labour Organisation (ILO) under the United Nations. It is clear that even in developed democracies exploitation of the working class has not ceased to be. With the artificial intelligence gaining ground, large-scale automation now threatens to make several categories of manual labourers redundant in factories, industries and the service sector. Ironically, Donald Trump's 'America First' policy is not for the working class but proving beneficial to the rich and the superrich. \nAt home, robotic application is yet to be markedly discernible but automation in industries including the country's preeminent garment sector has already made quite an impact. In the days to come, some areas of RMG employment will be totally off limit to the traditional garment workers. Not only garment workers but also those of other manufacturing units in this country and elsewhere have always been discriminated against. Trump's reciprocal tariff policy and the increasing introduction of AI lurk as an assassin to pound on unskilled and semi-skilled workers, turning their future uncertain and bleaker than ever before. \nAgainst outrageous and ugly wealth accumulation by the rich and superrich, sections of people are finding themselves to be consigned to perpetual poverty, ill health and hygiene, illiteracy and deprivation for generations. The May Day is, in fact, more relevant today because the principle of 'right to work' or a decent livelihood option for all has to be established by any means. There is a limit to acquiring or expanding capitals and fuelling consumerism in the interests of the wealthy classes. People leading extreme lavish life and savouring limitless luxuries ought to have felt ill at ease or embarrassed in the face of starvation and dehumanisation ---an outcome of the exploitative system. On the occasion of the May Day, this privileged class everywhere should reflect on the purpose of wealth accumulation. Wealth becomes priceless if it is put at humanity's service. Workers also must prepare themselves to be equal to the fresh challenges.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "May Day commemoration",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/may-day-commemoration-1746027003",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       May 01, 2025 00:00:00  \n\nMay Day, also known as International Workers' Day, is a day of recognition and solidarity with the global labour movement. Celebrated annually on May 1st, it honours the enduring struggles and vital contributions of working people worldwide. It stands as a powerful call to continue the fight against exploitation and injustice, underscoring the importance of safeguarding workers' rights and ensuring their welfare. May Day also highlights the invaluable role of workers in driving economic development, societal progress, and nation-building. In observing the day, workers and different organisations hold rallies, seminars and various events, reaffirming their commitment to advancing the ideals of justice, dignity, and fair wages for all labourers.\nThis year, Bangladesh marks May Day at a pivotal moment. The Labour Reform Commission (LRC) has submitted its final report to the government, outlining a series of crucial recommendations. If accepted by political parties and effectively implemented, these reforms could significantly advance the rights and wellbeing of the country's 60 million working people. The LRC's recommendations span a wide range of issues, including the announcement of a national minimum wage to ensure a dignified standard of living for workers and their families, the reevaluation of salary structures every three years, compensation for delayed salary disbursements, implementation of annual wage increments aligned with inflation, and the creation of an emergency fund for workers in export-oriented industries. Other key proposals of the commission include easing conditions for forming trade unions, prohibiting the outsourcing of recruitment for permanent positions, providing six months of maternity leave for female workers, and establishing a permanent labour commission to oversee and enforce workers' rights.\nThe commission's report states that the national minimum wage will serve as the baseline for determining the wages of all workers, whether employed in institutional or non-institutional settings, by government or private entities, or even by foreign organisations and individuals. Meanwhile, sector-specific minimum wages would continue to exist, but they must not fall below the national minimum threshold. However, the real challenge would be its enforcement. In a country where a staggering 87.2 per cent of the workforce is employed in the informal sector, enforcement of a national minimum wage would be a monumental task. Over the years, the government couldn't even effectively enforce the minimum wage in the ready-made garment sector. And yet, the positive aspect of having a national minimum wage, as many believe, it would provide workers with a legal basis to demand fair remuneration. Moreover, if fair minimum wages are set through dialogue and consensus among all stakeholders, industrial unrests could be reduced to a large extent. \nThe Labour Reform Commission's recommendations regarding trade unions are equally significant. For years, both domestic and international stakeholders have raised concerns about the lack of effective worker representation. In many factories, this gap has often led to tensions between workers and employers, undermining a healthy industrial environment. The formation of trade unions is not only a fundamental right of workers but also a stabilising factor for smooth operation of industries. However, in Bangladesh, union activities are often perceived as conspiracies against industries and their owners. Yet the blame does not rest solely with employers. While some large unions exist, many have been co-opted to serve the interests of political parties rather than genuinely representing workers. Some labour leaders tend to exploit unions for personal gain, using union power to pressure employers rather than promote genuine dialogue to materialize workers' interest.\nIn absence of genuine representation, labour movements often culminate into factory vandalism and property damage, leading to unrest that ultimately harm workers' livelihoods. Trade unions are expected to address these issues and provide structured, constructive representation. \nCurrently, for a trade union to be registered, factories employing fewer than 3,000 workers require the signatures of 20 per cent of employees, while those with more than 3,000 workers require signatures from 15 per cent. The commission has proposed shifting from this percentage-based requirement to a fixed minimum number of workers, thereby simplifying the registration process. It also recommends the formation of a tripartite committee to draft detailed guidelines to further strengthen the trade union system.\nTo eliminate unhealthy practices in the name of unionism and restore trust in trade union activities, the operation of trade unions must be streamlined. A well-functioning trade union system-founded on accountability, transparency, and fairness-can protect workers' rights while also ensuring stability, sustainability, and growth in the industrial sector.\nThe Commission has also recommended significant reforms to existing labour laws-or the enactment of new, integrated labour legislation-to bring workers from all sectors, industries, and organisations under legal protection. To support this, it proposes the establishment of a National Labour Force Registration System and Information Repository, along with an increase in the number of labour courts to ensure more efficient dispute resolution. Additionally, it recommends that every worker receive an employment letter, identity card, or certificate, and proposes the introduction of a worker-friendly pension scheme under the National Pension Scheme, along with card-based ration distribution for workers in industrial and rural areas. These reforms address long-standing demands of workers across all sectors, and the Commission has rightly acknowledged their urgency.\nThe government is expected to share the Commission's recommendations with political parties to build consensus around the proposals. While there seems to be little justification for any party to oppose reforms aimed at ensuring workers' rights and protections, the real question is whether political actors will prioritise the interests of workers over those of factory owners.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "May Day and a call for  labour reforms",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/may-day-and-a-call-for-labour-reforms-1746027057",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 01, 2025 00:00:00  \n\nOne of the most feasible solutions to the problem of traffic congestion in Bangladesh is the use of smart traffic control systems. Unlike the traditional fixed-timer traffic signals that are being used, smart systems operate on Artificial Intelligence (AI) and real-time data to monitor and control traffic flow dynamically. Through the use of smart sensors, cameras, and networked software platforms, traffic flows can be monitored in real-time. Traffic lights may also be automatically configured to show signaling times based on the volume of traffic on one road. If a road has more traffic, for example, the duration of the green can be longer to allow more vehicles to pass while reducing excess idle time on open or less travelled roads.\nSecondly, smart traffic systems are capable of detecting accidents, breakdowns, or traffic congestion on roads and route traffic in a second to prevent traffic jams. The system will also provide real-time information through mobile applications, which would allow the drivers to choose less congested routes and bypass congestion spots. It would need investment in digital infrastructure in the form of high-tech cameras, vehicle sensors, AI-powered traffic control centers, and training of traffic management agencies for this system. But the long-term benefits of reduced journey times, reduced fuel usage, and improved road manners would far outweigh the initial investment. These smart systems have already proven to be useful in Singapore, London, and Seoul. Such technology adoption in Bangladesh would revolutionise city traffic management and give an incredibly effective tool for curbing the ever-increasing traffic woes of metropolitan cities.\nAtikurRahman \nStudent \nBBA Department \nNorth South University \natikur.rahman.nsuf@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "A modern solution to traffic jam",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/a-modern-solution-to-traffic-jam-1746027176",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 01, 2025 00:00:00  \n\nWhen we think of the renowned \"Boishakhi Mela\" (Boishakhi Fair), our minds are immediately drawn to \"Pahela Boishakh\" - the first day of the Bengali New Year - and the long-cherished traditional wrestling event, \"Jabbarer Boli Khela.\" Every year, the vibrant Boishakhi Mela comes alive in the port city of Chittagong during the month of Boishakh, offering a rich display of tradition and festivity.\nLocal artisans and vendors set up stalls at the largest fair of the region, selling an array of beautiful handcrafted items. Visitors can find clay toys, handmade fans, jugs, flower tubs, glassware, mats or shitalpati, traditional tamatam carriages, and many other traditional products. People from diverse backgrounds flock to the fair, creating a lively atmosphere that embodies the spirit of Bengali culture.\nDespite the city's relentless pace, the Boishakhi Mela retains its timeless charm and festive spirit, drawing people together in celebration. It serves not only as a marketplace but also as a vibrant social gathering, promoting communication, bonding, and the joy of shared experiences.\nThe arrival of the Bengali New Year fills us with a renewed sense of hope and excitement. Visiting the Boishakhi Fair has become an essential part of our New Year festivities - a tradition that connects the past with the present. How could we let the New Year pass without stepping into this colorful fair? How could we let our spirits fade without embracing the joy it brings?\nAs time moves forward and generations succeed one another, the Boishakhi Mela continues to teach the values of our rich cultural heritage. It reminds the younger generation of the importance of preserving and cherishing our traditions, ensuring that the vibrant spirit of Bengali culture lives on forever.\nMd Tousif Raihan\nStudent\nDepartment of Criminology and Police Science\nUniversity of Chittagong\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Boishakhi Mela in Chittagong",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/boishakhi-mela-in-chittagong-1746027200",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-05-2025"
    }
]