[
    {
        "full_article": "On the first leg of his tour East, Prime Minister Narendra Modi travelled to Japan for a two-day visit for the 15th Annual Summit with Japanese Prime Minister Shigeru Ishiba before moving to Tianjin to attend the SCO Summit. The last summit, in India, was in 2022. The two sides issued at least a dozen documents, aimed primarily at updating their agreements and giving them a “Next-Gen” focus. Japanese businesses have raised their investment targets in India to $68 billion and signed about 170 MoUs with Indian partners. Apart from the Joint Statement, there was a 2035 Vision Statement, including eight areas of cooperation such as economic security, mobility and green technology transition. A “Next-Gen State-Prefecture Partnership” highlighted grassroot-level ties and a boosting of direct flight connectivity. India and Japan updated their 2008 Security partnership to include an annual NSA-level dialogue, more engagement over the Quad, Indo-Pacific cooperation and UN Security Council reform. Of interest is their Economic Security Partnership goal to build resilient supply chains and secure critical infrastructure, using Japanese technology to help manufacture and process semiconductor technology in India, as Indian companies face Chinese restrictions on the export of rare earth magnets. Japan’s collaboration with India’s High Speed Rail “Bullet Train” project was showcased, with Mr. Modi and Mr. Ishiba travelling to Miyagi province by train, where they also inspected a semiconductor factory. The joint statement included strong language condemning North Korea’s missile tests and nuclear programme, and the Pahalgam attack and cross-border terrorism, albeit without mention of Pakistan. The leaders also stressed the importance of the upcoming Quad Summit of leaders in India this year, which has come under a cloud over Mr. Trump’s actions against India.While the text of the India-Japan meetings was largely bilateral, the subtext was geopolitical. Mr. Modi flew to Tokyo in the wake of the massive American tariffs which threaten to upturn the Indian economy. He also chose to make Japan his first stop before his talks with Chinese President Xi Jinping on Sunday (August 31, 2025) towards normalising relations after a four-year standoff. Japan too is concerned about the situation in the East China Sea, and has tensions over trade with the U.S., which led it to cancel a trade negotiation team visit to Washington. The message that Mr. Modi and Mr. Ishiba sent out was that amidst geopolitical turmoil caused by global powers, the India-Japan relationship remains stable and continues to grow.READ MORE Published - September 01, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Japan\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        summit\n                    \n                            /                      \n                        \n                        foreign investment\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        green technologies\n                    \n                            /                      \n                        \n                        air transport\n                    \n                            /                      \n                        \n                        security\n                    \n                            /                      \n                        \n                        semiconductors and active components\n                    \n                            /                      \n                        \n                        rare earths\n                    \n                            /                      \n                        \n                        manufacturing and engineering\n                    \n                            /                      \n                        \n                        railway\n                    \n                            /                      \n                        \n                        Mumbai\n                    \n                            /                      \n                        \n                        Ahmedabad\n                    \n                            /                      \n                        \n                        North Korea\n                    \n                            /                      \n                        \n                        missile systems\n                    \n                            /                      \n                        \n                        nuclear policy\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        USA",
        "headline_1": "Renewed focus: On India-Japan ties",
        "headline_2": "India and Japan showed that their ties were stable amid a global churn",
        "link": "https://www.thehindu.com/opinion/editorial/renewed-focus-on-india-japan-ties/article69996812.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-09-2025"
    },
    {
        "full_article": "Time is of the essence in science. The report that 75 women selected for the Department of Biotechnology’s Biocare programme have received neither sanction letters nor salaries is reminiscent of an irksome and persistent malaise in India’s research administration. Young researchers already contend with scant laboratory space, cumbersome university bureaucracies, labyrinthine grant applications, uneven mentorship and uncertain career prospects. Salaries and fellowships are modest in relation to living costs, which deters talented graduates from pursuing research. Even those determined to stay are often trapped in protracted postdoctoral or contractual roles without long-term security. In this milieu, a scheme such as Biocare promises an independent foothold while its failure to deliver on time magnifies the insecurity and discouragement. Opportunities for postdoctoral work and tenure-track openings abroad are also narrowing. Immigration regimes in the West have become tighter while competition for limited faculty posts has intensified. For Indian scientists, thus, the domestic research ecosystem is increasingly the arena in which their careers will unfold. Delays in disbursing fellowships and grants can derail entire careers.India can no longer afford to treat such breakdowns as teething troubles. The country aspires to expand its global scientific standing, to convert research into innovation, and to train a generation of scientists to address pressing challenges in health, energy, agriculture and climate resilience. These ambitions are incompatible with a funding administration that falters at basic execution. The switch to the Treasury Single Account system, the stated reason for the Biocare delay, may strengthen transparency in the long run but there are several reasons for urgent administrative maturity right now. Foremost, science is time-sensitive: experiments must begin when facilities, collaborators and seasonal or biological conditions align. Delays break these cycles irreversibly. Second, when schemes that are progressive on paper fail to reach beneficiaries, the resulting credibility deficit will make it harder to attract domestic talent and international partnerships. Third, equity demands consistency. Women scientists, early-career fellows and those from under-represented backgrounds already contend with systemic barriers. Erratic access to funds affects them disproportionately. Scheme design must incorporate rather than externalise enforcement. Transparency must be implemented with contingencies so that beneficiaries do not become collateral damage in bureaucratic transitions. Accountability must be tightened at the level of Ministries and programme managers. Policymakers must recognise that a delay in accounting procedures for them is the interruption of livelihoods and careers for researchers.\rREAD MORE Published - September 01, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        biotechnology\n                    \n                            /                      \n                        \n                        government departments\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        research\n                    \n                            /                      \n                        \n                        university\n                    \n                            /                      \n                        \n                        finance (general)\n                    \n                            /                      \n                        \n                        immigration\n                    \n                            /                      \n                        \n                        Europe\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        gender",
        "headline_1": "Recurrent irritant: On funds and research in India",
        "headline_2": "Delay in disbursement of funds and salaries can derail research projects",
        "link": "https://www.thehindu.com/opinion/editorial/recurrent-irritant-on-funds-and-research-in-india/article69996804.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-09-2025"
    },
    {
        "full_article": "A new study shows how simple habits like washing hands can save lives in hospitals.\nWhen people go to hospitals, they hope to get better. But sometimes, they catch something even worse there – dangerous “hospital germs.” These germs, like bacteria and fungi, can sneak into a patient’s body and cause deadly infections. Doctors are so worried about this that they often send patients home as soon as possible, just so they don’t pick up one of these infections.\nOne common way these germs travel is through special tubes called central lines. These tubes are used for very sick patients to give them medicines, fluids, or nutrition. But here’s the scary part: in India, almost 9 out of 1,000 central lines cause serious infections. In the US, it’s less than 1 out of 1,000. Even worse, around 40 out of 100 patients who get this infection die. And yet, doctors say these infections can be completely prevented.\nSo how? The answer is simple – basic hygiene. A famous doctor in America, Dr. Peter Pronovost, made a simple checklist in his hospital: wash your hands with soap, wear gloves, clean the skin, and use clean drapes before putting in the tube. Nurses were told they could stop a doctor if they skipped a step. Before this, almost 1 in 9 patients got infected. After following the checklist, the infection rate dropped to zero within a year!\n\n",
        "headline_1": "The Scary Germ Story",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/the-scary-germ-story/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-09-2025"
    },
    {
        "full_article": "India’s Prime Minister Modi met China’s President Xi in Tianjin, and the meeting mattered a lot. India and China have had a rocky relationship for decades — sometimes friendly, sometimes full of tension, like the recent border clashes in Ladakh. But this time, Modi told Xi that India wanted to build ties based on trust and respect.\nThree big things are happening here:\nIndia’s Independence in Decisions\nIndia doesn’t like to be bossed around by any country, even powerful ones like the US. When Donald Trump was president, he often threatened countries with tariffs (extra taxes on trade) to get his way. But India didn’t give in — it kept buying oil from Russia and stayed firm. Meeting Xi was Modi’s way of saying: India will make its own choices.\nChina’s Changing Mood\nIn recent years, China had been very aggressive in its foreign policy (nicknamed “Wolf Warrior” diplomacy). But now it seems to be softening a bit, because its economy is slowing down, real estate is in trouble, and many young people can’t find proper jobs. Still, India is being careful — it’s improving its military along the border while also trying to reset ties with China.\nTrade & Money Matters\nTrump’s trade wars shook up global markets. India needs new places to sell its goods, and China could be one. If China gives India fair access to its markets and restarts supplying important materials like rare earths, both sides could benefit. India may even allow more Chinese investments here, except in sensitive areas like telecom or defence. At the same time, China also needs new economic options.\nSo, this meeting wasn’t just handshakes and smiles — it was about sending signals. India is telling the world it wants to stay independent, protect itself, and grow stronger through smart partnerships.\n\n",
        "headline_1": "Signals Between India & China",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/signals-between-india-china/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-09-2025"
    },
    {
        "full_article": "New study shows how basic hygiene can reduce infections in Indian hospitals\n‘Hospital infections’ are often more dreaded than a patient’s illness. Bacterial and fungal germs that enter the bloodstream are hardy survivors, nearly impossible to defeat. It’s why doctors can’t wait to pack post-surgery patients home, just so they’re protected from catching a hospital bug. Overuse of antibiotics has rendered the strongest of drugs toothless against these persistent infections. Now, the results of a seven-year study coordinated by AIIMS and funded by US’s CDC, has quantified the medical fraternity’s apprehensions. One major route that ferries hospital germs are central-line tubes inserted for chronic conditions or in very sick patients to deliver medicines, fluids, nutrition. The rate of CLABSI (central line-associated bloodstream infection) is high for Indian hospitals, almost 9 per 1,000 central line-days. In US, this was less than 1 infection for every 1,000 central-line days. About 40% of patients with CLABSI die. The sobering point – these infections are entirely preventable.\nHospitals may want to see how best to follow the example of Johns Hopkins ICU, as narrated by surgeon Atul Gawande in The Checklist Manifesto. In 2001, critical care specialist Dr Peter Pronovost in Hopkins ICU took a leaf out of the aviation sector – the checklist – and supported nurses to call out any doctor who didn’t follow the five basic steps (wash hands with soap, wear gloves etc) when inserting a central line. At the time in Hopkins ICU, about one line in nine was getting infected. Dr Pronovost knew doctors were skipping at least one critical step. Following protocol ensured that within a year, central line infection rate dropped from 11% to zero. It isn’t rocket science. As the latest study’s authors noted, India’s challenge is basic – staff strength and training. What will it take for our doctors and nurses to wash hands with soap, wear gloves etc, and use sterile drapes when inserting central lines?\n\n",
        "headline_1": "Grim Soap Opera",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/grim-soap-opera/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-09-2025"
    },
    {
        "full_article": "Tianjin saw Modi reaffirm strategic autonomy. In Trumpian world, India-China ties acquire significance\nOne way to look at the Modi-Xi meeting is that it’s another thaw in a bilateral relationship that’s seen all kinds of temperatures. Right from 1949, there have been periods of deep dissonance and almost-comfortable convergence. Two of the world’s major economies now seem ready to come out of their latest cycle of difficulties that began with PLA incursions in eastern Ladakh. As the accompanying commentary mentions, the process had started at the Brics summit in Kazan, Russia in Oct last year. Yesterday at Tianjin, Modi told Xi that India was ready to advance ties on the basis of mutual trust, respect and sensitivity – words that weren’t bland diplomatese but signalled something significant.\nThat brings up the first of three dynamics at play. India values its strategic autonomy. Trump’s do-as-I-say or I’ll-tariff-you chaos had put this principle to severe test. Modi didn’t budge, didn’t humour Trump’s absurd Nobel Prize fantasies, told his officials not to respond to provocations from Trump’s team, didn’t – and won’t in near future – backtrack on buying Russian oil. The meeting with Xi was Modi’s clear signal that India will pursue strategic autonomy.\nSecond, China’s approach is influenced by its internal dynamics. The ‘Wolf Warrior’ diplomacy of the last few years has toned down in favour of a more cooperative approach. This could be due to a combination of China’s slowing economy, problems with sectors such as real estate, and high youth unemployment that has spawned pretend work companies. Yes, there may be another turn towards ultra-nationalism in Chinese politics. India knows it has to hedge against this by shoring up its defences along LAC, while resetting its China ties.\nThe third dynamic is geoeconomic. Trump’s tariffs are re-writing rules of global trade. India needs to find new markets. New Delhi would like Beijing to provide fair access to Indian exports. True, this won’t fully compensate for the losses in the US market. But the trade imbalance can be compensated by Chinese investments in India. If China actually resumes supplies of critical inputs for Indian industry like rare earth magnets – something it has promised – India could, over time, allow the resumption of automatic Chinese FDI barring a small negative list that would include telecom, defence, semiconductors and other strategic sectors. Beijing too needs more economic elbowroom amid Trumpian disruption. The China signal is one that India needs to send carefully, but strongly.\n\n",
        "headline_1": "Signal & Substance",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/signal-substance/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 01, 2025 00:00:00  \nAmidst rampant price manipulations, hoarding and market syndication to jack up prices without rhyme or reason, the government's move to replace an antique law named the Control of Essential Commodities Act 1956 with the Essential Commodities Act 2025 deserves applause. For decades, the list of essential commodities and the penalties for their manipulation have been determined by a 1956 law that has long outlived its relevance in today's volatile global and local market dynamics. The extent of its obsolescence is evident from the fact that it even lists cigarettes among essential commodities. How such an outdated law managed to remain in force even after five decades of independence is a serious question in itself.\nThe proposed law rightly seeks to update the list of essential commodities to reflect present-day household needs. Reportedly, rice, wheat, flour, poultry, eggs, fish, milk, potatoes, cooking essentials, detergents, and even toothpaste and safe drinking water are set to be brought under its purview. More importantly, it aims to introduce stricter punitive measures, including five to eight years of imprisonment along with fines for those found guilty of hoarding, price-fixing, or violating market orders. Such deterrence, if implemented rigorously, could go a long way in curbing the syndicate culture that has kept consumers hostage for years.\nYet, if past experience is anything to go by, legislation alone cannot stabilise markets. Over the years, several laws have been enacted to protect consumer rights, ensure food safety and promote fair competition. But most of them remain effective only on paper. The Consumers' Rights Protection Act 2009, for instance, has failed miserably to safeguard people's rights to safe food and services. More than one and a half decades after its passage, the consumers' rights continue to be undermined virtually in every sphere of life. Citizens are forced to buy adulterated foods, fake medicines and even contaminated baby food at unfair prices. They risk their lives under the scalpels of fake doctors and are compelled to submit to the whims of unscrupulous traders, transport owners and workers. Institutions such as the Directorate of National Consumer Rights Protection (DNCRP) were formed to enforce these laws, but they too have fallen short of expectations due to structural weaknesses and lack of capacity.\nIt is therefore clear that the government's real challenge lies not in repealing outdated laws and passing new ones, but in ensuring their rigorous enforcement. As long as enforcement remains weak, food adulteration, price manipulation and market syndication will continue to flourish, rendering even the most well-intentioned legislation ineffective. For the new law to succeed, regulatory bodies such as the DNCRP must be equipped with adequate authority, manpower and independence to act decisively against violators. If enforced strictly and impartially, it could bring the much-needed relief to millions of households struggling with the frequent price hike of essential goods. At a time when most consumers are tormented by relentless inflationary pressures, they deserve more than lip service and false hope. The government must prove that it truly means business. The Essential Commodities Act 2025 must not become yet another paper tiger.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Repealing essential commodities act  long overdue",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/repealing-essential-commodities-act-long-overdue-1756654061",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       September 01, 2025 00:00:00  \n\nThe call for making financial transactions of the country fully digital has of late reached its crescendo. Experts at an event titled, \"Cashless Bangladesh Summit 2025\", organised last week, acclaimed an economy without physical money and made a strong case for Bangladesh going cashless. To that end, they advised necessary policy support, improvement of infrastructure and undertaking wider adoption strategy and thereby reduce over-dependence on physical currencies. Notably, the Bangladesh Bank (BB), has charted out a slew of ambitious plans since the previous government to carry out 75 per cent of all financial transactions digitally by 2027. But so far, except for the phenomenal rise in the transactions conducted through Mobile Financial Service (MFS), which according to an estimate amounted to Tk17.37 trillion in 2024, bank customers remained basically loyal to cash. They use the digital mode simply as a way of transferring cash from their bank accounts to the points where they want to withdraw it through the Automatic Teller Machine (ATM) terminal. But that is nowhere near going cashless. Small wonder that the BB's efforts at launching online payment systems like Binimoy, TakaPay, Bangla QR code in line with India's Unified Payments Interface (UPI) or China's Alipay or Wichat Pay, did not take off. Binomy's objective was to create an interoperable digital platform so that seamless and cost-effective fund transfers between banks, Mobile Financial Service (MFS) and Payment Service PS) providers could be made. As expected, the idea was to reduce the financial system's reliance on cash. But thanks to general customers' lack of awareness and the non-cooperation from banks to integrate with the system, the project ultimately fell through. Similarly, the TakaPay, which like the international payment networks, Visa and Mastercard, was a domestic debit card and a secure payment method operating through the National Payment Switch Bangladesh (NPSB), the BB's digital payment platform. Financial transactions through TakaPay could be done through ATMs and Point of Sales (POS) terminals and other online platforms. Once popularised, it could promote local currency use and replace Visa or Mastercard in payments within the country. That would help save a lot of foreign currency. But for reasons similar to those faced by Binimoy, it failed to catch the customers' fancy. Similarly, the BB-launched Bangla QR (Quick Response) code, a two dimensional machine readable bar code option that can store more data than the traditional one-dimensional option could also be used as a standardised mode of transactions across all digital payment platforms and banks. \nBut it, like other online payment systems, also failed to gain traction. However, political change and other uncertainties in the economy might have led to these potential digital payment scheme's failure. In fact, the required digital infrastructure was lacking at the banks to make use of the apps to facilitate such transactions. But are we sure, if these digital payment systems could be popularised, our financial system would be foolproof? No doubt, there are many positive aspects of a financial system based completely on digital form of money which does not require a physical space to store, or transports to transfer from one place to another and the central bank doesn't have to print paper currency or mint coins. Obviously, a government could be saved from incurring the costs of producing and handling physical money. Also, the transactions would be faster, more transparent, could be easily traced, monitored and, of course, surveilled. As the transactions are transparent, it would theoretically be harder for corruption to take hold. It is said that in the absence of physical money, there would be fewer instances of crimes like robbery, burglary, etc.\nWell, people who have little access to the banking system, could well be brought under the digital financial network. These are all very good and widely circulated merits of a possible cashless economy. In fact, advances like biometrics, which measure and analyse an individual's physical and behavioural characteristics, make copying or other forms of fraudulence real hard. Also, consider the embedded microchips, near field communication (NFC) technology, address verification service (AVS), geolocation, digital wallet and AI-based payment systems. These definitely strengthen security of digital transactions and act as milestones in the march towards a cashless society. \nHowever, the bitter experience of 2016, when hackers broke into Bangladesh Bank's security architecture and then sent fake fund transfer requests through the SWIFT network (a secure international messaging service connecting thousands of financial institutions worldwide) to the Federal Reserve Bank of New York. They were actually able to transfer US$101 million to accounts in Sri Lanka and the Philippines and the money was later laundered through the Philippine's casinos. It exposed the weakness of digital security of the global digital payment network SWIFT as well as the vulnerability of digital transactions in our financial service itself when faced with cybercrime. So, as claimed by the advocates of a digital-only, cashless economy, the argument is not really watertight.\n The Covid pandemic (which starting from the third week of December 2019 raged through the world till mid-March 2022) was instrumental in popularising online financial transactions as it helped avoid physical contact. But that does not mean that people's love for centuries-old paper currency (first used in seventh Century China and introduced in Europe in mid-17th Century) or for the millennia-old the metallic coin (introduced in ancient Lydia of modern-day Turkey in 7th Century BC) would vanish in a jiffy. According to a report published in Britain before the pandemic, up to one in five British citizens could be left behind if a digital-only transaction was established. If that is the case with a technologically advanced society like Britain, then there is a need for real statistics to gauge how the older educated generation, let alone the little or unlettered masses in the countryside, would fare under a fully digitised financial system. So, the paper currency and metallic coin may not entirely fall into disuse in the near future.\nHowever, such arguments against cashless economy are not meant to infer that the efforts towards digitizing the country's financial transactions, especially payment protocols, are a futile exercise. It must go with the stream of financial technology and adapt to its latest advancements. But at same time, it would be thoughtless to erase the time-tested modes of transactions evolved over the millennia at one go.\nImagine a powerful solar magnetic storm impacting the Earth's atmosphere or a nuclear war, disrupting or erasing all the world's electronic communications and information storage systems. The indelible metal and paper-based money as well as records and storage systems would then come to our rescue.\nGod forbid, the world may not have to see such a day!\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "How wise is it to go  entirely digital?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/how-wise-is-it-to-go-entirely-digital-1756654142",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       September 01, 2025 00:00:00  \n\nThe interim government is all set to replace the existing \"Control of Essential Commodities Act 1956\" with a new one titled \"Essential Commodities Act 2025\" with the express aim of stabilising market. Mere change in the name of any law does in no way guarantee that the stated purpose will be served. The Section 6 under the legal provision of the 1956, provided for three years' imprisonment with or without fines for violation of the marketing order. Now the proposed Essential Commodities Act, according a decision of a high-powered meeting held recently, will stipulate more stringent punishment for similar offences. This law to be enacted within two to three months will provide for punitive measures, claimed to be deterrent, like five to eight years' jail with fines \"for violations of the marketing order or for hoarding and blatant price manipulations\". 'Marketing order' may cover the whole gamut of market mechanism but it is yet to be precisely defined and so far remains confusing.\nAlthough a tall claim has been made that the proposed law will be framed in the context of local and international market dynamics, a close look sees nothing extraordinary other than rhetoric or play of words that marks all such occasions of legal enactment. The people here have bitter experience of how very sound laws have fallen into disuse because of the absence of matching implementation or execution strategy. A senior official of the commerce ministry claims that the new commodity law is going to be framed in a way that protects the consumers' interests so much that they would be able to purchase the listed essentials at fair prices. The new law, notably, would add essentials like rice, flour, milk, poultry, eggs, fish, potato, detergents, black cumin, green chili and drinking water. \nWhat impression does it give? As if a change in the legal nomenclature and addition of a few more essentials will automatically bring the market to order and the consumers will enjoy a fair price regime there! This is sheer naivety! There are serious complaints against the implementation of the existing 1956 legal provision. The law may not be cent per cent perfect but whatever range and scope it had was never given a serious try for execution. Mobile court operation was nothing but a mere show only to hoodwink the general public. \nThe most important point here is to devise a strategy for implementation of the law. Laws have to be effectively executed.Their sections, clauses and by-laws can be of help in complicated matters but essentially it is the unwavering and unbiased execution of the provision that clinches the day. Nowhere is there any hint that those to be assigned to make the law will as well make a roadmap for its implemenation. Belling the cat is the crux of the problem, who will take that important responsibility and how, is the million-dollar question. \nThe market players are a powerful quarter, appearing, more often than not, stronger than the government. What happened in case of the misnomer of rice such as 'miniket', 'nazir shail' in recent times may give an idea of the arm-twisting tactics powerful business syndicates use to get away with their malpractices and price hike intrigues. Instead of referring to their excessive cutting and polishing of coarse varieties such BRRI 28 paddy, let alone acknowledging the offence, they brought the plight of the poorer segments of people and farmers who would be left with no option but to helplessly watch their yield rot if the millers did not purchase those. The commerce ministry conveniently overturnerned the ruling of the Directorate of the National Consumer Rights Protection (DNCRP). \nThis is a nasty example of how the instituions here are not allowed to grow and become powerful. The bureaucracy calls the shot and the people's interests are sacrificed. There are reasons to be apprehensive of the proposed law embracing the same fate as many such highly acclaimed laws have done before.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Old wine in new bottle!",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/old-wine-in-new-bottle-1756654193",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 01, 2025 00:00:00  \n\nBangladesh's negotiations to purchase twelve Chinese J-10C multirole fighters, a deal estimated to cost over US$ 500 million, are often framed purely in military terms. Yet, the financial and economic implications of such a procurement demand far more rigorous scrutiny. The catastrophic crash of an outdated F-7BGI in July 2025 starkly demonstrated the dangers of relying on aging aircraft, making fleet modernisation not merely desirable but a prerequisite.\nThe J-10C, equipped with a sophisticated AESA radar and beyond-visual-range engagement capabilities, indeed represents a generational leap in combat technology. However, the economic burden of this acquisition extends well beyond the nominal US$ 40-45 million price per aircraft. Costs associated with pilot training programmes, specialised armaments, and long-term maintenance contracts will inevitably strain the country's limited foreign exchange reserves. With Bangladesh's defence budget shrinking and dollar liquidity under pressure, a simplistic \"buy and fly\" approach is a financial luxury the nation cannot afford. Without careful planning, this strategy risks marginalising local entrepreneurs and engineers while adding to national debt liabilities.\nInternational experiences, particularly from countries such as Turkey and Brazil, demonstrate that defence purchases can be leveraged to cultivate domestic aerospace industries, promote technology transfer, and stimulate derivative commercial ventures. If Dhaka structures the J-10C acquisition to include meaningful offsets -- such as local assembly, component manufacturing, and domestic training institutions -- it could foster an ecosystem that strengthens national security while simultaneously diversifying the industrial base. Such a strategy would turn the fighter jet deal into an engine for broader economic development rather than a mere line item on a balance sheet.\nWithout this forward-looking approach, these jets risk becoming expensive ornaments on the tarmac, draining the exchequer without yielding long-term benefit. Ultimately, the real test of this procurement is not just whether Bangladesh can achieve superior aerial capability, but whether it can build the economic pillars necessary to sustain and capitalise on that capability.\nJakia Jafrin Esha \nBBA\nNorth South University \nJakia.esha.232@gmail.com \nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "J-10C fighter jet deal: An economic litmus test",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/j-10c-fighter-jet-deal-an-economic-litmus-test-1756654214",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-09-2025"
    }
]