[
    {
        "full_article": "The Congress is in a spot in Karnataka. Chief Minister Siddaramaiah and Deputy Chief Minister D.K. Shivakumar are locked in a power tussle, as the deputy wants to replace the leader, who is in no mood to oblige. When they both assumed their current positions in 2023, it was reportedly based on a mutual agreement which also provided for a mid-term change of guard. Only the central functionaries of the Congress and these two leaders know the exact details of the power-sharing arrangement that was agreed upon in 2023. If indeed there was an agreement that Mr. Shivakumar would be handed over the baton, it is only honourable for that to be enforced by all involved, particularly the party supremo Rahul Gandhi. Mr. Shivakumar has remained loyal to the party through difficult times, facing cases and imprisonment, and accused of corruption by central agencies. While Mr. Shivakumar is valuable for the Congress for his organisational and managerial skills, which inspire confidence among party workers even beyond Karnataka, Mr. Siddaramaiah is valuable for a different reason. His standing as a champion of social justice enabled the Congress to widen and consolidate its acceptance among the subaltern communities in the State. The Chief Minister has dug his heels in, knowing that replacing him with Mr. Shivakumar, who hails from the dominant Vokkaliga community, is not an easy choice for the party. A Vokkaliga at the top can create a rupture in the Congress’s social base in Karnataka, and that works against Mr. Shivakumar. That is the deadlock.It is high time Congress leaders at the State and national levels look beyond their narrow individual interests and calculations. In fact, the party could use the tussle in Karnataka to shuffle its deck nationally. Congress president Mallikarjun Kharge is also from the State. If the social dynamics of the State make it risky to make Mr. Shivakumar the Chief Minister, the Congress could consider Mr. Kharge, a Dalit who has lost out in the race for the post more than once in the past. Mr. Kharge might be acceptable to all factions and, most importantly, to the party’s social base. The Congress is in desperate need of a leadership overhaul, particularly in the Hindi belt where it is struggling to match up to the Bharatiya Janata Party’s overwhelming capacity. It needs a mix of people with various skills — experience of running the party and contesting elections, ideological clarity, and realpolitik — to steer it out of the current logjam. Any of these would be possible only if key leaders are willing to make some personal sacrifices for the good of the party, and Mr. Gandhi himself driving that conversation.  Published - December 01, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        welfare\n                    \n                            /                      \n                        \n                        Caste\n                    \n                            /                      \n                        \n                        dalits\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party",
        "headline_1": "Tough choices: On the Congress in Karnataka",
        "headline_2": "The Congress’s troubles in Karnataka are symptomatic of a deeper malaise",
        "link": "https://www.thehindu.com/opinion/editorial/tough-choices-on-the-congress-in-karnataka/article70341897.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-12-2025"
    },
    {
        "full_article": "Exactly two decades after hosting its maiden Commonwealth Games (CWG), India will welcome the quadrennial extravaganza’s centenary edition to its shores in 2030. The move is another unmistakable sign that India wants to be seen as a sports destination of repute. The choice of Ahmedabad as the host city is strategic too, for India has submitted the Letter of Intent to hold the 2036 Olympics with Ahmedabad as the front-runner. However, while the Olympics retains its allure and grandeur, the CWG has been beset with difficulties. Once signifying the imperial unity of the British empire, the CWG is struggling for relevance in the post-colonial world. Successive host cities have dropped out citing rising costs – Birmingham replaced Durban in 2022; Glasgow has come to the rescue for 2026 after the Australian State of Victoria withdrew, and Ahmedabad has stepped in for the Canadian province of Alberta. Not so long ago, India itself was cold to the competition, with the then Indian Olympic Association president Narinder Batra, in 2019, calling it “sub-standard” — albeit in his personal capacity — and strongly pitching for India’s withdrawal. Also, when New Delhi conducted the Games in 2010, there were allegations galore of large-scale corruption and incompetence.So, what merit does India see now? First, it is an important soft-power medium. Second, the nation’s sporting aspirations have grown manifold, and though performances by its sportspersons have not kept pace, there is a genuine push toward diversifying on-field excellence and going beyond just cricket. India has world-class heroes such as double-Olympic medallist javelin thrower Neeraj Chopra to showcase, and there is hope that big ticket events, when held in one’s backyard, can inspire a generation. There is the infrastructural uplift they can trigger, helping not just the athletes but also the public at large. But there are potential pitfalls too. In sporting terms, the CWG stands diminished. Glasgow 2026 will feature just 10 disciplines, and those such as badminton, hockey, shooting and cricket have been excised. There are very few sports that match up to international standards, for nations such as the United States and China are not part of the Commonwealth. India has won 61, 66, 64, 101 medals in the last four editions, but in the subsequent Olympics, it has secured just six, seven, two and six medals, respectively. India also has an escalating problem with doping, which can mar its standing if left uncontrolled. The financial outlay for the CWG should be kept in mind too, for costs can be prohibitive. Ahmedabad 2030, thus, offers opportunity and hope. It should be used to display a strong present and shape a glorious future. Published - December 01, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Commonwealth Games\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Ahmedabad\n                    \n                            /                      \n                        \n                        Olympics\n                    \n                            /                      \n                        \n                        corruption & bribery\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        badminton\n                    \n                            /                      \n                        \n                        Hockey\n                    \n                            /                      \n                        \n                        shooting\n                    \n                            /                      \n                        \n                        cricket",
        "headline_1": "2030 for 2036: On Ahmedabad, the CWG, the Olympics",
        "headline_2": "India is trying to showcase Ahmedabad’s sports infrastructure in Olympics bid",
        "link": "https://www.thehindu.com/opinion/editorial/2030-for-2036-on-ahmedabad-the-cwg-the-olympics/article70341912.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-12-2025"
    },
    {
        "full_article": "Product design is dying, India should revive it \nWhy did T800, the Terminator, have an internal display reading out data in English, when it was an autonomous machine ‘thinking’ in zeroes and ones? Well, it needed the ‘feature’ to reinforce the character’s ‘machineness’ – a purpose arguably better served by Schwarzenegger’s wooden dialogue delivery . In that light, T800’s display was genius design. Alas, judging by all the new stuff on our shelves and streets, the design genie has left the building. \nTime was when even Robinson Crusoe, when he returned to civilisation, wouldn’t have mistaken a radio for an oven. Now, the rest of us can sometimes mix up Musk’s Cybertruck with a deep freezer. As for his ‘Robovan’ – “it’s coming,” he wrote on Friday – it could be a camping tent or Iron Man’s mask, depending on your angle of view. This is not to pick on Musk, who has fathered some nice looking cars before, but to generally assess the state of the design art. \nThe prevailing mantra is to make everything flat, and black. Or shiny silver. Microwave, water purifier, TV – they all look like variations on your smartphone. This, we are told, is futuristic. But since good design draws inspiration from environment – the classic Vespa from a wasp, and the classic VW Beetle from a beetle – are we headed into a future where our only inspiration would be flat walls? It could happen if AQI remains as dreadful as it is now, but it would be a depressing future. \nWhat will it take to make things beautiful and evocative again, like the moka pot (1930s), and the Eames lounge chair (1950s)? Where’s the gorgeous modern scooter that could star in a remake of Roman Holiday? As the world’s two-wheeler king, India should make it. In fact, given its rich design traditions, India should aspire to become the world’s product design studio. That’s one thing China, with its regimented thinking, hasn’t been able to do. Young and free India has an edge.\n\n",
        "headline_1": "Studio India",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/studio-india/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-12-2025"
    },
    {
        "full_article": "Power & prejudice define what we mean by mental disability \nSimon Jarrett, a nursing assistant in the 1980s in a south England hospital for the mentally ill, recoiled when he read the file of his first patient, G, who had been admitted in 1924 aged 6. The file said: ‘G is a bat-eared cretin’. Only for Jarrett to learn the insult was the ‘official’ term for the mentally deficient in 1920s-30s. \nThose They Called Idiots: The idea of the disabled mind from 1700 to the present day by Simon Jarrett traces how society’s view on ‘intellectual disabilities’ evolved – historically labelled ‘idiots’, ‘imbeciles’, ‘feeble-minded’ etc. The “idea of the disabled mind”, the book argues, is neither fixed nor natural but has changed given cultural, legal, medical, racial and political contexts.\nIn the 18th century, those considered ‘idiots’ were neither isolated nor locked away. They lived within families or communities, worked (even if involuntarily) and contributed. They weren’t ‘beyond’ society but lived in everyday social imagination – including in unkind jokes. \nThe mid-19th century to 1980s saw their ‘incarceration’ – about 140 years of institutionalisation, locked away from the mainstream. This had its roots, the book argues, in ideas of Enlightenment, which had built ‘mental attributes’ that made one ‘human’. The bureaucratic state that followed took those ‘different’ in its ‘care’ – a life of routine & regulation, cruelty & humiliation, were part of the drill. Emerging ideas of citizenship, responsibilities & roles, demanded certain ‘mental ability’ in order to ‘belong’. Those deemed deficient were carted off to the ‘medical terrain of asylums’. \nEugenics deeply influenced attitudes. Nazi experiments saw the ‘mentally defective’ as threats to social “purity”, leading to untold horrors of dehumanisation. Enter democratisation & meritocracy, and, where was the place for the unintelligent? \nThe race for mechanisation, cybernetics, disappearance of ‘routine work’, the book quotes laureate physicist George Thomson, were problematic: “What is to happen to the really definitely stupid man, or even the man of barely average intelligence?” Thomson foresaw the “stratification of society and allocation of resources according to intelligence as nothing less than a headache for future politicians.” \nIn England, post-war welfare state model swept all mental deficiency charities and hospitals into state care under NHS. But as the book argues, “What role could medicine play in the lives of these people who were simply who they were, who happened to have a lower level of mental faculty than others but for whom there was no form of medical intervention that could treat, change or cure?”\nParents would be pressured to institutionalise infants, and the “authority was so… unquestionable, it was difficult for parents to resist, even if they were desperate to keep their baby.” The book argues that even post war, the eugenics influence was sustained, if “disguised”. The idea was to forget this one, and try for a “more successful outcome”.  \nBut then, parents began to oppose the “soulless arrogance” of doctors who would dismiss their offspring as “less than human”. They became a “site of opposition” to medical authority. The movement captured public attention, till laws and govts and societies conceded these are people in need of justice, not isolation. Jarrett provokes a rethink of the idea of mental disability not as a flaw, but a reminder that the measure of ‘normal’ is shaped by history, power, and attitude. Who we call an ‘idiot’ says much about us. \n\n",
        "headline_1": "An Intelligent & Caring Guide To ‘Idiots’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/an-intelligent-caring-guide-to-idiots/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-12-2025"
    },
    {
        "full_article": "Few frauds are as funny as those related to insurance\nRemember the farmer in England who claimed insurance for his phone that had disappeared into the insides of a cow while he was helping it calve? Or the woman who lost her phone when she left it in a sponge cake pre-bake? Both phones were, ahem, retrieved, as it were, but not quite in working condition. If ever there’s a list of bizarre and fraud insurance claims, here’s one for the top five. A businessman in UP tried to cremate an employee’s remains. Only, ground staff discovered the corpse was a dummy. Verily, the doll is dead, long live the droll. The businessman had a neat Rs 50L policy in the employee’s name in the hope of cheating insurers by faking his death. \nTo be dead serious, insurance fraud is no joke. Just weeks ago in Nov, Lucknow cops arrested a couple for duping insurers of Rs 25L payout by faking the husband’s death. Financial distress and mounting debts are apparently pushing otherwise-most-ordinary middle-class people to extreme actions and criminal behaviour. Of course, crash-for-cash and burning down property are classic frauds insurers are ever alert to. As is inflating medical bills or pretending an injury is more severe than it is. So what’s the upshot? Insurers get even more tightfisted when it comes to honouring genuine claims. Every insurance fraud makes insurance companies 10 times more nasty when dealing with people who really need help. \n\n",
        "headline_1": "Claim To Fame",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/claim-to-fame/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-12-2025"
    },
    {
        "full_article": "That SC has many times overturned its own rulings should be celebrated, not lamented. The 2-judge bench’s critique misses the point. From strengthening fundamental rights to decriminalising gay sex, guaranteeing right to privacy to stopping misuse of sedition, SC reviews have protected citizens\nOn Wednesday, a two-judge Supreme Court bench observed the court is pained at the “growing trend of revisiting and overturning of its own verdicts by subsequent benches”. Ironically, this obiter dictum came on the day the country commemorated its 75-year-old Constitution, one recognised by SC and jurists as a living document, open to dynamic interpretations with passage of time.\nRead full story on TOI+ \n\n",
        "headline_1": "Supreme change of mind",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/supreme-change-of-mind/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-12-2025"
    },
    {
        "full_article": "The recent surge in digital manipulation in Bangladesh has justifiably raised concerns about its likely impact on the upcoming national election. This threat, emerging in an already charged sociopolitical atmosphere, could prove more complex and consequential than anything witnessed in recent electoral cycles. Speakers at a roundtable organised by The Daily Star and the Tech Global Institute therefore emphasised the need for rigorous scrutiny and policy interventions, warning that, without these, the playing field could be tilted not only against certain political parties and actors but also against voters themselves.\nThe speakers—political leaders, digital experts, and civil society representatives—identified online misinformation, data misuse, and AI-driven propaganda as key challenges. They also highlighted how defamation and religiously charged cases are increasingly being filed to intimidate opponents or silence dissent. Concerns were raised about the judicial system being pressured by fears of backlash, leading to the misuse of vague provisions under laws such as the Anti-Terrorism Act and the Penal Code. This cascade of legal and digital manipulation indicates that electoral integrity cannot be protected by state institutions alone. Political parties and social media platforms must also be held accountable for failing to prevent abuse down the line.\nIn this context, several speakers underscored the vulnerability of citizens' data. With 183 institutions having access to the National ID database and a large pool of candidates likely to receive constituency voter lists, how do we ensure this access is not abused? Clearly, safeguarding personal data is no longer merely a privacy concern; it is also a matter of electoral fairness. Without strict oversight, voter information could be exploited for targeted intimidation, profiling, or micro-manipulation. Compounding these risks is the spread of AI-generated content. Fabricated videos, synthetic images, and doctored materials are already circulating—often produced by politically aligned actors—with women candidates and minority communities particularly exposed. In the absence of digital literacy and a strong fact-checking infrastructure, such attacks may not only damage reputations but also discourage participation, suppress votes, and inflame communal tensions.\nThe fact that Bangladesh has nearly 80 million Facebook users, along with a substantial presence on YouTube, gives the government some leverage to demand responsible behaviour from these platforms. Yet, they continue to operate with minimal accountability. As one expert noted, the government should negotiate election-time protocols with social media platforms—protocols that many countries have already implemented. Their absence here represents a policy blind spot, much like the lack of a robust regulatory framework for online political campaigns. These gaps must be addressed by the Election Commission. It must regulate online campaigning and coordinate with relevant state bodies, media organisations, fact-checkers, and global tech giants to establish clear rules, rapid-response mechanisms, and meaningful accountability. Without such measures, the election risks being compromised.\n",
        "headline_1": "Protect the polls from digital manipulation",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/protect-the-polls-digital-manipulation-4046061",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-12-2025"
    },
    {
        "full_article": "Bangladesh is witnessing one of its most troubling reversals in poverty in over a decade, and recent assessments emphasise the scale of the crisis. According to the World Bank's Bangladesh Poverty and Equity Assessment 2025, nearly 20 lakh people have fallen into poverty this year, pushing the rate to 21.2 percent, while more than 30 lakh slipped below the line last year. The country's total poor population has now reached around 3.6 crore, driven by job losses, soaring inflation, and declining household consumption. Despite repeated policy assurances, scattered relief measures, and incremental social assistance, the slide continues. The WB found that between 2010 and 2022, the poverty-reduction elasticity of growth fell to 0.9; in other words the country's economic growth was less effective in reducing poverty, reflecting weakened governance, shrinking labour opportunities, and a growth model increasingly unable to shield vulnerable households.\nLabour market data shows that Bangladesh lost nearly 20 lakh jobs between 2023 and 2024, with another eight lakhs expected to vanish this year, with women and young people being the hardest hit. Most new jobs are concentrated in low-productivity agriculture, signalling stagnation in industrial and service-sector dynamism. The WB report revealed entrenched failures in the social protection system, with only half of the poorest 20 percent of households receiving benefits, while the richest quintile continues to benefit from various subsidies—evidence of chronic mistargeting and political leakage. The survey further highlights that 6.2 crore people now hover just above the poverty line, vulnerable to slipping below it due to illness, shocks, or minor income disruptions.\nNationwide, poverty dynamics is increasingly visible in altered consumption patterns, livelihood adjustments, and falling living standards. Real wages, particularly in rural areas, have stagnated or fallen even as food prices remain elevated. Rising rural poverty is eroding household resiliency as families are reducing meals, borrowing at high interest, or selling productive assets to cope. Stagnation in job creation also risks undermining Bangladesh's hard-won progress in women's economic participation.\nThe persistence of this crisis reflects a failure of coordination, accountability, and long-term planning. Budgetary constraints, administrative delays, and fragmented policymaking are no longer sufficient explanations. Job creation strategies must be revamped, market access improved for rural households, skills development strengthened and transparency ensured in welfare programmes. Bangladesh has overcome adversity before, but the current trajectory demands decisive, coordinated, and accountable action. Without it, the poverty reversal could become entrenched, undermining national progress for years to come.\n",
        "headline_1": "Act now to reverse the poverty backslide",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/act-now-reverse-the-poverty-backslide-4045806",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-12-2025"
    },
    {
        "full_article": "A new report by the United Nations has ranked Dhaka as the world's second most populous city after Jakarta, pushing Tokyo to third place. According to its projections, Dhaka and Shanghai are expected to experience the fastest growth among the 10 largest cities of 2025. By mid-century, Dhaka is projected to overtake Jakarta as the world's largest city, while Shanghai is expected to rise from fifth to third. It is a paradox that a city ranked third from the bottom in the Economist Intelligence Unit's Global Liveability Index 2025 continues to expand at such a pace.\nThe numbers are both startling and alarming, as they are almost three and a half times higher than our official estimates. The UN puts Dhaka's population at 36.6 million, whereas the Bangladesh Bureau of Statistics' 2022 Population and Housing Census records a population of just 10.2 million. This vast discrepancy is deeply concerning because population data directly influence nearly every aspect of urban planning, ranging from infrastructure and public services to the supply of essentials and economic activities.\nRecent devastating fires in Kuril, Mirpur, or near the airport, along with natural hazards such as the recent series of tremors, serve as stark reminders of how overstretched our emergency and essential services have become. With severe land scarcity, Dhaka has expanded upwards in a highly unbalanced manner, resulting in grossly inadequate ratios of roads and basic civic services. The consequences are evident: traffic gridlocks lasting hours, households unable or struggling to cook for days, water rationing due to unreliable supply of safe drinking water, widespread air pollution, electricity outages causing heat-related illnesses, and an absence of many essential services. Open spaces, playgrounds, water bodies, and greenery have virtually disappeared. These shortcomings have turned Dhaka into one of the most unliveable cities in the world.\nThe UN report identifies faster urban population growth compared to national averages as a global trend. However, it does not account for Dhaka's exponential expansion, which is likely driven by uneven national development. Experts cite both \"push\" and \"pull\" factors. In a highly centralised governance system, the capital becomes the focal point for administrative and planning decisions, drawing people from across the country in search of opportunity. Conversely, the lack of jobs, limited economic activity, and climate vulnerability in other regions also push people towards Dhaka, resulting in a relentless flow of internal migration that overwhelms the city.\nSustainable development demands integrated planning that treats cities, towns, and rural areas as interconnected and interdependent. The UN report emphasises the need for national policies that coordinate housing, land use, mobility, and basic services across regions—measures that can ease pressure on megacities and promote a more balanced development.\nIn Bangladesh, past attempts at decentralisation have failed due to a lack of sincerity and commitment from political leaders and bureaucrats accustomed to the comforts of urban centrality and reluctant to relinquish them. But decentralisation is no longer optional; it has become imperative. We have reached a point where we either act to make Dhaka sustainable or prepare for the day when this unliveable megacity forces its residents to abandon it or suffer the consequences.\n",
        "headline_1": "Dhaka’s rapid growth worsening liveability",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/news/dhakas-rapid-growth-worsening-liveability-4045271",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 01, 2025 00:00:00  \nIt is highly alarming that after decades of steady progress, the country's population control is now in reverse gear. Government agencies appear to have lost control of population growth, leading to an undesirable increase in the birth rate. A nationwide survey, jointly conducted by the UNICEF and the Bangladesh Bureau of Statistics (BBS), reveals a sharp rise in the average number of children per woman. The Total Fertility Rate (TFR), which measures the number of children a fertile woman gives birth to in her lifetime, has jumped from 2.17 in 2024 to 2.4 in 2025. This reversal is unprecedented in the country's history. Since independence, the TFR had been continuously declining. In 1971, Bangladesh's TFR was above 6.0, meaning women had more than six children on an average. Successive governments made TFR reduction a priority, and the rate continued to fall over the decades. Now, however, this progress is being undone due to laxity in the government's population control measures.\nThis laxity in the government's family planning activities marked by a serious shortage of manpower in family planning offices and a deficiency in birth control materials is being attributed to an ill-conceived policy of the ousted Awami League government. The deposed government reportedly viewed the issue of population growth not as a burden, rather as a blessing in the form of additional human resources. But in a densely populated country like Bangladesh, where more than 1,200 people live in per square kilometre, the numbers of the poor and the unemployed are growing, the notion that higher population growth will automatically lead to an increase in human resources is simply unrealistic and impractical. Rather, experts are of the view that the country's economic development will be greatly hampered if the present rate of population growth cannot be brought down to a reasonable limit.\nPopulation growth does not only mean feeding extra mouths but also additional pressure on various resources. The graveness of the situation may easily be perceived if juxtaposed with the stark reality that cultivable land of the country is decreasing at the rate of one per cent per annum largely due to uncontrolled growth of population. Worse still, indiscriminate urbanisation and industrialisation and the climate change triggered by global warming have cast a negative impact on agriculture production in the country. Hence, if the agriculture land continues to shrink due to runaway population growth, no doubt a bleak future is awaiting the nation.\nAn integrated plan is, therefore, essential to bring the country's population growth under control. As experts have suggested, the Ministry of Health and Family Welfare must reinvigorate its family planning activities, ensure an adequate supply of birth-control pills and other materials, and expand door-to-door services - particularly in poverty-stricken and slum areas - to curb the rising birth rate. The UNICEF-BBS survey once again shows that fertility rates are higher among poor, less educated and illiterate women, which underscores the need for targeted and inclusive family planning measures. In addition to direct family planning interventions, a sustainable solution requires tackling socioeconomic issues such as poverty, unemployment, illiteracy and child marriage. These socioeconomic factors are inextricably linked to family size and must be addressed to achieve a lasting solution to population growth. Alongside keeping the birth rate in check, steps must also be taken to transform children growing up in slums, streets and poor neighbourhoods into productive human resources through proper education, skills training and healthcare so that they can contribute meaningfully to national development.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Population control  in reverse gear",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/population-control-in-reverse-gear-1764514616",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       December 01, 2025 00:00:00  \n\nIndustrial stagnation and shrinking private investment have resulted in 1.4 million people's loss of jobs, who are now out on the streets, said former FBCCI president A.K. Azad, also, Managing Director of the Ha-Meem Group, while speaking at a discussion event styled, \"Bangladesh Economic Conference 2025\". As the proverbial wearer knows where the shoe pinches, so do the leading business people know what ails the industry. The economy, or the industrial sector of the country, for that matter, is now unable to create any new job. But this is an ominous sign for the economy, when about 3.0 million people are entering the job market annually. Every year, that number goes up. The urgency before the government is to clear the main obstacles to the growth of the industries, because that is the only answer to the issue of the ever-rising number of the unemployed in the country. Given the experience of the July uprising of 2024, the government should be on the alert to the disruptive potential of the unemployed disgruntled youth of the country. \nIn this context, the barriers to the industry's growth are legion. But among the many issues coming in the way of the industry's expansion is costly bank credit as well as liquidity crises in the banks. As the banks were plundered during the ousted authoritarian regime in the name of rescheduling loans that were never recovered as well as direct looting by directors of private banks, the Non-Performing Loans (NPLs) piled up at an unprecedented rate. In this connection, the Bangladesh Bank (BB) governor, Dr Ahsan H. Mansur, has recently said more than one third of the entire outstanding loans of the country's banking sector constitutes NPLs. According to the Bangladesh Bank data, in absolute terms, out of the total outstanding loans amounting to Tk.18.3 trillion till the end of September last, Tk6.44 trillion became classified, or NPL. That, in other words means, 35.73 per cent of all loans extended by banks, is NPL. This is the highest percentage of NPLs as compared to the rest of the world, not to speak of South Asia. Even in Sri Lanka, the economy of which was declared bankrupt three years ago, has now its ratio of NPL at 12.6 per cent, far lower than Bangladesh's. Even Sri Lanka's loan performance is on the higher side compared to those of other South Asian countries with India's at 2.3 per cent and Pakistan's at 7.4 per cent. Notably, according to the Asian Development Bank (ADB), as of the end of December 2024, the average NPLs in Asian banks was 1.6 per cent. To put this into perspective, South Asia has the highest record of NPLs compared to that of the rest of Asia. But Bangladesh beats them all with its close to 36 per cent NPLs, the world's highest. It does also beat the country's own record in the last 25 years. \nEvidently, the banks are weighed down with these NPLs severely compromising their ability to extend required credits to the industries. Which is why, credit flow in the economy is stifled and the interest rate is high to the chagrin of the credit-hungry industrial sector.\nIronically, along with law and order, the interim government's priority was to retrieve the money laundered through foreign banks or offshore companies. The effort, so far, has not seen much success for the simple reason that it is hard to track the laundered money as it also involves legal complications. Because, to retrieve the money, one has to conform to the law of the country where the stolen money has been deposited in bank accounts or converted into other assets. The government has learnt the hard way how strenuous and time-consuming is the task of bringing back the money siphoned off from the economy including banks and laundered abroad. Now that the interim government's time in office is nearly over with the next general election around the corner, the central bank governor finally admits that it would take five to 10 years to get around the crisis of NPLs. So, the question that would naturally arise is: why had the government not concentrated more on recovering NPLs than chasing the wild goose of laundered money concealed in offshore accounts? If truth be told, the government, or the Bangladesh Bank, to be specific, has rather treated the big bank defaulters with kid gloves. On the contrary, it was necessary to be harsh with the influential bank defaulters. \nThe government could well confiscate the properties of the wilful defaulters and recover as much of the defaulted loans as possible. Unless the banks, which play the role of a financial intermediary in the economy, are on a stronger footing, the industries cannot flourish. But industrial growth is deeply interlinked with the overall macro-economy, of which, inflation, like unemployment, is a critical factor. Most importantly, the stubborn inflation, though it slightly decreased to 8.17 per cent in October from 8.36 per cent in September 2025, is yet to be brought under control with the usual contractionary monetary policy. Unsurprisingly, price volatility in the kitchen market sometimes flies in the face of official consumer price index and the official rate of food inflation, which was 7.08 per cent last month. The central bank's effort at taming the inflation should also go hand in hand with restoring stability in the banking sector. With a large chunk of the bank depositors' money in the hands of the so-called called 'big bank defaulters', stability in the financial sector is inconceivable. \nIn this connection, the interim government should remember that it is not a caretaker administration, the job of which is only to hold an election and transfer power to the next elected government. Since it took office with a huge popular mandate in the wake of a mass upsurge, it cannot be exonerated from its obligation of getting some vital aspects of the economy such as the banking sector back on track. As it is with any regular government, the current interim government will also have to answer for its performance. It must finish some of the tasks that it had undertaken to start with. \nSo, what the next elected government would do is its business. \nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Chasing wild goose of siphoned money",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/chasing-wild-goose-of-siphoned-money-1764514683",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       December 01, 2025 00:00:00  \nAt a time when election, referendum and lease of seaports hog newspaper headlines, some highly important issues receive scant attention. One such issue is population growth in a country that is already gasping for breath under the weight of an outsize people. According to a survey, \"Multiple Indicator Cluster Survey\" conducted jointly by the Bangladesh Bureau of Statistics (BBS) and the United Nations Children Fund (UNICEF), the country's population is now growing at 2.4 per cent. Called total fertility rate (TFR) in demographic parlance, it stood at 2.3 during the 2010-2022 period. What is particularly worrying is that the trend of population growth never rose before. But now the rate is going up. \nIntroduced in the 1950s, family planning (FP) did not gain momentum until it was declared as a government-sector programme in 1965. The policy to curb fertility rate was followed by successive governments before and after independence. But the FP received fresh impetus with the government declaring population boom as the number one problem in the country in 1976. Multi-sectoral FP programmes were launched to curb the undesirable rate of population growth. Young people aged between 15 and 29 years constitute about 28 per cent of the population. \nThey are the crucial segment of the population. According to government statistics 40-41 per cent youths in the country are neither in education nor in employment, nor training (NEET). Remarkably, the NEET for girls is much higher at around 61.7 per cent compared with 18.59 for males. Quite understandably, underage girls are married off and this is one of the reasons for the current higher rate of TFR. However, the main reason for the reverse trend of population growth is the stymied FP activities in the country. The momentum generated in the 1990s has lost its way in the wilderness following the casual government approach to FP. \nIndeed, people became aware of the danger of many mouths in a family courtesy of FP campaign but government inaction and the latest fund constraint have also restrained the non-government organisations (NGOs) to continue their programmes. Aid and assistance in general from Western countries have drastically shrunk ever since the Covid-19 pandemic. Family planning has particularly become a victim of this global fund shortage. Now, the number of family welfare visitors (FWVs) has dwindled with no fresh recruitment of such field-level workers who deliver services to rural women of child-bearing age. At the grassroots level, 18 per cent areas in the country have no such FWVs. A large number of posts is vacant at the upazila level. The supervisory activities suffer affecting adversely the delivery of FP services. \nThe proverbial ostrich-like attitude towards population explosion will be of no help to reduce the population growth rate already in a reverse gear. Before the growth rate reaches the dangerous trajectory, the government must allocate a reasonable amount of fund for activating the apparatuses of FP. One plus point is that the system in the past has worked well if not at the highest satisfactory level. The vacant posts have to be filled for resuscitating the chain of delivery services at the grassroots level. \nThe investment is likely to give returns in spades. This is necessary because successes in all other areas hinge on the population size which right now is more than this small land can support. With the climate change aggravating, its support systems will be further stretched. If the rising seas take away a significant slice of coastal areas, the country will be in dire straits. A single-child family would be an ideal solution for the nation. Even if it is not the norm, at least two-children family had to be promoted in order to maintain a balance in the land-demography-food ratio. \nIn a situation like this, the government can ill afford the inattention to the family plan programmes. Both promotion of the principle of keeping the family size small and the pooling of fund for delivery of FP services to the target people have to be ensured as soon as possible. \nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Danger of population growth beyond limits",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/danger-of-population-growth-beyond-limits-1764514732",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 01, 2025 00:00:00  \n\nStartups, business, entrepreneurship-these are some of the trendiest words in Bangladesh today. There was a time when everyone aspired to be a doctor or an engineer but the trend has now shifted. Nowadays, almost everyone wants to build startups or become a businessman or entrepreneur. If you are also dreaming of this, think twice before falling for scams and fake promises.\nAccording to a survey, 70 to 80 per cent of new startups fail in their first year and over 90 to 92 per cent close within five years. Yet everyone talks about success stories, while few show the harsh reality behind why most startups fail.\nAccording to YouTuber Nasir Tamzid, entrepreneurs face three main problems at the very beginning of their journey: having the wrong mentor, not knowing their true capabilities and lacking in patience.\nJust as skilled artisans turn raw gemstones into fine jewelry, mentors help shape knowledge, develop mental strength, improve skills and guide one on the right path. But if someone falls into the trap of a wrong mentor, it doesn't take long for things to go awry.\nMost people are in a hurry to achieve quick success. Seeing promises of fast-track success in many courses, people tend to buy them randomly. As a result, they not only lose money but also peace of mind and confidence. A lack of patience leads to indecision; switching between skills and courses prevents them from becoming truly qualified. Meanwhile, they end up pouring more and more money into skills, mentors, and courses, often lining the pockets of unscrupulous mentors.\nThere is a saying: \"To master something, one needs 1,000 hours of practice; to be just good at it, 20 hours are enough.\" There is no such thing as quick success. We must remember: the quicker the success, the sooner the downfall. \nMD. Shakib Hasan Turzo\nBBA\nNorth South University\nshakib.turzo.232@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Scams targeting entrepreneurs",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/scams-targeting-entrepreneurs-1764514756",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-12-2025"
    }
]