[
    {
        "full_article": "While there may be much relief after the détente in the tariff war between China and the U.S., in Busan, South Korea, following the meeting between U.S. President Donald Trump and his Chinese counterpart Xi Jinping, the uneasy truce has laid bare a structural inversion of power between the two economies. What began in the 1980s as a reluctant embrace of World Bank/IMF-prescribed neoliberal reforms by an overwhelmingly agrarian China, has now evolved into an unimaginable assertion of industrial dominance. A nation that once bartered sovereignty for technology transfer and market access has, through patient accumulation of manufacturing depth, labour arbitrage, and global supply-chain integration, positioned itself as the indispensable node of world production. The irony is sharp. The U.S., whose export and technology corporations once defined global trade cycles, now finds its four-year political rhythms ill-suited to contest a rival that plans in decades. The concessions Mr. Trump has extended to Mr. Xi include some reductions in tariffs, a pause on additions to the “no-trade list” of Chinese firms, and a partial rollback on levies linked to the fentanyl supply-chain dispute. China has promised resumption of purchase of American farm products, particularly soybean, and an easing of export restrictions on critical minerals.America’s tariff offensives since Mr. Trump’s first term in 2017 did yield some numerical optics. U.S. goods trade deficit with China narrowed by roughly 30%. But economists across the spectrum agree that this was less a triumph of re-industrialisation than a diversion of trade flows. The deficit was largely re-routed through near-shoring and friend-shoring: Mexico, Vietnam and parts of ASEAN became new intermediaries for supply chains once centred in China. Meanwhile, China’s exporters diversified markets and adjusted prices, while the tariffs’ direct burden was borne mostly by U.S. importers and consumers. The human geography of the impact was asymmetric: in the U.S., retaliatory Chinese tariffs targeted farm-belt commodities, hurting those very rural constituencies that powered Mr. Trump’s rise. Federal subsidies softened the blow, but only temporarily. In China, the pain was concentrated in export-processing hubs such as Guangdong and Suzhou, where migrant and urban workers in electronics, semiconductor, and smartphone assembly absorbed the shock. Yet, the political fallout remained contained, cushioned by Beijing’s domestic-stimulus measures and its “dual-circulation” strategy of inward and outward rebalancing. This trade war has thus underscored a decisive shift: the U.S. remains the world’s largest consumer market, but China has entrenched itself as the world’s foremost factory with global leverage over intermediate goods, high-end technology and critical minerals. Published - November 01, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        economy (general)\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        industrial production\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        critical minerals\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        Mexico\n                    \n                            /                      \n                        \n                        Vietnam\n                    \n                            /                      \n                        \n                        ASEAN\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        semiconductors and active components\n                    \n                            /                      \n                        \n                        PDAs and smartphones\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        electronics",
        "headline_1": "​Chinese check: On the détente in the U.S.-China trade war",
        "headline_2": "China has entrenched itself as the world’s foremost factory",
        "link": "https://www.thehindu.com/opinion/editorial/chinese-check-on-the-detente-in-the-us-china-trade-war/article70226269.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-11-2025"
    },
    {
        "full_article": "Sometimes, the most manifest gains are won after the most Herculean of battles. For France to establish that “force is the crime” to establish that the use of force without consent causing injury, rape, fear or annoyance is a criminal act, took years; extraordinary courage from one woman, and an uprising where other women stood in solidarity with her. France has adopted a law that defines rape as any non-consensual sexual act, a milestone for the women in the country, but overall, a strike against sexual violence. The law was passed in response to urgent calls from society to infuse consent into the law, and make sure that the law protects sexual autonomy, particularly with reference to women. Last year, Gisèle Pelicot fought her toughest battle when she took the stand in court, in a case accusing her husband of drugging and allowing her to be raped by several men, some complete strangers. In December last year, the court granted 51 convictions in the case, but it was more significant in how it became a watershed moment to establish consent as a pillar of law. It has been well established that survivors of sexual violence have an arduous journey bringing their case to a court of law, and many women from disadvantaged social and economic backgrounds, indeed do not have that privilege. There is a great deal of stigma, and worse, judgement of the survivors in cases of rape, as recent public statements in India by leaders blaming the women have painfully underlined again, and again. Even when a case of rape enters the trial stage, the chances of securing a conviction are not encouraging. According to the NCRB’s data, conviction rates for rape were between 27%-28% from 2018 to 2022. And this, despite the fact that Section 129 of the Bharatiya Nyaya Sanhita recognises “criminal force”.To establish sexual autonomy as the cornerstone of the judicial process, while a first step, is scarcely all. Preventing sexual violence will also involve shaping community views on gender roles, dismantling rigid patriarchal codes with a measure of law, but also awareness programmes that begin early, and orienting the police force to these principles, besides funnelling resources into assisting survivors cope with the trauma. The road ahead is long and arduous; for the journey of the survivors to be eased, governments should start with a complete intolerance for sexual violence, and a commitment to stand by survivors, employing empathy in the investigation and trial processes. To do any less, would be an injustice that would interrupt the momentum of the women’s ‘Arab Spring’ Pelicot had set in motion.  Published - November 01, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        France\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        social issue\n                    \n                            /                      \n                        \n                        crime",
        "headline_1": "Consent is all: On sexual violence, support for survivors",
        "headline_2": "There must be complete intolerance of sexual violence and support for survivors",
        "link": "https://www.thehindu.com/opinion/editorial/consent-is-all-on-sexual-violence-support-for-survivors/article70226300.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-11-2025"
    },
    {
        "full_article": "Nitish appears to be turning anti-incumbency into leverage by absorbing and redirecting it. His incrementalist approach may again position him as the best bet in case of another fractured mandateNotwithstanding exit polls and television debates, a familiar script could unfold in Bihar. After intra-alliance bickering over seats and the sudden announcement of a deputy CM, prospects of an outright Mahagathbandhan (MGB) victory have diminished in the past fortnight. A many-cornered contest might deliver that most Bihari of outcomes: a hung assembly.\nRead full story on TOI+\n\n",
        "headline_1": "Bihar’s Chanakya 2.0",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/bihars-chanakya-2-0/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-11-2025"
    },
    {
        "full_article": "Courts have responded to celebrity petitions by giving sweeping judgments, without hearing the other party. Plus, each ‘violation’, unfair competition, privacy, false endorsement, merits a specific response\n\nDelhi and Bombay HCs, over mere weeks, granted a number of sweeping judgments – ex parte ad interim injunctions – protecting ‘personality rights’ of several actors. All these orders mirror each other, obfuscating the exact ‘cause of action’ that merited the injunction. An ex parte ad interim injunction is a discretionary remedy meant to be granted in exceptional circumstances, without hearing the other side, to safeguard rights of a party that might suffer irreparable harm without the remedy.\nRead full story on TOI+\n\n",
        "headline_1": "The wrongs of rulings on personality rights",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-wrongs-of-rulings-on-personality-rights/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-11-2025"
    },
    {
        "full_article": "By Narayani Ganesh\nEach year, in many cultures across the world, ancestors are propitiated and ceremonies performed to welcome them on their earthly visit as spirits. Pitr Paksh, Shraadh, Samain, Halloween, Bhoot Chaturdashi are some of the different ways by which respectful observances are made and memories shared, of the departed. Good spirits apart, Halloween displays caricatures of ghouls and demons, whereas perhaps what is really being referred to are the inner demons we face in our daily lives.\nAmong the most persistent demons within is the negative emotion of anger, rage, among others like fear, greed, jealousy and lust. An interesting story attributed to Gautam Buddha, called ‘King Sakka’s Demon’ is narrated by Josh Korda in Lion’s Roar , the magazine on Buddhist teachings: A demon fed on people’s resistance and anger. One day, thedemon climbed onto the king’s throne whilehe was away. King Sakka’s guards saw the little demon and yelled at it, “How dare you sit on the throne? This is an outrage!” As they yelled, the demon became a ferocious beast, breathing fire and terrifying the guards, who fled.\n\nWhen King Sakka returned, he tried a different approach. He greeted the demon with kindness. “How can i make you feel comfortable?” he asked. “Can i offer you something to eat? Do you want to put your claws up on the table?” With each nicety, the demon shrank in size. It became smaller and smaller until eventually the king could easily remove it from the throne.\nThis story is, of course, a metaphor for the way to relate to our anger and other challenging emotions, that are in fact our inner demons. If we try to get rid of, repress, or battle them, they only get stronger. The real practice is to do what Sakka did: turn towards the anger, make it comfortable, and create a safe place in the body where it can be felt.\nMost negative emotions feed on frustration, discontent, stress and anxiety. Says Madeleine L’Engle, “Remember that sometimes monsters only need to be kissed to be turned into beautiful princes and princesses.” Attitude is a key factor: How we deal with these emotions that may surface involuntarily in us, is what will decide whether the monster devours us or we tame it and ultimately bid it a friendly goodbye.\nA popular Cherokee story talks of inner conflict as two wolves battling within. One is positive, the other, negative. The grandfather is narrating the story to his grandson who asks him, “Which wolf will win?” The grandfather replies, “The one you feed will win.” Life coach Michelle Weimer says the story doesn’t end here, there is more. In another version of the story, the Cherokee says that feeding them both right will ensure that the dark wolf hunkers down and the white wolf dominates, co-opting the virtues of the dark wolf that is daring, courageous, persistent and fearless, qualities perhaps lacking in the pacifist white wolf. In other words, embrace the negative, befriend, understand and acknowledge them – instead of suppressing or repressing them, so that they do not resurface in a more vicious form.\nWe could say that every day is Halloween as we encounter different monsters, ghouls and ghosts of different dimensions, contributing to conflicts within; once they are acknowledged and we do not let them overtake us, all will be well.\nganeshnarayani@yahoo.com\n\n",
        "headline_1": "Ghouls & demons as metaphysical metaphors",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/ghouls-demons-as-metaphysical-metaphors/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-11-2025"
    },
    {
        "full_article": "Trump-Xi Busan truce could be tactical. But a confident China could return to bullying. India should be wary \nThe Trump-Xi meeting in Busan, South Korea, appears to have brought the fraying US-China relationship back to management mode. Trump, who seemed more optimistic, said both sides had agreed on almost everything and had reached a trade deal that could be signed soon. Beijing didn’t go so far but admitted that a basic consensus was reached on addressing major concerns. \nThe immediate outcome is that US will reduce fentanyl-related tariff on China by 10%, bringing the overall tariff rate on Chinese goods to 47% – which is below that of India’s rate – and China will pause rare earth export controls for a year in exchange for US suspending restrictions on Chinese companies from buying American tech, including advanced computer chips. The latter, however, is unlikely to apply to Nvidia’s Blackwell chip, said to be the best for AI.  \nOn the geopolitical front, two interesting points emerge. First, Trump and Xi reportedly agreed to work together to try and halt the Russia-Ukraine war. Second, Trump framed the meeting as a G2 summit. This will please Beijing. For, it has long aspired to be treated as an equal to US, managing global affairs jointly. But after the G2 concept first came into vogue during the Obama administration in late 2000s, the relationship quickly devolved to strategic competition. Plus, the first iteration of G2 also saw China adopt a bullying approach to India, confident in the knowledge that Washington wouldn’t jeopardise its relationship with Beijing. That dynamic could return now, to India’s detriment. \nMeanwhile, Trump might have changed his tone on China perhaps because he no longer sees Putin as reliable. Driving a strategic wedge between Moscow and Beijing is a key Washington goal. So, if Putin can’t be co-opted, perhaps Xi can be. But Trump is unpredictable. Moments before meeting Xi he ordered resumption of US nuclear testing in response to advanced weapons testing by China and Russia. This shows that the Busan truce may be more tactical, and fundamental strategic issues remain unresolved. Washington and Beijing, therefore, could just be preparing for their next bout. \n\n",
        "headline_1": "G2 Returns",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/g2-returns/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 01, 2025 00:00:00  \nAs far as a new fiscal year's budget is concerned, it was a tradition that its size would be bigger than that of the previous fiscal year. But the interim government seems to have departed from that norm by reducing the size of FY26's budget compared with the FY25's reflecting a move towards fiscal consolidation and austerity measures. This policy of restricting expenditures has been further confirmed through a recent directive reportedly issued by the finance ministry to the effect that expenditures under the revised budget for FY2025-26 must not cross the ceiling as set in the proposed budget for FY26. Or in other words, no further allocations in the revised budget will be made for both short-term operational expenditures under the revenue head and the long-term capital expenditures under development head. So, all the departments under the ministry concerned would be required to set their priorities afresh in line with the budgetary constraints and cut back on non-essential items such as foreign travel or purchase of cars or land unless under special considerations with the nod of approval from a competent authority. \nThe ministries and departments concerned would, as required by the finance ministry directive, have to submit their revised budget proposals. Obviously, the measure aims to manage fiscal deficit against the backdrop of revenue earnings by the National Board of Revenue (NBR) falling short of the targets. Unsurprisingly, incomes from customs revenue, too, have fallen short of projected amounts due to the ongoing curbs on imports that began in mid-2022 during the autocracy in the face of dwindling foreign currency reserves. Notably, the crisis marked by persistent inflation and significant drop in the value of taka against US dollar was further compounded by rising levels of imports necessitating import control measures. \nBut the restrictions did not end but saw further tightening under the interim government led by Dr Muhammad Yunus. Even in August, 2024, when the interim government was just in office, it announced closure of three land ports leading to reduction in incomes from land customs. In another move as late as September last, the interim government further restricted import by imposing a mandatory 100 per cent margin on Letters of Credit (LCs) on import of certain products in order to prevent further depreciation of taka. \nSo, under such circumstances, any increased earning in terms of customs revenue cannot be expected. Admittedly, import control, especially on capital machinery, has seriously impacted industrial and commercial activities which would as projected keep the economic growth below 5.0 per cent in FY26. That implies a significant fall in revenue earnings from customs. Add to that the reduction in income due to various tariff exemptions on imports. In the face of challenges like reduced earnings on multiple fronts including poor mobilisation of internal revenue and falling foreign aid and with added pressure from various subsidy burdens, the fiscal space of the budget has contracted significantly requiring the government's directives on expenditure control. Under the circumstances, the government borrowings from both domestic and external sources would remain constrained limiting its spending further. However, it is reassuring to learn that allocations in certain critical sectors including health, education and social safety nets will not be affected by the spending cuts. Against this backdrop, to enhance revenue earnings, the government needs to take various short- and long-term measures to enhance revenue receipts. While carrying out the massive spending cuts, the government should also be able to find innovative ways to save funds from different sectors.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Towards an austerity-driven revised FY26 budget",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/towards-an-austerity-driven-revised-fy26-budget-1761921878",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       November 01, 2025 12:00:00  \n\nOver the last five decades, Bangladesh has seen governments come and go, each promising to position the country as a model of development or as the next rising economic star in the region. Certain governments have, to their credit, achieved notable progress, although in an inconsistent rather than sustained manner. Approximately a decade ago, the World Bank even championed Bangladesh as a poverty reduction success story, an accomplishment attained against steep challenges. Regrettably, the years since the COVID-19 crisis have seen a demoralising retreat from this progress, with a multitude of people joining the ranks of impoverished once again. \nA recent report from the Power and Participation Research Centre showed how poverty is tightening its grip across the nation. It found that poverty now affects 27.93 per cent of the population, a significant increase from 18.7 per cent recorded in 2022. Consequently, almost a third of the populace struggles to afford bare essentials. More alarming still is the surge in extreme poverty, which has jumped from 5.6 per cent to 9.35 per cent over the three-year period. Anyone who has lived in Dhaka with their eyes open can see its proof on the streets. A growing number of ragged, hungry faces are now living a rough life on pavements, a sight that was less common before. These scenes on the streets serve as undeniable validation of severity of the crisis. \nThe main culprit has been the cost of basic goods, which for years have risen faster than wages. Even for those whose earnings have remained stable, inflation has steadily diminished what their money can buy. As a result, countless individuals who were previously just managing have been overwhelmed by escalating expenses. Naturally, the root of poverty in Bangladesh has historically been linked to poor quality work, especially the kind that keeps people busy but never lets them move far enough or fast enough out of hardship. That much has always been true. Yet, for a long time a gradual ascent from poverty was still occurring, until the tide turned in recent years. Which brings us to the question, what did change?\nTo understand what went wrong, we first need to look back at what has originally gone right. There was a time when government-run social safety nets did a fair job of keeping the poorest afloat. Initiatives targeting the hardcore poor, the elderly, widows and destitute women offered a significant degree of support. However, what worked for a while slowly got tangled in the usual mess of corruption and incompetence. Aid meant for the needy somehow found its way to the pockets of dishonest local representatives and their associates.\nPlugging these leaks and ensuring assistance truly reaches its intended recipients is a sure-fire way to steer poverty reduction back on track. The efficacy of this method is demonstrated by precedents in Bangladesh and, most notably, in China, where it served as the cornerstone of the largest poverty alleviation initiative in modern times. There, the poverty rate dropped precipitously from 90 per cent in 1990 to 1.7 per cent in 2019. How did they do it? They threw their full weight behind the mission with unwavering financial commitment and, most importantly, a disciplined focus on precise targeting. \nInitially, the Chinese government classified regions and counties across the country as impoverished based on national benchmarks. Subsequently, provincial authorities undertook meticulous surveys to pinpoint every household and individual qualifying for aid, collected detailed information about their living conditions and even went as far as diagnosing the specific reasons behind their poverty. This process led to the creation of a centralised national database in 2014, which catalogued around 88 million citizens living in poverty. In parallel, China instituted governance reforms by making poverty reduction a leading criterion for evaluating the performance of its public officials. There's no reason why Bangladesh can't take a leaf out of that book. Similar to China, Bangladesh could readily implement a system of accountability that obligates local representatives and officials at all tiers to commit to specific, binding targets for reducing poverty.\nWe cannot assume, however, that alleviating poverty is a responsibility of the government alone. This is an area where the compassion of the wealthy and the middle class can provide a vital supplement to public initiatives. To borrow Kingsley Amis's logic, if one man has ten buns and another has two and a bun must be given up, it is only fair that the man with ten should be the one to give. The urge to give may arise from religious obligation such as Zakat or a shared sense of humanity, but either way, this act can be transformative and thus demands our collective encouragement. In many thriving economies, philanthropy flourishes alongside prosperity. Bangladesh needs to nurture that same spirit and ensure that it channelled in a way that benefits those who need it most. \nMost people, by nature, prefer to be in the jobs, and yet there are those trapped in jobs that pay too little or have been forced out of work due to age, illness or disability. These are the most valid claimant for aid. One of the distinct benefits of private philanthropy is its potential to precisely identify these vulnerable people. While broad public safety nets can be vulnerable to exploitation, careful individual donors can often identify and assist those who deserve help most, with far greater discernment. The government can help by enabling this public participation in every possible way. By creating official platforms to disseminate information on vulnerable populations and enhance coordination between different groups, it can make private efforts far more effective. \nLastly, political parties also bear responsibility here. While their leaders remain locked in disputes over political trajectories, they have demonstrated a conspicuous lack of engagement with the economic plight of the populace. The public has every right to demand that these parties present concrete policies to fight poverty. Only if our political leaders and wealthy citizens forge a concerted effort can we prevent poverty from hardening into a permanent fixture of the country.\nshowaib434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Who will take responsibility for the poor?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/who-will-take-responsibility-for-the-poor-1761921960",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       November 01, 2025 00:00:00  \nA short video clip showing a young lady and a man exchanging verbal arguments inside a public bus went viral recently. The incident began when the lady boarded the bus and was looking for a seat. The man, sitting next to the door, murmured a few words that made the lady furious. She reacted sharply and charged the man for making nasty comments about her dress. The man also angrily started using abusive languages, and, at one stage, the lady removed one of her shoes and took it in one hand to hit the man. The situation aggravated when the man got up from his seat and hit the lady and she fell on the engine cover beside the bus driver. She, however, recovered fast and tried to return the blow. Only one fellow passenger tried to pacify both of them while others apparently were enjoying the scuffle. The video clip ended with the lady shouting and asking why the man made nasty comments on her dress. \nWhat the man actually said is difficult to follow in the video clip for whatever he said in a low voice and there was plenty of noise in the bus. One thing, however, is clear: he passed a few objectionable comments targeting the lady. From the lady's shouting, it was also clear that the comments were about her dress. The video clip revealed that the woman was wearing a pair of pants and a half-sleeve shirt, and that she had a scarf over her hair from the back. She also put a small cross bag on her shoulder. For some people, the dress may seem inappropriate in the public place. Some of those who shared the video clip claimed that the man rebuked the lady for not wearing orna (scarf used by women generally putting it over shoulder and chest and sometimes covering head). \nPresumably, the woman is used to commuting on public bus for her work and travelling to other destinations. The public bus in Dhaka is so terrible that even men have to struggle to get inside. For women and children, these buses are nothing but moving hells. As no suitable alternative exists, thousands of men, women and children have got to do very uncomfortable commuting daily. To get some relief from these unfriendly public buses, many women prefer to wear comfortable dresses so that they could move smoothly. Usually, almost all of them use modest and decent dresses as they go through public places.\nThe woman in question was harassed both verbally and physically because of her clothing, and everyone just watched. The attacker's face is visible, and he should have been arrested within 24 hours. Someone posted a still photo, grabbed from the video clip, showing the woman charging the man with a shoe in one hand. They also termed the photo a symbol of women's resistance against moral policing. Some netizens, however, argued that the woman's action crossed the line.\nTeasing and harassing women for their dresses in public is not a new thing in the country. Intriguingly, in some cases, even women turned against fellow women for wearing 'inappropriate' dresses. Three years back, a female student came under attack for her 'indecent' outfit. A fully clad lady launched the attack first, verbally rebuking the student. Later, some men joined the lady and assaulted the female student. The incident went to the High Court. Again, in the early part of this year, a female student at the Dhaka University campus was verbally abused by a staff member for so-called inappropriate dress. Though police arrested the youth following the victim's formal complaint, he was granted bail and then garlanded by a small group who identified itself as 'Touhidi Janata.'\nWhat to wear and what not to wear is a personal choice guided by family tradition and socio-cultural norms. Everyone also knows that it is necessary to respect social and cultural practices. The variations in dresses with new fashions are also designed accordingly, and there is nothing wrong with wearing fashionable dresses. Women in Bangladesh know some dresses that can be worn at home are not always acceptable in public places. Men, however, should not try to advise women in public about so-called inappropriate dresses.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "What to wear and  what not",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/what-to-wear-and-what-not-1761922004",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 01, 2025 00:00:00  \n\nThe anticipation surrounding the new pay scale for government employees has reached a fever pitch. Across ministries and departments, excitement is palpable as employees share their expectations with the pay commission. The minimum they confidently anticipate is a doubling of their current salary. Meanwhile, a silent cry echoes from the private sector, where employees struggle with low wages, no job security, irregular working hours, and no pension or benefits.\nIn Bangladesh's private sector, a graduate engineer often begins a career with just Tk. 15,000-25,000 per month, while an MBBS doctor, after years of gruelling study, starts at Tk. 20,000-30,000. Meanwhile, fourth-class government employees are demanding a basic pay of Tk 25,000, which translates into around Tk 45,000 gross with allowances. The contrast is staggering.\nThe greater tragedy lies in the economic chain reaction this move could trigger. Once a new pay scale is introduced, prices of essentials, house rents, and utility bills will inevitably rise. For private sector workers, whose salaries rarely increase in tandem, this will further erode their fragile purchasing power. The government lacks an effective mechanism to protect private employees or contain the inflationary impact of public sector wage hikes.\nAdding insult to injury, the performance record of government employees is far from stellar. From failing to execute projects efficiently to allowing losses to pile up across sectors, their track record hardly justifies a doubling of pay. Even during the recent July Movement 2024--- a people's movement for justice, most government officials remained passive or opposed the cause. Yet today, they are the biggest beneficiaries of the current political vacuum.\nWith a weak, unelected administration in place, government employees see this as their best opportunity to secure a lucrative pay scale. Their urgency is political, not economic. They know a future elected government, accountable to the people, would be less likely to grant such an extravagant raise during a national economic crisis.\nDemanding a salary hike under the pretext of inflation, when bureaucratic inefficiency is partly to blame, is a mockery of accountability. Rewarding failure with higher pay not only demoralises the productive private sector but also deepens public resentment at a critical time.\nImam Hasan\nA private service employee\nhassan.imam.chy@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why reward failure amid economic hardship",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-reward-failure-amid-economic-hardship-1761922061",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-11-2025"
    }
]