[
    {
        "full_article": "The data on India’s economic performance in 2024-25, released on Friday, have something for everybody. Those with an optimistic outlook can rejoice at the seemingly robust growth in the fourth quarter. Pessimists can despair over the four-year low annual growth figure. The realist’s assessment, however, is that there is cause for some restrained celebration, and more than a healthy dose of disappointment. The Q4 growth of 7.4% was considerably higher than what was expected for the quarter, and the fastest seen in an otherwise dismal financial year. The main drivers were the construction sector returning to double-digit growth, and the agriculture sector posting a strong showing. These are also two major employment drivers. Services, too, continued their steady and strong growth. The manufacturing sector, on the other hand, grew at just 4.8%, down from 11.3% in Q4 of the previous year. There is a reality check hiding in the aggregate numbers, as well. The GDP growth rate of 7.4% was achieved in large part due to a 12.7% growth in net taxes. This bump in tax collections provided a statistical boost without which growth in actual economic activity would have come in at around 6.8%. The much-hyped ‘Maha Kumbh effect’ on consumption expenditure also does not seem to have materialised. Growth in Private Final Consumption Expenditure in Q4 — the Kumbh quarter — came in at 6%, the slowest in five quarters. Capital formation, however, grew a robust 9.4% as the government finally sped up its sluggish capital investments.Government officials and Union Ministers have expressed their satisfaction at the 6.5% growth in 2024-25, the slowest since the pandemic, saying it is still the fastest among major economies, and not bad in the context of a “growth-scarce” global environment. All of this is true. Yet, ‘not bad’ is not nearly good enough for India. The race is not with the rest of the world, but is an effort to keep pace with the country’s growing requirements. The Modi government, with its sights set on a ‘Viksit Bharat’ by 2047, must be held to a higher standard in line with its aspirations. If, as the Economic Survey points out, Viksit Bharat by 2047 requires “sustained economic growth of close to 8% every year for at least a decade”, then India is decidedly moving very slowly, even if in the right direction. In his press conference, Chief Economic Adviser V. Anantha Nageswaran said India was entering a phase of low inflation and stable growth. Stability can be good, since it implies lower chances of growth slowing. Yet, it also implies growth is unlikely to accelerate significantly either. The government needs to consider whether this is truly a satisfactory situation for a transitioning economy.\r Published - June 02, 2025 12:30 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        construction and property\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        manufacturing and engineering\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        Economic Survey",
        "headline_1": "​Growing pains: On economic performance, Viksit Bharat",
        "headline_2": "India needs to grow faster to transition as a developed economy",
        "link": "https://www.thehindu.com/opinion/editorial/growing-pains-economic-performance-viksit-bharat/article69645342.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-06-2025"
    },
    {
        "full_article": "The decision by the Bharatiya Janata Party-led Assam government to issue arms licences to “eligible” indigenous communities in remote and vulnerable areas in the State is fraught with danger. The State government seems to suggest that indigenous communities living in the border areas abutting Bangladesh are vulnerable and that armed licences would be a deterrent and improve their personal safety and confidence. Chief Minister Himanta Biswa Sarma has also insisted that these grants would not be for people near inter-State borders in Assam. But these caveats still do not take away from the fact that arming specific civilian groups is liable to be rampantly misused for acts such as vigilantism and inter-community rivalry, as the lines between law enforcement — which carries legal authority and has a monopoly over armed instruments — and private citizens are blurred. In a State that has been beset with insurgent violence and where the threat from groups such as the ULFA (Independent) remains, introducing more arms into civilian hands risks propagating further violence and arms proliferation rather than ensuring enhanced security. Instead of arming civilians, ostensibly for self-defence — a move akin to abdicating its core responsibility — the State government has the clear alternative of enhancing its own law enforcement and security presence in these “vulnerable areas”.It is well understood that in modern states, the monopoly over instruments of violence will remain with the government and its law enforcement agencies. In India, arms licences are issued in a restricted manner as a delegated and a limited right to self-preservation to select individuals through a stringent licensing process under the Arms Act, 1959 and the Arms Rules, 2016. These rules under the law preclude the provision of such licences to larger, identified groups — where identification itself could be fraught with the risk of conflicts — as they not only present administrative challenges but also make it difficult for the government to license, monitor and recover firearms as the law requires it to. Arming civilian groups, even with an intention to do so with some stringent implementation, runs the risks of having these weapons entering grey markets and falling into the wrong hands, besides designating those groups with an authority that could backfire on the state. This was evident when security forces in Chhattisgarh arming civilian groups for protection against the Maoist threat — in the Salwa Judum campaign in the late 2000s — led to severe human rights violations and lawlessness, before the Supreme Court of India intervened to deem the policy to be illegal. Considering these problems, Assam must reverse its decision. Published - June 02, 2025 12:15 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Assam\n                    \n                            /                      \n                        \n                        community-led\n                    \n                            /                      \n                        \n                        national or ethnic minority\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Bangladesh\n                    \n                            /                      \n                        \n                        law enforcement\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        personal weapon control\n                    \n                            /                      \n                        \n                        Chhattisgarh\n                    \n                            /                      \n                        \n                        judiciary (system of justice)",
        "headline_1": "​Wrong call: On Assam and arming civilians",
        "headline_2": "Assam government’s decision to arm civilians goes against law enforcement",
        "link": "https://www.thehindu.com/opinion/editorial/wrong-call-on-assam-and-arming-civilians/article69646118.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-06-2025"
    },
    {
        "full_article": "Skilled in getting what’s on the menu, off the table\nThe most dreaded moment for the tight-fisted when throwing a party does not come when the bill arrives but when the menu is offered. Ignoring the glossy cover, they quickly scan the rates, not the dishes. Marshalling all resources at their command, they try to manipulate the guests to make choices that are less likely to burn a hole in their pockets. Saying that the guests must be hungry, they offer to order first. This ruse is to avoid the overpriced soup. Fancy salads are also talked down. \nGuests learn to their astonishment that red onions dipped in vinegar, usually served on the house, must be tried occasionally for sheer variety. Penny-pinching hosts then preempt the free-wheeling conversation from sliding back to expensive dishes for the main, and only, course. Multi-course meals are best enjoyed when someone else picks up the tab.\nGetting most to agree on dishes that sound commonplace is the next move. Served in large quantities, they usually cost much less than those with odd names and odder origins. Humble alu-gobi sabzi fits the bill. Mix-veg also gets top billing despite doubts about its contents.\nBut then, every family has someone who’s a notorious spendthrift known for throwing lavish parties. Their presence induces others to acquire costly tastes as long as they are not footing the bill. Recalling the gastronomic delights of high-end eateries, they scan the menu with manifest disdain. Like children, they insist on speaking the truth.\nWhen their monologue begins, the host misses more than a heartbeat. Only wife knows what he’s going through. Naming the exotic parts of the menu, the self-appointed connoisseurs torment the budget-conscious host. Feeble attempts to return attention to staple fare don’t work.\nThat’s when the host pulls out the last arrow in his quiver: nutrition and diets. Abrupt mention of health concerns wins the day because people either know too much or nothing about empty calories and prefer silence. Suddenly, desserts sound sinful.\nHaving planted the seed of doubt in his guests’ minds, the host signals the waiter to take the menu away. This shrewd gesture limits options and the host places the order in a relatively affable mood. But while soup, salads and desserts can be circumvented, taxes can’t. Yes, the bill sometimes lights up the host’s face. When it doesn’t, he settles on a plan of action to play the connoisseur at the next invite.\n\n",
        "headline_1": "Menu manipulators",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/menu-manipulators/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-06-2025"
    },
    {
        "full_article": "Losses are inevitable in military ops. India’s done the correct thing by acknowledging them\nIn wartime, truth is so precious that she should always be attended by a bodyguard of lies, Churchill said in WWII. Like tennis, where you can lose back-to-back sets and still win the match, war has its ups and downs, and it’s good policy not to let the lows affect public morale. America knew it was losing Vietnam but never admitted it, until the 1971 Pentagon Papers leak. It never got a grip on Afghanistan in 20 years, but for the longest time maintained it had.\nIn contrast, India has been surprisingly candid about its losses in Op Sindoor. While Pakistan claimed it had shot down five IAF jets on May 7 – the night raid that launched Op Sindoor – India neither confirmed nor denied it at the time. But shortly after the May 10 ceasefire, Air Marshal AK Bharti told a press conference, “We are in a combat scenario and losses are part of combat.” And three weeks on, CDS Gen Anil Chauhan has more or less ended the suspense: “What I can say is that on May 7, in the initial stages, there were losses.” But not six planes, as Pakistan is now claiming.\nThis acknowledgment is a measure of India’s morale. The country does not need to cover up because Op Sindoor achieved all its objectives. As for making a full disclosure, that can wait till the operation is over – it’s only suspended post-ceasefire. Besides, as the CDS said, more than the numbers, what mattered was the reasons for the losses, and a course correction, which India made.\nIndia’s official responses may have seemed slow, but they adhered to facts. Dangers of the alternative – unverified claims – were brought home on May 8 when some TV channels abdicated all journalistic responsibility and spread wild untruths. While it might have seemed patriotic to those in front of the cameras, it only increased the military’s burden. The CDS said 15% of operational time during Op Sindoor was spent countering fake narratives and disinformation.\nLater, the audience’s unreasonable expectations, stoked by disinformation, resulted in the vicious trolling of foreign secretary Vikram Misri, who along with Col Sofiya Qureshi and Wing Commander Vyomika Singh had been the face of India’s factual and measured media response during the hostilities. If Op Sindoor proved one thing, it’s that riding the tiger of disinformation is always folly. \n\n",
        "headline_1": "Fighting words",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/fighting-words/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-06-2025"
    },
    {
        "full_article": "Tiger conservation has been a great success, but not without a fight. More needs done\nAs humans place evermore pressure on land, the snappy ‘tiger or tribal?’ quip is no longer a wisecrack. Instead, it captures the strain between conservationists and tribal rights activists – a rather hopeless approach to both tiger conservation and efforts to ensure tribes exercise their forest rights. It cannot, must not, be one or the other. Man-animal conflicts are increasing as human habitation expands into dense jungles and ever high mountainsides, as roads swallow up forests, and extreme weather makes forests water scarce. Add to that high-tech poaching – 100 tigers killed in three years per a recent Indian Express investigation – and it’s easy to see why despite India’s brilliant tiger conservation efforts of 50 years, challenges to protect the big cat remain just as tough.\nIndia’s tiger mission has achieved much – but not without a fight. Not one step has been smooth or easy. Multiple groups and officials at multiple levels strode shoulder to shoulder to stop policy reversals, ensure environment assessments aren’t junked, counter pressures from politically influential tourism circuit. They’ve pushed back against projects that have included oil pipelines and rail tracks inside reserves, taken govts to court, and fought hard to include local communities in critical conservation. Such commitment ensured India added its 58th tiger reserve in March. Reserves now stretch over 80k sq km across 18 tiger-range states, home to an estimated 3,682 wild tiger population. Just eight of these have over 100 tigers – far fewer than carrying capacity even given habitats have shrunk by over 25% over the last decade. Tiger numbers are ever threatened – poachers within tribal groups find it a lucrative livelihood option. The core issues get muddled and lost when reduced to a ‘tiger or tribal’ axis. Fighting wildlife crime is among the most critical aspects today. Coordination between states, liberal funding, intensive training of dedicated field staff are essential to keep the tiger burning bright. \n\n",
        "headline_1": "Big cat challenges",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/big-cat-challenges/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-06-2025"
    },
    {
        "full_article": "If there is one thing the chief adviser of Bangladesh’s interim administration has clearly shown since the resignation drama of May 24, it is that he is no pushover. In the nine months at the helm, Nobel Prize winner and NGO icon Muhammad Yunus has slipped from being the man the country welcomed as a potential saviour to being regarded as a crafty, divisive figure with a bagful of personal agendas. Yet, lacking a political base of consequence and despite a steep fall in popularity, Yunus has pitted diverse groups against each other and clung on to power — although at a huge cost to Bangladesh.\nThe latest political crisis to envelop Bangladesh centres on the timetable of the national election that will install a democratic govt in Dhaka. In a paradoxical twist, the army has advocated elections by the end of 2025, a demand strongly endorsed by the Bangladesh Nationalist Party (BNP), now led from London by Begum Khaleda Zia’s son Tarique Rahman. On his part, Yunus has said he wants until end-June 2026 to first bring about unspecified reforms, and also bring the arrested leaders of the Hasina regime to justice. Activists of the National Citizen Party — derisively called the King’s Party — have even suggested that Yunus should be in office for the next five years.\nRead full opinion on TOI+\n\n",
        "headline_1": "Will Yunus go too far with the India bashing?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/will-yunus-go-too-far-with-the-india-bashing/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-06-2025"
    },
    {
        "full_article": "The first experience of the great river Padma is nothing less than overwhelming, and slightly terrifying. I first came to face the mighty river as a young lad in my teens sometime in April of the momentous year of 1971. My first sighting came with two terrors. My father was fleeing Dhaka with the family with the hope of crossing the river to escape the brutal onslaught of the Pakistan army. Arriving at the banks, there was the Padda (Padma) before us with its glorious panorama. It seemed like an oceanic river, with no sight of the other side, and the frightening prospect of crossing it.\nFlowing gloriously and indifferently, the river appeared to have a mythic scale against which I felt terribly puny. What I could not articulate then, and what I think now, was the simultaneous presence of the beautiful and the sublime, in the now classic sense of how the writer Edmund Burke described the sublime as something that could be terrifying. Even more ominously, the German poet Rilke: \"Beauty is nothing but the beginning of terror…\" There, in the immediacy of the beautiful, was also the silent presence of a palpable dread. Now I know that the magnificent Padda could easily transform into a kirtinasha, destroyer of human artifacts, or even shorbonasha, destroyer of everything.\n\nRivers have generated the most primal image and imagination of the human, while serving as an original impetus for forming communities and making cities and settlements. If the word 'reverie' suggests a kind of imagination, I thought an imagination of rivers may be conveyed by a new term: riverie.\nSince that first experience, the Padda settled and remained in my mind as something larger than life. It's not the same for other rivers of Bangladesh. The Padda represents the depth of history and the stretch of time, both geological and human, for it is this river that has literally gifted the ground on which the Bengali peoples built their life-worlds. Some 35 million years ago, in the geological time called Eocene, when the sea lapped the edge of the Rajmahal Hills and Bengal was only a watery realm, the slow cascade of silt pushed the sea to form new lands and the path for a mighty river.\nCutting across the sweep of Bangladesh diagonally, the Padda remains the spiritual and vital spine of the land. Recalling the words of Prof. Abdur Razzaq; \"The character of Bangladesh and its people is dominated today, as it has always been, by the river system and the water it carries. The shifts and turns of the river have been momentous facts for the people, greater than political and governmental upheavals.\" Writers like Manik Bandhopadhya, Amarendra Ghosh, Humayun Kabir and Advaita Malla Barman have crafted literary masterpieces that weave the lives of the people – fishermen, farmers, traders, boatmen, artisans – with the rhythm of the rivers. We cannot know whether environmental degradation and water conflicts will eventually diminish a river as powerful as the Padda, but we know that our future is entangled with our rivers, and nothing more intimately as the epic Padda.\nNow, many years later, after that experience in 1971, I came to face the immensity of the Padda again when my colleagues and I at Bengal Institute dared to consider a book on the river. It was a dare because there has been no book of substance on Padda river. We faced more fundamental questions: How can we know rivers? How can we talk about them? What is the language of rivers?\nIt's not that one writes about a river as one would compose the biography of a famous person, or the histology of a subject. There are of course glimpses into the river in folk songs, stories, legends, and modern novels. But for a river as shifting and pulsating as the Padda, one that is constantly in a mode of deletion and accretion, there is more to what is known and what can be known. \nRivers have generated the most primal image and imagination of the human, while serving as an original impetus for forming communities and making cities and settlements. If the word 'reverie' suggests a kind of imagination, I thought an imagination of rivers may be conveyed by a new term: riverie.\nNot all waters are alike in human imagination. The French philosopher Gaston Bachelard distinguished between terrestrial water and marine water. To him, seawater is an inhuman water that \"fails in the first duty of every revered element, which is to serve humans directly.\" On the other hand, fresh water or river water generates the most intimate form of material imagination and life mythologies for humans. Reading Rabindranath's \"Chinnapatraboli,\" I was captivated by his perceptive observations of life and landscape along the Padda. Rabindranath himself distinguished between a river and a \"beel\" (a form of wetland). One is flowing water and another is still water – in musical analogy, he described the first as chhanda or rhythm and the other as boba pani or mute water.\nWrestling with the imagination of water, we approached the Padda as perhaps a poet and a cartographer would. The book we worked on ultimately became the sumptuous production, The Great Padma: The Epic River that made the Bengal Delta, published by ORO Editions (San Francisco) and Bengal Institute in 2022. Why the book at all? We realised that for a river so decisive in the life of a people and a nation, there is no major book on it. There are a couple of Bangla books but they fall short in comprehending and narrating the epic nature of the river. On the other hand, there are so many books on the river Ganges, by historians, writers, photographers, but they have nothing much to say on the Padda. We wanted to present a panoramic narrative befitting the epic nature of the Padda.\n\"The Great Padma: The Epic River That Made the Bengal Delta,\" Zachary Lamb writes in a review, \"is a new volume that introduces the power, complexity, and cultural richness of the Padma to a global audience…. The Great Padma explores and illuminates Bangladesh and the eastern Bengal Delta, a region that has long been ignored or presented as a domain of poverty, vulnerability, and developmentalist intervention. The book, with 400 pages of visual and narrative material from dozens of contributors, depicts the complexity of the Padma in all of its culture-defining, landscape-molding, and devastation-wreaking power.\"\n\nCrossing the Padda is a powerful experience under any circumstance. Any of us who have crossed the river in a ferry or boat at an earlier time, and even now on the Padda Bridgeway, cannot but be overwhelmed by the crossing. It's a symbolically and phenomenologically potent event layered with the thickness of history. \nIn his preface to the book, the renowned writer Amitav Ghosh notes that the Padda has many avatars. We discover it in the many names of the river found in literature and hearsays – Paddaboti, Padda, Ganga, Mahaganga, Mahasindhu, Kirtinasha, and the more troubling, Shorbonasha. To capture and represent the many-hued nature of the Padda, a multi-voiced narrative was needed. Geographers, historians, anthropologists, architects, food historians, bridge designers, photographers, and researchers from many fields contributed in enriching the content of the book, and advancing some key topics.\nFirst, the Padda is the Ganga, and it is not. Both are true. The life and flow of the Padda is integral to the Ganga, the mighty river that flows through and nurtures the heart of central India. When the waters of the Ganga become the Padda, a new ecology emerges that eventually defines a distinctive life-world that is Bengal/Bangladesh.\nWhile the Ganga presents a powerful mythical imagery in Indian imagination, the Padda is more about its ever changing nature, its flux and fluctuations. Even if the Padda is not considered sacred as the Ganga, it has always been seen in terms of, what colonial chroniclers have written, a distinctive 'grandeur and enchantment.' More importantly, while most of the stories about the Ganges are more about its origins (consider the narrative of \"Gangavatarana\"), the Padda describes the operatic termination of the Ganges.\nSecond, the termination of the Ganga translates into the unleashing of a furious hydro-geological phenomenon: the churning of water, sand and silt, and the fracturing into multiple channels and rivulets – the stuff of the Bengal Delta. As a part of that phenomenon, the Ganga bifurcates into two major channels: the Hooghly-Bhagirothi and the Padda itself (we argue that the Padda is not a channel of the Ganga, it is the main flow of it.). I have described those two channels as two distinctive ecological axes contending for the soul or identity of Bengal. In his memoir, Amartya Sen describes that as the two charismas of Bengal, or one could say two river-generated chauvinism. With the Hooghly-Bhagirothi claimed as the Ganga from a Nadia-Kolkata-centric perspective, we have a riverine antagonism between Hooghly-Bhagirothi and the Padda.\nThird, as with any river, and certainly with the Padda, the phenomenon is not merely about a channel or stream of water. Rain falls, water collects, water spills, overflows and wets the land in a gradation of wetness. A big aspect of the book is trying to understand the reach of the Padda, or what we named it as its \"ecological horizon.\" The waters of the Padda combine with that of the Jamuna and eventually the Meghna, flow through innumerable channels all the way to the sea, generating the Sundarbans and everything in between that describe a living, moving nature. It is one of the most dynamic natural forces on earth, or what can be described as a \"geography in action.\" Writing in the book, historian Iftekhar Iqbal calls this phenomenon the Padma Process, and geographers Arfar Razi and Sanjoy Roy describe it as the Padma Dynamic.\nFour, the literal meaning of ganga, any ganga, is flow. As Manik Bandopadhya speaks in the voice of Kubera in Padda Nodir Majhi: \"the only obsession is to flow and float on.\" Padda is not only a flow of water but also of silt and sediment, the wondrous matter of poli. Water and silt, flow and overflow, and accretion and erosion are decisive in the chhanda of Bangladesh.\nWe need to rethink the power of poli. An English writer calculated that as a monumental theater of nature, the flow of the Padda moves 400 billion cubic feet of silt every year which is equivalent to 300 pyramids! Imagine 300 pyramids, each the size of Giza, flowing down the Padda into the Bay of Bengal. It is almost one pyramid for each day!\nOriginating with rolling stones from up in the Himalayan mountains, the gradual pulverisation into poli, and the continuous immersion of natural and human debris from Central India flow and float through the Padda to become the substance of Bengal. Writing in the book, the landscape architect Anthony Acciavatti describes the dynamic as the Himalayas crumbling and rolling into the plains of Bengal, providing the silt and soil that nurtures the land but also becomes transformed into bricks and eventually our cities and buildings. If you think about it, Dhaka city is but a reincarnation of the Himalayas. The flow of poli and its dynamic deposition and dematerialisation, and rearrangement, is fundamental to the geography and life-world of Bangladesh. Agriculture, farming, fishing, the nature of settlements and the livelihoods of people are totally dependent on this flow. I wrote earlier in an article, referring to Prof Razzaq, that we need to be more vigilant about and plan around those two gifts of nature—water and silt.\nThe combined impact of the Padda-Jamuna-Meghna does not conclude with where the land surface of Bangladesh ends. The inexorable flow of silt does not end at the edge of the coast either: it continues underwater and into the belly of the Bay of Bengal, creating a submarine landmass that is known to geographers as the Bengal Fan. The size of the underwater mass is immense. It is larger than two Bengals put together, and in its relentless flow, it reaches almost the Equator. We do not know yet what kind of impact the Fan has on suboceanic currents, and possibly the global oceanic environment.\nWhen we faced the Padda in 1971, the reason was to go over to the other side. Crossing the Padda is a powerful experience under any circumstance. Any of us who have crossed the river in a ferry or boat at an earlier time, and even now on the Padda Bridgeway, cannot but be overwhelmed by the crossing. It's a symbolically and phenomenologically potent event layered with the thickness of history. Since the silt pushed the sea away from the Rajmahal area and Ganga became the Padda, thousands and thousands have crossed the Padda, from majhi-mallas to raja-badshahs, and from Raja Rampal to the poet Bhushuku, to go over to the other side.\nI want to conclude with a Charyapada poem written by the poet Bhusuku from around the eleventh century. The poem-song is the earliest literary reference to the Padda and an event of crossing it. Bhusuku apparently came from the south, crossed the Padda, settled in the Barendra area by marrying someone he calls a Chandal woman. On settling there, Bhusuku declares at the end, \"I have now become a Bangali.\" Hesitating in suggesting a nationalist notion, I still see in crossing the Padda a traversal of Bengal's history, both social and geological. The book, \"The Great Padma,\" is such a crossing.\nKazi Khaleed Ashraf is an architect, urbanist, and writer, and directs the Bengal Institute for Architecture, Landscapes and Settlements. He edited and wrote for \"The Great Padma.\"\n\n",
        "headline_1": "Writing the Padma",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/focus/news/writing-the-padma-3909011",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-06-2025"
    },
    {
        "full_article": "We are quite concerned about the sufferings of people in coastal regions as recent heavy rains and tidal surges have submerged many areas, following a deep depression over the Bay of Bengal. According to a preliminary assessment by the Department of Disaster Management (DDM), seven out of 19 coastal districts experienced significant damage, with a significant portion of homes and infrastructure severely affected. At least two deaths have been reported, including a police officer who died when a trawler capsized in the Meghna River, leaving eight people missing.\nWhile the depression has now weakened, light to moderate rainfall is expected across the country over the next few days, with further flooding anticipated in Sylhet, Sunamganj, Moulvibazar, and Netrokona. In that case, there are also chances of landslides in areas like Chattogram. Against this backdrop, the government must make it a priority to provide immediate aid to the affected regions while also strengthening its preparedness for future disasters.\nAmong the more affected districts are Noakhali, Patuakhali, Bhola, Cox's Bazar, Khulna, Barguna, and Barishal, which suffered from a combination of flooding, strong winds, and embankment breaches. People are still stranded across these districts, enduring food and water shortages. Meanwhile, thousands of homes have been destroyed, vast Aman seedbeds submerged, and many fish farms washed away. For instance, the fisheries sector in Barishal alone suffered an estimated Tk 45 crore in losses. In the Sundarbans, tidal surges contaminated freshwater ponds. In Khulna, a collapsed embankment near Harinkhola has left 15,000 residents in distress. Transportation has also been severely affected in all these regions as rains have caused severe waterlogging. In St Martin's Island, residents are struggling with food shortages and power outages due to boat service suspension.\nThe full extent of the damage will only be known after a complete assessment is conducted. However, based on our reports, we can assume that the economic loss caused by recent flooding would be huge and take time to recover. We, therefore, urge the government to take all necessary measures to address it. It must intensify efforts to assist affected communities and deploy teams to hard-to-reach areas with food, water, and medicine. Additionally, it should provide monetary assistance to crop and fish farmers who have lost their sources of income. Repairing breached embankments and building new ones, where necessary, should also be a top priority.\nAs the monsoon season has just begun, we are likely to face more such calamities in the coming months. Our flood preparedness must therefore be more efficient so that both damage and suffering can be minimised.\n",
        "headline_1": "Coastal people need urgent support",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/coastal-people-need-urgent-support-3908701",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-06-2025"
    },
    {
        "full_article": "In any democratic society, justice is a basic right. People expect that if someone is wronged, there will be legal protection. If someone is harmed, the law will respond. However, in today's Bangladesh, that expectation is slowly fading. A dangerous trend is growing, where angry crowds take the law into their own hands, and people are punished without trial. This is mobocracy, and it is threatening our entire justice system.\nMobocracy means rule by mobs, where it is decided if someone is guilty without any investigation or judicial process. Unfortunately, we see this often in Bangladesh. Public anger sometimes takes over when someone is accused, before the truth emerges. Instead of the police and the court handling the situation, the public reacts with violence, and sometimes, this ends in tragedy.\nOn March 4 of this year, two Iranian nationals came under a mob attack in the Vatara area of Dhaka. The incident reportedly began when they visited a local business to exchange foreign currency. A disagreement arose, leading to suspicions that the Iranians were attempting a mugging. This suspicion quickly escalated into a violent mob attack against the two foreigners. After a call was made to the national emergency hotline 999, police arrived at the scene and rescued the victims.\nJust a day earlier, a separate and tragic event unfolded in Satkania, Chattogram. Following the loudspeaker announcement from a mosque warning that robbers had entered the area, locals responded with mob violence. As a result, Nezam Uddin and Abu Salek were beaten to death in the Chan Khola West Para area of Eochia Union.\nSimilarly, on February 28, a group of drug users created a mob and assaulted an on-duty police officer Yusuf Ali, in Patenga, Chattogram. When he tried to stop some people from using drugs, some unruly youths labelled him as a fake cop and attacked him. Later, 12 people were arrested in connection with the case.\nLastly, the recent case of Rais Uddin, an imam who served at a mosque in Pubail, Gazipur, shows how dangerous this growing trend has become. He was accused of paedophilia, but before a proper investigation could take place, he was attacked by a mob. The police arrested him, and the court sent him to jail, where he later died.\nThis is a serious failure of the legal system. Whether the allegation was true or false, everyone deserves a fair investigation. Dying in such a situation is not just a personal loss; it is a public concern. This reveals that our system is not working the way it should.\nAccording to people who knew Rais, the attack was pre-planned and driven by ideological rivalry. His differing views provoked hostility from opposing groups, according to his family. This brutal killing has led to strong condemnation from concerned citizens across the country.\nWhat is even more concerning is that, despite clear video footage showing who the attackers were, not one of them has been arrested. In contrast, the attackers of National Citizen Party leader Hasnat Abdullah in Gazipur were arrested within only a few hours. So, why is there a different approach when it comes to Rais, who is also a citizen of the same country? Does justice only apply to those with influence or power?\nGiven all this, what kind of country are we becoming? One where mobs replace courts? Where police choose whose voices to hear? If this continues, justice will become a rare thing, and no one will feel safe, not even the innocent.\nThe growing trend of mob justice has led to a disturbing rise in incidents such as beatings, attacks, vandalism, looting, and even extrajudicial killings. These acts are not limited to actual wrongdoers; innocent and law-abiding individuals have also fallen victim. While incidents of robbery and mugging have increased on one side, the rise of mob culture has simultaneously become more severe. People are taking the law into their own hands, often in some parts of the country, which is causing a rise in murders and other crimes. Alarmingly, even political rivals have been targeted in some cases, raising serious concerns among members of civil society about the erosion of justice and the rule of law.\nIf we truly want change, we need stronger and fairer institutions. Also, as citizens, we must stay alert and raise our voices, not just when injustice happens to someone we know, but whenever anyone's rights are denied. We must demand an end to mob violence and ask for a future where people can trust the system again, where truth, law, and fairness matter more than anger or rumour. Because when justice is replaced by fear, and feelings replace facts, we all lose.\nMuhammad Raihan Uddin is research associate at the Bangladesh Institute of Governance and Management (BIGM). He can be reached at: [email protected].\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "We must reclaim justice from mobocracy",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/we-must-reclaim-justice-mobocracy-3908641",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-06-2025"
    },
    {
        "full_article": "We are concerned about the relentless forest grabbing in Sonadia Island. During the AL regime, individuals connected to the government razed vast acres of forest on the island, and alarmingly, the destruction has continued even after the regime's fall. Since August 5, over 1,000 acres of protected mangrove forest have been reportedly cleared for shrimp and crab farming. This came to light after grabbers recently set fire to piles of felled trees to destroy evidence of their activities.\nOver the years, Sonadia's encroachers have cleared more than 3,000 acres of mangrove forest to establish shrimp enclosures. With the latest 1,000 acres encroached, the total now stands at 4,000. We wonder why the concerned authorities are unable to stop these illegal activities. In October last year, the High Court ordered relevant officials to remove illegal shrimp projects, take legal action against those destroying the mangroves, and submit a compliance report within 90 days. On November 28, the Supreme Court upheld this order, directing the government to stop mangrove destruction immediately. Yet forest grabbing, along with shrimp and crab farming, continues in this ecologically critical area. This is deeply unfortunate.\n\nLast July, the Department of Environment (DoE) filed a case against 26 individuals, mostly linked to the AL, for seizing 128 acres of forest land in Sonadia, temporarily halting their action. But they soon resumed it in the absence of administrative follow-ups and legal consequences. Again, on May 18 this year, the DoE filed a case against 20 individuals, including a local BNP leader this time. This shows how the encroachment business has continued to enjoy political support regardless of the political transition, for which BNP and other parties must answer.\nWhile the relevant officials have sometimes taken actions, those have been mostly ineffective. For instance, last July, the Department of Environment (DoE) filed a case against 26 individuals, mostly linked to the AL, for seizing 128 acres of forest land, temporarily halting their action. But they soon resumed it in the absence of administrative follow-ups and legal consequences. Again, on May 18 this year, the DoE filed a case against 20 individuals, including a local BNP leader this time. This shows how the encroachment business has continued to enjoy political support regardless of the political transition, for which BNP and other parties must answer.\nWe urge the authorities to make lawsuits against forest grabbers effective by ensuring swift case disposal and strict punishment. While the Sonadia administration has reportedly conducted some drives to stop the grabbers, these were insufficient. Such efforts must be increased. Moreover, the DoE must assess the actual scale of forest loss as the figures mentioned in official cases reportedly fall far short of reality. While the interim government's cancellation of land allocated to the Bangladesh Economic Zones Authority (BEZA) for establishing an eco-tourism park on the island is reassuring, it must now take comprehensive actions to stop the culture of forest grabbing.\n",
        "headline_1": "Save Sonadia Island’s mangrove forests",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/save-sonadia-islands-mangrove-forests-3907236",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 02, 2025 00:00:00  \nWaterlogging has long been a chronic civic menace in Dhaka, yet it remains largely unchecked and appears to be worsening with each passing year. What many dismiss as a seasonal inconvenience is, in reality, a serious public hazard. Pothole-ridden roads, open drains, and missing manhole covers pose lethal threats to commuters when submerged under rainwater, turning everyday travel into a dangerous ordeal. Yet, the cause of public suffering and hidden danger has not received adequate attention. Each monsoon, waterlogging sparks public outcry as roads go underwater, vehicles stall, and citizens are forced to wade through filthy, stagnant water. But beyond routine blame games and short-term clean-up drives, little is done. Only sporadic efforts are made to clear clogged drains or remove illegal encroachments from the canals. Rarely is anyone held accountable for dumping waste or infringement on waterways. Worse still, evicted encroachers often return once the authorities' fleeting efforts end. As a result, the problem not only persists, it deteriorates by default.\nThe recent spell of heavy rain, triggered by a deep depression in the Bay of Bengal, once again laid bare the city's alarming unpreparedness. Large parts of the capital including Shantinagar, Mirpur, Shewrapara, Green Road, Nilkhet, and areas of Old Dhaka, were submerged. Traffic ground to a halt, commuters were trapped for hours, and pedestrians braved knee-deep water. Alarmingly, this is only the beginning of the monsoon season. The Met Office has forecast even heavier rainfall in the weeks ahead.\nAt the heart of Dhaka's waterlogging crisis lies the longstanding neglect and mismanagement of its canal network. Until 2021, the Dhaka WASA was responsible for drainage management. During that time, city corporations often deflected responsibility by blaming the WASA for the annual deluge. When the city corporations took over the task of canal and drainage maintenance, there was renewed hope that real progress would follow. Sadly, that hope has faded. Despite expenditure of billions of taka on canal rescue and renovation, not a single canal has been meaningfully restored. Grand inauguration ceremonies have been held, even under the current interim government, to launch canal rehabilitation projects, yet residents have seen no visible improvement. For them, these remain empty gestures with no real impact. With the monsoon now in full swing, any meaningful canal restoration work has become virtually impossible. \nMeanwhile, urban experts warn that surface-level clean-ups of the canals are no solution. Removing floating garbage from canals may offer temporary relief, but the real issue runs deeper. There are several stages before rainwater flows through the drains and into the river, and these also demand attention. They pointed out that rainwater flows through catch pits and into the drains beneath the road. Many catch pits and drain openings are blocked. Furthermore, garbage and sediment accumulation have drastically reduced the capacity of the drainage system and canals, which need to be fixed. Moreover, the lack of coordination between Dhaka's two city corporations is a major obstacle. Instead of implementing long-term solutions as per a sound master plan, both the authorities continue to offer piecemeal fixes, wasting public funds while failing to address the root of the problem. Dhaka's waterlogging crisis cannot be resolved with cosmetic measures. It demands serious, coordinated action grounded in long-term planning, engineering insight and, above all, accountability. Until then, the city's residents will remain hostages to a recurring disaster that is as predictable as it is preventable.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Is there no end to waterlogging?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/is-there-no-end-to-waterlogging-1748794661",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       June 02, 2025 00:00:00  \n\nThe International Labour Organization (ILO)'s recently released World Employment and Social Outlook (WESO) report portrays a rather grim picture about the state of youth employment in Bangladesh. This is more so, as according to the outgoing country director of ILO, Bangladesh, who said, 'Global contraction of jobs is of grave concern, especially for Bangladesh which is undergoing political, economic, social and climatic transitions and sends over a million workers abroad'. \nIn this connection, going by the Bangladesh Bureau of Statistics (BBS)'s recently published Quarterly Labour Force data, in the second quarter of fiscal FY25, Bangladesh's unemployment rose to 4.63 per cent. The reason is, it says, the number of people unable to get a job was growing. So, the prospect for Bangladeshi workers to get overseas jobs looks less promising seeing that the ILO in its global employment forecast for 2025 projected the creation of only 53 million jobs which is 7.0 million fewer than 60 million forecasted earlier. Against this backdrop of declining trend in overseas job prospects for Bangladeshi workers, according to a news report, Japan, a highly industrialized Asian country, is going to recruit 100,000 workers from Bangladesh in the next five years is undoubtedly heartwarming.\nIn this connection, two Memoranda of Understanding (MoUs)are learnt to have been signed with Bangladesh's Bureau of Manpower Employment and Training (BMET), a department under the Ministry of Manpower Development and Social Welfare. The organizations that signed the MoUs with BMET are Kaikom Dream Street (KDS) BD Co, Ltd.---a Japan-Bangladesh joint venture company. The second MoU, on the other hand, was signed between BMET and Japan's National Business Support Combined Cooperatives (NBCC), a Japanese federation representing some 65 companies and the Japan Bangla Bridge Recruiting Agency (JBBRA). Obviously, the private initiatives are recogised both by the governments of Japan and Bangladesh regarding Bangladeshi workers' recruitment in Japan. The importance of these events lies in the fact that unlike in the case of Western job markets, Bangladeshi job-seekers are not unwelcome due to restrictive immigration policy. Neither are they (Bangladeshi workers) endangering their lives at the hands of the illicit human traffickers. \nThe findings of a survey held some months back in Japan reveal that 57 per cent of the 3,500 companies which were interviewed, admitted that they hired foreign workers as they (Japanese companies) believed foreign workers could perform equally or even better than Japanese workers. In fact, this is a big shift in Japanese employers' mindset since in the past, the foreign workers who arrived in Japan on 'technical interim' visas got low-paid jobs. But the attitude has changed for the better over the years, thanks to Japan's declining population. The Japanese population including foreign nationals fell by 550,000 to 123.8 million in 2024. This marked the straight 14th year of decline in that country's population. In 2022, for instance, Japan's working age population (between 15 and 64 years of age) shrank by 296,000 to 74.2 million.\nIt is further projected that by 2060, the working age population would further decline to 47.95 million in Japan. Similarly, the labour force is projected to contract by 24 per cent or 16.1 million by 2050. Such a demographic regression in an advanced industrial nation is only expected. All industrially advanced nations are facing similar demographic crises. But when in Europe and North America, some politicians are whipping up anti-immigrant prejudice and obstructing entry of foreign workers, Japan has adopted the policy of welcoming them. However, unlike the job markets in the Gulf Arab states where most of Bangladesh's unskilled labour force has been traditionally destined, the Japanese labour market has practically no place for unskilled, or semi-skilled workers. Another barrier is the language. But the good news is that the Japanese companies willing to take Bangladeshi workers have come forward in this regard. The KDS that signed a MoU with BMET, for instance, will set up a specialised training cell at the Monohardi Technical Training Centre (MTTC). This facility will be under the Japan's Technical Training Program (TTIP) and Specified Skilled Workers (SSO) Initiative and operate by the name of Dream Street Business Training Center (DSBTC). The other MoU signed with NBCC and JBBRA, as noted in the foregoing, on a model training centre, styled, Bhalo Chakri Training Centre, will be set up under the TTIP and SSWO programmes. What is very interesting to note in this connection is that that different representatives of the Japanese industrial groups including the chairman of NBCC, Mikio Kasagayama, and the director of the Shizuoka Workplace Development Cooperative, Mitsuru Matsuhita, have openly expressed their choice about the skilled, young workers from Bangladesh. \nThis is a clear message from the Japanese corporate world that Japan, unlike other rich nations, industrialised or otherwise, will not be an apathetic or even hostile workplace for Bangladeshi workers. Given its aging population, the country is going to import an increasing number of foreign workers in the coming days. In that case, the government should expand the skills training facilities and Japanese language courses. Being a labour-surplus nation, Bangladesh should make the most of this opportunity.\nWhile celebrating the widening prospects for job opportunities for our workers in Japan or any other overseas destinations, the government should not lose sight of the fact that the Bangladeshi expatriate workers are not mere hard currency earning machines. Their and their families' well-being should also be of equal concern, especially for the Bangladeshi diplomatic missions in the host countries. A recent report by the Refugee and Migratory Movement Research Unit (RMMRU), an organization working for better governance and services in the migration sector, came up with some shocking statistics about the deaths of expatriate workers abroad. It says, 31 per cent of these migrant workers die unnatural deaths in their host countries. Of these deaths, 16 per cent reportedly die in accidents, while 15 per cent commit suicide. But some 48 per cent of the families and relatives of the dead migrant workers have no faith in the death certificates issued by the authorities concerned of the host countries. Analysing the RMMRU report, a discussion event on the issue last week in the city, pointed out that the average age of the accident and suicide victims is 37 years. In some cases, the deaths are caused under dubious circumstances. No further post-mortem examinations are done in Bangladesh after the dead migrant workers' arrive in Bangladesh, though some corpses show marks of injury. Since challenging death certificates of the victim workers issued by the host government might be a sensitive issue, the World Health Organization (WHO)'s involvement and its guidance need to be ensured in this case.\nIn sum, of all the concerns often expressed about the expatriate workers and their status, the ones about their personal well-being should take centre stage.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Job prospects, well-being  of migrant workers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/job-prospects-well-being-of-migrant-workers-1748794720",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       June 02, 2025 00:00:00  \n\nThat floods in this deltaic plain are recurrent is no news. The news is that the timing of this type of natural calamity has changed remarkably. Floods and the monsoon are interlinked. Before the month of Ashar on the Bangla calendar, the onset of monsoon was unimaginable. But this unprecedented phenomenon now looks all set to become a reality. At a time when in mid-Jaistha, sweltering heat was the norm with hardly any rain, the country this year is experiencing an early monsoon brought ahead by at least two weeks. The Bangladesh Meteorological Department has confirmed this. The heavy rains most of the country has witnessed over the past few days have threatened to cause floods in at least four districts in the north-eastern region of the country. Sunamganj, Sylhet, Moulvibazar and Netrakona districts are under threat of floods. \nWith the possibility of heavy rainfall continuing for five more days in the Sylhet region and mid-northern part of the country, the rivers there are likely to be in spate. The situation has been further complicated by the excessive rains in Mehgalaya where Cherrapunji is known for the heaviest rainfall in the whole world, which is located just on the other side of the border of north-eastern Bangladesh. To make the matter worse, excessive rainfall in that upper riparian Indian state comes rushing down the common rivers flowing between the two countries. \nSo, the country has to brace for floods in the making. Mercifully, though, this time Boro harvest in the haor areas of Sylhet and Sunamganj was completed earlier. For the last few years it had been a race against time for farmers to harvest the main crop of that area. The floods that caused extensive damage to standing Aman crop in wide areas of Feni and Cumilla in July-August last year actually had a negative impact on the country's food reserve. The newly installed interim government had to bear the brunt of this food shortage because millers and traders seized the opportunity of raising the staple price to a new level that still refuses to come down to the level before that astronomical price escalation.\nEven if the projected floods strike after harvest of the main crop, the areas apprehended to fall under the calamity's sway will suffer a lot. The suffering will depend on the enormity of floods. Sylhet's sufferings due to floods last year was no less telling. The visitation of floods in the hilly areas is different from those in plain lands. Torrential rains conspire with rivers flowing in full spate to create strong currents that sweep everything ahead of those. On that count, damage to crops including vegetables, livestock and immovable property is far greater than in areas where flat plain can disperse the flow of waters to temper the speed. \nThe rains of the past few days have already made some impact on the market. Almost all kinds of vegetables have become dearer and if floods wreak havoc with such green crops, their price will shoot up triggering inflation that gave an indication of relenting during the past few months. Struggling to stay afloat, the country's economy will be in real danger if a natural calamity causes widespread disruptions to its agriculture. Last time the administrative response to various needs of the flood-stricken and displaced people was poor. Let the administrative apparatuses responsible for undertaking relief and rehabilitation works be kept ready for any eventuality for an early and effective response. \nClimate has become capricious and the monsoon's arrival earlier than schedule speaks volume for the unexpected exigencies the government will have to handle. There should be more allocation for short-term relief and rehabilitation of people falling victim to river erosion, floods, storms and cyclones. The frequency of such Nature's convulsions including earthquake has become higher over the past few years. These may be considered an early warning for what the nations everywhere, particularly this calamity-prone country, are expected to encounter in the days to come. At a time when the pipeline of international aid has been drying up, the challenge will prove even more daunting than before.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The looming threat  of floods",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-looming-threat-of-floods-1748794769",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 02, 2025 00:00:00  \n\nDuring the July Uprising in Bangladesh, thousands of young people and ordinary citizens mobilised across the country, demanding freedom, justice, and the resignation of Sheikh Hasina's government. But while they braved bullets and batons, few anticipated the prolonged suffering that would follow. Many of the injured continue to endure untreated eye injuries, brain trauma, fractures, and permanent disabilities. Despite seeking help from both public and private hospitals, they have been denied adequate care. Some have died; others have been driven to the brink of despair.\nNine months on, repeated appeals to government ministries and advisors have gone unanswered. Most recently, four youths who lost their eyesight during the protests attempted suicide at the National Institute of Ophthalmology, overwhelmed by the lack of treatment and rehabilitation support.\nUnless urgent measures are taken, more lives may be lost. The government must immediately identify all injured protestors through district-level assessments and establish a national fund alongside dedicated medical support centres. Psychological counselling and long-term rehabilitation-including employment support-are also essential.\nThese protestors risked everything to demand a better future. The state must not abandon them now.\nNafiza Jahan\nStudent\nDepartment of History\nUniversity of Dhaka\nnafizajahan2003@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "July fighters' suicide attempt",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/july-fighters-suicide-attempt-1748794793",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-06-2025"
    }
]