[
    {
        "full_article": "The Standing Committee of Parliamentarians on Labour, Textiles and Skill Development, in its report on the 2025–26 demands for grants to the Union Ministry of Labour and Employment, has rightly reiterated the urgent need to revise the minimum monthly pension of ₹1,000 for member-pensioners under the Employees’ Provident Fund Organisation (EPFO). This amount, fixed in August 2014 under the Employees’ Pension Scheme (EPS) of 1995, has remained unchanged for over a decade. Ironically, the Bharatiya Janata Party (BJP)-led government continues to take credit for the pension hike in 2014, though it merely implemented a decision announced earlier by the Congress-led United Progressive Alliance (UPA) regime. Back in 2014, when the UPA proposed the ₹1,000 minimum pension, the BJP, which was in the Opposition, criticised the move as insufficient. Its senior leader, Prakash Javadekar, called it a “pittance” and demanded a hike to at least ₹3,000.At present, the government allocates an average of ₹980 crore annually for minimum pension payments. This figure needs to be tripled in order to make it a meaningful increase. Additionally, the Centre contributes 1.16% of wages (capped at a ₹15,000 monthly wage ceiling) towards the EPS corpus — an amount revised to ₹9,250 crore for 2024-25 and expected to cross ₹10,000 crore in 2025-26. The government’s argument is that it cannot afford a further financial burden, but feasible suggestions to manage the additional expenditure have been submitted to the Labour and Finance Ministries and the EPFO. Equally concerning is the EPFO’s handling of applications from those opting for pensions based on higher wages. Many applicants, now receiving demand notices requiring contributions amounting to several lakhs of rupees, have been left in the dark about their entitled pension amounts and arrears. In several cases, applicants have had to rely on their online accounts to track updates, as the EPFO has failed to issue any official communication. Instead of providing clarity, applicants are expected to calculate their expected pension through a portal-based calculator that comes with a disclaimer and no assurance of accuracy. The situation is worse for member-pensioners from exempted establishments, where authorities have summarily rejected applications for higher pension and even stopped previously sanctioned higher pensions without proper explanation. The Union government must initiate comprehensive stakeholder consultations, take steps to increase the monthly pension and ensure the fair treatment of all member-pensioners.\r Published - April 02, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        pension and welfare\n                    \n                            /                      \n                        \n                        wage and pension\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        employee benefits\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        United Progressive Alliance\n                    \n                            /                      \n                        \n                        finance (general)\n                    \n                            /                      \n                        \n                        government",
        "headline_1": "​Pension woes: on EPFO member-pensioners",
        "headline_2": "The Centre must bring in transparency in scrutiny of pension claims",
        "link": "https://www.thehindu.com/opinion/editorial/pension-woes-on-epfo-member-pensioners/article69400075.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-04-2025"
    },
    {
        "full_article": "United States Vice President J.D. Vance’s recent visit to Greenland, where he reaffirmed U.S. President Donald Trump’s plan to assert control over the Arctic island, was a blunt demonstration of American power over a strategically vital territory inhabited by around 56,000 people. The visit drew sharp disapproval from Greenland’s local leaders and the Danish government, which retains sovereignty over the island. It marked a new low in U.S.-Greenland relations, which have soured in recent weeks. While Mr. Vance was inspecting the Pituffik Space Base (formerly Thule Air Base), Mr. Trump declared that the U.S. would “go as far as we have to” to take control of Greenland. This is not the first time that an American administration has attempted to acquire the island. In 1867, following the purchase of Alaska from Russia, the U.S. held unsuccessful talks with Denmark to buy Greenland. During the Second World War, after Nazi Germany occupied Denmark, the U.S. established military and radio stations on the island. In 1946, Washington offered Denmark $100 million for Greenland, which it rejected. More recently, during his first term, Mr. Trump made a similar offer, which was again declined by Denmark and Greenland. Now, in his second term, he is aggressively pursuing the idea, undeterred by the strong opposition from both sides of the Atlantic.But the Greenland of today is different from the Greenland of the 19th or even the mid-20th century. Once a Danish colony, it was formally incorporated into the Kingdom of Denmark in 1953. After a 1979 referendum, it gained autonomy, with foreign affairs and defence under Danish control. Since then, nationalist sentiment has grown, with polls indicating over 80% of Greenlanders in support of full independence. In another survey, 85% of the population opposed becoming a part of the U.S. The American push for Greenland is rooted in geopolitical calculations. As climate change accelerates Arctic ice melt, the region is becoming more accessible for navigation and resource extraction. Only five countries have direct access to the Arctic seabed: Canada, Russia, Norway, Denmark (via Greenland), and the U.S. (via Alaska). Russia already maintains a strong military presence in the region. Washington sees control of Greenland as a way to expand its Arctic claims and access to untapped natural resources. But attempting to seize territory for strategic or economic gain echoes the behaviour of bygone empires. Mr. Trump’s expansionist ambitions risk further undermining the fragile post-war international order, which is grounded in principles of territorial integrity and national sovereignty. The U.S. should respect the will of the people of Greenland. Any change in the island’s status must come through the democratic choices of its residents, and not through external pressure or geopolitical gamesmanship. Published - April 02, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Greenland\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        Denmark\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        climate change\n                    \n                            /                      \n                        \n                        natural resources\n                    \n                            /                      \n                        \n                        democracy",
        "headline_1": "​Leave it alone: on the status of Greenland",
        "headline_2": "Any change in Greenland’s status must come from the choices of its residents",
        "link": "https://www.thehindu.com/opinion/editorial/leave-it-alone-on-the-status-of-greenland/article69400451.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-04-2025"
    },
    {
        "full_article": "Trump’s tariff blitzkrieg could prove to be a boon for the long-exploited Indian consumer\nThe tariff war that Trump has declared against the world has got govts across the globe scrambling to devise strategies to counter the US offensive, ranging from retaliatory taxes on American imports to submissively lowering their own import duties on Uncle Sam’s products.\nNew Delhi seems to favour the latter approach and is inclined to reduce the imposts it levies on US products, from chicken legs and apples to Harley Davidson mobikes.\nAs a result, Trump’s MAGA tariff bombshell could well have an unintended beneficiary, the long-exploited Indian consumer.\nEven as the price of almost all products rises substantially in US, adversely affecting American buyers and customers, Indian consumers might end up paying less for a number of consumables, from Californian almonds to bourbon, the whiskey made in Kentucky, if under White House pressure New Delhi lowers its import duties, which range from 11% to as high as 60%.\nIndia’s high tariffs have long been justified on the grounds of saving foreign exchange and promoting domestic production, both laudable aims. But such protectionist policies have ended up short-changing the Indian consumer by guaranteeing a virtual monopoly to domestic suppliers of everything from consumer durables to comestibles.\nThe enforced absence of competitiveness in price and quality has inevitably resulted in the Indian consumer having to pay more for second-rate products.\nPre-Trump 2.0, US tariffs were among the lowest in the world, at around 2% on manufactured goods, a point that the American president repeatedly thundered in high dudgeon, claiming that this has enriched countries such as India at the expense of America.\nHowever, the low tariffs also benefitted American consumers, making them the most self-indulgent in the world. Now, if US increases its import duties and India lowers its, the tables could be turned at the expense of the US consumer and to the advantage of the Indian consumer.\nTo which a toast might well be raised, in bourbon of course. Cheers, Donaldji.\n\n",
        "headline_1": "Shukriya, Donaldji",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/shukriya-donaldji/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-04-2025"
    },
    {
        "full_article": "Court’s order that a UP local govt should compensate owners of demolished houses is a big warning\nIn its direction to Prayagraj Development Authority to pay 10L each to petitioners whose houses were demolished in 2021, the Supreme Court’s message was clear: no one is above the law. State govts, municipalities should note SC means business. In its order last Nov on guidelines to follow, binding on states, on demolition of unauthorised constructions, SC said violations would lead to contempt proceedings and prosecution of those responsible. Officers would pay “restitution of demolished property at his/their personal cost and pay damages.” It has made an example of the Prayagraj demolition.\nPer the directives, apart from prior notice, two-week response period, and personal hearing, every municipal/local authority should, by now, have a designated online portal of case details: “service/pasting of notice, the reply, the show cause notice and order passed.” Authorities can only demolish those unauthorised constructions that owners haven’t removed within the 15-day period, or if the case hasn’t been stayed by appellate authority/court.\nProblem is ‘bulldozer justice’ is not only carried out to raze allegedly unauthorised construction. Demolishing properties has become pre-trial penalty that authorities mete out to those accused in any crime: from rape to protests or alleged violence. Several petitioners have alleged communal bias. On March 24, the same day that SC had first reacted in the 2021 Prayagraj case as a “shock to our conscience”, a scrap dealer’s shop was illegally razed in Nagpur. Reason? His family had “rooted for Pakistan in a cricket match”. It’s exactly because of this ‘high-handedness’ that SC invoked its powers under Article 142 to issue guidelines last year – so “public officials do not act in a high-handed, arbitrary, discriminatory manner.”\nA point for SC. Its 10L order comes four years after the plea. How long might it take for wheels of justice to turn before resolution in recent cases? Those that came after SC issued its directives. Some state authorities are charging ahead disregarding SC guidelines, a spiral into jungle raj. It is essential to wrap up the early rash of demolition cases since SC’s nationwide stay last Sept. That should slow the bulldozers. \n\n",
        "headline_1": "SC ups the ante",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/sc-ups-the-ante/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-04-2025"
    },
    {
        "full_article": "India can’t shield its farmers with tariffs forever. Farming needs a quantum leap\nTrump will announce his reciprocal tariffs today. Canada, Mexico and China, his biggest trade partners, have retaliatory plans, but India has struck a conciliatory note – slashing tariff on bourbon whiskey, repealing the 6% ‘Google tax’ on online ads, etc. That’s because it netted $45.7bn from trade with US last year, and needs the US market. But Trump wants India-US trade to be a two-way street, which is not possible with India’s high tariffs, especially on farm produce.\nA 2009 report by US International Trade Commission had complained that India bought “less than one-half of 1% of total US agricultural exports” in 2008. The chief hurdle then was India’s high tariffs, going up to 150%. Trump has the same gripe after 15 years. India’s average tariff on agricultural goods is 39% now, but it varies from 45% on vegetable oils to 100% on coffee. Meanwhile, US taxes Indian agri products at just 5.3%, on average. WTO data shows India’s average import duty on dairy products is 68.8%, whereas it’s 16.1% in US. On fruits and vegetables, US charges 5.4%, on average, as against India’s 103.4%. That makes most US farm products too expensive for Indian buyers.\nYet, India cannot afford to grant Trump tariff concessions on farm products. Indian agriculture simply isn’t ready for the shock of cheaper imports. Consider the numbers: some 700mn Indians – twice America’s population – depend on agriculture for livelihood, as against only 2% of Americans. Indian land holdings are tiny and productivity low. And Indian farming households – together accounting for just 15% of GDP – are generally poor, whereas US farming households earn more, on average, than the average US household. So, Indian farmers vs US farm produce is not a fair match.\nWhatever concessions India makes now to dodge Trump’s tariff bullet will buy time, but not make Indian agriculture globally competitive. Even if Trump spares Indian agriculture in his reciprocal tariff announcements today, the question of market access will come up again. The time to prepare Indian agriculture for a day without high tariff walls has arrived.\n\n",
        "headline_1": "Buying time for kisan",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/buying-time-for-kisan/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-04-2025"
    },
    {
        "full_article": "By Arup Mitra\nWhy does Kali look so ferocious? Why she is so different from other goddesses? Why does she reside in the graveyard? The standard explanation adheres to tantrism, which is different from Vedic perception. However, bhaktivadis, followers of the path of pure devotion, may interpret Kali phenomenon from a different angle.\nBestowing all comforts in life, Kali, the mother, takes refuge in a place which is discarded by all. Where unwanted stuff is thrown away or cremated becomes her abode. Here, she remains watchful to secure those who have lost their lives. She is there to rejuvenate life for which she must attain victory over death. She is constantly fighting with death, the ferocious one, and hence, she must appear more ferocious than death. With her victory over death, she leads resurrection, thus symbolising ‘creative destruction’, a term which Vivekananda used in his lectures in US.\nRelatives are fond of a person when he is alive, but his corpse is disposed of at the earliest. The true mother takes remains of the rejected body and adores them by making them a part of her formal manifestation. She conveys that nothing is lost, nothing is a waste; even the cadaver is a part of her appearance. Garland of heads of the dead is placed around her neck and hands are tied together to form the outfit of goddess who wins over death. She would bring back life soon. Earth accepts everything and converts it to soil, making it more fertile, which is why Wordsworth had perceived nature as God.\n\nHere is the true mother who is trying to kill disillusions and unravel the path to eternity. What is disillusion? It is nothing but death. It is the biggest noisemaker, disturbing peace and tranquillity that one can experience. You will find there is only one ocean of eternal light, throbbing with life.\nShe is the embodiment of eternal affection, fondly encompassing every minute detail and offering the ability to understand all that remains mysterious and dark. Within that gloom, all shades of light are embedded. Vitality is rooted in what appears to be dispiritedness. Hence darkness, which otherwise would have been taken as lifelessness, is the symbol of vigour. Indeed, why Kali is conceptualised as dark and dynamic.\nAt the confluence of Vaishnavism and Shakta tradition, Kali appears as Krishn and vice versa. The eternal love flowing like the music from a flute during blossoms with spring all around merges with the essence of vitality hidden in dimness and obscurity, a unique integration of light and shadow.\nSalvation lies in the discovery of the union of entire manifestation, overcoming all differences. Only the outer layer is different; else, one Brahmn pervades the entire universe, as Ramakrishna Paramhans explained. Our narrow thoughts, discriminatory attitude and incomplete understanding beget insurmountable limitedness in our approach to understanding reality. Kali constantly reminds us of this constriction. She stands with what folklore interprets as witches, those rejected by our social system.\n\n",
        "headline_1": "Kali stands with those rejected by social system",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/kali-stands-with-those-rejected-by-social-system/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-04-2025"
    },
    {
        "full_article": "Bangladesh, a nation of remarkable resilience and ambition, faces immense governance challenges due to its extraordinary population density. With over 1,300 people per sq-km as of now (according to World Population Review)—a figure that would soar beyond 2,500 if the uninhabited Sundarbans and hilly regions were excluded—the country ranks among the most densely populated in the world. To put this into perspective, even if the entire global population of 8.2 billion were concentrated within the United States, its density would still be less than 900 people per sq-km—far lower than Bangladesh's adjusted figure.\nIn light of these staggering demographics, the need for a more efficient and decentralised governance model in Bangladesh has never been more pressing. During a recent discussion on this subject, Sakhawat Khan, former country director of Amnesty International South Sudan and a seasoned UN official with 30 years of experience in the Horn of Africa, emphasised the crucial role of a provincial government system in ensuring greater accountability and effective resource distribution in densely population areas. Having overseen one of the world's largest refugee camps in Somalia, Khan strongly supports the idea of provincial governance as a means to improve administrative efficiency and citizen engagement.\nSeveral African nations have demonstrated the benefits of such a system. Ethiopia, for instance, has successfully implemented a federal structure that grants significant autonomy to its regional states, allowing for localised decision-making tailored to diverse ethnic and economic needs. Similarly, Kenya's devolution model, introduced in 2013, has significantly improved service delivery by empowering county governments with financial and legislative authority, reducing corruption, and fostering development in previously marginalised regions.\nDrawing insights from these examples, Bangladesh could greatly benefit from a provincial government system to enhance governance, improve accountability, and ensure balanced development. Currently, the country's administrative and judicial structures remain heavily centralised, creating bottlenecks in service delivery. The concentration of major judicial branches, national administrative offices, and decision-making bodies in Dhaka results in significant inefficiencies. Public services, including the judiciary and police administration, often require citizens from remote areas to travel to the capital, incurring delays and additional expenses.\nWith an estimated population nearing three crore, Dhaka bears the brunt of excessive urban congestion, infrastructural strain, and service backlogs. This over-centralisation has not only impacted governance efficiency but has also stifled regional development. \"Bangladesh needs to recognise that a centralised system is no longer viable for a nation of its size and density. A well-structured provincial system can empower regional administrations to make timely, locally-informed decisions,\" Sakhawat Khan said.\nA comparative analysis with neighbouring countries offers valuable lessons. India's federal structure, with 28 states and eight union territories, has allowed for faster local governance, economic decentralisation, and improved law enforcement through state police forces. Pakistan, too, follows a provincial model with four provinces, which, despite its political and administrative challenges, has enabled regional autonomy. Sri Lanka's Provincial Council system, introduced in 1987, has had mixed results due to ethnic tensions, but has nonetheless improved local governance and service delivery. Even smaller nations like Switzerland and Belgium have implemented decentralised governance models, demonstrating that federalism is not just about geographical size but about administrative efficiency and governance quality.\nIf Bangladesh adopts a similar model with five to seven provinces, it could achieve better administrative efficiency and reduce the burden on the central government. Public services could be brought closer to citizens, ensuring more effective delivery in crucial sectors like healthcare, education, and law enforcement. Establishing regional High Courts would significantly reduce legal backlogs and delays, improving access to justice. Additionally, decentralisation would drive economic growth beyond Dhaka, mitigating regional disparities and fostering nationwide development.\nMoreover, a provincial framework would create multiple centres of power, preventing excessive centralisation and reducing risks of bureaucratic inefficiencies. By distributing political authority across regions, Bangladesh could move towards a more participatory and accountable democracy.\nGiven the country's unique challenges—high population density, administrative overload in Dhaka, and inefficient service delivery—the need for a provincial government system is clear. Learning from its neighbours and other successful models, Bangladesh has an opportunity to build a more effective and inclusive governance structure.\nImplementing a provincial government system would mark a significant step towards ensuring equitable development, strengthening governance, and fostering democratic representation. By embracing decentralisation, Bangladesh can unlock its full potential and pave the way for a more balanced and prosperous future.\nAKM Sayedad Hossain is executive director at the National Institute of Global Studies (NIGS). He can be contacted at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Decentralising Bangladesh is the way to efficient governance, equitable development",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/decentralising-bangladesh-the-way-efficient-governance-equitable-development-3861626",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-04-2025"
    },
    {
        "full_article": "Recent media reports suggest that the Public Administration Reform Commission of Bangladesh has proposed dividing the country into four administrative provinces as a means of decentralisation, aiming to establish a more efficient administrative system. However, it remains unclear whether this proposal also entails replacing the existing unitary parliamentary democracy with a federal system of governance. While federalism may be advantageous for vast nations such as the US, Russia, Indonesia, and India—where diverse social, cultural, and religious groups coexist—it is entirely unnecessary for a small and relatively homogeneous country like Bangladesh. A unitary parliamentary democracy remains the most suitable model for our governance.\nWhat Bangladesh truly requires is an effective and manageable administrative framework rather than an expansion of the flawed system we currently endure. The administrative structure we have inherited, dating back to colonial rule in 1793, is profoundly obsolete and continues to hinder national progress, exacerbating poverty and contributing to social, cultural, and political deterioration. No modern, civilised nation retains such an antiquated system, which bestows excessive power upon administrative officials—such as upazila nirbahi officers (UNOs), deputy commissioners (DCs), and divisional commissioners—who function almost as viceroys. While certain superficial modifications have been made, the core structure remains largely unchanged and retains its colonial character. A comprehensive and fundamental restructuring is long overdue.\n\nIt is imperative that we dismantle this antiquated framework and transfer all administrative authority to the union parishad (UP), thereby eliminating the district and upazila administrative tiers. The UP should be reconstituted as the primary governing authority at the local level. Urban and rural areas alike should be divided into UPs, with all members and the chairperson elected through a party-list proportional representation system (PRS), where feasible. The UP should function as a robust local legislative body, complemented by a fully autonomous administrative unit tasked with implementing and enforcing its decisions. This unit would oversee essential public services, including primary and secondary education, healthcare, infrastructure, law and order, social welfare, and employment opportunities for both men and women. In essence, the UP would bear direct responsibility for the well-being of every citizen. A more in-depth discussion of the advantages of a strengthened UP system warrants further exploration.\nBy abolishing the offices of the DCs and UNOs, we would effectively curtail excessive bureaucratic dominance, ensuring that governance is truly by the people and for the people. Rather than being subjected to distant bureaucratic rule, citizens would be served by locally accountable representatives within the UP.\nDividing Bangladesh into four provinces would necessitate an expansion of the bureaucracy at both the central and provincial levels, inevitably leading to increased administrative expenditures, corruption, nepotism, and favouritism. The long-term financial, social, and moral transformation of Bangladesh—particularly in rural areas—can only be achieved through a robust local government, not through the reinforcement of the colonial administrative \"iron frame.\" Advanced nations owe much of their stability and efficiency to the strength of their local governance structures. The US and UK, despite their imperfections, remain effective democracies largely due to the resilience of their local government systems.\n\nIntroducing a federal structure in Bangladesh would be catastrophic, not only due to the financial burden of sustaining multiple layers of government but also because of the nation's low levels of education and the deeply entrenched culture of political corruption. Such a transition would drive Bangladesh towards fragmentation, particularly given its sensitive geopolitical reality.\nTherefore, Bangladesh requires a strong central government wherein authority is concentrated within a single national framework—eschewing regional governments while ensuring that local UPs are empowered to function under national directives. Laws and governance must remain uniform across the nation and should be executed solely by the local government (UP) through its own independent administrative apparatus. The sooner we abolish the ineffective and corrupt DC and UNO offices, the sooner Bangladesh can progress towards a truly people-centric governance system, underpinned by an efficient and accountable UP administration.\nTayeb Husain is a retired college teacher and business executive based in Sweden.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Should Bangladesh be divided into four provinces?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/should-bangladesh-be-divided-four-provinces-3860651",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-04-2025"
    },
    {
        "full_article": "In the early 2000s, when I was studying at Jahangirnagar University, on many afternoons, I would board the university bus to Dhaka and get off at Shahbagh, heading straight to Amar Ekushey Boi Mela, the largest book fair in the country. But entering the fair wasn't always easy. Sometimes, the queue stretched all the way opposite the Faculty of Fine Arts.\nThe moment I would enter the fair, the scent of new books, the hustle of stall arrangements, and the sheer curiosity in the eyes of the visitors would engulf me. The fair was a grand festival, a place where writers, publishers, and readers were intertwined in an unspoken bond. Some waited eagerly for their favourite author's latest book, while others wandered in search of old classics. The air buzzed with literary discussions—\"How are this year's books?\"; \"Which publisher is leading the sales?\"; or \"Has your favourite writer's new novel been released yet?\"\nThe fair also became a meeting place for familiar faces—be it authors, poets, literary enthusiasts or long-lost friends. As the afternoon faded into evening, the atmosphere grew even more magical. The sky turned crimson, the fairgrounds echoed with footsteps, book launches took place on the main stage, and poetry reading sessions would often unfold nearby. Many strolled around with book-filled bags, savouring the scent of freshly printed pages as they carefully selected their next read. Somewhere in a quiet corner, a reader flipped through pages of poetry, while another stood at a stall scanning the shelves for a cherished writer's new release. Some simply gathered with friends and engaged in deep conversations about literature and life.\nThe fair offered something rare: the chance for writers and readers to connect directly. The authors, whose words captivated readers all year long, were now present in person. Book signings, launch events, and lively discussions created a space for an intimate literary exchange. Writers themselves often admitted that no other event allowed them to experience the love of their readers so closely.\nFor us, the book fair was not just an event; it was a reflection of our love for Bangla language and literature, an emotion, a culture. In the month of February—so deeply tied to our history of linguistic sacrifice—the fair symbolised a deep-rooted connection to our heritage. The entire event carried an essence that made us feel as though we weren't just there to buy books; we were there to embrace our language, to immerse ourselves in literature.\nBack in my university days, I didn't have the money to buy books. I would circle the fairgrounds a few times before heading back to campus. But before leaving, I would always stop by the north gate of Baitul Mukarram, where a vast street-side book market thrived. If one searched diligently, treasures could be found—classic books priced as low as Tk 10.\nYears passed. Eventually, I found myself returning to the fair every year, now with a bag filled with books. I would share my excitement on social media, posting pictures of my new finds. The books I collected in February became my reading material for the rest of the year. No matter where my work took me, I always slipped a book into my bag. I was like an ant gathering food for the year—except I was gathering stories, ideas, and inspiration.\nFor publishers, too, the fair was a beacon of opportunity. It provided a platform for new authors to see their dreams materialise, allowing publishers to gauge the pulse of readers. Many publishers relied on this event to make a profit.\nBut then, this year, I came across a troubling report about the 2025 fair, published by a newspaper called Bonik Barta. It revealed that book sales this year had been the lowest in recent memory. Even major publishing houses suffered a drastic decline. Prothoma Prokashon saw a 60 percent drop in sales. Panjeree Publications, which sold Tk 95 lakh worth of books last year, managed only Tk 65 lakh this year. Adarsha Prokashoni's sales fell from Tk 60 lakh to Tk 30 lakh, while The University Press Limited (UPL) also experienced a steep decline from Tk 60 lakh to Tk 30 lakh. Batighar barely maintained its figures, while Adorn Publications, Genius Publications, Kakoli Prokashoni, Salahuddin Boighar, and others saw their sales cut in half. Even the Bangla Academy, which had sold books worth Tk 1.36 crore last year, recorded a sharp fall to Tk 61 lakh.\nThis decline was shocking, especially since expectations had been high following the fall of a long-oppressive regime in August last year. The assumption was that, with renewed enthusiasm, people would flock to the fair and book sales would surge. But instead, both footfall and sales plummeted.\nWhy did this happen? Some attributed it to a drop in book releases this year. Others pointed to the rise of online book purchases—people now trusted digital platforms, finding them more convenient and reliable. Then, there was the growing issue of book piracy. Illegal websites continued to upload PDFs of new releases, making it easier for readers to access books for free. The dominance of social media and short-form content on platforms like YouTube, Facebook, and Instagram further contributed to declining reading habits. The distractions were endless, and books, it seemed, were losing their place in people's lives.\nBut these weren't new problems. These trends had been building for years. So why did sales nosedive so drastically this year?\nPerhaps the biggest reason was that this year's fair had been reduced to a general marketplace, losing its literary essence. Reports circulated of stalls selling sarees, bangles, cosmetics, and even street food inside the fairgrounds. The fair was transformed into a bazaar rather than a literary sanctuary.\nPolitical controversies further alienated readers. Early in the fair, an image of the ousted prime minister's being used in a dustbin went viral. This incident led many supporters of her political party to boycott the fair. Meanwhile, the fairgrounds saw frequent disruptions by mobs. Banning of certain books and harassment of a publisher sent another chilling message.[4]  Controversies surrounding the Bangla Academy Literary Awards—where recipients were announced and then abruptly removed—added to the chaos.\nEven the vibrant children's section, once a highlight of the fair, felt underwhelming this year. Previously, kids could immerse themselves in colourful books, comics, and stories that nurtured their love for reading. But that presence was noticeably diminished.\nThe Amar Ekushey Boi Mela is deeply rooted in our history, born to commemorate the sacrifices of the 1952 Language Movement. What began in 1972 as a small initiative by the Bangla Academy gradually evolved into a grand literary festival. Over the years, it expanded beyond the academy grounds into the vast open spaces of Suhrawardy Udyan. It became a place where thousands of readers gathered, their hands filled with book lists, their hearts filled with dreams.\nThe book fair is not merely about buying books—it is about ideas, perspectives, and a love for language. And as long as Bangalees exist, this fair must endure.\nBut to ensure its survival, we must keep it above controversy. At a time when books are already struggling for relevance, we cannot afford to let the one event that still inspires readers slip away. If interest in this fair fade, the loss will be irreparable.\nMohammed Norul Alam Raju is a researcher and development activist pursuing higher studies in development policy and management in Belgium. He can be contacted at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Can our month-long book fair survive the test of time?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/can-our-month-long-book-fair-survive-the-test-time-3860386",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-04-2025"
    }
]