[
    {
        "full_article": "India’s September-quarter GDP data for the current financial year beat all estimates, coming in at 8.2%, higher than 7.8% in Q1 FY26 and well above the year-ago period. This offers fleeting reassurance to policymakers, days after October’s trade data revealed a historic deficit of $41.68 billion, driven partly by a trebling of bullion imports — a signal of economic uncertainty. Growth has been led by manufacturing (9.1%) and services (9.2%), supported by a recovery in private consumption. Private Final Consumption Expenditure grew 7.9% in Q2 FY26, compared with 6.4% in Q2 FY25, while government spending also provided a modest boost. Together, these suggest a broad-based uptick in domestic activity despite global headwinds. Yet, the full effects of the external shock may surface in the quarters ahead. The U.S.’s ‘two-stage’ India tariffs, in August, landed mid-quarter. Some front-loading of export orders ahead of these tariffs may also have inflated Q2 output. A second statistical effect is at play. Retail inflation fell to 0.25% in October, the lowest in the current CPI series, contributing to a GDP deflator reportedly below 1%. A deflator this low mechanically inflates real GDP relative to nominal; the narrow gap between nominal GDP (8.7%) and real GDP (8.2%) underscores this. Should inflation rise or input costs firm up — if oil prices climb as India diversifies away from Russian crude — headline GDP growth may moderate. The RBI’s upcoming Monetary Policy Committee meeting adds uncertainty, as any policy rate will shape demand-side pressures.The Gross Value Added breakdown shows construction growing 7.2%, and the services sub-segment of financial, real estate and professional services rising 10.2% — indicating that capital-intensive, infrastructure-linked sectors have been central to this momentum. Monthly industrial indicators reinforce this pattern: the IIP rose 4% in September, with core capital-intensive categories such as steel (14.1%) and cement (5.3%) recording strong gains. This aligns with the impact of the RBI’s three repo-rate cuts this year, which lowered the policy rate to 5.5% in June and may have supported investment activity. Crucially, the composition of growth remains skewed. The quarter’s expansion has been driven by capital-intensive and higher-skill sectors — banking and technology — while high-employment, labour-absorbing sectors continue to lag. IIP data for the past six months also point to weak rural consumption. There is, therefore, reason for cautious optimism. But the September-quarter growth spurt appears concentrated in better-paying formal sectors, even as low-income, export-linked, labour-intensive segments struggle. With September and October trade data already flashing warning signs, it might be too early to conclude that this pace of growth could be sustained. Published - December 02, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        real estate\n                    \n                            /                      \n                        \n                        iron and steel\n                    \n                            /                      \n                        \n                        banking\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        textile and clothing\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        imports\n                    \n                            /                      \n                        \n                        inflation and deflation",
        "headline_1": "Cautious optimism: On India and growth",
        "headline_2": "India’s challenge is to maintain the growth momentum",
        "link": "https://www.thehindu.com/opinion/editorial/cautious-optimism-on-india-and-growth/article70345469.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-12-2025"
    },
    {
        "full_article": "Donald Trump’s remark that Venezuela’s airspace should be considered “closed in its entirety” raised fears that the Republican “peacemaker” President may be preparing to attack the South American nation. Over the past few weeks, the U.S. has intensified pressure on Venezuelan President Nicolás Maduro by conducting strikes in the Caribbean and Pacific waters against alleged drug traffickers and bolstering its troop presence in the region. Washington insists that the operations are part of its ‘war on drugs’, and accuses Mr. Maduro of heading Cartel de los Soles, which the U.S. has designated as a foreign terrorist organisation. The U.S. troop deployment includes two amphibious ready groups with over 4,500 Marines and sailors. The Pentagon has also sent aircraft carrier USS Gerald R. Ford. Puerto Rico, a U.S. territory, is hosting F-35 fighter jets and MQ-9 Reaper drones, just across Venezuela’s coast. In October, the U.S. flew a pair of supersonic B-1 Lancer bombers along the coast of Venezuela. It is now evident what Mr. Trump seeks — a regime change in Caracas. And Venezuela’s right-wing opposition, led by Nobel Peace Laureate María Corina Machado, has wholeheartedly endorsed America’s plans.Mr. Maduro, a self-styled socialist, stands accused of rigging the 2024 presidential election, and Venezuela’s economy has suffered a near-total collapse on his watch, prompting millions to flee. He shares responsibility for Venezuela’s current condition. But the U.S. is not an innocent actor either. Washington’s sanctions have been a major contributor to Venezuela’s economic crisis. In the past, U.S. and several European governments had recognised Juan Guaidó, an opposition figure, as the President in a bid to undermine the Maduro government. Venezuela has long been used as a transit route by drug traffickers from Colombia, the source of most of the world’s cocaine. Yet, the U.S. government has not produced solid evidence to link Mr. Maduro to the cartels or to drug trafficking. The attacks in the Caribbean waters killing civilians constitute a blatant violation of international law. The threats by the Trump administration against Mr. Maduro, irrespective of the character of his regime, amount to an assault on Venezuela’s sovereignty. More importantly, the U.S. seems unwilling to learn from its past mistakes. It invaded Afghanistan in 2001 only to leave 20 years later after cutting a deal with the Taliban. America’s 2003 invasion of Iraq turned out to be one of the worst humanitarian catastrophes. Mr. Trump, who claims credit for ending many wars, must step back from the brink, and seek to resolve differences with Venezuela through dialogue. Published - December 02, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Venezuela\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        narcotics & drug trafficking\n                    \n                            /                      \n                        \n                        armed Forces\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        Europe\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Afghanistan\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        Iraq\n                    \n                            /                      \n                        \n                        Donald Trump",
        "headline_1": "War clouds: On the U.S. and Venezuela",
        "headline_2": "Whatever Maduro’s failings, the U.S. must step back from its plans for Venezuela",
        "link": "https://www.thehindu.com/opinion/editorial/war-clouds-on-the-us-and-venezuela/article70345450.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-12-2025"
    },
    {
        "full_article": "Personality, prosperity, destiny – number plate says it all\nNumbers once lived quiet lives on calculators and report cards. Now, they ride proudly on bonnets and bumpers, announcing identity with more conviction than any business card or biography. Every civilisation eventually finds a new altar at which to worship. Once it was fire, then it was gold, later it became Wi-Fi, and now, in our endlessly inventive India, it is the humble number plate. What was once the ID of the car has now become the identity of the individual. A number now does not merely identify your vehicle. It interprets your personality, your prosperity, and possibly your karmic horoscope.\nLast week, this worship reached its zenith when HR 88 B 8888 sold for a gravity-defying ₹1.17cr. There was a time when a number mattered only in two scenarios: exam results and cricket scores. A ‘lucky number’ meant wearing jersey No. 9 to the cricket stadium or buying a ticket ending in 3. Today, however, the number has ascended to a plane once reserved for gurus, gemstones, and IPO listings.\nWhy this zeal for digits? Because we have always been a nation that believes numbers tell stories of luck, of lineage, of latent potential. The only surprise is that it took us until 2025 to realise that these sacred symbols could also tell the world our net worth.\n8888 is so symmetrical it could calm a raging algorithm. Numerologists insist that 8 radiates power, ambition, and prosperity. Sceptics note it also resembles two neatly stacked laddus. Either way, India is merely joining a global pilgrimage. Dubai auctions plates for sums exceeding ₹120cr. Countries with mature vanity-plate cultures, like UAE and UK, treat plates as collectible assets. But India adds something uniquely its own: numerology, aspiration, sentiment, and a faint hope that symmetry might soften destiny.\nIn the end, perhaps a ₹1.17cr number plate says less about extravagance and more about evolution. The world changes; status symbols shift; aspirations adapt. And as long as humans crave meaning, we will continue to find it in stars, in symbols, and now, in sequences of eights. And in a country where we refuse to start a journey without checking the muhurat, why wouldn’t we want destiny engraved on metal? So, the next time you see a car glide past bearing a number that looks more curated than a museum exhibit, remember: it isn’t showing off. It is simply expressing its numerological truth.\n\n",
        "headline_1": "What is in a number?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/what-is-in-a-number/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-12-2025"
    },
    {
        "full_article": "Elon’s post-work fantasy puts him in the company of Marx. Like him, he won’t see it come true \nIf the world’s richest man is right, your infant child won’t ever need to work. Even better, she won’t pester you for pocket money. School, doctor’s visits, travel, destination wedding, everything will be on the house. He says money will become irrelevant in the not-too-distant future, and “people will have any goods and services they want”. Elon Musk is so sure this will happen that he’s declared it twice in a fortnight – at the US-Saudi Investment Forum on Nov 19, and then in a podcast released on Sunday.\nHow is it possible? Musk is counting on AI and robots to do everything – “in less than 20 years, maybe even 10” – so that humans can vegetate or luxuriate, per their taste. It’s indeed brave of him to say so, considering that money could be going out of fashion just when his $1tn performance-linked package vests. But, in all likelihood, this idea, which stems from the late Iain M Banks’ science fantasy novels, will remain that – a fantasy. \nThat’s because money is an excellent invention. It prevents Musk’s “If you can think of it, you can have it” vision from coming true. Imagine, if wishes became horses, where would we pasture them, and who would sweep the manure? Everyone would want natural diamonds, private jets, seaside villas, and Bond cars, while poor old Bond, who turned 105 last month, grumbles, “the world is not enough” .\nIf money is good, so is work. Philosophically, it’s what gives life purpose. Practically, it’s what brings home money. Personally, it’s vital for human connection. Musk himself used to swear by the 80-100-hour workweek, why is he keen to deprive others of the “pleasure”? Society itself is built around work. Modern education is structured around it. If humans don’t work at all, we’ll all – Musk included – be living in AI’s zoo. AI will plan for us, police us, judge us. But if some humans remain in charge of AI, they’ll be more powerful than the most powerful emperor in history. \nWe don’t want that. Together, work and money are the foundation of a fair society. Yes, the link between them is broken now, but removing them is not the solution. Musk should know that Marx was his fantasy’s grandfather, and Keynes a loving uncle. Not the camp he wants to be seen in. What he wants is to sell lots of Optimus robots – to make up 80% of Tesla’s value – and for that his fantasy is a good sales pitch.\n\n",
        "headline_1": "Karl Musk",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/karl-musk/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-12-2025"
    },
    {
        "full_article": "Telangana forest officials help defend a nest, reminding everyone that birds labour no less than us \nThe owl of Minerva spreads its wings only with the coming of dusk, said Hegel two centuries ago. What did he mean? Perhaps that human understanding comes too late. Consider, for example, how mindlessly we are driving animals to exile, excruciating pain and extinction. Any regrets we have, are already too late for too many species. But others can yet benefit from our compassion and conscience. And every human being can make a difference. As a Rock Eagle Owl family nesting at a stone quarry in Yenakathala village, Telangana, has recently experienced. No sooner had the incubating parent been spotted that images, location details, and a proper chain of actions got underway. Quarrying has been halted. State forest officials say it will only resume after the owlets are hatched, grow and move away from the area.\nBesides empathy, the rescue was enabled by knowledge. The raptors wouldn’t live in a relocated nest. As easy are owls to recognise, they are much harder to see, and their behaviours even harder to learn. Their camouflage takes a lot of diligence to crack. It takes stillness, the ability to just sit, look, and listen. Those who have done so have described the complex owl processes of selecting mate and nest, and raising owlets, which ornithologist Jennifer Ackerman documents in What an Owl Knows. Manmade nest boxes, she underlines, are no substitute for the dynamic environment offered by a tree hollow, or other natural cavities. \nLoss of their native habitats remains the single greatest threat to owl populations. Yes, they are adapting to us and to urbanisation. But if the world humans have made is seeing their own birth rates decline, its impact on animal breeding patterns is far more acute. Owls lose up to a third of their body weight to nest their family. Let’s not act like their labour is less than ours. \n\n",
        "headline_1": "Saving An Owl Family",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/saving-an-owl-family/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-12-2025"
    },
    {
        "full_article": "Winter session is set to be fiery – a new VP as Rajya Sabha chair, decision on impeachment of two HC judges pending, at least 10 bills and electoral rolls to debate. But will Parliament function? That’s the real question\nThe winter session of Parliament begins today with more than 700 MPs expected to be in Delhi for three weeks. As govt seeks Parliament’s approval for additional funds and critical legislation, Opposition parties have sought a debate on SIR, EC’s project to make new electoral rolls that is underway in several states. Opposition will also be pushing for debate on unemployment and flood relief measures. Parliamentary affairs minister Kiren Rijiju has said Vande Mataram should be discussed.\nRead full story on TOI+\n\n",
        "headline_1": "Policy, Politics…Paralysis?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/policy-politicsparalysis/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-12-2025"
    },
    {
        "full_article": "There is rarely a convenient time for a strike, but the timing of the latest strike by secondary school teachers comes across as particularly surprising. As the annual school examination season begins—a period of high anxiety for students and parents alike—a set of educators have abandoned their duty in an attempt to force the government to meet their demands. We find this move totally irresponsible.\nThe timing could not be worse. According to the government's schedule, annual exams were set to run from November to December, followed swiftly by selection tests and junior scholarship exams wrapping up on New Year's Eve. This is the crunch time of the academic calendar. Yet, instead of quiet concentration in exam halls, students are having to face administrative anarchy.\nThe Directorate of Secondary and Higher Education attempted to regain control with stiff directives, warning that any \"negligence\" in conducting the exams would trigger punitive action. But teachers, organised under various associations, have chosen to ignore these orders. The result is chaos across the country: while some schools held exams, many institutions have suspended tests, according to our reporters. As the coordinator of the movement has said, the boycott is well underway, rendering the government's late-night circulars largely ineffective.\nThe teachers' grievances are numerous and significant, and we urge the government to review and address them properly. Their demands include the upgrading of entry-level assistant teacher posts, the creation of a separate Directorate of Secondary Education, and the reinstatement of benefits withdrawn as far back as 2015. It is possible that these demands have merit. But to hold the future of children hostage in their push for pay and perks is a totally unethical tactic.\nEducation is not a factory line where work abstention merely delays a shipment; it is a time-sensitive endeavour in which disruption can derail academic progression and inflict psychological stress on students. The teachers' coordinator has argued that the government's circulars are an attempt to suppress their movement. He may be right about the government's steps, but he is wrong to assume that this gives his colleagues the moral licence to jeopardise the academic year.\nThe teachers must respect their primary responsibility to students. They claim they will only return if the education ministry sits down with protest leaders. This is the language of blackmail, plain and simple. The teachers may believe they are teaching the government a lesson in power dynamics. In reality, they are sending the wrong message. They should return to classrooms and exam halls immediately for the sake of the students. The government, meanwhile, must expedite efforts to resolve the issues at the root of this crisis.\n",
        "headline_1": "Teachers must not hurt students’ future",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/teachers-must-not-hurt-students-future-4048101",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-12-2025"
    },
    {
        "full_article": "That our school education is in disarray is not news. It has been in public discussion, though it captures the media's attention whenever a new instance of its dysfunction is revealed. However, a way to address the problems and move towards better outcomes remains elusive.\nThe most recent Multiple Indicators Cluster Survey (MICS) by the Bangladesh Bureau of Statistics, with Unicef's support, has drawn public attention again to the woes of the secondary education system. According to MICS, only 44 percent of the secondary school-age children complete secondary education up to class ten. In other words, more than half of our young people do not have a secondary education, though 84 percent of children complete primary education. The report also shows income-based, gender-based and geographical disparities.\nThe statistics in the survey only mention children's participation in school, not what they learn or whether they acquire the knowledge and competence expected at primary and secondary level education.\nThat the majority of our young people are not earning a secondary education qualification and a large gap exists in children's education opportunities between primary and secondary stages, is shocking. However, it does not surprise education decision-makers and citizens, who are concerned about our children's education. If one were to probe a little into how the public school system runs—the policies and plans, financial investments and management, teachers' skills and professionalism, and the accountability of the actors—one might wonder whether the schools are actually designed to fail rather than run to achieve results.\nLet's look at a few facts that are already known but usually considered in isolation. When put together and holistically viewed, a damning pattern of a large mismatch is revealed between the stated goals and objectives of the school system and the ways, means and resources provided to achieve the outcomes.\nThe international goal for developing countries, according to the Sustainable Development Goals for education (SDG4), is to ensure equitable, inclusive and quality education up to secondary level for all children by 2030. Bangladesh has pledged its support to this goal, but has no plan or programme with a time frame and strategy prepared for this purpose. Nevertheless, the primary level, despite its many shortcomings, has a compulsory education law and an implementation plan. This situation explains the major gap in student participation between primary and secondary education.\nThe absence of a public obligation to provide quality secondary education to children has led to haphazard and incoherent policies and management of secondary education. At the primary level, 98 percent of children enrol in school and the government is committed to providing a government school in every community. The secondary gross enrolment rate is about 70 percent, of whom over one-third drop out before completing SSC (adding up to over half of the young people not having secondary education as reported in the survey). Of about 20,000 secondary schools and institutions, only 628 are fully supported by the government; 97 percent of secondary schools receive government support through a subvention for the basic salary of a set number of teachers. This is widely considered to be inadequate both in terms of the financial resources available to schools and the number and quality of teachers they require. There are chronic shortages of qualified subject teachers for English, math, science, computer science and even Bangla.\nBesides, there are disparities and discrimination in the distribution of schools and provisions for support between urban and rural areas. Remote areas, such as coastal and hill locations, haors and chars, are particularly at a disadvantage in receiving government support and attracting teaching personnel.\nSchools cannot perform without a sufficient number of teachers with the necessary professional skills. The \"staffing plan\" applied for government salary subvention (known as MPO) to schools is mostly inadequate for the number of students and subjects. Even then, there are very often significant vacancies in teaching positions. Even government schools have 20 percent vacancies. The government staffing plan provides for 53 teaching positions in a collegiate school in the capital with 2000 students, but only 39 teachers were working at the school in September this year.\nSchool management suffers due to the absence of a headmaster or an assistant headmaster's leadership. The Bangladesh Bureau of Educational Information and Statistics (BANBEIS) reported that in 2023, out of 628 government secondary schools, only 352 had a headmaster (schools recently brought under government have no formal headmaster's position yet). A large number of headmaster positions remain vacant. Bureaucratic inertia and a weak sense of responsibility are evident in this and other instances.\nBesides, teachers do not have a career path; most start as assistant teachers and retire from the same position. A senior teacher category was created in 2018, but few were promoted to that post, and it has stopped entirely since 2021. This is hardly a formula for attracting talented people to teaching and encouraging them to perform.\nThe Education Watch 2023 report indicates that three-fourths of the students, both in cities and villages, go to private tutors and coaching centres and 93 percent rely on commercial guidebooks to prepare for their exams. This shows students cannot depend on classroom teaching, but more importantly, it adds hugely to the family's expenses. School education has been turned into a commodity; only those who can pay can claim it.\nThe rough picture presented here indicates how the basic conditions necessary for a school to perform are lacking. We have not even mentioned other concerns, such as the design and plan of the curriculum and the learning content, and the need to translate the curriculum into classroom learning activities. We have also not discussed the objectives of education: defining the subjective and objective aims and skills and competencies that learners must acquire and how these are measured and assessed. Furthermore, there are infrastructure and physical learning environment problems. All these add to the layers of complexity and problems that the education system has to address.\nThis disarray has not arisen suddenly. It has been in the making for a long time, primarily from neglect by the country's political system and power structure. The interim government also appears to have shied away from embarking on an education reform initiative, which it tried to take in several other areas. Belatedly, the Ministry of Education has appointed a 10-member consultative committee (headed by this writer), giving it the task to \"examine prevailing teaching-learning, training and capacity-building, research and management structure in secondary education; consult with various stakeholders; and present necessary recommendations for improving the quality and standard of teaching-learning and management in secondary education.\" A time frame of three months has been set for this task.\nA similar consultative committee was formed last November by the Ministry of Primary and Mass Education. Its 200-page report with 100-plus recommendations under eight main categories was submitted to the government in February this year.\nThe Secondary Education Consultative Committee has begun its work in earnest. It expects to undertake the analysis and stakeholder consultation and prepare its recommendations within the given time frame. The committee is working on the premise that its recommendations will help set the agenda for action for the elected government that will emerge following the upcoming referendum and parliamentary election. It also hopes that the legacy of past governments' neglect will not continue.\nDr Manzoor Ahmed is professor emeritus at BRAC University, chair of Bangladesh ECD Network (BEN), and adviser to the Campaign for Popular Education (CAMPE). Views expressed in this article are the author's own.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Are our schools inherently designed to fail?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/are-our-schools-inherently-designed-fail-4047566",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-12-2025"
    },
    {
        "full_article": "The devastating consequences of salinity on the lives and livelihoods of people in the coastal areas are well known. A recent investigation by The Daily Star has revealed an equally alarming and often-overlooked dimension of this crisis: its brutal toll on women's health. Across Khulna and Satkhira, women are suffering from severe reproductive and skin-related conditions that are altering the course of their lives, ushering in early menopause, forcing hysterectomies, and increasing the risk of cancer. Many endure chronic infections in silence, often left untreated for years due to stigma, poor access to healthcare services, or geographical inaccessibility.\nWomen engaged in shrimp farming spend hours standing waist-deep in saline water to catch shrimp fry to support their families. They drink salty water, wash and bathe with it, and work in it daily. The results are chronic skin diseases, urinary tract infections, and serious reproductive health complications. This is also supported by recent data. According to a 2024 Journal of Migration and Health study, 64.8 percent of women in Mongla and 53.8 percent in Shyamnagar, Satkhira, reported inflammation or infections of the vagina, uterus, fallopian tubes or ovaries. Nearly one-third struggle to maintain menstrual hygiene. Severe skin problems affect 92 percent of women in Shyamnagar and nearly 70 percent in Mongla.\nAn icddr,b analysis covering 2012-2017 further showed that women living near the coastline face a 1.3 times higher risk of miscarriage than those in higher-elevation areas. Hypertension, exacerbated by salinity, is quite common, increasing the likelihood of pre-eclampsia in pregnant women. Despite these problems, however, successive governments have ignored the crisis of salinity in coastal areas. Unregulated shrimp farming has contaminated soil and water, devastated agricultural land, and made safe drinking water increasingly scarce. The health fallout—especially for women and girls—has now become impossible to overlook.\nWe urge the authorities to treat this as a public health emergency. While long-term policy reforms, including strict regulation of shrimp farming, are essential, immediate interventions cannot wait. Access to safe drinking water and sanitation must be ensured through investments in rainwater harvesting, desalination technologies, and other measures, prioritising the most affected areas. Health services must also be expanded in remote areas by establishing mobile clinics, deploying more female health workers, and subsidising diagnostic and reproductive health services. Large-scale awareness must be launched on the risks of prolonged saline exposure, the importance of hygiene, and the need to seek timely medical attention. It is equally important that, besides government authorities, political parties too help in addressing salinity as both a development and public health priority in these regions.\n",
        "headline_1": "Salinity’s vicious toll on women’s health",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/salinitys-vicious-toll-womens-health-4047341",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 02, 2025 00:00:00  \nEnergy consumption has historically been a vital indicator of robust economic activities and improved living standards. But when this input turns irregular and insufficient, driving up its costs to an outrageous level, the manufacturing sector can hardly be sustainable. Bangladesh, according to seasoned business leaders and expert economists, is right now in such a crisis. Industries built a few decades ago were told by political leaders leading the country that the country was floating on natural gas, a comparatively cheap source of energy. But now the projection is that by 2030, the country will exhaust its gas reserves completely. At a parley titled, \"Bangladesh Industrial Energy Efficiency Policy: A Draft for Sustainable Progress\" participated by business leaders and economists, speakers made it amply clear that outrageous pricing of gas has compelled some industries to slash production and a few others turned completely non-viable. Production in the country's major sectors including textiles, steel and fertilisers has declined by 30-50 per cent. \nThis is depressing news. Gas price hiked, as claimed by the DCCI president, by 178 per cent in January 2023 has recently been subjected to yet another price escalation by 33 per cent. Intriguingly, small, cottage and some other industries in the SME sector saw the highest ever increase in gas price, with the prices surging to Tk 30 a cubic meter from Tk 10.78. Naturally, production in several industrial units has either stagnated or was forced to suspend. Once moribund, the textile industry here got a new lease of life on account of the flourishing readymade garment (RMG) industry. In fact, it turned out to be a backward linkage industry to the latter. There are several manufacturing units, other than textile, that need natural gas for operation and started thriving, courtesy of the RMG. Now if the vital input, gas that is, is in short supply, there is a negative chain reaction in the industrial sector.\nThe withdrawal of subsidy has made gas costly. But now the country's overwhelming dependence on imported liquefied natural gas is also a vulnerable factor for industrial slump. At a time when the international fossil fuels' market is down by 15 per cent, the domestic prices in Bangladesh have no reflection of this price fall. Crude oil spot price drops by 15 per cent globally and the projection is that gas price too could fall by 15 per cent over the next five years. This is likely to go in Bangladesh's favour but the problem here is that prices here hardly match the global level, particularly when the market value is down. \nThe Bretton Woods institutions' recipe for subsidy withdrawal in underdeveloped countries is not always suitable. Bangladesh has to swallow the bitter pills because it had hardly any better option when it was desperately running short of funds. The country's industrial base is not large enough and therefore cannot defy the recipes suggested by the International Monetary Fund (IMF) and the World Bank (WB). Where the country grossly failed is the exploration of natural gas---either onshore or offshore. It should have developed the Bangladesh Petroleum Exploration and Production Company Ltd (BAPEX) as a highly efficient entity to explore at least its onshore gas reserves, if not the offshore ones. The energy crunch now threatening to deal a grievous blow to its industries could be avoided.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Correlation between energy crunch and industrial production",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/correlation-between-energy-crunch-and-industrial-production-1764601535",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       December 02, 2025 00:00:00  \nIn Bangladesh today, the central question facing the economy is not simply how to stabilise financial institutions or stimulate investment. It is whether the political leadership possesses the will to confront decades of entrenched corruption, rebuild trust in public institutions, and restore confidence among ordinary citizens and entrepreneurs alike. Without decisive political action, no economic reform will deliver the transformation the country urgently needs.\nFor nearly a generation, Bangladesh's economy evolved under a model that fused political power with business interests in increasingly unhealthy ways. Elections were commercialised; politics served the narrow interests of a privileged few; and the private sector was often incentivised not by innovation or productivity but by proximity to the ruling elite. The result, unsurprisingly, was a system in which the state ensured profits for its loyalists while ordinary taxpayers carried the burden of debt, inflation and collapsing services.\nThe consequences of this model are now brutally visible in the banking sector. More than one-third of all loans are classified as non-performing -- a figure that would be considered catastrophic anywhere else in the world. Two years ago, government officials insisted the share was only 8 per cent, even as independent estimates placed it closer to 25 per cent. Today, with clearer data and fewer political incentives to obscure reality, the true figure has surpassed 35 per cent. This is not simply a financial statistic. It reflects a decade and a half of patronage-based lending, regulatory capture, and the near-total absence of institutional accountability.\nWhen a banking sector becomes dysfunctional, the consequences ripple far beyond the vaults of commercial banks. Businesses lose confidence. International investors retreat. Domestic capital sits idle because entrepreneurs fear regulatory harassment on one side and systemic instability on the other. An economy cannot function when trust evaporates -- and in Bangladesh, trust has been eroding for years.\nThe present government's approach -- what some critics describe as a \"catch the thieves\" model -- acknowledges the gravity of the crisis but risks creating a new climate of fear in the business community. Accountability is essential; impunity must end; but without a coherent political and economic strategy, punitive actions alone can deepen uncertainty. Entrepreneurs must know that justice is being sought in the national interest, not as part of a new political vendetta. People need to see a credible roadmap, not just a list of culprits.\nTo fix the system, Bangladesh must begin by confronting an uncomfortable truth: the country's financial collapse did not occur because businesspeople were inherently corrupt, but because politics created a system in which corruption was rewarded and accountability was punished. The political sphere, not the marketplace, is the true battleground. The next financial model must therefore emerge from political reform, not only economic tinkering.\nThis requires two forms of political will. First, the courage to prosecute those who plundered public wealth -- no matter how powerful they once were. For fifteen and a half years, a small circle of well-connected individuals enriched themselves through bank fraud, capital flight, and systematic extraction from public resources. Some of these individuals owned large industrial units employing thousands of workers. Their collapse has already left an estimated 1.4 million people jobless. Justice must be done, but justice must be accompanied by a plan for the workers who now find themselves unprotected and abandoned.\nSecond, political leaders must be prepared to democratise the economy -- a task far more complex than prosecuting yesterday's oligarchs. Democratising the economy means ensuring that growth benefits reach ordinary citizens rather than remaining concentrated in the hands of a small clique. It means prioritising public transport, youth employment, and entrepreneurship instead of politically linked mega-projects that often create more debt than opportunity. It means building institutions that enforce contracts, regulate competition and protect workers' rights.\nBangladesh will not regain the trust of expatriates, investors or its own citizens unless it builds a system grounded in fairness. The money siphoned out of the country must be brought home, but recovering stolen assets is only part of the story. The deeper task is to ensure such theft is never again possible. That demands an independent financial regulator, transparent procurement systems, credible audits, and a judiciary insulated from political influence.\nBut none of these reforms can succeed without political consensus. Elections in Bangladesh, long treated as business ventures, must be returned to their rightful place as the foundation of democratic legitimacy. An opaque electoral system cannot deliver transparent economic governance. A political arena riddled with criminalisation cannot produce credible economic reformers. Cleaning up the political process is therefore not a luxury -- it is a prerequisite for economic recovery.\nThe July uprising, with its youthful energy and demand for fairness, showed that the country's people are no longer willing to accept an economy designed to serve a privileged minority. Their discontent was not only political; it was economically rooted. Young people want jobs, not patronage. Workers want security, not sudden factory closures. Entrepreneurs want predictable rules, not political favouritism. These aspirations form the bedrock of any future political settlement.\nThe next government -- whatever its composition -- will inherit a fragile economy and an impatient population. Its greatest challenge will not be attracting foreign investment or negotiating new loans. Its real test will be whether it can convince the country that political leaders are prepared to place public interest above private gain. Confidence is not built by slogans or policy papers. It is built by visible, consistent, politically costly decisions that demonstrate a commitment to fairness.\nBangladesh stands at a critical juncture. The old economic order has collapsed under its own corruption. A new one is waiting to be built -- but it will not emerge without political courage. As the financial sector teeters, businesses hesitate, and young people search for opportunities abroad, one truth becomes increasingly clear:\nRestoring confidence in Bangladesh's economy is not an economic challenge alone. It is a political one -- and only political will can solve it.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Political will a must to restore confidence in businesses",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/political-will-a-must-to-restore-confidence-in-businesses-1764601569",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       December 02, 2025 00:00:00  \nBrazil is learnt to have launched a single-dose anti-dengue vaccine last Wednesday (November 30) after obtaining its registration approval by the county's drug regulator, Anvisa. Developed by Butantan Institute in Sao Paulo, the vaccine called, Butantan-DV, is claimed to be the world's first single-dose anti-dengue vaccine. Brazil's Minister of Health, Alexandre Padilha, announced the launching of the vaccine. Now, if Dengvaxia, developed by the French pharmaceutical company Sanofi, or more specifically its vaccine division, Sanofi Pasteur, is considered to be the world's first anti-dengue vaccine approved in 2015, then \nButantan-DV becomes the world's third anti-dengue vaccine after Japan's TAK003 vaccine, also called QDENGA, developed by the Takeda Pharmaceutical Company, occupying the second place. But if single-dose vaccine is the criterion, then Brazil's Butantan-DV becomes the world's first single-dose anti-dengue vaccine. \nThe vaccine, according to reports, was developed through a partnership between the Brazil's ministry of health and the Chinese company, Wuxi Vaccines. \nThough the French Dengvaxia was the first anti-dengue vaccine, it is not at present recommended for general application as there are safety concerns. Also, its usage is limited. For instance, if a person had no previous history of dengue infection, then application of Dengvaxia might lead to severe dengue infection, even hospitalization. So, WHO, European Medicine Management (EMA) and the US Food and Drug Administration (FDA) restricted the vaccine's use only to those individuals who had a prior history of dengue infection and were natives of regions where dengue is endemic. Against this backdrop, Sanofi Pasteur stopped producing Dengvaxia from January 2024 on the ground that there was no global demand for the vaccine. However, Japan's QDENGA (TAK003), came forward to meet the global demand as it could be applied regardless of a person's previous exposure to dengue. Some countries including those in Europe gave TAK003 broad approval for use. However, TAK003 is a two-dose vaccine meaning that after administering its first dose, a second dose has to be applied after three months. \nHowever, now that Brazil has come up with its Butantan-DV as a vaccine that does not require any second dose as a preventive against all the four serotypes of dengue, then it is going to be a tough competitor of TAK003 or QDENGA.\nNotably, dengue is caused by four different virus serotypes: DENV-1, DENV-2, DENV-3, and DENV-4. Serotypes are the different strains of dengue virus. One million units of the Butantan-DV vaccine are reported to be made available for free through the Brazilian public health network, SUS. It will be ready for distribution in 2026. The vaccine's developer Butantan Institute estimated that more than 30 million doses of the vaccine could be produced by mid-2026. Since dengue has been rapidly expanding globally, particularly among the tropical countries, the Brazilian anti-dengue vaccine may well be made available for people living in other parts of the world that are endemic to the disease. The wide application of the anti-dengue vaccine cannot be overemphasized seeing that the disease is spreading fast through its vector mosquito, Aedes aegypti, thanks to the rise in temperature and shifting pattern of rainfall as a fallout from the climate change. \nAdmittedly, dengue fever has meanwhile emerged as a major public health concern in Bangladesh with a surge in the number of cases as well as fatalities in recent years. According to the Directorate General of Health Services (DGHS), till Sunday (November 30) last, the total number of dengue-related deaths in Bangladesh rose to 382 and the number of cases has climbed to 94,402. To all appearances, the government is fighting a losing battle against dengue. So, it is high time it considered introducing the anti-dengue vaccine as a preventive against the disease which is taking its toll unchallenged every year.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Single-dose vaccine against dengue",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/single-dose-vaccine-against-dengue-1764601597",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 02, 2025 00:00:00  \n\nIn Bangladesh when new products enter the market, it becomes saturated faster than the cyclone. Everyone tries to duplicate it, especially small businesses. When anyone sees a successful small business with a small investment, they want to follow or copy that, so the market becomes so saturated that its price drops. Recently home-baked cake was so famous and viral in the market that everyone came in the road with their home-baked cake, whether the quality was good or not. Like this, there are lots of other example. Waffle culture was first introduced in the Bangladesh market by Waffle Up, and recently this was copied by many other brands like Waffle Time, Waffle Bae, etc. Many people are more towards copying rather than innovating something new, because of which many small businesses are becoming unsuccessful.\nIn Bangladesh, there are no shortage of opportunities and scope, but people are less interested in taking risks and starting something new. So, they try to start a business with a type of product that is profitable and already existing in the market. But they don't understand that it is not just harming the competitor but also increasing the chance of failure of their own business.\nThe government should introduce appropriate restrictions and policies for small businesses so that the market does not become saturated. It should also encourage people to develop innovative ideas and bring new products or services in the market. Providing funding opportunities for small businesses and entrepreneurs would further motivate them and boost their confidence to take risk and start ventures that offer something genuinely new.\nSumiya Akhter Anima\nBachelor of Business Administration \nNorth South University\nSumiya.anim@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Copying and market saturation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/copying-and-market-saturation-1764601620",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-12-2025"
    }
]