[
    {
        "full_article": "The order of the Ministry of Information and Broadcasting, directing the removal of a cartoon featuring the Prime Minister, Narendra Modi, from a Tamil magazine’s website, is unwarranted and may not fall under any of the permissible grounds for such removal. Vikatan Plus, an online-only magazine published by the Vikatan group, has decided to take legal steps to challenge the order. It had earlier defended the content at a hearing before an inter-departmental committee constituted under the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021. The Ministry’s move against the cartoon goes against both freedom of expression and freedom of the press. The cartoon is a piece of trenchant political commentary, as it depicted Mr. Modi shackled in chains in the presence of United States President Donald Trump. This is an apparent reference to criticism voiced in some quarters that Mr. Modi failed to protest against the ill-treatment of Indian illegal immigrants deported from the U.S. The Prime Minister’s approach to a foreign policy issue cannot be immune to symbolic denunciation through a cartoon. It is even more concerning that the Vikatan website itself has been rendered inaccessible to some users, apparently based on undisclosed orders or informal instructions to web service providers.While a formal order to take down content is provided for in law, it will be wholly untenable if the website was sought to be blocked without recourse to established procedure. The claim that the website has been inaccessible to some since February 15 has not been denied so far. Section 69A of the Information Technology Act empowers the government to block content on specified grounds, including in the interest of “friendly relations with foreign States or public order or for preventing incitement to the commission of a cognisable offence”, but it is not known which of these grounds has been invoked, as the order is confidential. How an order passed in the exercise of a statutory power can be deemed a secret is inexplicable. Even in times like the present when taking offence is a national pastime as well as a reason for several Chief Ministers to unleash the police on their detractors, cartoons ought to enjoy greater immunity than the written word. In this case, it is doubtful if political criticism through a cartoon can be deemed to affect friendly ties with the U.S. or undermine public order. The Centre would do well to reverse the blocking order soon. The power to block content ought to be used sparingly, mainly to combat offensive content such as hate speech, incitement to violence and child pornography, but not in deference to a political demand and without regard to freedom of expression. Published - March 03, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        cartoons and animation\n                    \n                            /                      \n                        \n                        media\n                    \n                            /                      \n                        \n                        newspaper and magazine\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        freedom of the press\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        illegal immigrants\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Tamil",
        "headline_1": "Toon trouble: on Vikatan cartoon, I&B Ministry’s move",
        "headline_2": "The power to block content must be used sparingly",
        "link": "https://www.thehindu.com/opinion/editorial/toon-trouble-on-vikatan-cartoon-ib-ministrys-move/article69281547.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "03-03-2025"
    },
    {
        "full_article": "If institutions are serious about rooting out sexism, they must walk the talk. Instead of merely celebrating the entry of more women in the workforce, they have to provide an enabling atmosphere for those on the rolls. In a judgment last week, the Supreme Court of India showed its intent by declaring that with more and more women joining judicial service, it was time for the judiciary to be more cognisant of their well-being at the workplace. Reinstating two women judicial officers of Madhya Pradesh who had been sacked for “inefficiency”, despite the fact that one of them had suffered a miscarriage, Justice B.V. Nagarathna said it was not enough to “find comfort solely in the growing number of female judicial officers if we are unable to secure for them a sensitive work environment.” The judgment set aside the ouster of two civil judges, Sarita Choudhary and Aditi Kumar Sharma, terming the termination orders “punitive, arbitrary and illegal”. That Justice Nagarathna, one of two women judges in the Court, which has a sanctioned strength of 34, had to step in, is an indication of the long and difficult fight for gender equality, and the need for change in mindsets and reform. In several past verdicts too, the Court had drawn attention to gender stereotyping and discrimination against women.In her judgment, Justice Nagarathna underscored the importance of having more women in the judiciary, and this holds true of other branches of the government such as the legislature and the executive. Greater representation of women will ensure better understanding of their needs and lead to better policies. The freedom from discrimination or equal protection of the laws during pregnancy and maternity are precious rights for the women workforce, she noted. Just as motherhood brings joy, a miscarriage has a deep psychological, physical and mental impact on women, and the onus is on policymakers to be aware of this and act accordingly. While gender cannot be an excuse for poor performance, it is incredible that the Court had to intervene to call out a wrong on a basic issue such as maternal rights. In doing so, the Court has also, yet again, reminded not only those in power but also the larger society, that age-old, entrenched patriarchal systems have no place in a country aspiring to emerge as a developed economy. If women are not provided a larger role in decision-making, their concerns will remain invisible to policy. To achieve that goal, education has to be accessible to girls in a non-discriminatory manner. At work, they must be assured of a safe and healthy environment as a basic right and guarantee.\r Published - March 03, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        Madhya Pradesh\n                    \n                            /                      \n                        \n                        judge\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        executive (government)\n                    \n                            /                      \n                        \n                        human rights\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        education",
        "headline_1": "​Long roots: on India and patriarchal biases",
        "headline_2": "Entrenched patriarchal biases must be erased from society, government",
        "link": "https://www.thehindu.com/opinion/editorial/long-roots-on-india-and-patriarchal-biases/article69281552.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "03-03-2025"
    },
    {
        "full_article": "Trump’s attitude to Ukrainian sovereignty holds a worrying message for India, given its neighbourhood\nTrump’s brutish treatment of the idea of Ukrainian sovereignty – televised across the world as he and his deputy harangued Zelenskyy – has larger implications. India especially should take note. Trump seems agreeable to Putin’s doctrine of  limited sovereignty for countries that were part of USSR. But what’s okay for Putin can’t be the rule democracies conduct themselves by. Therefore, when Trump’s America, the world’s most powerful democracy, coddles border-breaching aggression, the dangerous message is that there may be no adverse fallout of one nation simply rolling into its neighbour’s territory. India has had to tackle expansionist strategies of its eastern neighbour, and respond to state-sponsored terrorism on its western border. So, a Trumpian worldview is not one it can get comfortable with. \nConsequences of aggressive leaders breaching territorial sovereignty of other nations are multifold – the highest cost is borne by people. History shows a ceasefire isn’t peace. And peace between warring nations cannot be brokered when a victim state’s assertion to its independence and borders is pooh-poohed. Brokering then is just tyranny, not a negotiation. Its heft allows Washington to arrogate to itself the right to intervene – it wields the power to change the course of events. But as history reminds us periodically, stability in any region and at any border lies in knowing when to stop. It is in such restraint that peace can survive. Given this, being offhand about nations being invaded, being partitioned, allowing their right to sovereignty to be eroded, is akin to supporting the law of the jungle – might is right. Europe’s eastern border has always been a shifting entity; in the 21st century it is a clutch of states that bank on restraint of the big powers to maintain independence, autonomy and stability.\nTrump’s now-sort-of-withdrawn Gaza Plan was an affront – peace-making subordinated to real estate deal-broking. It’s still early days for his play in Ukraine, although the prognosis looks bad. If his administration remains cavalier about breach of national sovereignty, New Delhi must remain alive to the fallout of what Trump is doing and what he’s likely to do.\n\n",
        "headline_1": "Beyond Kyiv",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/beyond-kyiv/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-03-2025"
    },
    {
        "full_article": "Sebi brass, including ex-chief Buch, face corruption charge. Probe fast for investor confidence\nMadhabi Puri Buch’s three-year term as Sebi chief ended last Friday, but she’s yet to wash her hands of it. Although she dodged conflict-of-interest charges and a call from Parliament’s public accounts committee while in office, a special anti-corruption court has now ordered registration of a complaint against her and other Sebi officials in connection with a company’s listing. This company was allegedly allowed to list without fulfilling regulatory conditions, resulting in losses for investors. The court has said that, at first glance, it looks like a case of “regulatory lapses and collusion”.\nCharges of collusion and corruption are difficult to prove against chiefs of regulatory bodies. Another former Sebi chief, CB Bhave, was accused of allowing MCX-SX to function as a full-fledged private stock exchange, but the case was closed after a few years. Last year, Sebi dropped charges in the NSE co-location case, citing lack of evidence – which can also mean nobody looked hard enough. The charge was that some traders were allowed to set up their servers near NSE servers for a speed advantage – they could execute trades faster than rivals. A former NSE chief, who was allegedly receiving orders from a mystic in the Himalayas, was exonerated.\nSince 1988, when it was set up, Sebi has weathered many high-profile scandals. Although some, like the Satyam case, involved collusion by auditors, the fact remains that Sebi failed to protect investors. The Harshad Mehta scam of 1992, when  Sensex jumped four-fold in a year, shook investor confidence for a long time. There was the Ketan Parekh scam, and the IL&FS collapse. In the Sahara case, Sebi ordered refund of ₹25,000cr to investors, but 13 years on, not even 10% has been returned.\nIndia’s stock markets aren’t new but the middle-class’s strong participation in them is just a decade old. Month after month, even when portfolio investors have pulled funds, the middle class has kept its faith in SIPs. Yet, the over 10,000-point fall in Sensex since last Oct shows how fragile the market is even now. A swift probe is necessary to maintain investor confidence. \n\n",
        "headline_1": "Taking stock, fast",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/taking-stock-fast/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-03-2025"
    },
    {
        "full_article": "If every trick in the book is recommended but the most obvious, then it’s clearly from a govt manual. To get our economy to top speed, we have gone from encouraging vocational training, to handholding MSMEs, to export promotional policies, to the Production Linked Incentive schemes (PLIs), but have missed out on the obvious, namely, Research and Development (R&D).\n \nRead full story on TOI+\n\n",
        "headline_1": "Labs to riches story",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/labs-to-riches-story/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-03-2025"
    },
    {
        "full_article": "By- Swami Achyutananda\nVedanta declares that only Brahmn is true, and the world is false. But what is meant by false? Everything we perceive around us appears for a time, and eventually, will be destroyed. This impermanence is why it’s considered false. The existence of the universe is borrowed, not inherent.\nConsider a pot of water placed on fire. As the water boils, the potatoes in it become hot. However, this heat is not an intrinsic property of potatoes; it’s borrowed from the boiling water. Similarly, heat is borrowed from fire, but the fire’s heat is intrinsic to it. The universe is an appearance of Brahmn, existing and manifesting through it.\n\nBrahmn is existence, consciousness, and bliss. We cannot perceive Brahmn as an object because it is the ultimate subject, the essence of all experience. Whatever we see, feel, or touch is experienced by Brahmn. There are objects, and Brahmn is the subject; therefore, the subject cannot be the object.\nVedanta describes Brahmn as ‘vastuparicched sunyam, deshaparicched sunyam, and kalaparicched sunyam.’ Vastuparicched refers to the limitation of matter. For instance, a pen is just a pen, not a duster, blackboard, or microphone. Brahmn, however, is unlimited; everything is Brahmn. Therefore, Brahmn is vastuparicched sunyam.\nDeshaparicched refers to spatial limitation. If i am in a room, i cannot be anywhere else in the universe at the same time. This is my spatial limitation. However, Brahmn is omnipresent, existing everywhere. So, Brahmn is deshaparicched sunyam.\nKalaparicched refers to temporal limitation. I was born in a particular year, and before that, i did not exist. I will die, and my existence will cease. This is my temporal limitation. However, Brahmn exists beyond time; it was, is, and will be forever. Brahmn is kalaparicched sunyam.\nNow, the question arises: Where is Brahmn? Vedanta boldly declares that Brahmn is none other than you. You are that Brahmn. This realisation creates confusion, as we identify ourselves with our bodies and minds. All suffering stems from this ignorance. You are suffering because you think of yourself as limited by your body and mind. Therefore, you must embark on a journey from ignorance to knowledge. This journey is not through space but through the realms of understanding. You must transcend your ignorance.\nVedanta invokes the prayer – “Asato ma satgamaya/tamaso ma jyotirgamaya/ mrityor ma amritamgamya.” This means: Lead us from the unreal to the real, from darkness to light, and mortality to immortality. Everything we perceive is impermanent. Lead us to Brahmn, which is permanent and all-pervading. Lead us to the light that dispels our inner darkness, ignorance. And finally, lead us to immortality, for we are eternal and ever existing.\nThe beauty of Vedanta lies in its declaration that you don’t need to acquire anything because you are already that Brahmn. You need to realise it. Vedanta asserts that you are everexisting, ever-pure, knowledge itself, and ever-free. The Mahavakya from the Chandogya Upanishad states: “Tat tvam asi” – That thou art; it means Brahmn and you are the same. Rise above your limitations – body, mind, intellect, memory, and ego – for they are not your true existence. After transcending these limitations, you will realise that you are that existence, consciousness, and bliss.\n\n",
        "headline_1": "The truth of Brahmn satyam jagat mithya",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-truth-of-brahmn-satyam-jagat-mithya/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-03-2025"
    },
    {
        "full_article": "We live within ecosystems, engaging in mutual interactions. Ecosystems such as rivers, forests, and agricultural lands are shared resources. In cities, ecosystem services provide essential resources, regulate natural processes, and offer recreational and cultural benefits, enhancing overall quality of life. They are crucial for urban resilience, climate change adaptation and mitigation, and sustainable development.\nToday, cities increasingly recognise the life-sustaining role of ecosystem services in ensuring the well-being of both humans and non-humans. People's access to these services is integral to their right to the city. However, cities in the Global South struggle to protect ecosystem services with care, often neglecting them instead of ensuring equitable access and distributional justice.\n\nThe concept of wasteland implies that land becomes productive only when it is occupied and improved. Lord Cornwallis's classification of one-third of Bengal's land as wasteland reinforced the East India Company's objective. \nAccess to ecosystem services aligns with Sustainable Development Goals (SDGs) 10 and 11, which focus on reducing inequality and achieving sustainable cities and communities. While most cities strive toward these goals, Dhaka stumbles, prioritising infrastructure development for private interests at the expense of ecological sustainability.\nCitizens have recently expressed concerns about the impact of the Dhaka Elevated Expressway (DEE) project, implemented by the Bangladesh Bridge Authority (BBA), on local ecosystems. The mega infrastructure project involves tree cutting in Panthokunjo, a 5.39-acre urban green space, and landfilling in the adjacent Hatirjheel water catchment area to construct approach ramps at the Moghbazaar intersection. The DEE is a 19.73 km public-private partnership project connecting Kaola, near Hazrat Shahjalal International Airport, to Kutubkhali on the Dhaka-Chattogram Highway. It also includes an additional 27 km of entry and exit ramps at 31 points. Concerns have been raised over multiple deviations at the Moghbazaar intersection, which defy conventional planning principles. These include the investor's late inclusion of approach ramps, the approval of a 3.4 km elevated link to Palashi—expected to generate 18% of total revenue—without feasibility studies, and the suppression of ecological losses in the Environmental Impact Assessment. The project's encroachment on an urban green space and water catchment area raises legal and environmental concerns.\nWe locate the DEE deviations in the following phases of its chequered evolution: First, BBA pre-qualified investors in November 2009 by carrying out their respective feasibility studies. Second, BBA-appointed consultants prepared alternative route alignments of DEE in August 2010; among the five proposed alternative routes, Routes 1, 3 and 4 were located in greenfield outside Dhaka's Eastern fringe, while Routes 2 and 5 were in the city. Route 3 was the suggested feasible option because of its compatibility with the Strategic Transport Plan 2005, although Route 5 matches the implementing route. Third, an Italian-Thai investor with two Chinese co-investors signed a contract in January 2011 to construct DEE for US$ 1.13 Billion (BDT 4917.57 crore) for completion during 2011-2014 with 27 per cent of the estimated project costs shared by Bangladesh; a revised alignment, overlapping Route 5, was approved in October 2013. Fourth, BBA initiated a parallel \"Support to Dhaka Elevated Expressway PPP Project\" for land acquisition, rehabilitation of the affected people and transfer of utilities in October 2011 for BDT 4917.57 crore; this raises the public share to BDT 7330.57 crore or 52.9 per cent of the total BDT 13,857 crore public-private investments. Fifth, local consultants prepared an Environmental Impact Assessment (EIA) for BBA in November 2014. Sixth, legal contestation among overseas investors over ownership of shares further deferred the deadline to 2025.  \nThe urgency of the Save Trees Movement, a citizens' rights protection platform with support from the local community, is palpable as they protest the DEE's disruption of local ecosystem services. Their actions, a testament to human resilience, are a response to the exacerbation of the suffering of people in an already least liveable city in the world. More than two months of on-site camping in Panthokunjo have garnered increasing support and built alliances, yet the authorities have not responded. Protests for reclaiming Panthokunjo show an institutional failure to respond and restore the disrupted ecosystem services, underscoring the need for immediate action.\nCitizens' movements to resist and reclaim ecosystem services have been evident in Bangladesh since the 1990s, albeit with mixed results; for example, Osmani Udyan in Dhaka was saved from being chosen as the site for the NAM building in 1998, while resistance in 2017 could not stop the construction of the Rampal coal power plant in the Sundarbans, Khulna. It is time to question why citizen movements advocating for the protection of ecosystem services have failed to translate into concrete policies that put an end to the government's and its development partners' alienating practices. Why have mega development projects in ecosystem service provisioning khas lands kept recurring for an alleged best return by violating prevailing laws and public well-being? While failures outweigh the few successes of citizen movements, are we witnessing the colonial past casting a post-colonial trope in disrupting urban ecosystem services? Regarding DEE's disruption over access to urban ecosystems in Dhaka, we argue that the colonial consideration of wastelands for revenue generation has created a post-colonial hegemony in determining present land-use choices, prioritising accumulation over common use for public well-being. Let us examine the possible historical entanglements of the present disrupted ecosystem problem.\nWestern physiocratic thought on the primacy of land's produce and Western universal liberalism regarding private property were instrumental in the establishment of colonialism in Bengal. In particular, John Locke's labour theory of property guided revenue extraction from land while legitimising colonialism in Bengal. The land remaining idle anywhere in the world, Locke argued, legitimised colonisation for getting the best return from the land. Labour adds value to land for the best return only when people hold land as private property. The East India Company (EIC) directors had their philosophical underpinning in getting the best return from land by the labour theory of property. The EIC implemented colonisation as a scheme for ruling native people in Bengal, arguing that the productive capacity of land in yielding produce would, in turn, generate trade and commerce, leading to the creation of wealth.\nThe process of turning land into private property in colonial Bengal had never been smooth, considering the nature of disrupting the land-people relation. EIC tapped on the property-constituting power of labour by its translation into the context of Bengal, considering local customs and traditions. The epistemology of this translation led us to probe our present problems around urban ecosystems and their subsequent public acquiring or private illegal grabbing in a longer-term perspective. This epistemological enterprise in historiography is provisional and explores the following questions: How has colonialism differentiated native people in relation to their respective ecological contexts, and how has the colonial legacy continued in disrupting the ecosystem during the post-colonial period, especially under neo-liberalism in Bangladesh since the 1990s? By understanding this historical context, we can better comprehend the present challenges and work towards effective solutions, informing us about the roots of our present challenges.\n\nIt is time to question why citizen movements advocating for the protection of ecosystem services have failed to translate into concrete policies that put an end to the government's and its development partners' alienating practices.\nScholars in environmental history claim that no long equilibrium of the ecological regime had ever existed in South Asia, let alone in the Bengal Delta (Rangarajan, 1996). Since ancient periods, unfolding changes explain the transformation of nature into human habitation through a 'common-enclosure dialectic', especially in the Bengal Delta. The concept of commons as shared resources—grazing land, forests, water bodies—and enclosure as an intended parcelling of commons by denying free access are rooted in feudal England; however, their manifestations in south Asia, in ancient periods, are noted in the writings of Kautilya and others. Commons and enclosure are dialectical, as changes in one cause changes in the other; hence, they are discussed as both/and instead of either/or. How this dialectic unfolded in Bengal by appropriating ecosystem services and extending human habitation helps us trace its concomitant impacts on people's lives and livelihoods.\nThe common-enclosure dialectic in the pre-colonial Bengal Delta was predicated on land clearance; the reclamation of land through forest clearing provided the sovereign ruler with an increasing revenue base while entitling the subjects to the right to cultivation. This dialectic was linked to the spread of religion and the establishment of villages around religious edifices such as temples and mosques in the Bengal Delta. However, the continued nature of this dialectic was radically altered during the colonial period with the emergence of the landed gentry as revenue farmers with their proprietary right to collect revenue from land and the consequent pauperization of the peasantry despite their right to cultivation. How colonial rulers ascribe value to the land is central to the disruption of the common-enclosure dialectic.\nThe EIC started colonial rule in South Asia by acquiring Dewani of Bengal in 1765. The concept of wasteland has been integral to EIC's progressive imposition of the rule for private property in South Asia, which was implemented by the rule of law. EIC did not use the concept of wasteland in Bengal as a natural category to identify infertile or barren land; it was instead a social category that referred both to unproductive uses of land and to lands held in commons, featuring idle native mentality of not striving for greater productivity of land (Gidwani, 1992). The concept of wasteland implies that land becomes productive only when it is occupied and improved. Lord Cornwallis's classification of one-third of Bengal's land as wasteland reinforced the East India Company's objective. The Permanent Settlement Act of 1793 was the most important land law, aiming to ensure the right of property on land. Its intentions were twofold: to ensure a steady flow of revenue to the EIC coffers and to secure the permanence of the EIC dominion through property. The rule of property and its implementing land laws constituted the basic principles of colonial governance (Guha, 1963).\nBy adding value to individually enclosed land reclaimed from commons, cultivation initiates the move from a 'state of nature' to a 'state of civilisation,' albeit as a step towards enlightenment (Whitehead, 2012). A state of nature refers to people subsisting as hunter-gatherers on commons without settled agriculture. In contrast, a state of civilisation is equated with acquiring the right to private property in individually enclosed land. Colonial schemes in Bengal, south Asia in general, did not intend the former's progressive dissolution in the latter; scholars of environmental history have noted their retaining instead through a set of binaries. For example, tribes lived in forests in a state of nature, whereas castes lived in fields in a state of civilisation. Castes were seen as productive because they added value to land, generated revenue, and could reclaim wastelands to attain civilisation. Tribes, on the other hand, were judged unproductive for their dependence on the forest commons in a state of nature without private ownership of land. The status of the commons as wastelands was embedded in the colonial construction of a set of exclusionary, if not racial, binaries such as forests-fields, tribes-castes, plains-hills, wastelands-settled cultivation.\nWasteland, in the colonial grand narrative, was a physical category of unmeasured and uncultivated land imbued with social representation of an idle native society in colonial Bengal; this deeply entrenched representation has led to post-colonial (re)categorisation of khas land as state-owned unproductive land of ecosystem services. Spectres of wasteland loom large over post-colonial khas land of ecosystem services, representing unproductive, unauthorised and temporary uses by the marginal people in rural and urban areas just as in plains and hills. Denying rightful claims by landless and marginal people, the post-colonial authoritarian state sanctions the public and private sectors' appropriation of khas land, often in collaboration with overseas lenders and investors, in pursuit of growth-driven development. This sanctioning by the state is part of the neo-liberal development doctrine that normalises khas land grabbing of ecosystem services by the elite and the powerful for 'accumulation by dispossession,' treating it as a zone of exception. Like the EIC Board of Directors, an unholy nexus of politicians, bureaucrats, and technical experts present themselves as the custodians of this neo-liberal development narrative, often justified by a compromised stakeholders' consultation.\nThe colonial discourse of wasteland produced a form of knowledge—political economy—for governing its subjects that did not decline after its abolition in 1947. On the contrary, it gained a new lease of life; the rule of property around a public-private binary has constituted the spaces of citizenship in post-colonial democracy. Extension of private property and appropriation of khas land continued under the modernisation theory during the 1960s-70s in pursuit of nation-building and intensified through neo-liberal doctrine since the 1990s. Neo-liberal development doctrine views Dhaka ecosystem services—public spaces, peripheral agricultural land, green and blue networks, etc.—as stock spaces waiting for new enclosures in the name of development. The neo-liberal doctrine thus maintains the status quo—ecosystems, whether in khas land or urban spaces, await value addition by and for capital accumulation through either dispossession or exclusion—originating from the colonial translation of Western liberalism through the universal idea of property in Bengal.\nNeo-liberal urbanism has made its irreversible mark in Dhaka, with foreign investments and lending in mega urban infrastructure projects aiming to get maximum returns. We acknowledge that these investments have started benefiting mobility patterns within Dhaka for all except marginalised people. Discrepancies in the agreement, however, raise questions about whose interests the positive impacts serve. In DEE, the Chinese investors will collect tolls for twenty-five years for their 47.1 per cent share of investment, contributing only a meagre BDT 272 crore to the public coffers! As the country of origin of global investors is increasingly tangled with regional geopolitics, should citizens passively accept what they are given and endorse a non-responsive state while refraining from voicing concerns over access to ecosystem services? Certainly not. Civic non-response at the cost of urban liveability cannot be an option in a functioning democracy.\nWe expect our esteemed experts to act as our first line of defence. Citizen dissent should not be left to young activists sleeping rough in tents during long, cold winter nights for months, while experts maintain a conspicuous silence and benefit from the spoils of investments. Last but not least, the DEE debacle is a reminder that no regime can implement its 'production of space' without local expertise. We hope this knowledge does not go to waste.\nShayer Ghafur is a Professor at the Department of Architecture, BUET, where he teaches Southern Urbanism.\n\n",
        "headline_1": "Reclaiming Panthokunjo from spectral wastelands",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/focus/news/reclaiming-panthokunjo-spectral-wastelands-3838156",
        "news_paper_name": "The Daily Star",
        "publish_date": "03-03-2025"
    },
    {
        "full_article": "We're concerned about the continued prevalence of misinformation in post-uprising Bangladesh, with Rumor Scanner identifying 268 instances of fake news circulating online in February. Of them, 127—or 47 percent of the total—were political in nature, while 73 were related to national issues, 10 to international affairs, and 18 to religion. Naturally, the interim government was a frequent target, with 16 misinformation cases about it, mostly negative, along with 16 cases against the chief adviser and several others targeting other advisers. Meanwhile, BNP and its leaders, including Khaleda Zia and Mirza Fakhrul Islam Alamgir, each faced six negative cases. Jamaat-e-Islami and Islami Chhatra Shibir faced 13 and 16 cases respectively, mostly negative. The Student Against Discrimination platform also faced 10 cases, while its leaders were also targeted.\nIn contrast to these mostly negative portrayals, misinformation involving Awami League, Chhatra League, and Sheikh Hasina greatly favoured them, suggesting a campaign by the fallen regime to improve its image. Clearly, fake news is being manufactured to manipulate public opinion with often devastating consequences. Worryingly still, mainstream media outlets themselves disseminated 10 pieces of fake news, while there were 57 cases of media impersonation using doctored logos and graphics, which is quite concerning. The role of Indian mainstream and social media in propagating false narratives has been equally troubling. For example, nine instances of misinformation about Bangladesh were found in Indian media. Rumor Scanner also identified 20 instances of communal misinformation, with half of them traced back to Indian social media accounts.\n\nThese trends at a time of continued political upheavals do not augur well for Bangladesh. The sheer volume of misinformation that spread in the months after the ouster of the Awami League government has been truly alarming. In January, we expressed our concern when news emerged that fact-checking organisations had debunked 58 percent more content in 2024 compared to the previous year. According to Dismislab's annual roundup, fact-checkers identified and verified over 3,000 unique pieces of false or misleading information last year, fuelling a wave of chaos the effects of which are still being felt.\nThese trends at a time of continued political upheavals do not augur well for Bangladesh. The sheer volume of misinformation that spread in the months after the ouster of the Awami League government has been truly alarming. In January, we expressed our concern when news emerged that fact-checking organisations had debunked 58 percent more content in 2024 compared to the previous year. According to Dismislab's annual roundup, fact-checkers identified and verified over 3,000 unique pieces of false or misleading information last year, fuelling a wave of chaos the effects of which are still being felt. While everyone agrees that curbing misinformation has become more urgent than ever before, no one seems to know how to go about it in a manner that eliminates the threat without infringing on people's rights.\nThe dangers of misinformation should be clear to us by now—it is fuelling confusion, division, and instability. Therefore, we must adopt a multi-pronged approach to address it. There should be more digital literacy campaigns to help users identify fake news, while social media platforms should take stronger action against disinformation campaigns. Fact-checking organisations should also receive greater institutional support to enhance their reach and impact. Meanwhile, mainstream media platforms must step up efforts to debunk false narratives and increase access to proper information.  \n",
        "headline_1": "Step up efforts to curb misinformation",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/step-efforts-curb-misinformation-3837971",
        "news_paper_name": "The Daily Star",
        "publish_date": "03-03-2025"
    },
    {
        "full_article": "Since assuming leadership, Prof Muhammad Yunus has given countless interviews, both at home and abroad. Domestically, his responses have grown predictable, his tone occasionally weary. But to foreign leaders and media, he sounds different—more confident, more assured. He speaks of a Bangladesh poised for transformation, powered by its students and young citizens. It was their demand that pulled him into this role.\nAt the World Economic Forum in Davos, Yunus sat down with Gideon Rachman of the Financial Times. Bangladeshi newspapers covered the interview, but what I feel they missed is its core: optimism. To Yunus, Bangladesh's revolution against dictatorship was historic—a movement led by young people who refused to back down. Their story, he insists, must be told.\nOne moment from the conversation lingered. Yunus recounted a letter from a 12-year-old boy to his mother—the last he would ever write:\n\"Mother, you'd have been stopping me from going to the demonstration. My friends are there demonstrating, and some of them were killed. I feel guilty. I'm sitting home because you would not allow me to go. I don't want to be a coward. I want to stand up for my country. So, I'm leaving. I seek your blessing. In case something happened to me, if I don't come back, please forgive me.\"\nThe boy never came back.\nDr Yunus's voice did not break as he recounted it, but his grief was unmistakable. Anyone listening could tell—this is a man who is more than a statesman. He is the chronicler of a revolution.\nYet revolutions do not guarantee stability. Sceptics, both at home and abroad, question its power to stay. Some quietly hope for a return of the deposed regime. But Dr Yunus is clear: this is Bangladesh's moment of reckoning. The dictatorship's fall has opened a path for reform—but the window is narrow. The country must seize it, and seize it now.\nThe biggest hurdle? The economy. Fifteen years of mismanagement have left the treasury depleted. An estimated $16 billion vanished abroad annually. Foreign reserves are precarious, and debt payments are mounting. Yet, in an irony of fate, a surge in remittances from Bangladeshi workers abroad provided an unexpected lifeline. The country was saved at the brink. Yunus's voice shifts between despair and hope, mirroring Bangladesh's fragile reality.\nBeyond economics, the challenge of political reform looms large. Elections must be held. But first, national unity is needed. The July Charter, which the students have been demanding to be drafted, could be a blueprint.\nAs we know, the student leaders have already formed their own political party—the National Citizen Party (NCP). When Rachman, during the talks, asked if students could form their own political party, Yunus seemed to encourage it. That raises uncomfortable questions, as some student leaders were part of his government. Can an interim administration remain neutral if its members later contest elections? Rachman didn't press, but the debate grows in Dhaka.\nThen, there is the spectre of Islamist politics. India, the unhappy giant neighbour, and Western governments are watching closely. Dr Yunus, however, dismissed the concern outright. There is no risk of an Islamist takeover, he said. Perhaps. But the growing visibility of religion-based parties, the shrinking space for women, and the erosion of cultural freedoms suggest a more complex reality—one Yunus chose not to address.\nThe interview was not about dissecting Bangladesh's political culture. It was about sending a message—Bangladesh is breaking free from its past.\nUnder Yunus's leadership, in his own narration, it is on the cusp of something new. \"We are a nation of young, tech-savvy people with global aspirations. Just give them the chance,\" he urged.\nProf Yunus is not just leading a government. He is crafting a story. He is asking Bangladeshis to believe in a different future and inviting foreign friends to be part of it. For that, he deserves our attention—and perhaps, our gratitude.\nEnayetullah Khan is founder of WildTeam and editor-in-chief of the United News of Bangladesh (UNB) and Dhaka Courier.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Yunus keeps the flickering flame of hope alive",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/yunus-keeps-the-flickering-flame-hope-alive-3837636",
        "news_paper_name": "The Daily Star",
        "publish_date": "03-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Recalibration of SEZ plan is timely",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/recalibration-of-sez-plan-is-timely-1740929741",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Battle against market manipulators",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/battle-against-market-manipulators-1740929809",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Shilpakala DG’s resignation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/shilpakala-dgs-resignation-1740929877",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Persistent tax evasion ails economy",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/persistent-tax-evasion-ails-economy-1740929904",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-03-2025"
    }
]