[
    {
        "full_article": "The government and the Opposition crossed swords in Parliament during a discussion on Operation Sindoor this week. There was unanimity in praising India’s armed forces, but there was little common ground beyond that. Operation Sindoor was India’s military response to the terrorist attack in Pahalgam, on April 22, 2025, which claimed 26 lives. The elimination of three terrorists behind the attack, just before the parliamentary debate, helped the government’s case. It told Parliament that these terrorists were Lashkar-e-Taiba members from Pakistan. The Narendra Modi government’s strident approach seeks to change the behaviour of Pakistan and reassure its domestic audience. The success of this approach is debatable and the Opposition sought to put the government on the spot on both counts. A demonstrated willingness to use force against Pakistan in the event of a terrorism incident is a definitive turn in India’s strategy, and the Bharatiya Janata Party (BJP) takes pride in that. But there is no evidence yet that it is working though there has been chest thumping around it by the ruling party. The discussion in Parliament barely addressed the implications of this approach, which is being touted as the new normal. The Opposition and the government agreed on the need to punish Pakistan, and also disagreed on who would do it better.The government claimed success in meeting its objectives of launching a military operation and denied that it had acted under pressure in ending the war. Leader of Opposition in the Lok Sabha Rahul Gandhi demanded a pointed response to repeated claims by U.S. President Donald Trump that he mediated the ceasefire but the Prime Minister evaded a direct response on it. The government contradicts itself when it says that the operation was a success, and that it is continuing. It is also exasperating to hear a party that is now in its eleventh year of uninterrupted power, blame people who passed away decades ago for any challenge that India faces now. There was little self-reflection regarding the lapses that led to the terrorism incident, and whether and how the government plans to address them. The government had sent joint teams including several MPs from the Opposition abroad to garner support for India in the aftermath of the operation, but that sign of statesmanship was a short-lived aberration, as it turns out. The world is changing rapidly and India’s capacity to navigate those changes will be largely determined by its own character. Questioning the patriotism of political opponents is an easy route to take to evade tough questions, but the BJP must realise that such an approach has diminishing returns.\r Published - August 02, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        Parliament proceedings\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Narendra Modi\n                    \n                            /                      \n                        \n                        national government\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        politics",
        "headline_1": "​House of wars: On Parliament, Operation Sindoor discussion",
        "headline_2": "Attacking political rivals cannot be a way to evade responsibility",
        "link": "https://www.thehindu.com/opinion/editorial/house-of-wars-on-parliament-operation-sindoor-discussion/article69883301.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "03-08-2025"
    },
    {
        "full_article": "Prime Minister Narendra Modi’s visit to the Maldives last week, after an invitation by Maldives President Mohamed Muizzu to be a special guest for the country’s 60th Independence Day, signalled the full return of relations to the closeness they held during the previous Ibrahim Solih government. Although the two leaders had not gotten off to the best start in 2023, after Mr. Muizzu’s surprise win, backed by an “India Out” campaign — this was followed by a “Boycott Maldives” social media campaign in India — they have been on the mend for the past year. During Mr. Muizzu’s 2024 state visit to India, India had announced measures including lines of credit and a currency swap arrangement to support the Maldives during its economic troubles. Mr. Muizzu reflected gratitude when he described India’s role in the Maldives as “pivotal” and Mr. Modi reciprocated the warmth. India announced a line of credit worth $565 million (₹4,850 crore) and reduced the annual debt burden for Maldives on previous Indian lines of credit by 40%. There was also the launch of India-Maldives Free Trade Agreement negotiations, which will be a significant driver of future engagement. There was the signing too of MoUs for cooperation in fisheries, meteorological sciences, digital solutions and pharma, as well as a digital and rupee-rufiyaa national currency payments agreement. Over the past six decades, India has cultivated a strong security partnership with the Maldives, including trilateral national security consultations with Sri Lanka, and it is significant that after Mr. Modi’s visit, Mr. Muizzu welcomed Sri Lankan President Anura Kumara Dissanayake for a state visit.The Maldives visit was also a reaffirmation of the importance of India’s “Neighbourhood First” policy, at a time when Indian foreign policy is facing headwinds linked to the U.S.’s trade tariffs and the conflicts in Ukraine and Gaza. The conflict with Pakistan after the Pahalgam attacks, and tensions with Bangladesh have engaged the government’s attention. New Delhi has also been preoccupied with reaching out to different countries, following Operation Sindoor, but did not send delegations to neighbouring countries. It is heartening that New Delhi is preparing to welcome Nepal Prime Minister K.P. Sharma Oli, who has not been invited to India since he took office a year ago. A commemorative stamp by the Maldives for its national day celebrations showed traditional Indian and Maldives boats, which Mr. Modi described as a reflection of India and the Maldives being not just neighbours “but also fellow voyagers on a shared journey”. In a time of global economic turmoil, a closer engagement with the neighbours — one that shores up their economic needs and supports their plans for development where possible — is essential.\r Published - August 02, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Maldives\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        economic policy\n                    \n                            /                      \n                        \n                        fishing industry\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        pharmaceutical\n                    \n                            /                      \n                        \n                        Sri Lanka\n                    \n                            /                      \n                        \n                        foreign aid\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        Nepal\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "​Deep ties: On India-Maldives ties",
        "headline_2": "India needs to engage its neighbours more closely",
        "link": "https://www.thehindu.com/opinion/editorial/deep-ties-on-india-maldives-ties/article69883415.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "03-08-2025"
    },
    {
        "full_article": "On my first trip to Japan, wandering the streets of Tokyo in the early 1990s, I was totally enchanted. The miniature shopfronts often looked like they were decorated by an especially talented child. The gift-wrapping, even for the cheap gifts that I could afford, was elaborate and exquisite. The street-side signboards, selling cigarettes or biscuits, used a strikingly different palette, dominated by metallic whites, baby pinks or powder blues.\nI was in love.\nI walked into a fancy department store, more to look than to buy, but there was a wall of fresh fruits. I picked up a box with an immaculate line of cherries seated on a bench of foam, that made me think of a classroom of kids filmed from above. There were probably multiple layers below as the box said 500gm.\nI calculated the price in dollars. Fifty. It cannot be, I decided, there must be one zero too many. Five dollars seemed a good price and given the unique status of the cherry tree in Japanese culture, I assumed they would be good. I walked up to the counter. The woman smiled prettily and keyed in the number — on the little screen, I saw the equivalent of fifty dollars. I tried to ask her whether it was right in my non-existent Japanese, but she understood perfectly — this was probably not the first time. Do you not want them, she gestured? I shook my head and ran out, startling a man in a neat blue suit who was making a more dignified exit.\n\nIllustration credit: Cheyenne Olivier (France)\nI was reminded of that awkward moment when reading a piece in The New York Times on the luxurious lives of the Hamptons haute bourgeoisie, which featured a $500 (more than Rs 40,000) Japanese melon. It was so expensive because they apparently plucked every flower except one, so that the plant pours its entire honeyed heart into this one fruit, or at least that is how it was marketed.\nThe point of the piece was, however, money, and not melons or marketing. In Delhi yesterday, the wholesale price of a quintal (50 kg) of kharbuja (muskmelons) is about Rs 1,350, or about $16 (about 3 per dollar) and one can get one delivered for the equivalent of a dollar, which is about what a sweet and fragrant melon costs in France. I tried to imagine what something 500 times better would taste like and gave up. Of course, 500 times more expensive does not have to mean 500 times tastier. It could just reflect scarcity and exclusivity. The question is: why are buyers willing to pay that much extra? According to The New York Times, it is because they can. There is no mention of the Hamptonites’ infinitely delicate sensibilities that make them willing to accept the 500-fold markup: it is entirely about their wealth. The fact is that they wouldn’t notice if it cost them $500 for one (quite literally in many cases, since someone else shops for them).\nEconomists and philosophers have long struggled with the question of how to justify the vast inequalities we see in the world and the implied scope for action — would the world be better off if we took the extra $499 spent on that melon and give it to a group of villagers in Bihar or Benin? The current context makes this extremely salient. In the World Inequality Database (WID), in 2023, 42% of the wealth of the world was with the top 1% wealthiest. In India, that number was 40%, in the US 35%, in China 30% and in France 27%. One sees even starker numbers for the very top: the top 0.1% — the richest\n1 in 1,000 — own 14% of wealth in the US, according to the govt’s own statistics. This is more than twice what the bottom 50% own. And the WID estimated that in 2021, the top 50,000 of the world’s richest adults own roughly 3 times the wealth of the bottom 50%, which is 2.6 billion adults.\nNone of these numbers are sacrosanct. Measuring wealth is never easy. The data is often patchy, especially for the rich, who hide their wealth in fiscal havens and refuse to respond to surveys. Moreover, the numbers swing wildly with the stock price. It is even harder in developing countries like India, where the poor live and work in the informal economy. There is no way to produce these numbers without making some brave assumptions. Nevertheless, every dataset finds more or less the same thing: the Swiss bank, UBS, in its Global Wealth Report 2025 celebrating the growing number of millionaires in the world, tells us in passing that the top 1.6% of the world’s population own 80 times more wealth than the bottom 40%.\nMoreover, there is little disagreement about the trends — the ultra-rich are getting richer faster than everyone else. The share of the top 50,000 in global wealth has doubled since 1990, according to the WID. And it is hard to miss the press stories about the soaring fortunes of the tech billionaires or, at an only slightly more modest level, the Indian ultra-rich.\nThe very rich getting even richer is nothing new, but there is something particular about the present moment. First, the very rich have become increasingly inventive in avoiding paying taxes to the point where, in 2018, for example, the 25 richest Americans paid less than 0.2% of their income as Federal income taxes whereas ordinary Americans paid closer to 15%. This is widely acknowledged, even by people like Warren Buffet who are part of that top 25 and pay very little in taxes.\nSecond, the sheer volume of their wealth, and the many lucrative opportunities that they get to control, generates much more revenue than they can reasonably spend. Elon Musk is fighting Tesla shareholders and the courts for a $56 billion annual salary. To spend that on $500 Japanese melons, he would have to eat three every second. This means that they have no choice but to save and invest most of their money. And it keeps growing.\nThird, many of them own what are natural monopolies — because everyone wants to use what everyone else is using, as in the case of Instagram, WhatsApp and X. Others create their own unique ecosystems that become defaults for their users — think Google or Amazon. Others like Apple sell exclusivity and unique design. Unlike the Hampton Japanese melon, in France a melon is just a melon, and, therefore, it is about the same price in the rather ordinary village where I write this and the very posh village a few miles away. Yet others benefit from their government connections, like Musk’s Starlink, or the elite trio of Ambani, Adani and the Tatas.\nAll of this suggests that the usual economic arguments against aggressively taxing the ultra-rich are even less compelling in this context. It seems unlikely higher taxes will make these people, who have such difficulty thinking of ways to spend their money (hence, the melons), stop saving and investing. Nor does it seem that they will stop trying to make money, given so much of their earnings come from various quasi-monopolies.\nOn the other hand, it also means that absent aggressive efforts to reduce inequality, vast wealth inequalities are here to stay, though the names of the top players might change, especially with AI. As it is becoming increasingly evident, this directly threatens democracy — through the control of media by a small number of super-wealthy actors, through nakedly purchased elections (as Elon Musk recently reminded President Trump), and the undermining of the regulatory state to help the favoured economic interests (undercutting green policies in the US, for example). Moreover, it explains why, despite sustained growth, governments across the world are struggling to fund even the most basic social programs. In fact, Trump’s new budget is massively cutting health insurance coverage for the poorest, while France is cutting pensions.\nIn this context, India has an even bigger challenge: our tax capacity has improved, but it hardly matches our aspiration as a nation. Our urban infrastructure is inadequate, to say the least; our public healthcare budget is low by even developing country standards; and we need to build the kind of government-funded cutting-edge research establishment that fuels China’s run towards global leadership (and of course, its equivalent in the US, that President Trump is trying to gut, which will also help the Chinese catch up). If we want to go where we want to be, we need to tax our growing population of the ultra-rich.\nTaxing the rich is never easy, since money tends to be footloose and creative accounting is a burgeoning art, but it is not as impossible as the ultra-rich (and their stooges in the media) want us to believe. The French trio of Thomas Piketty, Emmanuel Saez and Gabriel Zucman have put a great deal of thought into how to do it, and their main insights are that it is easier to tax wealth and corporate earnings than personal income. People will try to move their residence, but it should be possible to change the law to require them to continue to pay taxes for a length of time after they leave (5-10 years or more). Firms will try to shift their profits, so the taxes should target the revenues earned in the country. And so on. It won’t be easy, but democracy and civil society are collapsing under the weight of capitalism’s increasingly inventive greed.\nAlmost as importantly, the rise of a few dominant players with deep pockets in every market is discouraging for the rest, and can result in a slump in productivity. Thomas Philippon from NYU (in a paper with Matias Covarrubias and German Gutiérrez) makes this argument for the US in recent decades. This is even more of an issue for a country like India which needs thousands of new talents to rise to the top. Instead of one precious melon grown on a single vine, we need a network of vines that go from roof to roof carrying their bounty of melons.\nThis is part of a monthly column by Nobel-winning economist Abhijit Banerjee illustrated by Cheyenne Olivier\n\n",
        "headline_1": "Musk and Melons: A moment to rethink wealth taxes",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/musk-and-melons-a-moment-to-rethink-wealth-taxes/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-08-2025"
    },
    {
        "full_article": "By Minoru Harada\nThe kind of world we live in is greatly influenced by whether or not we have good friends. Close friends can make even the most trying circumstances bearable, while loneliness can make even the smallest pain worse. Human connections are treasured in the Buddhist worldview, and friendship is seen as more than just a means of having fun; it is an essential force that influences our own spiritual growth or human revolution and our journey towards happiness and enlightenment.\nAnanda, a disciple of Gautama Buddha, once shared with him, “It seems to me that by having good friends and advancing together with them, one has already halfway attained the Buddha way.” Gautama corrected him gently but firmly: “Ananda, this way of thinking is not correct. Having good friends and advancing together with them is not half the Buddha way but all the Buddha way.” The core of Buddhist practice is revealed in this powerful statement: the presence of genuine, sincere and supportive friends fosters life’s progress.\n\nHow do we create genuine friendships in a world where many people feel isolated even though they are connected digitally? The answer lies in taking the courageous first step to reach out, listen earnestly, and believe in the inherent worth of those around us. Deep bonds of trust that cut across age, background, and status can be created by simply opening our hearts to others without hesitation or fear of criticism and listening to the perspectives of those around us.\nGenuine friendship takes work. It entails caring about other people’s happiness, supporting them even when it’s inconvenient, and sharing both their joys and their sorrows. Walking the path of the Bodhisattva – a person devoted to the happiness of others – means caring deeply, acting with trustworthiness, and never giving up on people around us.\nBuddhism refers to these people who support, encourage, and stand by us as ‘good friends’. Having such good friends is important but so is becoming one ourselves. It is important to keep asking ourselves these questions: How can we foster growth in those around us? How can we make our homes, workplaces, and communities places of warmth and trust?\nMy mentor Daisaku Ikeda once wrote, “Peace is not some abstraction far beyond our reach. It begins with creating acircle of trust and friendship right where we are. As each of these circles expands to include more people, global peace will be realised.” These words remind us that friendly conversation is the first step towards social reform, peacebuilding, and enduring harmony.\nIn its purest form, friendship is a spiritual endeavour. It is the practice of showing compassion in our day-to-day interactions and greeting people with warmth and respect. By becoming aware of our everyday interactions in this way, we begin to change not only our own lives but also the structure of society. By being our best selves with others, we can help bring out the best in them.\nThe future is not built by individuals walking alone. It is created by individuals who journey through life together as friends, companions, and fellow seekers.\n\n",
        "headline_1": "The quiet power of friendship",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-quiet-power-of-friendship/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-08-2025"
    },
    {
        "full_article": "By Dada JP Vaswani\nBetrayal, hurt, anger, disappointment – sometimes or the other, we must face these negative emotions in our lives. When we dwell on other people’s rudeness and insensitivity, we walk into the trap of bitterness and negativism. You constantly think about your disappointment, and then you begin to talk about it, and you are trapped in resentment.\nHow best can we face such disappointments and frustrations? You can choose to react differently by taking responsibility for your own emotions and feelings. You do this in the full awareness that others do not ‘cause’ your feelings. You choose your own.\n\nIt may be a cliché to say that it is useless to cry over spilt milk. But it’s only too true. We have to learn to let go of disappointments and get on with our lives. We need to forgive. This is especially difficult when other people don’t seek our forgiveness, or indeed when they are clearly in the wrong and don’t deserve to be forgiven. Never mind – let go! In such situations, forgiveness allows you to let go of a no-win situation and walk out of it unhurt, unscarred by bitterness.\nPeople, alas, are not perfect. At home, at work, people are going to hurt you or let you down at one time or another. If we remain in charge of our feelings and are in control of ourselves, we can be two steps ahead of the situation. We will not be victims of circumstances.\nLet me give you a small exercise. Think of two people who have hurt you, made you angry or let you down recently – two people about whom you still feel animosity. Now ask yourself: What is my animosity doing to me? Do I feel happy holding on to it? Does it make me feel happier? Does it improve my sleep? Is my life better, richer, more meaningful because of my resentment? If the answer to all the above questions is no , then take a courageous decision. Let go! Walk away from disappointment and bitterness.\nTo arrive at forgiveness, one has to pass through four stages. The first is the stage of hurt. ‘Someone has wronged me, done something mean to me. The hurt keeps on throbbing within me.’ We must remember that it is not ‘I who feels hurt, but the ego. Hurt leads to hate, which is the second stage. ‘In some cases, I hate the person so much that I want him to suffer, as much as I am suffering.’ Then comes the third stage of healing. ‘God’s grace descends on me, and I begin to see the person who has hurt me in a new light. My memory is healed, and I am free again.’ The fourth stage entails coming together. ‘I am anxious to make friends with the person who has hurt me; we both move to a new and healed relationship.’ To choose to let go of resentments is to walk the way that leads to a life of freedom and fulfilment.\n\n",
        "headline_1": "Walk away from disappointment and bitterness",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/walk-away-from-disappointment-and-bitterness/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-08-2025"
    },
    {
        "full_article": "As we waited for cabs after a late night at work, in the quiet city dark, I wondered aloud to my two colleagues, one 50 and married, the other 25 and in a relationship: Is love unfashionable right now? The 50-year-old looked perplexed. The 25-year-old instantly responded: “Yes, at least among all the people I know. No one talks about being in love or falling in love with anyone. And when you ask them about it they look dismissive.” They say, “Please, this is all so cringe.”\nMy older colleague and I are astonished and we laugh: “But that’s right. Love is cringe!” The state of being in love makes cliché inescapable. It is steeped in wanting, to a degree very removed from cool sophistication. That has always made love a little cringe, even subject to snobbery.\nRead more on TOI+ \n\n",
        "headline_1": "Is love worth it? Does it ask too much of us?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/voices/is-love-worth-it-does-it-ask-too-much-of-us/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 03, 2025 00:00:00  \nNatural gas has been the lifeblood of Bangladesh's energy security since the '60s of the last century when a global energy giant, Shell Oil, first hit upon five major gas fields in this part of the world. Since then, the country has been considered a gas-rich nation. Later, in 1997, Chevron discovered the Bibiyana gas field in Habiganj. According to Petrobangla, the state-owned oil, gas and mineral exploration and distribution company, Bangladesh has 22 onshore gas blocks, of which 11 have never been explored. In addition, it has also 26 offshore gas blocks in the Bay of Bengal, divided into 11 shallow-sea blocks and 15 deep-sea blocks, which may be contracted out to international gas and oil exploration companies. But so far, response from the foreign companies has been rather lukewarm as was demonstrated by their lack of response to the international tender the government floated to this effect in March last year. The apparent reason for such disinterest was centred, reportedly, around unattractive gas price offer, lack of dependable survey data on potential gas reserves on the seabed, absence of necessary infrastructure (rigs, pipelines, etc.), and so on. \nAgainst this backdrop, according to reports, country's gas production capacity from the existing wells has been declining fast and has come down to 1800 million cubic feet per day (mmcfd). At the current rate of consumption, the remaining gas reserve of less than 9 trillion cubit feet (Tcf) will be exhausted by 2030, experts hold. Since 2018, Bangladesh has also been buying Liquified Natural Gas (LNG) from overseas, mostly from Middle Eastern countries like Qatar and Oman as well from international spot markets to meet the demand and supply gap. This cannot be a feasible option for the country's energy security indefinitely. Meanwhile, at a recent discussion on energy security, it was revealed that the subsidy the government has been providing for LNG purchase surged to Tk 89 billion in FY 25. This amounts to a year-on-year increase by more than 48 per cent. According to an estimate, since the procurement of LNG from international markets started in 2018, the country has so far spent over Tk.367 billion. \nUnder any circumstances, the government should refocus on exploring gas at home. Exploration work for the idle onshore blocks can well be taken up on this score. In this connection, the interim government is learnt to have been prioritizing domestic gas production through drilling and workover of existing gas wells. To this end, it is reported to be working on drilling 100 wells and workover of 31 wells. And through all these efforts at exploration works and drilling, the government hopes to add 985 mmcfd to the national grid, while from workover wells between 400 and 500 mmcfd could be obtained. All these projections are based on drilling and workover of the onshore gas fields. Reworking of already explored gas fields has its limitations, too. \nSo, one wonders, why the government is not focusing its attention on the offshore gas blocks which may resolve the issue of nation's energy security. No doubt, exploration work and building the infrastructure for the offshore blocks are very capital-and-technology-intensive options. Those are hardly affordable for the government at present. International oil and gas giants can do the job. The point is to engage them in the actual work of exploration and development. Given the urgency, the government should reach deals with them based on the best incentives it can offer.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Resolving gas crunch issues",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/resolving-gas-crunch-issues-1754143350",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       August 03, 2025 00:00:00  \nDespite a gradual moderation of the inflation in the last six months, the central bank has decided to maintain its tight monetary stance for another six months by keeping the policy rate unchanged at 10 per cent. The announcement of the latest monetary policy statement (MPS) last week also indicated that the central bank prefers to sacrifice growth for the time being by making credit flow for investment costly. The statement made it clear that the primary aim of the MPS for the first half of the current fiscal year (FY26) is 'to decelerate the rate of inflation further while maintaining exchange rate stability and strengthening financial stability.' Thus, Bangladesh Bank announced the third consecutive tight monetary stance, finding it successful to a large extent in reducing the inflationary pressure. The rate of inflation came down to 10.89 per cent in December last from 11.66 per cent in July last year. It decreased further to 8.48 per cent in June this year or at the end of FY25. Now, the latest MPS is designed to bring down the rate of inflation below 7 per cent in line with the budget target by the end of the current fiscal year. The interim government, in the national budget for FY26, has set a 5.5 per cent GDP growth target with an aim to contain the rate of inflation within a 6.5 per cent ceiling.\n\nThere is always a debate on the effectiveness of the tight monetary policy to curb inflation in developing countries like Bangladesh, mainly due to the presence of a big informal economy. Nevertheless, developing nations have started to manoeuvre the monetary policy to keep inflation in check. Though the result is mixed, monetary or credit policies in these countries have become a critical instrument to deal with inflation, as the ultimate success of the tight monetary stance is linked with the supportive fiscal and trade policies. \nBangladesh Bank started to announce half-yearly MPS around two decades ago, opening the window of policy transparency. Over the years, the MPS has been modified in line with the global standard practices. In recent years, the central bank has gradually shifted to an interest rate targeting framework from the traditional monetary targeting framework. This shift, which involves setting the key policy rate based on the desired level of interest rates in the economy, is a challenging transformation which is paying off slowly. \nUnder the interest rate targeting monetary policy framework, Bangladesh Bank is using the key policy rate, the repo rate to be precise, along with two supportive tools ?the Standing Lending Facility (SLF) and the Standing Deposit Facility (SDF) ? to operate the monetary policy. The MPS for the first half of the current fiscal year keep the policy rate unchanged at 10 per cent along with the SLF rate at 11.5 per cent, and the SDF rate at 8.0 per cent. It means that banks and financial institutions have to pay at least 10 per cent interest to borrow from the central bank, using treasury bonds, when there is a dearth of capital. To offset the high cost of borrowing, commercial banks have to charge higher interest rates for providing credit to their clients. The high policy rate will drive the banks to mobilise deposits from people to pay loans to traders and investors. If banks do not offer a higher rate of return, depositors will go for government securities bearing a higher rate of return. In this process, the money supply will be reduced from the market, and aggregate demand will also shrink. So, the price level will also decline. \nNow, higher interest rates will make private investment more expensive as borrowing from the bank will be expensive for businesspeople. The net result will be a slowdown in private credit growth. The MPS has projected that private sector credit growth would be 7.20 per cent by the end of December this year, and it would increase modestly to 8.0 per cent at the end of the current fiscal year or June next year. With actual credit growth standing at 6.40 per cent at the end of FY25, the central bank found the projected growth of private sector credit reasonable. \"Private sector credit growth is projected to be 8.0 per cent, assuming the contractionary nature of monetary policy aimed at containing persistently high inflation and lower credit demand from non-bank financial corporations,\" said the MPS.\nBusiness bodies have already expressed their concern on tight monetary stance fearing further squeeze in credit flow. They said that businesses have been experiencing a tough time due to uncertain business environment, deterioration of law and order and disruption of energy supply. Now, the continuation of high interest regime will make matters worse, they argued. Though the concern expressed by the private sector is valid to some extent, it needs to be contextualised. The businesses have already adjusted with the high rate of interest and the latest MPS does not hike the policy rate further indicating that there is no need to rush for increasing the interest rates by the banks or financial institutions. Moreover, the MPS has stressed addressing the alarming level of non-performing loans through various measures. It will help the banks to improve their efficiency and may reduce the cost of lending. Private sector also needs effective intervention from the government to improve law and order so they might do their business smoothly.\nThough the central bank has made it clear that it will ease the monetary stance when inflation comes down below 7 per cent, it may not be easy to do so due to various external and internal factors. Donald Trump, the president of the United States (US), has already launched a tariff war, putting global trade in turmoil. After a hectic negotiation, Trump imposed a 20 per cent additional tariff on Bangladesh, which was initially proposed at 37 per cent in April this year. Due to Trump tariffs, the cost of imports will increase, and so there will be a surge in imported inflation. The MPS also indicated this, saying that the US tariff-induced nominal depreciation of the local currency, or Taka, may further spur inflation.\nThe national election will be held early next year. The announcement of the date and election schedule will ease the uncertainties involving the election. At the same time, there will be a rise in the money supply during the electioneering. Candidates will spend a huge some of money to woo electorates. The increase in money supply is likely to add to inflation and make it difficult for the central bank to ease the monetary stance.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Monetary policy on right track",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/monetary-policy-on-right-track-1754143553",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       August 03, 2025 00:00:00  \nThe Executive Committee of the National Economic Council (ECNEC) has approved a Tk 28.41 billion project for the infrastructural development of Dhaka University (DU). The five-year project, scheduled for completion by June 30, 2030, includes the construction of six academic buildings, four residential halls for female students, five for male students, residential buildings for house tutors of the newly built halls, two residential buildings for teachers and officers, and five additional buildings including a new administrative building. Once implemented, this major infrastructural development initiative is expected to give the country's premier public university a much-needed facelift.\nThe need for improved infrastructure, particularly academic and residential facilities, has been long overdue. Many students are currently residing in dilapidated halls that pose serious safety risks. Incidents of plaster falling from ceilings and injuring students are not uncommon. Several halls, including SM Hall, Masterda Surja Sen Hall and Haji Muhammad Mohsin Hall, have developed cracks in their walls and ceilings and remain in a severe state of disrepair. Most of the university's residential halls were built over half a century ago and have received minimal renovation since.\nEqually pressing is the acute shortage of residential accommodation. This has led to the growth of a 'common room culture' where dozens of students are crammed into spaces designed to accommodate just four students. In some halls, students are even forced to live on balconies due to the severe lack of space. Worse still, this accommodation crisis has historically been exploited by politically affiliated student groups, who often compel newcomers to participate in political programmes, sometimes at the cost of attending classes. For years, the ruling party's student wing effectively controlled hall administration, including seat allocation. \nSince the July-August uprising of 2024, Hall Provosts and house tutors have regained the authority to allocate seats independently and based on merit. However, how long their autonomy will prevail is a matter of question as another political government is going to take power in the near future. There have long been allegations that successive political governments deliberately overlooked the residential seat crisis at the university, as addressing it would undermine the leverage their student wings hold in coercing general students into political involvement. The interim government, therefore, deserves credit for undertaking this major infrastructural development initiative for Dhaka University.\nWhile the infrastructural upgrade is both necessary and commendable, the question remains. Will this infrastructural development translate into meaningful improvements in the university's academic environment and overall quality of education?\nCalls have been repeatedly made for DU authorities to take the lead in restoring the university's lost prestige and delivering education on par with global standards. Despite its reputation as a historic centre of excellence, Dhaka University currently fails to appear in even the top 1,000 universities in global rankings. This is not acceptable for an institution which we tend to regard as a centre of excellence.\nThe decline cannot be attributed solely to poor infrastructure. Rather, it reflects a broader, more systemic malaise. Several long-standing issues continue to plague the university such as lack of good governance, politically influenced appointments of Vice Chancellors, partisan recruitment of faculty and a tendency among some academics to prioritise political involvement over their primary responsibilities of teaching and research. Moreover, student politics has reached such a toxic level that it has long become counterproductive to the university's academic environment. In the lead-up to the August 5 uprising, one of the students' core demands was a ban on partisan politics on campus. Yet, in the post-uprising period, that demand appears to have been pushed to the backburner. Ironically, the student coordinators of the uprising, who have recently formed a new political party, have now established their own student wing. If the toxic political culture that exploits students and teachers for partisan agendas does not change, it will be extremely challenging for the university to excel academically.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Quality learning should  get priority at DU",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/quality-learning-should-get-priority-at-du-1754143615",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 03, 2025 00:00:00  \n\nThe growing popularity of Buy Now, Pay Later (BNPL) services has transformed the way people shop, especially among young consumers. While these platforms offer convenience and instant gratification, their darker side is becoming harder to ignore.\nBNPL schemes often encourage overspending by making purchases feel more affordable, but the delayed payment structure can lead to debt accumulation and financial stress. \nUnlike traditional credit cards, many BNPL services lack thorough credit checks or clear terms, making it easy for users to fall into a cycle of missed payments and late fees.\nMany consumers, especially students and low-income earners, are unaware of the long-term consequences. What seems like a small, manageable payment can quickly spiral into a burden that affects credit scores and savings.\nThere must be stronger regulation, transparency in terms, and financial education to protect users. Convenience should not come at the cost of financial well-being. Responsible usage and awareness are key to avoiding regret in the age of instant spending. \nRahim Hossain, Student\nBachelor of Business Administration\nNorth South University\nrahim.hossain01@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Cost of buying now, paying later",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/cost-of-buying-now-paying-later-1754143640",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-08-2025"
    }
]