[
    {
        "full_article": "Sadly, the Srikakulam crowd collapse that occurred in a private and unregistered temple, on a day when high footfall was expected, is hardly surprising. Reports indicate that there was one combined entry and exit, public use of an under-construction area, inadequate stewarding, severe capacity overshoot, and weak infrastructure. The Hathras crowd crush in 2024 followed an event where permission was reportedly given for only a third of the crowd that attended, and investigations cited inadequate exits and gaps in planning and supervision. The 2011 Sabarimala crush also revealed systemic weaknesses in circulation control on a day with predictable surges and a trigger that became lethal due to constrained pathways. These incidents had different proximate triggers but the same causes of failure: reciprocal pedestrian flows and shared gates, weak physical public infrastructure, and a lack of real-time density monitoring. India already has guidance to anticipate these failures, including the 2014 National Disaster Management Authority (NDMA) guidelines and the National Building Code (NBC). Indian authorities have already demonstrated a feasible path from guidance to operations, including in recent Sabarimala seasons and with the Integrated Command and Control Centre operating at Tirumala. This includes licensed plans compliant with NDMA or NBC prescriptions; calculated occupancy; certified structures that prevent bidirectional flows; real-time density control by trained stewards; and real-time communications and crowd analytics. The persistence of stampedes is due to the gap between guidance and enforced practice.That almost 80% of stampedes in India occur at religious gatherings or pilgrimages is not coincidental. Pilgrim and congregational events often proceed without any licence that ties permission to a crowd safety plan that can be tested for compliance. Authorities often infer the capacity from the space available, rather than what can be estimated from egress options and evacuation times, tolerate bad or no gating plans, accept temporary barricades without certified load ratings, and do not cordon off areas with construction materials. Public safety is a process and its absence, including during crowding disasters, is rarely due to single-point failures. The Srikakulam incident aligns with a known risk pattern and only disciplined adoption of the country’s own codes, enforced by licensing, will reverse it. India also needs a policy culture that treats religious events as engineered systems requiring licensing and auditing. Published - November 03, 2025 12:30 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Andhra Pradesh\n                    \n                            /                      \n                        \n                        death\n                    \n                            /                      \n                        \n                        disaster (general)",
        "headline_1": "Depressing pattern: On the Srikakulam stampede",
        "headline_2": "Any gap between guidance and practice can cause a crowd crush",
        "link": "https://www.thehindu.com/opinion/editorial/depressing-pattern-on-the-srikakulam-stampede/article70232562.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "03-11-2025"
    },
    {
        "full_article": "The India Maritime Week event, headlined by Prime Minister Narendra Modi, signalled government recognition that shipping is not just a business but a business with a strong strategic component. The Indian shipping sector had declined considerably over nearly two decades under the ideological framework of liberalisation, privatisation and globalisation, which weakened government support and diluted strategic intent for shipping. Barring port infrastructure, the Indian government seemed keen largely only on training and educating sea-farers so that they could continue to serve on foreign ships and bring in foreign exchange. The state-owned Shipping Corporation of India (SCI), once a global leader in ship ownership, was allowed to decline. Favourable government policies, such as giving the company first rights to transport India’s oil, were withdrawn in the name of a level playing field and SCI barely escaped privatisation. But COVID-19 was a rude awakening. With India depending heavily on foreign-owned ships, it had little leverage to intervene in its own trade. Private Indian shipping was too small to step up fully. Post-pandemic, the government has realised that shipping, though a business, has much strategic importance, especially during times of disruption, war, and where protectionism and resurgent national interests of western countries rule trade. Recent government initiatives have sought to beef up the SCI’s fleet strength.A major part of the lakhs of crores of rupees in investments announced at the maritime week was port-related. The government has been running its ports under a landlord model, sharing revenue with private and foreign companies for terminal operations, which are now a target of investors. This has given the ports financial heft to embark on new projects — the Chennai and Kolkata ports, for instance, have taken up the transshipment hub project in the Andamans. Investments are also seen in port connectivity, Sagarmala projects, and Indian seafarer training. Another major push has been to have foreign shipping companies register their ships in India through their local subsidiaries, which would give the Indian government leverage over them for serving Indian needs as well as support allied businesses such as insurance. But movement is still barely visible in Indian merchant shipbuilding, where greater progress would have signalled industrial, technical, and project management expertise in heavy industry. The day that Indian shipyards quickly roll out state-of-the-art LNG ships or futuristic green fuel burning vessels, Indian shipping will be truly cruising full ahead. Published - November 03, 2025 12:15 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        government\n                    \n                            /                      \n                        \n                        shipping service\n                    \n                            /                      \n                        \n                        waterway and maritime transport",
        "headline_1": "Cruising ahead: On the India Maritime Week event",
        "headline_2": "India’s shipping sector needs help from the government to thrive",
        "link": "https://www.thehindu.com/opinion/editorial/cruising-ahead-on-india-maritime-week/article70232569.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "03-11-2025"
    },
    {
        "full_article": "Handle with humour, not hubris. Irony most welcome\nEvery few decades, humanity wakes up to a new species disguised as its own offspring. It answers to the same surnames and yet speaks an alien dialect of emojis, acronyms, and irony. Today we call them Gen Z, though earlier centuries had other names for their precocious rebels, heirs, heretics, hippies, or, as elders universally muttered, ‘What is the world coming to?’\nEvery generation forgets how little respect it once had for the one before. Each assumes it has reached the peak of wisdom, only to discover, decades later, that the next has climbed a little higher but with louder music. Socrates complained of youth corrupted by conversation, Shakespeare of lovers who wrote too much verse, and our own elders of those who WhatsApp too much and now they only voice message.\nIn truth, the baton of civilisation has always been passed through rebellion. Every new generation is born with better tools, faster thumbs, and low on patience. Gen Z’s battlefield is the comment section; they speak fluent emoji accompanied by filters, hashtags, irony. The young have always been impatient with hierarchy and hungry for change, it’s the natural law of evolution: the species survives because it dares to think different.\nThey multitask between activism and aesthetics, sarcasm and self-care. They are aware of every issue, sometimes of nothing deeply. But before we judge their impetuousness – recall Ishit ‘Rudeboy’ Bhatt and the social-media storm that followed – let us admit we created their impatience. We handed them an endless buffet of ‘digitopaedias’ and then complained when they questioned our dinner-table wisdom.\nIt is, after all, difficult to preach patience to a generation that measures time in buffering seconds. Beneath their bravado lies brilliance. They may roll their eyes at rules, but they instinctively fact-check our sermons, though one is never sure of the motivation behind the algorithm claiming the ‘fact’.\nSo let us retire the sermon and begin a conversation to learn the language of listening. Because every attempt to command the next generation ends as it always has: with rebellion, ridicule, and reels. The truth is that evolution has no pause button. Each generation grows up faster, learns sooner, errs earlier, and matures later. They will make their mistakes, just as we did, only in higher resolution and with more followers watching. So the next time we despair at their slang, remember: they aren’t ignoring us, they’re just buffering.\n\n",
        "headline_1": "The Next Gen manual",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-next-gen-manual/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-11-2025"
    },
    {
        "full_article": "Another month, another stampede. It seems inevitable only because authorities don’t take crowd management seriously\nSomebody once defined a stampede as an “awful crime committed by a group of people that are more-or-less blameless”. India, sadly, is too often the scene of this ‘crime’, as the Venkateswara Swamy temple stampede in Andhra reminded us on Saturday. Eight women and a boy barely in his teens were killed, and 25 others were injured. We grieve for them, but with a feeling of shock and dismay. Shock because around 40 lives were lost in a stampede in TN, in Sept. And four in MP, in Aug. Two in UP and six in Uttarakhand, in July. Three in Odisha and 11 in Karnataka, in June…The year in fact started with a stampede at Tirupati in Andhra, followed by the deadly crush at Kumbh, and another at New Delhi railway station. \nWe’re dismayed because no lessons were learnt, and we dread the next stampede with a sense of inevitability. But stampedes aren’t inevitable. Both US and China haven’t had any this year. The last fatal stampede in US was in 2023 – two dead – and in 2021 before that. So, stampedes are preventable. But it takes doing. There’s a Bureau of Police Research and Development document on “crowd control and mass gathering management”, but when police take the plea that they weren’t informed about the gathering – as in Saturday’s tragedy – the preventive intent is missing. If 20,000 pilgrims knew about the event, how were the police ignorant? \nOfficial inquiries also seem guided by the principle of ‘let bygones be’. So, the Delhi station stampede happened, we’re told, because somebody dropped a heavy bag! In China, too, stampedes occurred with sickening frequency until 2015 – there were 62 deaths in three major stampedes in 2014 – but then it decided to do something about it. India still hasn’t, obviously.\n\n",
        "headline_1": "Crushing Grief",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/crushing-grief/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-11-2025"
    },
    {
        "full_article": "Post-caste survey powerplay & minor shifts in margins will likely decide the election\nThe calibrated manner in which Bihar’s political parties are carrying out their poll bandobast is a peek into how elections in large states will be fought once caste census and voter roll revisions are completed. Bihar govt’s caste survey (2023) has permanently altered political attitudes. No party really needed exact numbers of caste groups to decide on poll nominees. But, revelations – such as EBCs, the most marginalised of OBCs, are 36% of the population and along with OBCs, over 60% of Bihar’s population – have brought EBC representatives flex. Big guns must accommodate ambition. \nEBCs | Thus, within MGB, VSIP’s Mukesh Sahani wrested the symbolic deputy CMship, denied to him in 2020, pre-caste survey. NDA’s EBC face Nitish made welfare his priority since becoming CM first in 2005. Yet, it is upon BJP to carry JDU’s base, because loyalty to Nitish notwithstanding, joblessness is hitting hard. EBC discontent at continued marginalisation has dramatically raised the stakes. About 112 EBC subcastes reportedly influence outcomes on as many as 120 of Bihar’s 243-seat legislature. Of course, much of this was said in 2020. The irony and tragedy this time is that among the 47L voters’ names not on final voter rolls – 16L of these women – those left out by error likely belong to these very marginalised people: EBCs and dalits.\nVote shares | In 2020, NDA and RJD-led MGB won 38% votes each. Pre-split LJP wasn’t in either alliance. VSIP went with NDA. This time, LJP’s in NDA, VSIP in MGB. Taken with new voter rolls, this’ll impact every narrow margin seat – in 2020 there were over 50 won with margins fewer than 10,000 votes. Hilsa was won by 12 votes, Barbigha by 113. About 10 seats saw less than a 1,000-vote win margin. So, which party is fighting how many and which seats, candidate selection, local anti-incumbency, and narrow wins will matter more than direct transfers. Handouts voters feel fairly assured about, regardless of party in govt. It’s welfare, right?, not freebie. \nSwitcheroos | Ideological parties do well in Bihar, like Bhattacharya’s CPIML and Owaisi’s AIMIM. Prashant Kishor’s politics is yet unclear, his narrative circles on anti-incumbency – not dissimilar to Chirag in 2020, both angling to be Nitish’s heir. The flip side of coalitions is that multiple chiefs is a gamble in a first-past-the-post system. Coalitions can keel over on wins and whims of chiefs of subcastes and parties small but crucial to scraping every last vote. Again, Nitish notwithstanding.\n\n",
        "headline_1": "The Bihar Vote",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-bihar-vote/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-11-2025"
    },
    {
        "full_article": "Nitish appears to be turning anti-incumbency into leverage by absorbing and redirecting it. His incrementalist approach may again position him as the best bet in case of another fractured mandateNotwithstanding exit polls and television debates, a familiar script could unfold in Bihar. After intra-alliance bickering over seats and the sudden announcement of a deputy CM, prospects of an outright Mahagathbandhan (MGB) victory have diminished in the past fortnight. A many-cornered contest might deliver that most Bihari of outcomes: a hung assembly.\nRead full story on TOI+\n\n",
        "headline_1": "Bihar’s Chanakya 2.0",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/bihars-chanakya-2-0/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 03, 2025 00:00:00  \nThe Land Crime Prevention and Remedy Act, 2023 was enacted to expedite the resolution of land-related disputes outside the courtroom through an administrative process. However, its enforcement remains pending so far. It is heartening to know from a recent Financial Express report that the present government is taking up the issue seriously and stepping up efforts to enforce the law. This is welcome, since the number of pending cases related to land disputes now stands at nearly four million, which makes up about 70 per cent of the all lawsuits awaiting disposal. Thus a very complex and cumbersome situation has been created impeding speedy dispensation of justice. The long delay in the disposal of cases makes the people averse to the country's justice delivery system, leading to frequent rise in deadly clashes over land disputes. Furthermore, land mafias and fraudsters exploit the lengthy legal process to grab others' land or government khas land by forging documents. Therefore, the importance of implementing effective mechanisms to reduce the burden on the courts, recover illegally encroached land and ultimately prevent these pervasive crimes cannot be overstated. \nAccording to the Land Crime Prevention and Remedy Act, 2023, if someone's land is encroached upon by others, they can file a petition with the office of the deputy commissioner (DC) and submit the land deed, khatiyan and other legal documents as a proof of his/her ownership. An executive magistrate will then scrutinise the papers to determine the legitimacy of the claim. If found genuine, the district administration, with assistance from the police, will evict the grabber and return the land to its rightful owner. Additionally, if someone's land is encroached upon, the aggrieved person may lodge a complaint with the local police station. The police will investigate the complaint on site and if the allegation is proven, they will assist the local administration in restoring possession to the owner.\nThe new legislation also empowers executive magistrates to award punishment. For instance, any fraudulent act related to land carries a maximum punishment of seven years' imprisonment along with fines, as stated in Section 4 of the act. Similarly, land-related forgery is punishable by up to seven years' imprisonment and fines under Section 5. Notably, the act empowers executive magistrates to perform certain judicial functions under Sections 8 and 22. However, whether the judiciary will view this as an instance of executive overreach and a potential violation of separation of power remains to be seen.\nThe act, once effectively implemented, has the potential to bring long-awaited relief to tens of thousands of victims of land grabbing. However, the success of any law ultimately depends on the capacity, transparency and integrity of the institutions responsible for its enforcement. In Bangladesh, where irregularities and corruption are deeply entrenched and political interference often influences administrative decisions, questions naturally arise as to how impartially and independently executive magistrates will be able to dispense justice. Therefore, it is imperative that the government ensures transparency in the process, provides adequate training and logistical support to the concerned officials and establishes an effective oversight framework to prevent abuse of power. Nevertheless, the administrative process under this act should serve as the first point of seeking justice, not the last. In case victims are not satisfied with the decision of the deputy commissioner's office, the door is open for them to seek justice in the courts.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Fast-tracking land dispute resolution",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/fast-tracking-land-dispute-resolution-1762100458",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       November 03, 2025 00:00:00  \nAs Trump directed his country's Department of War to what he said start testing their Nuclear Weapons on an equal basis in response to other countries' testing programmes, the world is going to enter the insanely competitive era of nuclear testing. Here, by other countries, he has evidently meant Russia. Notably Russia recently tested its two nuclear-powered and nuclear capable weapon systems, the Bureveshtnik cruise missile and Poseidon underwater drone. No doubt, Russian testing of these two new generation nuclear missiles has tipped the global nuclear scales in its favour. However, though these two nuclear missiles did not carry any nuclear warhead to trigger a race for nuclear tests, President Trump, in his characteristic way, thought it otherwise and ordered renewed nuclear testing after a decades-long moratorium on nuclear testing. \nThe US conducted its nuclear test for the last time in 1992. President Trump issued this order while on his way abroad military helicopter, Marine One, to meet Chinese Xi Jinping to hold trade talks in Busan, South Korea. President Trump is often driven by hubris and optics in his various utterances on world affairs. But there are certain areas such as conducting nuclear tests where such political grandstanding might lead the world into the dangerous terrain of uncontrolled nuclear arms race. \nIn reaction to Trump's announcement of starting nuclear tests, the Arms Control Association (ACA) expressed its strong reaction. ACA is a non-government body founded in 1971, that educates and warns the public and policymakers about the dangers of weapons of mass destruction including nuclear weapons and conducts campaigns advocating effective arms control, nonproliferation and disarmament policies. In his reaction, ACA's Executive Director Daryl G. Kimball stated, \"Trump appears to be misinformed and out of touch. The U.S. has no technical, military or political reason to resume nuclear explosive testing for the first time since 1992, when a bipartisan majority of the U.S. Congress mandated a nuclear test moratorium. It would take, at least, 36 months to resume contained nuclear testing underground at the former Nevada Nuclear Test Site outside Las Vegas.\" Notably, since the start of nuclear arms race with the USA's dropping of two nuclear bombs on two Japanese cities, Hiroshima and Nagasaki, on August 6 and 9 during the Second World War in 1945, the US, till 1992, conducted 1,030 nuclear test explosions. When compared with all nuclear tests including those conducted by Russia, Britain, France and China, which numbered some 2,056 nuclear test explosions worldwide, US's was the highest. However, till then India, Pakistan and North Korea had not yet joined the exclusive nuclear club. \nIn the new millennium, no country, except North Korea, has tested any nuclear weapons. In this connection, 187 states which comprise world's overwhelming majority of nations, including the five largest nuclear powers, have signed the 1996 Comprehensive Test Ban Treaty (CTBT). So, being a signatory to the treaty, the United States is legally bound to respect it. The ACA executive director further said that by announcing his intention to resume nuclear testing, Trump will trigger strong international opposition that could unleash a chain reaction of nuclear testing by U.S. adversaries, and blow apart the nuclear Nonproliferation Treaty. So, if Trump by his announcement really means business, then the Doomsday Clock which is already ticking too close (to be specific, 89 seconds to midnight) to the zero hour, perhaps, Trump's announcement would push the second hand of that clock further closer to the moment of mutual nuclear annihilation. But does anyone seem to care? \nThe Cold War era arms control architecture is already falling apart. The United States has withdrawn from the Antiballistic Missile (ABM Treaty in June 2002 and rather recently from the Intermediate Nuclear Force (INF) Treaty in August 2019. It is important to recall here that the ABM treaty was an arms control agreement signed in 1972 by the then two superpowers, the United States and then-Soviet Union. The treaty aimed to limit the number of ballistic missiles deployed by each country. Clearly, the aim was to prevent any accidental nuclear war between the two superpowers as well as establish strategic stability between them. Such treaties help nuclear powers avoid seeking any nuclear advantage against another. Actually, the treaty ended the idea of Mutually Assured Destruction (MAD). In those decades immediately following the Hiroshima and Nagasaki nuclear experiences, humanity was gripped by the terror of the nukes and there evolved no end of organisations campaigning against the production and testing of nuclear weapons. It is against this backdrop that the Treaty on the Non-Proliferation of Nuclear Weapons (NPT) was opened in July, 1968. However, the treaty, effectively entered into force in March 1970. But some countries including India, Israel, Pakistan and South Sudan never signed the treaty, while North Korea withdrew from the treaty in 2003. \nThe Intermediate Range Nuclear Force (INF) Treaty, on the other hand, was a landmark arms control agreement reached between the two Cold War superpowers, the USA and then-Soviet Union in 1987. Through signing the arms control deal, it ensured elimination of ground-launched ballistic missiles from both the countries. But as noted in the foregoing, the treaty became void with the allegation of Russia violating it and finally the USA withdrawing from it in 2019. Now the last remaining nuclear arms control treaty is the New Strategic Arms Reduction Treaty (New START). \nThe New START came into force in 2011, that limited each signatory country to 1,550 deployable nuclear warheads and 700 deployed missiles and bombers. The treaty was extended for five years in 2021 and will expire in February 2026. Since, there is apparently no intention either on the part of Russia or of the USA to reach any fresh nuclear arms limitation talks, prospect of a nuclear arms-free world is zero. Now with Russia testing nuclear capable missiles, though those did not carry and nuclear warheads and president Trump's reaction to it with the order to Pentagon for carrying out tests that involve nukes have thrown the world into a kind of nuclear arms race on which neither party has any control. Worse yet, the two major nuclear powers seem to be on a collision course. At such times, as during the Cuban missile crisis in October,1962, it required a level-headed leadership to end the crisis and save the world. It does not appear we have any at the moment. \nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Is the world closer  to the doomsday?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/is-the-world-closer-to-the-doomsday-1762100498",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       November 03, 2025 00:00:00  \nThe Odhikar and the Manabadhikar Sangskriti Sangstha, two human rights organisations, in their latest reports have come up with alarming pictures of the lax law and order and worsening security of life in the country. While the number of extrajudicial killings stood at 40 in the last 14 months, the figure of unidentified bodies surged to 66 in October last compared with its previous month's 52. The custodial deaths also rose to 13 in October from eight in September. The two months witnessed incidents of mob violence with September reporting 43 incidents to October's 44. But September's 24 deaths were exactly double that of October. However, the critical injuries to 50 in October were higher than 36 in September. \nAs many as 7,979 incidents of political violence have been recorded by Odhikar during the tenure of the interim government. In such violence, 281 people lost their lives. Also, journalists were targets of 242 attacks -- 34 in September this year alone -- in the 14-month tenure of the government. All such killings, violence and attacks speak volumes for the law and order situation prevailing here. Belying expectations that the law and order will continue to improve in the run up to the election, the sign is rather grim. September and October should have set the tone for stricter enforcement of laws in order to raise the confidence in the minds of the general public. Instead, security of life has become a casualty. A last-minute attempt before the election may not be enough for holding a non-controversial and peaceful poll. \nAccusing fingers have been pointed at the law enforcement agencies. Extra-judicial killings were supposed to be incidents of the past but unfortunately those are, as Odhikar reports, on a higher trajectory. After the inauguration of the interim government on August 8, there was no extra-judicial killing in that month. But in September last year, the number of such killings suddenly rose to 9. Next three months accounted for one death each. That was the time when initiatives should have been geared to arrest such killings as well as concentrate on gradually taking control of law and order. Instead, the situation continued to deteriorate with the government allowing social chaos and disorder to reign supreme. \nMob violence followed courtesy of lax enforcement of laws. The anti-social goons took full advantage of the situation. There were some organised fanatic groups which acted not only as moral vigilante outfits but also unleashed attacks on all that they did not like. Some even used the vacuum to settle old scores and used the ploy to loot or plunder residences of wealthy people. Then anarchy in garment factories tested the level of tolerance of the law enforcement agencies. The legal parameter became the greatest casualty in the process.\nPersecution of the perpetrators was totally absent in some of the cases giving the impression that such acts are not punishable. Criminals took the cue from such inactions only to go about their nefarious affairs with great gusto. Today the apprehension is that the decline in law and order may vitiate the environment of the election tentatively scheduled for February next. If this happens, it would deal a body blow to the country's social stability and peace. \nWith the rise in casualties in the last two months, the general public will keep their fingers crossed even about the holding of the election smoothly and peacefully. The current month will be indicative of what is to come next. Dissent on the July charter among the political parties including the National Citizen Party, now seems to be a spent force, will not help the cause of holding a free, fair and peaceful poll. Forces inimical to the countries' well-being may take chances to exploit the rift or disunity among the main political actors vying for victory in the election. The law enforcement agencies, the police in particular, are still ill-equipped both mentally and physically to combat the declining law and order. Unless this sensitive issue is addressed urgently, social peace and stability will remain elusive. \nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Lax enforcement of laws and security of life",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/lax-enforcement-of-laws-and-security-of-life-1762100526",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 03, 2025 00:00:00  \n\nWith the advancement of modernity, many aspects of human life have changed. Our lifestyles have evolved and old customs have gradually been replaced by new trends. One such trend is the growing gym culture. About five years ago, gyms were rare in most parts of the country, but today almost every neighbourhood in the city has one.\nWhile regular workouts offer clear physical and mental benefits, it is also important to consider the potential downsides of this growing gym culture.\nAn unhealthy obsession with achieving a \"perfect body\" is emerging among some youths. Excessive exercising can cause physical harm, while neglecting studies, work, or family responsibilities in pursuit of an ideal physique can make one less productive. Social media often amplifies this problem by promoting unrealistic body standards that lead to insecurity and unhealthy competition.\nMoreover, the financial burden of gym memberships, equipment and supplements makes gym culture inaccessible for many middle-class youths. In some cases, it even creates unnecessary social pressure to conform.\nThe outcome of any activity depends on its purpose. If young people go to the gym to stay fit and healthy, it is undoubtedly beneficial. But when fitness turns into fashion or a means to show off, it brings mental stress, financial strain, and distorted values. True fitness should focus on wellness, not appearance - on self-improvement, not social comparison.\nThe essence of gym culture should be about building a healthy body and mind, not about competing with others for validation.\nLaboni Akter Kobita \nJagannath University \nlaboniakterkobita6@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Dark side of gym culture",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/dark-side-of-gym-culture-1762100550",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-11-2025"
    }
]