[
    {
        "full_article": "The measures notified by the Centre on June 3, 2025 seek to address the several concerns that have been raised by the people of Ladakh regarding their language, culture and land. These issues came to the fore after the special status of the former State of Jammu and Kashmir (J&K), under Article 370, was withdrawn in 2019 and it was bifurcated into Union Territories (UT). New policies on reservation, languages, domicile and composition of hill councils for the UT of Ladakh include a provision for up to 85% reservation for indigenous people in government jobs. Further clarity is expected when the rules are framed. Several States in the Northeast have reservation above 80% for indigenous people in various sectors — for instance, Mizoram has 92%, and Arunachal Pradesh has 80% in jobs. To be counted as a domicile of Ladakh, a person must have a continuous 15-year stay from 2019 in Ladakh. This means that migrants in Ladakh, after it lost its special status in 2019, will be considered for domicile only after 2034. The comparable provision in the UT of J&K considers anyone who has completed 15 years as a registered migrant eligible for domicile. In hill councils, one-third of the seats will be reserved for women, as per the policy. English, Hindi, Urdu, Bhoti and Purgi languages will be the official languages.These measures fall short of the demands that civil society organisations in Ladakh have been raising. They want full Statehood, inclusion in the Sixth Schedule of the Constitution which provides for special protection for tribespeople in several parts of the country, a second seat in the Lok Sabha and the constitution of a public service commission. While Ladakh, with a population of 2.74 lakh (2011 Census) has been demanding constitutional safeguards to protect its identity, culture and land, the lack of jobs and employment opportunities for the youth were at the heart of protests witnessed by the Union Territory in the past five years. A parliamentary panel was informed by the Union Home Ministry earlier this year that none of the 1,275 gazetted posts in Ladakh has been filled since the region became a centrally administered territory in 2019. The sustained campaign by the Ladakhis, both in Kargil and Leh, forced the government to form a high-powered committee in 2023, headed by Minister of State Nityanand Rai, to look into their demands. Ladakh is strategically located at the junction of India, Pakistan and China, where both neighbours have border disputes with India. Recent developments have demonstrated that both these countries often act in tandem. It is imperative that New Delhi pays close attention to the sentiments of the region. Published - June 04, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Ladakh\n                    \n                            /                      \n                        \n                        Jammu and Kashmir\n                    \n                            /                      \n                        \n                        Article 370\n                    \n                            /                      \n                        \n                        Reservation\n                    \n                            /                      \n                        \n                        language\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        minority group\n                    \n                            /                      \n                        \n                        Mizoram\n                    \n                            /                      \n                        \n                        Arunachal Pradesh\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        population and census\n                    \n                            /                      \n                        \n                        Lok Sabha",
        "headline_1": "​Act north: On the needs of Ladakh",
        "headline_2": "India must attend to the grievances of the people of Ladakh",
        "link": "https://www.thehindu.com/opinion/editorial/act-north-on-the-needs-of-ladakh/article69652855.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-06-2025"
    },
    {
        "full_article": "The Russia-Ukraine war has entered a new phase, marked by intensified military attacks and direct negotiations. On Sunday (June 1, 2025), on the eve of the second round of talks, Ukraine carried out its most daring drone attack deep inside Russia, targeting military airfields. According to Ukrainian intelligence officials, the drones, which were transported by trucks into Russia and launched remotely, resulted in “the destruction” of dozens of strategic bombers. While these claims have not been independently verified, Russia’s Ministry of Defence confirmed that five of its airfields came under attack, and aircraft at two stations, one close to the Norwegian border and the other in Siberia, “caught fire”. That Ukraine managed to carry out such an attack is a morale booster for its troops and a tactical setback for Russian President Vladimir Putin. Prior to Kyiv’s attack, Russia had launched an avalanche of drones and missiles across Ukraine, significantly straining the country’s air defences. It included a missile strike at a military training base on Sunday, killing at least 12 Ukrainian soldiers. But a silver lining amid the intensifying military exchanges was that Russia and Ukraine went ahead with the planned direct talks in Istanbul on Monday. In the hour-long meeting, negotiators agreed to a prisoner exchange deal, and scheduled a third round of talks later in June.Forty months into the war, the signs of exhaustion are evident on both sides. Ukraine, faced with battlefield challenges, is trying to offset its vulnerabilities by staging innovative drone attacks to make the Kremlin feel the pain of the war. Kyiv has not had any major territorial victory in its lost territories since the Kherson offensive of late 2022. Over the past year, Ukraine has lost nearly 5,000 sq. km of its territory to the Russians. Russia has recaptured the land Ukraine had seized in Kursk. Russia’s spring offensive is now gaining momentum, with territorial advances in the Sumy region, while Ukraine is grappling with weakened air defences, an acute manpower crisis and uncertainty about continued U.S. support under President Donald Trump. Russia has found it increasingly difficult to prevent Ukraine’s drone attacks targeting its energy infrastructure, the Black Sea fleet and now airfields hosting strategic bombers. If Russia has battlefield momentum, Ukraine stays defiant. If the war continues to drag on, the toll on both sides will only deepen. So far, efforts by Mr. Trump to broker peace have yielded little progress. But he should not give up. Russia has long-standing grievances and future security concerns that must be addressed. Ukraine wants credible security guarantees that shield it from future attacks. The U.S. has a crucial role to play in narrowing these differences and working toward a durable ceasefire.\r Published - June 04, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        armed conflict\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        espionage and intelligence\n                    \n                            /                      \n                        \n                        defence\n                    \n                            /                      \n                        \n                        Turkey\n                    \n                            /                      \n                        \n                        prison\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        security measures",
        "headline_1": "​War and talks: On Russia and Ukraine",
        "headline_2": "Both Russia and Ukraine are looking for security guarantees",
        "link": "https://www.thehindu.com/opinion/editorial/war-and-talks-on-russia-and-ukraine/article69652828.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-06-2025"
    },
    {
        "full_article": "Manufacturing growth isn’t keeping up with GDP growth, indicating a problem that needs fixing\nTaiwan, less than 0.4% the size of China, ensures its safety by making 90% of the world’s silicon chips. It’s indispensable, hence untouchable in a good way. That’s the power of manufacturing. So, when you read India’s GDP data for Jan-March, pay attention. The good news is that growth accelerated to 7.4%, better than China’s 5.4% in the same quarter. But most of it happened in construction, especially govt-funded projects. Manufacturing grew at a modest 4.8% despite govt’s PLI schemes for sectors like electronics and solar equipment, and the front-loading of orders by US importers anticipating Trump tariffs. Apple alone lifted five plane-loads of iPhones in the last week of March. \nWe are now in the third month of this fiscal’s first quarter, and given the global uncertainty, it’s time to assess manufacturing as a national priority. On paper, it has been govt’s focus for years, yet its share in GDP is stagnant – 15% in 2014, 17% now. Govt’s 25% target remains elusive. In China, despite its 4.5x larger economy and five years of “China+1” sourcing policies, manufacturing accounts for 26% of GDP. \nIndia’s GDP is projected to grow at 6.5% this fiscal, well below the asking rate of 8% for reducing poverty. Manufacturing is key to the required quantum leap. It’s a political necessity to employ youth that GCCs and other white-collar operations can’t absorb. After Op Sindoor, it’s also a security imperative. A nation of 1.4bn should be making its own drones, planes and missile shield.\nBut assembling iPhones is only a step, not a goal, because it does not give us Taiwan-like manufacturing clout. We need more foreign investment, but also domestic R&D to get ahead in emerging technologies. PLIs won’t get us there – half of India’s phone-making capacity is unutilised. Tamil Nadu, the lone state where 25% of GSDP comes from manufacturing, got there by actively fulfilling industry needs of manpower, regulation and infrastructure. If TN can do it, so can Gujarat, Maharashtra, UP and others. What’s needed is political will.\n\n",
        "headline_1": "Factory factor",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/factory-factor-3/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-06-2025"
    },
    {
        "full_article": "Covid’s return not a big worry. But a case in Delhi HC shows what’s worrying when it comes to outbreaks\nIt is safe to assume that had Delhi HC not issued a notice to Centre for failing to present in court minimum standards for sample collection, most wouldn’t have known that India has no SOP mandated for diagnostic labs. Protocols of course exist, but SOPs are not mandatory. This case has gained traction given the rise in Covid cases. Delhi HC sounded a note of caution. This is despite the fact that GOI, epidemiologists and medical fraternity all agree that given the endemicity of Covid and that almost 70% of the population is fully vaccinated, this round of Covid is little more than “seasonal flu”. There is no cause for worry.\nBut that is not to say now is not the time for the whole preparedness-shebang to kick in – from wearing masks to surveilling the spread with more testing. Cases are climbing, as are deaths. All deaths have been of those with Covid, not of Covid. Point is, India’s burden of comorbidity is massive – diabetes to TB to COPD, chronic kidney disease, and cancer patients & survivors. Against this reality, it’s hard to see why Union health ministry wasn’t more proactive to Delhi HC’s 2023 order to formulate minimum standards for sample collection.\nIt is not about Covid alone. Our healthcare systems must brace for viral outbreaks at any point given the two major challenges today – a dizzying number of dangerous viruses (H5N1, dengue, chikungunya, Nipah, Zika are household terms) and antibiotic-resistant bacteria. Preparedness and quick response make healthcare systems more resilient. Govt estimates put Covid deaths at 5.3L. Lessons were learned. Every weak link in public health machinery was exposed. In the three years since, how many of these weaknesses have been fixed? Is surveillance better? Is the expanded virus research & diagnostic laboratory network fully equipped? Variant identification took a long time during the pandemic. Have we fixed that? Surveillance systems, healthcare infra and community engagement ensure public health. Covid may not be a threat, but as epidemiologist Gagandeep Kang put it: “What we know we don’t know is when, where and what our next disease outbreak will be.” An SOP for sample collection and transport seems to be the very least govt can do.\n\n",
        "headline_1": "Viral truths",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/viral-truths/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-06-2025"
    },
    {
        "full_article": "It’s only within the confines of the subcontinent that Pakistan and India engage in conflict \nNo, no, please! How can I accept money from you? This is my home and you are a guest here. I can’t take money from a guest.\nThe speaker was a Washington DC taxi driver, a middle-aged migrant from Lahore who had settled in US years ago. Bunny and I had been to one of the Smithsonian museums, those wonderful repositories of art and culture that are a hallmark of the city.\nWhen we emerged, there was a thunderstorm with torrential rain. We were lucky to get a cab that was dropping off a museum visitor. The cab driver asked where we were from, and when we said India, with a beaming smile he switched from English to Urdu.\nDuring the 20-minute ride, we talked about each other’s families, where we lived, what his grown-up children did. There was no mention of Kashmir, or Partition, or something called a two-nation theory.\nWe were chance-met strangers with common roots encountering each other in a foreign land. It took all my powers of persuasion to get our new-found friend to accept the taxi fare. And from him, we received heartfelt blessings for our well-being.\nIn the picture-postcard Italian town of Polignano, upon hearing that we were Indian, a young Pakistani waiter confided in us his future plans, including finding a bride back home, with the emotional intimacy of a family member.\nIt happens time and again, for many of us who meet Pakistanis abroad. Never have so-called foes been friendlier, going out of their way to be of help, striking some deep chord of fellowship that belies a history of bitter conflict.\nIt is only within the subcontinent that the two countries are entrenched adversaries. The mutual antagonism inflamed by the shrill bellicosity of vicarious warriors who exhort others to do the fighting for them, and for whom the word ‘peace’ is another word for ‘treason’.\nTaken out of this geographic and political context, mutual animus transforms into a shared amity. That’s the enigma that binds together the best of enemies.\n\n",
        "headline_1": "Best of enemies",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/best-of-enemies/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-06-2025"
    },
    {
        "full_article": "CDS clarified key facts about Op Sindoor in Singapore. These echo a world history lesson. Success in war is determined by achieving one’s political aim. Military losses are the wrong metric\nA lot of heat and dust has risen in the wake of the Operation Sindoor interviews given by our Chief of Defence Staff (CDS) in Singapore. He was speaking to Bloomberg and Reuters on the sidelines of the Shangri La conference. Three issues stand out from his remarks. But before getting into those specifics, consider a brief military history, which can help settle the current debate over the role of military losses in determining the reality of the four-day India-Pakistan skirmishes of May.\n\nRead full story on TOI+\n\n",
        "headline_1": "Gen Chauhan’s war tutorial",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/gen-chauhans-war-tutorial/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-06-2025"
    },
    {
        "full_article": "We are disappointed by the low budgetary allocations and limited attention that the health and education sectors have received in the just-unveiled budget for FY2025-26. In his budget speech, the finance adviser pledged that the government would focus on key areas such as education, healthcare, effective governance, civic amenities, and job opportunities, rather than prioritising physical infrastructure. However, in reality, there is inadequate reflection of these priorities in the proposed budget, particularly with regard to education and health. While Tk 95,644 crore has been proposed for the education sector and Tk 41,908 crore allocated for the health sector, these figures have frustrated educationists and health experts alike.\nThese two sectors have not only received insufficient allocations, but there is also a palpable lack of strategic planning for the execution of the funds. According to UNESCO recommendations, 4 to 6 percent of GDP, or 15 to 20 percent of a national budget, should be allocated to education. However, only 12.1 percent of the total budget, or just 1.72 percent of GDP, has been allocated to this sector. While the government has proposed some important initiatives—such as steps to raise enrolment in technical education and the launch of a new school feeding programme in 150 upazilas—these are not enough. The education sector requires critical reforms, which remain unaddressed in the budget.\n\nAccording to UNESCO recommendations, 4 to 6 percent of GDP, or 15 to 20 percent of a national budget, should be allocated to education. However, only 12.1 percent of the total budget, or just 1.72 percent of GDP, has been allocated to this sector. While the government has proposed some important initiatives—such as steps to raise enrolment in technical education and the launch of a new school feeding programme in 150 upazilas—these are not enough. The education sector requires critical reforms, which remain unaddressed in the budget.\nSimilarly, the health sector has received only 5.3 percent of the total budget, ranking seventh among all sectors. This is far below the Health Sector Reform Commission's recommendation of 15 percent. While the finance adviser has announced some tax relief on the import of pharmaceutical raw materials and medical equipment—which would help reduce the cost of medicine—he has not clarified how the commission's recommendations will be implemented. Given the dismal implementation rate of the health budget in the outgoing year, special attention is required to ensure proper utilisation of funds in this sector.\nWe understand that the government is grappling with many challenges. But we hope it will overcome them and proceed with a clear roadmap to bring about the much-needed reforms in these sectors. The finance adviser has rightly pointed out the need to develop human capital, but for that to happen, we must prioritise both the education and health sectors, and also address unemployment, among other pressing issues. The government must take concrete initiatives to harness our demographic dividend for sustainable long-term growth. It should consider the suggestions made by experts and incorporate them into the budget before its finalisation.\n",
        "headline_1": "Health and education sectors need greater budgetary attention ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/health-and-education-sectors-need-greater-budgetary-attention-3910951",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-06-2025"
    },
    {
        "full_article": "For much of the past few years, one man dominated the headlines for Paris Saint-Germain—Kylian Mbappé. When he left on a free transfer to join Los Blancos at the start of the 2024 season, few could have predicted that, in hindsight, his departure would prove to be the best thing that ever happened to the Parisians. By the end of that very season, they were lifting the elusive trophy they had chased for the entirety of the club's history.\nWhen you think of PSG, you think of stars—Ronaldinho, Lionel Messi, Neymar Jr, Kylian Mbappé, Zlatan Ibrahimović. Yet none of them managed to lead the club to the pinnacle. Often shrouded in managerial disagreements, the collision of superstars, and a fractured hierarchy, PSG regularly dominated the headlines for all the wrong reasons. In the 14 years since Qatar Sports Investments (QSI) took over, seven elite coaches have come and gone, each failing to guide the club to European glory. Finally, in 2023, Luis Enrique arrived.\nAt the time he took over, Messi had already departed for Inter Miami, Neymar was on his way out, and Mbappé had one year left on his contract. When asked about the trio, Enrique remained true to his philosophy—without collective effort, structure and sacrifice, any plan would fall apart. The idea was simple: collective effort over superstar indulgence. He reshaped PSG's strategic approach into one that nurtured young talent and fostered a team-first mentality. He strongly preferred pressing wingers, balanced midfields, and high defensive discipline. Fluidity, aggression, interchangeable roles, and vertical play became the core ethos of the team.\nFor a long time, PSG suffered with transitions. Lacklustre and overly reliant on their attacking stars, the team often resorted to hopeful long balls when trailing. Unai Emery's style came closest to the current structure, but defensively, the team remained vulnerable due to poor organisation exposed during transitions. Laurent Blanc's positional play was too slow; Thomas Tuchel's structured defence became predictable; and Mauricio Pochettino struggled to integrate superstars effectively. Under Enrique, however, PSG embraced unpredictability, cohesion, and a beautiful rendition of total football meeting modern pressing.\nLike most teams in modern football, the goalkeeper plays an equally important role as an outfield player, initiating ball progression. Elite full-backs Achraf Hakimi and Nuno Mendes step into midfield to occupy and overload key zones, or overlap wide, while the centre-backs split and the pivot drops deep to form a triangle structure. Highly technical midfielders Vitinha, Zaïre-Emery and João Neves create constant triangles for short passing to maintain the team's rhythm. Their pressing often lifts the heavy burden from the defence. Up front, Ousmane Dembélé, Khvicha Kvaratskhelia, Désiré Doué and Bradley Barcola press forward, linking play, stretching opposition defences, and cutting inside as their full-backs provide width. Each zone operates within a system meticulously tailored to their strengths, with every player recognising their equal importance.\nIt is important to acknowledge that PSG's financial strength will always be a key part of their story. But that is simply how modern football operates, plagued by inflated transfer fees, soaring wages, and a flurry of miscellaneous payments. Yet, if Pep Guardiola's achievements with Manchester City are celebrated, Enrique's moments with PSG feel even more significant. Despite the abundance of superstars, this new era of PSG feels warmer and more pleasing to the eye than any of the club's previous incarnations.\n \nEnrique's commitment to collective play is a refreshing change after years overshadowed by the limitations of individual egos. His personality is invigorating, and their dominant Champions League victory showed why the players so deeply bought into his vision. He demands accountability, is unafraid to make tough decisions, and firmly believes that without discipline, there is no path to success. This is a man who understands the pressure and gravity of the moment, yet also sees the humane side of his players—the part so often unexposed to the public eye.\nHowever, football is always made up of tiny moments that lead to something bigger. For PSG, that moment came when they went two goals down to Manchester City in January 2025. Within three minutes, they fired back, and four minutes later they equalised. Since that day, PSG went on to defeat the eventual English champions—Liverpool, Aston Villa and Arsenal—one after the other. A modern-day French revolution. Désiré Doué became a household name, Ousmane Dembélé rediscovered his $120 million spark, Khvicha Kvaratskhelia has become a hero both in Naples and in Paris, Vitinha has come closest to becoming the new Xavi, and Achraf Hakimi, well, he will never have to pay for another drink in Paris. This is not just a long-awaited triumph but perhaps the beginning of an era that will soon be undeniable for Les Rouge et Bleu—a party that started all thanks to Luis Enrique.\nAs the final whistle blew, millions of Parisians took to the streets. The grand hall of the Parc des Princes celebrated their new kings in true style, with fireworks blazing across the sky. The iconic Eiffel Tower lit up in red and blue. Along the banks of the Seine, locals poured out tears for the club that runs through their veins.\nBut on the other side, in the moment of such euphoria, the ugly side of football hooliganism surfaced. In one quarter, celebrations descended into chaos and turmoil. Far from the joy the victory should have represented, it became a scene of horror—police deployed to handle the raucous crowds, some of whom were retaliating with fireworks and setting infrastructure on fire. It reminded the world that even in joy, there are those who wait to evoke violence driven by their emotions for sport. This resulted in the death of two and several others being severely injured.\nIt is important not to let such barbarous acts overshadow everyone's happiness, but it is equally important to remember how far we still have to go in dealing with the ugly side of sport, especially when young lives are lost in this manner.\nRaiyan Binte Rafiq is a sports columnist for The Daily Star. She works in Sports Media in the UK and manages recruitment at Next Level Sports Management.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "La Vie en Paris Saint Germain",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/beyond-the-dugout/news/la-vie-en-paris-saint-germain-3910216",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-06-2025"
    },
    {
        "full_article": "Fascism has deepened through the whirlpool of cultural politics, just as the role of culture in the 2024 mass uprising stirred the nation. Rhymes, songs, poems, and slogans moved people from all walks of life to resist fascist forces. Since 1969, intellectuals have consistently inspired uprisings. Though shadow power centres have crumbled, fascist ideologies remain intact. In pursuing true reform, new politics cannot ignore the practice of culture.\nAnthropologist Edward Burnett Tylor defined culture as \"that complex whole which includes knowledge, belief, art, law, morals, custom, and any other capabilities and habits acquired by man as a member of society.\" So, what happens when political leaders lack cultural awareness? A society devoid of culture becomes toxic.\nJust as healthcare keeps the body well and politics energises society, culture gives life its rhythm and soul. Without it, life becomes stifling. Time and again, history shows that culture gives strength to a nation. From the Language Movement to the Liberation War, cultural practices have inspired Bangalees.\nAs Kazi Nazrul Islam wrote: \"Bolo bir, bolo unnoto momo shir\" (Speak, hero, say,/ My head is held high), with our heads held high, we achieved independence through a bloody war. The decline of religion-based politics and the rise of secular nationalism took root in the 1960s, catalysed by the 1969 mass uprising. Yet its promise was short-lived, lost to division and self-interest.\nSince the 1990s, broken promises and a collapse in values have thrown political conduct into disarray. For idealistic politics to thrive, democracy must start within the party. Transparent leadership selection is essential. A party's internal structure signals what kind of governance it offers. In most parties, including the BNP, power remains concentrated in one leader. With such centralised control, democratic practices, accountability, and open debate are virtually absent. One can get a sense of the knowledge or the lack of it among our political parties, just from listening to their speeches.\nEven the allocation for this sector is meagre. Each year, the police and administration receive more funds to uphold public order. But literature and culture, essential for mental discipline and values, are largely ignored. Culture teaches us to think, build a refined society, and tackle social problems like child marriage or sexual harassment. Yet the cultural budget remains under one percent.\nHowever, most political leaders remain silent on this issue. Most parties lack any cultural agenda. A few poets and educators speak out, but their words go unheeded. I've listened to 24 or 25 speeches by BNP, National Citizen Party, and Jamaat in recent months—not one addressed cultural identity, libraries, or the value of reading. Elections, reforms, and constitutions dominated the conversation. Culture was barely mentioned, if at all. So what do we do when politicians continue to shun culture?\nSadly, there is also a lack of comprehensive data on cultural institutions. The National Information Portal lists every district's mosques, temples, schools, and madrasas—but not libraries or cultural clubs. We have data on farmland and NGOs, but none on cultural practice.\nThere are 71 government-run libraries in the country. In addition, 1,532 privately run libraries are officially registered. The Bangladesh Granthasuhṛid Samiti counts 1,376 private libraries. The Pathagar Andolon Bangladesh claims there are 2,500 in just 47 districts. Yet, no government body has a complete list.\nThe Department of Public Libraries under the Ministry of Cultural Affairs is responsible for the 71 government libraries. The Jatiya Grantha Kendra, also under the culture ministry, sponsors private libraries. According to the ministry, private libraries receive annual support—half in funds and half in books. In FY2021, 1,010 libraries received grants ranging from Tk 35,000 to Tk 56,000. The total budget was Tk 4.5 crore, which was 0.0008 percent of the national budget for F 21.\nWhether holding a book or reading on a screen, people must continue to acquire knowledge. Audio counts too—what matters is being informed. For sustainable development, we need to develop a reading culture. To build a knowledgeable and empowered nation, we must invest in public and digital libraries. Serajul Islam Choudhury stresses that the state must support privately founded libraries, increase funding, train librarians, and encourage businesses to invest in this venture.\nHe observes, \"Everyone says we are moving forward, but in which direction? We must remember that a large part of development is culture, and libraries are part of that culture. Libraries help people learn. Without mental well-being, development is unsustainable. And for that, books and libraries play a vital role.\"\nWho then should take the initiative to build a knowledge-based society—the citizen, the political party, or the state?\nPhilosopher Hannah Arendt believed one of politics' key roles is to turn people into active citizens. Over the past fifty years, we've seen the opposite. Yet, I hold hope in the youth and look forward to the youth-led party NCP, which broke the family-based political tradition, to focus on knowledge, engaging with ideas, and practising their own cultural values. Politics, at its core, is about fighting the right battles at the right time, along the path of history.\nEmran Mahfuz is a poet and convener of Abul Mansur Ahmad Smrity Parishad.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Why shy away from prioritising culture?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/why-shy-away-prioritising-culture-3910181",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-06-2025"
    },
    {
        "full_article": "The ordeals faced by many Dhaka dwellers on Thursday and Friday, who experienced heavy rainfall due to a depression at the Bay, give an idea of the suffering we may face in the coming days. Many commuters were stuck in traffic jams throughout the city for hours, while others had to navigate the precarious roads that became waterlogged. Continuous rain submerged many areas such as Shantinagar, Mirpur, Shewrapara, Green Road, Nilkhet and parts of Old Dhaka.\nDhaka's horrendously poor drainage system has continued to be a bane for its dwellers despite the ambitious Tk 262 crore investment by the two city corporations over four years (till 2024) to solve the waterlogging problem. The project included constructing 334.19 km of drainage infrastructure, including culverts and drains.\nBut the main reason for Dhaka to experience such debilitating waterlogging is the indiscriminate filling of water bodies and canals, a result of unplanned urbanisation and corruption of authorities responsible for preventing encroachment. Flood flow zones have been filled up, so there is nowhere the water can be held during heavy rains. A report published by this daily cited a study that revealed Dhaka has lost 3,440 acres of its designated flood flow zones, retention areas, and water bodies. Although some canals have been cleaned recently, the problem still persists as tertiary drains connected to them have not been upgraded.\nExperts have stressed that the WASA 2015 Drainage Master Plan needs to be revised in keeping with the changing rain patterns caused by climate change. We urge the authorities to prioritise the cleaning and desilting of canals and other water bodies and making sure that whatever flood flow zones remain are free from encroachment. The drainage network also needs to be expanded to cover all areas. Both city corporations must devote their efforts to carry out these cleaning drives.\nFuture infrastructure development, moreover, must be more resilient and should include elevated roads, flood barriers, and efficient drainage systems. All urban development in the future must be in alignment with flood risk management. The authorities must also create awareness among the public about not littering water bodies. Fines should be introduced for littering and blocking drains and canals. As residents of the city, we also have a responsibility to keep it clean and free from waterlogging.\n",
        "headline_1": "Dhaka still not prepared for the rains",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/dhaka-still-not-prepared-the-rains-3907986",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 04, 2025 00:00:00  \nAs expected, the national budget for the 2025-26 financial year, unveiled by Finance Adviser Dr Salehuddin Ahmed on Monday last, lacked the usual ambience, uproar, and thumping of tables by lawmakers -- whether elected genuinely or otherwise -- in parliament. Yet many listened to the budget speech, concise and pointed, with rapt attention, for the 'Chancellor of the Exchequer' and his associates in the Ministry of Finance had to craft the budget against a very uncertain and difficult backdrop. The interim government was lucky to have nearly 10 months to clear, at least partially, the Augean stables left by the fascist government of Sheikh Hasina before unfurling the budget.\nThe interim government inherited a near-collapsed economy marked by runaway inflation, many near-empty banks, a collapsing stock market, a higher rate of joblessness and forex reserves that were not enough to meet even a couple of months' import. Most areas of the economy are not out of the woods, though inflation has slowed down and reserves are now in a better shape because of higher inflow of remittances and export proceedings, thanks to the plugging of the leakages. What, however, has handicapped the finance adviser is that his purse is tight. Unlike his predecessors, Dr Salehuddin has taken note of this ground reality while preparing the budget and consciously avoided rhetoric and populist moves. Thus, none would contest his claim that the budget he has presented is an exceptional one, in terms of its size. It is also true that the budget in its core intent is not 'growth-centric'. However, the allocation of resources in the budget does not corroborate the finance adviser's claim that he has emphasised the concept of holistic development. For instance, the allocation of a higher amount of budgetary resources (22 per cent of the total operational expenditures) on payment of salary, allowances and pension of public servants cannot be a part of a holistic development approach, given the quality of service the latter offer. Allocations for a few other sectors do not also conform to the concept in question.\nThen again, the success of the measures taken in the budget for the next fiscal in reversing the ongoing trend in inflation and employment remains in doubt. Containing inflation is one of the core objectives of the budget. The central bank has been doing its part to contain the runaway inflation by pursuing a contractionary monetary policy. The government also took a few complementary fiscal measures. Inflation has come down albeit at a very slow pace. Supply-side distortions and law and order issues do play a very crucial role here. Thus, the price situation remains unpredictable. It is unlikely that there would be any notable improvement in the short-term, as threats of floods and excessive rains loom.\nA few recent studies, official or otherwise, have highlighted the rising unemployment because of the persistent slowdown in investment, both private and public. The reduced size of the upcoming annual development programme offers little hope of making any notable contribution to the labour market. Naturally, the private sector is not in the mood to boost investment in a situation marked by high lending rate and political uncertainty. The latter, apparently, has gone into hibernation and won't wake up until the takeover by an elected government. So, no silver lining is visible on the horizon as far as the reversal of the employment situation is concerned. \nWhen inflation remains well above the tolerable level, the budget offers no relief for the middle-income taxpayers. The tax-free income ceiling remains unchanged at Tk. 0.35 million in the next fiscal since it was predetermined by the Hasina government last year. However, the tax rates he has proposed for the fiscal years 2026-27 and 2027-28 would prove to be a burden for middle-income taxpayers. The budgetary proposal to levy 1.0 per cent turnover tax on firms, irrespective of their loss or profit, at the end of any fiscal year would surely hurt businesses. Businesses have to pay other taxes, including VAT. Firms in the red at the end of any fiscal year will also have to pay taxes, thus, eating into their capital. \nKeeping in view the LDC graduation timeline, the finance adviser has proposed lifting tax exemptions now being enjoyed by some locally produced items. Though the producers concerned would face a few challenges, such exemptions cannot continue unendingly. But this being a piecemeal measure is unlikely to leave any major impact. The government instead should come up with a comprehensive strategic paper to deal with the post-graduation challenges in the manufacturing sector. The measures proposed in the budget are bold but more needs to be done in this particular area.\nThe tax revenue projection for the next fiscal appears too ambitious, given the situation prevailing in areas of revenue mobilisation during the current year. A large shortfall against the revised target is feared. Tax collection has come to a virtual halt lately because of the unrest among NBR employees centring around the bifurcation of the tax administration. The situation has not yet settled down fully. It is hard to expect mobilisation of the projected tax revenues with this kind of situation in place. \nThere has been a persistent demand for lowering the corporate tax from businesses. The interim administration instead of going wholesale has decided to benefit the listed companies, apparently, to woo more private companies to the country's bourses. How far this move works remains to be seen, for some other factors have been preventing companies from coming to the stock market. The propensity to maintain the family control is viewed as a major disincentive to listing of private companies with bourses.\nFinally, looking at the intent and content of the proposed budget, one might have a feeling that the finance adviser was in two minds while crafting the budget because of the demands of a conflicting nature coming from different quarters and inherent structural deficiencies. Under the prevailing circumstances, he will have to chart a difficult path, as the economic recovery though happening at a snail's pace remains fragile. Many banks are still struggling and inflation is on the higher side. The movement of inflation would largely depend on many internal and external factors, a stable exchange rate being at the top of those.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "FY'26 Budget: Conventional but rooted in ground reality",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/fy26-budget-conventional-but-rooted-in-ground-reality-1748968233",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       June 04, 2025 00:00:00  \n\nWith the world's population rising rapidly, the challenge of feeding billions of hungry mouths has reached a critical point. Meeting this demand will require a dramatic increase in agricultural productivity -- nearly double the current levels -- within the next decade. Achieving this feat calls for a transformative shift in agricultural practices, moving beyond conventional methods to embrace scientific innovations, most notably those related to biotechnology.\nThe imperative to reinvigorate agricultural research has gained prominence across the globe. Not only in countries where arable land is limited, but even in those with abundant farmland, biotechnology is being recognised as a vital tool for increasing crop yields and ensuring food security. The past few decades have seen unprecedented advancements in agricultural technology, leading to significant changes in cultivation practices and substantial increases in the yield of nearly all crop varieties.\nIn Bangladesh, the agricultural landscape has evolved from purely traditional practices to a mix of conventional and semi-intensive methods, largely influenced by the commendable efforts of local researchers. These efforts have yielded results -- particularly in developing high-yield seed varieties and promoting balanced fertiliser use -- but yet to make a substantial leap in productivity. The next logical frontier is the adoption of genetically modified (GM) crops, which have been successfully deployed in many countries to boost output and combat environmental stresses.\nAs a land-scarce country with a growing population, Bangladesh faces the pressing need to maximise productivity not only of staple grains but also of horticultural crops that diversify diets and enhance nutrition. The country has witnessed a remarkable threefold increase in grain production between 1975 and 2020. Despite this success, the sector grapples with numerous structural constraints: small and fragmented landholdings, declining soil fertility, and stressors such as drought, salinity, and periodic flooding. Moreover, the availability of cultivable land is shrinking steadily due to urbanisation and environmental degradation. Presently, Bangladesh has only 8.3 million hectares of land available for crop production.\nIn this challenging context, experts increasingly advocate for biotechnology as a means to overcome yield barriers and environmental stresses. Biotechnology offers powerful tools not just for agriculture but also for allied sectors like fisheries, livestock, forestry, food processing, and pharmaceuticals. It is widely seen as a cornerstone of sustainable agricultural development in the 21st century.\nOver the past few decades, technological advancement and agricultural modernisation have gone hand in hand. Notably, breakthroughs in genetic engineering have allowed scientists to manipulate crops at the molecular level to improve yield, resilience, and nutritional value. These advancements have largely benefited developed countries, where food security is taken for granted. In contrast, developing and underdeveloped nations continue to grapple with hunger, malnutrition, and poverty. Therefore, it is imperative to formulate inclusive policies that ensure biotechnology benefits reach the global south, helping it to enhance productivity sustainably and equitably.\nBiotechnology has enabled the development of crops with enhanced qualities such as disease resistance and drought tolerance. By identifying and transferring beneficial genes from one species to another, researchers have created crop varieties that can withstand harsh environmental conditions and pest attacks. This has significantly reduced reliance on chemical pesticides, thereby lowering production costs and minimising ecological damage. For instance, genetically modified varieties of corn, cotton, and potato have been engineered to produce proteins that are toxic to specific insect pests, offering built-in protection. In some cases, these bioengineered crops offer superior and more cost-effective pest control than traditional chemical methods. Farmers benefit from increased yields and lower input costs, while consumers gain from stable food supplies and potentially lower prices.\nHowever, despite the promising advantages, concerns have been raised about the possible long-term effects of transgenic crops on human health, biodiversity, and ecosystems. Critics argue that insufficient attention has been paid to these issues, urging a more cautious and evidence-based approach. This is a valid concern that underscores the importance of robust regulatory frameworks and rigorous scientific evaluation before the widespread adoption of genetically modified organisms (GMOs).\nIn Bangladesh, where biotechnology is at a nascent stage, a careful yet proactive strategy is essential. The country's scientific community must strike a balance between innovation and caution, ensuring that bio-safety protocols are strictly followed while fostering an enabling environment for research and development. Public awareness campaigns, transparent communication and stakeholder consultations are critical to building trust and acceptance of biotechnological innovations among farmers and consumers.\nUltimately, the road to agricultural sustainability and food security cannot ignore the potential of biotechnology. By integrating biotechnological solutions with ecologically sound agricultural practices, countries like Bangladesh can hope to meet the dual challenge of feeding a growing population and preserving natural resources.\nThe future of agriculture lies in smart innovation -- one that merges science with sustainability, technology with tradition, and productivity with ecological balance. Biotechnology, if responsibly harnessed, could very well be the catalyst that takes agro productivity to its next frontier.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Biotechnology to boost agro productivity",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/biotechnology-to-boost-agro-productivity-1748968361",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 04, 2025 00:00:00  \n\nBangladesh, the world's second-largest exporter of garments, has significantly shaped the global fashion industry by supplying affordable, high-quality clothing. However, this achievement comes at an environmental cost. The country's ready-made garment (RMG) sector generates an estimated 400,000 tonnes of textile waste annually -- large share of which consists of high-quality surplus fabric from production lines. While some of this waste is exported to recycling hubs like India, much of it ends up in landfills or is incinerated, contributing to serious environmental hazards.\nAmidst this challenge, a promising solution is emerging. Innovative startups are now working to turn this so-called \"waste\" into a valuable resource, aiming to drive sustainable fashion, create green jobs, and build environmental resilience. As the global fashion industry -- responsible for nearly 10 per cent of carbon emissions and vast resource consumption -- shifts towards sustainability, Bangladesh is uniquely positioned to lead through a circular textile economy.\nBy recovering and repurposing its textile waste, the country has the potential to generate up to $5.0 billion annually. This opportunity spans across recycled yarn production, repurposing initiatives, digital resale platforms, and eco-conscious fashion startups. Such a shift could create thousands of jobs in sorting, logistics, and design, and empower rural women and youth to become entrepreneurs in the green economy.\nHowever, this transition requires strong foundations: structured waste management, transparent reporting, enhanced recycling infrastructure and robust policy support. If government bodies, industry leaders, and innovators act in concert, Bangladesh can evolve from a volume-driven exporter into a global leader in sustainable fashion.\nThis transformation proves that economic progress and environmental responsibility need not be at odds. The revolution has already begun. Now is the time for Bangladesh to embrace its role at the forefront of ethical fashion and circular economy.\nMonem Shahriar\nGazipur\nmonem.anik@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Textile waste to fashion product",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/textile-waste-to-fashion-product-1748968387",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 04, 2025 00:00:00  \n\nAs reported by the Oxford Internet Institute, Bangladesh has emerged as a significant player in the global freelance market, ranking among the top 10 countries for online labour. With over 650,000 freelancers and a tech-savvy youth population, the country has successfully leveraged platforms such as Upwork, Fiverr, and Freelancer to connect with international clients. As artificial intelligence (AI) becomes increasingly prominent, the freelance industry is evolving. Experts call this shift Gig Economy 3.0, where AI tools enhance freelancers' daily work, boosting efficiency, quality, and scalability.\nAn increasing number of freelancers in Bangladesh are using AI-powered tools to generate content, write code, design websites, analyse data, and translate languages. Platforms like ChatGPT, Midjourney, and Copilot are enabling them to complete more work in less time, giving them a competitive edge in the global marketplace. However, this transformation also presents new challenges. As automation accelerates, basic digital tasks are being completed more quickly, potentially threatening the earnings of those who fail to keep up. Participating in today's freelance economy now demands proficiency in AI, creative thinking, and adaptability.\nTo remain competitive, Bangladesh must rethink its strategy. Government agencies, businesses, and educational institutions need to collaborate to deliver AI-focused training to freelancers across both urban and rural areas. Initiatives like the Learning and Earning Development Project (LEDP) are steps in the right direction but must pivot more decisively towards AI education. By offering targeted support, Bangladesh can enable its workforce to shift from low-paying gigs to high-value, AI-driven freelance opportunities. Nations that embrace Gig Economy 3.0 stand to retain their position in the global freelance arena and lead the way into the digital future.\nJannatul Ferdous\nDepartment of BBA\nNorth South University\nferdousjannatuljannat19@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Gig economy 3.0: Freelancers embracing AI",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/gig-economy-30-freelancers-embracing-ai-1748968409",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-06-2025"
    }
]