[
    {
        "full_article": "Fourteen people, two of them children, were killed and 13 injured in a hotel fire in the Mechua market area of Burrabazar in central Kolkata on Tuesday (April 29, 2025). The fire engines had trouble accessing the congested area. It appears, yet again, that many of the victims were asphyxiated — smoke is as much a deadly killer as the flames themselves. Smoke quickly rises up and escape would require reaching the bottom areas of the building. The six-storey hotel had only one stairway, and the fire that broke out on the first floor cut off escape. One person died after jumping from the building. That there were no other accessible means of escape is, in and of itself, a violation of fire safety norms. On Thursday, a similar tragedy unfolded in Rajasthan’s Ajmer, a historic town. Fire broke out in a five-storey hotel in which four persons died. Some guests tried to jump out of the windows, and fire engines had trouble accessing the congested area.Devastating fires in congested buildings leading to tragic loss of lives and property have become a disturbingly routine phenomenon across India, especially in Kolkata. There, Opposition leaders have rightly listed at least eight major fires in the last decade and half, starting with the AMRI hospital fire in 2011 that claimed 89 lives. West Bengal Chief Minister Mamata Banerjee has spoken about a gas cylinder explosion after the Tuesday fire. She too has talked about there being only one staircase. Ms. Banerjee has characterised such fires as accidents that could not have been prevented. But the tragedies, in Ajmer and Kolkata, were entirely preventable and mitigation could have been far more efficient. Many of India’s cities and inner cities of metropolises continue to see high volume business activities but their safety features are outdated. They do not comply with current fire and structural safety norms. Fire escapes and emergency exits are non-existent and the structures use highly flammable materials from another era. Unlike other metropolises that have seen some redevelopment of inner cities in recent decades, Kolkata seems to have missed that phase. Immediate solutions can include maintaining low-height sidewalks to allow fire engines to get closer to building fronts, retrofitting fire retardant materials in buildings, and considering the use of retractable metallic staircases to serve as emergency escapes outside the buildings after careful evaluation by fire safety authorities. There is also a case for equipping firefighting teams with more breathing apparatuses so more personnel can rescue people in distress in such structures since their limited access routes may be smoke-filled.\r Published - May 03, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        fire\n                    \n                            /                      \n                        \n                        Kolkata\n                    \n                            /                      \n                        \n                        hospital and clinic\n                    \n                            /                      \n                        \n                        disaster management\n                    \n                            /                      \n                        \n                        Rajasthan\n                    \n                            /                      \n                        \n                        West Bengal",
        "headline_1": "​Fire and smoke: On fire-safety norms and buildings in India",
        "headline_2": "Old structures in cities must be made fire-safety compliant",
        "link": "https://www.thehindu.com/opinion/editorial/fire-and-smoke-on-fire-safety-norms-and-buildings-in-india/article69530942.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-05-2025"
    },
    {
        "full_article": "After painstaking negotiations, marked by inflammatory exchanges, Washington and Kyiv have signed an agreement that would grant the U.S. access to Ukraine’s critical mineral and oil and gas resources through a joint investment fund. Ukraine has claimed that it would lead to an equal economic partnership, while its actual impact remains uncertain. The idea of a minerals deal was proposed by Ukrainian President Volodymyr Zelenskyy last year to the Biden administration as part of his “victory plan”. His pitch was to open up Ukraine’s vast untapped critical minerals resources (which include lithium, graphite, uranium and titanium, besides rare earth minerals) in exchange for continued American military support and security guarantees. After Donald Trump assumed the presidency, he supported a minerals deal, but an entirely different one. He insisted that Kyiv repay the billions of dollars provided as military and economic assistance during the war by granting U.S. companies access to Ukraine’s resources. At one point, the disagreement escalated into a public spat at the Oval Office between Mr. Zelenskyy and Mr. Trump. But both sides pressed ahead, which culminated in the April 30 deal.For Ukraine, the agreement represents an improvement over Mr. Trump’s previous proposals. There is no reference to aid as debt in the fine print. Under the deal, the United States-Ukraine Reconstruction Investment Fund will finance extraction projects in Ukraine’s resources. Kyiv will share 50% of the revenues from these projects towards the fund. While the agreement omits any reference to past U.S. aid, future American assistance will be considered as capital contributions to the fund — Ukraine will have to repay future aid through resource revenues. More importantly, although Mr. Zelenskyy originally envisioned a minerals deal as a pathway to securing security guarantees from the U.S., the final agreement offers no explicit American security commitments to Kyiv. Ukrainian officials have portrayed the deal, which needs to be ratified by Parliament, as a win-win. But it actually underscores Kyiv’s growing vulnerabilities in a war that shows no sign of abating. Mr. Zelenskyy and his generals are aware that if American support dries up, their embattled forces would be in peril. And Mr. Trump has already rejected Ukraine’s most pressing demand — firm security guarantees. Facing limited options, Ukraine has signed the agreement in the hope that it would at least ensure continued flow of U.S. military assistance in the form of U.S. investments to the fund. But Mr. Zelenskyy’s minerals gamble will pay off only if the Trump administration stays committed to helping end the war. If the war drags on, with Russia forces continuing to advance in the east, the minerals deal would mean little for Ukraine’s security. Published - May 03, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Ukraine\n                    \n                            /                      \n                        \n                        critical minerals\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        rare earths\n                    \n                            /                      \n                        \n                        defence\n                    \n                            /                      \n                        \n                        investments",
        "headline_1": "​Minerals gamble: On the U.S.-Ukraine mineral deal",
        "headline_2": "The pact with the U.S. does little for Ukraine’s security",
        "link": "https://www.thehindu.com/opinion/editorial/minerals-gamble-on-the-us-ukraine-mineral-deal/article69530900.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-05-2025"
    },
    {
        "full_article": "If a national count starkly demonstrates that powerful chieftains of social groups are no guarantee for their base’s economic empowerment, these netas’ political influence may go down\nHarping on caste in modern-day India could re-legitimise and reinforce an institution that modernity has rendered illegal and the Constitution and its democratic order have put beyond the pale of law, say many conscientious objectors to the caste census. Some would find this naïve.\n\nMore to the point, objections to the caste census ignore the possibility that the findings of such a census could mark the beginning of the end of caste politics.\nRead the full story on TOI+.\n\n",
        "headline_1": "Will caste census kill caste politics?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/will-caste-census-kill-caste-politics/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-05-2025"
    },
    {
        "full_article": "Civil aviation in India is a rare business where gender disparity has come down. To quote just one number: proportion of women pilots in India is more than double the global average\nThere was a time when a woman’s voice over the aircraft speaker was almost certainly delivering a safety demonstration or meal announcement. Today, it is just as likely to be your captain from the flight deck.\n\nIndia’s aviation sector has quietly achieved what many industries are still struggling to envision – a workforce where women are not only present but are increasingly thriving.\nRead the full story on TOI+.\n\n",
        "headline_1": "Where women are flying through the glass ceiling",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/where-women-are-flying-through-the-glass-ceiling/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-05-2025"
    },
    {
        "full_article": "By Minoru Harada\nWe are living in an age of ceaseless turbulence. In such times, the mind easily spirals into anxiety and impulsive reactions. Trying to achieve emotional stability while facing rough seas of society could be one of the reasons why living mindfully – pausing to reflect – is gaining popularity.\nThe 13th-century Buddhist priest Nichiren urged us to ‘become masters of our minds, rather than letting our minds master us’, teaching the importance of building an unwavering self that is not swayed by the fickle nature of human emotions.\nThese days, the constant barrage of information often leads to mental exhaustion. In contrast, the Buddhist principle of mastering one’s mind empowers us to reclaim our mental focus. It could be defined as the discipline of directing our attention to the present, free from the weight of past regrets or future fears. In doing so, we begin to tap into our own innate wisdom and compassion – igniting an inner transformation that reshapes how we relate to ourselves and others.\nMahabharat offers a profound example of mindful leadership through the story of Yudhishthir and Yaksh.\n\nConfronted with the sudden loss of his brothers and a life-or-death challenge from a mysterious being, Yaksh, Yudhishthir does not act out of fear or grief. Instead, he quietens his mind and responds with thoughtful clarity. When given the chance to revive just one brother, he does not choose one of his most powerful brothers but instead selects his stepbrother Nakul, showing consideration toward his mother and his stepmother.\nMoved by this choice, the Yaksh eventually revived all of Yudhishthir’s brothers. This was because Yudhishthir’s decision was not driven by emotion, but by concern for others, demonstrating not only selfcontrol but also deep compassion and commitment to justice.\nThis story reminds us that true mindfulness is more than staying calm – it is using that calm to act with wisdom and a sense of social responsibility. In times of chaos, it is easy to be swayed by fear or self-interest. But when we become the master of our mind, our inner state expands, and we can tap into and act on our wisdom. Even in difficult times, when we act with compassion, we can contribute to a more harmonious world.\nOn a daily basis, we face such crossroads, where the chaos of our turbulent times demands thoughtful, value-based responses. Anchoring the mind is the first step toward true happiness and fulfilment. Buddhism encourages us to go further. It is not enough only to seek personal tranquility or detachment. A more fulfilling way to live is to build a towering and indestructible state of life, with the spirit of growing together with others and contributing to a more humane society. Then even adversity can become an opportunity to create value.\nIn the words of my mentor, Soka Gakkai international president Daisaku Ikeda, “As we work for the greater good, we build happiness for ourselves and others. The more we do for other people, the more path of our own happiness will open up.”\nThe writer is president, Soka Gakkai, a global community-based Buddhist organisation\n\n",
        "headline_1": "Living mindfully in times of chaos",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/living-mindfully-in-times-of-chaos/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-05-2025"
    },
    {
        "full_article": "Some protesters are seen and heard, others swatted\nThe number 50501 may mean nothing to you, or suggest a pair of jeans, or an internet error, but it made a splash in America on Thursday, which happened to be May Day, a.k.a. Labour Day. Reports say thousands of protests were held all across, from NYC to LA, under the 50501 banner, which is short for ‘50 protests, 50 states, 1 movement’. Typical of modern movements, Fifty-Fifty-One started on social media, and has been aiming at Trump’s policies since Feb. For May 1, the theme was ‘Stop the Billionaire Takeover’, but all causes – tariffs to deportations – were aired. Such mobilisation is not unheard of in America, which was the battleground for an eight-hour workday about 150 years ago. But it’s unusual now when worker unionisation is down to 11%.\nThe irony is that the mecca of capitalism, America, is re-embracing May Day while communist China cares two hoots about workers’ rights. Part of its vaunted efficiency is down to scale, but 12-hour workdays – the ‘996’ culture – and cut-price wages also make American manufacturing uncompetitive. Chinese workers should learn from Trump, who, in his first term, was said to reserve three hours every morning for TV, calls and tweeting, and regularly take “executive time” for more of the same through the day. Meanwhile, Trump might itch to emulate Erdogan, who marked May Day with a lockdown in Taksim Square and a crackdown on protesters. Hopefully, he wouldn’t.\n\n",
        "headline_1": "May Day minutes",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/may-day-minutes/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-05-2025"
    },
    {
        "full_article": "A report in this paper on the occasion of World Press Freedom Day paints a worrisome picture. So far, 266 journalists face criminal cases, such as murder, attempt to murder, or assault. The bulk of these cases are related to the Awami League (AL) government's brutal clampdown on the student-led July-August uprising. The indiscriminate filing of criminal cases against journalists, along with other people perceived to be supporters of the AL, is a serious blow to press freedom and a violation of people's constitutional rights.\nMany journalists are being lumped together with those who were directly responsible for ordering the shooting of protesters or being involved in the murders during the July-August uprising, which indicates that these cases have been filed due to personal and political vendettas. According to a report by this daily, only about 50 of the journalists prosecuted were politically aligned with the AL or benefitted from the regime. The majority were victims of retaliatory cases.\nMany of the cases are against journalists working in districts other than Dhaka. In Brahmanbaria, for instance, retaliatory cases were filed against 16 journalists centring on crimes committed during the July-August movement and the protests during India's Prime Minister Narendra Modi's visit to Bangladesh in March 2021. A murder case has been filed against 14 journalists on allegations of electrocuting a boy to death. One journalist has been accused of intentionally connecting live wires to the bamboo and electric poles on the streets where the protests took place, leading to the student's death. The same journalist had previously been arrested during the AL regime under the Digital Security Act for his reporting on the 2018 national election and had to fight the case for two years.\nThese examples show the arbitrariness of these cases and the fact that the police readily accepted them regardless of how flimsy the premises were. The law adviser has said that the government cannot prevent anyone from filing a case, though the government has previously said that it will take legal action against individuals filing false cases and harassing people with lawsuits. No action was taken in this regard. The ground reality is that these cases continue against journalists and others. The government must show that it is serious about taking action against those individuals filing cases that are false and retaliatory. This is nothing but harassing journalists and creating an atmosphere of intimidation and fear.\nSome journalists did play a partisan role and even went to the extent of tacitly supporting the AL regime's crackdown on protesters. Their roles should be clearly identified. But can they be held as liable for murder in the same way as those who were directly involved? Moreover, if justice is to be delivered, it is imperative that the cases against those who are in jail, some of them for many months, are disposed of through due process and without any kind of external influence. So far nothing has been done about these cases and those journalists are rotting in jail.\nAccording to this year's Press Freedom Index, Bangladesh has moved up 16 notches and is ahead of India and Pakistan. Being 149th (from 165) in the world rankings does indicate progress but it is not something to write home about, especially when journalists continue to be haunted by retaliatory criminal cases.\n",
        "headline_1": "Stop retaliatory cases against journalists",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/stop-retaliatory-cases-against-journalists-3885846",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-05-2025"
    },
    {
        "full_article": "In what many commentators have dubbed the most consequential federal election in Canada since the end of World War II, voters turned out in numbers not seen since 1988 and handed a decisive, though incomplete, mandate to the governing Liberal Party on April 28, 2025. It is the fourth consecutive term for the centrist Liberals, who reclaimed strength under new leadership just months after their political brand appeared on the verge of collapse.\nMark Carney, a technocrat with no prior electoral experience and a heavyweight in international finance who served as governor of both the Bank of Canada and the Bank of England, assumed office as Prime Minister in March 2025 after Justin Trudeau resigned following nine years in power. Carney, known for his climate-focused economic thought leadership, public service background, private sector expertise, and crisis management credentials, led his party to 169 seats and 43.7 percent of the popular vote.\nHis principal opponent, career politician Pierre Poilievre, lost in his own riding in a stunning upset but led the Conservatives to their highest vote share in the party's modern history. With 41.3 percent of the popular vote and 143 seats, the Conservatives came within reach of forming government. The electorate split almost evenly, resulting in a minority mandate for the Liberals. The campaign was shaped by contrasting resumes, competing leadership styles, and foreign pressure against the backdrop of an economic assault from the United States.\nThe leftist New Democratic Party, which had propped up the Liberals through formal and informal supply and confidence agreements, fell from being the third-largest party by popular vote to just seven seats. A significant portion of its voter base moved to the Liberals. So did a sizable bloc of voters from the separatist Bloc Quebecois. Many in the Francophone province of Quebec—the Bloc's stronghold—crossed ideological lines to block Poilievre from forming government. Both trends reflected a consolidation of progressive support toward the Liberals and effectively resulted in a two-horse race between them and the Conservatives, confirming this election as a referendum on leadership at an inflection point in Canadian history.\nA Liberal recovery of this magnitude has surprised most. When Trudeau announced his resignation, the Liberals were polling below 20 percent, and his personal popularity had flatlined. His departure came shortly after Donald Trump returned to the American presidency and launched a tariff war, beginning with Canada and Mexico and then expanding globally. Trump mocked Trudeau as a governor, not the Prime Minister of a sovereign country, and has to date continued floating the idea of annexing Canada as the 51st American state.\nIn hindsight, Trudeau's resignation was well-timed. In the short period between his departure and Carney's appointment, Trudeau re-emerged as an outspoken critic of Trump, delivering pointed rebukes that quickly helped rehabilitate both his personal standing and that of the party. Then came Carney, an economist by training who led Canada's central bank through the 2008 financial crisis and guided Britain's central bank through the uncertainty of Brexit. His appointment felt not only appropriate but imperative.\nCarney sought to distance himself from Trudeau. He presented himself as a fundamentally different person with a distinct vision and skill set. He did not campaign on Trudeau's record but on the promise of steadier economic management and sharper foreign policy. Still, Liberal strategists reminded Canadians that the set of circumstances Trudeau had to confront was unprecedented in scope and scale and pointed to four defining moments that shaped his legacy.\nFirst, Trudeau successfully renegotiated a free trade agreement with the first-term Trump administration and Mexico. Second, he led Canada well through a once-in-a-century pandemic, delivering one of the lowest death rates in the developed world while rolling out emergency social assistance payments to individuals and businesses rapidly, which kept the economy afloat. Third, he managed inflationary shocks driven by global supply chain breakdowns due to the war in Ukraine. Fourth, he mounted fearless resistance to renewed attacks on Canadian sovereignty during the initial days of Trump's second term.\nThese reminders were meant to draw contrast, not continuity, and were deployed to push back against Conservative talking points that cast the Liberals as the sole architects of national decline. They positioned Carney as a reset, not a repeat. Poilievre had spent years reshaping the Conservative Party and was widely expected to win before Carney entered the race. His message was clear-eyed and focused on housing, crime, inflation, immigration, taxation, health care, and government spending—all issues that Canadians care deeply about and want Ottawa to act on.\nPoilievre's campaign resonated with Canadians who felt overlooked or priced out, but the momentum faltered. His tone, often combative, cast civil servants as adversaries and leaned into class-war rhetoric. His characteristically ultra-right-wing slogans echoed Trump's populism and drifted into culture-war themes, unsettling moderates and centrists. The message may have landed, but the tone cost him. He appeared polarising at a time when many voters were seeking stability. Bottom line: when Canadians wanted him to act prime ministerial, he remained an opposition leader–style attack dog.\nCarney focused on the need for experienced hands at the helm of the state. He argued that Canada faced an existential threat from the United States and needed composed, subject-matter expertise to confront it. Poilievre struggled to reorient the race. His platform remained fixed on credible domestic frustrations, but he did not broaden the conversation to the extent required to reflect Canada's external vulnerabilities. Many voters saw in him a candidate with well-defined grievances, but not someone best suited to take on Trump. His appeal felt reactionary rather than forward-looking, and a plurality of voters opted for competence over confrontation.\nCarney can be described as fiscally conservative and socially liberal. He has promised to cut wasteful spending, boost defense-related investments, strengthen interprovincial trade, and modernise economic policies while preserving signature Trudeau-era social policy programmes such as national childcare and dental care. He is viewed as a centrist, drawing support from pragmatic progressives and cautious conservatives alike.\nBut his most difficult domestic challenge may be Canada's decentralised political architecture. Carney has indicated the need to build what he calls one economy: a more unified pan-Canadian approach to productivity, energy investment, and infrastructure. Canada's political system gives provinces and municipalities wide policy and political autonomy, which brings benefits but also creates tangible coordination gaps.\nProvinces like Alberta—an energy superpower where resentment toward the Liberals runs deep—present both political and economic hurdles. Carney has signaled a pivot from Trudeau's narrow focus on renewables to a broader clean energy strategy rooted in carbon capture, nuclear, hydrogen, and grid modernisation, alongside extensive investment in oil and gas infrastructure. He wants Canada to be an energy-dominant superpower committed to decarbonisation while pursuing cleaner non-renewable options, but that goal depends on collaboration. He will need to work much better than his predecessors ever did with premiers, mayors, and Indigenous governments.\nCarney has declared that the old Canada–United States special relationship, defined in the pre-Trump era by mutual trust, strategic cooperation, trade, and commerce, is now null and void. He has pledged to rebuild Canada's economic independence by diversifying international trade partnerships and reducing reliance on American markets. This posture has earned respect but will require a set of very ambitious, rapid, and creative policies backed by strong follow-through.\nAt home, the demands are just as intense. Housing is unattainable for millions. Healthcare systems remain under acute strain. Immigration continues to outpace infrastructure, workforce planning, and provincial coordination. Federal commitments have outstripped federal performance. Carney received a strong mandate with the task of restoring public trust in institutions—but without years of political apprenticeship to draw on.\nExpectations are high, and patience may be low, even though most Canadians understand that the next few years will be harder, not easier, with Trump's threats set in motion. Carney's outsider status in a traditional political sense, once framed as a vulnerability, proved to be an electoral strength. He came across as disciplined and untouched by years of partisan infighting. But in a minority parliament, those qualities will be tested. Arithmetic will shape the agenda. Cooperation will be necessary. Trump will force Carney to improvise. Fractures in the electorate will demand repair.\nThis election stamped, at least for now, Canada's departure from a growing global trend. While several liberal democracies and hybrid regimes veer toward authoritarianism and the far right, Canadians chose the political centre and capability over chaos. The result was neither celebratory nor revolutionary. It was a call for order in a volatile world, which is quintessentially a Canadian trait, and one buttressed by institutional resilience and a strategically minded electorate. Carney steps into office without a blank cheque, but with a clear instruction to deliver—and deliver quickly.\nThe Liberal win was less about the party and more about Carney. Canadians are banking on the former central banker because they believe he is the right man to meet the moment the country finds itself in—with the right set of skills and the right temperament. Bigger picture: Trump and his antics, combined with Poilievre's inability to adapt to the country's mood, helped deliver Carney's victory.\nMir Aftabuddin Ahmed is a public policy columnist. He can be reached at [email protected]. Views expressed in this article are the author's own.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Canada bets on the political centre and an economist",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/canada-bets-the-political-centre-and-economist-3885696",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-05-2025"
    },
    {
        "full_article": "I found it adorable when a visiting envoy fondly recalled that the Dhaka University campus reminded him of his home institution in the 1960s. There was another diplomat who mentioned to me that they were striving to preserve their old buildings, which resembled our administrative building, as heritage sites. A pattern of irony emerged. It is no coincidence that people think we are frozen in time.\nThen there was this Facebook post of a recent graduate recounting his valid concerns of not getting an equivalence certificate in time to complement his application for higher studies abroad. The DU registrar's office, he claimed, was taking an eternity to send an email. What use is a certificate if it remains unendorsed when necessary? A section of the press picked up the news and published an opinion piece, spotlighting the required reforms. The writer shared his experience of missing two scholarship opportunities in the 90s due to DU's failure to mail the official transcripts.\nIndeed, we seem to be stuck in the past. And it is no wonder that newer universities with a greater appetite to grow are outpacing us in ranking.\nAs a DU insider, I cannot shy away from my responsibilities. The frustrating pace at which things move at this university is as confusing as our traffic signal. The rule is there is no rule, yet there is an abundance of it. To quote one of our Chinese friends about our traffic system, \"You guys are so civilised that you don't need the traffic light. Meanwhile, we must maintain constant discipline.\" Why do we always have to be at the butt end of the joke? I use the perspectives of our foreign friends to show how reality is often different from the situation we have become comfortably attached to.\nThe other day, an ongoing protest by the polytechnic institute's students delayed a delegation. What's wrong with these students? Why do they seek to have their diplomas recognised as equivalent to a fully fledged engineering degree? Perhaps it's time to move past our initial reaction of \"how dare they\" and try to understand their concerns. The students from polytechnic institutes are not only demanding recognition as engineers, but also a comprehensive overhaul of technical education. They are seeking a technical university of their own, revision of their outdated curricula, removal of controversial appointments, and formation of a dedicated ministry for technical and vocational education.\n\nDeja vu. The seven colleges affiliated with Dhaka University staged a similar protest and managed to get a promise of a university of their own. At the heart of both protests lies the issue of dignity and progression. Even after pursuing a four-year programme, diploma graduates face stunted career growth and exclusion from higher education opportunities. It is the same time required for an engineering degree.\nUnlike their peers in public or private universities, polytechnic students often come from rural or lower-middle-class backgrounds. Denying the legitimacy of their demands due to age-old prejudice would be unfortunate. In a country starved of mid-level technicians and vocational experts, this systemic neglect of technical graduates is paradoxical and shortsighted. The equivalence of their degree should be on par with global practices. Students should have the right to know the outcome of a degree before joining a programme. Encouraging students to fight for their rights once they are in the system is a sign of poor educational policy. We pay policymakers to ensure the economic mobility of our graduates. The anti-discriminatory spirit with which the July uprising brewed is at odds with the inequality that persists and the way human capital is squandered, especially when Bangladesh should be harvesting its demographic dividend.\nThe much-talked-about youth bulge, with over 47 percent of the population under the age of 25 years, will not yield any automatic result unless there are strategic policies to create a healthy, educated, and skilled workforce. Our students don't view their education as transformational. The view that education is just a degree affirms its transactional nature. The repeated demands for reforms highlight an institutional limbo in which our young generation is trapped.\n\nPolytechnic graduates are recruited in government services with little scope for career progression, demonstrating an old mindset that wants to keep disparity intact. The same mindset favours placing faculty members at the bottom of the hierarchy. The inter-service friction within the government has exposed the tension. In the absence of incentives and in-service professional development, teachers and staff often remain underqualified and disengaged.\nIt will be a crime to miss the post-uprising zeitgeist and not to overhaul our educational sector. The interim government's failure to form an education reform commission is a mystery. Educational rupture often provides an opportunity to shake up the frozen system. Iran formed the Supreme Council of Cultural Revolution after the 1979 revolution; South Africa created the National Commission on Higher Education in 1995 in the post-apartheid era; Rwanda prioritised overhauling its technical and vocational education and training (TVET) systems following the 1994 genocide. The interim government's handling of the educational stalemate will prove very costly.\nEducation is more than skills or jobs; it is about belonging, dignity, and the capacity to shape the future. But our systems, especially the public ones, remain fossilised. Our public system continues to ignore the aspirations of its youth. The controlled protests may alienate our youth. History reveals that alienation can transform into apathy or unrest, which can swiftly escalate beyond control. The state must choose. It can allow the public universities to be a site of nostalgia and reminiscence about previous glory. Or it can take bold action: go beyond simply managing the crisis and transform the system. The cost of inaction will be paid not just in student frustration, but in lost generations. And foreign friends will come and visit us with dreamy nostalgia.\nDr Shamsad Mortuza is professor of English at Dhaka University.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The crisis of a fossilised education system",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/blowin-the-wind/news/the-crisis-fossilised-education-system-3885641",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-05-2025"
    },
    {
        "full_article": "We are concerned about the trend of filing dubious cases against individuals with alleged ties to Awami League, which persists even nearly nine months after the August 5 political changeover. Journalists have been frequent targets of this legal assault. According to a report, at least 137 journalists have been implicated in 32 criminal cases filed in Dhaka, Chattogram, Bogura, and Rajshahi over the July-August events—the latest of them registered at the Mirpur police station on April 20, accusing Sheikh Hasina and 407 others, including 24 journalists, of involvement in the killing of BNP activist Mahfuz Alam Shraban. In addition to murder and attempted murder, journalists have also been charged with unlawful assembly, rioting, abduction, vandalism, extortion, assault, and even genocide and crimes against humanity.\nAs a Supreme Court lawyer has noted, even in places where no student movement took place or no one died, journalists have been falsely implicated. Referring to the case of a journalist couple who were sued for murder, he noted that while journalists may have committed other offences for which they could be booked, a murder charge \"sounds vague.\" The argument that those who aided, committed or enabled July atrocities and those who extended moral support to the regime—through talk shows or speeches, for example—belong in the same bracket is not only legally tenuous; it also opens the door to abuse, complicates and likely lengthens the trial process, and invites question marks over the outcome of ongoing trials. The implication of actor Iresh Zaker in the Shraban murder case, alongside journalists, doctors, businesspeople, and lawyers, further illustrates that anyone is fair game in such a climate.\nThe Shraban case exemplifies how the right to file cases is being abused. Three individuals named as witnesses in the case have said they were unaware of being listed. The case statement lists eight in total, including the plaintiff, and provides the phone numbers of four. This newspaper spoke to all four; three of them denied any prior knowledge of their inclusion. The manner in which the whole case came into being—about nine months after the uprising, at the behest of \"an administrative office in Paltan,\" using false witnesses, and implicating hundreds merely for their \"support\" of Hasina—reeks of both personal/political vendetta and a broader campaign against those even loosely associated with the previous regime. Unfortunately, the current process for filing cases does not require police officers to verify claims at the outset, allowing anyone to lodge complaints. This is why the government's instruction to police not to harass or arrest anyone wrongly implicated offers little hope or protection in practice.\nFor journalists, this trend marks a new chapter in a country where they already routinely face threats, harassment, and intimidation. But it must be countered for the sake of everyone given how widespread it has been. It is crucial to address the underlying loopholes in the case-filing process—by strengthening initial verification mechanisms and disallowing mass, exploitative accusations—and to ensure accountability for any misuse of legal provisions. The government alone cannot address this problem. Political parties, too, must come forward to stop this alarming trend.\n",
        "headline_1": "Stop legal harassment through dubious cases  ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/stop-legal-harassment-through-dubious-cases-3883646",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 04, 2025 00:00:00  \nAs the government prepares the national budget for the upcoming fiscal year, its pre-budget consultation with trade bodies brought the longstanding issue of tax collection into sharp focus. This is unsurprising, given that businesses account for the majority of the country's revenue. The consultation took place against the backdrop of significant pressure on the National Board of Revenue (NBR) which has fallen short of its revenue collection target by Tk 650 billion in the first nine months of the current fiscal year. This underperformance is particularly significant as the International Monetary Fund (IMF) has reportedly linked the release of pending tranches from its $4.7 billion loan package for Bangladesh to improved revenue performance, among other conditions. This has left the government caught between two opposing demands, one from tax authorities seeking tighter regulations to increase revenue, and the other from the business community calling for relief from tax burdens. \nDuring the consultation hosted by the NBR and the FBCCI, business leaders from textiles, garments, steel and SME sectors detailed the various obstacles they face. They emphasised how escalating operational costs, driven by rising energy prices, bureaucratic delays and stringent tax regulations are stifling entrepreneurship, even in industries where the country holds a competitive advantage. The president of the Bangladesh Textile Mills Association (BTMA), for instance, alleged that customs officials coerced businesses into paying bribes to release bank guarantees required for clearing goods at ports. Similarly, the president of the Steel Manufacturers Association cited bureaucratic inefficiencies as a major deterrent to investment, while the Meghna Group's chairman pointed to their $600 million investment in Cumilla EPZ lying underutilised due to two years of delays in securing utility connections. The concerns voiced by the business community are far from groundless. Their calls for policy consistency, reduced harassment and affordable utilities are not just requests for favours but essential prerequisites for industrial development. There can be no doubt that issues such as corruption and administrative bottlenecks not only inflate operational costs but also erode investor confidence and deter both domestic and foreign capital. \nSeeking respite from current tax pressures, business leaders proposed several measures including raising the tax-free income threshold for individuals, reducing the source tax on all exports to 0.50 per cent, and establishing a uniform but lower VAT rate on local goods to support SMEs. While these proposals reflect the difficulties faced by businesses, the government has limited scope for concessions. The finance adviser present at the consultation rightly noted that significant tax relief is unfeasible given the country's growing deficits and debt obligations. With limited external borrowing options and development partners pushing for stronger domestic revenue mobilisation, the government has little fiscal freedom. In this context, the administration's cautious stance is understandable. That said, the government can and must address operational hurdles facing the private sector to improve the overall ease of doing business. \nThe government, therefore, faces a delicate and complex balancing act. A purely revenue-driven approach that overlooks the genuine challenges faced by businesses risks harming long-term economic growth and, ironically, future tax receipts. Conversely, excessive leniency could compromise essential revenue generation. As the saying goes, the art of taxation lies in plucking the goose so as to obtain the most feathers with the least hissing. The upcoming budget must reflect this wisdom by reducing structural barriers and cracking down on corruption, all the while meeting revenue targets without overburdening businesses. Only through such a balanced approach can the government sustain economic growth and secure the resources needed for national development. \nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Balancing revenue goals and growth",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/balancing-revenue-goals-and-growth-1746284145",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       May 04, 2025 00:00:00  \nAmong the eight reform commissions formed by the Yunus-led interim government, the Labour Reform Commission, the last one to present its report, holds significant importance. This is the first time in Bangladesh's history that such a commission has been established to review the existing labour policies and laws, as well as the state of the labour market. The commission's mandate includes providing recommendations to rectify various anomalies in the laws and discriminatory measures that undermine labour rights and industrial relations. The commission has successfully completed this formidable task, and the report has been submitted to the Chief Adviser in the third week of the previous month. The 25 main recommendations of the commission encompass all aspects of labour reform.\nOne of the key recommendations is introducing a national digital labour registration system and a database. The commission argued that such a database is necessary to recognise all the labourers and workers in the country and to ensure their occupations, skills and identities. At present, there is no such database in the country at either the national or industry levels. Various sectors also do not preserve comprehensive data on the labourers or workers employed in these sectors. After the Rana Plaza disaster that killed at least 1,134 workers and injured more than 2,500 people, there was a move to build a database for all the workers employed in the ready-made garments (RMG) sector. The initiative, however, resulted in an incomplete and inaccessible database due to non-cooperation from the factory owners. \nThe commission's recommendation was that the proposed database should be universal and comprehensive so that it can be possible to identify all formal and informal workers and labourers along with those who are unemployed. It also stresses the database's easy accessibility and interoperability so anyone can find it useful. To develop the database, the commission stressed framing a policy in this connection. Registration with the system should also be mandatory for all labourers and employers to make the database effective, the commission added. This database will not only provide a comprehensive record of the workforce but also facilitate efficient hiring and job matching, and ensure fair labour practices. \nThe recommendation to develop a labour database is obviously a good one. Though difficult, considering digital logistics, it is not impossible to do the work. However, it will require a long time to register all the labourers and employers. Moreover, it will be continuous work as new workers are coming into the labour market regularly and some are also leaving the market for various reasons. \nAccording to the Labour Force Survey (LFS) 2023, the total number of labourers in the country is 73.45 million, of which 48.12 million are male and 25.33 million are female. The survey also showed that 2.46 million, or 3.35 per cent, of the total labour force was unemployed in 2023. In other words, the suggested database should contain information on at least 71 million people who were employed in 2023. \nMotivating the workers to get registered with the system will be a big challenge. Most workers may think it is useless and may not be encouraged by employers to do so. Even many employers and factory owners may try to avoid registration as they don't want to provide their information. In this connection, an extensive awareness-building programme will be required. Including the informal workers in the database may also be more challenging by registering. LFS 2023 showed that 84.10 per cent of the total labour force in the country is employed informally. \nThe pattern of employed workforce by broad economic sector is another thing to consider. Around 45 per cent of the total employed people are in agriculture, followed by 38 per cent in services and 17 per cent in the industrial sector. Registering those who are in agriculture will be more challenging and time-consuming due to the vastness of the sector and the scattered nature of agri-labourers. Moreover, a large number of agri-labourers work seasonally in the field and the rest of the time in the service sector. \nIf not designed properly, providing inputs into the database system for registration and preservation may be time-consuming. So, once decided, the government has to design and test the system carefully. There is also a need to deploy a well-trained team to do the work across the country. Registration booths may be opened in various industrial and commercial areas in this connection. Moreover, some data entry staffers need to send a tablet or necessary device to collect data from multiple factories and offices. As the Bangladesh Bureau of Statistics (BBS) used to deploy enumerators gathering citizens' data for any census, it can provide necessary assistance for the labour database. The process will involve setting up registration booths, deploying data entry staff, and ensuring the security of the data collection process. \nHowever, data privacy will be a major concern. Despite developing the necessary tools to maintain a robust database, ensuring citizen data privacy is still a matter of concern in the country. Due to a lack of weak security, a number of privacy breaches and unauthorised extraction of data from the national repository took place during the now-ousted Hasina regime. Thus, strengthening the data preservation and protection infrastructure is a must. \nTo make the labour database effective and efficient, the commission also suggested interoperability with other databases, like the national identity card database. Interoperability will help cross-check the authenticity of a worker's data and obtain additional information. Again, a strong security feature is necessary to avoid any vulnerability of interoperability. \nDespite the numerous challenges and barriers, the interim government should initiate the primary work of developing the proposed labour database. Following the basic outlines suggested by the commission, a dedicated team will be formed to conduct the work. Various ministries and departments should cooperate to introduce the system. A well-designed and developed database will not only make it easy for the government to provide assistance and welfare allowances to workers when required but also ensure necessary insurance coverage for vulnerable workers. Finally, it will help make the labour market efficient in the near future, ushering in a new era of labour reform.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Developing a comprehensive labour database",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/developing-a-comprehensive-labour-database-1746284267",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       May 04, 2025 00:00:00  \nPolytechnic students have been protesting since 16 April to realise their six-point demand, which includes the cancellation of a High Court verdict that allowed the promotion of craft instructors to the post of the junior instructor, age restrictions on new admissions, and legal protection of technical graduates' job prospects. They are also demanding the formation of a separate Ministry of Technical and Higher Education, as well as a dedicated technical university and the formation of a reform committee to overhaul the technical education sector in line with the market needs. After protesting on the streets for weeks, they met with the Education Advisor, but were apparently dissatisfied with the outcome of the meeting and have decided to enforce a complete shutdown of all government and non-government polytechnic institutions across the country since April 29. While some of their demands are seemingly impractical , their protests are rooted in genuine despair over limited opportunities and a lack of meaningful reform in the technical education sector.\nExpansion of technical education has been one of the focus areas of the governments in the last few decades. As a result, technical education has been expanding on the paper, but the reality tells a different story. While the number of both government and private polytechnic institutions has grown, the quality of education remains stagnant-plagued by outdated curricula, teacher shortages, under-equipped labs, and so on. Worse still, many of the private polytechnic institutes just issue certificates without providing any real training. Many, therefore, complain that the technical and vocational education sector is failing to produce graduates with the skills needed in a rapidly evolving job market.\nWhile job placement rates for polytechnic students are significantly higher than those pursuing general subjects, alarmingly, low wages remain a major concern. According to a 2024 study by the Centre for Policy Dialogue (CPD), nearly 73 per cent of diploma graduates earn less than Tk 10,000 per month. This troubling situation stems largely from inadequate skill development and a serious mismatch between the curriculum and industry demands. Such disheartening outcomes have left many students feeling deceived, while deterring prospective students from pursuing diplomas altogether. In fact, a recent report in a national daily noted that up to 60 per cent of seats in technical institutions remain vacant.\nThis gloomy picture of the country's technical education sector is all the more concerning in the context of the growing global demand for skilled technical workers. Countries like Japan and Germany, which rose from the ashes of war to become industrial leaders, owe much of their success to robust technical education systems. In these countries, technical and vocational training enjoys high enrolment rates-73 per cent in Japan and 71 per cent in Germany-alongside industry-integrated curricula and hands-on learning. Other Asian nations such as Malaysia, Singapore, China, and Vietnam have also leveraged technical education to drive rapid industrialisation and socioeconomic advancement.\nIn contrast, Bangladesh remains a net importer of foreign skilled labour, especially in sectors like garments, construction, telecommunications, and energy. This outflow of foreign exchange not only underscores our failure to cultivate a competitive local workforce, but also weakens national self-reliance.\nThe time, therefore, has come for serious and systemic reform. The demand for a reform commission, as raised by the protesting students, is both timely and necessary. Bangladesh urgently needs a national strategy to modernise technical education-one that includes revising curricula in collaboration with industry stakeholders, investing in infrastructure, recruiting and training qualified instructors, and integrating new technologies into classroom and lab environments. In the age of the Fourth Industrial Revolution-dominated by artificial intelligence, robotics, biotechnology, and quantum computing-Bangladesh cannot afford to train students using decades-old content and methodologies. Failure to act now would not only waste human potential but also risk widening the chasm between education and employment, which the nation can no longer afford to bear.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Technical education reform  an imperative",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/technical-education-reform-an-imperative-1746284332",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 04, 2025 00:00:00  \n\nIn April 2025, Bangladesh's remittance inflow is demonstrating remarkable strength, with an inflow of $2.27 billion reported during the first 26 days of the month, showcasing ongoing financial support from the nation's expatriates. This figure mirrors trends observed in previous years, where expatriates have consistently contributed significantly to the country's economy, as noted by the $2.27 billion remittance in total reported by another source. However, this figure is slightly lower than the $1.05 billion received in just the first 12 days of April, indicating a slight decline post-Eid season. \nMoreover, remittance flows have significantly bolstered the country's foreign exchange reserves, which recently crossed the $25 billion mark ahead of Eid celebrations. The remittance inflows reflect broader economic patterns, with expatriates from the USA and UAE becoming prominent sources, overtaking traditional contributors like Saudi Arabia. This financial influx is crucial as Bangladesh faces challenges including the weakest projected economic growth since the pandemic and a rising unemployment rate of 1.7 lakh within a year. Thus, while the current remittance inflow of $2.27 billion reflects robust support from expatriates, the country must navigate pressing economic challenges to sustain and increase these inflows in the future. \nSakib Hasan\nStudent\nDepartment Of Marketing\nNorth South University\nsakib.hasan15@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Remittance inflow shines bright",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/remittance-inflow-shines-bright-1746284348",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-05-2025"
    }
]