[
    {
        "full_article": "The heavy rains and flooding across Andhra Pradesh and Telangana this season underline how extreme weather interacts with governance. In 2024, Andhra Pradesh recorded 27% of its annual rainfall in two days; this August, Vizianagaram logged a 46% excess, with some parts reporting up to 90%. Consecutive years of extreme precipitation signal a shift in the monsoon’s behaviour. Reservoir and barrage systems in river basins are designed to manage seasonal inflows but the timing and intensity of recent rain events matter. At one point this year, Srisailam was 94% full and Nagarjuna Sagar 96%, leaving little room for additional inflow. The crisis is really excess rainfall plus its concentration into short bursts when reservoirs are already nearly full. Last year, Budameru, a rivulet with a capacity of 7,000 cusecs, received 35,000 cusecs and flooded Vijayawada. The recurrence points to how minor tributaries and drainage channels, which are often neglected in policy, become debilitating choke points. While sheer volume explains part of the flooding, infrastructural weaknesses magnify the damage. At the Prakasam Barrage, one gate damaged last year remained unrepaired well into this season, hampering smooth water release. Along the Godavari, floodbanks near Bhadrachalam sank or collapsed in places, raising anxiety among residents on both sides of the border. In urban areas, partly desilted drains, encroached stormwater channels, and concretised surfaces have restricted water absorption. Overall, infrastructure exists but is not maintained or upgraded with urgency.The disaster management apparatus in both States is mature and saved many lives. Yet, institutions remain less agile at reducing risk. Year after year, large sums are sanctioned for immediate relief (Telangana recently released ₹1 crore per district at short notice) but strengthening floodbanks and completing diversion channels remain unfinished. In 2024 and 2025, extreme rainfall arrived late in August and early September. Both times, the Krishna and Godavari systems were severely strained and Vijayawada was inundated. Both times, protests followed, highlighting incomplete Budameru works and opaque relief fund uptake. Extreme rainfall cannot be prevented but its consequences can be moderated by anticipating it. Reservoir management, for example, needs to incorporate real-time hydrological modelling so that water levels are drawn down before a deluge, creating flood cushions. Urban planning must prioritise drainage networks and reserve permeable land for water absorption, moving beyond cosmetic desilting drives. Flood banks and sluices require continuous, not episodic, maintenance, and their upkeep should be insulated from political cycles. Neither State is wrong to argue that extraordinary rains can overwhelm even robust systems, but both risk fatalism if they use this as an excuse to avoid reform.READ MORE Published - September 04, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        rains\n                    \n                            /                      \n                        \n                        flood\n                    \n                            /                      \n                        \n                        Andhra Pradesh\n                    \n                            /                      \n                        \n                        Telangana\n                    \n                            /                      \n                        \n                        Monsoon\n                    \n                            /                      \n                        \n                        weather science\n                    \n                            /                      \n                        \n                        Vijayawada\n                    \n                            /                      \n                        \n                        rivers\n                    \n                            /                      \n                        \n                        disaster management\n                    \n                            /                      \n                        \n                        politics",
        "headline_1": "Rain and repeat: On extreme weather and governance",
        "headline_2": "Excess rain is no excuse for damage caused by neglect of sluices",
        "link": "https://www.thehindu.com/opinion/editorial/rain-and-repeat-on-extreme-weather-and-governance/article70008324.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-09-2025"
    },
    {
        "full_article": "The decision by the Congress-led Telangana government to seek a Central Bureau of Investigation (CBI) inquiry into alleged irregularities related to the Kaleshwaram Lift Irrigation Project has triggered a feud in the family of Bharat Rashtra Samithi (BRS) patriarch K. Chandrashekar Rao. Mr. Rao, the first Chief Minister of Telangana, who served two terms, is facing an uphill struggle for political survival after losing power to a resurgent Congress in 2023. K. Kavitha, his daughter, has publicly blamed her cousins — senior leader T. Harish Rao and former Member of Parliament J. Santosh Kumar — for her father’s plight. The two leaders have been known to be close to the patriarch as well as his son and anointed successor K.T. Rama Rao. Mr. Rao is not a novice and he knows better than to be misled by anyone else. Ms. Kavitha’s accusations are, hence, more about a tug of war within the family for inheritance and the spoils of power. Despite losing the Assembly election, she was given a party nomination as a Member of the Legislative Council (MLC), but she evidently thinks she deserved better. With her father, brother and cousins not willing to oblige her, Ms. Kavitha went public with the charges, and the party suspended her. Ms. Kavitha has resigned from the party and her position as an MLC.Ms. Kavitha’s outburst against her father’s confidants may turn out to be politically suicidal for her. In fact, unrealistic political calculations run in the family, it appears, going by the senior Mr. Rao’s missteps ahead of the 2023 election. Claiming a national role for himself, he had changed the party’s name to the BRS — paradoxical for a leader and a party that had little more than regionalism as its key source of legitimacy. Far from realising any national role in the 2024 general election, Mr. Rao found the ground falling out from under his feet and corruption charges swirling around him. In May 2025, Ms. Kavitha had reportedly questioned her father’s muted position with regard to the Bharatiya Janata Party. Her exit from the BRS marks a sign of crisis for a regional outfit that frittered its promise too soon. With a resourceful and dynamic State under its rule, the BRS and the Rao family could have left behind a stellar legacy in governance and development. By reducing electoral and organisational politics to crass power bargains and transactions, the BRS did itself and the new State considerable damage. In politics, a second chance is always possible for leaders and parties. But, as of now, the BRS stands diminished.READ MORE Published - September 04, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Telangana\n                    \n                            /                      \n                        \n                        investigation\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Telangana Assembly Elections 2023\n                    \n                            /                      \n                        \n                        General Elections 2024\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Bharat Rashtra Samithi",
        "headline_1": "​Family politics: On the feud in the Bharat Rashtra Samithi",
        "headline_2": "Kavitha is jostling for power within BRS, not waging an ideological fight",
        "link": "https://www.thehindu.com/opinion/editorial/family-politics-on-the-feud-in-the-bharat-rashtra-samithi/article70008300.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-09-2025"
    },
    {
        "full_article": "A US court just gave a big ruling about Google. Some people wanted the court to break up Google, but the judge said no.\nHere’s the backstory: In 2024, Judge Amit Mehta said Google was guilty of acting like a monopoly – meaning it controlled so much of online search and ads that other companies couldn’t really compete. Prosecutors wanted the court to force Google to sell Chrome (its browser) and Android (its phone system). But the judge decided against that.\nWhy? Because Google’s success also comes from hard work and smart ideas. It actually started as a student project called Backrub at Stanford University. Over time, it grew into the world’s top search engine, and later built Chrome and Android, which billions use today. That kind of growth shows innovation, not just unfair practices.\nStill, there is a problem. Since almost everyone uses Google, its search results keep getting better and better. This “network effect” makes it super hard for new search engines to compete, even if they invent cool technology.\nSo instead of breaking Google up, the judge set new rules:\n\nGoogle can’t make secret deals with phone makers to block other search engines.\nGoogle has to share some of its search data with rivals so they can improve too.\n\nThat way, the field is more fair for competition.\nAnd things are changing anyway. Chrome beat Internet Explorer years ago, and now AI-powered search tools and browsers are rising fast. Just like the iPhone replaced BlackBerry, a new search engine could one day beat Google. The important thing is to keep competition alive — and that’s exactly what this judgment is trying to do.\n\n",
        "headline_1": "Good Search Result",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/good-search-result/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-09-2025"
    },
    {
        "full_article": "More hurdles than auspicious beginnings\nRevered Ganapati Bappa,\nOm Vighnanashay Namah..!\nYou are the Omniscient one, so you are already knowing why I am addressing you as the ‘remover of obstacles’. How to think of ‘auspicious beginnings’ when we humble devotees face no end of vighna not just in daily life but even in getting your darshan. We are not talking of big-big pandals occupying whole pavement and much of road. Unholy peoples are complaining that these obstruct them from going about their business. Arre, bhau, what other business you should have during these sacred 10 days, huh?!\nThis Ganeshotsav Mumbaikars faced two special obstacles. The biggest was Shri Manoj Jarange’s do-or-die hunger-strike demanding Kunbi OBC quota for Marathas. Hajar-hajar protestors came thundering in on trucks from Marathwada. They jammed fancy coastal road, Sealink and bijness areas, threw lakh-lakh kg of rubbish on the street, even urinated right there. Hai-hai! How to keep pure through this filth? Till sarkar succumbed, how devotee could move in standstill city.\nHurdle Numbar Do: Rain. Yes-yes, it’s always there. It’s still monsoon, no? Pann, this year it did not stop only. How we could reach Lalbaugcha Raja, Siddhivinayak temple, GSB Seva Mandal’s jewels-covered idol when local trains were cancelled or delayed thanks to flooded tracks. Means, dubbal ghotala than usual! Waterlogging even in brand-new Metro station. Thanggod, we weren’t on stuck-in-mid-air monorail; Meena-mausi’s still shaking from scary crane rescue. Just walking means new-new clothes getting splashed with mud from passing buses and monster cars not caring kauri about poor pedestrians. But what they also can do? No road; potholes only. Of course, worse minddit! for us trying to tread hallu-hallu on slippery, broken pavements while avoiding hawkers, kachra dabbas etc.\nThen, beloved Bappa, having struggled through crowded trains and buses, rains, kabbadi-playing protestors, having suffered dhakka-bukki, hungry, thirsty queue for six-seven hours, we, your fervent but humble devotees, got only a distant, hurried, herded darshan. The final obstacle was privilege. Netas, film stars, paid-slotwallas, sponsors… Ani, bhau, who is this new, influencer-winfluencer VVIP cheez?\n***\nAlec Smart said, “Politicians play ‘fast’ and loose; progress loses.”\n\n",
        "headline_1": "Bappa, Baap re!",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/bappa-baap-re/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-09-2025"
    },
    {
        "full_article": "Smart US court order on Google that addresses monopoly but doesn’t penalise innovation\nGoogle survived its Microsoft moment on Tuesday when a US court ruled against breaking it up. In Aug 2024, Judge Amit Mehta had found Google guilty of monopolistic practices in online search and advertising. However, a year on, he turned down federal prosecutors’ request for a forced sale of Chrome browser and Android operating system – pillars of Google’s business.\nA contrary judgment would have violated the natural principle of rewarding merit. Yes, Google’s parent Alphabet is a $2.6tn behemoth now, but Google itself started as a dorm project named ‘Backrub’ at Stanford. By 2002, it was the best and most popular search engine, powered by 50 computer science PhDs, but without a clear revenue model or future. That it seeded the world’s fourth most valuable company, leading web browser, and OS over the years, shows it thrived on spark and spunk.\nThis does not alter the current reality that Google monopolises online search, making it almost impossible for new entrants to survive. The question before Mehta was, whether to take an axe to it – like the US Department of Justice tried doing with Microsoft in 1997 – or use other means. He chose to address the root of the problem – monopoly – by levelling the playing field for competition as much as possible. So, Google is now barred from striking deals with device makers that lock out competition, and obliged to share search engine data with the same competition, so that they can improve their offerings.\nData sharing is vital because Google’s stranglehold on search is a result of its massive network effect – the more people use it, the better its results get. It’s the biggest hurdle for rivals, because even if they build a better algorithm, Google has three decades’ headstart. Two or three years ago, splitting Google might have been the only answer to the problem, but Mehta observed that with the rise of AI search engines and chatbots, the search game isn’t so one-sided anymore.\nThings change. Chrome nudged past Internet Explorer in 2012, and then only on weekends. AI-enabled browsers could dislodge Chrome from its perch in a few years. And while Google is also a pioneer in this evolving market, “second-mover advantage” is a real thing. Just as iPhone beat BlackBerry, an upstart search service could pip Google. The important thing is to maintain conditions conducive to fair competition, and that’s what the judgment has done.\n\n",
        "headline_1": "Good Search Result",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/good-search-result-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-09-2025"
    },
    {
        "full_article": "A study sounds a warning on intermittent fasting. Better to take all diets with a pinch of salt, doc willing\nA study of 19k adults over eight years has found that intermittent fasting – sticking to a short eating window of less than eight hours in a day – over years was linked to an increase in risk of death from cardiovascular disease. What now? Intermittent fasting is widely followed by weight watchers, and doctors, especially diabetologists, also have prescribed it since it’s positively related to improving insulin sensitivity. There’s no diet plan – fad or otherwise – that doesn’t spawn studies both for and against. If today coffee’s good for the heart, tomorrow a study will find it’s not so hot after all. Fat lot of good that does to those who follow diet fads as keenly as they watch waistlines and ECGs.\nThe unsuspecting healthy-eater is crushed from all sides by ads of a dizzying array of ‘health’ foods (mostly processed) & supplements (bad idea unless prescribed) & nature fads (recall AIIMS doctors’ caution against too much giloy damaging the liver). To stay thin and happy – an oxymoron for the gramps brigade – and slow ageing, abstainers face a problem of abundance. Some doctors can go to extremes, others can be rather indulgent when it comes to diet, so the sensible rather marry doctors’ advice with sound instinct.\nSo, junk intermittent fasts? As of now, research speaks in one voice on intermittent fasting only for social media feeds. Restricting screen time to less than eight hours improves a lot of everything – physical flexibility, mental agility, attention span, appetite. As for food, annoying and seemingly impossible to follow as it can be, bottomline from the blue zoners of healthy longevity, nonnas to nanis, dadus and dadas is this: eat balanced, eat moderate, walk, don’t skip too many meals, try to eat at the same time, focus on your food (respect), don’t make a meal of snacks, restrict munchies, exercise, and in all caps, SLEEP. Raise a toast to that.\n\n",
        "headline_1": "Slim Chance",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/slim-chance-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 04, 2025 00:00:00  \nAs part of a major judiciary reform, the High Court has restored the Article 116 of the 1972 Constitution of the country. Clearly, this was long overdue because the amendments brought to the Article concerned was done primarily with an ulterior motive to exercise political influence on courts by bestowing the authority of controlling subordinate courts on the country's President. The neutrality of the President too was compromised in the process because of the pressure from the ruling party which elected a party man to the titulary post. In fact, the prime minister acted as the main architect, who had the opportunity of becoming all-powerful undermining the presidential prerogatives. If the restoration of the Article takes effect, the intervening nasty practices resorted to by the immediate past ruling party can be done away with forever. Quite rightly, the court has declared the Bangladesh Judicial Service (Disciplinary) Rules 2017 unconstitutional and directed the government to establish a judicial secretariat within three months. \nHopefully, this positive legislative development will not be challenged in the Supreme court and take effect without any opposition from any quarter. With the restoration of the original legal provision of the 1972 Constitution, not only will the judiciary enjoy enough independence but at the same time have to be responsible for the trials they carry out in their respective courts and accountable to the litigants---in fact, the people looking for justice. The supervisory role played by the highest court will definitely prompt them to have a better grasp of the legal provisions. But above everything else, what needs to be done is to dismantle the evil nexus that has emerged to corrupt the judicial ambience of the lower courts. In this context, the role of the police who file cases often casually or with lacunae for lawyers of the defendant to place irrefutable arguments is highly crucial. This aspect must be taken care of immediately. \nIn his book, Turning Points, A.P.J. Abdul Kalam, 11th President of India, brought about phenomenal changes in the judiciary even though he too had to work beyond his presidential titulary role. How? The aerospace scientist did it out of his compassion for his countrymen. He was in constant touch with common people to know all kinds of their misery including those involving protracted litigations. Dr. Kalam was the man behind introducing e-judiciary in India. Introduction of internet courts and a legal consultation service was useful in speedy redressal of cases and avoidance of fraudulent litigation. Computerisation of active cases and classification and grouping of cases referred to competent benches also helped reduce adjournments and settlement time to the minimum. Bangladesh can also follow suit by appointing knowledgeable judges in specialised branches in order to effectively address the backlog of cases.\nThe need for bringing about transparency and accountability in the judiciary is a prerequisite but a recent appointment of a judge to the HC division has given rise to a lot of controversy. The higher courts can maintain communication with the subordinate courts if e-judiciary is introduced and information and communication technology (ICT) integrally connect them together. This will ensure transparency and avoid malpractices in case filing. At the same time, videoconferencing could be introduced extensively in order to cut expenditure and avoid unnecessary movement of the police accompanying those under trial. The judiciary can flourish to full potential if it is manned by competent persons with integrity.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Article 116 restored: A lot more to do",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/article-116-restored-a-lot-more-to-do-1756912677",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       September 04, 2025 00:00:00  \n\nA question raised by a local think tank as to whether the interim government has lost its way in its pursuit of implementing reforms, has struck a chord with many. It has been one year since the interim government assumed power following the ouster of the previous regime through a historic student-mass uprising in July-August, 2024. The post-uprising government, led by Nobel Laureate Muhammad Yunus, initially enjoyed unprecedented public support. The common citizen had high expectations regarding reformation of state institutions, economic stabilisation and restoration of democratic governance. Despite the interim government's success in some areas, these were overshadowed by persistent law-and-order problems and weak governance. Consequently, the initial euphoria over the government's performance has now faded. \nThe dispirited public mood was reflected in a recent gathering of civil society members. Leading economists, some of whom were involved in the government-formed reform commissions, attended the event to take stock of the progress on the reform agenda, and they couldn't help but vent their frustration. Speaking at the discussion, the economists noted that the initial enthusiasm for the reforms had already faded. The 11 reform commissions formed by the government to suggest measures relating to the country's constitution, electoral system, police administration, judiciary, anti-corruption commision, health, media, labour rights, women's affairs and other issues have already submitted their proposals with great enthusiasm. But the fate of these recommendations remains uncertain, with the reform proposals shelved for months.\nApparently, this failure to translate ideas into action has prompted Debapriya Bhattacharya, who headed the Committee for White Paper on the State of Bangladesh's Economy, to raise the aforementioned question. He further asked: \"Why the commissions' recommendations were not implemented? Is it a lack of will, a lack of ability, or is there a deeper, significant conflict of interest at play?\" With the national elections coming up in February, such questions are bound to arise with increasing frequency as the public scrutinises the interim government's progress on its reform commitments.\nThe interim government inherited an economy on the brink of collapse, plagued by depleting reserves, dollar crisis, widespread money laundering, a fragile banking sector, and high inflation. A year later, there is a semblance of macroeconomic stability. Foreign reserves have risen, driven by increased remittance inflows and export earnings. The exchange rate has stabilised, while inflation eased somewhat in recent months due to a tight monetary policy and the removal of import duties on essential goods. However, since August, inflation has resurged, fuelled by supply-side constraints stemming largely from persistent rains. \nAt the same time, efforts are there to curb banking sector irregularities and salvage failing banks that were bled dry through systemic looting under the previous regime. As a result, public confidence in banks has been restored. \nBut overall, economic growth has slowed due to a decline in investment. Often described as the lifeline of the economy, investment has stagnated mainly because of political uncertainty and rampant rent-seeking. This slowdown has a direct bearing on the rising unemployment and poverty, which, in turn, is aggravating the law-and-order situation.\nMeanwhile, the government's reform agenda on the economic front has taken a backseat. Although no reform commissions were formed on economic issues, several task forces were set up. A task force was formed to prepare a 'White Paper on the State of Bangladesh's Economy' and another on 'Re-strategising the Economy and Mobilising Resources for Equitable and Sustainable Development.' These task forces made actionable recommendations for economic growth, social development, and environmental sustainability in the short, medium, and long terms. Their reports were submitted to the Chief Adviser several months ago. Unfortunately, the government has yet to show any interest in implementing the proposed reforms.\nApart from managing the economy, a government's success is largely determined by its performance in maintaining law and order. But the way mob lynching, robbery, and other petty crimes have been going on unabated day in day out across the country has led many to doubt whether the government has a crime-fighting mechanism in place. It is perplexing why the government has so spectacularly failed to maintain law and order, even after deploying the army with magistracy powers. Reforming the police force was one of the pressing demands after the uprising. The Police Reform Commission has already submintted its report offering a clear and detailed plan to improve policing in Bangladesh. But the recommendations are yet to be implemented. \nWhat about the bureaucracy and government offices? Has corruption declined, or has service efficiency improved? There is little reason to believe so. On the contrary, allegations are there that corrupt government officers have become even more demanding now a days. \nAt the start of the reform drive in public administration, the Chairman of the Public Administration Reform Commission faced backlash from certain members of the civil service. This may have prompted the government to become hesitant in implementing the commission's recommendations. However, the government could have executed several key recommendations, especially those directly related to public service delivery, through executive orders, had it chosen to do so. One of the government's most critical tasks was to structurally transform bureaucracy from its traditional colonial-style power structure into a citizen-centric service model.\nInstead of doing that, recently, an official directive was issued stating that female government officers (particularly those in senior positions) should no longer be addressed as \"Sir.\" However, it remains unclear how or to what extent this will benefit the people. The judiciary, too, is in dire need of reform, but prospects remain dim. \nThe people were promised a new Bangladesh, which will remain a pipe dream if the government falters and ultimately abandons its reform drive. Currently, the government is stuck in a seemingly endless negotiation with political parties over drafting of a 'July Charter', while the window to implement key institutional reforms - many of which could be executed through executive orders - is closing fast. Between now and the elections in February, the government has both an opportunity and a moral obligation to deliver on its promise.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Reform prospects fading",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/reform-prospects-fading-1756912754",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 04, 2025 00:00:00  \nEvery Friday, various recruitment exams are held in different educational institutions across Dhaka city. Job seekers travel from distant districts, upazilas, and even remote villages to appear for these tests. Naturally, they carry mobile phones, files, or small bags for their personal needs. Unfortunately, many are denied entry to the exam centres with these items, causing immense harassment and suffering for them.\nIn some centres, arrangements are made to store belongings for a fee, but such facilities are often inadequate and leave candidates feeling insecure about the safety of their belongings. This not only distracts them during the exam but also adds unnecessary stress to an already difficult situation.\nIt is the responsibility of the educational institutions and employing authorities to ensure a fair and comfortable environment for examinees. Proper management-such as secure storage facilities or clear guidelines well in advance-would be of great help for the candidates.\nAuthorities concerned are requested to take swift and effective measures to address this issue and provide a more supportive environment for job seekers, who already face immense pressure in their pursuit of employment.\nAshikujaman Syed\nsyedashikujaman@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Hassles of taking recruitment exams",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/hassles-of-taking-recruitment-exams-1756912782",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 04, 2025 00:00:00  \nOnce upon a time, the songs like jari, sari and baul were more than melodies. They were reflections of rural life, chronicling labour, joy, sorrow and devotion. But today, amidst the flood of digital entertainment and the fast pace of urbanisation, these traditions are fading. The sound of the ektara is slowly being drowned out by electronic beats.\nSurveys highlight this reality. While 70 per cent of villagers still say these songs are inseparable from their lives, 65 per cent of young people admit that because of mobile phones, television and YouTube, they rarely listen to them. Alarmingly, 55 per cent fear that if these traditions vanish, the cultural identity of villages will erode. The survey shows that the love for rural music still exists, but it is slipping away from the younger generation.\nThe reasons are many. Urban lifestyles and foreign influences dominate youth culture. The simplicity of folk music appeals less to them than flashy global trends. Equally, the absence of cultural education leaves children unaware of their heritage. Economic hardship adds to the problem. Life as a baul or folk singer brings little financial reward, discouraging the next generation from pursuing it.\nSolutions, however, are within reach. Communities, schools and colleges should integrate folk music into festivals, fairs and cultural programmes, giving young people opportunities to experience it first-hand. Technology, too, can be an ally. Publishing Baul performances on YouTube, Facebook or mobile apps would allow rural songs to reach wider audiences, including urban youth. Government and private initiatives must also step in with financial support and training, so that folk artists can live with dignity and pass on their skills. Families play a vital role as well, teaching children Baul songs and stories from an early age to instil pride in cultural heritage.\nJari, sari and Baul are not simply songs. They are the language of the rural soul, the heartbeat of Bangladesh. If they fade away, something irreplaceable will be lost. Preserving them means preserving our history, our culture and our identity. It is time we acted before the silence becomes permanent.\nSania Tasnim Lamia\nStudent, Department of Mass Communication and Journalism\nJagannath University\nsaniatasnimlamia@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Folk songs fading into oblivion?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/folk-songs-fading-into-oblivion-1756912821",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-09-2025"
    }
]