[
    {
        "full_article": "Bihar’s ongoing Special Intensive Revision (SIR) of electoral rolls by the Election Commission of India (ECI) has drawn criticism from political parties, and rightly so. The enormity of the task, the short duration, and the strict criteria for verification could result in the wrongful exclusion of lakhs of voters. The ECI’s statement that only ordinary residents would qualify for inclusion in the electoral roll has raised concerns, particularly among Opposition parties. Critics argue that it would be difficult for migrant voters — an estimated 20% of Bihar’s voting population — to be present for verification during the window that ends on July 31, and creates a high probability that they could be struck off the rolls. The Representation of the People Act, 1950 states that “A person absenting himself temporarily from his place of ordinary residence shall not by reason thereof cease to be ordinarily resident therein”, and manuals on electoral rolls add that such people will be treated as ordinary residents as long as they possess the ability and intention to return. This means that there must be caution in removing the names of migrants, especially those who are away from their place of residence for a short period.The issue becomes more complicated with long-term migrants. In Bihar’s case, there is a significant section of the voting-age population, especially males, migrating for work. This becomes evident when parsing voting data from the 2024 general election in the State, revealing a unique electoral dynamic. Bihar is a State where more women turned out to vote than men in absolute numbers (for every 1,000 men there were 1,017.5 women ), even though there were more registered male electors on the rolls (for every 1,000 men, there were only 917.5 women). This electoral dynamic was observed in Jharkhand, and to a lesser extent in Himachal Pradesh, but nowhere was the difference starker than in Bihar. There is good reason to believe that many of the absentee male electors were registered in their home constituencies in Bihar but were unable to return on polling day, drastically lowering the overall turnout rate for men. These electors were likely part of a large migrant cohort that included many longer-term migrants. The SIR must carefully parse such electors and ensure that only longer-term migrants are removed from the rolls — not an easy task. For longer-term migrants, meaningful representation requires their vote to be registered where they currently reside and work. Migrant workers are integral to the economic engines of several States, and their political voice should be more impactful in holding representatives accountable for their everyday challenges there, rather than in their native places. The ECI’s SIR must balance these principles. Ideally, such a process should take more time than the one month that the ECI has allocated for it.\r Published - July 04, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        migration\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        economy (general)",
        "headline_1": "​Careful curation: On Bihar’s Special Intensive Revision of electoral rolls",
        "headline_2": "Bihar’s electoral roll revision risks excluding short-term migrant voters",
        "link": "https://www.thehindu.com/opinion/editorial/careful-curation-on-bihars-special-intensive-revision-of-electoral-rolls/article69769101.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-07-2025"
    },
    {
        "full_article": "Nearly 15 years after the Supreme Court of India described custodial torture and deaths as the most heinous crime committed by men in uniform, brutal third-degree treatment of suspects remains a chilling reality. Emboldened policemen, with contempt for procedure, show no hesitation in resorting to violence, not just within but also outside police stations. In Tamil Nadu, the recent death of a young man, Ajith Kumar, who was detained and tortured by a special police team, in plain clothes, for alleged theft in Sivaganga district, underscores the deeply ingrained authoritarian and intimidating nature of the police force. The impunity with which he was detained, without a formal complaint or the registration of a First Information Report, illustrates just how normalised such disturbing behaviour has become in policing. Under the direction of the Manamadurai Deputy Superintendent of Police (DSP), Ajith Kumar was taken by the team to several secluded spots and subject to lathi blows to force him into confessing to have committed the theft — a woman visiting a temple in Madapuram had asked him to park her car; she later claimed that jewellery in the car was missing. Ajith collapsed under the brutality and the theft remains unproven. Justice S.M. Subramanian of the Madras High Court (Madurai Bench) aptly said, “It is almost police-organised crime... Very crudely, we have to say it is the state killing its own citizen.”Most victims are from oppressed backgrounds, making them easy targets. In this case, attempts at a cover-up failed due to protests and political outrage. With the custodial murder of a father and son in Sattankulam during the COVID-19 pandemic still fresh in public memory, Chief Minister M.K. Stalin wasted no time in damage control. Seven policemen, including the DSP were suspended; later, five were arrested. The case was transferred to the CBI. Mindful of a political fallout, with the Assembly elections nine months away, Mr. Stalin apologised to the victim’s mother. Solatium was offered, including a cooperative society job to his brother, and a housing plot to the family. Mr. Stalin said that such incidents are “unforgivable” and “unjustifiable” — views he has not aired in suspected custodial death cases in the past four years. However, these measures alone will not bring closure to the families. As directed by the High Court, he must ensure there is action against senior police officers, if their involvement is proven. A fast track trial is needed. It is time for the law-keepers to fall in line and for such killings to end. Published - July 04, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        crime, law and justice\n                    \n                            /                      \n                        \n                        police\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        prison\n                    \n                            /                      \n                        \n                        Assembly Elections\n                    \n                            /                      \n                        \n                        Tamil Nadu",
        "headline_1": "Murder most foul: On custodial torture and deaths",
        "headline_2": "Policemen resort to violence to extract ‘confession’ on mere suspicion",
        "link": "https://www.thehindu.com/opinion/editorial/murder-most-foul-on-custodial-torture-and-deaths/article69768533.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-07-2025"
    },
    {
        "full_article": "French police arresting an incel shows that law must come down hard on this violent subculture\nHow are society and govts to address the influence of incel culture – promotion of misogyny, extreme anti-feminism, and sanction of violence against women – among young boys? The question acquires urgency after the arrest of an 18-year-old in France. That anti-terror prosecutors will handle the case shows French law’s secular view: gender-based violence qualifies as terrorism. It is also recognition of what’s demonstrated online: that those who self-define as incels appear to be equally attracted to, and have parallel interests in, extreme right propaganda. The 18-year-old was found with two knives in his bag and had plans to attack women.\nIncel ‘culture’, with all its dangerous misogynism, has been flourishing online for nearly 20 years now. As with many other violent subcultures, the world woke up to it much too late, so that many young men, boys across countries internalised incel’s toxic thesis. Adults in authority positions realised too late that social media had already wrought too much damage. In India, especially, there’s little recognition that online feeds of teens are full of content justifying violence against girls and women, served as entertainment.\nAcross Asia, misogyny is seen as a Western construct. The Asian view would echo the French 18-year-old’s lawyer, that this was “a teenager suffering, not a fighter preparing for action.” Some will ask is this a case for counselling or of crime against women? They would point out that decades of ignoring multiple red flags about ‘grievances’ against liberal order’s focus on women’s and girls’ rights have hardened and hardwired misogyny into a borderless global culture. But let’s get real. Women’s rights were hard won, and the fight isn’t over, especially in deeply patriarchal societies like India’s. So, the first job is to prosecute men who inflict violence on women. Second, pay attention to young boys. \n\n",
        "headline_1": "Arresting thoughts",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/arresting-thoughts-3/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-07-2025"
    },
    {
        "full_article": "By taking a stroll through London’s Camden Town you can go on a globetrotting journey\nFrom our apartment in Camden Town in London, Bunny and I can take a global gastronomic tour.\nCamden is a multicultural community that celebrates its diversity by affording a thronging buffet of foods and flavours from across the world, all within a ten-minute walk.\nWe stroll to Thanh Binh to savour the speciality of the house, the delicately flavoured pho (to rhyme with fur), that evokes the lush green paddy fields and soft breezes of far-distant Vietnam.\nAround the corner is Caribbean Delight, where Kim greets us with a smile as warm as the Jamaican sun, and serves us an enormous helping of West Indian curry, quite different from ours, accompanied by rice and ‘peas’, which are actually kidney beans.\nAt nearby Dolsot, named for the stone pot in which the traditional Bibimbap, or ‘mixed rice’ is served, we get a taste of Seoulfood, Korean-style.\nClose by is Malay Fellas which transports us to Kuala Lumpur via signature dishes like Nasi Goreng, and Rendang, and then gives you a glimpse of Tokyo or Osaka with a side order of sushi or sashimi.\nOur favourite pub, The Golden Lion, with its eclectic mix of Victorian chandeliers, stripped wood flooring, and stalwart regulars like Dan who befriends us, brings Texas to the heart and stomach of London through American barbecues, Bourbon-glaze sauce, coleslaw and all.\nOf all our senses, nothing brings us together as that of taste, experienced through the commonality of cuisine. This is brought home to me literally at Frida, named after the Mexican artist, Frida Kahlo, where the tortillas and burritos stuffed with rice and beans are akin to Indian rotis and rajma-chawal, half a planet away.\nI recall a visit to the Museum of Anthropology in Mexico City where a life-size display of a Mexican village caught my breath by the uncanny resemblance in dress and features of the mannequins to the Kharva community of Kutch, where I come from.\nIt’s a small world. And in Camden it comes to you on a plate.\n\n",
        "headline_1": "World on a plate",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/world-on-a-plate/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-07-2025"
    },
    {
        "full_article": "Beijing’s weaponisation of engineers must be countered through expansion of Indian engineering beyond IT\nIn yet another example of China’s weaponisation of economic interdependencies, Beijing has ordered the pullout of Chinese engineers working at iPhone manufacturer Foxconn’s Indian factories. While their strength is less than 1% of Foxconn’s employees at Tamil Nadu and Karnataka, they play crucial engineering roles. The move is clearly aimed at disrupting production at these factories and comes on top of Beijing delaying the delivery of critical machinery to Indian operations.\nThis is plain economic bullying. China is using its manufacturing heft to undermine any moves by international players to relocate their production bases to third countries like India. With US & China locked in a strategic-economic tussle – notwithstanding recent attempts at trade war de-escalation – countries like India are getting squeezed. Vietnam just agreed to a trade deal with US that involves accepting 20% tariff on Vietnamese exports to US and an even higher 40% tariff on goods transshipped through the Southeast Asian nation – the latter aimed at stymieing Chinese exports to US via Vietnam. Thus, US is trying to leverage its market size to get concessions from its trading partners, while China is trying to leverage its manufacturing capacity to keep its trading partners locked into Chinese supply chains.\nBut when China was admitted to WTO in 2001, the West and Beijing made an implicit deal: the former will focus on innovation and high-end manufacturing, leaving mid- to low-value manufacturing to the latter. China used this to deliver massive scale and achieve engineering expertise in a wide array of intermediaries and components. As a result, Chinese tooling engineers today are the best in the world. China also refines 90% of global rare earths. And when it comes to India, Chinese supply of APIs, electronic components, chemicals, magnets etc is gargantuan.\nTo reduce this dependency, GOI’s PLI schemes have shown promise. But more needs to be done to set up indigenous manufacturing supply chains. A closer look at technical education is imperative. India produces around 1.5mn engineers annually. But only 10% of this number were expected to secure jobs in 2024. Plus, according to some estimates, India produces around 600,000 IT engineers each year. Materials engineers, more relevant for industrial manufacturing, are only in few thousands. Unless this cohort of engineers is boosted through govt investments and policies in relevant sectors, India will continue to be vulnerable to Chinese bullying over supply of critical components and human resource. India must steadily build its technical expertise to expand its manufacturing base and emerge as an alternative to China.\n\n",
        "headline_1": "Tooling change",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/tooling-change/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-07-2025"
    },
    {
        "full_article": "Morally, New Delhi should back Dalai Lama’s choice as successor over China’s communist party-compliant pick. But strategically, that may involve costs. It’s a tough call\nWhat’s the future of Tibetan Buddhism? Central to the question of Tibetan autonomy and religious freedom is the deliberation around the 14th Dalai Lama’s succession. In a July 2 statement, he affirmed that the institution of Dalai Lama will continue, putting speculation regarding its disbandment to rest.\n\nHe has also said his rightful successor would have to be found after his death, taking the idea of emanation, which would involve him publicly announcing and training a living heir, out of the picture.\nRead the full story on TOI+.\n\n",
        "headline_1": "India’s Tibet test",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/indias-tibet-test/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 04, 2025 00:00:00  \nThe country's stock market is not showing any sign of vibrancy. Occasional attempts to breathe life into it aimed at bringing new firms to get listed have fallen flat. Also, there is no encouragement for small investors to gain from the market. This has been glaringly reflected in a recent finding that Bangladesh's stock market was the second worst performer among its Asian counterparts in the first half of 2025, with the benchmark index sliding and no new listing recorded. In contrast, Sri Lanka emerged topper with an impressive 13.9 per cent gain in its equity index, while Thailand fared the worst with a loss exceeding 22 per cent.\nBangladesh's poor performance stems from a combination of high interest rates, weakening corporate profitability, ongoing political and economic uncertainties and a legacy of negative equity-all of which have severely eroded investor confidence. By June 30, the Dhaka Stock Exchange's DSEX index had shed 378 points, or 7.25 per cent, to settle at 4,838. During this period, market capitalisation fell by 8.1 per cent. The blue-chip DS30 index, tracking 30 prominent companies, plunged by 124 points to 1,816. Even more concerning is the fact that the average daily turnover at the prime bourse dropped to Tk 3.84 billion, a steep 39 per cent decline year-on-year. In this depressing market scene, investors have found no opportunities for gains through initial public offerings (IPOs), as there were no IPOs launched over the past year-a situation not seen in decades.\nAccording to many market observers, the failure to adopt transparent and proactive policies for years has left both the Dhaka and Chattogram stock exchanges largely dormant. Continued political interference and manipulation by those close to power have only made matters worse, compounding investor distrust and discouraging genuine market-based activity. The new Commission formed by the interim government has reportedly begun efforts in this regard, setting up a committee and holding discussions with major domestic and multinational firms to encourage listings. But the fact remains that unless these companies see the market as credible, transparent and profitable, they will remain reluctant to participate.\nRestoring investor confidence is indeed at the heart of any serious capital market reform. Achieving this requires strong regulatory enforcement, a robust legal framework and a commitment to shielding the market from manipulation and political pressure. Without these fundamental reforms, stagnation in the capital market is unlikely to be reversed, leaving investors wary and companies unwilling to seek listing. Policymakers must also focus on investor education and technological upgrade to enhance trading transparency and efficiency. Modern, automated trading systems, fair disclosure practices, and a vibrant bond market can help diversify investment options and reduce risks for retail investors. Rebuilding trust through sound governance, accountability and developing a long-term strategic vision are thus indispensable, if Bangladesh is to energise its capital market and unlock its full potential for supporting sustainable economic growth.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Energising the capital market",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/energising-the-capital-market-1751558220",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       July 04, 2025 00:00:00  \n\nThe findings of a survey conducted by the Youth Network Policy (YNP) are highly concerning and should have triggered matching socio-political reactions. But nothing of this order happened. The survey titled \"Food Security and VAT for Marginalised Communities\" made some chilling revelations. People in the low income bracket of Tk10,000-15,000 have been forced to make compromise on their food intake in various ways. Of this low-income group, 17.03 per cent people admitted they skipped their main meal, lunch that is, and substituted it with bread or biscuit. Of the respondents from 15 locations across the country, 60 per cent deliberately or of necessity started their days without taking breakfast and 88 per cent of them have to make do with bread and biscuit in place of rice. \n\nThat the news failed to draw attention of and reactions from the privileged classes, policymakers and political parties known for favouring maintenance of status quo in social order is not surprising. But at least the left-leaning political parties and the student leaders who were the architects of the July-August uprising could have taken up the issue seriously. They claim their objective is to eliminate social discrimination. Continued socio-economic discrimination leads to widespread inequality and disparities in any given society. Notably, the rallying cry of fighting discrimination stops short of the broader vision of reducing the outrageous disparities and equality existing in Bangladesh society. \nWell, the marginalised segment of society, however, enjoyed the backing from an unlikely quarter. Manufacturers of bread and biscuits had their representatives at the launching of the YNP report at the Economic Reporters Forum (ERF) in Paltan, Dhaka. But the manufacturers of this particular type of food were not led by the governing motive of supporting the low-income people without their self-interests. They were lobbying for reduction of the value-added tax (VAT) raised recently from 5.0 per cent to 7.50 per cent. As high as 70 per cent of small retail shops of such food items reported a significant drop in sales of bread and biscuits, according to the survey. \nThis indicates that the low-income people can no longer afford the foods they consumed as a substitute for rice. The manufacturers have either increased the price of such food items or shrunk the size of the packet. So they have argued, quite logically though, that the poor and lower middle classes including students who mostly rely on such items for light refreshments are adversely affected by the hike in VAT. Well, they have a point. But more importantly, it is the overall impact on the low-income community that should have received proper evaluation.\nThere is no point slapping tax on such essentials which have been the poor man's last resort for barely keeping their body and soul together. Leaving aside the quality of the bread and biscuits these hapless people consume, their nutrition value is far lower compared to a whole meal. Maybe, the carbohydrate contents are similar but even a meal comprising leafy vegetables and cheaper fish is far better than the substitute. The reality of starker malnutrition poses a serious threat to the national health. \nIn the post-Covid period, studies on food intake by poor, lower middle and middle class people have shown how the majority of them have to forego many of their choicest dishes and essentially nutrient items like egg and milk they were used to list as their must dietary components. There is no reason to think that the situation has improved by this time. In fact, the majority people's income has not risen; rather more and more employees and higher category members of staff in the private sector have found their service dispensable as part of a cost-cutting drive. \nBusiness in most cases is dull and yet commodities have not registered any price slump. With Taka becoming cheaper, the commodity --- particularly the imported ones --- market has become absurdly volatile. The demand may have been somewhat lower, but there are people who never run out of money to procure the prized items. A big-size hilsha fish weighing two and a half kilos netted at some point of the river Padma near Goalanda ferry terminal was sold for Tk13,500 to someone from Chattogram recently. There are more Motiurs of the goat-scam infamy than the public can think of. \nThis is what the economic reality of Bangladesh today is. Some people are wallowing on wealth they accumulated by means fair or foul but the marginalised have been further pushed to the brink. The unethical practices of wealth accumulation in the form of graft or business malpractices go on. Or, how can the number of millionaires go up at a time of economic recession and contraction? Many complain that the culture of bribe is still rife despite the hyperactive Anti-Corruption Commission (ACC)'s drive against the corrupt elements. Apart from the ACC's decision to probe into the assets of some NBR officials who recently led the shutdown programme, the anti-graft body has mostly concentrated on filing cases against the ministers, bureaucrats, high profile police officers etc.; of the past regime. The sitting officials and other employees, albeit suspect, are not so much troubled. \nWhat is most worrying is that neither the national budget nor any reform agenda does match the expectation of the common people. There is no deliberation on the subject of reducing the atrocious socio-economic disparities and inequality. Clearly, the class characters of big political parties and most members of the reform committees stand on the way of finding the urgency of considering the existing social and economic inequality on a priority basis.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "When low-income  people skip meal",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/when-low-income-people-skip-meal-1751558341",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       July 04, 2025 00:00:00  \n\nA disturbing new trend has been going viral on video streaming platforms like YouTube and Facebook. Self-styled volunteers are producing contents by forcibly 'cleaning up' homeless people by shaving their heads, trimming their beards, bathing them, and dressing them up in new clothes in public. While these acts are considered charitable services by the volunteers and many of their audiences, they are really not. If the videos are watched minutely, gross violation of personal liberty, dignity, rights and beliefs would be found. A few of the street people seem to have been happy to get the services, but most do not. The videos show that in many cases, the homeless people targeted for the 'services' try to resist the volunteers, but fail because the service providers overpower them. The volunteers sometimes choose violent ways to bridle them.\nThe reactions of the audiences shown in the comment section of the videos suggest most of the people like the acts. Some people even encourage them by sponsoring dresses for the street people with their names announced in the videos. The volunteers, who seem to belong to the majority community because of their attire, are doing the job considering it righteous. Any religion or culture promotes cleanliness while Islam considers it a virtue, suggesting that maintaining cleanliness is a desirable quality. Cleanliness is also closely linked to health. There is no denial that it is good to help anyone remain clean. However, imposition of this practice, if necessary by resorting to violent means, is not only undesirable, but also an offence and violation of personal liberty. Personal liberty is a fundamental right enshrined in our constitution, which guarantees the freedom to live life the way one prefers without interference from other people or the authorities. Article 32 of the Bangladesh Constitution provides, \"No person shall be deprived of… personal liberty save in accordance with law,\" meaning it is the responsibility of the State to take action against those who infringe upon this right of any citizen. The Bangladesh's Penal Code criminalises involuntary touching, shaving, or restraining someone without consent. If done so, it is considered an assault under the law. \nThese apparently good acts could have severe psychological consequences on the people who are subjected to them. Many homeless people suffer from mental health issues or past trauma. Being forcibly restrained, shaved, or washed in public can be profoundly humiliating and even traumatising anew for them. The actions might also erode the trust that exists between vulnerable people and those who really aim to help them. The filming and publicising of the acts for entertainment or earning through monetisation is another disturbing aspect of the infringement.\nThe volunteers are violating fundamental rights and constitutional provision and disregarding the beliefs of other people every day under the very nose of the authorities. They are trimming off matted hair of sadhus who believe in mysticism. In Islam, matted hair is not permitted but it is alright in some other beliefs. Nobody is asking the volunteers who have given them the authority to do this job.\nThese volunteers might have been inspired by similar videos created by people in the West. But they do not minutely watch them and follow the moral and ethical standards maintained by the Western content creators, who do not trim hair or bathe anyone in public without their consent.\nThe present trend of helping homeless people shows a societal failure to understand and address homelessness with sensitivity. Structural poverty, mental illness, and displacement cannot be solved by superficial gestures.\nNow the government should step in to stop the illegal and unethical public activities while genuine voluntary organisations should establish ethical guidelines and codes of conduct when working with vulnerable populations. Digital platforms such as YouTube and Facebook must be held accountable for allowing such contents to proliferate. \nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Is it compassion or  coercion?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/is-it-compassion-or-coercion-1751558395",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 04, 2025 00:00:00  \n\nJagannath University (JnU), a reputed institution located in Old Dhaka, continues to suffer from chronic mismanagement and a lack of basic infrastructure even after 19 years since gaining university status. Each day, around 18,000 students are affected by inadequate housing, transport, canteen services, laboratory and library resources, and medical facilities.\nThe most pressing issue is the acute housing crisis. Due to a shortage of student dormitories, the majority are compelled to live in substandard and overpriced accommodations in the surrounding area. Despite JnU becoming a university in 2005, most of its 11 student halls remain under illegal occupation. Only two are currently habitable, and the university administration appears to have made little meaningful effort to reclaim the rest. The only functional hall for female students-Begum Fazilatunnesa Mujib Hall, inaugurated in 2022-also faces numerous difficulties, including an insufficient number of seats, poor-quality food sold at high prices, lack of clean drinking water, broken washroom facilities, and non-functioning gas supply in the kitchen for nearly a month.\nThe transportation system is equally inadequate. The university does not provide enough buses for commuting students, and severe traffic congestion near the main gate further worsens the problem. Moreover, canteen services, laboratories, libraries, and the medical centre fall well below acceptable standards. The campus is overcrowded with parked private cars and motorcycles, creating an unsafe and chaotic environment.\nThe condition of the university medical centre is particularly worrying. Students frequently report poor service and unavailability of essential medical resources. The medical team claims to have made repeated requests for more equipment, skilled personnel and an increased budget but to no avail. Alarmingly, in an age of digital transformation, Jagannath University continues to publish examination results manually on notice boards, leading to unnecessary delays and frustration among students.\nAfter nearly two decades, it is disheartening that students of the JnU are still deprived of basic rights and facilities. To ensure a supportive, modern, and student-friendly academic environment, the university administration must act without delay. Visible, effective steps are urgently needed to improve conditions and secure a better future for the student body.\nMst. Mishkatul Islam Mumu, Student\nDepartment of Mass Communication and Journalism\nJagannath University\nmishkatislam102@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Multifarious problems JnU students face",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/multifarious-problems-jnu-students-face-1751558429",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-07-2025"
    }
]