[
    {
        "full_article": "During its slow crawl over Sri Lanka in November, Cyclone Ditwah was a rain machine that repeatedly swept over the same areas for days, eventually precipitating a national disaster with widespread flooding. Fourteen lakh people were affected, and at least 474 were killed. After crossing Sri Lanka, the system re-entered the Bay of Bengal and briefly reintensified, bringing heavy rains to north Tamil Nadu and south Andhra Pradesh. By December 1, the storm’s remnant parked itself off Chennai’s coast as a deep depression. The next day, after around 18 cm of rain over 24 hours, the city woke to flooded streets and widespread waterlogging. While that much rain would test any urban drainage system, public frustration has mounted. That Ditwah was tricky to predict made matters worse. Chennai’s storm water network has been rebuilt and extended after the 2015 floods, and again since 2023, but it cannot be flood-proof. Integrated projects in local basins are designed to handle intense bursts rather than hours of heavy rain. The GCC has said that it has spent ₹5,200 crore over four years to add around 1,100 km of new drains, with three-fourths of the work done. A separate endeavour to fix smaller broken links is incomplete, leaving many streets waterlogged. Chennai’s flat layout, increasing paved area, and the three rivers running through it from catchments in Tiruvallur and Kancheepuram also mean that when a storm system inundates those basins and Chennai together, water levels will rise quickly. Recent floods in north Chennai exposed the encroachment and shoddy desilting of the Kosasthalaiyar. With its ability to tolerate flooding diminished, the GCC had to shut some drains and pump stagnant waters against reverse flow. By lingering near Chennai, the new storm had similar effects.The Thiruppugazh Committee appointed after the 2021 floods produced a 600-page report with basin-wise recommendations and numerous measures. The State government has cited this report while justifying design changes and drain upgrades, building artificial water bodies, and seeking central funds for an ‘Integrated Urban Flood Management’ project, yet the report remains out of public view. There is also no verifiable consolidated implementation plan with a deadline. Flood maps and elevation models exist for the Chennai basin but they are not a shared reference for enforcement and relief efforts, while proper zoning and limits on construction continue to elude residents. Thus, the rains underline an unresolved story while spotlighting gaps in infrastructure and transparency. As the upgrades take shape, the State must publish the report and ensure hazard maps and basin-wide coordination efforts as well as temporary solutions such as pumps keep pace with the storms that routinely test them. Published - December 04, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        cyclones\n                    \n                            /                      \n                        \n                        Sri Lanka\n                    \n                            /                      \n                        \n                        natural disasters\n                    \n                            /                      \n                        \n                        rains\n                    \n                            /                      \n                        \n                        flood\n                    \n                            /                      \n                        \n                        oceans\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Andhra Pradesh\n                    \n                            /                      \n                        \n                        weather\n                    \n                            /                      \n                        \n                        urban planning\n                    \n                            /                      \n                        \n                        Chennai\n                    \n                            /                      \n                        \n                        Chennai rains 2015",
        "headline_1": "Sting in the tail: on Cyclone Ditwah, its impact",
        "headline_2": "Ditwah devastated Sri Lanka, and exposed infrastructure gaps in India",
        "link": "https://www.thehindu.com/opinion/editorial/sting-in-the-tail-on-cyclone-ditwah-its-impact/article70353492.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "Systematic efforts are required to eliminate stigma, that are often seeded by fear, misinformation or ancient beliefs, and to remove the discriminatory attitudes towards those affected. The Supreme Court of India’s intervention to battle stigma and discrimination in the case of leprosy is a corrective action that could not have been delayed any further. On a direction from the Court, the NHRC recently submitted that 97 central and State laws continue to contain provisions that discriminate against persons with leprosy. In sum and substance, these provisions deny access to things as basic as public transport and public spaces, right to run for elected office, and access to employment, or running a business venture. The Court was hearing a batch of petitions contending that there were a number of provisions across central and State statutes that discriminate against persons with leprosy. Caused mainly by the bacterium, Mycobacterium leprae, leprosy is among the earliest known infections to affect humans, with skeletal evidence dating back to 2000 BCE. Today, India continues to report about 57 % of leprosy cases worldwide, with genetic predisposition and living in unsanitary conditions raising the susceptibility. The NHRC, which has been in pursuit of this issue since 2021, first put out a comprehensive document that recommended early identification, timely treatment, rehabilitation, and removing discriminatory practices to ensure dignity and equal access to fundamental rights for persons with leprosy. This includes a plea to the Centre to enact a law to replace derogatory terminology that persists in the laws of the land, and a pointed recommendation to the Unique Identification Authority of India to promote the use of iris scans for Aadhaar enrolment, as leprosy primarily affects the fingertips, through nerve damage.Given that a plethora of medical advancements have enabled leprosy to be a non-infectious condition, and be fully curable with the right interventions, it will be a shame to allow these discriminatory, antediluvian provisions to continue to be in force. The judges directed all States and Union Territories to submit reports detailing the steps that they have initiated in this regard. In fact, armed with the evidence that the NHRC has provided, the Centre and States must set themselves the urgent task of removing these provisions, and launching remedial action. In this day and age, it is unfathomable that the state continues to trap a group of citizens in the dark ages based on laws written by humans who did not know better..   Published - December 04, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        medicine\n                    \n                            /                      \n                        \n                        medical conditions\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        public transport\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Aadhaar",
        "headline_1": "Taking the leap: on leprosy in India and discrimination",
        "headline_2": "Discriminatory provisions that impede lives of those with leprosy must go",
        "link": "https://www.thehindu.com/opinion/editorial/taking-the-leap-on-leprosy-in-india-and-discriminatioin/article70353527.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "Modern sport offers great lessons in branding, how to cash in on a name long after the talent’s gone\nIt’s said you aren’t a brand until the world knows you by one name. Like Messi, who starts his four-city tour of India next weekend. In that sense, Messi has had it easier than, say, Kohli, or Neeraj. In Recanati, the little Italian town that his forebears left in the 1890s, only about a dozen Messis remain. So, Messi can’t know how hard it is to be a brand when you’re born Rohit Sharma . But once you get there, the rewards are well worth the slog.\nStadium tickets for Messi’s celebrity matches are already sold out. Yet, what he makes over his three days in India would be nothing compared with his $1.2bn-plus career earnings. And money is only part of the deal. Heavyweight boxing champ Klitschko is mayor of Kyiv. When the Saudis met Trump at White House mid-Nov, they brought along Messi’s rival for GOAT-hood, Ronaldo. Not in a bag, as they like to, but in a suit. And Trump said that introducing his son Barron to Ronaldo, had raised him “a little bit more now” in the lad’s eyes. Given that Barron is 19, and 6’9”, Trump must be equal parts shocked and grateful. \nFame passes, though. What stays, if you’re careful, unlike Tyson and Becker, is the stash of career earnings. And if you nurture your brand carefully, it keeps paying even when your hung boots have turned mouldy. Our own Kapil, Gavaskar, Tendulkar remain brands with occasional endorsements. Perhaps the greatest endorsement of all is the one formed by association. Like ‘Sandow’, which remains shorthand for a man’s vest in many parts of India, 120 years after the proto-bodybuilder’s India tour. \nEugen Sandow was probably the first sports celebrity who turned himself into a brand, and launched products ranging from magazines to corsets and cocoa. Corsets? You can say that about Messi endorsing Qatari telco Ooredoo, or Beckham being the face of SharkNinja air fryer. Sometimes, the products sportspersons endorse don’t gel with their personal brand. But if the money is good, why not? This year, the 50 top sports earners will take home $1.04bn just from endorsements and non-playing events. They’ve come a long way from the time when Edwin Moses, who won 107 consecutive golds in 400m hurdles, made less than $500,000 in a year. And the money is only getting bigger.\n\n",
        "headline_1": "Money Ball",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/money-ball/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "So, you still don’t believe in miracles?\nOn Nov 15, I was devastated; a fortnight later, I was uplifted. Incredulously. The long-defunct fire temple of my Kolkata childhood had literally risen from the ashes. Last Sunday I woke to a WhatsApp from my TOI Kolkata colleague, Subhro Niyogi. It was his report from that morning’s edition, ‘City’s oldest agiary not lost to fire, believers call it a miracle.’\nWhat else could it be if not one? A fortnight earlier, a raging fire had gutted a swathe of the city’s congested Ezra Street ( and me no less since I’d lived there for my first 23 years). Subhro’s report then was titled, ‘Blaze ravages a slice of city’s Parsi link as flames destroy 186-yr-old fire temple’. And now here were the contradicting photographs.  \nThe roof, giant Tuscan pillars, Doric pilasters stood derelict but still imposing – clearly unfazed by the fire which had razed the surrounding illegal stalls; over the past 50+ years, these had entirely swallowed our agiary’s expansive  compound. Raising even more goosebumps was the image of the intact inner sanctum’s huge  afargan in which the sacred fire had continuously burned for 126 years before it died down forever – snuffed out by obdurately warring, once-fabled trustee-family. In its corner remained the now-tarnished bell, whose’ stentorian gongs had marked  the five gehs which divide  Zoroastrianism’s 24-hour cycle. \nHonour among thieves? Trustees long gone, and custodian registrar indifferent, the encroaching shopkeepers had reportedly pitched in to repair, replaster, repolish the exterior. Rs 80 lakh worth of facade work was completed just before the fire. Md Islam, 87, had looked after the property for 45 years; his shopkeeper son, Iftekar Husain said, ‘We felt we could not flourish at the expense of the temple’s decline.’\nNo one has been more affected by the agiary’s supposed fall and miraculous rise than me and my sisters. Our now-lost 100+ year-old house shared a wall with it. We woke to the fragrance of sandalwood mingling with the aroma of onions frying in our kitchen; the metronome of its gongs marked our quotidian tasks.  And proximity allowed us to drop in to ask for favours as casually as a neighbour for a cup of flour. \nThis awe-inspiring proof  that faith can never be singed has invigorated  the fast-depleting Kolkaka Parsi community.  But there’s also sobering irony. Encroachers came to the rescue of a fire temple that its legit protectors/worshippers could not save. William Cowper’s 1774 hymn was right: ‘God moves in a mysterious way, His wonders to perform.’ \n                                 ***\nAlec Smart said: “Rupee’s getting Trumped.”\n\n",
        "headline_1": "Faith accompli",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/faith-accompli/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "Social media makes money by algohacking many human brains. Contrast that model with responsible media’s \nAnger can be a useful emotion. It can play a key role in building a strong individual psyche, as also a  just society. But the algohacking of our brains to keep them in a state of incessant anger? That’s pure poison. Some companies and individuals draw colossal profits from it, but at terrible cost to general well-being. That rage bait has been declared Oxford’s word of 2025 is indicative of the spread of this poison. In 2024, it was brain rot that came on top. Both speak of the same diseased online ecosystem. Enshittification is another name for it, given by Cory Doctorow. Attention deficit epidemic, is how Jonathan Haidt annotates it. All of this is bad enough for adults, but what it’s doing to children is a great nightmare. \nSpecifically, rage bait refers to online content designed to elicit anger or outrage. Once tech platforms figured out how this kind of content spirals user engagement, the algorithms got tweaked to feed us more and more of the same, activating a diabolical incentive structure of hate. Of course, in this swamp, reality is completely distorted. You could take any major event of recent times as an example and the difference between your newspaper’s reportage and your online feed would be dramatic. Reading responsible accounts of pollution, terror attack, election result…would give you food for thought. On social media, you would be targeted with stuff doctored to send you into troll mode. \nIf you block the accounts that most inflame you, you deprive them of your attention, you refuse to buy the hate they are selling. Blocking even hurts them with the algorithm. David did defeat Goliath. And make no mistake, this is a civilisational battle. We must fight against the atrophy of our attention, its capture by the most terrible types of things that human nature can be drawn to, to regain our sense and sensibility. \n\n",
        "headline_1": "Baiting With Rage",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/baiting-with-rage/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "Govt should put Sanchar Saathi in app stores, keep improving it & let users decide whether they want it on their phones\nGovt’s clarification that Sanchar Saathi app is not mandatory for new phones may reassure buyers, but the matter doesn’t rest there. Phone makers, almost all of whom are foreign-based, still have to deal with the original order’s ramifications. Reports say Apple has already refused to preload the app on its phones, others are pondering. \nIn hindsight, this controversy was avoidable. The Sanchar Saathi portal launched in May 2023, followed by the app. Govt has been spreading awareness about both via text messages, and they already have many millions of users, no doubt attracted by their success in tracing lost or stolen devices. It could have let the app grow organically, rather than order its compulsory installation on all devices. Or, it could have held public consultations with users, privacy groups and industry before taking a decision. \nThat said, making govt apps mandatory outside an emergency is not a good idea. Phones are our private space, and one mandatory intrusion by govt raises fears of more in the future. Covid justified the Aarogya Setu mandate before the population was vaccinated, but it was only required for accessing public places like airports and railway stations. Is Sanchar Saathi a similar crisis intervention? No. Then, let’s not make it compulsory. Place it in App Store and Google Play, go on improving it, but let users decide whether they want it. \nPhone manufacturing has been one of India’s bigger post-pandemic success stories. In value terms, it more than doubled in just four years, and exports grew nine-fold. To remain on this trajectory, more investments are needed, but jarring orders like this can be discouraging. Industry – especially foreign investors – is never comfortable with the feeling of overreach. Recall what happened when India tried to spur local manufacturing of laptops and tablets in Aug 2023, by announcing import curbs with immediate effect. But as firms stopped shipments, it deferred the curbs a day later, and withdrew them in Oct. Yet, big brands like HP have grown manufacturing capacity in India over the past two years, without govt pressure.\nLikewise, people will adopt Sanchar Saathi in growing numbers when it fulfills a compelling need. It’s good that govt has built infra to prevent cybercrime, equipping it with a supercomputer and AI. But it should be patient with Sanchar Saathi’s growth, and withdraw the order mandating its installation completely. \n\n",
        "headline_1": "Call Back",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/call-back/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "For two weeks, essential health services and routine vaccination programmes have been disrupted as several groups of health workers, including government nurses, medical technologists, pharmacists, and health assistants, continue demonstrations to press long-standing demands. The consequences of such disruptions will be delayed treatment for critical patients, cancellation of basic health services and suspension of newborn registrations and vaccinations, which are essential for preventing disease outbreaks. Such disruptions are unacceptable in any functioning health system.\nSo why has the health ministry failed to resolve this dispute? The Directorate General of Health Services (DGHS) claims that most of the workers' demands have been accepted in principle and that implementation is \"in progress.\" Yet, the workers are not convinced and allege that earlier promises were never fulfilled. This loss of trust has become the core obstacle.\nThe demands themselves highlight long-standing structural issues. Health assistants seek amendments to recruitment rules, an upgrade of their entry post from grade 16 to grade 14, elimination of salary disparities, and recognition as technical staff. Medical technologists and pharmacists want their entry grade raised from 11 to 10—reforms they say have been promised before but never delivered. Nurses are also demonstrating over career progression and pay inequities. These demands merit careful consideration. However, prolonged work stoppages in essential services directly endanger lives and violate service regulations designed to protect patients. The threat of a complete shutdown of hospitals, clinics, diagnostic centres, and educational institutions underscores how vulnerable the health system is to administrative delays and inadequate labour-management mechanisms. Healthcare cannot be held hostage to stalled negotiations. This crisis exposes a larger weakness in public administration: a reactive approach that waits for public pressure instead of addressing these issues early, transparently, and with fixed timelines. When negotiations extend indefinitely and commitments are vague, workers lose faith. When health workers walk out, patients suffer.\nThe government must therefore act swiftly and decisively. If the demands are financially and structurally logical, the relevant ministries should publish a clear implementation roadmap with dates, responsible officials, and measurable steps. If some reforms require budget adjustments or longer timelines, those realities must be communicated openly. Only visible progress can restore credibility. At the same time, health workers must uphold their duty to ensure continuity of essential services. Many countries allow health-sector strikes only under minimum-service requirements. Bangladesh needs similar safeguards to prevent complete shutdowns of critical care and vaccinations. This crisis can be resolved quickly if the government demonstrates clear action and workers respond in good faith. Ultimately, a functional health system relies on trust between authorities, providers, and the public. Rebuilding that trust must begin now.\n",
        "headline_1": "Healthcare workers’ strikes cannot continue",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/healthcare-workers-strikes-cannot-continue-4049721",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "The endorsement of a child rights manifesto by a dozen political parties now preparing for the ultimate contest for popular mandate is a welcome development at a time when child-focused indicators reveal a worsening situation. We commend the leadership of these parties for backing the manifesto that contains 10 commitments, pledging to embed them in their policies and election agendas and acting on them if elected.\nIt was an encouraging moment to witness rival political forces—often accused of endless bickering over governance, heritage, and the nation's future direction—come together for a shared cause. This convergence of commitments to safeguard children's futures by the BNP, Jamaat-e-Islami, National Citizen Party, Jatiya Party, Amar Bangladesh Party, Bangladesher Samajtantrik Dal, Communist Party of Bangladesh, Gano Forum, Ganosamhati Andolon, Gono Odhikar Parishad, Khelafat Majlis, and Nagorik Oikya rightly deserves appreciation. UNICEF's role in convening these parties is equally laudable.\n\nWe hope these parties genuinely recognise the gravity of the challenges children face in relation to nutrition and health, quality education and skills development, an enabling environment for creativity, protection from physical and mental abuse, violence and exploitation, the persistence of child labour, and the growing threats posed by climate change.\nAccording to the Multiple Indicator Cluster Survey 2025, conducted by the Bangladesh Bureau of Statistics and UNICEF, one in eight children under five is \"wasted,\" a life-threatening form of malnutrition. The rate has risen to 12.9 percent in 2025 from 9.8 percent in 2019, while nearly 700,000 babies are born with low birth weight. Child labour has increased from 6.8 percent to 9.2 percent, and 3-4 million school-age children remain out of school. The survey also shows that nearly half of all girls marry before turning 18. In terms of climate and environmental risks, 20 million children are directly exposed to climate hazards, 87 percent of drinking water is contaminated with E. coli, and 15.8 percent contains unsafe levels of arsenic.\n\nThese alarming indicators underscore the urgent need to prioritise development and strengthen governance. The child-focused manifesto, formulated by children and young people themselves, calls for allocating five percent of GDP to education and primary healthcare—in line with global recommendations—compared with the current allocations of two percent for education and one percent for health. As the manifesto rightly notes, every dollar (or taka) spent on child protection yields a ninefold social and economic return. We, therefore, hope politicians across the aisle will support aligning national budgets with these priorities. Since the commitments have been described as \"non-negotiable,\" we remind the signatories that any deviation from their pledged actions will not only erode the trust and respect of young people, but also inflict lasting harm on the nation's future.\n",
        "headline_1": "A promising pledge, but execution is key",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/promising-pledge-execution-key-4048911",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "There is rarely a convenient time for a strike, but the timing of the latest strike by secondary school teachers comes across as particularly surprising. As the annual school examination season begins—a period of high anxiety for students and parents alike—a set of educators have abandoned their duty in an attempt to force the government to meet their demands. We find this move totally irresponsible.\nThe timing could not be worse. According to the government's schedule, annual exams were set to run from November to December, followed swiftly by selection tests and junior scholarship exams wrapping up on New Year's Eve. This is the crunch time of the academic calendar. Yet, instead of quiet concentration in exam halls, students are having to face administrative anarchy.\nThe Directorate of Secondary and Higher Education attempted to regain control with stiff directives, warning that any \"negligence\" in conducting the exams would trigger punitive action. But teachers, organised under various associations, have chosen to ignore these orders. The result is chaos across the country: while some schools held exams, many institutions have suspended tests, according to our reporters. As the coordinator of the movement has said, the boycott is well underway, rendering the government's late-night circulars largely ineffective.\nThe teachers' grievances are numerous and significant, and we urge the government to review and address them properly. Their demands include the upgrading of entry-level assistant teacher posts, the creation of a separate Directorate of Secondary Education, and the reinstatement of benefits withdrawn as far back as 2015. It is possible that these demands have merit. But to hold the future of children hostage in their push for pay and perks is a totally unethical tactic.\nEducation is not a factory line where work abstention merely delays a shipment; it is a time-sensitive endeavour in which disruption can derail academic progression and inflict psychological stress on students. The teachers' coordinator has argued that the government's circulars are an attempt to suppress their movement. He may be right about the government's steps, but he is wrong to assume that this gives his colleagues the moral licence to jeopardise the academic year.\nThe teachers must respect their primary responsibility to students. They claim they will only return if the education ministry sits down with protest leaders. This is the language of blackmail, plain and simple. The teachers may believe they are teaching the government a lesson in power dynamics. In reality, they are sending the wrong message. They should return to classrooms and exam halls immediately for the sake of the students. The government, meanwhile, must expedite efforts to resolve the issues at the root of this crisis.\n",
        "headline_1": "Teachers must not hurt students’ future",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/teachers-must-not-hurt-students-future-4048101",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "We welcome the government's approval of a new ordinance that aims to prevent human trafficking and the smuggling of migrant workers by introducing comprehensive remedial measures. At a time when the overwhelming majority of such cases end in acquittal, the initiative signals a long-overdue recognition that the country's legal and institutional framework has failed some of its most vulnerable citizens. Updating the existing law to align with international standards and clearly define offences related to migrant smuggling—long legally undefined despite its widespread occurrence—is a step in the right direction. Of course, law alone is not enough. But having a proper law can enable effective investigation, prosecution, and ultimately justice for victims.\nA review of official case-disposal records paints a grim picture of how trafficking cases have fared so far. In 2020, the courts disposed of 14 cases, and 13 of them ended in acquittal. In 2021, both disposed cases ended in acquittal. In 2022, all 34 disposed cases met the same fate. The volume of disposed cases surged in 2023 but the acquittal rate remained disturbingly similar, with 415 of 436 cases ending in acquittal. In 2024, out of 363 cases 342 cases resulted in acquittal. Even the first six months of 2025 followed the same pattern, with 132 of 141 disposed cases ending in acquittal. These figures do not suggest the absence of crime, but rather the weakness of investigations, the confusion in legal categorisation, and the inability of our system to hold perpetrators to account.\nThe new law intends to address these gaps. The decision to introduce a separate chapter on the smuggling of migrants (SOM) is particularly noteworthy as an average of 95 percent of SOM cases ended in acquittal over the last four and a half years, largely due to miscategorisation. It also addresses the growing use of online platforms for \"job recruitment\" by traffickers, while limiting the influence of the accused by allowing the freezing of bank accounts, seizing of assets, and restricting of travel during investigation, with court approval of course. Meanwhile, the provision of improved witness protection and safeguards to prevent victims from being pressured into withdrawing complaints could strengthen cases that previously fell apart under intimidation.\nHowever, as we have already noted, law alone is insufficient. Many of those who fall victim to traffickers or smugglers do so out of desperation, poverty, and a lack of safe, legal migration pathways. So if the ordinance is to achieve its stated objective, it must be accompanied by robust implementation, proper training for law enforcement and prosecutors, and sustained awareness campaigns in high-risk communities. Only then can we succeed in suppressing human trafficking.\n",
        "headline_1": "Time to ensure justice in trafficking cases",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/time-ensure-justice-trafficking-cases-4047586",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 04, 2025 00:00:00  \nEndorsement of the Child Rights Manifesto (CRM)--- prepared jointly by children and young people with UNICEF support---by 12 political parties including the major ones likely to come to power through the upcoming election is quite a positive development. By signing the document, these political parties are indeed pledge-bound to honour their commitment when in power. In Almighty Allah's eyes, every child is precious and deserved to be loved, nurtured and honoured with quality care. The Biblical reference to child rights also is highly illuminating where caring for children is a prerequisite for entering heaven. Borrowing from the Bible, Tolstoy inferred that if one wants to enter heaven, one must be like children whose prized possessions are \"humility, simplicity, trust and a lack of worldly snares and pride\". In today's world too, the most child-caring nations are generally the most developed ones. So, the signing of the CRM can be a milestone in the history of Bangladesh politics provided that a political party or their coalition winning the next election sticks to its commitment.\nUnfortunately, the political system and society here have proved they are child-unfriendly. The social structure has developed on disparities and deprivation of children born to homes ---often village huts and urban slums or ghettos---forcing them to wallow in perpetual poverty for generations. Many of these children run away from homes to be street children. When the educated and privileged people feel no qualms about the existence of grinding poverty and dehumanised condition and continue to amass wealth by any means---fair or foul, the system of governance has a crucial role to play for narrowing down the yawning gaps in social classes, living standards and livelihood options. Mere signing of a document without acting decisively to change the lot of the poor and the marginal people is no guarantee for pulling them out of the rut. \nA radical change in the mindset of the ruling class is a prerequisite for influencing social concerns for the deprived. When money looted in billions from banks or financial institutes is allowed to be laundered abroad and the perpetrators can flee the country, it is a betrayal of trust that holds society together. Such treachery is a good enough incentive for people down the rank to engage in criminal activities. The law and order breaks down and the well-being of the poor and the deprived stay out of sight. Without improving the condition of poor and marginal families, it is impossible to ameliorate the lot of the children born to such families. \nAre the political leaderships ready for undertaking such a challenge? Non-performing loans and the laundered money of fabulous sums would be more than enough to launch an effective poverty-reduction programme. Selfish politicians and bureaucracy have time and again proved that their mutual self-serving policies have no intention of sharing the national wealth with the underclass. Even the trickle-down benefits could bring about some change, albeit not up to the mark, at the mid level of society. Clearly, required investments in education of children of the poverty-stricken and calamity-affected families is a key to retaining the young ones in learning process and skill development without which they are ill-equipped to meet the challenges facing them. Equitable distribution of wealth has bypassed the majority of people. Before guaranteeing that children belonging to poor families enjoy their rights, the condition and environment of their households have to be made congenial for the purpose.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Protecting child rights",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/protecting-child-rights-1764776082",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       December 04, 2025 00:00:00  \n\nAnnual examinations in most government primary and secondary schools across the country have been thrown into disarray and uncertainty as several groups of teachers launched an indefinite strike on Monday to press home their various demands, including upgrading their posts and securing a pay hike. While the fact that teachers are poorly paid and deserve a better salary is undeniable, the timing of the movement, enforced while annual exams are underway, has stunned guardians and conscious citizens alike. \nMany guardians and students were not even aware that teachers would launch a strike from December 1. Students who arrived to sit for their exams on Monday were shocked to find that although teachers were present at the school they refrained from participating in any academic activities. In many areas, angry altercations erupted between guardians and teachers. Faced with vehement protests, principals of some schools conducted the examinations with the assistance of staff and guardians who volunteered to carry out exam related duties. \nLaunching a movement over legitimate demands is a democratic right of every citizen. But the question is why the teachers chose to enforce the strike in the middle of the annual examinations, a period of critical importance in every student's academic life. In plain sight, it appears that the timing of the protest was deliberately chosen to create additional pressure on the government to accede to their demands. Why would the teachers stoop so low as to use students' future as a bargaining chip for their own benefit?\nIn the face of widespread criticism, secondary school teachers called off their protest on Tuesday, saying that they would resume the movement after the examinations are over. But a section of primary teachers have threatened to organise an even tougher movement by 'locking the school' from Thursday if the government fails to fulfil their demands.\nThe teachers have to perform their duties with a sense of dedication. When the students cannot sit for their final examination at the fag end of the academic year, they are going to be affected adversely. The teachers themselves are aware of the damage they are causing to the students and have promised to take compensatory measures once the government meets their demands. It does not, however, sound very convincing.\nOne must also ask what toll this disruption would take on the mental state of students in government schools. Their peers in non-government institutions have already completed their exams and are preparing to enjoy the much-awaited December holidays, while they are stuck in a limbo.\nBesides, many are also questioning the legitimacy of some of the demands of the striking teachers. For example, one of the four key demands of the secondary school teachers is the inclusion of assistant teachers in the ninth pay grade under the Bangladesh Civil Service (BCS) General Education cadre. They took the job fully aware that the post of an assistant teacher at a secondary school falls in the 10th pay grade of the government's pay scale. This pay grade was known to them when they applied, sat for the recruitment test, received the appointment letter and joined the post. Why, then, do they now claim they are subjected to \"injustice\"?\nA job in the Bangladesh Civil Service (BCS) is one of the most lucrative and prestigious in the country. The BCS exams are also the most competitive public recruitment process in Bangladesh, with success rates as low as 0.2 per cent for all cadres and 0.05 per cent for general cadres, on average. Those who ace this test go through years of rigorous preparation, proving their dedication, brilliance and intellectual mettle in each step of this fiercely competitive recruitment process. How can one possibly demand recognition as a BCS cadre by resorting to a protest movement and holding students hostage?\nThat said, the quality of education at primary and secondary level in the country has indeed become a matter of concern. Most of the schools do not have the required infrastructure and other facilities needed to impart quality education. The saddest part of the story is that the schools, particularly in the rural areas, do not have qualified teachers. The result has been disastrous, to say the least. Today everybody is talking about poor standards of education and the ever-widening gap between private schools and the shabbily run government schools. As a result, a large chunk of the population is left out of the competition for lucrative jobs. The neglected primary education is responsible for this lopsided state of affairs.\nAgainst this backdrop, it is ironic that teachers appear more concerned about augmenting their benefits through recurrent protests, with one group after another taking to the streets. During the tenure of the interim government over the last 16 months, schools were reportedly closed for at least six months as teachers protested in regular intervals, demanding higher salaries, post upgrades, nationalization, MPO enlistment and so on. As one group of teachers succeeds in realising demands through street protest, another is inspired to follow suit. In the process, millions of students are severely affected, at a time when they are yet to recover from the learning loss suffered during the Covid-19 pandemic.\nEducation has the highest budgetary allocations and, as such, it is really not desirable that the issue of teachers' salary will remain a perpetual concern. Given the complexity of the hierarchy in the government's pay scale, experts' call for a separate pay scale for teachers sounds logical. Why should teachers have to take to the street regularly for a pay hike? However, the education authorities must ensure that the performance of the teachers improves and that they are not neglecting classroom education to teach in coaching centers. So, the issue needs to be examined in all its ramifications. The government should initiate a dialogue with the teachers immediately and resolve the crisis without wasting any more time.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "When teachers hold  students hostage!",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/when-teachers-hold-students-hostage-1764776126",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 04, 2025 00:00:00  \n \nOnce, our land was rich in native fruits such as gab, orboroi, kaufol, golapjam, deua, and karmocha. Our land also produced traditional fragrant rice varieties like kalijira and rajashail. These fruits were natural sources of vitamins B and C, calcium, phosphorus, and many other essential nutrients. They also played an important role in preventing diseases such as diabetes, constipation, and obesity.\nToday, however, the genetic diversity of these valuable native fruits and seeds is disappearing rapidly. The rise of high-yield hybrid varieties and the lack of attention to preserving local ones are the major reasons behind this decline. Climate change and pressures from modern agricultural practices have further accelerated the loss. The disappearance of these native varieties poses a serious threat to our food security as well as the ecological balance of our environment.\nWe must act now to protect this precious natural heritage. Farmers, scientists, and conservationists should work together to establish seed banks where traditional seeds can be collected, preserved, and shared. The government should support and encourage farmers-through subsidies and other incentives-to cultivate native and lesser-known fruits and seeds. At the same time, schools, universities, and research institutions should focus on studying and conserving local varieties.\nTo safeguard our heritage and ensure future food security, saving our native fruits and seeds is not merely important-it is urgently essential.\nIbrahim Khalil \nStudent\nPatuakhali Science and Technology University\nug2108037@lla.pstu.ac.bd\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Saving native fruits and seeds",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/saving-native-fruits-and-seeds-1764776147",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 04, 2025 00:00:00  \n\nIn recent years, Bangladesh has witnessed a sharp rise in shadow entrepreneurship, mainly due to the growth of online and home-based businesses. Platforms like Facebook and Instagram have made it easier for people-especially students, women, and young entrepreneurs-to start ventures with only a very minimal amount of start-up capital. As a result, many sellers are earning well and becoming financially independent, which is a strong indicator of personal empowerment and increased online engagement.\nHowever, most of these businesses operate informally; the majority of e-businesses are neither registered nor taxed, and they lack proper consumer protection and legal accountability. Although the entrepreneurs benefit individually, this trend is creating challenges for the national economy. When thousands of sellers avoid VAT and corporate taxes, the government is deprived of potential revenue that could be invested in development, infrastructure, and social services. In other words, while the personal economy of sellers is improving, the broader economy of Bangladesh is being weakened.\nAnother problem is the unfair competition faced by formally registered businesses. Firms that follow all rules and regulations, pay taxes, and maintain product standards, find it difficult to compete with unregistered sellers who bear none of these expenses. This imbalance discourages formal entrepreneurship and slows the country's transition toward a stable, transparent, and growth-oriented economy. Informal sellers also leave consumers unprotected due to the absence of accountability and quality assurance.\nTo address these concerns, the government should simplify the process of business registration, establish affordable tax rates for micro-entrepreneurs, and launch awareness campaigns on the long-term benefits of formalisation. Social media companies can also contribute by encouraging verified business pages and promoting transparent practices. Bringing shadow entrepreneurs into the formal system will not only safeguard consumers but also boost revenue generation and support the sustainable growth of Bangladesh's economy.\nRafida Moselemin khan\nStudent\nBBA Department \nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Shadow entrepreneurship and its impact",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/shadow-entrepreneurship-and-its-impact-1764776171",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-12-2025"
    }
]