[
    {
        "full_article": "The latest data on investment announcements in the country paint a mixed picture, with varying policy implications. New project announcements by the private sector overall rose to nearly a 15-month high in the first half of this financial year to ₹9.9 lakh crore. Such investments have historically been driven by Indian firms, but that concentration has intensified in the last few years. While Indian firms accounted for 77% of all private sector announcements in 2018-19, that share was 94% in the first half of the current financial year. Taken together, these data points underscore a diametrically opposite outlook on the Indian economy held by domestic and foreign firms. Domestic firms seem increasingly optimistic. It remains to be seen how many of these announcements fructify, but the data show that the value of projects actually completed by Indian firms was also at a near 15-month high so far this fiscal. This should come as a relief to the government, which has been pushing the private sector to invest more. The data also show that most of these new investments are to be in the manufacturing sector — another strong positive for the economy. A large part of these new investments was announced before the GST rate cuts were first made public on August 15, implying the private sector’s confidence goes deeper than an expectation of a temporary demand boost. If the investments do come through, that will leave the government with more fiscal room to address developmental and defence issues, both of which need its attention.Foreign firms, on the other hand, do not seem quite as convinced by the India story. The value of project announcements by foreign companies fell to ₹0.6 lakh crore in the first half of FY26, marking the third consecutive year of decline during this period, and also a five-year low. Several global factors have certainly dampened investor sentiment ever since the COVID-19 pandemic, but the fact remains that global investment outflows nevertheless increased 11% in 2024 and 3% in 2023. While the latest tariff friction with the U.S. would have shaken some confidence in India as an investment destination this year, the government needs to figure out why foreign companies were looking elsewhere even before. The data also reveal that fresh announcements by the government stood at ₹1.5 lakh crore during the period under review, down 71% over the same period last year. This is in line with the Centre’s warnings that it will not be growing its capex as fast as before. However, with the government and foreign companies pulling back, the pressure on Indian firms increases. Simultaneously, the urgency to keep this momentum going through ease of doing business reforms also sharpens. Published - October 04, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        investments\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        economic policy\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        manufacturing and engineering\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        foreign investment\n                    \n                            /                      \n                        \n                        defence\n                    \n                            /                      \n                        \n                        development",
        "headline_1": "​Domestic vitality: On investment announcements, policy implications",
        "headline_2": "Domestic firms show more faith in India than foreign investors",
        "link": "https://www.thehindu.com/opinion/editorial/domestic-vitality-on-investment-announcements-policy-implications/article70121432.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-10-2025"
    },
    {
        "full_article": "President Donald Trump’s 20-point “peace plan” for Gaza has won rare approval from Israel and key Arab countries. While Israel Prime Minister Benjamin Netanyahu says it aligns with Israel’s war objectives, Arab and Muslim leaders have welcomed the initiative as a step towards peace. But one truly important voice is missing — that of any representative of the Palestinian people. When the latest phase of the Gaza war began, following Hamas’s October 7, 2023 attack, Israel vowed to “destroy” the Islamist militant group. Two years on, Israel has turned Gaza into dust and displaced the entire population. Yet, Hamas has not been totally defeated. Any lasting peace hinges on an agreement between Israel and true representatives of Palestinians, even if Hamas is to be kept out. Mr. Trump and Mr. Netanyahu have issued an ultimatum to Hamas: accept the plan or face continued Israeli attacks. The Trump plan promises an immediate ceasefire in return for the release of all hostages. It further states that Palestinians will not be forced to leave. For a population living in makeshift shelters, a ceasefire and the permission to stay on will be a relief. But beyond this veneer of concession, the rest of the plan is structured almost entirely to serve Israeli interests.It proposes to place Gaza under an international governance body overseen by a ‘Board of Peace’, chaired by Mr. Trump. The plan further calls for the deployment of an International Stabilisation Force (ISF) in Gaza, while allowing the Israeli troops to retain “a security perimeter”. Hamas will have to demobilise itself. In essence, Gaza would be placed under a new colonial-type administration and a foreign military force, while Israel would continue to occupy parts of the enclave. Palestinians will be excluded from the top decision making bodies until “reforms of the Palestinian Authority are complete”. This is a plan written in sand. Even if Hamas were to accept the proposal and disband itself, or if Palestinians were to reject Hamas completely, there is no assurance that the Palestinian resistance will wither away. Without a credible pathway to Palestinian statehood, violence will continue in one form or another — the message of October 7. The plan offers no timeline for its lofty goals; it does not specify which countries would contribute troops to the ISF; nor does it clarify who would oversee the implementation process or the “reforms” within the Palestinian Authority. Rather than forcing his ally to end its daily attacks on Palestinians and withdraw through a ceasefire for hostages agreement, Mr. Trump is making an already intractable conflict more complicated. This proposal will not win him peace. Rather, it will drag him deeper into the quicksand of West Asia.\r Published - October 04, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Palestine\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        peace negotiations\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Donald Trump",
        "headline_1": "Peace mirage: On Trump’s ‘peace plan’ for Gaza",
        "headline_2": "The Trump plan serves Israeli goals and does little for Palestinians",
        "link": "https://www.thehindu.com/opinion/editorial/peace-mirage-on-trumps-peace-plan-for-gaza/article70121624.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-10-2025"
    },
    {
        "full_article": "Cartoons are stoking protests; long live cartoons\nCops, stop picking up activists who have Marx on their shelves – they will never finish it. The real threat to national security and sovereignty are kindergarteners with Winnie-the-Pooh tiffin boxes, or Hello Kitty bibs. Or – if you’ve kept up with the symbolism of recent protests in Nepal, Indonesia and Philippines – teens in tees emblazoned with ‘One Piece’ flags. These are hopelessly beyond the ken of inspectors- and directors general of police who can’t tell OneRepublic from One Direction.\nTo the uninitiated, which includes almost everyone Gen Y backwards, the One Piece flag looks like a silly version of the old Jolly Roger pirate flag – from a time when pirates meant business. It’s the same skull and crossbones, but with a yellow straw hat. Not menacing at all. In fact, it’s so endearing that Japanese manga artist Eiichiro Oda, who created the flag and its bearers – pirate Monkey D Luffy and his ‘Straw Hat crew’ – has sold 500mn copies of his comic books since 1997.\nYet, the flag’s emergence as a symbol of Gen Z resistance isn’t surprising. Why? Don’t look for logic or a formula here. The British didn’t imagine chapatis would become a vector for the 1857 revolt. The Chinese state was stumped when Winnie-the-Pooh became a proxy for Xi in 2013, a year after Hello Kitty became the mascot for protests in Hong Kong. Pepe the Frog again raised hackles in Hong Kong in 2019. This year, Pikachu the Pokemon has been used as a symbol by protesters in US and Türkiye. You can’t say what the next symbol of youth resistance will be. Which is key to disruption. As for Marx and Guy Fawkes masks, leave them for conformists who fancy themselves as subversives.\n\n",
        "headline_1": "Vive La Cartoon",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/vive-la-cartoon/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-10-2025"
    },
    {
        "full_article": "The troubling power of public anger over administration\nHis death has amplified Assam musician and local cult figure Zubeen Garg’s impact beyond mere fandom. Here was a singer who brought together a deeply fractured people. His songs comforted, a stark relief from every Assamese fault line of ethnicity, language, faith and region. His music connected – for decades bridged the state’s divisions that governance didn’t mend, that politicians always exploited, that couldn’t be settled for any number of painful reasons. Against this unchanging backdrop, Zubeen sang of the everyday, and fans poured out ‘their soul’ to him. As we are witnessing, Zubeen’s legacy is not just his music – it is the community his work created that lifted all Assamese above their differences.\nIt is this community that’s railing against the sudden void his death has created. Unsurprisingly then, and as with many cases of collective grief, conspiracy theories have flourished. Zubeen was for no political party. But he wasn’t apolitical either. A viral video now shows him saying, “I am just a human. I have no caste, no religion, and no God.” Collective mourning, especially when it’s so demonstrative, can morph into flaming anger without any obvious provocation. And anger on such a scale irrationally looks for someone to blame. If elections are due in not too distant a future – Assam votes next year – that need to blame can have electoral consequences. Which is why, despite Singapore police having given the all-clear and clearly indicating there was nothing amiss in Zubeen’s death, the musician’s aides were arrested. This is, of course, a tricky slope. Across Assam, 60 FIRs have been filed ‘seeking justice’. This has to be one of the best demonstrations of the troubling power irrational public demands can have over administrative decisions, especially when electoral apprehensions are in the mix.\n\n",
        "headline_1": "Zubeen: Grief To FIRs",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/zubeen-grief-to-firs/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-10-2025"
    },
    {
        "full_article": "Commonly unknown facts about common knowledge\nThe purpose of language is to coordinate human behaviour and this starts from the earliest moments in our life. When three-year-olds are taught the word ‘mouse’ they do not worry that it means other things to other people. They tacitly assume ‘common knowledge’. The same cognitive talent also takes its own outputs and feeds these back into more cognition, which is how human progress happens.\nThus, in his new book When Everyone Knows That Everyone Knows…Common Knowledge and the Science of Harmony, Hypocrisy and Outrage, cognitive scientist Steven Pinker has a new focal point (common knowledge) alongside the running theme of his broader work, ‘recursive mentalising’. As in, I know something and you know it with common knowledge, also, I know that you know it and I know that you know that I know…\nPluralistic ignorance | In dictatorships, people conceal their political opinion to avoid being punished, so they can’t know if their discontent is widely shared. A demonstration in a public place can, however, generate the common knowledge needed to coordinate resistance.\nWhy have the past two decades seen the success rate of nonviolent civil resistance campaigns start to decline (though they still outperform the violent ones)? Because of the dictators’ learning curve. Their censors now squelch posts that might coordinate action.\nYou can’t agree to disagree | Facts don’t care about your feelings. Pinker asks, why should the SARS-CoV-2 virus, or life on Mars, or the gunman of Nov 1963, care about your melanin or your genitals or your DNA or what you learned at your mother’s knee? Real human disagreements can come from dishonesty as much as from incompetence. Either way, what we need to do is make our own deliberation more rational. \nThe cancelling instinct | It comes from the fear that common knowledge is what makes an idea dangerous. What Pinker reminds us is that the moral order did not collapse when people accepted that the Earth was not the centre of the cosmos, nor that humans were descended from apes.\nHumans have clawed increments of progress out of an indifferent universe only by the process of conjecture and refutation, where the better ideas prevail in the long run. Universities cannot discover and transmit knowledge without intellectual freedom. And an academic establishment that stifles debate can end up providing false guidance on vital issues.\nPinker writes that many of the early policies for combatting the pandemic – including draconian lockdowns – have now been revealed as not being based on scientific evidence. They were imposed by demonising what turned out to be reasonable criticisms. The toll this took on the economy, on mental health, on children’s education also undercut people’s trust in science and public health.\nRational hypocrisy | But guess what Pinker says is the ultimate dishonesty? Calling for complete honesty! Everywhere the rationale for obliterating zones of privacy is, if you aren’t doing anything wrong you should have nothing to hide. But neither authentic human relationships nor homo sapiens’ overall interdependence would survive making every wisecrack, conversation and thought public.\nWhile the historical trend of transparency is welcome, civilisation won’t survive putting every kind of private and reciprocal knowledge into common knowledge.\n\n",
        "headline_1": "I Know, You Know…",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/i-know-you-know/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-10-2025"
    },
    {
        "full_article": "By Farida Khanam\nThe International Day of Nonviolence is observed on Oct 2, MK Gandhi’s birthday. It encourages us to pledge ‘the universal relevance of the principle of nonviolence’ and the goal ‘to establish a culture of peace, tolerance, understanding, and nonviolence’. In fact, nonviolence is more powerful than the strongest weapon of destruction created by human beings.\nNonviolence is considered a high human value across all castes and religions; for example, the Mahabharat contains multiple references to ahimsa paramo dharm , meaning that nonviolence is the greatest virtue. The Prophet of Islam said, God grants to nonviolence what he does not grant to violence, Sahih Muslim: 2593.\n\nIn an era when violence frequently makes headlines, Gandhi’s legacy reminds us that lasting revolutions are won not on battlefields but in the realm of ideas. His philosophy not only changed the course of India’s independence movement but also provided the world with a model of resistance based on patience, tolerance, and moral courage.\nWhen Gandhi launched his nonviolent struggle, the British found themselves powerless. Accustomed to crushing violent revolts with force, they lost the moral ground. So baffled was one officer that he reportedly wired London: “Kindly advise how to kill atiger nonviolently.” Gandhi had moved the fight from battlefield to the moral realm, where the empire had no weapon.\nBy 1947, India had gained its independence, but Gandhi’s contribution was far greater than just the political freedom of one country. He proved to the world that peace can be a more powerful force than war.\nGandhi believed violence was the lowest use of human potential, while peace was the highest. Peace creates stability, freedom, and growth, whereas violence only breeds fear, suppresses creativity, and closes the door to progress.\nAustrian psychologist Alfred Adler once wrote that human beings alone possess the ability to “turn a minus into a plus”. Gandhi’s life embodied this truth. He showed that setbacks, when met with patience, tolerance and determination, could be turned into opportunities. Nonviolence, therefore, was not a passive retreat but an active use of human potential through discipline and restraint.\n“Where there is tolerance, peace prevails; where there is intolerance, war and chaos follow.” Gandhi’s principles remain just as relevant within families as they are between nations. Without tolerance, peace remains just an imaginable dream.\n“Peaceful revolution is the outcome of peaceful thinking,” Maulana Wahiduddin Khan wrote. According to him, Gandhi’s struggle was rooted in patience and forbearance. He believed that Gandhi had shown the world how truth could triumph without bloodshed.\nFor Maulana, peace was not just desirable but intrinsic to human nature. “Man was born in peace. Man must die in peace. Peace is man’s birthright — God’s greatest blessing to humanity,” he said. In this sense, Gandhi’s legacy extended beyond India’s freedom movement. It was auniversal call for humanity to rediscover its natural state of harmony.\nGandhi’s philosophy has since inspired many movements, from the American civil rights movement led by Martin Luther King Jr to Nelson Mandela’s fight against apartheid. Gandhi’s legacy of nonviolence endures as a reminder that peace, tolerance and moral courage remain the strongest forces for lasting change.\nThe write is chairperson, Centre for Peace and Spirituality International\n\n",
        "headline_1": "Nonviolence: A force stronger than war",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/nonviolence-a-force-stronger-than-war/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 04, 2025 00:00:00  \nAdmittedly, in the post-autocracy dispensation, the volume of inward remittance has been demonstrating a steady rise as the expatriate workers are turning in greater numbers to official money transfer channels including banks and authorised digital platforms. The highest ever remittance receipt registered in the county's history in March 2025 at US$3.29 billion highlights this. They are avoiding informal routes like the so-called hundi or hawala to send their money home. Of course, offer of various benefits to use official channels has obviously played its part. However, one cannot also deny here the vital role played by the digital platforms which facilitated faster and more secure transfer of money to their recipients at affordable costs. Considering the ever-growing potential of the remittance sector, which at the moment is being supported by about 15 million expatriate workers operating from some 176 host countries, the local Mobile Financial Service (MFS) providers including bKash, Nagad, Rocket, Upay and Sure Cash have for understandable reasons been raising their stakes in the remittance sector.\nIn fact, with the advancement of technology, especially fintech, of which MFS is a particular application that uses mobile phones for banking, payments and money transfers, etc., is expected to come up with more innovative solutions so that its service is more inclusive and can reach a greater number of clients that include the unbanked and the least digitally literate. It would be worthwhile to note at this point the recent workshop titled, \"Changing landscape and emerging potential of remittance in Bangladesh\" organized by bKash, the country's leading MFS service provider, where different banks and Money Transfer Operators (MTOs) participated. Since expatriate workers are increasingly switching to low-cost, secure and instant money transfer options, the stakeholders at the workshop emphasized the importance of next-generation technologies and a coordinated service approach across the remittance ecosystem. In fact, meeting the remitters' actual needs to their satisfaction is the key to a robust remittance transfer regime functioning through legal channels. On this score, the agility of the government's policy measures capable of keeping pace with the evolving global practices is essential.\nAt the same time, the financial service providers would be required to enhance their collaborative efforts to create a congenial remittance ecosystem among all the stakeholders including MFS providers, banks and MTOs both foreign and local in order that their service is faster, cost-effective and interoperable. Of course, to ensure better remittance transfer experience, the importance of increased investment in a technology-based infrastructure cannot be overstated. This would facilitate introduction of advanced technology such as easy-to-use apps and secure online platforms. Notably, such technologies proritise user security as they use advanced encryption, better authentication options to verify user's identity such as the two-factor authentication (2FA) and anti-money laundering (AML) protocols and so on. Such tech-enabled services ensure better protection of remitters' funds and compliance with local and international financial regulations. \nAlso, the innovations enable the clients to keep tabs on their transactions through real-time tracking and instant updates. Use of innovative fintech tools not only makes the remitters and the recipients feel secure about their transactions, they also develop a sense of control on their transactions. However, technology alone is not the answer to the continued development and growth of the remittance sector. Neither would the prevailing overseas job providing arrangements, which cannot be termed jobseeker-friendly, automatically boost the remittance sectors' potential. The government should free the recruitment process from middlemen, hassles and unnecessary charges. As the country is lagging far behind its neighbours in remittance earning, it is time those seeking employment abroad are trained in such skills as have demand in overseas job markets. That would help expat workers become more competitive in the international job market. So, for the growth of a thriving remittance sector what is necessary is increased investment in human resource building as well as development of an advanced, supportive technological infrastructure.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Innovative fintech to aid remittance growth",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/innovative-fintech-to-aid-remittance-growth-1759496609",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       October 04, 2025 00:00:00  \nAudit reports are powerful documents in the world of finance. They are meant to be pillars of trust that help investors, banks, donors and regulators make sense of the often-complex world of corporate activity. As independent watchdogs, auditors provide a vital check on a company's financial health. Since no stakeholder can possibly sift through the millions of transactions a company records, they lean on auditors' opinions as a form of assurance. Investors look to these reports before putting money on the line, banks assess creditworthiness through them, donors verify the proper use of funds and even tax authorities rely on them to verify reported profits. However, when this watchdog stays silent instead of raising the alarm, the consequences can be severe and costly. Wrong decisions are made, resources wasted and confidence in companies suffer a serious blow. It is precisely this broad influence that gives auditors their central role in the system of financial accountability. \nYet, for all their power, audit reports have inherent limits. They offer neither absolute guarantees nor perfect insight. By their nature and according to convention, they only express an opinion based on sampling, estimation and judgment. A common defence from audit firms is that their role is to provide 'reasonable assurance,' not absolute certainty. While this is technically correct, it must not become a shield for careless practice. Users of financial statements rightly expect auditors to do more than simply endorse management's narratives. They expect professional scepticism, a proactive investigation of red flags and the application of sound, responsible judgment. \nUnfortunately, the standard of 'reasonable assurance' has repeatedly proven to be a low bar to clear for audit firms. Time and again investors have been misled and lost huge sums after relying on certified financial statements unravelled later. A well-known case is the 2013 scandal involving Tesco in the United Kingdom. The retail giant received a clean audit opinion from PwC, only for it to be revealed soon after that the company had inflated its income by £263 million. The misleading report cost investors heavily, including Warren Buffett who lost about $750 million on his stake.\nCloser to home, Bangladesh has seen similar failures with equally devastating results. In 2023, several banks faced a crisis when audit firms failed to detect the massive burden of bad loans dragging them down. The audited financial statements of First Security Islami Bank Limited (FSIBL) that year, for example, reported non-performing loans of just over Tk 20 billion, less than four per cent of its total loans. On the strength of that report the bank received an A plus rating for long-term credit and ST two for short-term implying a healthy banking institution. But soon after the political change in August 2024, the truth emerged. Internal and central bank audits revealed widespread fraud and an actual non-performing loan ratio exceeding twenty per cent, a level that is considered dangerous. The bank's cash counters nearly shut down due to pressure from panicked customers trying to withdraw their deposits. It became clear that if the accounts had been prepared honestly, the bank would not have shown any profit at all which proved the certified audit report was completely divorced from reality. Just like FSIBL, multiple other banks were later found in similar situations where auditors rubber-stamped their financial statements without proper scrutiny.\nSo why does this keep happening? Part of the answer lies in the way audit reports have long been misused as tools of convenience. It was once common knowledge that many companies in Bangladesh prepared three different audit reports for the same fiscal year, each tailored to a different audience. One would be submitted to tax authorities showing losses or reduced profits to lower tax liabilities. Another would go to VAT authorities with understated sales figures to reduce VAT payments. A third, showing robust profits and high transaction volumes, would be presented to banks to secure generous credit facilities. Tax and VAT officials often searched for these alternate reports, knowing they could demand higher payments if they found them. The introduction of the Document Verification System (DVS) has curbed some of these practices by assigning a unique Document Verification Code (DVC) to each report, making it harder to produce multiple versions. But the problem has not vanished. Many audit firms have still not fully complied with the NBR's requirement that every audit report include a DVC. In practice some continue to sign off on financial statements without conducting rigorous audits that allow manipulation to persist.\nWhen audit reports are not grounded in reality, it especially creates challenges for income tax authorities. Tax officials rely heavily on them to avoid the impractical task of verifying every financial transaction. This reliance, however, turns into vulnerability when reports are inaccurate and they can provide corrupt officials with a pretext to demand bribes as well. Standard practice sees tax officials accepting these reports at face value, only delving deeper if large-scale evasion is suspected. Otherwise, tax assessments are usually confined to clear, rule-based items like allowable expense limits and source tax deductions. But when in-depth investigations do uncover discrepancies, the Income Tax Act of 2023 allows for penalties against the chartered accountancy firm, with fines ranging from Tk 50,000 to Tk 200,000. However, compared to the massive losses such false audits inflict on the state exchequer, penalties amount to little more than a slap on the wrist, doing next to nothing to keep misconduct in check.\nAudit firms must remember that their profession commands respect precisely because it serves the public interest. An audit report is only as credible as the integrity and effort behind it. If firms abandon professional standards, they erode the very respect that sustains them. In time their work will cease to be valued and the demand for their services will decline within the financial system as well.\nshowaib434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Deficient audits and crisis of credibility",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/deficient-audits-and-crisis-of-credibility-1759496640",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       October 04, 2025 00:00:00  \nA news report, carried in a vernacular daily, revealed that approximately 60 per cent of the seats in the country's state-owned technical schools and colleges remain vacant each year. This situation, while disappointing, also presents an opportunity for improvement in the country's overall technical and vocational education (TVE). \nCurrently, there are mainly two types of institutions providing TVE under various curricula. These institutions are: (i) Polytechnics and (ii) Technical Schools and Colleges (TSCs). At present, there are 50 polytechnic institutes and 155 government technical schools and colleges operating under the Directorate of Technical Education (DTE). TSCs provide certification-level education, while polytechnics offer diplomas. There is also one degree-level technical teachers' training college and four engineering colleges under the DTE. At present there are 12,704 Technical and Vocational Education and Training (TVET) institutes across the country approved by the Bangladesh Technical Education Board (BTEB). Of these, only 1,205 are government-owned and the remaining 10,869 are in the private sector. \nDTE-owned TSCs are designed to educate students for appearing at secondary school certificate (SSC) and higher secondary school certificate (HSC) examinations under the Technical Education Board. After passing the examinations, students get vocational certificates. Thus, the curricula of these schools and colleges are a mix of general and technical education with greater focus on technical subjects. The objective is to develop the technical skills of students and train them to adopt advanced techniques. \nIn an apparent bid to expand the network of technical education and make it popular, the government has already decided to build 429 TSCs in 429 upazilas in the country. The previous Awami League government initiated the construction of these schools and colleges under two development projects. Although the project completion deadline is December this year, 338 institutes are still under construction, and there is a move to extend the deadline for both projects to complete the construction works. \nThe projects were actually undertaken as part of enhancing physical infrastructure to showcase the advancement in development works. The ousted regime prioritised the construction of physical infrastructure in various sectors, mostly at inflated costs, to the benefit of rent-seeking party members. Thus several buildings, culverts, and bridges constructed are underutilised or non-utilised. Construction of TSCs without properly reviewing the shortcomings of the technical education also reflects similar short-sightedness.\nThough the need for technical and vocational education is indisputable, there is a lack of effective measures to make it popular and build awareness among the people about the necessity of TVET. The carrier path of TVET is also unclear, as there is an excessive emphasis on general lines of education. The Population and Housing Census 2022 showed that less than one per cent of the population in the field of education opts for technical or vocational education or training. Instead, more are gradually leaning towards religious education. The census also showed that the population ratio obtaining religious education increased to 7.19 per cent in 2021 from 5.58 per cent in 2011 and 3.16 per cent in 2001. The reasons for this shift could be a lack of awareness about the potential career opportunities in technical fields, the perceived social status of technical professions, and the lack of proper guidance for students. Again, at the national level, general education occupies the highest share, with 89.26 per cent. The technical and vocational education ratio stood at 0.81 per cent in 2022, compared with 0.71 per cent in 2011 and 0.41 per cent in 2001. \nThe census finding is thus critical for charting the country's TVET course as it is still less attractive to parents and students. Before investing in more institutions without developing adequate human resources for teaching and training and providing necessary logistics, it will be sheer waste of public money. Revising the curricula is also necessary to accommodate global trend.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Too many technical institutions and too few students",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/too-many-technical-institutions-and-too-few-students-1759496679",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 04, 2025 00:00:00  \n\nThe ongoing move by the Bangladesh Bank to purchase US dollars from commercial banks at higher exchange rates has sparked considerable debate. To many observers, paying more than necessary for foreign currency appears counterintuitive. Yet this policy is not a flaw; rather, it is a calculated intervention designed to protect Bangladesh's economic stability.\nIn recent months, the Bangladeshi Taka has shown signs of appreciation against the US dollar. While a stronger currency may seem advantageous, it actually raises the cost of Bangladeshi exports for international buyers. For an economy where over 80 per cent of export earnings come from the ready-made garment sector, even a slight rise in currency value can make Bangladeshi products less competitive compared to rivals like Vietnam or Cambodia. By buying dollars at a higher rate, the Bangladesh Bank is deliberately slowing down the pace of Taka appreciation, ensuring that exports remain affordable and global buyers continue to prefer Bangladesh over its competitors.\nBesides, remittances, which contribute more than US$20 billion annually to the economy, also depend heavily on exchange rate stability. If the Taka strengthens excessively, expatriate workers receive fewer local currencies per dollar, which reduces their incentive to send money through official banking channels. This creates the risk of driving more transactions into informal systems such as hundi. Maintaining a favourable exchange rate not only sustains remittance inflows but also strengthens the formal financial system.\nBeyond exports and remittances, a stable exchange rate plays a crucial role in boosting foreign exchange reserves, offering predictability to importers, and signalling confidence to foreign investors. Rather than waiting for a crisis, the Bangladesh Bank is acting preemptively to avoid destabilizing currency volatility.\nThe central bank's decision to buy dollars at higher rates is not about incurring immediate losses; it is about securing long-term protection for the economy. By managing the exchange rate strategically, the Bangladesh Bank is shielding exporters, encouraging remittance flows, and safeguarding overall economic resilience. In today's globalized environment, exchange rate management is not merely a financial policy but a matter of national strategy.\nTahmid Hasnine Tashfin\nDepartment of Accounting & Finance\nNorth South University\ntahmid.tashfin@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Logic behind BB's dollar purchase",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/logic-behind-bbs-dollar-purchase-1759496707",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-10-2025"
    }
]