[
    {
        "full_article": "During its slow crawl over Sri Lanka in November, Cyclone Ditwah was a rain machine that repeatedly swept over the same areas for days, eventually precipitating a national disaster with widespread flooding. Fourteen lakh people were affected, and at least 474 were killed. After crossing Sri Lanka, the system re-entered the Bay of Bengal and briefly reintensified, bringing heavy rains to north Tamil Nadu and south Andhra Pradesh. By December 1, the storm’s remnant parked itself off Chennai’s coast as a deep depression. The next day, after around 18 cm of rain over 24 hours, the city woke to flooded streets and widespread waterlogging. While that much rain would test any urban drainage system, public frustration has mounted. That Ditwah was tricky to predict made matters worse. Chennai’s storm water network has been rebuilt and extended after the 2015 floods, and again since 2023, but it cannot be flood-proof. Integrated projects in local basins are designed to handle intense bursts rather than hours of heavy rain. The GCC has said that it has spent ₹5,200 crore over four years to add around 1,100 km of new drains, with three-fourths of the work done. A separate endeavour to fix smaller broken links is incomplete, leaving many streets waterlogged. Chennai’s flat layout, increasing paved area, and the three rivers running through it from catchments in Tiruvallur and Kancheepuram also mean that when a storm system inundates those basins and Chennai together, water levels will rise quickly. Recent floods in north Chennai exposed the encroachment and shoddy desilting of the Kosasthalaiyar. With its ability to tolerate flooding diminished, the GCC had to shut some drains and pump stagnant waters against reverse flow. By lingering near Chennai, the new storm had similar effects.The Thiruppugazh Committee appointed after the 2021 floods produced a 600-page report with basin-wise recommendations and numerous measures. The State government has cited this report while justifying design changes and drain upgrades, building artificial water bodies, and seeking central funds for an ‘Integrated Urban Flood Management’ project, yet the report remains out of public view. There is also no verifiable consolidated implementation plan with a deadline. Flood maps and elevation models exist for the Chennai basin but they are not a shared reference for enforcement and relief efforts, while proper zoning and limits on construction continue to elude residents. Thus, the rains underline an unresolved story while spotlighting gaps in infrastructure and transparency. As the upgrades take shape, the State must publish the report and ensure hazard maps and basin-wide coordination efforts as well as temporary solutions such as pumps keep pace with the storms that routinely test them. Published - December 04, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        cyclones\n                    \n                            /                      \n                        \n                        Sri Lanka\n                    \n                            /                      \n                        \n                        natural disasters\n                    \n                            /                      \n                        \n                        rains\n                    \n                            /                      \n                        \n                        flood\n                    \n                            /                      \n                        \n                        oceans\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Andhra Pradesh\n                    \n                            /                      \n                        \n                        weather\n                    \n                            /                      \n                        \n                        urban planning\n                    \n                            /                      \n                        \n                        Chennai\n                    \n                            /                      \n                        \n                        Chennai rains 2015",
        "headline_1": "Sting in the tail: on Cyclone Ditwah, its impact",
        "headline_2": "Ditwah devastated Sri Lanka, and exposed infrastructure gaps in India",
        "link": "https://www.thehindu.com/opinion/editorial/sting-in-the-tail-on-cyclone-ditwah-its-impact/article70353492.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "Systematic efforts are required to eliminate stigma, that are often seeded by fear, misinformation or ancient beliefs, and to remove the discriminatory attitudes towards those affected. The Supreme Court of India’s intervention to battle stigma and discrimination in the case of leprosy is a corrective action that could not have been delayed any further. On a direction from the Court, the NHRC recently submitted that 97 central and State laws continue to contain provisions that discriminate against persons with leprosy. In sum and substance, these provisions deny access to things as basic as public transport and public spaces, right to run for elected office, and access to employment, or running a business venture. The Court was hearing a batch of petitions contending that there were a number of provisions across central and State statutes that discriminate against persons with leprosy. Caused mainly by the bacterium, Mycobacterium leprae, leprosy is among the earliest known infections to affect humans, with skeletal evidence dating back to 2000 BCE. Today, India continues to report about 57 % of leprosy cases worldwide, with genetic predisposition and living in unsanitary conditions raising the susceptibility. The NHRC, which has been in pursuit of this issue since 2021, first put out a comprehensive document that recommended early identification, timely treatment, rehabilitation, and removing discriminatory practices to ensure dignity and equal access to fundamental rights for persons with leprosy. This includes a plea to the Centre to enact a law to replace derogatory terminology that persists in the laws of the land, and a pointed recommendation to the Unique Identification Authority of India to promote the use of iris scans for Aadhaar enrolment, as leprosy primarily affects the fingertips, through nerve damage.Given that a plethora of medical advancements have enabled leprosy to be a non-infectious condition, and be fully curable with the right interventions, it will be a shame to allow these discriminatory, antediluvian provisions to continue to be in force. The judges directed all States and Union Territories to submit reports detailing the steps that they have initiated in this regard. In fact, armed with the evidence that the NHRC has provided, the Centre and States must set themselves the urgent task of removing these provisions, and launching remedial action. In this day and age, it is unfathomable that the state continues to trap a group of citizens in the dark ages based on laws written by humans who did not know better..   Published - December 04, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        medicine\n                    \n                            /                      \n                        \n                        medical conditions\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        public transport\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Aadhaar",
        "headline_1": "Taking the leap: on leprosy in India and discrimination",
        "headline_2": "Discriminatory provisions that impede lives of those with leprosy must go",
        "link": "https://www.thehindu.com/opinion/editorial/taking-the-leap-on-leprosy-in-india-and-discriminatioin/article70353527.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "Neighbourhood dogs protect an abandoned newborn. Something in us is deeply drawn to such stories \nIt’s a few weeks to Christmas but something very Christmassy has happened. A newborn was abandoned near a toilet in Bengal’s Nabadwip town. Nothing merry about this. But a ring of neighbourhood dogs circled the baby boy, keeping guard until a resident took over at dawn. As she said, those dogs, the ones we often chase away, did what many humans wouldn’t. \nHow we treat those who cannot protect themselves is, of course, a fundamental measure of our society’s health. This is why stories of abandoned children finding an unexpected caretaker move us so much. And in this scenario, when it is an animal that turns up as the protector, the moral actor, there is a further impact: an inversion of the presumed superiority of humans over non-humans. Mowgli is perhaps the most storied such child today – created by Rudyard Kipling, raised by wolves in an Indian jungle, taught by Baloo the bear and Bagheera the panther. But his lineage is long. For example, Romulus and Remus, legendary founders of Rome, were nursed by a she-wolf. As these stories are passed on from one generation to another, so are their question marks on human exceptionalism.\nSpecifically in India, ‘found’ children being raised into greatness is a powerful trope. In Mahabharat, a charioteer’s family rescues a child from the Ganga, and he becomes the noble warrior Karna. In Ramayan, King Janak finds a child in the field, and she becomes the noble Sita. In blockbuster Baahubali, this finding is the foundational scene. It’s actually impossible to separate the pull of JK Rowling’s Harry Potter, Shekhar Kapur’s Mr India, Salman Rushdie’s Saleem Sinai, Sarat Chandra Chattopadhyay’s Lalita…from the orphan archetype. Maybe because of the abandonment anxiety deep within us. Narratives that flip the script and bring strangers to the rescue, promise that the world is less cruel than we fear.\n\n",
        "headline_1": "UnCruel Night",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/uncruel-night/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "Modern sport offers great lessons in branding, how to cash in on a name long after the talent’s gone\nIt’s said you aren’t a brand until the world knows you by one name. Like Messi, who starts his four-city tour of India next weekend. In that sense, Messi has had it easier than, say, Kohli, or Neeraj. In Recanati, the little Italian town that his forebears left in the 1890s, only about a dozen Messis remain. So, Messi can’t know how hard it is to be a brand when you’re born Rohit Sharma . But once you get there, the rewards are well worth the slog.\nStadium tickets for Messi’s celebrity matches are already sold out. Yet, what he makes over his three days in India would be nothing compared with his $1.2bn-plus career earnings. And money is only part of the deal. Heavyweight boxing champ Klitschko is mayor of Kyiv. When the Saudis met Trump at White House mid-Nov, they brought along Messi’s rival for GOAT-hood, Ronaldo. Not in a bag, as they like to, but in a suit. And Trump said that introducing his son Barron to Ronaldo, had raised him “a little bit more now” in the lad’s eyes. Given that Barron is 19, and 6’9”, Trump must be equal parts shocked and grateful. \nFame passes, though. What stays, if you’re careful, unlike Tyson and Becker, is the stash of career earnings. And if you nurture your brand carefully, it keeps paying even when your hung boots have turned mouldy. Our own Kapil, Gavaskar, Tendulkar remain brands with occasional endorsements. Perhaps the greatest endorsement of all is the one formed by association. Like ‘Sandow’, which remains shorthand for a man’s vest in many parts of India, 120 years after the proto-bodybuilder’s India tour. \nEugen Sandow was probably the first sports celebrity who turned himself into a brand, and launched products ranging from magazines to corsets and cocoa. Corsets? You can say that about Messi endorsing Qatari telco Ooredoo, or Beckham being the face of SharkNinja air fryer. Sometimes, the products sportspersons endorse don’t gel with their personal brand. But if the money is good, why not? This year, the 50 top sports earners will take home $1.04bn just from endorsements and non-playing events. They’ve come a long way from the time when Edwin Moses, who won 107 consecutive golds in 400m hurdles, made less than $500,000 in a year. And the money is only getting bigger.\n\n",
        "headline_1": "Money Ball",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/money-ball/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "So, you still don’t believe in miracles?\nOn Nov 15, I was devastated; a fortnight later, I was uplifted. Incredulously. The long-defunct fire temple of my Kolkata childhood had literally risen from the ashes. Last Sunday I woke to a WhatsApp from my TOI Kolkata colleague, Subhro Niyogi. It was his report from that morning’s edition, ‘City’s oldest agiary not lost to fire, believers call it a miracle.’\nWhat else could it be if not one? A fortnight earlier, a raging fire had gutted a swathe of the city’s congested Ezra Street ( and me no less since I’d lived there for my first 23 years). Subhro’s report then was titled, ‘Blaze ravages a slice of city’s Parsi link as flames destroy 186-yr-old fire temple’. And now here were the contradicting photographs.  \nThe roof, giant Tuscan pillars, Doric pilasters stood derelict but still imposing – clearly unfazed by the fire which had razed the surrounding illegal stalls; over the past 50+ years, these had entirely swallowed our agiary’s expansive  compound. Raising even more goosebumps was the image of the intact inner sanctum’s huge  afargan in which the sacred fire had continuously burned for 126 years before it died down forever – snuffed out by obdurately warring, once-fabled trustee-family. In its corner remained the now-tarnished bell, whose’ stentorian gongs had marked  the five gehs which divide  Zoroastrianism’s 24-hour cycle. \nHonour among thieves? Trustees long gone, and custodian registrar indifferent, the encroaching shopkeepers had reportedly pitched in to repair, replaster, repolish the exterior. Rs 80 lakh worth of facade work was completed just before the fire. Md Islam, 87, had looked after the property for 45 years; his shopkeeper son, Iftekar Husain said, ‘We felt we could not flourish at the expense of the temple’s decline.’\nNo one has been more affected by the agiary’s supposed fall and miraculous rise than me and my sisters. Our now-lost 100+ year-old house shared a wall with it. We woke to the fragrance of sandalwood mingling with the aroma of onions frying in our kitchen; the metronome of its gongs marked our quotidian tasks.  And proximity allowed us to drop in to ask for favours as casually as a neighbour for a cup of flour. \nThis awe-inspiring proof  that faith can never be singed has invigorated  the fast-depleting Kolkaka Parsi community.  But there’s also sobering irony. Encroachers came to the rescue of a fire temple that its legit protectors/worshippers could not save. William Cowper’s 1774 hymn was right: ‘God moves in a mysterious way, His wonders to perform.’ \n                                 ***\nAlec Smart said: “Rupee’s getting Trumped.”\n\n",
        "headline_1": "Faith accompli",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/faith-accompli/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "Social media makes money by algohacking many human brains. Contrast that model with responsible media’s \nAnger can be a useful emotion. It can play a key role in building a strong individual psyche, as also a  just society. But the algohacking of our brains to keep them in a state of incessant anger? That’s pure poison. Some companies and individuals draw colossal profits from it, but at terrible cost to general well-being. That rage bait has been declared Oxford’s word of 2025 is indicative of the spread of this poison. In 2024, it was brain rot that came on top. Both speak of the same diseased online ecosystem. Enshittification is another name for it, given by Cory Doctorow. Attention deficit epidemic, is how Jonathan Haidt annotates it. All of this is bad enough for adults, but what it’s doing to children is a great nightmare. \nSpecifically, rage bait refers to online content designed to elicit anger or outrage. Once tech platforms figured out how this kind of content spirals user engagement, the algorithms got tweaked to feed us more and more of the same, activating a diabolical incentive structure of hate. Of course, in this swamp, reality is completely distorted. You could take any major event of recent times as an example and the difference between your newspaper’s reportage and your online feed would be dramatic. Reading responsible accounts of pollution, terror attack, election result…would give you food for thought. On social media, you would be targeted with stuff doctored to send you into troll mode. \nIf you block the accounts that most inflame you, you deprive them of your attention, you refuse to buy the hate they are selling. Blocking even hurts them with the algorithm. David did defeat Goliath. And make no mistake, this is a civilisational battle. We must fight against the atrophy of our attention, its capture by the most terrible types of things that human nature can be drawn to, to regain our sense and sensibility. \n\n",
        "headline_1": "Baiting With Rage",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/baiting-with-rage/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "The UN Climate Conference COP30, held from November 10-21 in Belém, Brazil, concluded with a mix of hope and disappointment. The conference was described beforehand as the \"Implementation COP.\" Many, including climate-vulnerable countries like Bangladesh, expected COP30 to deliver concrete actions from empty promises by finally translating money, policies, and clear plans into climate commitments, but no major breakthrough was achieved, particularly in phasing out fossil fuels and advancing climate finance. However, new platforms for cooperation and some valuable opportunities were created, which can benefit countries already experiencing severe impacts from rising temperatures, storms, sea-level rise, and livelihood losses.\nThree major tensions shaped almost every part of the conference. First, over 80 countries wanted a clear global plan to phase out fossil fuels, but a few powerful producers blocked it, so the final agreement made no commitment to ending fossil fuels. Second, developing countries said they cannot cut emissions or adapt to climate impacts without reliable financial support from richer nations, but participating countries could not agree on how much money should be provided or by when. Third, poorer, climate-vulnerable nations raised concerns about fairness, fearing that stringent climate actions might slow their economic growth even though they contributed least to the crisis.\nDespite these tensions, one key outcome of COP30 was the launch of a two-year Climate Finance Work Programme to advance the \"Baku-to-Belém Roadmap,\" which aims to mobilise at least $1.3 trillion annually for developing countries by 2035. Of this, $300 billion should be provided by public finance from developed nations under Article 9.1 of the Paris Agreement. Although not legally binding, the goal sends a strong political signal that large-scale funding is essential. Without substantial financial support, vulnerable countries cannot adapt to worsening climate impacts or transition to cleaner energy. For countries like Bangladesh, which depend on external support for adaptation, this commitment to finance is significant, even if it remains uncertain.\nAdaptation was a major focus at COP30 as climate impacts are already causing severe damage. The conference agreed to triple global adaptation finance by 2035, but many vulnerable countries were disappointed, wanting the target to be met by 2030. They argued that adaptation cannot wait while storms, floods, droughts and heatwaves worsen each year. The lack of a clear baseline for measuring \"tripling\" also weakens the pledge. Still, recognising the need to scale up adaptation is important. Bangladesh spends heavily on resilience, but its budget is insufficient, making international support vital for embankments, housing, crops and early warning systems.\nCOP30 also adopted 59 global indicators to help track progress on the Global Goal on Adaptation. These indicators cover finance, technology, capacity-building and social inclusion. For the first time, there is a gender-responsive adaptation indicator that recognises that climate impacts differ for women, men, children, and older people. While the adoption of these indicators is a step forward, experts warn that last-minute political compromises weakened their quality. Some indicators may be too vague to use effectively in national planning. Bangladesh and similar countries should still take advantage of the indicators by aligning them with their national adaptation plans. If appropriately used, these indicators can strengthen the case for receiving more adaptation finance from international sources.\nThe biggest disappointment for climate-vulnerable countries was the failure of COP30 in adopting a roadmap for phasing out fossil fuels. Scientific evidence indicates that the world cannot limit global warming threshold to 1.5 degrees Celsius without rapidly reducing fossil fuel use. However, in place of a phase-out plan, the conference launched two voluntary initiatives, namely, the Belém Mission to 1.5 degrees Celsius and a Global Implementation Accelerator. These initiatives aim to help countries implement their national climate plans and share best practices. But they do not require any country to reduce fossil fuel use. For countries like Bangladesh, whose energy security depends on imported fossil fuels, this global uncertainty creates challenges. A delayed transition at the global level affects energy prices, investment patterns, and the cost of renewable technologies.\nA positive outcome of COP30 was the creation of a Just Transition Mechanism, which aims to help countries shift from high-carbon to low-carbon economies in a fair and socially balanced way. It recognises that workers, farmers and vulnerable groups must not be left behind in the energy transition. This is especially relevant for developing countries where millions depend on climate-sensitive sectors such as agriculture, fisheries and small industries. For Bangladesh, a just transition could support better planning for cleaner industries, renewable energy jobs and modern skills training for youth. If implemented well, it can help protect communities during the shift away from fossil-fuel-dependent growth models.\nThe conference also placed renewed attention on forests, land and nature-based solutions. However, the results were limited. Despite being held in the Amazon region, COP30 failed to establish a binding global plan to stop deforestation. The final text only \"highlighted\" the importance of halting forest loss by 2030. Yet, some encouraging announcements came outside the formal negotiations, including new pledges for forest finance and stronger recognition of Indigenous Peoples. For Bangladesh, protected by the Sundarbans mangrove forest against cyclones and storm surges, nature-based solutions are not optional, but they are essential. This renewed focus on forests can help attract more investment into mangrove restoration, coastal greenbelts, river conservation and biodiversity protection.\nAnother notable dimension of COP30 was the linkage between climate policy, global trade, and social inclusion. For the first time, trade issues were formally taken up at the COP. Countries agreed to hold three dialogues on how trade measures, including border carbon adjustments, may affect climate action. This is critical for export-dependent countries like Bangladesh. As global markets move towards greener supply chains, Bangladesh will have to adopt cleaner production standards to remain competitive. COP30 also updated the Gender Action Plan, strengthening requirements for gender-responsive climate action. This echoes the reality that women and girls face different and often heavier climate burdens, especially in rural and low-income contexts.\nAlthough COP30 revealed serious gaps between scientific urgency and political action, leaving vulnerable countries exposed to rising seas, deadly heat, water shortages and destructive floods, it should not be dismissed as a failure. The new finance programme, adaptation indicators, just transition mechanism and attention to trade and gender offer frameworks that countries can build upon. However, this global progress will only matter for Bangladesh and other climate-vulnerable countries if national governments act decisively through strengthening adaptation plans, expanding green industries, protecting ecosystems and preparing workers for a low-carbon future.\nDr Fahmida Khatun is executive director at the Centre for Policy Dialogue.\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "COP30 brings both hope and letdowns for vulnerable countries",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/cop30-brings-both-hope-and-letdowns-vulnerable-countries-4049921",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "The instinct is always to look away. A photo of a young woman appears on a Facebook page I never followed, or a screenshot lands in a men-only WhatsApp group filled with winking emojis and crude remarks. The comments turn sexual within minutes. I pause, feel the discomfort, then scroll past. It is a small decision made in seconds, yet repeated millions of times. This is where the bystander's burden begins, not with the offender, but with the witness who chooses to remain silent. Men like me.\nOver the past year, I have seen dozens of pages that lift women's photos, strip them of context and turn them into content. A normal picture becomes material for \"rating,\" innuendo and abuse. In recent months, I have also seen pages presenting themselves as \"exposé\" or \"story-sharing\" platforms, but their real purpose is far more troubling. They take a woman's photo without her consent, add a suggestive caption and feed it to an audience hungry for scandal. These pages post cropped screenshots of private conversations and ask followers to comment \"5k for the full chat.\" Once the target is reached, they publish the entire set—sometimes even sharing drive links containing photos or personal messages. These pages operate by turning a woman's private life into material for mass consumption.\nAnother disturbing trend growing is several Facebook pages presenting themselves as \"news\" or \"public interest\" platforms, filming women in public spaces without consent. The camera angles are chosen to sexualise. Videos of women walking through a market or attending a festival are edited to attract male audiences. This is far from journalism. It is voyeurism passed off as content, reinforcing the idea that women's bodies are public property.\nThis is not an isolated problem. A 2024 UN Women briefing warned that AI has intensified digital abuse at an alarming rate. Studies cited by the agency show that technology-facilitated violence now affects between 16-58 percent of women worldwide. Bangladesh reflects the same pattern. The Bangladesh Bureau of Statistics' National Violence Against Women Survey 2024, conducted with UNFPA assistance, found that 8.3 percent of women experienced technology-facilitated violence, including unwanted sexual communication, blackmail and image-based manipulation.\nA 2024 NETZ Bangladesh study suggested that nearly 78.4 percent of young, digitally active women have faced some form of online abuse. A 2025 report by VOICE documented 16 cases of technology-facilitated gender-based violence tracked between October 2024 and mid-2025, including deepfakes, manipulated images, threats and blackmail.\nFor me, these figures stopped being abstract on the morning of January 1, 2025. My partner, an education professional, woke up to several WhatsApp messages from an unknown number. Attached was an AI-generated image using her face on a semi-nude body. The sender threatened to upload it unless she agreed to \"negotiate.\"\nShe called me in tears. Later that day, supported by colleagues, she filed a complaint at our local police station. The next morning, the same individual created a fake Facebook profile using her real photos. She felt watched and unsafe. We returned to the police, urging immediate action. Officers gave assurances, but no investigation began. Hours turned into days. For a woman living with the fear of a deepfake going viral, delay becomes another form of violence.\nAs her partner, I felt frightened and helpless. Eventually, we went to the Criminal Investigation Department (CID). With help from a colleague and detailed documentation, CID investigators identified the perpetrator. But the experience exposed a difficult truth. Even with the advantages we had—my access as a journalist, her support network, our combined awareness—the system did not protect us when we needed it most. If we struggled, what hope is there for a teenage girl in a small town?\nMany women never reach even this stage. Some partners tend to distrust them. Some families discourage reporting. Some fear further exposure.\nThe failure is institutional and cultural. Bangladesh's digital laws—from Section 57 of the ICT Act to the Digital Security Act and the Cyber Security Act—were introduced with a promise of safety but rather became known primarily for restricting speech, failing to protect survivors. The Cyber Protection Ordinance, 2025, now criminalises harmful AI-generated content, but enforcement remains limited.\nThe wider gap lies in our behaviour. Men routinely witness online harassment in their social circles. We recognise the abuse, yet choose silence because confronting other men carries a social cost. A message in a group chat risks being labelled humourless. A comment challenging the behaviour is dismissed as overreacting. Scrolling past feels easier.\nBut silence is not neutral. Silence shields the abuser. Silence tells women that even when men see the harm, they will not intervene. Silence teaches young men that degrading women carries no consequence. Misogyny is not sustained by a handful of malicious individuals. It is sustained by many men doing nothing.\nThe consequences of that silence are visible. Women are retreating from online spaces. They restrict their profiles, upload fewer photos or deactivate their accounts entirely. Many avoid sharing their opinions because visibility has become a risk. This retreat limits not only individual expression but women's participation in public discourse, civic life and professional networks.\nNot long before the incident involving my partner, I asked a colleague whether anything could be done to shut down the Facebook pages that profit from humiliation. These pages operate openly. Their content is public. Yet action often comes only after a survivor files a complaint, placing the burden on the person already harmed. Why must women suffer first before authorities respond?\nThe answer lies partly in weak enforcement, but also in a culture of reluctance. Many men see these posts, maybe nod their heads in disapproval but ultimately move on.\nMy partner's experience changed my threshold for silence. I no longer pretend not to see what is in front of me. I report abusive posts. I challenge men who circulate sexist content and call it humour. I extend support to colleagues targeted online. These are not acts of bravery. They are the minimum requirements for anyone participating in a digital space where women face disproportionate harm.\nThis year's theme—\"UNiTE to End Digital Violence against All Women and Girls\"—demands action, not sentiment. Institutions must strengthen systems. Men must give up the comfort of silence. That means confronting friends, refusing harmful content consumption and rejecting the culture that treats online abuse as entertainment.\nThe bystander's burden is not only the shame of silence. It is the responsibility of choice. Every comment reported, every degrading post challenged, and every harmful page rejected helps reshape the digital space. These actions tell women they deserve safety, and they remind men that silence does not make us neutral. Silence makes us part of the problem.\nArafat Rahaman is journalist at The Daily Star.\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "There's no neutral observers in digital violence",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/theres-no-neutral-observers-digital-violence-4049931",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "The UN Climate Conference COP30, held from November 10-21 in Belém, Brazil, concluded with a mix of hope and disappointment. The conference was described beforehand as the \"Implementation COP.\" Many, including climate-vulnerable countries like Bangladesh, expected COP30 to deliver concrete actions from empty promises by finally translating money, policies, and clear plans into climate commitments, but no major breakthrough was achieved, particularly in phasing out fossil fuels and advancing climate finance. However, new platforms for cooperation and some valuable opportunities were created, which can benefit countries already experiencing severe impacts from rising temperatures, storms, sea-level rise, and livelihood losses.\nThree major tensions shaped almost every part of the conference. First, over 80 countries wanted a clear global plan to phase out fossil fuels, but a few powerful producers blocked it, so the final agreement made no commitment to ending fossil fuels. Second, developing countries said they cannot cut emissions or adapt to climate impacts without reliable financial support from richer nations, but participating countries could not agree on how much money should be provided or by when. Third, poorer, climate-vulnerable nations raised concerns about fairness, fearing that stringent climate actions might slow their economic growth even though they contributed least to the crisis.\nDespite these tensions, one key outcome of COP30 was the launch of a two-year Climate Finance Work Programme to advance the \"Baku-to-Belém Roadmap,\" which aims to mobilise at least $1.3 trillion annually for developing countries by 2035. Of this, $300 billion should be provided by public finance from developed nations under Article 9.1 of the Paris Agreement. Although not legally binding, the goal sends a strong political signal that large-scale funding is essential. Without substantial financial support, vulnerable countries cannot adapt to worsening climate impacts or transition to cleaner energy. For countries like Bangladesh, which depend on external support for adaptation, this commitment to finance is significant, even if it remains uncertain.\nAdaptation was a major focus at COP30 as climate impacts are already causing severe damage. The conference agreed to triple global adaptation finance by 2035, but many vulnerable countries were disappointed, wanting the target to be met by 2030. They argued that adaptation cannot wait while storms, floods, droughts and heatwaves worsen each year. The lack of a clear baseline for measuring \"tripling\" also weakens the pledge. Still, recognising the need to scale up adaptation is important. Bangladesh spends heavily on resilience, but its budget is insufficient, making international support vital for embankments, housing, crops and early warning systems.\nCOP30 also adopted 59 global indicators to help track progress on the Global Goal on Adaptation. These indicators cover finance, technology, capacity-building and social inclusion. For the first time, there is a gender-responsive adaptation indicator that recognises that climate impacts differ for women, men, children, and older people. While the adoption of these indicators is a step forward, experts warn that last-minute political compromises weakened their quality. Some indicators may be too vague to use effectively in national planning. Bangladesh and similar countries should still take advantage of the indicators by aligning them with their national adaptation plans. If appropriately used, these indicators can strengthen the case for receiving more adaptation finance from international sources.\nThe biggest disappointment for climate-vulnerable countries was the failure of COP30 in adopting a roadmap for phasing out fossil fuels. Scientific evidence indicates that the world cannot limit global warming threshold to 1.5 degrees Celsius without rapidly reducing fossil fuel use. However, in place of a phase-out plan, the conference launched two voluntary initiatives, namely, the Belém Mission to 1.5 degrees Celsius and a Global Implementation Accelerator. These initiatives aim to help countries implement their national climate plans and share best practices. But they do not require any country to reduce fossil fuel use. For countries like Bangladesh, whose energy security depends on imported fossil fuels, this global uncertainty creates challenges. A delayed transition at the global level affects energy prices, investment patterns, and the cost of renewable technologies.\nA positive outcome of COP30 was the creation of a Just Transition Mechanism, which aims to help countries shift from high-carbon to low-carbon economies in a fair and socially balanced way. It recognises that workers, farmers and vulnerable groups must not be left behind in the energy transition. This is especially relevant for developing countries where millions depend on climate-sensitive sectors such as agriculture, fisheries and small industries. For Bangladesh, a just transition could support better planning for cleaner industries, renewable energy jobs and modern skills training for youth. If implemented well, it can help protect communities during the shift away from fossil-fuel-dependent growth models.\nThe conference also placed renewed attention on forests, land and nature-based solutions. However, the results were limited. Despite being held in the Amazon region, COP30 failed to establish a binding global plan to stop deforestation. The final text only \"highlighted\" the importance of halting forest loss by 2030. Yet, some encouraging announcements came outside the formal negotiations, including new pledges for forest finance and stronger recognition of Indigenous Peoples. For Bangladesh, protected by the Sundarbans mangrove forest against cyclones and storm surges, nature-based solutions are not optional, but they are essential. This renewed focus on forests can help attract more investment into mangrove restoration, coastal greenbelts, river conservation and biodiversity protection.\nAnother notable dimension of COP30 was the linkage between climate policy, global trade, and social inclusion. For the first time, trade issues were formally taken up at the COP. Countries agreed to hold three dialogues on how trade measures, including border carbon adjustments, may affect climate action. This is critical for export-dependent countries like Bangladesh. As global markets move towards greener supply chains, Bangladesh will have to adopt cleaner production standards to remain competitive. COP30 also updated the Gender Action Plan, strengthening requirements for gender-responsive climate action. This echoes the reality that women and girls face different and often heavier climate burdens, especially in rural and low-income contexts.\nAlthough COP30 revealed serious gaps between scientific urgency and political action, leaving vulnerable countries exposed to rising seas, deadly heat, water shortages and destructive floods, it should not be dismissed as a failure. The new finance programme, adaptation indicators, just transition mechanism and attention to trade and gender offer frameworks that countries can build upon. However, this global progress will only matter for Bangladesh and other climate-vulnerable countries if national governments act decisively through strengthening adaptation plans, expanding green industries, protecting ecosystems and preparing workers for a low-carbon future.\nDr Fahmida Khatun is executive director at the Centre for Policy Dialogue.\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "COP30 brings both hope and letdowns for vulnerable countries",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/cop30-brings-both-hope-and-letdowns-vulnerable-countries-4049921",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "The instinct is always to look away. A photo of a young woman appears on a Facebook page I never followed, or a screenshot lands in a men-only WhatsApp group filled with winking emojis and crude remarks. The comments turn sexual within minutes. I pause, feel the discomfort, then scroll past. It is a small decision made in seconds, yet repeated millions of times. This is where the bystander's burden begins, not with the offender, but with the witness who chooses to remain silent. Men like me.\nOver the past year, I have seen dozens of pages that lift women's photos, strip them of context and turn them into content. A normal picture becomes material for \"rating,\" innuendo and abuse. In recent months, I have also seen pages presenting themselves as \"exposé\" or \"story-sharing\" platforms, but their real purpose is far more troubling. They take a woman's photo without her consent, add a suggestive caption and feed it to an audience hungry for scandal. These pages post cropped screenshots of private conversations and ask followers to comment \"5k for the full chat.\" Once the target is reached, they publish the entire set—sometimes even sharing drive links containing photos or personal messages. These pages operate by turning a woman's private life into material for mass consumption.\nAnother disturbing trend growing is several Facebook pages presenting themselves as \"news\" or \"public interest\" platforms, filming women in public spaces without consent. The camera angles are chosen to sexualise. Videos of women walking through a market or attending a festival are edited to attract male audiences. This is far from journalism. It is voyeurism passed off as content, reinforcing the idea that women's bodies are public property.\nThis is not an isolated problem. A 2024 UN Women briefing warned that AI has intensified digital abuse at an alarming rate. Studies cited by the agency show that technology-facilitated violence now affects between 16-58 percent of women worldwide. Bangladesh reflects the same pattern. The Bangladesh Bureau of Statistics' National Violence Against Women Survey 2024, conducted with UNFPA assistance, found that 8.3 percent of women experienced technology-facilitated violence, including unwanted sexual communication, blackmail and image-based manipulation.\nA 2024 NETZ Bangladesh study suggested that nearly 78.4 percent of young, digitally active women have faced some form of online abuse. A 2025 report by VOICE documented 16 cases of technology-facilitated gender-based violence tracked between October 2024 and mid-2025, including deepfakes, manipulated images, threats and blackmail.\nFor me, these figures stopped being abstract on the morning of January 1, 2025. My partner, an education professional, woke up to several WhatsApp messages from an unknown number. Attached was an AI-generated image using her face on a semi-nude body. The sender threatened to upload it unless she agreed to \"negotiate.\"\nShe called me in tears. Later that day, supported by colleagues, she filed a complaint at our local police station. The next morning, the same individual created a fake Facebook profile using her real photos. She felt watched and unsafe. We returned to the police, urging immediate action. Officers gave assurances, but no investigation began. Hours turned into days. For a woman living with the fear of a deepfake going viral, delay becomes another form of violence.\nAs her partner, I felt frightened and helpless. Eventually, we went to the Criminal Investigation Department (CID). With help from a colleague and detailed documentation, CID investigators identified the perpetrator. But the experience exposed a difficult truth. Even with the advantages we had—my access as a journalist, her support network, our combined awareness—the system did not protect us when we needed it most. If we struggled, what hope is there for a teenage girl in a small town?\nMany women never reach even this stage. Some partners tend to distrust them. Some families discourage reporting. Some fear further exposure.\nThe failure is institutional and cultural. Bangladesh's digital laws—from Section 57 of the ICT Act to the Digital Security Act and the Cyber Security Act—were introduced with a promise of safety but rather became known primarily for restricting speech, failing to protect survivors. The Cyber Protection Ordinance, 2025, now criminalises harmful AI-generated content, but enforcement remains limited.\nThe wider gap lies in our behaviour. Men routinely witness online harassment in their social circles. We recognise the abuse, yet choose silence because confronting other men carries a social cost. A message in a group chat risks being labelled humourless. A comment challenging the behaviour is dismissed as overreacting. Scrolling past feels easier.\nBut silence is not neutral. Silence shields the abuser. Silence tells women that even when men see the harm, they will not intervene. Silence teaches young men that degrading women carries no consequence. Misogyny is not sustained by a handful of malicious individuals. It is sustained by many men doing nothing.\nThe consequences of that silence are visible. Women are retreating from online spaces. They restrict their profiles, upload fewer photos or deactivate their accounts entirely. Many avoid sharing their opinions because visibility has become a risk. This retreat limits not only individual expression but women's participation in public discourse, civic life and professional networks.\nNot long before the incident involving my partner, I asked a colleague whether anything could be done to shut down the Facebook pages that profit from humiliation. These pages operate openly. Their content is public. Yet action often comes only after a survivor files a complaint, placing the burden on the person already harmed. Why must women suffer first before authorities respond?\nThe answer lies partly in weak enforcement, but also in a culture of reluctance. Many men see these posts, maybe nod their heads in disapproval but ultimately move on.\nMy partner's experience changed my threshold for silence. I no longer pretend not to see what is in front of me. I report abusive posts. I challenge men who circulate sexist content and call it humour. I extend support to colleagues targeted online. These are not acts of bravery. They are the minimum requirements for anyone participating in a digital space where women face disproportionate harm.\nThis year's theme—\"UNiTE to End Digital Violence against All Women and Girls\"—demands action, not sentiment. Institutions must strengthen systems. Men must give up the comfort of silence. That means confronting friends, refusing harmful content consumption and rejecting the culture that treats online abuse as entertainment.\nThe bystander's burden is not only the shame of silence. It is the responsibility of choice. Every comment reported, every degrading post challenged, and every harmful page rejected helps reshape the digital space. These actions tell women they deserve safety, and they remind men that silence does not make us neutral. Silence makes us part of the problem.\nArafat Rahaman is journalist at The Daily Star.\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "There's no neutral observers in digital violence",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/theres-no-neutral-observers-digital-violence-4049931",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "The latest Health and Morbidity Status Survey 2025 gives a stark warning about the nation's health. According to the survey, hypertension now affects 78 out of every 1,000 people, making it the most prevalent disease in the country. Not far behind are peptic ulcers (64 per 1,000) and diabetes (43 per 1,000). These chronic conditions require consistent monitoring, reliable diagnostics, and long-term treatment. Their rising prevalence points to a population increasingly burdened by non-communicable diseases at a scale our current health system is not prepared to manage.\nThe survey covered 1.9 lakh people from 47,040 households between November and December last year, and found that one-third of respondents experienced some form of illness in the 90 days preceding the study. Another troubling finding is that 51.2 percent of respondents relied on self-treatment or local pharmacies, while around 20 percent sought private healthcare, and only 11 percent went to government facilities. Such high dependence on informal care reflects a severe lack of accessibility to public healthcare. It also fuels antimicrobial resistance (AMR) as antibiotics—often dispensed without proper diagnosis—are frequently misused. Experts warn that AMR is no longer a distant threat; it is a growing reality, making common infections harder and more expensive to treat.\nAnother finding deserving the government's attention is the higher illness rates among women, both young and elderly, compared to men. Moreover, the persistent burden of out-of-pocket expenditure on the population, which averaged Tk 2,487 in the three months preceding the survey, is another serious concern. Such high healthcare costs are crippling for low- and middle-income families. The alarming trends underscore the urgency of health sector reforms.\nThe Health Sector Reform Commission had already made crucial recommendations with urgency to address the challenges exposed by the survey. It is, however, concerning that out of its 33 key reform proposals, the government has halted implementations of 15 following the Cabinet Division review. Notably, the excluded recommendations include VAT and tax exemptions on essential antibiotics and medicines for cancer, diabetes, and hypertension, along with proposals for a permanent health commission and a separate public service commission for doctor recruitment. Pushing back these reforms at a time when our health sector is already facing major challenges such as inadequate funding, a shortage of health workers, unequal access to services, and weak governance is most unfortunate.\nWe urge the government not to downplay the issues plaguing our health sector and to urgently implement the reforms to make healthcare delivery pro-people.\n",
        "headline_1": "A warning for our health system",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/warning-our-health-system-4049086",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "The endorsement of a child rights manifesto by a dozen political parties now preparing for the ultimate contest for popular mandate is a welcome development at a time when child-focused indicators reveal a worsening situation. We commend the leadership of these parties for backing the manifesto that contains 10 commitments, pledging to embed them in their policies and election agendas and acting on them if elected.\nIt was an encouraging moment to witness rival political forces—often accused of endless bickering over governance, heritage, and the nation's future direction—come together for a shared cause. This convergence of commitments to safeguard children's futures by the BNP, Jamaat-e-Islami, National Citizen Party, Jatiya Party, Amar Bangladesh Party, Bangladesher Samajtantrik Dal, Communist Party of Bangladesh, Gano Forum, Ganosamhati Andolon, Gono Odhikar Parishad, Khelafat Majlis, and Nagorik Oikya rightly deserves appreciation. UNICEF's role in convening these parties is equally laudable.\n\nWe hope these parties genuinely recognise the gravity of the challenges children face in relation to nutrition and health, quality education and skills development, an enabling environment for creativity, protection from physical and mental abuse, violence and exploitation, the persistence of child labour, and the growing threats posed by climate change.\nAccording to the Multiple Indicator Cluster Survey 2025, conducted by the Bangladesh Bureau of Statistics and UNICEF, one in eight children under five is \"wasted,\" a life-threatening form of malnutrition. The rate has risen to 12.9 percent in 2025 from 9.8 percent in 2019, while nearly 700,000 babies are born with low birth weight. Child labour has increased from 6.8 percent to 9.2 percent, and 3-4 million school-age children remain out of school. The survey also shows that nearly half of all girls marry before turning 18. In terms of climate and environmental risks, 20 million children are directly exposed to climate hazards, 87 percent of drinking water is contaminated with E. coli, and 15.8 percent contains unsafe levels of arsenic.\n\nThese alarming indicators underscore the urgent need to prioritise development and strengthen governance. The child-focused manifesto, formulated by children and young people themselves, calls for allocating five percent of GDP to education and primary healthcare—in line with global recommendations—compared with the current allocations of two percent for education and one percent for health. As the manifesto rightly notes, every dollar (or taka) spent on child protection yields a ninefold social and economic return. We, therefore, hope politicians across the aisle will support aligning national budgets with these priorities. Since the commitments have been described as \"non-negotiable,\" we remind the signatories that any deviation from their pledged actions will not only erode the trust and respect of young people, but also inflict lasting harm on the nation's future.\n",
        "headline_1": "A promising pledge, but execution is key",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/promising-pledge-execution-key-4048911",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "Bangladesh is facing one of the most substantial declines in marine fish stocks in its history. According to a new comprehensive fisheries survey, the stock of small pelagic species in the Bay of Bengal has dropped by a staggering 78.6 percent in just seven years—from 158,100 tonnes in 2018 to only 33,811 tonnes in 2025. This collapse follows earlier warnings, including the 2019 Department of Fisheries assessment, that categorised several species, such as tiger shrimp, Indian salmon, and large croakers, as severely depleted. Overfishing remains the central driver of this transformation: the number of commercial trawlers has nearly tripled since the mid-1980s, from around 100 to 273, putting heavy pressure on the bay's fragile ecosystem. Officials and surveyors caution that the shrinking number and size of commercially important species reflect a marine environment under acute stress.\nThe recent findings also point to deeper patterns of ecological disruption, with excessive and unregulated fishing, improper use of technology on industrial trawlers, rising microplastic pollution, and depleting oxygen in coastal zones—all playing a part in it. The survey recorded 418 microplastics, mapped abnormal jellyfish proliferation across the trawl stations, and observed that bycatch and wastage have increased due to poor monitoring. Notably, of the country's 20 major commercial fish species, only five are now viable for harvest, down from nine in 2018. Experts have repeatedly warned that without effective management, Bangladesh risks losing both biodiversity and the marine resources on which coastal communities depend.\nThis accelerating degradation, we must say, is largely a consequence of policy failures. Despite years of warnings, licences for industrial trawlers have continued to rise while monitoring mechanisms remain weak. Of the 273 industrial trawlers currently operating, 72 use advanced technology, yet its misuse has worsened bycatch. Oxygen depletion, high concentrations of microplastics, and collapsing pelagic stocks have all combined to threaten not only fish populations but also long-term food security, livelihoods, and the credibility of state-led conservation commitments.\nWe urge the government to take this crisis seriously. Going forward, the issuance of new trawler licences should be strictly limited, and the total fleet size must be reduced in phases. Industrial trawlers using illegal nets or violating designated zones should also face immediate suspension. Equally importantly, the state's marine research capacity must be strengthened to ensure continuous monitoring and informed policymaking. Protecting our marine resources is no longer an environmental preference; it is an economic and ecological necessity that demands urgent response and sustained commitment.\n",
        "headline_1": "A marine crisis we can no longer ignore",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/marine-crisis-we-can-no-longer-ignore-4048331",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "There is rarely a convenient time for a strike, but the timing of the latest strike by secondary school teachers comes across as particularly surprising. As the annual school examination season begins—a period of high anxiety for students and parents alike—a set of educators have abandoned their duty in an attempt to force the government to meet their demands. We find this move totally irresponsible.\nThe timing could not be worse. According to the government's schedule, annual exams were set to run from November to December, followed swiftly by selection tests and junior scholarship exams wrapping up on New Year's Eve. This is the crunch time of the academic calendar. Yet, instead of quiet concentration in exam halls, students are having to face administrative anarchy.\nThe Directorate of Secondary and Higher Education attempted to regain control with stiff directives, warning that any \"negligence\" in conducting the exams would trigger punitive action. But teachers, organised under various associations, have chosen to ignore these orders. The result is chaos across the country: while some schools held exams, many institutions have suspended tests, according to our reporters. As the coordinator of the movement has said, the boycott is well underway, rendering the government's late-night circulars largely ineffective.\nThe teachers' grievances are numerous and significant, and we urge the government to review and address them properly. Their demands include the upgrading of entry-level assistant teacher posts, the creation of a separate Directorate of Secondary Education, and the reinstatement of benefits withdrawn as far back as 2015. It is possible that these demands have merit. But to hold the future of children hostage in their push for pay and perks is a totally unethical tactic.\nEducation is not a factory line where work abstention merely delays a shipment; it is a time-sensitive endeavour in which disruption can derail academic progression and inflict psychological stress on students. The teachers' coordinator has argued that the government's circulars are an attempt to suppress their movement. He may be right about the government's steps, but he is wrong to assume that this gives his colleagues the moral licence to jeopardise the academic year.\nThe teachers must respect their primary responsibility to students. They claim they will only return if the education ministry sits down with protest leaders. This is the language of blackmail, plain and simple. The teachers may believe they are teaching the government a lesson in power dynamics. In reality, they are sending the wrong message. They should return to classrooms and exam halls immediately for the sake of the students. The government, meanwhile, must expedite efforts to resolve the issues at the root of this crisis.\n",
        "headline_1": "Teachers must not hurt students’ future",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/teachers-must-not-hurt-students-future-4048101",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 04, 2025 00:00:00  \nEndorsement of the Child Rights Manifesto (CRM)--- prepared jointly by children and young people with UNICEF support---by 12 political parties including the major ones likely to come to power through the upcoming election is quite a positive development. By signing the document, these political parties are indeed pledge-bound to honour their commitment when in power. In Almighty Allah's eyes, every child is precious and deserved to be loved, nurtured and honoured with quality care. The Biblical reference to child rights also is highly illuminating where caring for children is a prerequisite for entering heaven. Borrowing from the Bible, Tolstoy inferred that if one wants to enter heaven, one must be like children whose prized possessions are \"humility, simplicity, trust and a lack of worldly snares and pride\". In today's world too, the most child-caring nations are generally the most developed ones. So, the signing of the CRM can be a milestone in the history of Bangladesh politics provided that a political party or their coalition winning the next election sticks to its commitment.\nUnfortunately, the political system and society here have proved they are child-unfriendly. The social structure has developed on disparities and deprivation of children born to homes ---often village huts and urban slums or ghettos---forcing them to wallow in perpetual poverty for generations. Many of these children run away from homes to be street children. When the educated and privileged people feel no qualms about the existence of grinding poverty and dehumanised condition and continue to amass wealth by any means---fair or foul, the system of governance has a crucial role to play for narrowing down the yawning gaps in social classes, living standards and livelihood options. Mere signing of a document without acting decisively to change the lot of the poor and the marginal people is no guarantee for pulling them out of the rut. \nA radical change in the mindset of the ruling class is a prerequisite for influencing social concerns for the deprived. When money looted in billions from banks or financial institutes is allowed to be laundered abroad and the perpetrators can flee the country, it is a betrayal of trust that holds society together. Such treachery is a good enough incentive for people down the rank to engage in criminal activities. The law and order breaks down and the well-being of the poor and the deprived stay out of sight. Without improving the condition of poor and marginal families, it is impossible to ameliorate the lot of the children born to such families. \nAre the political leaderships ready for undertaking such a challenge? Non-performing loans and the laundered money of fabulous sums would be more than enough to launch an effective poverty-reduction programme. Selfish politicians and bureaucracy have time and again proved that their mutual self-serving policies have no intention of sharing the national wealth with the underclass. Even the trickle-down benefits could bring about some change, albeit not up to the mark, at the mid level of society. Clearly, required investments in education of children of the poverty-stricken and calamity-affected families is a key to retaining the young ones in learning process and skill development without which they are ill-equipped to meet the challenges facing them. Equitable distribution of wealth has bypassed the majority of people. Before guaranteeing that children belonging to poor families enjoy their rights, the condition and environment of their households have to be made congenial for the purpose.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Protecting child rights",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/protecting-child-rights-1764776082",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       December 04, 2025 00:00:00  \n\nAnnual examinations in most government primary and secondary schools across the country have been thrown into disarray and uncertainty as several groups of teachers launched an indefinite strike on Monday to press home their various demands, including upgrading their posts and securing a pay hike. While the fact that teachers are poorly paid and deserve a better salary is undeniable, the timing of the movement, enforced while annual exams are underway, has stunned guardians and conscious citizens alike. \nMany guardians and students were not even aware that teachers would launch a strike from December 1. Students who arrived to sit for their exams on Monday were shocked to find that although teachers were present at the school they refrained from participating in any academic activities. In many areas, angry altercations erupted between guardians and teachers. Faced with vehement protests, principals of some schools conducted the examinations with the assistance of staff and guardians who volunteered to carry out exam related duties. \nLaunching a movement over legitimate demands is a democratic right of every citizen. But the question is why the teachers chose to enforce the strike in the middle of the annual examinations, a period of critical importance in every student's academic life. In plain sight, it appears that the timing of the protest was deliberately chosen to create additional pressure on the government to accede to their demands. Why would the teachers stoop so low as to use students' future as a bargaining chip for their own benefit?\nIn the face of widespread criticism, secondary school teachers called off their protest on Tuesday, saying that they would resume the movement after the examinations are over. But a section of primary teachers have threatened to organise an even tougher movement by 'locking the school' from Thursday if the government fails to fulfil their demands.\nThe teachers have to perform their duties with a sense of dedication. When the students cannot sit for their final examination at the fag end of the academic year, they are going to be affected adversely. The teachers themselves are aware of the damage they are causing to the students and have promised to take compensatory measures once the government meets their demands. It does not, however, sound very convincing.\nOne must also ask what toll this disruption would take on the mental state of students in government schools. Their peers in non-government institutions have already completed their exams and are preparing to enjoy the much-awaited December holidays, while they are stuck in a limbo.\nBesides, many are also questioning the legitimacy of some of the demands of the striking teachers. For example, one of the four key demands of the secondary school teachers is the inclusion of assistant teachers in the ninth pay grade under the Bangladesh Civil Service (BCS) General Education cadre. They took the job fully aware that the post of an assistant teacher at a secondary school falls in the 10th pay grade of the government's pay scale. This pay grade was known to them when they applied, sat for the recruitment test, received the appointment letter and joined the post. Why, then, do they now claim they are subjected to \"injustice\"?\nA job in the Bangladesh Civil Service (BCS) is one of the most lucrative and prestigious in the country. The BCS exams are also the most competitive public recruitment process in Bangladesh, with success rates as low as 0.2 per cent for all cadres and 0.05 per cent for general cadres, on average. Those who ace this test go through years of rigorous preparation, proving their dedication, brilliance and intellectual mettle in each step of this fiercely competitive recruitment process. How can one possibly demand recognition as a BCS cadre by resorting to a protest movement and holding students hostage?\nThat said, the quality of education at primary and secondary level in the country has indeed become a matter of concern. Most of the schools do not have the required infrastructure and other facilities needed to impart quality education. The saddest part of the story is that the schools, particularly in the rural areas, do not have qualified teachers. The result has been disastrous, to say the least. Today everybody is talking about poor standards of education and the ever-widening gap between private schools and the shabbily run government schools. As a result, a large chunk of the population is left out of the competition for lucrative jobs. The neglected primary education is responsible for this lopsided state of affairs.\nAgainst this backdrop, it is ironic that teachers appear more concerned about augmenting their benefits through recurrent protests, with one group after another taking to the streets. During the tenure of the interim government over the last 16 months, schools were reportedly closed for at least six months as teachers protested in regular intervals, demanding higher salaries, post upgrades, nationalization, MPO enlistment and so on. As one group of teachers succeeds in realising demands through street protest, another is inspired to follow suit. In the process, millions of students are severely affected, at a time when they are yet to recover from the learning loss suffered during the Covid-19 pandemic.\nEducation has the highest budgetary allocations and, as such, it is really not desirable that the issue of teachers' salary will remain a perpetual concern. Given the complexity of the hierarchy in the government's pay scale, experts' call for a separate pay scale for teachers sounds logical. Why should teachers have to take to the street regularly for a pay hike? However, the education authorities must ensure that the performance of the teachers improves and that they are not neglecting classroom education to teach in coaching centers. So, the issue needs to be examined in all its ramifications. The government should initiate a dialogue with the teachers immediately and resolve the crisis without wasting any more time.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "When teachers hold  students hostage!",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/when-teachers-hold-students-hostage-1764776126",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 04, 2025 00:00:00  \n \nOnce, our land was rich in native fruits such as gab, orboroi, kaufol, golapjam, deua, and karmocha. Our land also produced traditional fragrant rice varieties like kalijira and rajashail. These fruits were natural sources of vitamins B and C, calcium, phosphorus, and many other essential nutrients. They also played an important role in preventing diseases such as diabetes, constipation, and obesity.\nToday, however, the genetic diversity of these valuable native fruits and seeds is disappearing rapidly. The rise of high-yield hybrid varieties and the lack of attention to preserving local ones are the major reasons behind this decline. Climate change and pressures from modern agricultural practices have further accelerated the loss. The disappearance of these native varieties poses a serious threat to our food security as well as the ecological balance of our environment.\nWe must act now to protect this precious natural heritage. Farmers, scientists, and conservationists should work together to establish seed banks where traditional seeds can be collected, preserved, and shared. The government should support and encourage farmers-through subsidies and other incentives-to cultivate native and lesser-known fruits and seeds. At the same time, schools, universities, and research institutions should focus on studying and conserving local varieties.\nTo safeguard our heritage and ensure future food security, saving our native fruits and seeds is not merely important-it is urgently essential.\nIbrahim Khalil \nStudent\nPatuakhali Science and Technology University\nug2108037@lla.pstu.ac.bd\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Saving native fruits and seeds",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/saving-native-fruits-and-seeds-1764776147",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 04, 2025 00:00:00  \n\nIn recent years, Bangladesh has witnessed a sharp rise in shadow entrepreneurship, mainly due to the growth of online and home-based businesses. Platforms like Facebook and Instagram have made it easier for people-especially students, women, and young entrepreneurs-to start ventures with only a very minimal amount of start-up capital. As a result, many sellers are earning well and becoming financially independent, which is a strong indicator of personal empowerment and increased online engagement.\nHowever, most of these businesses operate informally; the majority of e-businesses are neither registered nor taxed, and they lack proper consumer protection and legal accountability. Although the entrepreneurs benefit individually, this trend is creating challenges for the national economy. When thousands of sellers avoid VAT and corporate taxes, the government is deprived of potential revenue that could be invested in development, infrastructure, and social services. In other words, while the personal economy of sellers is improving, the broader economy of Bangladesh is being weakened.\nAnother problem is the unfair competition faced by formally registered businesses. Firms that follow all rules and regulations, pay taxes, and maintain product standards, find it difficult to compete with unregistered sellers who bear none of these expenses. This imbalance discourages formal entrepreneurship and slows the country's transition toward a stable, transparent, and growth-oriented economy. Informal sellers also leave consumers unprotected due to the absence of accountability and quality assurance.\nTo address these concerns, the government should simplify the process of business registration, establish affordable tax rates for micro-entrepreneurs, and launch awareness campaigns on the long-term benefits of formalisation. Social media companies can also contribute by encouraging verified business pages and promoting transparent practices. Bringing shadow entrepreneurs into the formal system will not only safeguard consumers but also boost revenue generation and support the sustainable growth of Bangladesh's economy.\nRafida Moselemin khan\nStudent\nBBA Department \nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Shadow entrepreneurship and its impact",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/shadow-entrepreneurship-and-its-impact-1764776171",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-12-2025"
    }
]