[
    {
        "full_article": "India’s Goods and Services Tax collection in April, since the indirect taxation framework was implemented in 2017, has consistently hit record highs. This April was no different — generally because of businesses tallying their books and completing their financial year-end tax commitments. The gross GST collected this time was about ₹2.37 lakh crore, marking an on-year growth of 12.6% from last April. After refunds, the central government netted over ₹2.09 lakh crore, an on-year rise of 9.1%. This also signifies a marked rise in GST compliance, also aided by faster refunds, which are crucial for small businesses as they work with thin working capital, and the mass adoption of fintech. The fintech adoption rate in India, at 87%, which is well above the global average, and aided by the insular COVID-19 years of 2020-21, has brought in millions from the MSME sector into the formal banking system, enabling better tax compliance and regulatory supervision. Wider compliance is also evident from April’s GST collections from 2018 to 2025, which has more than doubled from ₹1.03 lakh crore to ₹2.37 lakh crore.What is significant this April has been the 86% rise in refunds issued to exporters and the 20.8% increase in GST revenues from imports. This correlates with the 10-month high growth in the April print of HSBC India Manufacturing Purchasing Managers’ Index (PMI). The PMI rose from 58.1 in March to 58.2 in April. The survey indicated a sharp rise in new business aided by greater international demand. Orders from abroad grew to the largest degree in over 14 years in the first month of the 2026 fiscal year, with demand led by Africa, Asia, Europe, West Asia and the Americas. This suggests that businesses have scrambled to get their orders in before the 90-day pause on tariffs by the U.S. ends on July 9. It also suggests a possible re-alignment in supply chains, with greater sourcing from India, as the U.S. tariffs on China appear to be more onerous and certain, with the possibility of transshipment goods from China being taxed, without a high value-add threshold. Apple has said at its January-to-March quarterly earnings call that it intends to source ‘most of its iPhones’ for the U.S., its largest market, from India. This suggests a temporary respite for India’s manufacturing sector, which witnessed a four-year growth low at 4% in the last fiscal. A more durable growth strategy would be to boost domestic consumption and wrangle favourable concessions for its manufacturing sector from the many ongoing trade agreements. Published - May 05, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        banking\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        imports\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        manufacturing and engineering\n                    \n                            /                      \n                        \n                        mobile phones",
        "headline_1": "Temporary respite: on GST, India’s manufacturing",
        "headline_2": "India’s growth strategy must focus on boosting domestic consumption",
        "link": "https://www.thehindu.com/opinion/editorial/temporary-respite-on-gst-indias-manufacturing/article69537573.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-05-2025"
    },
    {
        "full_article": "The re-election of the centre-left Labor party in the Australian general election on Saturday is a shot in the arm for Prime Minister Anthony Albanese, who became the first Australian leader to win a second term in more than two decades. The centre-right Liberal-National coalition was trounced, with Labor winning 87 of the 151 seats in the Australian parliament’s lower house, against its previously razor-thin edge of 77 seats. Welcoming Mr. Albanese’s win, Prime Minister Narendra Modi congratulated him for an “emphatic mandate” and a commitment to take India-Australia bilateral ties and cooperation in the Indo-Pacific forward. Both countries signed an ‘early-harvest’ partial FTA (ECTA) in 2022, and have agreed to conclude a Comprehensive Economic Cooperation Agreement (CECA) by the end of this year. India will host the Quad summit later this year, and Mr. Albanese is expected to discuss closer cooperation on trade, resilient supply chains, and critical mineral and technology partnerships. The geopolitical changes wrought by China and the U.S. signal the need for Indo-Pacific region countries to diversify their economic interests and shore up each other’s strategic needs.His re-election comes despite a rocky three-year term since 2022, as he faced low ratings on issues such as the economy, inflation and immigration; a recent poll said he would either lose or face a hung parliament. Given the timing of the turnaround, just after U.S. President Donald Trump took office, his win is seen as mirroring the results in Canada, where a dark horse centre-left Liberal party candidate, Mark Carney, won. As with the Conservative leadership in Canada, the Australian opposition’s ‘Liberal’ candidate Peter Dutton was seen as a Trump policy admirer, and had taken a tough “anti-woke” stance, pillorying Mr. Albanese for allowing too many immigrants into the country, and vowing to stand with Israel on Gaza. However, as Mr. Trump unleashed a barrage of measures including tariffs on countries, his policies also appear to have had a negative impact on Mr. Dutton’s chances. Despite being a staunch U.S. ally, Mr. Albanese’s relatively tough stand against the tariffs was seen favourably by voters — much as Mr. Carney’s tough stand against the U.S.’s tariffs and threats won him votes. Another election result this weekend, in Singapore, saw a win, albeit quite expected, for Lawrence Wong, whose party won its 14th term. Mr. Wong too made Mr. Trump’s policies a rallying cry during his campaign, even suggesting that countries would simply “stop exporting to USA” if the tariffs were not taken down. In each of the wins, voters chose sober candidates seen as more rational at the wheel, and not those seen as tough leaders with strong rhetoric. This is a trend among America’s closest allies, and Mr. Trump will have to pay heed to sane voices from outside his circle of advisers. Published - May 05, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Australia\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        Canada\n                    \n                            /                      \n                        \n                        Singapore",
        "headline_1": "Sober verdicts: election results from Australia, Singapore",
        "headline_2": "Voters across regions have been rejecting Trump-type leaders",
        "link": "https://www.thehindu.com/opinion/editorial/sober-verdicts-election-results-from-australia-singapore/article69538120.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-05-2025"
    },
    {
        "full_article": "On the exotica of English local elections \nSo you think English local elections are dull compared to Indian ones? Think again. The MP for Runcorn and Helsby, England, did not deliver LED televisions, cookers or gas cylinders to his constituents. However, he did deliver a few punches to someone who was vehemently remonstrating with him about the closure of a local bridge. This little fracas led to his conviction, a suspended prison sentence of ten weeks, and the end of his political career.\nIn the film Sholay, Amitabh Bachchan’s character, while advocating a matrimonial alliance between Veeru and Basanti, argued that Veeru only gambled after a few drinks. Likewise, the MP – a perfectly affable gentleman in normal times – only lost his cool after he’d had one too many. He wasn’t the first to throw a punch though. The late John Prescott, deputy PM in the Blair govt, once floored a protester with a neat left hook, after being pelted with an egg. He later remarked that he’d much rather be punched than egged.\nMuch water has flowed under the bridge – even under the one that led to the downfall of our Runcorn and Helsby lawmaker. And yet, in the wider battle to control 23 councils, more than ten councils have been left with no overall control. Might voter apathy be to blame for this uncertain state of affairs? \nVoter turnout across England averaged 30-40%. In certain parts of the country, only 20% of registered voters turned up to vote. That equates to just 1,000 people – hardly enough to distinguish between an election result and a strong opinion. Those who voted could fit inside a Vande Bharat train and still leave hundreds of seats vacant.\nWith the British public growing bored with both Labour and Conservatives, the Official Monster Raving Loony Party, founded in 1982, has hoped for traction and published 26 policy statements – one for each letter of the alphabet. Example: “Half the grey squirrels will be painted red to increase the red squirrel population.” \nGrey squirrels are the foreign species, red the declining, indigenous ones. The party that’s fared rather well in these elections – Reform UK – shares this preference for the natives. Scientists reject conservation by painting red on grey, but so what? Hull and East Yorkshire has elected a boxer – an Olympic gold medallist, no less – as its mayor. So whatever a scientist thinks, he’ll think twice before egging this mayor.\n\n",
        "headline_1": "Eggs & squirrels",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/eggs-squirrels/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-05-2025"
    },
    {
        "full_article": "SC ruling on Bhushan Steel shows what’s wrong with IBC process. Questions must be settled faster \nThe Supreme Court’s decision last Friday to annul JSW Steel’s acquisition of the bankrupt Bhushan Power & Steel Ltd (BPSL) in 2021 hurts not only JSW but also its lenders and workers, and prospects of finding buyers for other insolvent companies. SC’s order is based on two technical grounds, one of them being that JSW completed the takeover with a mix of equity and optionally convertible debentures, when it should have used equity alone. However, this “illegality” would have been apparent at the outset and didn’t require four years of adjudication. In that long period, JSW integrated the operations of BPSL, which now accounts for 13% of its 37.5mn tonne annual steelmaking capacity. Effectively, the court order hobbles an enterprise after its successful turnaround.\nThe BPSL story is also bad optics for India at a time when the country is looking to attract investment in manufacturing. By 2017, BPSL owed banks around ₹47,000cr. The process to select a buyer via bids dragged through 2018 and most of 2019. While JSW’s ₹19,700cr bid was selected in Sept 2019, the acquisition wasn’t completed until March 2021. This is the second ground for cancellation – failure to complete resolution plan within prescribed timeline. Again, this would have been apparent in 2021.\nThe eight-year timeline of this case tells prospective lenders that getting their money back – even with a 60% haircut – can take years. It warns prospective buyers of insolvent firms that a takeover – duly approved by creditors, NCLT and NCLAT – can be undone years later. And while these processes grind on, many thousands of workers and their families live in a limbo. This is not to question the merits of SC’s decision, but point out that an atmosphere of uncertainty isn’t conducive to business. Legal points should be settled conclusively and swiftly.\n\n",
        "headline_1": "Unsolving insolvent",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/unsolving-insolvent/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-05-2025"
    },
    {
        "full_article": "SpaceX’s city in Texas has a message for urban regeneration in India: involve big business\nMusk company SpaceX’s rocket-launch site in Texas is now incorporated as a new city. Locals who’re not workers at SpaceX fear closure of a beach and a state park that the company eyes, and which get barred from residents’ time to time for launch-related activities. In its seven years, SpaceX has reshaped the sleepy town, as any industry does. It reportedly looks like a science fiction movie set, has rows of identical houses – and a massive bronze bust of Musk. Locals fear it gives Musk “too much control”. The county keeps what US media reported as “more pedestrian aspects of life” – clearly both literally and metaphorically. \nThere’s nothing new in entrepreneurs building cities out of their company bases. India has a long list of such townships. Govts have long collaborated for cities to grow out of industrial bases built by business pioneers, steel tycoons, mill owners – from Tatanagar to Modinagar and dozens others. PSUs all have urban centres that develop and expand around their plants. But dreams of India’s urbanisation have morphed into a nightmare the last three decades. Under several govts,  city-building initiatives have been embarked upon, but all have got railroaded by lack of investment despite early interest, and overall administrative incompetence. Politician-land shark-builder nexuses have flourished in that vacuum – a chicken and egg story really – making a costly mess of urban development. Even the Smart Cities project has practically wound down – a govt release noted all pending projects were to end by March 31, 2025.  \nConnectivity, water, power, open spaces, affordable housing – no Indian city govt today can claim to be able to handle its waves of migrants or ability to upgrade infra to meet a growing city’s demands. Delhi to Mumbai, Bengaluru to Kolkata, and even Corbusier’s Chandigarh are struggling. In late 1960s, it was suggested Chandigarh be made a chartered city for Delhi to host global events. Chartered cities are enclaves with autonomy to carry on business and cultural activity, like the city of Geneva in New York. Fate of cities should not be left to govts alone. Without private sector collaboration, it looks near impossible for our local govts to cope with city demands – no matter the funds. This is not about a lonely tony Gurgaon reaching to the skies in potholed Haryana, or private hill station Lavasa going bust, but more about imagination, transparency and accountability, and an efficiency associated more with private sector than any govt ever.\n\n",
        "headline_1": "Musknagar",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/musknagar/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-05-2025"
    },
    {
        "full_article": "If a national count starkly demonstrates that powerful chieftains of social groups are no guarantee for their base’s economic empowerment, these netas’ political influence may go down\nHarping on caste in modern-day India could re-legitimise and reinforce an institution that modernity has rendered illegal and the Constitution and its democratic order have put beyond the pale of law, say many conscientious objectors to the caste census. Some would find this naïve.\n\nMore to the point, objections to the caste census ignore the possibility that the findings of such a census could mark the beginning of the end of caste politics.\nRead the full story on TOI+.\n\n",
        "headline_1": "Will caste census kill caste politics?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/will-caste-census-kill-caste-politics/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-05-2025"
    },
    {
        "full_article": "With the passing of Professor Tony K. Stewart, Gertrude Conaway Vanderbilt Chair in Humanities Emeritus, the field of South Asian religions, and more specifically, premodern Bengali literature, has lost one of its leading lights. His contributions to Bengal studies, and indeed to the history of cultural frontiers and entangled religions more widely, have had momentous impacts on these fields. He will long be remembered for his masterful studies of the biographies of Kṛṣṇa Caitanya and the hagiographies of fictional Muslim holy men. His scholarship straddled the study of Hinduism and Islam in premodern Bengal, fields more typically siloed. Stewart's writings are characterized by a unique combination of cultural history, literary theory, textual criticism, and hermeneutics. He produced consummate analyses of the grammar of hagiography and the cultural and ideological work these genres performed in Bengal. At the same time, his skilful English translations introduced a wide audience to Bengali historical and fictional figures, the focus of his lifelong scholarly work. Stewart's first major work, his dissertation from the University of Chicago (1985), eventually became his magnum opus, The Final Word (OUP, 2010), following the publication of the late Edward C. Dimock's translation of the Caitanya Caritāmṛta, which Stewart edited. With poet Chase Twichell he also published The Lover of God: Rabindranath Tagore's 'Bhanusimher Padavali' (Copper Canyon Press, 2003).\nThereafter his work turned east and most of his research and other scholarly activities focused on what is now Bangladesh and the Islamic literatures of Bengal. Most notably, he worked on the tales of Satya Pir, who represents a rapprochement of Muslims and Hindus in a plural Bengali society in the premodern period. In Fabulous Females and Peerless Pirs (OUP 2004) he translated eight tales out of several hundred, each focused on the ways women, aided by Satya Pir, keep the world ordered in the wake of male-generated chaos. In Witness to Marvels: Sufism and Literary Imagination (University of California, 2019) he examined the ways the Islamic imaginaire has insinuated itself seamlessly into a Bengali consciousness through mythic heroes who extend their help and protection to anyone regardless of sectarian affiliation. The accompanying anthology of unabridged translations of those key tales has recently appeared as Needle at the Bottom of the Sea: Bengali Tales from the Land of the Eighteen Tides (University of California, 2023).\nThe study of premodern Bengali literature began to develop in the first third of the twentieth century. Until then, scholars had viewed post-Sanskritic linguistic creations as less serious than their predecessors of the Golden Age of the Gupta period, even sometimes labelling them \"vulgar.\"  But in the years just before Independence some linguists began to urge their academic colleagues to take vernacular material seriously and as worthy of consideration. Not only did this literature provide valuable evidence about the history of the Bengali language, it also had much to tell us about everyday life and cultural values in the region prior to the arrival of Europeans.\nWorking in what is now West Bengal, Sukumar Sen completed his PhD in 1937 under the tutelage of some of the best historical linguists of the day: L.D. Barnett, R.L. Turner (author of A Comparative Dictionary of the Indo-Aryan Languages) and Jules Bloch with a dissertation entitled \"Historical Syntax of Middle and New Indo-Aryan (Bengali).\" He began collecting and editing manuscripts of Old Bengali materials, and that led him to Middle Bengali maṅgala-kāvya texts. Sen began with Manasā-maṅgala and published a critical edition of Caṇḍī-maṅgala in 1977; working with Pañcānana Moṇḍal, he critically edited and published the first third of Rūparāma Cakravarttī's Dharma-maṅgala in 1944, with a second edition that included one additional pālā in 1956.\nSen moved around the countryside in search of manuscript materials for his work with Middle Bengali literature. His reputation began to grow, and many people who owned old manuscripts offered them to him. Eventually he amassed a collection of nearly one thousand pieces. His collection, now held in the National Library in Kolkata and available also on microfilm, epitomized Sukumar Sen's ideas about what constitutes Bengali literature. He applied his meticulous scholarship to that collection to produce his five-volume Bāṅgālā Sāhityera Itihāsa, one of the first comprehensive studies of Bengali literature, which Sen later summarized and published in English; it also provided the basis for his many publications on the language itself.\nSukumar Sen's vision of Bengali literature included the above-mentioned maṅgala-kāvya, epic literature (mostly Bengali Mahābhāratas, with several Rāmāyaṇas), and Vaiṣṇava texts. He paid no attention to Bengali Muslim (including Sufi) literature or to literature in general produced in what is now Bangladesh. He received so much criticism for that lacuna that not long after, he published his slim volume, Islāmi bāṅglā sāhitya (1951). But other scholars meanwhile more than made up for Sen's omission.\nWorking in East Pakistan and later, Bangladesh, Abdul Karim Sahitya Bisharad (1871-1953) was also amassing a collection of premodern Bengali literary manuscripts. Karim was primarily but not exclusively interested in Muslim contributions to Bengali literature. In the course of his work, he discovered about one hundred Muslim poets of the premodern period, who had been previously unknown to modern scholars. Abdul Karim edited and published eleven of the texts he found.\nIn 1920-21 Bangiya Sahitya Parisad published his catalog of Bengali manuscripts, Bangala Prachin Puthir Bivaran. The Department of Bengali of Dhaka University later published a catalog of the manuscripts preserved in its library under the title Puthi Parichiti. That University acquired those works years later, when Karim's nephew Ahmed Sharif joined the faculty as the first research assistant in the Bengali Department (1950). His employment was conditional upon the donation of the manuscript collection, in exchange for which the university would take responsibility for its preservation.\nKarim's collection included works by Hindu authors as well, and most of those manuscripts are in the Varendra Research Museum in Rajshahi. His work was widely recognized and appreciated. The Nadia Sahitya Sabha bestowed the title of 'Sahitya Sagar' upon him, but he himself preferred the title 'Sahitya Bisharad,' which the Chattal Dharmamandali gave him.\n\nBangladesh may be geographically small, but its contributions to the world are immense. Tony K. Stewart did more than most to highlight Bangladesh's significance globally.\nAbdul Karim's nephew Ahmed Sharif (1921-1999) arguably exceeded his uncle in scholarly impact and output. Surrounded by his uncle's literary collections as a child and young adult, Sharif surprised no one with his own career choice. But by the time Sharif came of age, the Bangladesh liberation movement was well underway, and he became one of a group of left-leaning opposition intellectuals.\nAs for his literary work, he edited some forty manuscripts and published most of them. Probably his finest work, though, is his two-volume Bāṅgāli O Bāṅglā Sāhitya (1978, 1983), a comprehensive history of medieval Bangla literature of different communities, including Buddhist, Vaiṣṇavas, Bauls, and Sufis. Sharif produced several other important books on the literature of the medieval period.\nSharif's scholarship was outstanding, and thanks to him, and to his uncle, we know something of the literary wealth of premodern Bengal. Sharif was not only a brilliant intellectual, but also a rationalist and humanist who possessed strength of character and determination. He was a dedicated and fearless intellectual who frequently spoke out against fundamentalism, military rule, autocracy and, prior to 1971, the opponents to Bangladesh liberation. In March 1971 he administered the oath at the Shaheed Minar in Dhaka to writers vowing to fight against Pakistani autocracy. He served as General Secretary of the Asiatic Society of Bangladesh from 1969 to 1973. He received many awards over the course of his career, including the Bangla Academy Literary Prize, the Daud Literary Prize, and the National Ekushe Award. Rabindra Bharati University in Kolkata awarded him an honorary DLitt. Even after his retirement, Sharif remained committed to the study of early Bengali literature, and continued to help younger scholars work through sometimes difficult texts. He spent many hours in the first months of 1994 reading Vaiṣṇava jīvanī with this writer, for example, and working through the often challenging related manuscripts she had found.\nSharif's contemporary Anisuzzaman (1937-2020) was equally brilliant and equally committed to human rights. Anisuzzaman was born in 24 Parganas in India, but shortly after Partition, when he was in seventh grade, his family shifted first to Khulna and later to Dhaka, where he completed his education. He was a prolific writer. Among his most notable books are Muslim Manas and Bengali Literature (1964), Muslim Bangla Periodicals (1969), Bāṅglā sāhityera itihāsa Vols. 1 and 2 (1987), Creativity, Reality and Identity (1991), and two memoirs, Kālnirobodhi (2003) and Bipulaprithibi (2015).\nLike Ahmad Sharif, Anisuzzaman was very much involved in politics, and particularly with the Liberation Movement. When the liberation war started, he and many colleagues left for Calcutta, and worked hard for his countrymen and -women from there as General Secretary of the Bangladesh Teachers' Association.\nAnisuzzaman's teaching career began at Chittagong University and shortly after independence he took up a position at Dhaka University. He also conducted research at the School of Oriental and African Studies at the University of London, and at the United Nations University. He was honoured with visiting positions at the University of Paris, at Maulana Abul Kalam Azad Institute of Asian Studies in Calcutta, at North Carolina State University, and served terms as President of both Bangla Academy and of Nazrul Institute. He was a frequent guest lecturer in the US Department of State-sponsored Critical Language Scholarship Program in Dhaka (2006-2015). Throughout his life he was very generous with his time and wisdom with more junior scholars, always willing to help think through ideas and work on difficult texts.\nIn the twenty-first century interest in premodern literature has waned, and there is little institutional support for its pursuit. The Bangla Academy is a beacon of light. Growing out of the language movement of 1952 and modelled after the Academie Francaise, the organization has fully embraced its work in the promotion and development of the Bengali language. It continues to emphasize the nation's literary and linguistic heritage and has a vast publication agenda. It has become the largest publishing house in the nation, with a catalogue of several thousand books and journals.\nOutside of South Asia, a number of scholars in addition to Tony K. Stewart have developed love for Bengal and the Bengali language. Sadly, many are no longer with us. Edward C. Dimock (1929-2001) brought Bengal to the U.S. academy. He first travelled to India, with his wife and five small children, in the mid-1950s. There he studied with Professor Sukumar Sen, among others. Dimock eventually taught for 35 years at the University of Chicago, where he trained Stewart as well as many other scholars who made their own important contributions to the study of Bengali culture and literature.\nClinton B. Seely (b.1941) served two years in the U.S. Peace Corps teaching biology at the Barisal Zilla School in then-East Pakistan as he learned Bāṅglā. Seely went on to earn his PhD from the University of Chicago working under Dimock's tutelage. He subsequently spent a great deal of time in Calcutta during his studies and produced his dissertaton \"Doe in Heat: A Critical Biography of the Bengali Poet Jibanananda Das (1899-1954),\" in 1976. That was just the first of his works with Bengali literature, which included translations of compositions by Buddhadeva Bose, Ramprasad Sen, and Michael Madhusudan Dutta. Seely also helped produce an intermediate Bengali textbook for foreign learners and several software packages for writing in the Bengali script.\nCarol Salomon (1948-2009) probably did more than anyone to foster the study of the Bengali language in the U.S. Over the years she spent a great deal of time in Calcutta and in Shantiniketan, as well as in Bangladesh. The first time she heard Baul music she became fascinated with the Bauls, their music, their philosophy, and their way of life. Completely fluent in the language, she became something of a celebrity in both Bengals, but especially in Bangladesh, and her premature death was widely mourned. Salomon trained many U.S. scholars in the Bengali language. My own maṅgala-kāvyasgoes through Dr. Salomon on the one hand, and to Professor Dimock via Professor Stewart on the other.\nSalomon's career parallelled that of her friend and colleague Jeanne Openshaw, of the University of Edinburgh, who has written extensively on the Bauls, and continues to do so. Other U.S. scholars working today include and are not limited to Joel Bordeaux, Keith Cantu, Lisa Knight, Glen Hayes, Rachel McDermott, Sufia Uddin, and this writer. France Bhattacharya, in Paris, has translated several maṅgala-kāvyas. Scholars working at the Oxford Centre for Hindu Studies in the U.K. have also worked extensively on premodern Bengali texts pertaining to Gauḍīya Vaiṣṇavism.\nThe most versatile and generous current scholar of pre-modern Bengali literature is Professor Thibaut d'Hubert, who earned his PhD and completed his Habilitation in 2018 from the École Pratique des Hautes Études (EPHE) in Paris. He has worked on Kṛttibāsa Rāmāyaṇa, Ālāol's Sayphulmuluk Badiujjāmā, the Nūrnāma, as well as on the Brajabuli poems of Govindadāsa and the Persian ghazals of Akbar's court poet Fayḍī. D'Hubert has also striven to foster the study of premodern Bāṅglā literature through organizing annual reading retreats that bring together scholars from around the world who are actively working on Middle Bengali projects. The community he developed continued to meet, virtually, during the pandemic to read various of the Śītalā-maṅgalas. Participating scholars have come from Australia, Bangladesh, the Czech Republic, France, India, Japan, Poland, Russia, Spain, Sweden, the U.K. and the U.S. and are at various stages in their respective careers, ranging from graduate students to very senior scholars. As we sit around the table puzzling over a text, each one of us has something to contribute and we work as equals.\nWhile currently there may be little institutional support for the study of premodern Bengali literature outside of the Bangla Academy in Dhaka, the community of concerned scholars continues to grow. For all involved, it is very much a labour of love.\nThat love of the language led Tony Stewart to acquire a flat in Dhaka and to develop and serve as the first director of the U.S. Department of State-funded Critical Language Scholarship (CLS) Program for Bangla, hosted in Dhaka by the Bangla Language Institute at Independent University-Bangladesh. That program brought American students in a wide range of disciplines (anthropology, agriculture, law, medicine, religion, literature, history, and more) to Bangladesh. Those students learned in the classroom for several hours daily, partnered with local students to learn about daily life while improving their conversation skills, and visited sites of historical and cultural interest during their ten weeks in the summers in Dhaka. Some even found time to volunteer in local NGOs. Many had had no prior exposure to either the language or to Bangladesh but continued their study of Bangla back in the U.S., and a number returned to the CLS program more than once. Stewart insured that during their time with the program, they had the opportunity to interact with people who had been involved in the Liberation Movement, with writers and artists, and even had an evening with Baul singers. They learned about the ecological challenges of life in Bangladesh, from the Chittagong Hill Tracts to the Sundarbans. Many of those students have in time taken up positions in the American academy, or the Foreign Service, making use of their skills in the language as well as their knowledge of Bangladeshi civilization and culture. Bangladesh may be geographically small, but its contributions to the world are immense. Tony K. Stewart did more than most to highlight Bangladesh's significance globally.\nRebecca J. Manring, PhD, is a Professor of India Studies and Religious Studies at Indiana University-Bloomington.\n\n",
        "headline_1": "In Search of Premodern Bengal’s Literary Treasures",
        "headline_2": "",
        "link": "https://www.thedailystar.net/ds/focus/news/search-premodern-bengals-literary-treasures-3886926",
        "news_paper_name": "The Daily Star",
        "publish_date": "05-05-2025"
    },
    {
        "full_article": "In Kubla Khan, Samuel Taylor Coleridge crafts—and perhaps even curates with an eerie instinct—the image of a wayward ruler bent not merely on governing his empire, but on mastering the very fabric of existence itself. This act of curation, drawn from a dream and infused with the opium haze of the unconscious, epitomises the Romantic imagination as a site of sublime excess and visionary power. Coleridge's Xanadu is not merely a political domain but a projection of the inner psyche, where reason and reverie collapse. The emperor's pleasure dome, encircled by tumultuous forces, becomes a haunting image of ambition undone by the chaos it attempts to subdue. This tension finds its uncanny echo in the political spectacle fashioned by US President Donald Trump, across the first chaotic 100 days of his second term, marked by an extravagant display of control ultimately unravelled by the contradictions that sustained it.\nThis tension reverberates on the modern political stage—the \"Theatre of the Absurd,\" to borrow Martin Esslin's phrase—where Trump's administration, like Kubla Khan's empire, operates as a spectacle: a performance designed to project invincibility. Yet, just as the emperor's dome was surrounded by chaotic forces beyond his command, Trump's vision of an impervious America falters when confronted with the imbroglio of a global trade war, the dismantling of the global economic order, the retreat from globalisation, and mass deportations. His imagery is less an articulation of governance than a performance of control. This fleeting illusion lays bare the vagaries of perception and the vaingloriousness of power draped in the garb of permanence. \nAt the heart of Coleridge's poem lies the decreed pleasure dome, a manifestation of power and wealth, designed to dominate both land and imagination. Yet, it is a world \"where Alph, the sacred river, meanders with a mazy motion through caverns measureless to man,\" teetering with unpredictable forces that elude imperial control. This duality between vision and uncontrollable forces reveals the instability and vacuity in the assertion of absolute control. Trump's promises—of \"making America great again\" (for the second, discontinued term-time), bringing jobs back (insourcing), pivoting away from China, renaming the Gulf of Mexico, annexing Canada, acquiring Greenland through Machiavellian coaxing, and retaking the Panama Canal—amount to more spectacle than substance. These assertions of control unravel not merely into fragile illusions, but into a fully fledged fiasco. \nTake, for instance, the border wall, an enduring emblem of Trump's rhetoric. It was never merely about steel and concrete, but a declaration of will, a performance of sovereignty. Yet, it remained largely unfulfilled, thwarted by legal entanglements, logistical quagmires, and political resistance. Like a modern day pleasure dome, the wall was more mirage than monument—a spectacle that crumbled against bureaucracy, shifting public sentiment, and the inconvenient truth that the neighbouring country was neither beholden nor inclined to finance it.\nTrump's foreign policy mirrors this illusory control. His relationship with Russia, framed as a triumph of negotiation, is riddled with contradictions and failures. His interactions with Putin expose the limits of his manoeuvring. Trump's transactional diplomacy mirrors his domestic policies: power as spectacle, not substance. Nowhere is this more evident than in his dealings with Israeli Prime Minister Benjamin Netanyahu. At times, Trump isn't the master but the pawn—most clearly in his failure to broker a lasting peace or a ceasefire between Hamas and Israel. Trump's acquiescence to Netanyahu's ploy highlights his inability to navigate entrenched conflicts, revealing the fragility of his posturing. Yet, many observers see him outmanoeuvring adversaries intent on undermining him, as in the renewed momentum around a potential US–Iran nuclear deal, nearly a decade after he jettisoned the Joint Comprehensive Plan of Action (JCPOA) at Netanyahu's insistence. This ambiguity underscores the challenge of discerning substance beneath the performance.\nThis view of politics mirrors the emperor's delusion of shaping the world through sheer will. But just as Kubla Khan's empire was surrounded by nature's \"savage place,\" Trump's approach ignores global complexities. His policies assert dominance but fail to grasp the cascading complexities of diplomacy. The emperor's world collapses not from ambition but from hubris, blinded by arrogance and crippled by a failure of imagination. \nIn contrast to the emperor, Coleridge places the poet as one who creates not through assertion, but imagination. Having \"drunk the milk of Paradise,\" the poet upends power's territoriality and transcends its limits. The poet does not impose a vision; he allows the world to unfold. This is true power, rooted not in control but in the freedom of imagination.\nIn this lies the critical difference between fancy and imagination in Coleridge's terms. The poet's imagination is dynamic and organic, resonating deeply with the world's moral and metaphysical textures. The emperor's dome is the product of fancy, a surface-level construction mimicking power while hollow at its core. Trump, much like Kubla Khan, emerges as a ruler of fancy: his dominion is an assertion built on spectacle, lacking the coherence and transformative potential of genuine imagination. His rhetoric is loud—\"more bark than bite,\" as Fareed Zakaria puts it—and void of the visionary substance that might engender transformative change.\nIt is crucial to note that Coleridge's dream fragment captures far more leaps of imagination than Trump's elusive presidency—fragmented and fanciful—could ever fathom: a phantom MAGAdu, a mirage of spectacle and delusion, cobbled from MAGA and Xanadu. In a world where poetic vision might offer transcendence, Trump's politics remained mired in reactive spectacle. Where Coleridge gestures toward sublimity, Trump settles for simulacra. His politics lacks the poetic resonance that might offer enduring meaning—it is all surface, no depth.\nTrump's administration serves as a reminder of the fragility of power when built on illusion. His narrative of strength and victory is increasingly exposed as hollow. Just as Kubla Khan's dome was surrounded by chaos, Trump's spectacle-driven empire is undermined by governance realities. His vision of America's dominance is not matched by the complexities of a changing world.\nIn the end, Trump's political vision, much like the emperor's, is vulnerable to collapse not from its ambition, but from ignoring deeper forces of complexity and resistance. Power rooted in fancy cannot withstand the forces it seeks to control. Both Trump's and Kubla Khan's empires embody the same truth: power, when divorced from imagination and understanding, is bound to fail.\nThere is a fundamental difference between Kubla Khan's decree to build a pleasure dome in Xanadu and Coleridge's imaginative vision that unfolds after \"drinking the milk of Paradise,\" epitomising Plato's portrayal of the poet in Ion. Khan's \"decree\"—an imperial assertion—springs from fancy, grounded in reason and taste, gone haywire. His vision remains architectural and territorial, marred by ambition. \nIn contrast, Coleridge's visionary journey—induced by the \"milk of Paradise\"—belongs to imagination: not willed but received, not constructed but revealed. His dome is not a monument of dominion, but an echo of lost wholeness, a beauty glimpsed and then interrupted. The poem dramatises the contrast between imperial fantasy and poetic imagination, between power that commands and vision that transcends.\nDr Faridul Alam, a retired academic, writes from New York.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Trump’s Xanadu: Power, spectacle, and the mirage of control",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/trumps-xanadu-power-spectacle-and-the-mirage-control-3886531",
        "news_paper_name": "The Daily Star",
        "publish_date": "05-05-2025"
    },
    {
        "full_article": "Once upon a time, not so long ago, the border between Bangladesh and India was not just a line drawn on maps—it was a bloodied seam, stitched together with the pain of innocents. For decades, the Indian Border Security Force (BSF) enjoyed an unchecked licence to kill, literally. And Bangladesh, under the suffocating collar of Sheikh Hasina's regime, remained submissive. But those days are gone. The butcher is out. The tides have turned. Let's rewind.\nFew names stir the soul like that of Felani Khatun. A 15-year-old girl who dared to dream of a better life, Felani was gunned down by the BSF in 2011 while crossing back into Bangladesh. Her body hung from the barbed wire for hours, an unwilling martyr to Indian border brutality. The photograph that captured her lifeless form became an iconic indictment of the \"world's largest democracy\" and its staggering hypocrisy.\nOne might imagine that the international shame alone would provoke some introspection in New Delhi. But introspection, much like justice, is a rare currency when power intoxicates. Not only did the BSF deny justice, they doubled down. From 2000 to 2020, over 1,200 Bangladeshis were killed by BSF bullets. Their crimes? Cattle trade, alleged trespassing, or simply being too close to the line that divides brown from browner.\n\nThe Indian media, ever faithful to its nationalist gospel, described these killings as \"anti-infiltration\" operations. In reality, they were often nothing short of extrajudicial executions. And with Hasina's government too busy importing onions and exporting sovereignty, there was little protest from Dhaka.\nIndia has long mastered the art of regional muscle-flexing under the guise of democratic diplomacy. While it sermonised peace and prosperity, it wielded the BSF aggressively on its eastern front. Bangladesh was expected to comply, stay silent, and accept collateral damage in the name of \"strategic relations.\" Under Sheikh Hasina, compliance was institutionalised. Her government's policy was essentially: \"BSF kills, we stay still.\" In exchange, she received glowing endorsements from India and dubious praise for \"stability.\" That stability, of course, came at the cost of blood-soaked borders and silenced dissent.\n\nBut like all bad arrangements, this, too, had an expiry date.\nHasina's fall in August last year was not just a political transition; it was a psychological liberation. Her departure signalled the end of Bangladesh's self-imposed vassalage. The people had spoken, and this time, they roared.\nWith the new leadership came a new tone. Border killings, once met with timid press notes, are now responded to with thunderous protest and sharp diplomacy. Reports now emerge of villagers also refusing to be passive victims. Communities along the border are organising, resisting, and yes, retaliating. The once-muted backbone of Bangladesh has returned, now reinforced with public support and political will.\nIn Meherpur, locals chased off BSF troops attempting to enter Bangladeshi territory, pelting stones and shouting slogans. In Chapainawabganj, community patrols have sprung up, coordinated with local law enforcement to monitor cross-border activities. When Swarna Das, a schoolgirl, was abducted and brutalised by BSF personnel, it no longer took months of diplomatic crawling for the news to break. Social media exploded. Protests erupted. Demands were made, and not politely.\n\nIndia is learning, perhaps for the first time in decades, that Bangladesh is not a backyard—it's a nation. And its people, once subdued, are reclaiming their voice.\nOf course, the Indian establishment, caught off guard, is responding with its usual playbook. Accusations of \"radicalism\" fly fast. Op-eds in Delhi whisper of \"anti-India sentiment\" being stirred up by \"vested interests.\" But this is not about sentiment; this is about sovereignty. This is not about radicals; it's about citizens refusing to be killed like cattle and ignored like pests.\nBorders often reflect the character of nations. For years, the Indo-Bangladesh border reflected a colonial hangover dressed up as partnership. But no more. Today, that border reflects resistance, pride, and a new calculus.\nThis doesn't mean war or conflict. It means accountability. It means Bangladesh no longer accepts the asymmetry of power as fate. It means Dhaka speaks with confidence, not permission.\nThere's poetic irony in the way things have shifted. India, which once used BSF as a symbol of dominance, now finds itself pleading for \"calm and cooperation\" as border tensions spike—not because Bangladesh seeks revenge, but because it demands dignity.\nAnd why not? If Israel can bomb its way to \"security\" and India can shoot unarmed teenagers to defend \"territorial integrity,\" surely Bangladeshis have the right to demand that their citizens not be murdered at fences.\n\nThe recent uptick in border-level resistance is not lawlessness. It's what happens when people are pushed too far, when lives are deemed expendable, and when a state forgets its first duty: to protect.\nThis is not just about BSF's bullets or India's muscle. It is about the reckoning of decades of diplomatic dishonesty and violent arrogance. It is about the breaking of a silence that should never have existed.\nFelani Khatun's ghost still hovers over that barbed wire fence. But today, she is no longer alone. Her story, once told in whispers, is now shouted from rooftops. The border may still be fenced, but fear is not.\nIndia, a nation proud of its lunar missions, can't seem to stop its BSF jawans from stumbling into sovereign Bangladesh—and begging their way out. Recently, two armed BSF soldiers crossed the international border and tried to herd Bangladeshi farmers like colonial-era overlords. But this isn't the Bangladesh of 2012. This is the Bangladesh after Hasina, where people don't cower—they retaliate. The once-muted BGB sprang to life. Villagers and BGB troops not only confronted the intruders but caught them, weapons and all. In a scene fit for satire, a BSF jawan was caught on video grabbing a BGB soldier's leg in apology.\nIn another drama, two Bangladeshi farmers were seized by the BSF for stepping over an invisible line to thresh paddy. In a poetic twist, locals captured two Indian nationals on their land and handed them to BGB. No bullets, no bluster—just symmetry.\nThe ensuing flag meeting saw a quiet but firm exchange of citizens. This time, Bangladesh didn't blink.\nWhat's changing is more than tactics; it's the tone. The nation that once endured quietly now demands loudly. And enforces it, with video proof and viral pride. Bangladesh is no longer the timid sibling. It stands firm. And for any BSF soldier tempted to trespass again, one question remains: Is the leg you'll have to grab worth the ego you'll leave behind?\nHistory has shown that fences, be they of barbed wire or ideology, eventually fall. The question is not if, but when. The BSF's era of impunity is drawing to a close, not because of international outrage (which remains lukewarm), but because Bangladeshis have had enough. And when a nation finds its backbone, even the mightiest neighbour must reconsider its posture.\nFrom Felani to Swarna, from silence to defiance, the story of Bangladesh's border is no longer written in Indian ink. It is being authored anew, by its people.\nH.M. Nazmul Alam is an academic, journalist, and political analyst. He can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "From barbed wires to backbone",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/barbed-wires-backbone-3886411",
        "news_paper_name": "The Daily Star",
        "publish_date": "05-05-2025"
    },
    {
        "full_article": "Bangladeshi migrants continue to be exploited in many ways. But the revelation that a number of aspiring migrants from Bangladesh have been trafficked to Russia and forced to fight in the war against Ukraine is quite shocking. According to media reports, some travel agencies are luring young men with the promise of high-paying jobs in Russian factories and restaurants. However, instead of the promised jobs, they are then forced to join the Russian military as \"contract fighters\" and sent to the frontlines with little or no training.\nAccording to a report in this daily, the Human Trafficking Cell of the Criminal Investigation Department (CID) recently busted one such travel agency, which allegedly trafficked around 20 Bangladeshis to Russia over the past two years. Among them, at least three have been killed in the war and another has been critically injured. Some remain missing, with their families having lost all contact since they were sent to the battlefield.\n\nOne key reason why traffickers have found a lucrative market in Bangladesh is the widespread poverty and unemployment among young men. One can only imagine the level of desperation it takes for someone to be enticed by offers of factory work in a country known for its brutal winters and volatile situation.\nWith the Russia-Ukraine war dragging into its fourth year, it is believed that Russia, despite being the world's second-largest military power, is struggling to recruit enough soldiers locally. As a result, it has increasingly turned to the Global South—including India, Nepal, Cuba, and Sri Lanka—for recruits. Central Asian migrants already in Russia have also reportedly faced coercion or intimidation into joining the war. Recent reports from the Bangladeshi media confirm that our citizens, too, are now falling victim to traffickers who are essentially selling foot soldiers to the Russian military.\nOne key reason why traffickers have found a lucrative market in Bangladesh is the widespread poverty and unemployment among young men. One can only imagine the level of desperation it takes for someone to be enticed by offers of factory work in a country known for its brutal winters and volatile situation. The aspiring migrants reportedly paid between Tk 9 to Tk 12 lakh each for the promised jobs. That they would take such risks reflects a lack of faith in the opportunities available at home, pushing them into the arms of human traffickers.\nWe urge the authorities to raise awareness—especially in rural areas—about the dangers of war trafficking, and also to create more viable economic opportunities for youth in the country. Law enforcement drives against trafficking networks must be strengthened. Furthermore, the government must use its diplomatic channels to obtain the list of Bangladeshi nationals recruited by the Russian military, and initiate efforts to bring them back safely.\n",
        "headline_1": "Protect our migrants from forced participation in a foreign war ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/protect-our-migrants-forced-participation-foreign-war-3883896",
        "news_paper_name": "The Daily Star",
        "publish_date": "05-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 05, 2025 00:00:00  \nIt is disheartening that at a time when Bangladesh is in dire need of US dollars, many of the country's freelancers opt for keeping a significant portion of their income in foreign banks instead of remitting the money back home. High-earning freelancers, particularly those making over $800 a month, reportedly keep 50 per cent to 70 per cent of their earnings in foreign accounts, potentially depriving the nation billions of dollars in annual revenue. In 2023, freelancers collectively earned approximately $1.0 billion; however, estimates suggest that if all earnings were repatriated, the total earning from this sector could reach as high as $3.0 billion. According to a Financial Express report, freelancers are discouraged from repatriating their earnings due to a host of factors such as unfavourable exchange rates, high VAT and source tax on outbound payments and a perceived disparity in treatment between freelancers and overseas workers.\nFreelancers complain that while migrant workers enjoy a preferential exchange rate and a 2.5 per cent cash incentive, they receive neither despite making a similar contribution by injecting foreign currency into the economy. Moreover, when they need to use their earnings for international services - such as digital marketing or software subscriptions - they face a VAT at the rate of 15 per cent and a possible 25 per cent source tax. Thus the freelancers are forced to maintain foreign accounts and spend internationally using international cards simply to avoid excessive taxation. Spending on promotion and essential software procurement is crucial for freelancers to remain competitive. So why impose steep VAT and source taxes on such vital services, especially when these measures favour keeping earnings abroad? This policy is not only counterproductive but also economically short-sighted. Therefore, abolishing or rationalising outbound VAT and source tax on international promotional expenses along with extending the 2.5 per cent remittance incentive to freelancers, as is currently offered to overseas workers, would make repatriating earnings more attractive. The gig economy offers immense potential, and the authorities must not stifle its growth by enforcing outdated policies.\nWith over one million registered freelancers, Bangladesh is home to the second-largest number of freelancers in the world, yet it ranks only seventh in terms of freelancing earnings. This mismatch between the size of the workforce and the income generated clearly indicates significant untapped growth potential. As a matter of fact, most of the country's freelancers are engaged in low-paying work such as data entry, basic graphic design and web development, often earning as little as five to seven dollars per hour. Moreover, many of these tasks can now be readily performed by Artificial Intelligence (AI). So, upskilling is a critical necessity for freelancers to survive in the globally competitive marketplace.\nFreelancing has become a buzzword, generating considerable interest among the youth. However, opportunities for institutional training in freelancing are inadequate. Most freelancers have learned the trade on their own through online resources. Government IT training centers offer only a handful of basic courses, often limited to introductory topics. Each year, around 25,000 computer science graduates are coming out from the country's public and private universities. Where are they going and why are they not interested in freelancing? If even a portion of these talented and skilled graduates were engaged in freelancing, Bangladesh would not be a laggard in terms of freelancing earnings. To develop a skilled freelancing workforce, these graduates should be trained in specialised, in-demand areas and encouraged to pursue the vocation by removing regulatory hurdles. Such steps will raise the overall standard of talent in the freelancing ecosystem and secure Bangladesh's competitive position in the global digital economy.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Unlocking potential  of freelancing",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/unlocking-potential-of-freelancing-1746372355",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       May 05, 2025 00:00:00  \n\nAfter free and fair election, press freedom is the next most pressing issue that concerns the Western powers when it comes to evaluating the socio-political condition of their client nations in the South. Then come human rights, gender rights and equity and so on as a matter of course. However, on the occasion of this year's World Press Freedom Day, the UNESCO has described it 'as a day of support for media which are targets for the restraint, or abolition, of press freedom'. But when is 'press freedom' target of the powers that be? Obviously, it is when the Press or the media tell or try to tell the truth. And who constitute the audience that hear the truth? Of course, it is the mass people. In other words, so long as the Press or the media tell people the truth, their freedom becomes the target of the vested interests which want to restraint or even abolish the former, as pointed out by the UNESCO. \nTrue, this year, according to the Reporters Sans Frontieres (Reporters Without Borders), its main index has fallen to its lowest-ever level in the 23 years that it has been tracking press freedom. The RSF in its annual ranking report noted that the situation of press freedom has worsened in the US since President Donald Trump took office in January. No one is surprised because in the topsy-turvy world under president Trump, press freedom cannot expect to remain unaffected. Small wonder that the RSF in the present case is expressing concern about press freedom in a country that is not a southern post-colonial country but one that was considered one of the champions of democracy and press freedom. However, it was also not hundred per cent free under Trump's predecessor, Joe Biden. The US media was then either not telling or not willing to tell the truth about what was happening, say, in Gaza of Palestine. Should the American people not know the truth? Interestingly, the mainstream media do not seem to be willing to tell the truth even though there appears to be no government restrictions on what to report to the media or not. On the contrary, the mainstream print and electronic media seem to be engaged in what American linguist and public intellectual, Noam Chomsky, and Edward S. Herman tried to say in their book, \"Manufacturing Consent.\" In fact, the very title of their book says it all. In Third World countries, it is easy to identify the enemy or enemies of press freedom. The restrictive laws such as the Digital Security Act (DSA) 2018 is one such law enacted during the previous autocratic regime in Bangladesh. Though, initially, it was said that the law was designed to ensure digital security by holding those committing cybercrime to account, the real purpose of the government became clear with the passage of time.\nThe Act was one of the worst legal instruments in history in Bangladesh to crush dissent and press freedom. Understandably, the press in Bangladesh then survived by self-censoring. Then there was also a section of the media that wanted to tell the truth. They faced the consequences that include closure of those media outlets or houses. There was yet another section that was too willing to support autocracy and its narrative to suppress dissent wherever expressed and in whatever form. The social media, in particular, became a major target of the so-called DSA. Such attacks on press freedom by the government in a less developed country situated in the South are unsurprising. The formula answer why is it so is the lack of the social and political institutions that nurture democracy and all that goes with it including press freedom.\nBut that argument does not apply to countries with highly developed social and legal institutions like the US. Also, the Press itself is censoring itself. If anything, this development is alarming. Journalists in the less developed countries consider Western standard of journalism ideal. In that case, deterioration of the Press's ethical standard in the Western press may appear as new normal to many uncritical media workers in the South. The phenomenon of Bangladesh's media becoming subservient to the autocracy can be taken as a case in point. In modern times, ideas, good or harmful, are propagated instantly for others to, especially in the Third World, to copy and paste on their conditions uncritically. For obvious reasons, there's no mechanism to separate truth from fiction. In fact, with the advent of AI the task has become harder. It would be worthwhile to note at this point the widespread use of devices like chatbot and AI to generate false contents that raised false and imaginary allegations and propaganda about the safety and security of the minority communities in Bangladesh. It is against this backdrop, the UN-declared World Press Freedom Day is being observed with the theme of 'Reporting in the Brave New World -The Impact of Artificial Intelligence on Press Freedom and the Media. While welcoming the rosy vision of a Brave New World, one may also consider the danger that AI poses to humanity. It is not only the common people who, driven by the fear of job loss, might consider AI as a blight, not a boon. But such fear of retrenchment need not come true. However, there are other fears that even experts in the field have expressed that needs to be taken seriously. One might recall here the dystopian,1932 novel by the English author Aldous Huxley. It was about controlling humans through genetic engineering and creating a society to suit their purpose. But given its intelligence and the power to mimic human's thinking process, it can do things better and faster. That means, AI poses a worse kind of dystopia than one might imagine. Since media are about telling a true story, the danger is that unless safely used, it can cause serious disruptions in society. International bodies should be able to create safeguards against abuse of AI and help protect media against misinformation as well as disinformation. Filtering fact from fiction is important.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Filtering fact from  fiction in media",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/filtering-fact-from-fiction-in-media-1746372402",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       May 05, 2025 00:00:00  \n\nThe GI (Geographical Identification) recognition for the Sundarbans' honey, Munshiganj's patkheer and Narsingdi's latkon comes as highly savouring news to the people. But these were not the only produce and products. Altogether 24 such items with their origins in certain localities spread across the country received the GI tag. The GI certificates were handed over to representatives at a ceremony organised on the occasion of the World Intellectual Property Day 2025 at the Foreign Service Academy. \nOf the 24 GI-recognised items, 10 are agricultural and plant produce and the rest have been developed by ingenious local people to set a tradition of their own. Each of the fruits or agricultural produce has its distinct taste and specialty. Narsingdi is home to Latkon but surprisingly it is known as Burmese grape with its scientific name Baccaurea ramiflora. This is injustice to the popular fruit. Why should a fruit from Narsingdi be called Burmese grape? It could well be called Bangla grape. \nThen two varieties of litchi have been enlisted for GI recognition---one from Magura and called Hazaripuri litchi; and the other from Dinajpur known as Bedana (pomegranate) litchi. The other fruits to have made the list of GI tag are pineapple from Madhupur, hog plum (aamra) from Barishal, Nak Fajli mango from Naogaon and Gazipur's jackfruit. Koshoreganj's Rataboro paddy and Dhakai Futi Karpas---a special kind of cotton and its seed-plant make this natural kind of produce complete. \nOf the 14 products, most are sweetmeat with the exception of gamchha (a kind of thin towel) and lungi (traditional men's skirt) from Sirajganj, Monipuri shari from Sylhet, Katan Shari from Mirpur, Dhaka, Khadi from Kumilla and Kumarkhali's bed sheet. \nThen come the savoury sweetmeat items or dairy products such as yoghurt made from buffalo milk in Bhola, Chhanamukhi from Brahmanbaria, Chhanar payes from Sherpur, Cheese from Astogram and Jamurkir sandesh from Mirzapur, Tangail. Together with Patkheer, all these array of traditional products make a strong statement of the Bangalee's inventive minds that went into the development of such mouth-watering foods. \nBangladesh introduced its Geographical Indication of Goods (Registration and Protection) Act in 2013. Jamdani Sari was the first product to have received the GI recognition. Twelve years on, a total of 55 goods have received this recognition with the latest 24 this year. However, recognition in the country does not automatically translate into international approval. For example, India received GI recognition for Sundarban's honey earlier but 64 per cent of the forest lies in Bangladesh. Now the controversy and dispute are there similar to the ones over the Jamdani sari. Had Bangladesh moved first, its claim would be considered on a priority basis. Now, if there is no objection within two months to the appeal Bangladesh submitted, the international recognition will be obtained. Otherwise, it would be wiser to hold negotiation with India for a mutual understanding. \nThe list of the produce and products earning GI stamp certainly indicates that quite a few more are strong candidates for the recognition. Potato round and of reddish colour from Bogura, jam alu (potato) used usually for meshed dish surely deserved GI recognition. If yoghourt varieties from Bogura and Bhola qualify for GI recognition, yoghourt from Gournadi certainly is a prime candidate for this recognition. Gournadi's yoghourt is not only famous for its extraordinary taste but its thick texture also makes it special. The best of the kind would not drop even if the clay pot in which it is fermented is upturned. No other yoghurt compares with this special type still produced by some of the discerning 'moyras' (sweetmeat makers). Similarly Balish misti from Netrokona also deserves GI recognition. \nLast but not least, gamchha from Sirajganj may have wider publicity but similar if not better products from Fultala, Khulna and Jhalakathi should make the GI list. Finally, the lungi and cotton shawl made by indigenous people in the hilly districts should also be promoted for GI recognition.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "There are more candidates  for GI recognition",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/there-are-more-candidates-for-gi-recognition-1746372473",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 05, 2025 00:00:00  \n\nThe 21st century heralds an era where Artificial Intelligence (AI) is not only deemed as a mere innovation rather a revolutionary force forging new paths for businesses, society, and interpersonal communication. Central to this wave of technological transformation is the customers who are empowered, enlightened and expectant of meticulous personalised service.\nImagine trying on all your favourite dresses without ever stepping into a fitting room. Sounds like a dream to many, but in this era AI has engraved its mark in transforming the way we shop by bringing the fitting room experience to our smartphone. Companies like FitRoom or Zara AR app are utilising the qualities of AI more adeptly than ever. The infusion of AI into the customer service segment has reconceptualised efficiency management and responsiveness. \nPeople often hesitate to purchase clothes online due to the uncertainty and the hassle it comes along with but here's where AI steps in and makes the experience delightful to remember for a lifetime. Through the use of AI customers can now try on clothes virtually without having to physically wear them. \nAI is being incorporated across industries in Bangladesh at an increasing rate. AI emphasises on improving efficiency, optimising repetitive work, and enables smarter ways of making good decisions; hence, it has become an integral part of Bangladesh's economy. \nIts unparalleled ability to process vast datasets promptly empowers businesses to decode vital customer preferences and behavioural patterns. Customer service automation features are used by all sorts of companies to resolve issues as quickly as possible. E-commerce businesses have widened their horizons through the implication of AI systems like personalised recommendation i.e Daraz. Moreover, some companies are experimenting with voice and image research to make their customer experience better. \nThe AI powered chatbots provide 24/7 customer service, both in Bangla and English. Mobile financial banking (MFS) apps like BKash, Nagad use the implementation of artificial intelligence in shoring up its customer's privacy and for avoiding any type of fraudulent practices from happening. \nIn essence, Artificial Intelligence stands as the cornerstone of this century and its customers' preference. Starting from the anticipation to satisfaction, or personalisation to security, AI has influenced every facet of the customer journey.\nMehjabin Sultana Zaman Anika, Student \nNorth South University\nmehjabin.anika@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "When technology listens to customers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/when-technology-listens-to-customers-1746372496",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-05-2025"
    }
]