[
    {
        "full_article": "The sweeping changes to the Goods and Services Tax (GST) regime, authorised by the GST Council on Wednesday (September 3, 2025), have come as a shot in the arm for the mood of the people, and, potentially, for the economy overall. Few things spur optimism and demand as effectively as tax cuts. The Centre did well to push the GST Council towards these reforms, which rose to the occasion and cleared them quickly. Criticism that these reforms have come too late is neither here nor there. The GST Council is a federal body, and any of the States could have suggested these rate cuts earlier but did not. The appropriateness of the Prime Minister’s announcement of the reforms in his Independence Day speech, coming as it did before either the relevant Group of Ministers or the GST Council met, can be questioned. But here, too, the fact that the Council announced its decisions on the first day of what was supposed to be a two-day meeting shows that the States were on board. The minutes of the 56th meeting will reveal each member’s stated position. The rate changes span nearly every sector, and are, overwhelmingly, in the downward direction. Very few items, such as high-end motorcycles and higher priced apparel, are set to become more expensive. Tempting as it was to pack the 40% bracket with more items, the GST Council did well to keep it narrow. Overall, these rate cuts, coupled with the income-tax rate cuts announced in Budget 2025, should serve as a much-needed boost to consumption at a time when other engines of growth such as exports and private investment are sputtering.The government has maintained that the revenue implication of these GST rate cuts would be around ₹48,000 crore a year, based on 2023-24 consumption data. Given the scope of the cuts, this seems like an underestimation. However, only time will tell what the actual number will be. It is to be noted that the GST Council decided to do away with the compensation cess, despite Opposition-governed States calling for one to protect their revenues. Such a cess would have diluted the rate rationalisation and simplification efforts and is best eschewed. Instead, the States are now going to have to look to their own revenue sources, as well as the 16th Finance Commission, to offset the losses they face. The new GST 2.0 still has some anomalies, and is still more complicated than it needs to be, but the removal of duty inversions and the easing of paperwork are a huge improvement. The government should now revive the National Anti-Profiteering Authority, at least temporarily, to ensure that the rate cuts are passed on once they kick in on September 22.\r Published - September 05, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Independence Day\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        Union Budget\n                    \n                            /                      \n                        \n                        government",
        "headline_1": "Cuts in time: On the new GST system",
        "headline_2": "The GST rate cuts will boost consumption at a time when exports face challenges",
        "link": "https://www.thehindu.com/opinion/editorial/cuts-in-time-on-the-new-gst-system/article70012312.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-09-2025"
    },
    {
        "full_article": "The Delhi High Court’s decision to deny bail, once again, to former university scholar Umar Khalid and others in the “larger conspiracy” case relating to the 2020 Delhi riots is a grim affirmation of how special security laws, combined with a deferential judiciary, can transform pre-trial detention into extended punishment. The court’s reasoning, which held that Khalid’s five-year-long custody is not in itself sufficient grounds for bail, rests on the stringent provisions of the Unlawful Activities (Prevention) Act (UAPA). Section 43D(5) of the UAPA bars bail if there are “reasonable grounds” to believe the accusations are prima facie true, a clause that judicial interpretation since the Supreme Court’s Watali (2019) judgment has hardened into a near-insurmountable barrier. By forbidding a detailed examination of evidence at the bail stage, the law effectively forces courts to accept the prosecution’s narrative. If the charge sheet alleges a conspiracy and attaches voluminous material, the accused is jailed, sometimes indefinitely. With provisions that extend the investigation period to 180 days and prohibit anticipatory bail, the UAPA creates a legal framework where the process itself becomes the penalty — as in Khalid’s case. Courts, however, possess the authority to counter such procedural constraints. Long incarceration without trial has been recognised in rulings as grounds for relief, even in serious cases.A different Bench of the High Court, while granting bail in 2021 to three other activists in the same case, had ruled that the state, in its anxiety to suppress dissent, had “blurred the line between the constitutionally guaranteed right to protest and terrorist activity”. It astutely observed that peaceful mobilisation, however inconvenient to the government, could not be casually categorised as a “terrorist act”. The current Bench appears to have ignored this crucial distinction. In treating protest-related speech and organisational planning to blockade roads as sufficient to establish a prima facie case of terrorism, it punishes dissent, precisely where constitutional liberty should have the stronger claim. This approach echoes the dangers embedded in the Bharatiya Nyaya Sanhita’s Section 152, whose vague vocabulary invites the same broad strokes that have been weaponised under the UAPA. Incomprehensibly, the Bench even justified the trial’s slow pace, calling it “natural”. The price for Khalid is already severe, with his name fixed in the public imagination as a conspirator. When the judiciary defers to the state’s anxieties and allows the line between protest and terrorism to be erased, the distinction between accusation and guilt collapses. If prolonged delay is permitted to be a substitute for conviction, the constitutional guarantees of liberty and free expression under Articles 19 and 21 are hollowed out for all citizens. Published - September 05, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        university\n                    \n                            /                      \n                        \n                        arrest\n                    \n                            /                      \n                        \n                        prison\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        act of terror\n                    \n                            /                      \n                        \n                        constitution",
        "headline_1": "Process as punishment: On the Umar Khalid case",
        "headline_2": "Repeated bail denial, as in Umar Khalid’s case, enables state overreach",
        "link": "https://www.thehindu.com/opinion/editorial/process-as-punishment-on-the-umar-khalid-case/article70012339.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-09-2025"
    },
    {
        "full_article": "By making everything from T-shirts to TVs costly, Trump makes a new breed of American entrepreneur\nThe CEO of Rackets Inc was addressing his cohorts.\n“Today we have been presented with the opportunity of not just a lifetime, but many lifetimes,” he began.\n“As we all know, Rackets Inc was founded in America, the great land of opportunity, in 1920 with Prohibition, which lasted till 1933,” he continued.\n“Thanks to Prohibition, which provided us with lots of literally liquid assets, we laid the basis for our empire. Regrettably, Prohibition was too good a thing to last. And when it was repealed after 13 years, we had to diversify into other areas of enterprise,” he recapped.\n“Fortunately we soon found a new line of business that was even more profitable than the old one, namely drugs, which snowballed into a mega moneymaker, starting with marijuana and going on to heroin, cocaine, and fentanyl,” said the CEO.\n“Trouble is, like the repeal of Prohibition, which legalised alcohol, and which was bad for business, they’ve already started legalising marijuana in some places. This could be the thin edge of the wedge, and before you can say ‘Things go better with cocaine,’ they’ll have legalised all drugs,” said the CEO glumly.\nThen he cheered up. “But as one door closes, another opens. And the new open door is called Tariffs.”\n“Tariffs?” asked the collective cohorts, looking collectively baffled.\n“Tariffs,” repeated the CEO. “Tariffs are extortion by another name and have been invented by that Racketeer-in-Chief,” he explained.\n“Thanks to Tariffs, the cost of everything from T-shirts to TVs is going to go up for American consumers. So instead of rackets in liquor and drugs, we’ll do a Tariff racket. We’ll jump over the Tariff barrier by backdoor dealing in everything from non-Tariff T-shirts to TVs, cars to confectionery at cut-price non-Tariff rates. And we won’t have only boozers and druggies as customers. Everyone will be a customer because everyone will be hit by Tariffs,” expounded the Don.\nThe name of the new Rackets Inc was registered as The Associated Importers For American Market, or A I F A M. Which, read backwards, is MAFIA.\n\n",
        "headline_1": "Make a racket",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/make-a-racket/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-09-2025"
    },
    {
        "full_article": "Putin-Xi’s immortality exchange is less about longevity, more about the desire for endless power\nIncreasing life expectancy by replacing organs one by one? There’s nothing on the scientific horizon to indicate that replacing human organs, like we would damaged car parts, can increase lifespans. But clearly, Putin – who has made longevity a priority for his health ministry – believes it’s a possibility. The hot mic ‘light’ moment that caught Putin talking immortality with Xi, both 72, and a keen Kim, a toddler in comparison at age 40, has upped the chatter on what’s on the Russian’s mind. But, first, a nod to the hot mic which along with CCTV, candid cams and social media ensures nothing in public will ever be private.\nOnto the Asian power pack’s obsession with power, yearning for longevity. The round-the-clock medical care and personalised medicine the powerful receive is nothing to sneeze at. Xi and Putin intend to remain boss for good. Putin changed the constitution so he can ‘rule’ till 2036, when he’ll be 83 years old. China removed the two-term limit on the presidency in 2018, allowing Xi to remain in power for life. Upheavals unleashed by hubris aside, who knows what science & politics may bring about. Last year, per an investigation by a Russian media outlet reported in The Guardian, Kremlin set up a research centre on Putin’s instructions called New Health Preservation Technologies – dedicated to combating ageing. It reportedly invests in organ-printing tech that uses lab-grown cells to produce replacement organs.\nSo, Putin’s purr for Xi’s ear – “human organs can be continuously transplanted…[you can] even achieve immortality” – may not have been a casual remark after all. Maybe he was making an emphatic marketing pitch to his contemporary. Xi’s response was, perhaps, even wistful. “This century…humans may live to 150 years old.” Putin’s words, “longer you live, younger you become” are undoubtedly music to many ears – not least at the other end of the world, where a soon-to-be-80-year-old is most excited about a new ballroom.\n\n",
        "headline_1": "Age Of Power",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/age-of-power-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-09-2025"
    },
    {
        "full_article": "GST reductions won’t boost economic growth unless businesses pass them on fully\nMemes about taxes – taxman grabbing a slice of your pizza – are universal. But from Sep 22, the new GST will put govt on a diet. With the 12% and 28% tax rates cancelled, and most goods moved to the corresponding lower rates of 5% and 18%, your indirect tax burden should come down. For things like pencils and erasers, the reduction may be hard to pass on to end users, unless they are buying in bulk. But in health and life insurance, where govt has forgone GST completely, the expected savings are substantial, and will hopefully increase insurance penetration.\nThat’s the hope, but noises from industry suggest the benefit may not be passed on in toto. Insurers say unless they are allowed to claim input tax credit on expenses, the net relief for policy buyers will be small. This requires govt’s urgent attention because policy reform is no good without ground action. The whole point of taxing less is to make goods and services cheaper, boost demand and drive economic growth – not pad the bottom line.\nAlthough the CGST Act requires firms to pass on benefits of lower tax rates to consumers, registration of cases for breach of this rule was discontinued in April this year. Now, govt can only advise firms in this regard. But this brings into play the logic of marginal returns. If slashing prices boosts demand and profits, firms will do so. But if they foresee no change in demand, maintaining prices at the current level will be more profitable.\nPrivate consumption accounted for 61% of GDP last year, and is the main engine of India’s economy. But for a long time now, discretionary spending has been weak. Car sales didn’t perk up around Diwali last year, and people have been spending less on eating out, etc. That’s why the generous tax reduction on smaller cars, bikes, and all trucks and tractors, can be a game changer this festive season. The tax cuts also show a change in official mindset, with large TVs, ACs and dishwashers no longer seen as “luxury” goods – they’ve been placed in the 18% slot. GOI’s risking ₹93,000cr in revenue with these cuts, but if demand picks up, the gains could be bigger. Since states will bear 70% of this risk, GOI shouldn’t shy away from helping them. But first, it must ensure that lower taxes lead to lower prices.\n\n",
        "headline_1": "Up To Companies Now",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/up-to-companies-now-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-09-2025"
    },
    {
        "full_article": "Imagine two powerful leaders, Russia’s Putin and China’s Xi, secretly chatting about living forever. A microphone caught them talking about “immortality” – which means never dying.\nPutin, who is 72, thinks science might one day let people replace organs (like hearts or livers) the way we replace car parts. Scientists don’t actually know how to do this yet, but Putin has even started special research programmes in Russia to study ageing and test ideas like 3D-printing new organs from human cells.\nWhy do these leaders care so much? It’s not just about health – it’s about power. Both Putin and Xi have made sure they can stay in charge for as long as they want. Putin changed Russia’s constitution so he can stay president till he’s 83. Xi removed China’s “two-term limit,” meaning he could be leader for life.\nSo when Putin said to Xi, “human organs can be continuously transplanted… even achieve immortality,” he might not have been joking. Xi even replied, “This century… humans may live to 150 years old.”\nFor these leaders, living longer isn’t just about celebrating more birthdays – it’s about staying in power forever.\n\n",
        "headline_1": "Age of Power",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/age-of-power/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 05, 2025 00:00:00  \nSoon after assuming office, one of the most pressing issues before the interim government was the alleged irregularities in the power sector -- widely regarded as one the most glaring abused sectors by the Hasina regime. This was an area that clearly demanded a thorough inquiry to identify the nature and scope of the irregularities, the financial implications and those responsible for the malpractice. For years, even under the previous government, the media had reported extensively on controversial deals involving \"quick rental power plants.\" The interim government moved promptly, forming two committees amid widespread allegations of inflated capacity payments, excessive tariffs, and dubious operation and maintenance costs. The committees were tasked with investigating irregularities in power-plant deals and renegotiating what many critics have called \"exorbitant\" tariff rates. The first committee, known as the national committee, was formed in September 2024 under the leadership of a retired High Court judge. It was tasked with reviewing whether government interests were safeguarded in the contracts awarded under the special law. Empowered to collect information from any source and summon individuals or institutions, this committee was expected to set the tone for transparency. The second committee, set up in January 2025 and chaired by a retired BUET professor, was mandated to renegotiate tariff rates. Its stated goal was to lower power-purchase costs and relieve the mounting debt burden of the Bangladesh Power Development Board (BPDB). Yet, nearly a year later, neither committee has submitted its report. Nor have they provided any clear timeframe for completion, raising concerns about transparency in a sector already under fire for inefficiency and waste.\nMost of the contracts under scrutiny were signed under the Quick Enhancement of Electricity and Energy Supply (Special Provision) Act 2010, which was amended in 2021 and annulled in November 2023. The controversial law had allowed the government to award unsolicited contracts to private firms, bypassing competitive bidding, in the name of rapidly expanding power generation.\nWithin months of beginning work, the national committee sought detailed information on 11 major plants, including Adani's 1,496 MW coal-fired Godda plant in India, the Meghnaghat 583 MW dual-fuel plant, and several HSFO- and diesel-fired facilities in Baghabari, Potuakhali, Ashuganj, Manikganj, and Kodda. The list also included renewable projects such as the Mongla (100 MW), Sundarganj (200 MW), Lalmonirhat (30 MW), and Sutiakhali (50 MW) solar plants. The committee even recommended hiring a reputed international legal and investigative firm to assist in reviewing the major contracts. However, this step has yet to materialise, leaving the process in limbo.\nWhat exactly has stalled the committees' work remains unclear. But the delay is troubling, particularly when power plant contracts of the previous government are widely viewed as prime examples of systemic corruption. Until the reports are submitted, the scope for potential savings from contract renegotiations remains uncertain, while the BPDB continues to struggle with ballooning subsidies and debt obligations. In this context, the onus lies squarely on the committees to expedite their tasks. The credibility of the interim government's reform agenda and the possibility of restoring integrity in the power sector depend heavily on the timely completion and making these much-awaited reports public.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Lingering silence  over power-sector  committee findings",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/lingering-silence-over-power-sector-committee-findings-1757002680",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       September 05, 2025 00:00:00  \n\nThe just published flagship Quacquarelli Symonds (QS) World University Rankings 2026 has marked a new dimension to the educational excellence. There is a clear shift in knowledge creation and research in favour of Asia. It must, however, be acknowledged that the established old bastions or powerhouses in the United States of America and the United Kingdom have retained their premier positions in the ranking and a larger number of US higher seats of learning have improved their positions. But it is the largest number of East Asian universities that have gatecrashed not only into the elite club of top 50 but also into the grade between 100 and 500. \nThe island nation Singapore's the National University of Singapore claimed the 8th position, retaining its place in the elite club of 10 for the third year in a row and the Nanyang Technological University follows close by claiming the 12thspot. Percentagewise Chinese institutions have to their credit a 45 per cent rise but the Malaysian higher seats of learning gained a phenomenal ascendancy with 32 of that country making further progress at the rate of 70 per cent improvement -- the highest rate of improvement among countries with 10 or more universities. To its credit, Hong Kong boasts placement of nine universities in the ranking but remarkably with five within the top100world universities -- highest in Asia and second highest globally. South Korea and Australia found their universities slide down the ladder.\nThe transition of indigenous scientific and technological knowledge courtesy of infrastructure development and investment along with collaborative research work towards Asia is quite evident. Interestingly, Asia now leads the pack with 565 ranked universities compared with Europe's 487 and Americas' 358. Africa and Oceania hold 47 and 44 spots respectively. The majority of newcomers are also from Asia with 84 institutions compared to 10 American, nine European, eight African and one Oceanian. In another ranking by the Times Higher Education (THE), 22 Asian universities earned their places among the 50 of the world's best. \nThis latest edition of the QS World University Rankings covers 1,500+ higher seats of learning across 106 locations all across the world. What is particularly significant is that among the ranked institutions, apart from those banded in categories, the US has the highest number with 192, followed by the UK with 90 and mainland China with 72. India surges ahead of Germany with 54 to the latter's 48 to complete the round of top five. However, IIT Delhi tops the list with its 123rd global ranking, overtaking IIT Mumbai ranked 129th. \nIt is exactly at this point, the rankings of the universities in Bangladesh cut a sorry picture. The country's premier higher seat of learning the University of Dhaka (DU) still holds the prime position at 584th global position but has slid 30 notches below last year's 554th position. Other universities including the Bangladesh University of Engineering and Technology (BUET), second to the DU, has been placed in the band of 761-770. The rest stay far behind. Pakistan have two entries higher than the 400 mark with Quaid-e-Azam University earning the 354 spot and the National University of Science and Technology achieving the 371 slot. Even the University of the Punjab and the Lahore University of Management Sciences (LUMS) stay ahead of DU.\nAgain, one Kazakhstan university is ranked as high as 166 and two other claim 317 and 331 slots respectively. What a pleasant surprise that the University of Brunei Darussalam has earned a respectable 367 place. Universities from some Middle East countries and Indonesia have also advanced in their ranking with Saudi Arabia's the King Fahad University of Petroleum and Minerals (KFUPM) claiming the 67th position -- the first Arabian university to earn a place among the top 100 globally. This analysis hardly makes the DU's position enviable, least of those of other universities Bangladesh take pride in. \nThis certainly is a cause for serious concern. Bangladesh imports technologies about a decade's back. Unless it establishes its indigenous research base with many times more investment with collaboration between and among academia, corporate sector and industries, its educational excellence will continue to elude. If the money poured into irrelevant projects and laundered abroad were used for this purpose, it would make a perceptible difference in this area. \nNow the criteria on which the ranking of universities are made may shed light on the backwardness of the Bangladesh universities. The QS rankings use eight clear-cut metrics: 1) academic reputation; 2) employer reputation; 3) citations per faculty; 4) faculty/student ratio; 5) international student ratio; 6) international faculty ratio; 7) sustainability and 8) the newly introduced student diversity (ISD). However, to decide the scores for such metrics, the QS employs lenses and indicators enough to present a representative picture if not a hundred per cent accurate one. \nThe academic reputation is measured through the lens of research and discovery, employability and outcomes, learning experience, global engagement, career placement and career progression and so on. Clearly, universities in Bangladesh lack in all such key criteria and therefore wallow far below not only the leading global universities but even their counterparts in South Asia and the Asian region in general. To make an environment for academic excellence for the public universities in particular, the adversarial student politics and partisan recruitment of teachers have to be done away with forthwith. Adequate investment in research facilities and collaboration with foreign universities will definitely create the right ambience for charting a course towards excellence in higher education.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why universities in Bangladesh have poor global rankings",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-universities-in-bangladesh-have-poor-global-rankings-1757002740",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       September 05, 2025 00:00:00  \n\nThe construction of the metro rail in Dhaka, a city notorious for its chaotic traffic for a long period, was considered one of the milestones in the urban transport system of Bangladesh. The modern mode of commuting brought a sense of pride to Bangladeshis as the metro rail is not just a transport project; it is a symbol of progress and development. However, an imprudent decision of the authorities has surprised many of those who travel on the metro. One fine morning, commuters discovered numerous advertisement stickers pasted inside metro rail coaches, compromising its aesthetic beauty for meagre financial returns.\nLike the metro rail coaches in other cities, the ones in Dhaka have electronic display boards to run digital commercials in a sophisticated and acceptable way. Still, the authorities allowed advertisement stickers on the walls of the coaches. It is a stark contrast between the beauty of the metro rail and the crudeness of tasteless advertisement stickers. This extent of vulgarity may suit rickshaws, not a state-of-the-art transport system. Anyone is supposed to feel frustrated when they realise that over 60 countries currently operate metro rail systems, but none of them, so far as reports suggest, have allowed advertisement stickers inside their trains as a revenue source. This seems to be a uniquely Bangladeshi 'invention', that prioritises short-term earning over long-term preservation of a valuable national resource. Have the 'inventors' considered what will happen when the stickers will need to be taken off to give room for new advertisers? The removal of the adhesive residue from the coaches will result in scratches on the surface. So, a big concern is whether the money being earned from the advertisement stickers justifies the long-term damage. If the net earnings, after accounting for such damage, are small, then the entire exercise will prove to be a poor trade-off. No one can be blamed if they suspect that such an advertisement option was introduced less out of consideration for national interest and more from the narrow interest of certain individuals in the authorities who viewed the metro rail as another means to exploit it commercially.\nThe metro rail advertisement stickers awfully fall in step with the broader culture in Bangladesh where national resources, public infrastructure, or cultural heritage are often spoiled by short-sighted decisions. Instead of considering the metro a symbol of national pride, which is worth protecting and showcasing as an example of modern Bangladesh, it is being reduced just to yet another means of cheaply exploiting commercial interests. The problem also highlights a sorry state in governance and management of public resources. The authorities too often see national resources not as treasures to be preserved but as instruments to earn revenue from, no matter how the spoil the enduring theme and tradition. This is not to mean that using natural resources as earning platforms is always bad. It is bad and unacceptable when their preservation is compromised for wanton earning.\nNow what the authorities need to do is simple. They must remove the stickers and follow a strategy that preserves the metro and its beauty. They do not need to invent anything. What they need is to follow the best practices others are pursuing. There must be a cultural shift in the way we treat our resources. We need to keep in mind that they are not just revenue sources, they are symbols of our identity and pride. Spoiling them for meagre earnings is not just a financial miscalculation; it is a betrayal with the nation's pride.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Metro rail should carry only digital ads",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/metro-rail-should-carry-only-digital-ads-1757002786",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 05, 2025 00:00:00  \n\nAttacks on students are never expected in an educational institution like a university. Recently, a sudden attack on students at the University of Chittagong by local residents has caused a fear psychosis among parents and students regarding campus security. Unfortunately, this is not an isolated incident; students at various universities across the country have also been victims of assaults and injuries.\nEnsuring 24-hour security for students outside the campus is challenging. Therefore, universities should be made fully residential and the entry of outsiders without permission must be strictly controlled. For enhanced safety, it is necessary to increase the number of CCTV cameras and ensure round-the-clock monitoring. At the same time, campuses should provide essential facilities, including food stalls and other services, to reduce students' need to leave campus frequently.\nAbove all, it is time to transform university campuses into safe, student-friendly spaces where learning can thrive without fear.\nUmme Sabaina Sultana\nStudent, Department of Sociology\nUniversity of Rajshahi\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "A safe campus is essential",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/a-safe-campus-is-essential-1757002804",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-09-2025"
    }
]