[
    {
        "full_article": "The call for the removal of the words “secular” and “socialist” from the Preamble to the Constitution of India is no longer a fringe fantasy. With someone as senior and influential as the Rashtriya Swayamsevak Sangh (RSS) General Secretary Dattatreya Hosabale making a public statement in support of the idea, it has now acquired a new urgency and prominence in national politics. The words “secular” and “socialist” were introduced through the 42nd Amendment to the Constitution, during the Emergency under Prime Minister Indira Gandhi in 1976. And the Janata Party government, which included RSS-affiliated leaders, that replaced Indira Gandhi and reversed a lot of the changes made in the Constitution during the Emergency let these words stay. These concepts were so central to the Constitution of the new Republic that its original authors did not think it was even necessary to use these words in the Preamble. When a conflict over India’s national identity began to emerge during the 1970s, Indira Gandhi thought it would be appropriate and also politically rewarding to make these amendments. The Hindutva camp never really opposed these concepts historically. Gandhian Socialism was a part of the core tenets of the Jan Sangh, the earlier avatar of the Bharatiya Janata Party (BJP). Hindutva proponents accused their rivals of following ‘pseudo secularism,’ and by implication, claimed to be genuine secularists.The words “secular” and “socialist” have attained meanings specific to the Indian context over the years. Secularism is not a rejection of Indian civilisational heritage or any religion, but a commitment to equal treatment of all faiths by the state. Indira Gandhi had been viewed as someone pandering to Hindu sentiments. Socialism is not about hostility to private property or enterprise, but a pragmatic appreciation of the fact that the state must take proactive measures to tackle poverty and expand opportunities for the deprived sections of society. The words ‘secularism’ and ‘socialism’ reflect a broad consensus in Indian politics that has held for decades. There is nothing to be achieved by raking up a meaningless debate on these words. Perhaps the debate itself is the objective: to push a divisive agenda without providing any ideological, legal or practical reasoning for this demand. India’s challenge is not about these two words, but its continuing struggle to tackle discrimination, poverty and underdevelopment, which are often influenced by the caste and religious origins of its citizens. The Sangh Parivar, and the BJP, could serve the country better by focusing on these challenges rather than wasting energy on divisive debates on settled semantics.\r Published - July 05, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        constitution\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        poverty\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "​Settled semantics: On the Preamble and divisive debates",
        "headline_2": "Nothing of worth will be gained by removing two words from the Preamble",
        "link": "https://www.thehindu.com/opinion/editorial/settled-semantics-on-the-preamble-and-divisive-debates/article69773039.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-07-2025"
    },
    {
        "full_article": "The eighth anniversary of the Goods and Services Tax (GST) in India, on July 1, coincided with the poorest tax collections the indirect tax system has seen in some time, highlighting the need for structural changes in the system. The latest GST collections stood at ₹1.85 lakh crore in June 2025, the lowest in four months. This amount was just 6.2% higher than the collections in June 2024, the slowest growth rate in four years. Looking past the gross collections, the data show that once refunds are accounted for, the growth in the government’s actual collections was just 3.3%. Further, the revenue from domestic transactions, excluding imports, was an anaemic 4.6% higher than in June last year — barely faster than the average rate of inflation since then. Being a consumption tax, a dip in GST collections reflects a dip in economic activity. But it also reflects inefficiencies in the system, which must now suitably be addressed eight years on. A common demand is for fuel to be included in GST. There is, however, strong resistance to this from State governments, since fuel and alcohol are the few sources of revenue States have with them that are independent of the Centre. However, this cannot be reason enough to perpetually keep these items excluded. It is ‘one nation, one tax’ after all, and it is high time that the goal was achieved in full. As for the revenue hit to States, the Centre must accede to their request for a higher share in central taxes. The Centre must also stop increasingly relying on non-shareable cesses for its revenue. For their part, States must resist the temptation to use this higher amount on election-oriented untargeted freebies. Trust goes two ways.The other popular reform is a reduction in the number of GST rates. This, too, is overdue, and the GST Council’s fitment and rate-setting committees are examining the issue. Connected to this is the question of what is to be done with the GST Compensation Cess, which is levied over and above the 28% slab. It was originally intended to compensate States for any losses arising out of GST implementation for a period of five years. It was then extended until March 2026 to repay the loan taken by the Centre to pay this compensation since the COVID-19 pandemic had disrupted revenues. The Centre should avoid the temptation to subsume this cess into the broader GST rates. Instead, with its job done, the cess must be removed. Taxation is not just a covenant between the Centre and the States. It is also one with the people. Removing a cess that is no longer needed will not only garner public praise but could also spur some sorely needed urban consumption. Published - July 05, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        loans\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        imports",
        "headline_1": "Cease the cess: On the GST and reforms",
        "headline_2": "Low GST collections speak to the need for structural reforms",
        "link": "https://www.thehindu.com/opinion/editorial/cease-the-cess-on-the-gst-and-reforms/article69772997.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-07-2025"
    },
    {
        "full_article": "EC’s revision is more confusing than comforting\nEC’s assurances about the efficiency of its Special Intensive Revision of Bihar’s voter roll aside, the ground reality is that many ordinary voters are confused, more so since state poll commission is in overdrive just months before elections. \nBad timing | The issue’s bigger than opposition concerns. The main problem is the rushed schedule. Not only is monsoon the wrong time for such a revision in the flood-prone state, it is distressing for residents, stressful for poll workers, and inaccuracies can be costly. First booth level officer’s multiple visits to each potential voter’s residence – first to give a pre-filled or empty form then to collect it with or without documents on a case-to-case basis. Second, given Bihar’s patchy documentation, getting hold of documents can be tough. Third, if a potential voter fails to ensure BLO has his/her form and documents, they won’t be included in the new voter roll. Fourth, BLOs must collect, verify, collate, scan ID documents and upload all of it within weeks for an estimated 7cr people. Fifth, having a month for ‘claims & objections’ after the draft roll is published on Aug 1 misses the point. It means voters must make themselves available away from their work in other districts and states, first for BLOs in July, then in Aug if excluded. How many Bihari workers have that luxury?\nFaulty logic | EC has cited rapid urbanisation, migration, and inclusion of undocumented immigrants for springing this on Bihar. The first is unrelated to the emphasis on birth certificates. For the second, residency proof is required to remove inter- and intra-district duplication. What acceptable residency document does a migrant show in his work-town? As for the third, whether the issue can be fixed by Sept 30 (deadline for final voter roll) and is big enough in Bihar to offset the high probability of disenfranchising ordinary voters is debatable.\n\n",
        "headline_1": "Roll muddle",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/roll-muddle/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-07-2025"
    },
    {
        "full_article": "Faiz’s work endures because its core is humanism\n It started like many love stories. An 18-year-old in Sialkot fell in love with a neighbour, most likely an Afghan woman. With no courage to express his feelings, he went on to Lahore for higher study, and she got married. A lecturer of English in Amritsar, haunted by his unfulfilled romance, Marxism drew him in. As a pioneer of the subcontinent’s political poetry, a towering figure in Urdu, winner of Lenin Peace Prize, implicated in a leftist conspiracy to overthrow Pakistan’s Liaquat Ali Khan administration, a supporter of Iran’s Islamic Revolution but not an Islamist and finally restless and self-exiled in Beirut after Zia executed Bhutto — Faiz would go on to say that it was the early two phases that shaped the poet in him, leaving behind a legacy that still gives voice and expression to the voiceless.\nAur bhi dukh hain zamane mein mohabbat ke siva, rahaten aur bhi hain vasl ki rahat ke siva, mujh se pahli si mohabbat mere mehboob na maang (The world has other problems and there are other comforts than a lover’s warm embrace. So, my love, don’t ask I love you like I once did). That’s how Faiz married romance and politics.\nHe became friendly with Mahmud-uz-Zafar and his wife, Rashid Jahan. In 1932, he with four Oxford-educated friends published a collection of short stories and a play in a collection named Angarey (Fire). The stories, mostly feminist, attacked conservatism and talked about equality and freedom. The book was banned immediately, but these stories led to the Progressive Writers Association in India, of which Faiz was an integral part.\nThere was a brief break in his poetic career when he joined the army during the Second World War. A decorated officer, he resigned in 1947 to become the editor of The Pakistan Times, a left-leaning, English-language newspaper. Disillusioned by the communal violence during Partition, on Pakistan’s Independence Day, he wrote, ye daagh daagh ujala ye shab-gazida sahar, vo intizar tha jis ka ye vo sahar to nahin (This light, stained by darkness, is like the dawn tainted by dusk. This is not the dawn we waited for).\nIn 1951, he, along with left-leaning army officers, was arrested for an officially termed ‘leftist conspiracy’ to overthrow the Liaquat Ali Khan govt. From jail, he published two books, Dast-e Saba (The Hand of the Breeze) and Zindan Namah (Prison Chronicles). Faiz refused to give up on hope and from the prison cell, wrote, qafas udaas hai yaaro saba se kuchh to kaho. kahin to bahr-e-ḳhuda aaj zikr-e-yar chale (The cage is sad and silent. Say something to the breeze. For god’s sake, let’s talk about my beloved).\nReleased after four years, his world had changed. Pakistan had signed SEATO and CENTO and moved away from the Soviets, a country he drew inspiration from, and joined America, which he despised. The next few years were relatively peaceful. Bhutto appointed him cultural advisor to the Ministry of Education and at his initiative folk stories and art from different parts of Pakistan were documented.\nIn 1974, he accompanied Bhutto to Bangladesh and on the request of Sheikh Mujibur Rahman composed, Ham ki thahre ajnabi itni mudaraton ke baad. phir banenge ashna kitni mulaqaton ke baad (Despite the hospitality, we remain strangers, and who knows how many meetings it will take to become friends again).\nBut the peace was short-lived as Zia arrested Bhutto, and Faiz self-exiled to Beirut to become the editor of Lotus – a magazine established to promote non-Eurocentric Asian and African writing. The Magazine’s Beirut office was inaugurated by Yasser Arafat. His friends have noted that he felt estranged and uprooted and longed for his people. The result was, Mere dil, mere musafir, hua phir se hukm sadir, ki vatan-badar hon hum tum (My heart, my traveller, the order is issued again and we are exiled again).\nHis most enduring work Hum Dekhenge is, at its core, a poem of dissent. If some critique it as anti-Hinduism, it is anti-Islam as well.  Hum Dekhenge was published in the book Mere Dil Mere Musafir and was inspired by the Islamic revolution in Iran, which Faiz supported. Experts are divided about the message of the poem. The theme is inspired from the Quran’s Surah al-Waqi’ah – the inevitability of Qayamat (doomsday), when the earth will tremble and the mountains will shake, and in the poem’s climax, the literal translation would state that idols are removed from the Kaaba to establish the rule of Allah.\nBut it’s been argued that these lines can also mean ‘When every idol – false gods and tyrants – will be removed from the house of God, which is earth.’ His support for Iran’s Islamic revolution didn’t make Faiz an Islamist – he was charmed by the people’s power to fight the army and depose the Shah.  \nIn the climax of the poem he says, Utthega anal haq ka nara, jo mai bhi hu or tum bhi ho. Bus raj karegi khalke khuda jo mai bhi hu or tum bhi ho. Anal- Haq means ‘I am the truth’ and Faiz imagines that this slogan will be raised by everyone. In Semitic religions like Islam, Judaism, and Christianity, there’s a strict duality between God and creation – God is separate and transcendent. In contrast, the Sufi anal haq resonates with the Advaita concept of Aham Brahmasmi or “I am one with God”. By this interpretation, the message of this poem is that human beings themselves are the ultimate truth – divinity is within humanity and hence the divine right to self-rule.\n\n",
        "headline_1": "Poetry & politics, in love & war",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/poetry-politics-in-love-war/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-07-2025"
    },
    {
        "full_article": "Tibetans in India need better state support \nBy backing Dalai Lama’s position on succession, Union minister Kiren Rijiju has rightly countered China’s position that only Beijing can approve the choice of the next Tibetan spiritual leader. Dalai Lama, and thousands of Tibetans, chose India as their refuge when China captured Tibet in 1950s. Since then, Tibetans in India have lived as a model community. Spread across 39 formal settlements and dozens of informal colonies throughout India, Tibetans have added richness to our social milieu with their cuisine, medicine, culture and spirituality. \nA lot of this is because of Dalai Lama himself. He has repeatedly expressed his gratitude to India for providing shelter to Tibetans. Contrast this with China where Tibetan culture is being slowly Sinicised, and Tibetan Buddhism is practised under strict supervision of Chinese Communist Party minders. It is in India that Tibetans have been able to freely practise their religion. \nIndia has a great track record in sheltering refugees – taking in millions during Bangladesh’s 1971 Liberation War – and successive Indian govts have done a lot for Tibetan refugees. But several everyday issues remain. Tibetans face restrictions in terms of travel, can’t buy property in India, most can’t access bank credit, and have very limited access to higher education and healthcare. Their stateless status can be ameliorated through practical provisions on the ground. Seventy years of their peaceful existence in India shows migrants can add value to society. Tibetans deserve our continued support. \n\n",
        "headline_1": "Model community",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/model-community/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-07-2025"
    },
    {
        "full_article": "Maharashtra has seen several political realignments over the last decade. And these are being continually reorganised, as BJP consolidates its dominance in this state. The rise of nationalist Hinduism under BJP, and the making of Hinduism as a civil religion, has led to splits in NCP and Shiv Sena. Meanwhile, INC has seen key leaders desert it, as its presence has dwindled in Vidhan Sabha. Politics is still bipolar, except BJP is now a key force with multiple but scattered opponents.\nRead full story on TOI+\n\n",
        "headline_1": "Can the cousins roar again?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/can-the-cousins-roar-again/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 05, 2025 00:00:00  \nWith increasing popularity of bottled water, their prices are also on the rise apparently without rhyme or reason. So, question naturally arises if there is any regulatory control over the country's ever-growing bottled water market. Then there is no way of ensuring if water bottled under various brand names is safe for public health. According to reports, an investigation conducted last year by the Bangladesh Competition Commission (BCC) revealed that some of the leading bottled water companies have been reaping windfall profits of as high as 420 per cent simply by raising the prices of their half-a-litre bottles. It also unveiled that the bottled water companies thus engaged in fleecing the consumers violated section 15 (1), 15 (2) (a) and 15 (2) (b) respectively of the Competition Act, 2012, as they colluded with each other to set water price unreasonably high rather than on the basis of a competitive market to adjust price. So, their argument of increased production costs due to higher dollar price in Taka to justify their water price hike was untenable. In this connection, a lawsuit was lodged against seven such leading bottled water manufacturers. \nThe Commission's investigation report, 'Abnormal Price Increases of Bottled Water' revealed that between January and September 2023, the companies so investigated raised the prices of 500 ml bottles from Tk15 to Tk20. But the facts, as found by the Commission report, were that though the import costs had risen slightly, the companies including their distributors and retailers gained huge profit margins between 71.23 per cent and 420 per cent. The wholesalers and retailers were also given fat commissions as incentives. The retailers, it could be learnt, were getting commissions of Tk5.0 to Tk9.0 per half-a-Litre bottle. Clearly, the bottled water companies have been raking in money unethically in absence of strict monitoring of the bottled water market. The Commission probe also included Dhaka Water Supply and Sewage Authority (WASA) which markets its own brand of water. It is a contradiction that a non-profit government body responsible for supplying utilities to the citizens is marketing bottled water on a profit basis. However, it faced no lawsuit. \nBut instead of falling, the prices of bottled water are still on a rising curve. Clearly, the previous actions taken by the government could not bring any positive change in pricing of bottled water. Now a report published in the July 5 issue of this paper says that the government is thinking of rationalising the prices of bottled drinking water. To this end, the Ministry of Commerce (MoC) has reportedly asked the Bangladesh Trade and Tariff Commission (BTTC) to come up with a report recommending ways to bring down prices of bottled water within the reach of the common consumers. The companies in question have not yet mended their ways, so administration has to make them comply with the legal requirements. \nLet the government's latest move to rationalise prices of bottled water prove successful. But alongside price control measures, quality and safety of such drinking water must be ensured. The popular 30-some brands, owned both by local corporate and multinational houses should be brought under closer scrutiny to determine if they maintain required safety standards set by the Bangladesh Standards and Testing Institution (BSTI). Under any circumstances, health safety issues of bottled water cannot be compromised.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bottled water: Price high, quality suspect",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bottled-water-price-high-quality-suspect-1751643674",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       July 05, 2025 00:00:00  \n\nThe victory of 33-year-old Zohran Mamdani in the Democratic Party primary for the 2025 New York City mayoral election has sent shockwaves through the American political establishment. He was up against a wall of prejudice due to his faith, skin colour and opposition to the slaughter of Palestinians. His socialist platform also ran counter to mainstream political orthodoxy. Yet, he prevailed because his bold proposals to tackle the city's affordability crisis struck a chord with voters. Chief among them was his promise to freeze rents for millions of rent-regulated tenants, a policy that earned him widespread support across New York. A candidate with Mamdani's background would not have won unless he could energise the electorate, and he could not have energised them unless he directly addressed in his speech their struggles.\nThe quick rise in rents was a rallying point for New Yorkers who supported Mamdani, and it is also a big problem for people in Dhaka. Like New York, the city is in the grip of an affordability crisis. When we were growing up in Dhaka a few decades ago, the rent was high. Today it has reached a crisis point. It has gotten to a situation where many middle-class families now allocate over half their income to rent, leaving little for groceries, childcare or education. In an ideal world, owning a home or flat should be within the means of people in their twenties and thirties, because it is a stage of life when they begin raising families. But the reality is that homeownership would be nothing more than a pipe dream for the lot of them unless they are employed in high-paying white-collar jobs, as even renting would put a strain on their budget. \nRising cost of simply sleeping under a proper roof in the city is particularly punishing for honest government employees. These employees often work in transferable positions, and many are posted to Dhaka every few years. But with salaries that for most are their only source of income, maintaining a decent standard of living after paying rent is extremely difficult. Many are forced to live apart from their families as a result. The same holds true for private-sector employees and members of the working class. They have little choice but to migrate to Dhaka for work, as their hometowns offer limited economic opportunities. While Dhaka may offer low-paying jobs to them, it denies them an affordable shelter. \nFor those struggling to make ends meet, this is deeply frustrating. It is not even just about having too little in the wallet. When a man does not have money, his own family do not like him and lose respect for him. This can lead to distrust between him and his children, his wife or whoever he lives with. That creates a ripple effect that can slowly tear a family apart. Simply put, if a man cannot provide for his family, he will often find himself alienated, mistrusted, or worse, shouldering the blame for every hardship. \nMeanwhile, a significant portion of property owners including retired or serving government officials, businessmen or politically connected elites operate with near-total impunity. These property owners are widely perceived to have acquired their wealth through questionable means. Their primary motivation often appears to be the accumulation of rental income, with little regard for the financial hardships faced by their tenants. Tax evasion among them is rampant. Many of their properties are conveniently left out of tax filings as owners are unable to account for the source of their investment. Even when declared, properties are often undervalued and rental income is frequently understated so they can dodge paying their fair share. When these landlords increase rent, tenants rarely object for fear of reprisal or bureaucratic red tape. The House Rent Control Act of 1991 which is the legal framework meant to protect them is obsolete. Its ridiculously unrealistic requirement that annual rent be limited to 15 per cent of a property's market worth would bankrupt a lot of tenants if it were implemented. With this law in place, few people dare to take property owners to court, allowing landlords to dictate terms without challenge. \nHousing is widely acknowledged as a basic human right. The Constitution of Bangladesh in Article 15 recognises the right to housing as one of the fundamental responsibilities of the state. Although in practice housing remains a privilege for a few, even an average working-class individual with monthly incomes between Tk 12,000 and Tk 20,000 possesses an inherent right to adequate housing. The government bears a significant responsibility to devise effective strategies for ensuring it.\nOne such strategy that the government could adopt involves investment in public housing units. This way, government can rent flats to individuals across diverse income brackets at affordable rates. Another strategy is decentralising population concentration from Dhaka's congested core. The concentration of employment opportunities and public institutions in Dhaka fuels housing demand beyond the city's carrying capacity. Major infrastructure projects such as the satellite towns being developed around the capital should be fast-tracked, and key government offices relocated to these new hubs. Efficient rail or rapid transit connections to Dhaka would ensure that people can commute without being forced to relocate their entire lives to the capital. The government can also borrow a page from Mamdani's playbook and explore legally binding rent freezes for designated areas, especially where demand outstrips supply. Such a policy can offer immediate relief to millions of renters and potentially help control inflation by stabilising a significant component of household expenditure. The idea is not to vilify property owners but to restore balance in a deeply unequal housing market.\nMamdani's rise in New York proves that people are looking for bold solutions to their most pressing struggles. The majority of Dhaka's 15 million residents, silently enduring the burden of ever-increasing rent and housing costs, are also waiting for relief. It is time for the government to take greater responsibility for it and act.\nshoeb434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The unbearable cost  of living in Dhaka",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-unbearable-cost-of-living-in-dhaka-1751643743",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       July 05, 2025 00:00:00  \n\nIn Bangladesh, numerous sites hold significant religious, cultural, and historical importance and have endured for many centuries. Nevertheless, many historical structures that are symbols of the nation's rich heritage no longer exist, and many of the existing sites or structures are also not well-preserved. The failure to acknowledge and celebrate their own culture and heritage has disconnected people, particularly the younger generations, from the country. Moreover, the authorities are facing multiple challenges in restoring and preserving the antiquities due to a lack of adequate budget, the absence of necessary support from relevant quarters, and a lack of awareness among the people. \nThe Department of Archaeology, a key entity under the Ministry of Culture, is responsible for preserving Bangladesh's antiquities and archaeological sites. Currently, the department oversees 536 protected and listed antiquities and archaeological sites, including two UNESCO World Heritage sites: the Ruins of the Buddhist Vihara at Paharpur and the Historic Mosque City of Bagerhat. These sites, recognised as cultural heritage, were inscribed in the UNESCO list in 1985. The Sundarbans, the third site of Bangladesh on the UNESCO list, is recognised as a natural heritage and inscribed in 1997. The Sundarbans is managed by the Bangladesh Forest Department (BFD) under the Ministry of Environment, Forest and Climate Change. \nDespite being a part of the World Heritage, the preservation of the Shat Gambuj Mosque (also known as the Sixty Dome Mosque or Shait Gambuj Masjid) in Bagerhat is now in danger due to both natural and man-made factors. Last week, the Department of Archaeology organised a public meeting in Bagherhat in an effort to raise awareness among the people about the importance of preserving the historic structure, as well as the entire heritage site, which includes other ancient mosques and structures. The UNESCO website describes the heritage as: \"Situated in the suburbs of Bagerhat, at the meeting-point of the Ganges and Brahmaputra rivers, this ancient city, formerly known as Khalifatabad, was founded by the Turkish general Ulugh Khan Jahan in the 15th century. The city's infrastructure reveals considerable technical skill and an exceptional number of mosques and early Islamic monuments, many built of brick, can be seen there.\"\nShait Gambuj Mosque is the most iconic heritage structure of Bagerhat and draws thousands of tourists throughout the year. The construction of the mosque was started approximately in 1442, and it was completed in 1459. Ulugh Khan, popularly known as Khan Jahan Ali, was a Muslim saint and preacher also, and it is widely believed that the masque was constructed under his supervision. The historical mosque has survived for around six centuries, facing numerous natural disasters. \nBesides the natural hits like salinity and fungal attacks on the walls and floors of the mosque, the frequent movements of heavy vehicles on the adjoined Barishal-Bagerhat-Khulna regional highway become a threat to the stability of the mosque. Vibration generated from the movement of buses and trucks has already started to erode the durability of the structure. It is noteworthy that when the regional highway was developed, the authorities did not consider the potential risk to the heritage site. The Roads and Highways Department, under the Ministry of Transport and Communication, did not feel any need to maintain contact with the Department of Archaeology. \nAgain, various structures, such as hotels, restaurants, and footbridges, are constructed around the heritage site, violating the archaeological and heritage preservation acts. In the meeting, officials from the archaeology department alleged that a tendency has also been evident to overlook the core zone and buffer zone of the world heritage site. The influx of tourists and the irresponsible behaviour of some of them also pose a threat to the heritage structure. In some cases, local vendors also create a nuisance near the site. Again, the problems are not unique to the Shait Gambuj Mosque. Most of the archaeological sites and structures across the country face common challenges. In some cases, land grabbers, drug peddlers and local criminals try to make their hideout in these sites. The indifferent attitude of law enforcement agencies exacerbates the situation. So, a collective effort is a must to preserve and protect all these historical sites and structures. It is a collective responsibility of the citizens to acknowledge and celebrate home-grown culture and heritage and ensure their preservation for the future generation.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Conserving heritage, historical sites",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/conserving-heritage-historical-sites-1751643797",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 05, 2025 00:00:00  \n\nBangladesh remains one of the few nations where fatherhood is yet to be recognised by the labour law. Despite longstanding discussions, the issue continues to be overlooked, both legally and socially.\nPaternity leave is not just a break from work-it is an opportunity for fathers to provide emotional and physical support during a critical period of family bonding and child development. Numerous studies, including a 2019 international report, reveal that a father's early involvement significantly improves a child's language and social skills. Yet, Bangladeshi fathers are denied even a single day of mandatory leave.\nThe absence of paternity leave stems from several barriers: a clear legal vacuum in labour law, entrenched gender stereotypes that see men solely as breadwinners, economic concerns-particularly for small businesses-and, most notably, a lack of political will. Although the High Court directed the formulation of a paternity leave policy in 2024, implementation has been sluggish.\nGlobal examples show the transformative effects of paternity leave. Norway offers fathers up to 150 days of leave; even India introduced 15 days of leave for government employees in 2023. These progressive steps promote shared parenting, boost women's employment, and reduce workplace stress.\nThe time has come for Bangladesh to adopt a similar stance. Paternity leave must be recognised in our labour laws and enforced across both public and private sectors. Awareness campaigns, educational programmes, and advocacy by labour rights organisations and commissions like the Women and Children's Affairs Commission are essential for cultural and institutional changes.\nLet us not treat paternity leave as a luxury. It is a necessity for building a more compassionate, equal, and family-friendly society. Bangladesh must act now to acknowledge fathers' roles both at home and in the nation's future.\nSurja Mandal\nLL.B. Student\nDepartment of Law\nWorld University of Bangladesh\nsurjamandal032@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why no paternity leave in Bangladesh?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-no-paternity-leave-in-bangladesh-1751643821",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-07-2025"
    }
]