[
    {
        "full_article": "The credibility of an electoral system, or democracy in general, is dependent solely on it being seen as fair by all, particularly so by the loser. This is comparable to a judicial dispute or a sporting event on this count. If the losers think they lost only because the process was rigged against them, a crisis of trust develops. The serious charges being raised against the Election Commission of India (ECI) by the Leader of the Opposition in the Lok Sabha, Rahul Gandhi, has to be seen in this context. He says that he has plans to disclose more information regarding discrepancies in the 2024 general election. One must wait for the details of those allegations before making any comments on their merits. The ECI has come under attack by politicians earlier too. Narendra Modi, when he was the Chief Minister of Gujarat, had repeatedly questioned the impartiality of the ECI. Many of these charges against the ECI are rhetorical attempts by political parties or leaders to animate supporters. In Bihar, the Leader of Opposition in the State Assembly, Tejashwi Yadav, has alleged his name did not exist on the draft electoral roll which is being revised by the ECI. As it turns out the Elector’s Photo Identity Card (EPIC) number that he thought was his is different from the one in the ECI records, raising a new controversy. Politicians should be raising questions about the electoral process only when there are strong grounds for doing so. Trust in the electoral system is foundational to representative democracy.That said, the ECI’s recent statements and actions, far from buttressing public trust and enhancing transparency in the process, raise more questions. Its efficiency and its neutrality are on test in the preparation of rolls, scheduling of elections, enforcement of the code of conduct, counting process, and the redress of complaints. The ECI stands charged on each of these counts. Other than protesting that the electronic voting machines (EVM) are beyond tampering, and that political parties should raise objections regarding rolls at the appropriate time, the ECI has refused to come clean on multiple issues. It has not been transparent about the Voter Verifiable Paper Audit Trail (VVPAT) machine which is one of the three parts that make an Electronic Voting Machine. Unlike the other two parts — the Ballot Unit and the Control Unit — the VVPAT has software that is centrally installed and it is connected to the control unit. The random tallying of the VVPAT with the electronically cast votes is now an extremely arbitrary process. All political parties do not have the equal capacity to monitor the various stages of the electoral process. At any rate, the election process is not a matter of negotiation between parties and the ECI. Political parties have a role to play, but the real question is to ensure that the citizenry at large is reassured of the integrity of the electoral process. The ECI needs to correct its course to ensure that.\r Published - August 05, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        election\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        Lok Sabha\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Gujarat\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        Narendra Modi",
        "headline_1": "​A crisis of trust: On the Election Commission of India",
        "headline_2": "The Election Commission of India must be more transparent and impartial in its actions",
        "link": "https://www.thehindu.com/opinion/editorial/a-crisis-of-trust-on-the-election-commission-of-india/article69893682.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-08-2025"
    },
    {
        "full_article": "India’s long cricketing tour of England concluded in a gripping stalemate. A 2-2 verdict, following Shubman Gill’s men snatching a six-run triumph against the host at the Oval on Monday (August 4, 2025), was an apt reflection of a well-contested Test series that featured five matches. Australia has been conquered a few times in its backyard, but for India, England at home remains a tough opponent. Only thrice has India seized a Test series under the whimsical English skies, with the last series victory coming in 2007. The odds were stacked high too as this was a visiting unit that had lost Rohit Sharma, Virat Kohli and R. Ashwin to retirements. Gill’s men, however, fought hard. In an age in which there are whispers about implementing four-day Tests, this series was a reflection of all that is good with cricket’s traditional format as every contest spilled onto the fifth day. England’s Bazball style did upset India’s best laid plans at times and yet the bowlers found ways to strike back. England was led well by the rousing manner of all-rounder Ben Stokes till he skipped the last Test due to injury. And in Joe Root, England has a batter for the ages, and if he stays fit, Sachin Tendulkar’s record Test aggregate of 15,921 runs may not remain immune.In the distant past, a tour of England featured additional warm-up games against the Counties. The length of the tour helped players rest and regain form. Modern-day players have no such luxuries as a cramped year-long schedule that packs in T20s such as the Indian Premier League, means that every overseas trip becomes a rushed affair. That Jasprit Bumrah could only play three Tests and even Stokes had to skip one at the end, is a reflection of how cricketers have no time to pause and remain injury prone. Seen in that light, Mohammed Siraj turning out for five Tests and bowling with verve and skill, is a huge testament of his fitness. India has much to cherish as Gill amassed 754 runs, and K.L. Rahul and Yashasvi Jaiswal excelled with the bat. Meanwhile, Ravindra Jadeja and Washington Sundar offered depth in the batting order, even if the tail below wilted. The injury to Rishabh Pant was unfortunate but he is bound to return in a while. India missed Mohammed Shami and much hinged on the fiery Siraj, who with 23 wickets, stepped up even as his fellow seamers lost their radar at times. A team in transition is bound to have teething issues. However, through their rugged fight, these players offer hope for better days ahead. Published - August 05, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        cricket\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        Test  cricket\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        Twenty20\n                    \n                            /                      \n                        \n                        Indian Premier League",
        "headline_1": "​Fascinating finale: On India’s cricketing tour of England",
        "headline_2": "Neither India nor England deserved to lose this hard-fought series",
        "link": "https://www.thehindu.com/opinion/editorial/fascinating-finale-on-indias-cricketing-tour-of-england/article69893705.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-08-2025"
    },
    {
        "full_article": "Mansplaining Donald Duck is my superpower\nNobody is focusing on fiscal fitness, I said to Kamala as we walked briskly round our neighbourhood park. She narrowed her eyes as she realised I was talking about money, then confessed she didn’t understand money.\nMost Indians know how to make money and hoard money but are clueless about the Budget or things like American tariffs and what impact these have on our daily lives. Our basic fear is that everyone, including banks, netas, the markets and every person who calls on the phone, is trying to loot our hard-earned money.\nI puffed my chest out to mansplain money matters: Imagine if you had a friend – a very rich, important, delusional friend – who runs a chain of veggie shops. Imagine if you grew tomatoes in your farm and you wanted him to buy these tomatoes and sell them on…\nI could see I was losing Clueless Kamala so I tried to make it even simpler: If this close friend, based on his friendship alone, was charging you 25% more to sell your tomatoes in his shop, it would make tomatoes costlier in his shop while creating a glut of tomatoes in your farm.\nKamala looked confused but I continued: Imagine if this friend saw you buying Kerosene from Puttaniah and levied a penalty because he didn’t like that. Plus, this friend tells everyone that he also stopped the fight we had last weekend and that we would be divorced by now if not for him.\nShe perked up: ‘Were we fighting with our neighbor Pakkath Mane Parvathi because her sons keep lobbing balls into our compound and creating destruction every time they jump over the compound wall? But we are still playing cricket with them.’\nKamala was finally getting the hang of international affairs.  I had made the whole thing as logical as The Kerala Story getting the national award. She sat down on the bench and gave me a withering look: ‘This friend of yours sounds like a bully. I don’t think he is anyone’s friend.’\nI hummed an old Shammi Kapoor song: Tariff karoon kya uski jisne usse banaya. I told her he was a self-made man so we couldn’t blame God or Nehru for this situation. Donald Duck used to be a harmless cartoon without pants when we were growing up. He still is – but the world is not laughing anymore.\n\n",
        "headline_1": "Fiscal fitness",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/fiscal-fitness/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-08-2025"
    },
    {
        "full_article": "In Russia, the government has been trying to control what people see and do on the internet for many years. They block websites, spy on users, slow down pages they don’t like, and ban social media that criticizes the government.\nNow, a new law starting September 1 makes things even scarier. For the first time, people in Russia can get into trouble just for searching for certain things online. They can even be fined for using VPNs — tools that help people access blocked websites. That’s like being punished just for reading something the government doesn’t like.\nThe rule says people will be held responsible if they “knowingly” look up or open “extremist” material — but the law doesn’t clearly say what that means. And there are over 500 pages of things the government calls “extremist,” including websites and groups linked to Alexei Navalny, a well-known critic of President Putin who died earlier this year.\nThere are three big problems with this law:\n\nToo many things are called “extremist.” It includes people and groups that just disagreed with the government.\nNo one knows how the government will watch what people search. Will internet companies spy on everyone? What about students or reporters doing research?\nThe law is confusing on purpose. It makes people scared. Many Russians are already deleting apps and leaving certain online groups, even if they’re not doing anything wrong — just to be safe.\n\nExperts say this isn’t really about protecting the country’s internet. Russia doesn’t even have the tech or money to control it like China does. Instead, this is more about stopping people from speaking out or organizing against the government.\n\n",
        "headline_1": "Control All & Delete: Russia’s New Internet Rule Is Scary",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/control-all-delete-russias-new-internet-rule-is-scary/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-08-2025"
    },
    {
        "full_article": "Kremlin’s new law restricting online search is a chilling new low \nFor at least 15 years, Moscow has tightened controls on the internet using centralised routing, deep surveillance, bans on websites and social media, throttling websites critical of Moscow and so on. Its latest restriction – in a new law expected to kick in Sep 1 – hits a new low, the most chilling of all. For the first time, internet users will be penalised simply for search queries govt deems are ‘extremist’. And fined for using VPNs that help users bypass censorship. That’s practically making reading an offence. The new law says users will be held accountable for “knowingly searching for and accessing extremist materials”, including through VPN services. Moscow’s digital development minister reportedly said “ordinary users will not be affected” by the new law. How that will be possible is unknown – analysts have called it a vaguely worded legislation.\nThree points. First, justice ministry’s list of ‘extremist’ materials stretches to more than 500 pages. Those banned in Russia for ‘extremist activities’ include entities associated with Kremlin critic and opposition politician, late Alexei Navalny. So, Putin’s playing strictly by the Chinese playbook. Second, how this’ll be monitored is unclear – will internet providers be expected to pass on browsing data and searches or will govt surveil? How will ‘systems’ differentiate those searching material for purposes of research? Third, the obscure language serves a purpose. The outcome is already as desired – creation of fear and self-censorship. Russians, reports say, are already unsubscribing from certain channels and deleting apps. Uncertainty the loosely worded law has unleashed has little to do with Moscow’s claim of digital sovereignty – unlike China, it barely has the wherewithal in terms of funds, engineers or infra to do so – and everything to do with a crackdown on both Russian public and any attempts at political opposition.\n\n",
        "headline_1": "Control All & Delete",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/control-all-delete/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-08-2025"
    },
    {
        "full_article": "Trump’s sacking of a govt data official sends an awful message that all democracies must heed\nConvention demands that emperors don’t shoot messengers, but Trump sacked Erika McEntarfer on Friday after her Bureau of Labour Statistics (BLS) revised US jobs data for May and June downwards. Those were the first full months to reflect the impact of Trump’s 10% baseline tariff. Initially, BLS had reported 144,000 new jobs in May, and 147,000 in June, suggesting that fears about the impact of tariffs were overblown. Now, it says only 19,000 and 14,000 jobs, respectively, were added in the two months. Initial data for July looks even weaker, with only 73,000 jobs added. Post-revision, it might turn out to be a month of net job loss.\nSuddenly, Trump’s tariff project is looking weak when high country-specific tariffs are about to take effect from Thursday. He’s reacted predictably, alleging data was manipulated: “In my opinion, today’s jobs numbers were RIGGED in order to make the Republicans, and ME, look bad.” But as former US treasury secretary Larry Summers says, the charge is preposterous because the data is compiled by “hundreds of people following detailed procedures”. The job numbers are off the mark every month simply because a third of the 121,000 employers BLS surveys don’t send their responses on time.\nTrump could have asked for better data gathering. It’s a fair demand, given that investors and the Fed, with which he has a running feud, base their decisions on such indicators. But Trump’s cost-cutting – remember Elon Musk’s Doge? – is among the culprits here. His personal attacks on officials and sackings will only weaken global confidence in US. If he manages to “control” data somehow, he will push US into the league of dictatorships that are known to fudge economic data all the time. In 2018, University of Chicago researcher Luis Martinez made an interesting observation using satellite images: a 10% increase in nighttime lights was correlated with a 2.4% GDP increase in democracies, but 2.9-3.4% increase in authoritarian countries.\nIndia passed Martinez’s test well, but our data framework isn’t strong either. The delayed Census is a blemish, and even after improvements, getting a final estimate of GDP growth takes two years. There are questions about the accuracy of PLFS data also. To improve policy formation, and to attract more investment, we must improve our data collection and reporting. And if the data is sour, spare the messenger.\n\n",
        "headline_1": "Stat Of The Nation",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/stat-of-the-nation/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 05, 2025 00:00:00  \nA nation that won independence in 1971 waging a nine-month long bloody war against an occupation army, celebrates the first anniversary of another landmark event called the July mass uprising today (Tuesday). Bangladesh has witnessed many ups and downs since its emergence, but the July uprising, because of its scale and sacrifices made, is considered an unparalleled one. Students and people from all walks of life forced one of the worst authoritarian regimes of the country to fall and its head, Sheikh Hasina, flee to neighbouring India on August 05 last year.\nIn fact, July mass uprising was the explosion of a series of events marking political, social and economic discontent. These were suppressed by the Hasina regime in most cases brutally terming it anti-liberation conspiracy. Though she came to power in 2009, thanks to popular vote, in the years that followed she grossly undermined the democratic process by making national elections a mockery. She resorted to election engineering to ensure majority seats for her party, Bangladesh Awami League (BAL), in the parliament to stay in power forever. Manipulating the judiciary, her government nullified the constitutional obligation to hold national election under the caretaker government. Bangladesh Nationalist Party (BNP), the main opposition party, faced relentless persecution. Hasina government introduced repressive acts and increased surveillance on the people thereby curbing freedom of speech and marginalising the media. \nThough the country witnessed a robust economic growth in the 15 years of Hasina regime, it was unable to attract a significant amount of foreign direct investment (FDI) and diversify export. Over-ambitious mega infrastructure projects became a way of misappropriating pubhlic funds by party loyalists and powerful quarters. The much-hyped development narrative was hollow and unattainable. The Hasina-run administration was basically a kleptocracy, a form of government by individuals who primarily seek personal gain at the expense of those they govern. The tyrant also politicised almost all national institutions and rendered those dysfunctional. She got unconditional support from India and used it to perpetuate her hold on power. Hasina also allowed her party's student wing, Bangladesh Chhatra League (BCL), which has been banned recently, to unleash a reign of terror in all the educational institutions of the country. Torture, intimidation, physical assault and killing by the BCL leaders and activists became a common practice under the shelter of law-enforcing agencies. It was designed to suppress any protest or movement by the ordinary students and youths. \nNevertheless, it is the students and youths who dared to challenge the authoritarian regime. The movement demanding reforms of discriminatory quota system in public jobs in 2013 and 2018 had unnerved the Hasina regime. The law enforcing agencies and the goons of BCL descended on the street protestors with brute force. Also, in 2018, students held street demonstrations demanding road safety across the country which was also brutally suppressed. But the flame of rebellion was alive and street violence erupted again in the form of protest against the resumption of the discriminatory quota system in the public service. Soon the street demonstrations turned into a mass movement demanding that Hasina must step down. Her brutal repressive steps to crush the movement led to the deaths of at least 1,400 people and injuries to more than 20,000 during the final days of July-August. \nThus, Bangladesh witnessed a new morning stained with blood, tears and horrors, but with new hopes for a better future and a society that will be inclusive and free from injustice and discrimination. As the country celebrates the first anniversary of the mass uprising, its key message must be remembered and the spirit must be upheld by all. Now is the time to work together and carry out reforms of key national institutions and begin the onward journey for democracy and a just society.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Upholding the spirit of July uprising",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/upholding-the-spirit-of-july-uprising-1754328141",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       August 05, 2025 00:00:00  \n\nAs Bangladesh moves steadily toward its 13th national parliamentary election, the urgency to ensure a peaceful and orderly electoral environment has never been more pronounced. In any democratic setup, law and order constitute the bedrock upon which fair and free elections are built. Citizens must be able to exercise their franchise without fear, obstruction, or coercion. For a nation that has long grappled with political unrest and questions over the credibility of its electoral process, it is imperative to restore public confidence through robust law enforcement.\nIn recent weeks, there has been growing anticipation over the announcement of the election schedule. Now, an announcement to this effect is expected to take place in early August. Yet, even before the dates are officially confirmed, the conversation has shifted to a more fundamental concern -- whether the nation's law enforcement apparatus is adequately prepared, both morally and operationally, to manage a volatile political climate surrounding the polls.\nThis concern is not without merit. The July mass uprising, which shook the foundations of the previous regime, left the country's police force with a deep institutional scar. Allegations of partisanship, suppression of dissent, and the use of force against civilians during previous political crises have tarnished public trust in law enforcement. As a result, restoring the moral credibility and operational discipline of the police force has become a central task for the interim administration.\nAgainst this backdrop, the recent high-level law and order meeting chaired by Chief Adviser Dr. Muhammad Yunus was of crucial importance. Attended by top brass from various law enforcement and intelligence agencies, the meeting marked a turning point in Bangladesh's election preparation narrative. Several critical decisions were taken, with the potential to decisively influence the security landscape ahead of the polls.\nOne of the most significant steps announced was the special training programme for around 150,000 police personnel, to be conducted between September and November. This training will specifically address election-related duties, crowd management, protection of polling centres, and emergency response protocols. The goal is to depoliticise and professionalize the force -- arming officers not just with batons and shields, but with a democratic understanding of their roles.\nIn addition, a formidable deployment of approximately 60,000 army personnel is planned during the election period. These troops will function as striking forces, standing by to act swiftly in any area where law and order might deteriorate. Historically, the presence of the military has acted as a deterrent against electoral violence and ballot manipulation. However, the key lies in ensuring that such deployments remain neutral and disciplined, avoiding any perception of interference.\nThe decision to form a National Information Centre also deserves appreciation. In today's digital age, misinformation spreads faster than bullets. Rumours -- whether about rigging, violence, or false announcements -- can provoke unrest within minutes. A centralized information unit that can monitor, verify, and counteract false narratives in real time will be essential in preserving a calm and informed electorate.\nAnother important component of the preparation is the upcoming administrative reshuffle. In a polarised political environment, the neutrality of administrative officials -- from Deputy Commissioners to Upazila Nirbahi Officers -- can influence perceptions of electoral fairness. A strategic yet impartial reshuffling could be pivotal in restoring faith in the process.\nWhile these measures inspire hope, they are not immune to scepticism. Many observers have raised legitimate concerns about whether the upcoming election can truly be conducted in a free and fair manner, especially given the long shadow of previous flawed polls. The presence of conspirators, both internal and external, might try, to destabilise the electoral environment. Such a possibility cannot be ruled out. However, it is encouraging to note that the interim government is seemingly aware of these threats and is working proactively to neutralise them.\nIt is worth remembering that Bangladesh has not witnessed a truly fair national election in many years. That democratic void was a central grievance behind the July uprising. The people rose not only against corruption and autocracy, but also for the restoration of their voting rights. Therefore, the stakes for this election are not merely political -- they are existential for the nation's democratic future.\nThe roadmap ahead includes a government formed through elections that must undertake systemic reforms to strengthen democratic institutions. Only by reinforcing these foundations the country can stop the re-emergence of autocracy under a different guise. The upcoming polls will be a crucial test in that direction.\nFrom a logistical standpoint, one idea that merits serious consideration is the staggered election model. Under this system, voting could be held in phases -- perhaps in half the constituencies of a district on the first day and the remaining half on the next. This model has several advantages. It would allow for better mobilisation and concentration of law enforcement resources. In practice, the same personnel could be redeployed across multiple phases, effectively doubling the strength in each area without additional manpower.\nSuch an approach would not only enhance security but also give the Election Commission greater flexibility in managing logistics and addressing any irregularities that may arise in the initial phases. It would also reduce pressure on the communication, transport, and administrative systems, all of which are stretched thin during national elections.\nLooking ahead, the Chief Adviser is expected to address the nation at the beginning of August, where the official election date is likely to be declared. According to the joint statement issued after the London meeting between the Chief Adviser and BNP Acting Chairman Tarique Rahman, the 13th parliamentary election could be held in the first half of February -- before the holy month of Ramadan.\nGiven this timeline, the next six months will be crucial. The interim government must not only maintain law and order but also foster a political environment conducive to free participation. Dialogue among political parties, transparency in electoral management, and a strict code of conduct for candidates and their supporters will be essential. All institutions -- from the Election Commission to the lowest tiers of administration -- must work in synergy to build trust and ensure credibility.\nFinally, let us not forget that the primary responsibility of the interim government is to create an enabling environment for elections and ensure their timely and credible execution. Failure to do so risks pushing the country into deeper political uncertainty. Conversely, success in conducting a fair election could become a defining moment in Bangladesh's democratic journey -- marking the end of a dark chapter and the beginning of a new era rooted in legitimacy, accountability, and popular will.\nIn conclusion, ensuring law and order in the run-up to the national elections is not just a tactical necessity -- it is a moral imperative. A peaceful election is the cornerstone of democracy. The people of Bangladesh deserve to cast their vote freely, without intimidation or manipulation. And it is the solemn duty of the state to make that happen.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ensuring law and order in the upcoming polls",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ensuring-law-and-order-in-the-upcoming-polls-1754328198",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       August 05, 2025 00:00:00  \nThe conversational AI chatbot, ChatGPT, can create texts like humans. So, writing of essays, reports, theses, answers to question in examinations at schools and colleges etc., are now being done by this AI tool. In other words, the machine is doing the job of thinking for us. In that case, shouldn't one be thankful that finally humans have been spared the strenuous task of cudgeling their brains to solve at least the problem of writing?\nBut the matter is not that simple. Concerned that to perform their schoolwork students are becoming dependent on generative AI tools, especially the Large Language Model (LLM), at an increasing rate, Nataliya Kosmyna, a research scientist at the MIT Media Lab, decided to find out how AI is leaving its impacts on the school students. To conduct the research, Kosmyna and her colleagues selected 54 subjects aged between 18 and 39 and divided them into three groups. The tasks assigned to the groups involved writing essays for tests called Scholastic Assessment Test (SAT). It is a kind of test widely used for college admissions in the USA. The first group was asked to write its answers with the help of ChatGPT, the second, the brain-only group, was to write just using their own brain power and the third, the Google Search group, took the help of Google search engine, to write its essays. How much the different groups engaged their brains to perform the tasks was measured by Electro encephalogram (EEG) test. Notably, EEG detects, measures and records brain's electrical signals representing its activity.\nAn interesting aspect of the brain function is the electrical activity it generates, which can be measured as brainwaves. These are produced when neurons (tiny brain cells) communicate with one another. The brainwaves occur at different frequencies and are classified into different categories based on their speed. The primary types of brainwaves, for instance, include alpha, beta, theta and delta. Alpha waves are produced when a person is awake but in a relaxed, meditative and restful state. The beta is faster than the alpha wave and shows up when one is thinking actively, concentrating, taking decision, or solving a problem. Theta wave occurs when one is in a creative and dreamy state. Delta waves, on the other hand, are the slowest and appear during deep sleep. They are important for physical healing, growth and immune function.\nNow, Kosmyna's three groups performing their tasks produced three distinct results. The ChatGPT users showed the lowest brain engagement and consistently underperformed at the neural, linguistic and behavioural levels. Over the months, they even got lazier with their assignments and often resorted to copying and pasting. Actually, the ChatGPT users all wrote very similar essays devoid of original thought. Two English teachers who assessed the write-ups termed those 'soulless'. \nThat means dependence on the particular type of generative AI of the Large Language Models (LLMs) category that create and process texts can harm learning, particularly of young users. \nThe brain-only group, on the other hand, showed the highest neural connectivity, especially in the alpha, theta and delta bands, which are connected with creativity, formation of ideas, the amount of information one can process in any given time (memory load) and the cognitive process of understanding the meaning of language (semantic processing). Kosmyna and her research team found that unlike the ChatGPT users, the brain-only group was not detached from their task but more engaged, owned their work and was satisfied with their write-ups.\nThe third, or the Google Search group, proved to be more brain-engaged than the ChatGPT users, owned its work and expressed satisfaction about its performance.\nBut when asked to rewrite one of their essays, the ChatGPT users had practically no memory of their previous work with weaker alpha and theta brainwaves. The other two groups did well in this regard.\nKosmyna believes a young learner's brain should be allowed to develop more naturally in an analog way.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Thinking for oneself",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/thinking-for-oneself-1754328242",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 05, 2025 00:00:00  \n\nToday marks the 5th of August, a date of immense historical significance. It has been one year since the revolutionary August that awakened a nation -- the month of resistance, of collective uprising, of shattered fear. That August reshaped our lives, challenged our philosophies, and rekindled in the youth a deep, unwavering love for our motherland -- something many of us had never realised before.\nYet, one year on, the vision of justice and reform that fuelled the July Revolution remains unfulfilled. The treatment of those who risked everything for change -- the July warriors -- has strayed far from what they deserve. The wounds remain open, the pace of justice frustratingly slow, and the roadmap to reform unclear. Political parties, especially the dominant ones, show little interest in real reform. Justice for the July genocide remains elusive, and the fugitive former Prime Minister Sheikh Hasina has yet to be held accountable.\nMeanwhile, extortion is on the rise, and efforts to spark a counter-revolution are constant. The party responsible for violence and terror has still not been banned. The interim government is struggling to function effectively. Bureaucrats and administrators appointed by the previous regime continue to obstruct progress, clinging to their old allegiances and undermining reform. Police forces remain passive, and political parties are more invested in election strategy than in upholding the values of July.\nDespite this, we must not forget: we are better off than before. Saying \"things were better under Hasina\" is a betrayal of the blood shed by the martyrs of July. Under that regime, we were silenced, forced to idolise figures we didn't believe in, and made to feel like exiles in our own homeland. Today, we have regained the ability to speak, to criticise, to hope.\nThe youth still believe in meaningful reform and remain willing to participate-if only they are given a reason to believe their voices matter. To bridge the gap between promises and progress, reform must be visible, inclusive, and result-driven. Above all, justice must be served. The former prime minister must be brought to book. Only then can we honour the sacrifice of the July fighters and truly begin to build the nation they dreamed of.\nSamia Jahan Shefa\nDepartment of Genetic Engineering and Biotechnology,\nJashore University of Science and Technology\nshefasamia8@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Caught between hope and despair",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/caught-between-hope-and-despair-1754328270",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-08-2025"
    }
]