[
    {
        "full_article": "The integrity of the electoral system in India is dependent upon the confidence reposed in it by prospective voters and the participatory political parties. In recent years, the Election Commission of India (ECI) has drawn flak — from overblown to deserved reasons — from political parties and civil society activists concerned about trends in Indian democracy. A new complaint after recent State elections relates to the increased number of electors in the Assembly polls when compared to the numbers registered in the general election for the same year (2024). While a report in The Hindu found that such discrepancies in electorate registration were not unusual when compared to previous election cycles, the question (raised vociferously by the Opposition Congress) as to how a State such as Maharashtra registered an increase of 48 lakh voters in just six months since the general election has not been adequately answered by the ECI. This along with the ECI’s disclosure that the nature of registration allowed for different electors to have the same Electors Photo Identification Card (EPIC) number, has allowed Opposition parties, particularly the Trinamool Congress, to raise questions about the credibility of the registration process. What is worrisome is the possibility of electors voting across States.Prima facie, this discrepancy in EPIC numbers — which the ECI has averred that it will rectify by updating the numbers in its voter database to make them unique — is not problematic. Even if the EPIC number is shared by different voters, they can only vote with their verified ids. Yet, the larger problem, of a possibility of a voter having multiple EPIC numbers across different States, calls the process in question. For example, a migrant voter can vote in a particular State of residence and in his/her home State if elections are held in close succession as there is a good possibility of the duplicate EPIC number remaining in the database. The most effective solution would be to link the Aadhaar number and biometric verification for voting. But this is still not foolproof. The Aadhaar’s purpose is to identify residents, and not citizens, and would have to be supplemented by another proof for voting eligibility. Second, an Aadhaar number on electoral rolls could result in misuse such as profiling, and the ECI has to mask it when the rolls are made available to political parties. Besides, biometric verification for de-duplication should be supplemented with clear alternative identity verification as the former has the potential of excluding genuine voters because of technological failures. The ECI must be open to undertaking a clear de-duplication exercise that will allow a voter to have only one EPIC number and voter id, with the eligibility to vote only in their area of residence. Published - March 05, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        election\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        Assembly Elections\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        Maharashtra Assembly Elections 2024\n                    \n                            /                      \n                        \n                        All India Trinamool Congress\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        voting",
        "headline_1": "​Double trouble: On elections, the EPIC number and the voter",
        "headline_2": "The Aadhaar seems the default bet to restrict a voter to one polling location",
        "link": "https://www.thehindu.com/opinion/editorial/double-trouble-on-elections-the-epic-number-and-the-voter/article69290344.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-03-2025"
    },
    {
        "full_article": "Just as Firefly Aerospace became the first private entity to soft-land a robotic lander on the moon on March 2, NASA acting administrator Janet Petro said “the way that we keep America first is by dominating in all the domains of space. And the domain ... we’re going to capture … is going to be on the surface of the moon, and around the moon”. The comment was objectionable in its essence, but also carries a lesson for the rest of the spacefaring world. The U.S. space programme remains the wealthiest and most farsighted in modern history. But like U.S. President Donald Trump, she seems to have lost sight of the difference between leadership and domination. Just as the conduct of Mr. Trump and the U.S. Vice-President at the White House meeting with the Ukraine President clarified the U.S.’s self-serving priorities, so too does Ms. Petro’s comment reveal a nakedly aggressive streak in American policy — in this case, what the U.S. sees as its rightful place in humankind’s aspirations about space.The moon and cislunar space, and the material and intellectual resources required to access them, are part of the Great Commons and they are already suffering the effects of a growing tide of protectionism worldwide, exacerbated by gaps between the evolution of law and the pace of innovation. Regulatory clarity is emerging very slowly and is often stunted. The U.S. Federal Aviation Administration (FAA) recently said that it cannot be held responsible for the fragments of a SpaceX rocket that fell over Poland because the FAA lost oversight once SpaceX had lost control of it. Given the bent of the FAA’s and Ms. Petro’s statements, there is no reason these commons will escape the U.S.’s reckless visions of domination without proactive decision-making. In the absence of the ability to defy its government’s orders, NASA’s position risks endangering international cooperation — an enviable edifice assembled over decades in the face of an expensive, perilous, time-consuming affair — in space flight, often with NASA input. Irrespective of Ms. Petro’s tenure at NASA, her words indicate that the helmsperson is not beyond being expected to further Mr. Trump’s inflammatory rhetoric, if not agenda, in space and as well as on the ground. The cooperation must resist this. Given the Trump administration’s attitudes towards other cooperative efforts, such as the fight against climate change, which demand internationalism over provincialism, it is imperative that national and supranational space bodies, including the Indian Space Research Organisation, come together to cultivate mechanisms to resist unilateral action in space, if not prevent it altogether.\r Published - March 05, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        space programme\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        ISRO",
        "headline_1": "​Against domination: On the U.S. attitude towards space programmes",
        "headline_2": "The U.S. is seeking to dictate the terms of engagement in space",
        "link": "https://www.thehindu.com/opinion/editorial/against-domination-on-the-us-attitude-towards-space-programmes/article69290357.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-03-2025"
    },
    {
        "full_article": "Mayawati ousted her nephew from BSP. Reasons are confusing. But her electoral irrelevance won’t change\nWhat a fall it has been. Once pundits used to speculate that Mayawati could become India’s first Dalit PM. Dust is still thin on those columns and already everyone has to be reminded that she was the first UP CM to complete a full term. If she had grander ambitions, it was with reason. 2014 LS results, in retrospect, signalled how new political waves would instead carry her in the opposite direction. BSP held on to a 20% vote share in UP, but scored 0/80 seats. By 2024, even the vote share dropped to 10%. Today, Mayawati is making headlines for political house ‘cleaning’. But the kind of revival BSP well-wishers desperately wish for, isn’t to be seen.\nNot for the first time, she’s fired nephew Akash Anand, otherwise understood as her heir apparent. Opinion’s divided on whether this is because he was too big for his boots or too undersized. What’s fact is that a series of BSP politicians have taken the exit, to grow out of Mayawati’s shadow. As defeat has followed defeat, she’s put the blame not only on her political rivals but also, variously, Jats, EVMs, Muslims…Most plaintively, she’s observed “apne log”, own people, drifting away. Much of the drift has been BJP-wards – a social engineering success prefigured via a Dalit laying the first brick at the 1989 foundation ceremony for Ram temple.\nIt’s also true that no Dalit politician currently commands the political space like Mayawati once did, or Kanshi Ram. In other parties, they’re arguably mere cogs in the wheel, no matter how important. For some experts, experimenting with various parties and politicians speaks to increased self-confidence among Dalits, a deepening of democracy. For others, such segmentation of Dalit representation and vote, amounts to a weakening. They hope a new Mayawati will rise from the new generation of Dalit-Bahujan politicians.\n\n",
        "headline_1": "Aunty Dalit Politics",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/aunty-dalit-politics/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-03-2025"
    },
    {
        "full_article": "Trump’s hatchet man who fires from the hip is like a character from a Western comic book\nJottings from the White House diary:\nBoy, have I had one helluva week. Did that video that’s gone viral showin’ my Gaza Resort with a sing-along jingle, a whopping gold statue of me, an’ me waltzin’ with bearded belly dancers.\nThen I did that arm twistin’ with that Zelkinky or whatever, to get him to stop invading my pal Pootie’s Russia and to gimme all those minerals and stuff he’s got.\nThen I rolled out the Gold Card wheeze that gets you to stay in US of A if you can shell out five million smackeroos, which’ll bring in megabucks, specially for folk in the buildin’ business, like me and Jared.\nSo who’s been runnin’ the country while I’ve been busy doin’ all this? What a dumbass question to ask! My buddy Elon’s been runnin’ it, mostly by runnin’ people out of their jobs.\nHe’s already fired over 20,000 of ’em including those gonzos who were aidin’ and abettin’ all them foreign countries. The way Elon fires all those sad sacks, shootin’ ’em from the hip sorta, he reminds me of that Lone Ranger fella who rode a white horse, shot silver bullets, and had a sidekick called Tonto.\nCome ta think of it, if ya scramble ELON it becomes LONE, so he’s like the Elon Ranger. Maybe we could do a video of him too, firin’ all those no-good bums who spend all them taxpayer dollars and do eff-all in return.\nMy Elon Ranger says he meansta get ridda half the 2.2mn guvment ’ployees who cost us 6.7tn bucks a year, and by firin’ them he’s gonna save us a trillion greenbacks.\nElon Ranger takes out all those no-gooders of the Deep State even faster than the Lone Ranger took out all them baddies of the Wild West. Wham, Bam, Thankee Uncle Sam!\nOh, here he comes, walkin’ towards me. I’ll ask him who he’s gonna fire next. But what’s that he’s holdin’ in his hand? A slip of paper? A pink slip of paper? Wonder what it means…\n\n",
        "headline_1": "The Elon Ranger",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/the-elon-ranger/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-03-2025"
    },
    {
        "full_article": "Some SC remarks on Allahbadia case may encourage more censorship. Creatives always push the envelope \nSC has restored podcaster Ranveer Allahbadia’s economic freedom but curbs on his freedom of expression remain. He may now make shows as long as they don’t violate ‘traditional Indian norms’ on decency and morality. It’s a conditional relief, and welcome as far as it allows Allahbadia and his large crew to earn their livelihood, which is part of their right to life. But it also raises questions about the direction his case has taken and the restraints placed on him. Allahbadia’s fault was that he said – in a paywalled show – something that most people would consider disgusting, or distasteful, across cultures. When police complaints were filed, Allahbadia sought SC’s protection. He got a chiding, a total ban on podcasting until further orders, and protection from arrest on the condition that he surrender his passport.\nThe blanket ban was unusual because it broke with precedent. In 2015’s Shreya Singhal case, SC said restrictions “must be narrowly tailored or narrowly interpreted so as to abridge or restrict only what is absolutely necessary”. In 2022, it refused to bar Mohammed Zubair from tweeting because “gag orders have a chilling effect on the freedom of speech”. As far back as 1950, SC had rejected “pre-censorship” – which is what requiring Allahbadia to adhere to ‘traditional decency and morality’ amounts to. Besides, as SC said in the Zubair case, “If he posts tweets in violation of law, he would be answerable for it.” So, Allahbadia deserves to be judged post-facto too.\nThe question before SC was whether Allahbadia’s remarks were obscene – to be considered a criminal offence. His counsel reminded the court that disgust and revulsion are not tests of obscenity. SC, however, seems intent to fill the “vacuum” around the question of obscenity/vulgarity, and has sought govt’s assistance, which seems only too eager that the “young generation must be protected from such shows”. There lies the problem. Freedom of speech in India was fettered with “reasonable restrictions” 75 years ago. We don’t need more curbs. Certainly not those based on “traditional” ideas of decency and morality, that can’t accommodate anything from torn jeans to live-ins. Creatives – filmmakers, writers, podcasters – constantly push the envelope. Sometimes they go too far, in some people’s eyes. That’s the nature of creativity. But it shouldn’t be a pretext to muzzle them or babysit us. \n\n",
        "headline_1": "Don’t babysit",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/dont-babysit/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-03-2025"
    },
    {
        "full_article": "White House blowup complicates things. But Europe, Kyiv & Washington can still return to Trump’s ceasefire-minerals-security guarantee formula. Getting real US backup will be tougher\n\nAfter the disastrous Feb 28 Oval Office meeting between Trump, Vance, and Zelenskyy, one’s tempted to despair. Putin will continue to attack Ukraine, US support for Ukraine is in doubt, and rift between US and Europe-Ukraine is widening. Kremlin is gleeful that aggression can continue.\nRead full story on TOI+\n\n",
        "headline_1": "Peace after fight house?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/peace-after-fight-house/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-03-2025"
    },
    {
        "full_article": "Like many countries, Bangladesh was caught off guard by the speed and extent of USAID funding cuts under the Trump administration. Although there is no official data on how many people have lost, or may lose, their jobs due to the freezing of funds, estimates from the development sector suggest that between 30,000 and 40,000 people may be affected. This is deeply concerning, particularly because it will put significant strain on the economy.\nAccording to diplomatic sources, USAID provides Bangladesh with $300-400 million annually for health, nutrition, agriculture, livelihoods, labour rights, human trafficking prevention, and democratic development. These funds have been instrumental in Bangladesh's progress in areas such as maternal health, climate resilience, and rural development. However, following Donald Trump's inauguration as US president on January 20, his administration swiftly suspended most USAID funding and activities, except for emergency food aid, including assistance for Rohingya refugees in Bangladesh. This move has not only left thousands of development workers unemployed but also cast severe doubt over the future of various development projects.\n\nMany development projects currently facing an existential crisis are similarly essential not only for their beneficiaries but also for society at large. As such, the government must not allow them to collapse. It should instead conduct a thorough evaluation to identify the most critical initiatives and explore ways to sustain them. This could include direct government funding for the high-priority projects, partnerships with international organisations, or securing alternative donor support. NGOs, too, must adapt by assessing their efficiency, optimising operational costs, and exploring sustainable funding sources.\nMany of these now-unfunded projects serve the most vulnerable segments of our society. Whether providing crucial immunisations, essential medicines, affordable birth control, or income-generating opportunities for the poor, their loss will have a far-reaching impact. Some projects also focus on promoting workers' rights or supporting labour-related cases. With funding now frozen, many of these labour rights initiatives could be sidelined, leaving workers even more vulnerable to exploitation. In a country like Bangladesh, where a significant portion of the workforce is employed in the informal sector with weak labour protections, this could be devastating.\nMany development projects currently facing an existential crisis are similarly essential not only for their beneficiaries but also for society at large. As such, the government must not allow them to collapse. It should instead conduct a thorough evaluation to identify the most critical initiatives and explore ways to sustain them. This could include direct government funding for the high-priority projects, partnerships with international organisations, or securing alternative donor support. NGOs, too, must adapt by assessing their efficiency, optimising operational costs, and exploring sustainable funding sources. Without compromising beneficiary support, they should implement cost-saving measures and seek collaborations with the private sector, philanthropic institutions, and public-private partnerships to reduce dependency on foreign aid.\nThe USAID funding cuts have posed a serious challenge, but they also underscored the need for a more self-reliant development model. A coordinated approach by the government, NGOs, and the private sector is therefore essential to ensure that crucial programmes continue to serve those who need them most.\n",
        "headline_1": "We need a more self-reliant development model",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/we-need-more-self-reliant-development-model-3839931",
        "news_paper_name": "The Daily Star",
        "publish_date": "05-03-2025"
    },
    {
        "full_article": "In nearly eight decades of negotiating history between Israel and the Palestinians, the rule is enshrined that the weapon of the Palestinians' in the negotiations is their right and the paper that establishes it, and that Israel's weapon is the power of fire. In other words, we always find ourselves with the narrative that Israel is doing completely contrary to what was agreed, and that very dynamic also refers to the US, which is always accused of double standards; first, ensuring the interest of Israel in full, and second, ignoring rights for the Palestinians, which they claim to stand for, in engineering agreements throughout the years.\nThe judgement in this equation is always power in all its military, economic and alliance components.\nIn all the agreements and understandings reached, Israel was exercising its commitment to them on the measure of the gains it has achieved for Israel, and the harm inflicted on the Palestinians by dispensing with them. Take for example, the Oslo Accords, signed in the White House and the aftermath that saw its promise utterly left unfulfilled for the rights of the Palestinians.\nPalestine is at an immensely fragile position, where the ceasefire deal—a deal largely made by the US—could bring us back to square one. As widely known, the deal came in three stages: the first has advantages for both parties, and the second has more advantages for the Palestinians, in that it includes a more permanent withdrawal of Israeli troops and authorities' presence in Gaza, which they destroyed.\nIsrael's fascist Prime Minister Benjamin Netanyahu's office came minutes after the first phase ended, and as talks have begun on starting the second phase that's aimed at ending the war and seeing all remaining living hostages in Gaza returned home, he issued a statement describing a US proposal—a ceasefire extension through Passover, or April 20. On the first day, half the hostages, alive and dead, would be released. The rest would be released if agreement is reached on a permanent ceasefire. The extension would provide Israel with its desired advantages to continue illegal occupation, and the fate of the second and third phases are becoming determined, according to the unequal equation based on Israeli military force, which, even if not exercised, remains threatening enough.\nSince the beginning of the first phase, Israel has been thinking, planning and working on how to defer the second phase and continue to deprive the Palestinians of its advantages, benefiting from the fact that the exchange will reduce the pressure from the Netanyahu government to bring home the Israeli hostages, and neutralise the hate against them, while also benefiting from the time factor that gives it valuable opportunities to officially and actually abolish the second phase.\nThe Palestinians and Arabs can now admit that what is happening now is a lack of even the minimum balance that came from Washington—the American position under the Biden administration was characterised by a synthetic duality. Now, it is to unconditionally give Israel everything it needs and beyond more than the means of war, and giving the Palestinians in return—very limited drops of financial support to beat all the lingering traumas from the atrocities they have witnessed, and lived through. The Trump administration has unequivocally moved the already-lopsided equation between the US and Israel in another direction, as the US is no longer a mediator but rather a direct party by giving Israel an open mandate to do to the Palestinians whatever it wants.\nRecent events in other parts of the world also indicate it could get much more frightening and worse for the Middle East. The kind of US government which staunchly supported Ukraine against Russian invasion, selectively following international law, is also vanishing from Washington. Ukrainian President Zelensky's humiliation in the White House should be understood as greater and deeper than being a verbal quarrel between two presidents. It established the beginning of a dangerous era in which the creditor is a master and the debtor is a slave. Countries, including the Arab states, who could also be candidates for similar insults—as would be Europe—have the actual potential to save themselves and their prestige before the axe falls on the head. It is incumbent upon nations that still have power against Donald Trump to act before things take a turn for the worse.\nWe are already witnessing a pattern of behaviour in what is happening about Gaza, where the stages of the agreed deal are slyly being turned into one stage—which is only to be extended until the recovery of all Israeli hostages, living and dead, and then we will see everything that had nothing to do with what is written on the paper. We have seen this game before: postponing the negotiations which save Trump's ally Netanyahu the precious time he needs to rearrange his cards in the Israeli political arena to remain in power. As long as the war continues, even in parallel with the temporary truce and exchange, Netanyahu will remain the ruler in Israel until the last day of his term, with renewed chances of reaching another term.\nThe papers of agreements and understandings from the beginning of the Palestinian cause to the present day, have been burning in all rounds of its right struggle with the Israeli fire, to enshrine an equation that says: \"What can the ink, paper, signatures, mediators and witnesses do with the fire other than burning and turning into ashes?\"\nYousef SY Ramadan is the ambassador of Palestine to Bangladesh.\n\nViews expressed in this article are the author's own.\nWe welcome your contributions and analysis of global events, and responses to our articles. To submit articles to Geopolitical Insights, please send an email to [email protected]\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Why Palestinians are now worried about the ceasefire",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/geopolitical-insights/news/why-palestinians-are-now-worried-about-the-ceasefire-3839476",
        "news_paper_name": "The Daily Star",
        "publish_date": "05-03-2025"
    },
    {
        "full_article": "Inflation is often conceptualised as the rise in aggregate price levels. These prices are consolidated across temporal intervals—usually between years—on an assemblage of commodities usually consumed daily. We often construe inflation through the narrow prism of price fluctuations. However, inflation indicates an intricate interplay of logistical, political, financial, and ethical practices that should be analysed to decipher changes in prices.\nThe Bangladesh Bank records consistently elevated inflation trends, rising from around 5.86 percent in January 2022 to about 11.38 percent in November 2024. In general, food inflation outpaces non-food inflation. Policy consensus suggests that exogenous shocks, such as the Covid pandemic, Russia-Ukraine conflict, and concomitant global economic slowdown, impacted Bangladesh's efforts to control price levels, leading to rising target inflation rate.\nThe quickest endpoint of a higher inflation rate is the reduction of purchasing power. Lower purchasing power translates into weaker local currency, which tosses a temporary lifeline to an export-orientated economy. For an import-hungry economy like Bangladesh, the sagging currency leaks more money, turbocharges the trade imbalance, and leaves a lower currency reserve.\nBangladesh's economy manifests unique idiosyncratic economic and trade characteristics, including its large population, high growth rate, and a heavy reliance on a circumscribed cohort of tradable commodities. One anomaly pertains to the entwinement of the country's principal export and import being connected to the same industry: ready-made garments. A significant portion of the country's industrial imports undergoes value-added processing before being exported to powerful foreign buyers, having a complex influence on prices, employment, government policy, currency rate, and GDP. \nThe most traditional method of controlling inflation is to balance a monetary instrument, notably the borrowing rates (first two panels in Figure 2). Often, these abrupt changes are moderated by an upward adjustment of direct and indirect taxes to restrain consumption.\nThe restrictive monetary and fiscal measures result in a deceleration in production, consumption, employment, and economic growth, which may lead to stagflation. The temporal horizon for an economy to transition out of stagflation is three to four years for a developed economy. While these traditional restrictive mechanisms work well for economies with robust financial markets, they can jeopardise overall stability in emerging nations already suffering from a systemic fragility in financial markets. \nFigure 1 delineates the metamorphosis of price transformation as goods transition from producers to consumers. Various determinants in the price formation continuum contribute to the accretion of additional costs in production pricing. Notably, many price components are superfluous and can be eliminated to attenuate the overall economic cost.\nArguably, one of the most effective methods to mitigate the repetitive price-cycle cost is to \"close the gap\" between producers and consumers. One such mechanism, increasingly marginalised in our society, is the traditional weekly marketplace where producers sell products directly to the consumers. Similar models are available in Malaysia and other Southeast Asian nations, exemplified by the Pasar Malam or the night markets. In England, the councils curate borough markets, facilitating direct transactions between farmers and consumers. Under these models, the government can emphasise their targeted support for the producers in the form of subsidising the cost of irrigation, seeds, labour, finance, and agricultural technologies. Effective distribution channels can be employed to distribute goods aimed at vulnerable groups at a low cost (i.e. rice and commodities at a subsidised price). \nIt is worth noting that sellers from the informal sector vendors (hawkers) are different from the farmer's market. Of note, with the growth of the multinational resellers, these direct exchange frameworks are declining, thereby consolidating the power of the so-called market syndicates, putting upward pressure on prices. While there are several logistical problems inherent to a farmer's market, Bangladesh can utilise its massive infrastructural growth of recent years to revitalise such models. \nIslamic countries like Bangladesh can instrumentalise the use of social funds. Numerous examples of such instrumentation can be drawn from Indonesia and Malaysia. While the cost is low, there are obvious disadvantages of these social funds. The most prominent drawback is the trust of the general mass in the efficiency of the government managing these social funds. Nonetheless, while relying on the traditional financial sector slows down economic activities, the social fund sector can offer a viable second tier of funds (Figure 2). \nBangladesh amassed around $23.9 billion in remittances in FY2023-24. Massive infusion of remittance-driven consumption expenditure in rural areas exerts pronounced inflationary pressure, distorting price formation at the production stage.\nBangladesh could draw examples from Malaysia, Indonesia, the Philippines, and even India, which instituted numerous foreign currency investment schemes for remittance earners. By provisioning these schemes, the government can strategically divert a portion of the funds to productive investment, thereby augmenting the capital available to the financial markets. Integrating financial technology (fintech) with judicious policy reforms could empower wealth management firms to facilitate personalised wealth management solutions. This would help build a tertiary financial sector to help diffuse instability currently concentrated within the conventional financial and banking sectors.\nFinally, disproportionate escalation of inflation can have profound financial, sentimental, and political impacts. While several instruments can modulate inflationary pressure within brackets, promoting financial literacy is necessary for wider social engagement. Also, highly diversified economies exhibit greater resilience than insular economies. Therefore, strategic trade and economic partnerships may prove instrumental for Bangladesh at attenuating high inflation.\nDr Mamunur Rashid is a reader in finance at Canterbury Christ Church University, UK. He can be reached at [email protected]. \n\nViews expressed in this article are the author's own and do not reflect the views of the institutions he serves. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "In Bangladesh, inflation control needs an iconoclastic approach ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/bangladesh-inflation-control-needs-iconoclastic-approach-3839446",
        "news_paper_name": "The Daily Star",
        "publish_date": "05-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "BB steps help boost remittance inflow",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bb-steps-help-boost-remittance-inflow-1741100898",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Protecting arable lands in a land-scarce country",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/protecting-arable-lands-in-a-land-scarce-country-1741100960",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Towards a cashless society",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/towards-a-cashless-society-1741101092",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Gang culture must be eliminated",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/gang-culture-must-be-eliminated-1741101127",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-03-2025"
    }
]