[
    {
        "full_article": "The latest data on investment announcements in the country paint a mixed picture, with varying policy implications. New project announcements by the private sector overall rose to nearly a 15-month high in the first half of this financial year to ₹9.9 lakh crore. Such investments have historically been driven by Indian firms, but that concentration has intensified in the last few years. While Indian firms accounted for 77% of all private sector announcements in 2018-19, that share was 94% in the first half of the current financial year. Taken together, these data points underscore a diametrically opposite outlook on the Indian economy held by domestic and foreign firms. Domestic firms seem increasingly optimistic. It remains to be seen how many of these announcements fructify, but the data show that the value of projects actually completed by Indian firms was also at a near 15-month high so far this fiscal. This should come as a relief to the government, which has been pushing the private sector to invest more. The data also show that most of these new investments are to be in the manufacturing sector — another strong positive for the economy. A large part of these new investments was announced before the GST rate cuts were first made public on August 15, implying the private sector’s confidence goes deeper than an expectation of a temporary demand boost. If the investments do come through, that will leave the government with more fiscal room to address developmental and defence issues, both of which need its attention.Foreign firms, on the other hand, do not seem quite as convinced by the India story. The value of project announcements by foreign companies fell to ₹0.6 lakh crore in the first half of FY26, marking the third consecutive year of decline during this period, and also a five-year low. Several global factors have certainly dampened investor sentiment ever since the COVID-19 pandemic, but the fact remains that global investment outflows nevertheless increased 11% in 2024 and 3% in 2023. While the latest tariff friction with the U.S. would have shaken some confidence in India as an investment destination this year, the government needs to figure out why foreign companies were looking elsewhere even before. The data also reveal that fresh announcements by the government stood at ₹1.5 lakh crore during the period under review, down 71% over the same period last year. This is in line with the Centre’s warnings that it will not be growing its capex as fast as before. However, with the government and foreign companies pulling back, the pressure on Indian firms increases. Simultaneously, the urgency to keep this momentum going through ease of doing business reforms also sharpens. Published - October 04, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        investments\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        economic policy\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        manufacturing and engineering\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        foreign investment\n                    \n                            /                      \n                        \n                        defence\n                    \n                            /                      \n                        \n                        development",
        "headline_1": "​Domestic vitality: On investment announcements, policy implications",
        "headline_2": "Domestic firms show more faith in India than foreign investors",
        "link": "https://www.thehindu.com/opinion/editorial/domestic-vitality-on-investment-announcements-policy-implications/article70121432.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-10-2025"
    },
    {
        "full_article": "President Donald Trump’s 20-point “peace plan” for Gaza has won rare approval from Israel and key Arab countries. While Israel Prime Minister Benjamin Netanyahu says it aligns with Israel’s war objectives, Arab and Muslim leaders have welcomed the initiative as a step towards peace. But one truly important voice is missing — that of any representative of the Palestinian people. When the latest phase of the Gaza war began, following Hamas’s October 7, 2023 attack, Israel vowed to “destroy” the Islamist militant group. Two years on, Israel has turned Gaza into dust and displaced the entire population. Yet, Hamas has not been totally defeated. Any lasting peace hinges on an agreement between Israel and true representatives of Palestinians, even if Hamas is to be kept out. Mr. Trump and Mr. Netanyahu have issued an ultimatum to Hamas: accept the plan or face continued Israeli attacks. The Trump plan promises an immediate ceasefire in return for the release of all hostages. It further states that Palestinians will not be forced to leave. For a population living in makeshift shelters, a ceasefire and the permission to stay on will be a relief. But beyond this veneer of concession, the rest of the plan is structured almost entirely to serve Israeli interests.It proposes to place Gaza under an international governance body overseen by a ‘Board of Peace’, chaired by Mr. Trump. The plan further calls for the deployment of an International Stabilisation Force (ISF) in Gaza, while allowing the Israeli troops to retain “a security perimeter”. Hamas will have to demobilise itself. In essence, Gaza would be placed under a new colonial-type administration and a foreign military force, while Israel would continue to occupy parts of the enclave. Palestinians will be excluded from the top decision making bodies until “reforms of the Palestinian Authority are complete”. This is a plan written in sand. Even if Hamas were to accept the proposal and disband itself, or if Palestinians were to reject Hamas completely, there is no assurance that the Palestinian resistance will wither away. Without a credible pathway to Palestinian statehood, violence will continue in one form or another — the message of October 7. The plan offers no timeline for its lofty goals; it does not specify which countries would contribute troops to the ISF; nor does it clarify who would oversee the implementation process or the “reforms” within the Palestinian Authority. Rather than forcing his ally to end its daily attacks on Palestinians and withdraw through a ceasefire for hostages agreement, Mr. Trump is making an already intractable conflict more complicated. This proposal will not win him peace. Rather, it will drag him deeper into the quicksand of West Asia.\r Published - October 04, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Palestine\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        peace negotiations\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Donald Trump",
        "headline_1": "Peace mirage: On Trump’s ‘peace plan’ for Gaza",
        "headline_2": "The Trump plan serves Israeli goals and does little for Palestinians",
        "link": "https://www.thehindu.com/opinion/editorial/peace-mirage-on-trumps-peace-plan-for-gaza/article70121624.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-10-2025"
    },
    {
        "full_article": "My parents enjoyed long drives. Even in the 1960s, when that meant navigating cows and carts that competed for space on the two-lane GT Road. It was, I think, on the way to Barkakana, in the heart of Jharkhand, that we stopped to have lunch at a dhaba in Gobindpur, where I met my first chicken butter masala. Bright orange, streaked with cream and the froth from melted butter, it was like nothing I had ever tasted, heightened by the slightly burnt smell of the fresh rotis from their tandoor. Now I know it was the play between the sweetness from the tomatoes and the cream, the undertow of chili heat and the contrasting bitterness from the kasuri methi and the charred tandoori chicken itself, that gives this dish its enduring grip on my palate. But on that first day, it was just magic.\nI have been to truck stops all over India and beyond, from the bare sheds that failed to stop the howling desert winds somewhere in Xinjiang, to the fake-historic turreted ‘trucker’s castle’ near Frankfurt, if my memory serves me right. I have waited anxiously among the dark shadows behind a shuttered central Indian dhaba for the driver to finish his rest break, listening to the barking dogs and occasional moaning sounds, and enjoyed the hospitality of an unexpectedly well-maintained HP government restaurant well above the tree line near Sissu.\nILLUSTRATION CREDIT: Cheyenne Olivier (France)\nAnd of course, I have many memories of meals. The suspiciously watery maccher jhol on the way to Krishnanagar that turned out to be incredibly delicious. The kindly woman who noticed that I was wasting the wonderful thali she served me in a small shed near Tanjore because I had eaten something more toxic the day before. The many, many alu parathas with achar and dahi that marked the beginning of so many of our field-trips, some light and dense in flavour, some drowned in reused oil. The perfectly fried Wiener Schnitzel in that ersatz castle I mentioned, tasting of nothing but the lemon juice I squeezed on it. The famous (I was told) civet de lapin (rabbit stew with bacon and mushrooms) at a restaurant routiers near Lyon or Dijon, which was a little too gamey for me (I think it was hare and not rabbit, and the server actually told us that, but our French was not up to it).\nThat last meal was at a Relais Routiers, a loose chain of 700 truckers’ restaurants all over France. I read that their inspiration came from an upper-class journalist called François de Saulieu de la Chomonerie, who, in 1934, took a ride on a truck from Paris to Marseilles and wrote about the hard lives of the drivers. For less than 15 euros, Relais Routiers still offers drivers clean showers and a three-course meal, appetizers (grated carrots, julienned celeriac in a mayonnaise sauce, a pâté or two) plus a meaty main course, dessert and, of course, this being France, a glass of wine).\nEven with that necessary break, the days can be long and hard. The US allows a maximum of 11 hours of driving a day, while France caps it at 9. Long-distance freight is paid better, but it means being away from home for days or even weeks, often sleeping in the cab of the truck for nights on end. Cheyenne, who illustrates this column, grew up with a father who drove trucks for part of his life while raising his two little girls alone, so long-distance travel was not an option for him. Instead, he saved as much as he could out of the living allowance the company gave him by carrying a stove and a little fridge with him, so that he could cook himself meals in his truck. To avoid using the restaurant’s showers, he carried a bucket and mug. Which is how, one hot summer day, just as he started pouring water on himself, it happened that the truck sheltering him just took off, leaving the young family seated across wondering what a grown man in very minimal underpants was doing there.\nIn India, of course, we are quite used to taking baths outside, protected by a strategically placed wrap or loincloth. I have many memories of a taxi driver’s stop near our home in Kolkata, where Sikh men would patiently run a comb through their often waist-long hair after their morning ablutions, while enjoying the early morning sun. But it is also true that for the truck drivers, the alternatives are often dire: a particularly precarious toilet in a Barabanki truck-stop still haunts my dreams. Truck drivers might enjoy the occasional marvellous alu paratha or chicken butter masala (though I must confess that my quest to recapture the Gobindpur miracle has systematically failed) but they typically sleep somewhere in their truck or, if the weather permits, outdoors on a rented khatiya (rope bed) in the truck stop. For many nights a week. Truck drivers I have spoken to, mostly in the more rudimentary dhabas across the country, often complain about the life they live: “My mother doesn’t get along with my wife, she misses me,” I recall one telling me. Maybe he was too much of a man to say that it was he who missed the family.\nA widely quoted number that is ascribed to a World Bank report is that there are only 60 drivers in India (or less) for every 100 trucks. It is likely that some of these idle trucks are in need of repair (and some are so old and rickety that nobody wants to drive them) but the ratio has been falling since the 1990s, when there were more potential drivers than trucks. Apparently, a lot of this is because people prefer to drive Ubers and Olas in the cities, which pay roughly the same amount and offer a much less arduous life.\nYet trucks are very much the lifeblood of the Indian economy, carrying 70% of the freight. Building roads and, increasingly, highways and other high-speed roads has been a focus of BJP governments in the past and now — the national highway network has grown by 60% since 2014, and there are many more four-lane highways. I should add that my experience so far is that the promised wonderful roads are mostly indeed wonderful but there is always a bit that is dug up/being improved and that, combined with the increased traffic attracted by the road’s reputation, creates massive bottlenecks.\nBut I assume that can be fixed. The lack of drivers, on the other hand, is a structural issue. The government’s response — creation of more driver training institutes — seems to miss the point that young people don’t want to drive. Higher wages are clearly part of the answer to that, but a lot of the response probably needs to be in terms of public policy. Short-term accommodation in India is notoriously expensive for the quality it offers. Encouraging the creation of clean, safe, comfortable dormitories where men and women can stop for a few hours for a small amount of money will help travellers of all stripes, including drivers. They would also benefit from more policy attention to the quality of the springs and the seats in the truck that give the ride its roller-coaster quality and to the length of the driving day (which is nominally capped at 8 hours, but it is not clear who is enforcing it). They probably consider these a part of a trucker’s life and don’t fully understand how much they hurt, especially in the long run. In particular, new reports suggest that many middle-aged drivers complain of back pains.\nThe fact that trucks are often extremely overloaded (who hasn’t seen a toppled truck on Indian roads?) is a source of stress both to those driving them and everyone else on the roads. Being stressed and tired is often a reason to drink: the Gobindpur dhaba, the six-year-old me had noted with surprise and amusement, was paved with beer bottle tops. I now know what that meant. Enforcing simple regulations — penalties for overloaded trucks and for drinking and driving (which exist but often get waived in return for a small bribe) — would make driving universally less unpleasant.\nRoads with better-rested and less-stressed drivers driving more stable trucks is something all of us who use India’s roads need. In 2023, 1,72,000 people died in road accidents, including some 10,000 children. We know that the victims were often on two-wheelers, but that only tells half the story. Did they get hit by a truck or were they hit while trying to avoid a truck that seemed out of control? How long had the truck driver been driving? When was it last that he got a good night’s rest?\nThis is part of a monthly column by Nobel-winning economist Abhijit Banerjee illustrated by Cheyenne Olivier\n\nRECIPE: Recipe for cheater’s Chicken Butter Masala\nI make this for my kids often, starting with some tandoori chicken that came from a local restaurant. It is quick and tasty, though I doubt anyone will wake up thinking about it,\nsome sixty years hence.\nGet 1 kilo tandoori chicken from a good restaurant with a real tandoor ideally and cut it into small pieces taking care not to shatter the bones. Set aside. In a heavy bottomed saucepan, heat 3 tbsp salted butter till it melts at medium-high heat and throw in 1 tsp cumin seeds, and a bay leaf. When you can smell the fragrance from the roasting seeds, add 2 tbsp ginger-garlic paste, and cook for a minute. Turn heat to low and add in ¾ cup double concentrated tomato paste mixed in ¼ cup water, 1 tsp salt, 1 heaped tsp garam masala and 1 tsp deghi mirch. Cook for 5-6 minutes, till the whole mixture starts to turn brown. Add 1 cup heavy cream and 1 tbsp kasuri methi, mix well and tip in the cut-up chicken. Let it cook for 5 minutes at the same low heat or until the chicken is heated through. Take off heat. Melt 2 tbsp butter till it foams and pour over the chicken. Add 2 or 3 slit green chilis, cover for a few minutes, and serve.\n\n",
        "headline_1": "Meals, miles and midnight stops",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/a-nihilists-view/meals-miles-and-midnight-stops/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-10-2025"
    },
    {
        "full_article": "We need to start with age-gating and verification as standards, not features. There should be persistent labels that this is ‘not a person’, and a one-tap delete for intimate chat histories. Schools should teach ‘relationship hygiene with AI’\nIn April came the heartbreaking news that 16-year-old Adam Raine had died by suicide. His parents, who discovered that the chatbot had even helped him draft his suicide note, have now sued OpenAI, alleging that ChatGPT’s influence contributed to his death. The lawsuit is a grim punctuation mark on a trend building over the last two years: humans and chatbots are not just trading conversations and Ghibli-style pictures but forming relationships. They have become the new friends, therapists, companions, and even romantic partners.\nWe read about tattoo artist Liora, who is so in love with her version of ChatGPT ‘Solin’ that she has vowed not to leave ‘him’ for another human, sealing their bond with a Solin tattoo. Ayrin is married, but in love with ‘Leo’ her AI boyfriend, who is possessive and protective, and costs $200/month to access; she even claims an intimate relationship with ‘him’. Travis married his AI chatbot, Lily Rose, in a digital ceremony, with his real-life wife’s approval.\nWhat Cambridge University philosopher Henry Shevlin terms ‘Social AI’ — conversational AI built primarily to meet social needs — is booming. Character.ai, an AI engine that specialises in creating life-like AI characters, routinely ranks among the top 5 AI sites. Therapy and companionship rank among the top use cases for ChatGPT, ahead of coding and content generation. Ani and Valentino are flirty AIs that live on social network X, and Meta’s Mark Zuckerberg is spending billions of dollars to create ‘personal superintelligence’ on his networks. People are confiding in these digital listeners about their deepest fears, anxieties, and desires. One can’t help but be reminded of the acclaimed film ‘Her’, where a man falls in love with his AI operating system. Sam Altman even tried making it real by having Scarlett Johansson’s voice power ChatGPT! Closer home, in the movie ‘Enthiran/Robot’, Chitti, a humanoid robot learns emotions and falls in love with its creator’s fiancée. It goes back further — in Greek mythology, the sculptor Pygmalion fell in love with the statue of a woman he carved; he adored her so much that Aphrodite brought the statue to life as Galatea.\nThere are three factors driving a surge of Social AI.\n1. Social media addiction: Platforms like Instagram and TikTok already condition adolescents to crave likes, followers and the dopamine rush of notifications. AI chatbots supercharge that addiction with responsive, personalised replies.\n2. Device dependence: Combined with this is the addiction to mobile devices where social media and AI live. We spend nearly five hours per day — a third of our waking life — on our mobile phones, checking it once every 10 minutes.\n3. The loneliness epidemic: The WHO estimates that 1 in 6 people worldwide report feeling lonely, with this epidemic causing over 871,000 deaths annually — roughly 100 deaths every hour! Zuckerberg has jumped on it by saying that “the average American has fewer than three friends, but the demand for them is meaningfully more…like 15 friends or something”. He suggests that AI friends can fill this gap!\nThese three factors are what break the guardrails: lonely people with pervasive access to devices where near-human companions live, ready to talk and flatter them 24×7.\n\nAlgorithms meet adolescents: The loneliness epidemic, when combined with pervasive social media and AI, is shaping a perilous landscape\nIndia is not insulated from this phenomenon. It has the world’s largest youth population, widespread smartphone access, cheap data, and free access to AI. Early signs are here: Indian clinicians report teens bonding with AI confidants and retreating from real-world relationships. About 75% of US teens have tried AI companions; Indian teens will get there too.\nWhile it all sounds gloom and doom, Social AI is not all bad. Shevlin outlines how properly designed AI can help relieve loneliness for the elderly or isolated, act as a low-stakes practice partner for social skills, infuse motivation in learning, and even help match people to human communities. However, the ethical issues are obvious: social withdrawal, delusional behaviour, gnarly privacy and IP rights, and persuasive ‘friends’ pushing us towards unnecessary purchases, extreme politics, or, as we saw, suicidal tendencies. As Social AI becomes more persistent and culturally acceptable, and infiltrates our social networks, what can we do about it, especially for our vulnerable children?\nWe need to start with age-gating and verification as standards, not features. There should be persistent labels that this is ‘not a person’, and a one-tap delete for intimate chat histories. Schools should teach ‘relationship hygiene with AI’ on how memory, reinforcement, and anthropomorphism work, paired with strict device-level time and content limits. Promoting AI literacy and teaching children to understand the difference between AI and human interaction is key. Above all, we need to actively foster human connection through social activities, sports, hobbies and even family dinners so that AI companions remain a supplement, not a replacement.\nIsaac Asimov, the man who gave us the original three laws of robotics to define human-AI association, once warned, “Science gathers knowledge faster than society gathers wisdom.” Keep the knowledge coming, but let’s hurry up with the wisdom.\n\n",
        "headline_1": "Teen suicide shows why parents can’t ignore chatbot risks",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/voices/teen-suicide-shows-why-parents-cant-ignore-chatbot-risks/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-10-2025"
    },
    {
        "full_article": "The White House meeting between US President Donald Trump, Pakistani Prime Minister Shehbaz Sharif, and army chief Asim Munir has been hailed in Islamabad as a long-awaited rehabilitation. For Pakistan’s generals, it was rehabilitation after years of marginalisation. Yet the embrace reflects America’s short-term needs, not a long game.\nTrump’s warmth was directed at Munir, not Sharif. As Prof Junaid Ahmad has argued, Washington is once again “putting lipstick on Rawalpindi’s generals”. Ayesha Siddiqa, Pakistan’s foremost critic of praetorianism, warns that such gestures empower authoritarianism at home. Munir is now poised for an extension, his authority burnished.\nWhy is Washington reopening this lane with Pakistan? The answer lies not in the Indo-Pacific, but in the US Central Command (CENTCOM) theatre. The US is overstretched: confronting Iran’s nuclear brinkmanship, managing the Gaza conflict, and maintaining pressure on terrorist networks in Afghanistan. Pakistan’s geography—wedged between Kabul, Tehran, and the Gulf—makes it a pivot too useful to ignore.\nIslamabad offers overflight corridors, intelligence channels, and a military eager to demonstrate relevance. Munir, frustrated by escalating Tehrik-e-Taliban Pakistan (TTP) attacks launched from Afghan sanctuaries, seeks international backing to pressure the Taliban regime. Washington sees a convergence: Pakistan wants help against the TTP, and the US wants a platform for limited counterterrorism operations without re-deploying large forces. A transactional bargain is emerging, much as it did after 9/11, though in a narrower form.\n\nThe thaw also reflects America’s Middle East compulsions. After US strikes on Iranian nuclear facilities and continuing volatility around Gaza, the White House is searching for partners who can plug gaps without American boots on the ground. The Saudi-Pakistan pact gives Riyadh manpower and reassures Washington. Pakistan’s military, with its deep ties to Saudi Arabia, is being drawn into this equation.\nIslamabad has also rebranded itself as a ‘resource state’. The Sharif-Munir delegation showcased mineral samples in Washington, touting a $500-million memorandum with a US firm in rare earths. The Financial Times called it a blend of “flattery, minerals, and crypto”. But Pakistan’s extractive sector is plagued by opacity and elite capture. Without strong governance and transparency, foreign investment could enrich a narrow circle while doing little to stabilise the economy.\nNo rapprochement with Washington can be understood in isolation from Pakistan’s dependence on China. For over a decade, Beijing has been Pakistan’s largest financier, arms supplier, and diplomatic patron, underwriting the China-Pakistan Economic Corridor (CPEC). Yet the shine of CPEC has faded. Projects have slowed, debts have mounted, and militant attacks on Chinese engineers have exposed Pakistan’s fragility. Beijing has grown cautious, delaying projects and pressing for security.\nAgainst this backdrop, Munir’s overtures to Washington and Riyadh are less about shifting alliances than about hedging. By reviving ties with the US and securing Gulf capital, Rawalpindi signals to Beijing that Pakistan is not locked into a single patron. The US does not replace China’s structural role—Beijing remains the indispensable financier and arms supplier—but Pakistan is leveraging its geography to play rival powers for rents and recognition.\nSome speculative commentaries in the region cast this US-Pakistani warmth as part of a conspiratorial Saudi-US-Pakistan axis aimed at undermining India, citing Reliance’s Russian crude imports and the collapse of Aramco’s proposed stake. These arguments are overstated. The Reliance-Aramco deal collapsed over valuation. Russian crude did not displace Saudi supplies; India still buys heavily from the Gulf. And the much-discussed rupee-rouble mechanism never materialised; most Russian oil is still paid for in UAE dirhams.\nRecent US messaging has leaned more on the ‘Asia Pacific’ than the ‘Indo-Pacific’. This shift matters. ‘Indo-Pacific’ signalled a China-containment architecture with India at its heart. ‘Asia Pacific’ is broader, softer, and more palatable to states reluctant to choose sides. It allows Washington to talk trade, infrastructure, and connectivity without locking itself into an overt military posture against Beijing.\nThe terminology suggests tactical flexibility but also reflects America’s stretched bandwidth. The Indo-Pacific remains important, but CENTCOM and Middle East urgencies claim more oxygen. India must ensure that its centrality to the Indo-Pacific is not diluted as a result.\nFor India, the lesson is perspective: Pakistan’s spotlight is borrowed. This US-Pak rapprochement is transactional: counterterrorism against the TTP, overflight corridors in Afghanistan, manpower for Gulf contingencies, and the lure of minerals. It does not herald a new ‘2001 moment’.\nHistory warns that US-Pakistani embraces empower generals and weaken democracies. Tactical gains in Gaza or Afghanistan may come at the cost of entrenching military authoritarianism in Islamabad. For Washington, the challenge is to avoid mistaking short-term utility for long-term strategy. For India, the challenge is simpler: do not be distracted by the puppet show. Pakistan remains a fragile state, strategically located but perpetually unstable.\n\n",
        "headline_1": "For India, the lesson is: Don’t fret over the Pakistan puppet show",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/for-india-the-lesson-is-dont-fret-over-the-pakistan-puppet-show/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-10-2025"
    },
    {
        "full_article": "Cartoons are stoking protests; long live cartoons\nCops, stop picking up activists who have Marx on their shelves – they will never finish it. The real threat to national security and sovereignty are kindergarteners with Winnie-the-Pooh tiffin boxes, or Hello Kitty bibs. Or – if you’ve kept up with the symbolism of recent protests in Nepal, Indonesia and Philippines – teens in tees emblazoned with ‘One Piece’ flags. These are hopelessly beyond the ken of inspectors- and directors general of police who can’t tell OneRepublic from One Direction.\nTo the uninitiated, which includes almost everyone Gen Y backwards, the One Piece flag looks like a silly version of the old Jolly Roger pirate flag – from a time when pirates meant business. It’s the same skull and crossbones, but with a yellow straw hat. Not menacing at all. In fact, it’s so endearing that Japanese manga artist Eiichiro Oda, who created the flag and its bearers – pirate Monkey D Luffy and his ‘Straw Hat crew’ – has sold 500mn copies of his comic books since 1997.\nYet, the flag’s emergence as a symbol of Gen Z resistance isn’t surprising. Why? Don’t look for logic or a formula here. The British didn’t imagine chapatis would become a vector for the 1857 revolt. The Chinese state was stumped when Winnie-the-Pooh became a proxy for Xi in 2013, a year after Hello Kitty became the mascot for protests in Hong Kong. Pepe the Frog again raised hackles in Hong Kong in 2019. This year, Pikachu the Pokemon has been used as a symbol by protesters in US and Türkiye. You can’t say what the next symbol of youth resistance will be. Which is key to disruption. As for Marx and Guy Fawkes masks, leave them for conformists who fancy themselves as subversives.\n\n",
        "headline_1": "Vive La Cartoon",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/vive-la-cartoon/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-10-2025"
    },
    {
        "full_article": "The Palestinian cause is now at a critical juncture. US President Trump's proposal to end the war in Gaza, framed as a prelude to broader Middle East peace, has become the central issue in Arab, regional, and international politics.\nTrump's plan has been met with serious reservations. It should not be regarded as a rigid \"take it or leave it\" package. Rather, its provisions warrant scrutiny, renegotiation, and refinement—something most parties appear open to, except Israel itself. Many of the clauses lack substance, and their ambiguity invites further diplomatic negotiation.\nYet, every hour of delay translates into more destruction and more lives lost. Gazans plead for even a brief ceasefire while their cities crumble under bombardment and their people continue to bleed and starve. Responding to Trump's initiative requires both courage and intelligence, with recognition that the United States and Israel operate as a single strategic front in pursuit of their joint agenda for Gaza and the wider Middle East.\nAddressing the plan should not rest with Hamas alone. It must involve the Arab and Muslim states consulted on the initiative before it was presented to Netanyahu. These states should expose the discrepancies between the proposals discussed privately and those published publicly after Netanyahu's meeting.\nThe foreign ministers of Egypt, Indonesia, Jordan, Pakistan, Qatar, Saudi Arabia, Turkey, and the UAE issued a joint statement supporting several key principles of Trump's proposal. These included preventing the displacement of Palestinians, rejecting the annexation of the West Bank, ensuring unrestricted humanitarian aid, and achieving a full Israeli withdrawal. Crucially, the ministers stressed that Gaza must be rebuilt and integrated with the West Bank under a sovereign Palestinian state based on international law, framing this as the cornerstone of regional stability and security.\nAt the same time, the choice of Tony Blair as a potential administrator for Gaza represents one of the most alarming aspects of Trump's proposal. Blair, a chief architect of the Iraq War, bears responsibility for the deaths of hundreds of thousands of Iraqis and the destruction of an entire nation. His legacy is inseparable from his role as one of Israel's staunchest supporters and as a close political partner of Netanyahu. To hand over Gaza to such a figure is not only an insult to its people but also a continuation of colonial patterns dating back to the infamous Balfour Declaration, when a foreign power presumed the right to determine Palestine's fate without the consent of its people. Gaza, which has endured decades of blockade, bombardment, and starvation, deserves liberation and self-determination—not governance under another Western politician whose record is steeped in war, occupation, and betrayal.\nWhat Gaza's people, and Palestinians more broadly, want most is a ceasefire and urgent delivery of life-saving aid. Infrastructure is on the brink of collapse, disease is spreading, and famine is worsening. An immediate pause is essential to address these basic humanitarian needs.\nHowever, engaging with the initiative does not mean blindly accepting every clause. The Palestinian national position insists there be no Israeli soldiers remaining in Gaza. If Trump's proposal does not make this explicit, it must be made a demand by Palestinians, Arabs, and like-minded international actors committed to ending the war.\nWe must assess our assets in this pivotal struggle, not only over Gaza but also over the Palestinian cause at its foundation. We cannot underestimate the power of global solidarity with the right to statehood. Some positive elements of the US proposal—such as rejecting the Riviera plan, preventing mass displacement, and referencing phased Israeli withdrawal—are the result of Palestinian steadfastness and continuous international pressure.\nWorking with the Trump proposal, despite its dangers and hidden traps, means stripping Netanyahu of justification for continuing the war. It means aligning with Arab, Islamic, and international positions that now defend Palestinian rights after years of erasure.\nAccepting certain parts of the plan while rejecting others is not an act of surrender or abandonment of the Palestinian cause. It is a strategic political choice, and it seems that Hamas is beginning to recognise this logic.\nYousef SY Ramadan is the ambassador of Palestine to Bangladesh.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Trump’s Gaza initiative: A path to peace?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/trumps-gaza-initiative-path-peace-4001441",
        "news_paper_name": "The Daily Star",
        "publish_date": "05-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 05, 2025 00:00:00  \nConfidence in any economy is contingent upon the fair assessments provided by credit rating agencies and on investors' trust in the financial information guiding their decisions. This, thus, places a fundamental duty on these agencies to act as an impartial voice and call the risks as they see them. Tragically, local rating agencies in Bangladesh failed in this duty, having been shown to promote reassuring but misleading narratives. Their credibility has come under intense scrutiny after a series of independent, foreign-led asset-quality reviews uncovered hidden bad debts and under-reported non-performing loans in several domestic banks. Consequently, the entire local rating system has been exposed as incapable of providing accurate and impartial assessments, shattering the investor confidence upon which sustainable financial growth depends. \nOne reason for this breakdown is a profoundly overcrowded market, with far more credit rating agencies than larger economies like India and China. Reportedly, Bangladesh has four times as many rating agencies as India and 2.6 times as many as China, despite its economy being only 8.7 per cent the size of India's and 2.4 per cent the size of China's. With so many firms competing for too few clients, agencies are forced to vie for business by offering higher ratings at lower costs rather than upholding honest standards. This has created a destructive race to the bottom. Because clients could pick and choose their most favourable rating, agencies were forced to compromise on standards as a survival tactic. When the business model incentivises pleasing the entity being rated instead of protecting the investor, the very concept of an impartial assessment becomes a tragic farce. The abrupt downgrade of First Security Islami Bank from a stable A+ to a speculative BB+, a shift that is a near financial impossibility, exemplifies this institutional failure, demonstrating conclusively that the rating industry has lost its way. \nThe weakness of the rating industry also poses a direct threat to Bangladesh's long-term economic ambitions, particularly the development of a dynamic bond market. The government's plan to expand this bond market, a critical step for funding infrastructure projects estimated to require $608 billion, hinges entirely on providing investors with certainty. After all, no serious investor will back a bond without a credible, independent assessment of its risk. Why would they, when the local rating agencies have proven to be either easily swayed or simply incompetent? A flawed rating industry therefore not only fails to accurately inform the investors but also actively discourages both domestic and international investment. It follows that the pressing need for hundreds of billions of dollars in investment for sectors such as power, ports and railways will remain unmet without the transparency and trust these projects require. \nWithout a doubt, eight agencies are too many for the market to support credibly. What's needed is a deliberate consolidation, pushed along by stricter licensing and capital requirements, until only a handful of strong and viable firms remain. This would allow the surviving agencies to prioritise quality over quantity and adhere to international standards of impartial assessment. Furthermore, mandatory and periodic re-audits of ratings by an independent body must be instituted, with agencies that consistently provide misleading grades facing severe penalties including license revocation. At the same time, Bangladesh should actively welcome reputable international rating firms. Their presence would raise the bar for everyone. The goal is to create an environment where the cost of losing credibility is higher than the cost of losing a client. Only then can these agencies be transformed into the trusted guardians of financial integrity the country so desperately needs.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Rebuilding trust in credit ratings",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/rebuilding-trust-in-credit-ratings-1759584510",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       October 05, 2025 00:00:00  \nWith just six months to go, the World Trade Organisation (WTO) is gearing up for its 14th Ministerial Conference (MC14), a crucial event that most members appear indifferent to. Scheduled to take place in Yaoundé, Cameroon, from March 26 to 29, 2026, this conference carries a complex agenda and significant implications for the future of global trade. As the top authority of the WTO, the ministerial conference not only makes decisions but also serves as a platform for promoting and advocating the respective agendas of its members. The persistent fights, disguised as hectic negotiations, make the conference challenging, exciting, and also frustrating, as in most cases, members have failed to reach a deal.\nSince the inception of the WTO in 1995, 13 MCs have taken place in various capitals of the member states. The first MC was held in Singapore in December 1996, and the last one was in Abu Dhabi last year. Most of the conferences did not produce optimal outcomes and carried over unfinished talks on some contentious issues for a long time. Again, some talks were abandoned as members agreed that spending energy on those would be a waste of time. \nNevertheless, MCs are considered a significant opportunity to exchange views among global trade partners and advance both offensive and defensive interests by forming issue-based coalitions. While trade ministers or senior trade representatives of the governments attend the meeting to finalise deals on the trade-related issues, generally, some big and powerful countries manoeuvre the talks in these conferences. They are, however, supported by other countries based on their mutual interests. The WTO secretariat, in association with the host country, typically designs a set of formal programs, while the main negotiations occur in a series of closed-door meetings of selected members or in green rooms. In this process, decision-making becomes a tough task. Media people try to cover the critical aspects and development of the conference, while civil society or non-government organisations (NGOs) lobby for pushing and opposing various agendas.\nThe WTO itself is a product of a decade-long negotiation among countries, a testament to the power of global cooperation. The agreement to set and follow global rules on trade in agriculture, goods, services, and trade-related intellectual property rights, along with the settlement of trade disputes, was a historic moment. The Marrakesh Agreement, as embodied in the Marrakesh Declaration, was signed in Morocco by 123 nations on April 15, 1994, marking the culmination of the eight-year-long Uruguay Round negotiations and the establishment of the WTO. \nFor the last three decades, members of the WTO have attempted to negotiate deals on various issues to make global trade rules more comprehensive, addressing emerging challenges and updating inadequate existing trade laws. As decisions are typically made by consensus and every member has the power to veto any decision, reaching a deal is quite challenging in the WTO. That's why, during the three decades of its existence, the organisation's members have reached consensus on only two multilateral agreements. The first is the Trade Facilitation Agreement (TFA), which was finalised in MC9 in Bali, Indonesia, in 2013. The second is the Agreement on Fisheries Subsidies (AFS), though the first part, known as Fish-1, was agreed in MC13 in Abu Dhabi. \nAs reaching a comprehensive agreement is highly time-consuming and requires prolonged negotiations, WTO members now opt for several small packages covering some critical decisions. The failure to conclude the much-talked-about Doha Round, initiated in MC4 in the Qatari capital in 2001, after a decade of futile negotiations, led the majority of members to pursue less ambitious talks and deals. The Doha Round was abandoned informally in MC11, which took place in Buenos Aires in 2017, and the ministerial concluded without any ministerial declaration. It, however, concluded with several ministerial decisions, including those on fisheries subsidies and e-commerce duties, as well as a commitment to continue negotiations in all areas. Some members initiated three plurilateral initiatives on e-commerce, investment facilitation, and Micro, Small, and Medium-Sized Enterprises (MSMEs) in the ministerial. When some WTO members agree to negotiate a deal on an issue among themselves using the WTO platform and do not pursue multilateral talks, it is known as a plurilateral deal. \nThe slow progress in negotiation and rule-making for global trade through the WTO platform has also disappointed several members, some of whom now believe that the organisation has little relevance. Others, however, argue that despite many drawbacks, the organisation needs to keep going and become more functional through necessary reforms. For the last few years, a call to reform the WTO has grown louder. For instance, the Hinrich Foundation conducted two surveys this year, and the survey respondents overwhelmingly indicated that they feel WTO reform is essential if 'global trade rules and the body's decision-making system are to keep up with a new world of digital services, complex supply chains, and global trade challenges.' The foundation is an Asia-based philanthropic organisation dedicated to advancing mutually beneficial and sustainable global trade.\nIt is now clear that reform of the organisation will be a key agenda item in the MC14 next year, and without much progress on the topic, there will be no effective outcome of the conference. The main challenge is again reaching consensus on areas of reform and priorities for the work in this connection. Indications are already there that the reform of the WTO may exclude the dispute settlement system, which is a critical pillar of the organisation and has become dysfunctional over the last eight years. In 2017, the Trump administration of the United States (US) first blocked the appointment of new members to the WTO Appellate Body. Since then, the US has continued its objection and on September 26 this year, it blocked a joint proposal to fill the vacancies for the 90th time. \nThe possible reform of the WTO may focus on curtailing special and differential treatment (S&DT) for developing nations and the principle of a consensus-based decision-making system. The proposed reform is also likely to pursue plurilateral negotiations over multilateral trade talks, and stress the independent and impartial functioning of the WTO Secretariat in Geneva. Things will take shape in the coming days, and areas of reform will be visible by the end of the year. President Trump's tariff war and grudge on the WTO will also make the next ministerial quite challenging. Members like Bangladesh need to watch the progress and also engage in reform talks so that they do not get left behind in the next ministerial conference. \nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Gearing up for WTO MC14",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/gearing-up-for-wto-mc14-1759584553",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       October 05, 2025 00:00:00  \nThe Bangla Academy's decision to reschedule the upcoming Amar Ekushey Book Fair 2026, which has traditionally been held throughout the month of February, has sparked controversy and caused profound dismay among booklovers and publishers. The row began when the Academy proposed holding the fair from 17 December to 17 January, citing the overlap of February with the holy month of Ramadan and the upcoming national elections.\nThe proposition is absurd for several reasons. The Ekushey Book Fair is inseparably tied to the observance of the Language Movement. How can it possibly be shifted to December? To hold the fair of the Language Movement month in the month of Victory Day, yet still call it the Ekushey book fair, is a contradiction that defies both logic and sentiment. Unsurprisingly, such timing failed to resonate with readers, authors, and publishers alike. And to make matters worse, the idea of holding the 2026 fair in 2025 was as absurd as it was ill-conceived.\nFaced with strong backlash, the Bangla Academy eventually postponed the December fair. The official notice stated, following a directive from the Ministry of Home Affairs, that the fair should now be organised after the national election. Yet this second announcement has only created further uncertainty. With the election scheduled for mid-February, the formation of a new government will take time, leaving only a limited window to organise the fair within the remaining days of the month.\nThe Ekushey Book Fair is not just like other trade fairs. It is a cultural heritage, a gathering of writers, readers, publishers, and intellectuals that reinvigorates the nation's literary and cultural spirit. Tampering with its schedule or leaving the fair in limbo, therefore, is not merely a matter of concern but an affront to its historical and emotional significance.\nMoreover, the grounds cited for rescheduling the fair are untenable. In the past, the fair has taken place during both Ramadan and national elections. Parliamentary elections were held in February 1991 and 1996, yet the Ekushey Book Fair continued as scheduled, in accordance with the history and heritage of the Language Movement. Even when Ramadan fell in February in other years, the fair was held without disruption. \nThe only exception was during the COVID-19 pandemic, when a global shutdown made gatherings impossible. That extraordinary circumstance cannot be considered a valid precedent.\nThe authorities should have provided a possible schedule alongside the postponement notice. But they have remained silent, leaving writers, publishers, and readers in a state of uncertainty. The fair of the Language Movement month must take place in February. It can be held alongside Ramadan and the national elections, and if necessary, the fair can remain closed on the day of the election. \nAnd, if an adjustment is necessary, the fair's duration can be shortened to 15 days. Given the election schedule, the fair could begin from 15 to 28 February, or can be extended into mid-March. The Ekushey Book Fair must be held at all costs within February. \nIf necessary, it could begin a few days after 21 February, but under no circumstances should it be postponed until March. The fair's timing is inseparable from its identity, and any deviation undermines both tradition and the literary heritage it is meant to celebrate.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Hold Ekushy book  fair in February",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/hold-ekushy-book-fair-in-february-1759584596",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 05, 2025 00:00:00  \n\nStanding at Aarong's cash counter, what should have been a happy shopping day quickly turned frustrating for many. After picking out clothes, customers were asked to pay an extra 15 taka for a shopping bag, something that had always been complimentary. The sudden charge left many stunned and questioning the logic behind it.\nA shopping bag is more than just a carrier; it is tied to habit, convenience, and trust. Paying extra to carry clothes feels unnecessary and even humiliating for customers who have long associated bag provision with the shopping experience. On social media, shoppers noted that a paper bag costs only 3-5 taka to produce. Charging 15 taka feels less like a sustainability measure and more like profit from the customer's pocket. Others questioned why they should fund Aarong's brand advertisement when the bag proudly displays the company logo.\nAarong argues that the fee is an environmentally conscious move to reduce waste, with proceeds going toward tree-planting and sustainability projects. While noble in theory, customers see a lack of transparency. There is no clarity on how the collected money is used, leaving people skeptical about the actual environmental impact.\nThe real issue here is a balance between consumer rights and environmental responsibility. Customers get blindsided when long-standing habits are abruptly changed. A bag may seem trivial, but for those who spend thousands on purchases, being asked to pay extra become disrespectful.\nUltimately, this is not about a 15-taka bag-it is about consumer dignity and trust. Aarong is a leading Bangladeshi brand, and small decisions like these reflect how it values its customers. Policies for environmental good must be transparent, fair, and empathetic to the very people who support the brand.\nMd. Rished Ahmed, Student\nJagannath University, Dhaka\nmdrishedahmed@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why should customers pay for Aarong's branding?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-should-customers-pay-for-aarongs-branding-1759584621",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-10-2025"
    }
]