[
    {
        "full_article": "The Supreme Court’s direction to the CBI to conduct a pan-India investigation into cyber-crimes, and “digital arrest” scams in particular, might seem extraordinary, as such directions normally require State government consent. But by doing so, the Court has acknowledged the severity of the menace that transcends State jurisdictions and boundaries. The Court’s prioritisation of the “digital arrest” scam — fraudsters impersonate police or government officials in a video call, falsely accuse victims of crimes, and pressure them to transfer money to avoid arrest — is fully warranted. The government has estimated that this scam, which often targets senior citizens, has resulted in losses exceeding ₹3,000 crore. The Court has asked the CBI to target not just the scammers but also banking officials who facilitate the creation of “mule” accounts. This is necessary as these scams depend on a malleable financial architecture and therefore require the intervention of agencies such as the RBI, which has also been instructed by the Court to employ Artificial Intelligence and Machine Learning to trace the “layering” of proceeds through multiple accounts. The Court has also asked online intermediaries to cooperate with the CBI, invoking the IT Rules 2021. The Court is also right in asking the CBI to investigate other scams such as investment schemes and part-time job scams, subsequently.The severity of cyber frauds, as National Crime Records Bureau data indicate, has risen significantly. However, while the judiciary and domestic policing can address the symptoms within India, the problem has another dimension — it is also transnational. The burgeoning of “scam centres” — compounds where trafficked workers, unable to escape due to violence, confiscated documents or debt bondage, are forced to run online fraud operations — in conflict-ridden zones of Southeast Asia suggests that the solution requires robust international diplomacy. The U.S., for instance, has established a Scam Center Strike Force to tackle the issue. Furthermore, Myanmar remains a hotbed for these operations, primarily because the illegally ruling junta benefits from taxing the proceeds of such crimes. Tackling this requires moving beyond bilateral requests. New Delhi must act in cohesion with ASEAN and the UN to sanction the illegal regime and cut off the financial lifelines of these modern-day slavery sweatshops. Domestically, the battle must also be fought on the grounds of digital literacy and capacity. As daily life and governance become increasingly digitised, there remains a glaring deficit in cyber awareness among the population. States, local administrations, and the RBI must launch widespread awareness campaigns. Simultaneously, there is an urgent need to upgrade the digital capabilities of State police. Published - December 05, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        arrest\n                    \n                            /                      \n                        \n                        fraud\n                    \n                            /                      \n                        \n                        police\n                    \n                            /                      \n                        \n                        crime\n                    \n                            /                      \n                        \n                        Artificial Intelligence\n                    \n                            /                      \n                        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        computing and information technology\n                    \n                            /                      \n                        \n                        cyber crime\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        Myanmar\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        ASEAN\n                    \n                            /                      \n                        \n                        United Nations",
        "headline_1": "Cyber crackdown: On the investigation into cyber-crime",
        "headline_2": "Tackling digital arrest scams also needs global action",
        "link": "https://www.thehindu.com/opinion/editorial/cyber-crackdown-on-the-investigation-into-cyber-crime/article70358575.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-12-2025"
    },
    {
        "full_article": "The winter session of Parliament, that began on December 1, will have 15 sittings over a period of 19 days, and will conclude on December 19. The government maintains that it is willing to discuss any issue, but Prime Minister Narendra Modi has warned that Parliament should not be used for theatrics. The Opposition has pointed out that this is one of the shortest ever winter sessions, and Leader of Opposition in the Lok Sabha Rahul Gandhi has said that the government excludes him from the country’s diplomatic engagements with foreign dignitaries, which is a deviation from the convention. Though there is no notable improvement in the hostile relationship between the government and the Opposition, the Vice-President of India, C.P. Radhakrishnan, is expected to ease some tension, in his role as Rajya Sabha Chairman. The government has lined up an ambitious legislative agenda, which has considerable political ramifications, with a number of 14 Bills in total. The Jan Vishwas (Amendment of Provisions) Bill, 2025, is one major piece of legislation that, as its Hindi title suggests, seeks to simplify the criminal justice system. The Higher Education Commission of India Bill, 2025, seeks to change the structure of higher education regulators such as the UGC. The Centre’s unilateralism in the sector remains a bone of contention with States, and those issues are likely to be raised by the Opposition. The National Highways (Amendment) Bill, the Atomic Energy Bill, and the Arbitration and Conciliation (Amendment) Bill are some of the items on the legislative agenda. Finance Minister Nirmala Sitharaman has introduced the Health Security se National Security Cess Bill in the session, which repackages an ongoing cess on tobacco products.Both Houses are also scheduled to discuss a motion on electoral reforms, in the background of the SIR of electoral rolls and debate the national song Vande Mataram to mark the 150th year of its composition. The SIR debate is expected to see the divergent views of the BJP and the Opposition with regard to electoral reforms. For the ruling party, enforcing a countrywide synchronised election schedule is a priority, while the Opposition is agitated over suspected malpractices in the preparation of electoral rolls and conduct of the polls. The Opposition has also sought debates on the national security situation after the Delhi blasts, farmers’ problems in the background of concluded and ongoing trade negotiations, price rise, air pollution and use of federal agencies against political opponents. Both sides should use the session as an opportunity to reduce disagreements and clarify issues of governance. Published - December 05, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        parliament\n                    \n                            /                      \n                        \n                        Parliament proceedings\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        Rajya Sabha\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        tobacco\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        crime, law and justice\n                    \n                            /                      \n                        \n                        road transport\n                    \n                            /                      \n                        \n                        nuclear power\n                    \n                            /                      \n                        \n                        securities\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        act of terror\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        air pollution",
        "headline_1": "​Freeze and thaw: On the winder session of Parliament",
        "headline_2": "Parliament should not be reduced to a political stage",
        "link": "https://www.thehindu.com/opinion/editorial/freeze-and-thaw-on-the-winder-session-of-parliament/article70357837.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-12-2025"
    },
    {
        "full_article": "Electoral politics is a zero-sum game, and not such a sweet deal after all \nWhen people talk politics to me and ask whether I’m pro-govt or anti-govt, pro- opposition or anti-opposition, I ask them how much they like jalebis. \nWinston Churchill – arch-imperialist, engineer of the Great Bengal Famine that claimed millions of lives, and loathsome specimen of the inhuman race – got it right for once when he said that democracy is the worst form of govt except for all the others that have been tried from time to time. \nDemocracy is not perfect, and its biggest imperfection is democracy itself. Democracy is founded on the elective principle of choice between govt and opposition. This necessitates democracy to be a binary system. A zero-sum game in which one side’s win can result only from another side’s loss. \nComputers operate on a binary system. A computer’s response to an input can be either 0 or 1. It cannot be both at the same time. \nParliamentary democracy makes us choose between govt and opposition or anti-govt, between zero and one. We can’t choose both together. \nBut unlike computers, we are not programmed to be binary entities. We might sometimes want zero and sometimes one, and sometimes both zero and one at the same time. \nThat’s where jalebis come into it. In his The Story of Civilisation, CEM Joad,  addressing his youthful readership, asked if one would be happy to eat only treacle toffee, assuming that it was one’s favourite food, all the time. And of course the answer is no. \nJoad said civilisation is based on the Aristotelian Golden Mean, the Buddha’s Middle Path, which lies between all treacle toffee and no treacle toffee at all, between all zeros and all ones, between opulence and destitution, between all govt and no govt, all opposition or no opposition.\nI like jalebis, but not all the time. I like daal-roti as well, or a slice of pizza. Similarly, there are times when I agree with govt and times when I agree with opposition. Does that make me a split personality, or just a split voter? \nSo when I’m asked about my politics, I say I like jalebis, but not all that much…\n\n",
        "headline_1": "Jalebis and democracy",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/jalebis-and-democracy/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-12-2025"
    },
    {
        "full_article": "China’s tax on condoms won’t make Chinese have more kids. Communist patriarchy can’t even see women’s POV\nSeriously? A tax on condoms? Yup, that’s what Chinese authorities are gifting folks this new year. The laughable logic is that this will make having kids less expensive than not having them. Obviously not, even if high costs of raising children are a key reason for China’s plummeting birth rate. Because anybody whose pocket protests at paying a tax on condoms, will hardly welcome paying the much, much higher price of bringing up baby. Maybe it betrays how frustrated and desperate govt is getting. In the decade since it ended the one-child policy, people have resisted all its go-forth-and-multiply bait. \nInstead, marriage registrations have halved. Remember that in China, like India, social norms mean that most children are still born in wedlock. And like a lot of other countries, China’s response to the decline of marriage and birth rates is to pile up the pressure on women. Given how central women’s high labour force participation rate (60%) has been to the Chinese economic miracle, nobody is quite sending them to the kitchen. But hey, women, how about just doing a job instead of chasing a career – this is what a lot of local govt policies and employers are ‘suggesting’ to women. It’s all horribly patriarchal, but pretends as if the crux of patriarchy isn’t that women aren’t the primary decisionmakers. Several govts fail at telling men to share childcare & domestic chores, reduce work hours & take paternity leave. China’s communists may be worse because there are no women among party bosses: there are none in the politburo or standing committee. \nIn richer China, in megacities like Shanghai, couples who are refusing to have children are even more out of CCP’s mindreach. DINKs, double income no kid pairs, are living up their arty-party lifestyles. Why not? It’s their choice. Ordering that babies be made is impossible – even in China. \n\n",
        "headline_1": "Commies & Babies",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/commies-babies/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-12-2025"
    },
    {
        "full_article": "IndiGo had two years to prepare for new pilot rostering rules. Why didn’t it do so, is the question\nThursday was the third day of IndiGo flight disruptions that left lakhs of flyers stranded, often without assistance. There were many social media complaints of passengers being kept waiting at airports for over 10 hours, with no clarity on when their flight would take off. While winter normally affects flight schedules, weather is not the chief cause of IndiGo’s troubles. Reports say the airline – India’s largest, with 61% market share – is struggling with staff issues. Specifically, it has flown into a crew shortage as a result of new rostering rules that were notified last year, and had to be implemented – after several extensions – by Nov 1.\nThe new rules were meant to reduce pilot fatigue, thereby improving flight safety. They increased the weekly rest for pilots, reduced their daily and fortnightly duty hours, besides the number of night landings allowed. It was clear that without careful rostering, or hiring more pilots, airlines would face difficulties. IndiGo seems to have overlooked this. Almost two-thirds of its flight cancellations last month were due to crew constraints. But instead of quickly remedying the situation, it has allowed it to get out of hand. Its on-time performance slipped from 84% in Oct to 68% in Nov, and just 35% on Dec 2.\nIt’s a tough time for IndiGo, but our sympathies are entirely with its stranded passengers. In a large country like India, aviation is not just any industry. It’s a lifeline, key to the swift movement of people and goods. People who have business meetings in distant places, job interviews, medical appointments, family emergencies, holiday bookings, etc. India is the third largest aviation market now, and growing fast, but for most Indians, flying is not an easy choice. On average, a ticket in India is worth 17 days’ wages – for an American, it’s only worth 1.1 days’ work. Even in China, according to IATA, the average plane ticket is worth 3.7 days’ average wages.\nThe high cost is largely due to India’s steep tax on aviation fuel. Regardless, airlines have a duty to not leave their customers in the lurch. Now that the state has exited aviation, leaving the field almost entirely – 91% market share – to two players, it is up to them to ensure the country’s air traffic keeps moving punctually. Winter has just started and other problems lie ahead. IndiGo must fix its rostering at the earliest to avoid another crisis.\n\n",
        "headline_1": "IndiNoGo",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/indinogo/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-12-2025"
    },
    {
        "full_article": "Neighbourhood dogs protect an abandoned newborn. Something in us is deeply drawn to such stories \nIt’s a few weeks to Christmas but something very Christmassy has happened. A newborn was abandoned near a toilet in Bengal’s Nabadwip town. Nothing merry about this. But a ring of neighbourhood dogs circled the baby boy, keeping guard until a resident took over at dawn. As she said, those dogs, the ones we often chase away, did what many humans wouldn’t. \nHow we treat those who cannot protect themselves is, of course, a fundamental measure of our society’s health. This is why stories of abandoned children finding an unexpected caretaker move us so much. And in this scenario, when it is an animal that turns up as the protector, the moral actor, there is a further impact: an inversion of the presumed superiority of humans over non-humans. Mowgli is perhaps the most storied such child today – created by Rudyard Kipling, raised by wolves in an Indian jungle, taught by Baloo the bear and Bagheera the panther. But his lineage is long. For example, Romulus and Remus, legendary founders of Rome, were nursed by a she-wolf. As these stories are passed on from one generation to another, so are their question marks on human exceptionalism.\nSpecifically in India, ‘found’ children being raised into greatness is a powerful trope. In Mahabharat, a charioteer’s family rescues a child from the Ganga, and he becomes the noble warrior Karna. In Ramayan, King Janak finds a child in the field, and she becomes the noble Sita. In blockbuster Baahubali, this finding is the foundational scene. It’s actually impossible to separate the pull of JK Rowling’s Harry Potter, Shekhar Kapur’s Mr India, Salman Rushdie’s Saleem Sinai, Sarat Chandra Chattopadhyay’s Lalita…from the orphan archetype. Maybe because of the abandonment anxiety deep within us. Narratives that flip the script and bring strangers to the rescue, promise that the world is less cruel than we fear.\n\n",
        "headline_1": "UnCruel Night",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/uncruel-night/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-12-2025"
    },
    {
        "full_article": "Nothing reveals the story of why we failed to institutionalise democracy in Bangladesh better than our failure to build an independent judiciary. Though it is clearly stated in our constitution, it took us 53 years or so to lay its final foundation stone. What edifice we will build on this foundation lies in our future.\nWith so many things we have criticised the interim government for, the separation of the judiciary is one area where it deserves our praise. Without a separate secretariat under the authority of the chief justice—for which an ordinance has been recently issued—the judiciary would never have come out of the dominance of the executive branch, and especially of the law ministry, which resulted in the total destruction of the legal system in the country. Thanks are due to Prof Yunus, the head of the government, and Asif Nazrul, the law adviser. Praise must also be extended to the current chief justice, whose relentless work behind the scenes brought about the present reality.\nWhat must not be overlooked is that none of our democratically elected governments—led by Khaleda Zia and Sheikh Hasina—or the military governments of General Ziaur Rahman and General H M Ershad did anything to set up an independent judiciary.\nThree events—one judgment (1999), one initiative by a caretaker government (Fakhruddin Ahmed, 2007), and another by the present interim government (Prof Yunus, 2025)—have finally removed all the legal hurdles and paved the way for the establishment of an independent judiciary.\nIn 1995, Md Masder Hussain, then a district judge, on behalf of 441 subordinate judges, lodged a petition challenging government control over recruitment, transfer, placement, promotion, etc of judges. On May 7, 1997, the High Court delivered a judgment with eight directives. The government appealed and the Appellate Division delivered a historic verdict on December 2, 1999, outlining 12 directives. The judgment recommended the creation of a separate judicial service; establishment of a judicial service commission; separate service rules under Article 115 of the constitution; a judicial pay commission; financial and administrative autonomy to reduce executive interference in the judiciary, etc. This was, however, not followed through properly.\nIn 2007, during the caretaker government headed by former Bangladesh Bank governor Fakhruddin Ahmed, the long-awaited steps to set up the Judicial Service Commission, the judicial service rules, and the Judicial Pay Commission were taken. On November 1, 2007, the caretaker government formally separated the lower judiciary from the executive, as a major part of implementing the 1999 Appellate Division verdict. But the dream of a full separation remained elusive.\nOn November 30, 2025, the current government issued the Supreme Court Secretariat Ordinance, formally establishing a separate secretariat for the judiciary, the most vital of steps for an independent judiciary.\nSo why did it take 53 years to do something so clearly spelt out in Part II of the constitution under the Fundamental Principles of State Policy, that \"the State shall ensure the separation of the judiciary from the executive organs of the State\"?\nThere are two basic reasons: first, our political culture of non-accountability and, second, a bureaucratic stranglehold that never allows the growth of independent institutions, especially those that can question their authority.\nFrom the start, we favoured a powerful government and brought in a constitution in which the distribution of power among the three organs of the State—the legislature, judiciary, and executive—favoured the last. We misinterpreted Lincoln's dictum of a \"government of the people, by the people and for the people\" to mean that as long as a government is elected, whatever it does reflects the \"will\" of the people and must therefore be allowed a free hand in running public affairs. In forming a powerful government, we missed the chance for an accountable one.\nAs for the legislative branch, from the very start, we did not allow it to evolve as an independent institution. It has always acted as a rubber stamp of the majority party in parliament. The fact that we never separated the role of the Leader of the House from that of the head of government—the prime minister—brought the House directly under the control of the latter.\nFirst in Pakistan and later in Bangladesh, Quaid-e-Azam Mohammad Ali Jinnah and Bangabandhu Sheikh Mujibur Rahman, founders of the two states respectively, chose to occupy the highest executive office. This made the legislature totally subservient to the head of government. In both Jinnah's and Mujib's cases, the same person held the positions of Leader of the House, head of the government, and head of their party. This did not provide the opportunity for the House to emerge with any real degree of independence. In Pakistan's case, Jinnah chose to be governor-general—the post that Lord Mountbatten had held—instead of being prime minister, as Nehru did in India, thus diminishing the prospect of the rise of a parliamentary system of government in Pakistan for which the struggles continue even today.\nMujib, on the other hand, opted to be prime minister—although he was president of the government-in-exile—and thereby shifted the focus to the elected House. However, he did not show the foresight to appoint a separate Leader of the House and a different party president. Combining the three posts—prime minister, leader of the House, and party chief—created a lethal convergence of power that inevitably led to centralisation in governance that proved disastrous and found its ultimate expression under Sheikh Hasina.\nThe role of the Speaker was always that of a lackey rather than an independent manager of parliamentary proceedings. If we examine the type of individuals who were \"appointed\" as Speakers, it becomes clear that none had either the personality or the intention to uphold the interests of the House above those of the ruling party, and especially the prime minister. Most of them owed their positions to the PM—in the case of Shirin Sharmin, the last of them, she was not even an elected MP but a chosen one from the reserved seats for women—and hence they tended to serve the chief executive rather than the highest seat of law-making.\nAs for elected MPs, they rarely gave importance to the voters who elected them after the polls. Instead, their allegiance shifted almost entirely to the party that nominated them. This was due to the perks, development funds, and various executive powers that came only from the ruling party and government, and not from voters, resulting in further erosion of the legislature.\nIt was the judiciary that had some chance of keeping the executive accountable, and hence everything was done to clip its wings in every way possible. Here, the role of bureaucrats was critical. Not only did they act on their own to subvert the rise of an independent judiciary, but they also advised politicians that such an institution would pose a threat to the government's freedom to act.\nThere is also the fact that members of the judiciary itself, both at junior and higher levels, contributed to its subservience. There is not a single instance of a judge resigning in protest against the misuse of the justice system. On the contrary, several examples show that the judiciary, far from resisting, actually welcomed executive interference. Through denial of bail, jailing dissenters, permitting the misuse of remand, not questioning the merit of frivolous cases at the very outset, and not upholding an individual's right to liberty and protection from legal harassment, members of the judiciary often allowed the executive to flaunt its power and intimidate the people. They conveniently, and sometimes self-servingly, forgot that the law exists for justice. When its application compromises justice, a judge must opt for justice, not an interpretation that serves the government over citizens.\nThe law, for example, clearly states that only one case may be lodged for a particular crime, yet dozens—sometimes hundreds—were permitted. Why did the judiciary never question this? When denying bail, the court rarely seems to reflect on the fact that a person's liberty, guaranteed by the constitution, is being taken away. The misuse of remand barely enters a judge's mind. The handling of cases involving political opponents of past governments stands as the most shameful abdication of the courts' role. Regrettably, elements of this pattern remain even today, which we hope will soon cease.\nThe instances of naming hundreds of accused and, in many cases, arresting them without a shred of evidence have reduced the image of the judiciary to that of an extension of government. The judiciary may argue that these are abuses by law enforcement agencies and fall outside its purview. But when the misuse and abuse of the law denigrate the judiciary as a whole, should it not publicly condemn such practices or urge the government to stop them? The higher judiciary, especially the chief justice, can and should express such views. The moral and ethical values of their profession oblige this role.\nThe point we wish to emphasise is that even after all the rules are passed and judicial independence is formally guaranteed, its actual implementation will require moral courage from judges themselves. They must adhere to the spirit of dispensing justice, rather than just mechanically interpreting the law, and certainly not serving the executive branch or the \"privileged accused.\" Under various legal loopholes, cases remain pending for years. The misery this causes for the poor, ordinary people, and the amount of money and time they have to spend to appear at each hearing, seems to elicit little concern from our judges.\nSo, judges, especially those of the High Court and the Appellate Division, must always uphold the supremacy of the judiciary and never do anything that directly or indirectly denigrates this revered institution. We think the most shameful insult that the higher judiciary inflicted upon itself was when five Appellate Division judges stood on their knees instead of their feet in compliance with the wishes of the then prime minister to oust a sitting chief justice, SK Sinha. The reason? Because he refused, on constitutional grounds, to do what Sheikh Hasina wanted. Instead of standing with the chief justice, they declared that they would henceforth not work with him. The credibility and prestige of the Appellate Division stood shattered.\nAn immediate test of the coming elected executive will be how quickly and faithfully it passes into law the elements of judicial independence that have so far been put in place through ordinances. We also expect that future MPs will demonstrate greater respect for their voters, and not merely engage in habitual genuflection to their party, especially to its chief.\nWith the final guaranteeing of judicial independence, we hope this vital institution of modern civilisation will finally emerge with the glory and prestige it deserves by serving the people rather than the government of the day.\nIf the executive operates within its limits, the legislature—especially MPs— restrains itself to build a transparent and accountable governance framework instead of advancing partisan interests or chasing so-called development projects, and the judiciary truly distinguishes itself in the service of accountability and justice for all, especially the poor, then—and only then—will we have a real chance to build a genuine democracy in this beloved country of ours.\nMahfuz Anam is the editor and publisher of The Daily Star.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The dream of an independent judiciary",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/the-third-view/news/the-dream-independent-judiciary-4050826",
        "news_paper_name": "The Daily Star",
        "publish_date": "05-12-2025"
    },
    {
        "full_article": "Nothing reveals the story of why we failed to institutionalise democracy in Bangladesh better than our failure to build an independent judiciary. Though it is clearly stated in our constitution, it took us 53 years or so to lay its final foundation stone. What edifice we will build on this foundation lies in our future.\nWith so many things we have criticised the interim government for, the separation of the judiciary is one area where it deserves our praise. Without a separate secretariat under the authority of the chief justice—for which an ordinance has been recently issued—the judiciary would never have come out of the dominance of the executive branch, and especially of the law ministry, which resulted in the total destruction of the legal system in the country. Thanks are due to Prof Yunus, the head of the government, and Asif Nazrul, the law adviser. Praise must also be extended to the current chief justice, whose relentless work behind the scenes brought about the present reality.\nWhat must not be overlooked is that none of our democratically elected governments—led by Khaleda Zia and Sheikh Hasina—or the military governments of General Ziaur Rahman and General H M Ershad did anything to set up an independent judiciary.\nThree events—one judgment (1999), one initiative by a caretaker government (Fakhruddin Ahmed, 2007), and another by the present interim government (Prof Yunus, 2025)—have finally removed all the legal hurdles and paved the way for the establishment of an independent judiciary.\nIn 1995, Md Masder Hussain, then a district judge, on behalf of 441 subordinate judges, lodged a petition challenging government control over recruitment, transfer, placement, promotion, etc of judges. On May 7, 1997, the High Court delivered a judgment with eight directives. The government appealed and the Appellate Division delivered a historic verdict on December 2, 1999, outlining 12 directives. The judgment recommended the creation of a separate judicial service; establishment of a judicial service commission; separate service rules under Article 115 of the constitution; a judicial pay commission; financial and administrative autonomy to reduce executive interference in the judiciary, etc. This was, however, not followed through properly.\nIn 2007, during the caretaker government headed by former Bangladesh Bank governor Fakhruddin Ahmed, the long-awaited steps to set up the Judicial Service Commission, the judicial service rules, and the Judicial Pay Commission were taken. On November 1, 2007, the caretaker government formally separated the lower judiciary from the executive, as a major part of implementing the 1999 Appellate Division verdict. But the dream of a full separation remained elusive.\nOn November 30, 2025, the current government issued the Supreme Court Secretariat Ordinance, formally establishing a separate secretariat for the judiciary, the most vital of steps for an independent judiciary.\nSo why did it take 53 years to do something so clearly spelt out in Part II of the constitution under the Fundamental Principles of State Policy, that \"the State shall ensure the separation of the judiciary from the executive organs of the State\"?\nThere are two basic reasons: first, our political culture of non-accountability and, second, a bureaucratic stranglehold that never allows the growth of independent institutions, especially those that can question their authority.\nFrom the start, we favoured a powerful government and brought in a constitution in which the distribution of power among the three organs of the State—the legislature, judiciary, and executive—favoured the last. We misinterpreted Lincoln's dictum of a \"government of the people, by the people and for the people\" to mean that as long as a government is elected, whatever it does reflects the \"will\" of the people and must therefore be allowed a free hand in running public affairs. In forming a powerful government, we missed the chance for an accountable one.\nAs for the legislative branch, from the very start, we did not allow it to evolve as an independent institution. It has always acted as a rubber stamp of the majority party in parliament. The fact that we never separated the role of the Leader of the House from that of the head of government—the prime minister—brought the House directly under the control of the latter.\nFirst in Pakistan and later in Bangladesh, Quaid-e-Azam Mohammad Ali Jinnah and Bangabandhu Sheikh Mujibur Rahman, founders of the two states respectively, chose to occupy the highest executive office. This made the legislature totally subservient to the head of government. In both Jinnah's and Mujib's cases, the same person held the positions of Leader of the House, head of the government, and head of their party. This did not provide the opportunity for the House to emerge with any real degree of independence. In Pakistan's case, Jinnah chose to be governor-general—the post that Lord Mountbatten had held—instead of being prime minister, as Nehru did in India, thus diminishing the prospect of the rise of a parliamentary system of government in Pakistan for which the struggles continue even today.\nMujib, on the other hand, opted to be prime minister—although he was president of the government-in-exile—and thereby shifted the focus to the elected House. However, he did not show the foresight to appoint a separate Leader of the House and a different party president. Combining the three posts—prime minister, leader of the House, and party chief—created a lethal convergence of power that inevitably led to centralisation in governance that proved disastrous and found its ultimate expression under Sheikh Hasina.\nThe role of the Speaker was always that of a lackey rather than an independent manager of parliamentary proceedings. If we examine the type of individuals who were \"appointed\" as Speakers, it becomes clear that none had either the personality or the intention to uphold the interests of the House above those of the ruling party, and especially the prime minister. Most of them owed their positions to the PM—in the case of Shirin Sharmin, the last of them, she was not even an elected MP but a chosen one from the reserved seats for women—and hence they tended to serve the chief executive rather than the highest seat of law-making.\nAs for elected MPs, they rarely gave importance to the voters who elected them after the polls. Instead, their allegiance shifted almost entirely to the party that nominated them. This was due to the perks, development funds, and various executive powers that came only from the ruling party and government, and not from voters, resulting in further erosion of the legislature.\nIt was the judiciary that had some chance of keeping the executive accountable, and hence everything was done to clip its wings in every way possible. Here, the role of bureaucrats was critical. Not only did they act on their own to subvert the rise of an independent judiciary, but they also advised politicians that such an institution would pose a threat to the government's freedom to act.\nThere is also the fact that members of the judiciary itself, both at junior and higher levels, contributed to its subservience. There is not a single instance of a judge resigning in protest against the misuse of the justice system. On the contrary, several examples show that the judiciary, far from resisting, actually welcomed executive interference. Through denial of bail, jailing dissenters, permitting the misuse of remand, not questioning the merit of frivolous cases at the very outset, and not upholding an individual's right to liberty and protection from legal harassment, members of the judiciary often allowed the executive to flaunt its power and intimidate the people. They conveniently, and sometimes self-servingly, forgot that the law exists for justice. When its application compromises justice, a judge must opt for justice, not an interpretation that serves the government over citizens.\nThe law, for example, clearly states that only one case may be lodged for a particular crime, yet dozens—sometimes hundreds—were permitted. Why did the judiciary never question this? When denying bail, the court rarely seems to reflect on the fact that a person's liberty, guaranteed by the constitution, is being taken away. The misuse of remand barely enters a judge's mind. The handling of cases involving political opponents of past governments stands as the most shameful abdication of the courts' role. Regrettably, elements of this pattern remain even today, which we hope will soon cease.\nThe instances of naming hundreds of accused and, in many cases, arresting them without a shred of evidence have reduced the image of the judiciary to that of an extension of government. The judiciary may argue that these are abuses by law enforcement agencies and fall outside its purview. But when the misuse and abuse of the law denigrate the judiciary as a whole, should it not publicly condemn such practices or urge the government to stop them? The higher judiciary, especially the chief justice, can and should express such views. The moral and ethical values of their profession oblige this role.\nThe point we wish to emphasise is that even after all the rules are passed and judicial independence is formally guaranteed, its actual implementation will require moral courage from judges themselves. They must adhere to the spirit of dispensing justice, rather than just mechanically interpreting the law, and certainly not serving the executive branch or the \"privileged accused.\" Under various legal loopholes, cases remain pending for years. The misery this causes for the poor, ordinary people, and the amount of money and time they have to spend to appear at each hearing, seems to elicit little concern from our judges.\nSo, judges, especially those of the High Court and the Appellate Division, must always uphold the supremacy of the judiciary and never do anything that directly or indirectly denigrates this revered institution. We think the most shameful insult that the higher judiciary inflicted upon itself was when five Appellate Division judges stood on their knees instead of their feet in compliance with the wishes of the then prime minister to oust a sitting chief justice, SK Sinha. The reason? Because he refused, on constitutional grounds, to do what Sheikh Hasina wanted. Instead of standing with the chief justice, they declared that they would henceforth not work with him. The credibility and prestige of the Appellate Division stood shattered.\nAn immediate test of the coming elected executive will be how quickly and faithfully it passes into law the elements of judicial independence that have so far been put in place through ordinances. We also expect that future MPs will demonstrate greater respect for their voters, and not merely engage in habitual genuflection to their party, especially to its chief.\nWith the final guaranteeing of judicial independence, we hope this vital institution of modern civilisation will finally emerge with the glory and prestige it deserves by serving the people rather than the government of the day.\nIf the executive operates within its limits, the legislature—especially MPs— restrains itself to build a transparent and accountable governance framework instead of advancing partisan interests or chasing so-called development projects, and the judiciary truly distinguishes itself in the service of accountability and justice for all, especially the poor, then—and only then—will we have a real chance to build a genuine democracy in this beloved country of ours.\nMahfuz Anam is the editor and publisher of The Daily Star.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The dream of an independent judiciary",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/the-third-view/news/the-dream-independent-judiciary-4050826",
        "news_paper_name": "The Daily Star",
        "publish_date": "05-12-2025"
    },
    {
        "full_article": "For two weeks, essential health services and routine vaccination programmes have been disrupted as several groups of health workers, including government nurses, medical technologists, pharmacists, and health assistants, continue demonstrations to press long-standing demands. The consequences of such disruptions will be delayed treatment for critical patients, cancellation of basic health services and suspension of newborn registrations and vaccinations, which are essential for preventing disease outbreaks. Such disruptions are unacceptable in any functioning health system.\nSo why has the health ministry failed to resolve this dispute? The Directorate General of Health Services (DGHS) claims that most of the workers' demands have been accepted in principle and that implementation is \"in progress.\" Yet, the workers are not convinced and allege that earlier promises were never fulfilled. This loss of trust has become the core obstacle.\nThe demands themselves highlight long-standing structural issues. Health assistants seek amendments to recruitment rules, an upgrade of their entry post from grade 16 to grade 14, elimination of salary disparities, and recognition as technical staff. Medical technologists and pharmacists want their entry grade raised from 11 to 10—reforms they say have been promised before but never delivered. Nurses are also demonstrating over career progression and pay inequities. These demands merit careful consideration. However, prolonged work stoppages in essential services directly endanger lives and violate service regulations designed to protect patients. The threat of a complete shutdown of hospitals, clinics, diagnostic centres, and educational institutions underscores how vulnerable the health system is to administrative delays and inadequate labour-management mechanisms. Healthcare cannot be held hostage to stalled negotiations. This crisis exposes a larger weakness in public administration: a reactive approach that waits for public pressure instead of addressing these issues early, transparently, and with fixed timelines. When negotiations extend indefinitely and commitments are vague, workers lose faith. When health workers walk out, patients suffer.\nThe government must therefore act swiftly and decisively. If the demands are financially and structurally logical, the relevant ministries should publish a clear implementation roadmap with dates, responsible officials, and measurable steps. If some reforms require budget adjustments or longer timelines, those realities must be communicated openly. Only visible progress can restore credibility. At the same time, health workers must uphold their duty to ensure continuity of essential services. Many countries allow health-sector strikes only under minimum-service requirements. Bangladesh needs similar safeguards to prevent complete shutdowns of critical care and vaccinations. This crisis can be resolved quickly if the government demonstrates clear action and workers respond in good faith. Ultimately, a functional health system relies on trust between authorities, providers, and the public. Rebuilding that trust must begin now.\n",
        "headline_1": "Healthcare workers’ strikes cannot continue",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/healthcare-workers-strikes-cannot-continue-4049721",
        "news_paper_name": "The Daily Star",
        "publish_date": "05-12-2025"
    },
    {
        "full_article": "The endorsement of a child rights manifesto by a dozen political parties now preparing for the ultimate contest for popular mandate is a welcome development at a time when child-focused indicators reveal a worsening situation. We commend the leadership of these parties for backing the manifesto that contains 10 commitments, pledging to embed them in their policies and election agendas and acting on them if elected.\nIt was an encouraging moment to witness rival political forces—often accused of endless bickering over governance, heritage, and the nation's future direction—come together for a shared cause. This convergence of commitments to safeguard children's futures by the BNP, Jamaat-e-Islami, National Citizen Party, Jatiya Party, Amar Bangladesh Party, Bangladesher Samajtantrik Dal, Communist Party of Bangladesh, Gano Forum, Ganosamhati Andolon, Gono Odhikar Parishad, Khelafat Majlis, and Nagorik Oikya rightly deserves appreciation. UNICEF's role in convening these parties is equally laudable.\n\nWe hope these parties genuinely recognise the gravity of the challenges children face in relation to nutrition and health, quality education and skills development, an enabling environment for creativity, protection from physical and mental abuse, violence and exploitation, the persistence of child labour, and the growing threats posed by climate change.\nAccording to the Multiple Indicator Cluster Survey 2025, conducted by the Bangladesh Bureau of Statistics and UNICEF, one in eight children under five is \"wasted,\" a life-threatening form of malnutrition. The rate has risen to 12.9 percent in 2025 from 9.8 percent in 2019, while nearly 700,000 babies are born with low birth weight. Child labour has increased from 6.8 percent to 9.2 percent, and 3-4 million school-age children remain out of school. The survey also shows that nearly half of all girls marry before turning 18. In terms of climate and environmental risks, 20 million children are directly exposed to climate hazards, 87 percent of drinking water is contaminated with E. coli, and 15.8 percent contains unsafe levels of arsenic.\n\nThese alarming indicators underscore the urgent need to prioritise development and strengthen governance. The child-focused manifesto, formulated by children and young people themselves, calls for allocating five percent of GDP to education and primary healthcare—in line with global recommendations—compared with the current allocations of two percent for education and one percent for health. As the manifesto rightly notes, every dollar (or taka) spent on child protection yields a ninefold social and economic return. We, therefore, hope politicians across the aisle will support aligning national budgets with these priorities. Since the commitments have been described as \"non-negotiable,\" we remind the signatories that any deviation from their pledged actions will not only erode the trust and respect of young people, but also inflict lasting harm on the nation's future.\n",
        "headline_1": "A promising pledge, but execution is key",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/promising-pledge-execution-key-4048911",
        "news_paper_name": "The Daily Star",
        "publish_date": "05-12-2025"
    },
    {
        "full_article": "Bangladesh is facing one of the most substantial declines in marine fish stocks in its history. According to a new comprehensive fisheries survey, the stock of small pelagic species in the Bay of Bengal has dropped by a staggering 78.6 percent in just seven years—from 158,100 tonnes in 2018 to only 33,811 tonnes in 2025. This collapse follows earlier warnings, including the 2019 Department of Fisheries assessment, that categorised several species, such as tiger shrimp, Indian salmon, and large croakers, as severely depleted. Overfishing remains the central driver of this transformation: the number of commercial trawlers has nearly tripled since the mid-1980s, from around 100 to 273, putting heavy pressure on the bay's fragile ecosystem. Officials and surveyors caution that the shrinking number and size of commercially important species reflect a marine environment under acute stress.\nThe recent findings also point to deeper patterns of ecological disruption, with excessive and unregulated fishing, improper use of technology on industrial trawlers, rising microplastic pollution, and depleting oxygen in coastal zones—all playing a part in it. The survey recorded 418 microplastics, mapped abnormal jellyfish proliferation across the trawl stations, and observed that bycatch and wastage have increased due to poor monitoring. Notably, of the country's 20 major commercial fish species, only five are now viable for harvest, down from nine in 2018. Experts have repeatedly warned that without effective management, Bangladesh risks losing both biodiversity and the marine resources on which coastal communities depend.\nThis accelerating degradation, we must say, is largely a consequence of policy failures. Despite years of warnings, licences for industrial trawlers have continued to rise while monitoring mechanisms remain weak. Of the 273 industrial trawlers currently operating, 72 use advanced technology, yet its misuse has worsened bycatch. Oxygen depletion, high concentrations of microplastics, and collapsing pelagic stocks have all combined to threaten not only fish populations but also long-term food security, livelihoods, and the credibility of state-led conservation commitments.\nWe urge the government to take this crisis seriously. Going forward, the issuance of new trawler licences should be strictly limited, and the total fleet size must be reduced in phases. Industrial trawlers using illegal nets or violating designated zones should also face immediate suspension. Equally importantly, the state's marine research capacity must be strengthened to ensure continuous monitoring and informed policymaking. Protecting our marine resources is no longer an environmental preference; it is an economic and ecological necessity that demands urgent response and sustained commitment.\n",
        "headline_1": "A marine crisis we can no longer ignore",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/marine-crisis-we-can-no-longer-ignore-4048331",
        "news_paper_name": "The Daily Star",
        "publish_date": "05-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 05, 2025 00:00:00  \nThe mid-year budget revision for fiscal year 2025-26 has placed the interim government in an undeniably difficult position. On the one side lies a formidable financial crunch; on the other, persistent demands from ministries and agencies for the full release of their allocated funds. Reconciling these opposing pressures will require not only a meticulous recalibration of the budget but also prudent execution for the remainder of the fiscal year. While this is a reality the finance division has to encounter every year, the situation this year is more difficult as it involves a cautious balancing of critical factors. \nNo doubt, the current situation serves as a timely reminder for ministries and divisions to prepare realistic funding requests in the revised budget so that the government can limit excessive bank borrowing and its associated interest burden. The Finance Division has reportedly begun consultations with relevant agencies, issuing cautionary guidance to help streamline spending in line with revenue realities. Yet reports indicate that certain ministries insist they will require their entire operating budgets, despite clear signs of fiscal stress. The finance authorities, noting the slower-than-expected revenue flow earlier in the year, have urged ministries to strictly adhere to austerity directives.\nA report in this newspaper underlines, citing senior finance ministry officials, the gravity of the situation: nearly one-fifth of the government's annual operating expenditure goes towards paying interest on domestic loans. Debt-servicing obligations have risen steadily, and for the current fiscal year alone, Tk 1.0 trillion has been allocated for interest payments on domestic borrowing. Against this backdrop, the need for realistic, carefully justified fund demands cannot be overstated. The government's cautious tone also reflects its immediate spending commitments-several of which are unavoidable. Approximately Tk 30 billion will be required to conduct the forthcoming national elections. In addition, the recent decision to raise house-rent allowances for MPO-listed teachers is expected to add another Tk 40 billion to the expenditure burden. Furthermore, the government has pledged around Tk 200 billion to capitalise the newly established United Islamic Bank, created to stabilise five distressed Islamic banks. These commitments, though necessary, will significantly strain public finances, requiring higher borrowings from the banking and treasury systems unless offset elsewhere.\nGiven the scale of these pressures, revenue mobilisation emerges as the pivotal determinant of fiscal stability. Encouragingly, according to the National Board of Revenue (NBR) sources, revenue collection has gained momentum, posting over 15 per cent growth during the July-October period. If this upward trend continues, the government's reliance on bank borrowing for deficit financing could ease somewhat. Even so, the road ahead remains challenging. Austerity can help contain spending but cannot, on its own, bridge the fiscal gap. Ultimately, the government's ability to navigate the remainder of the year will depend heavily on how effectively it can mobilise domestic revenue-especially tax revenue-while enforcing disciplined expenditure across ministries. In this delicate balancing act, prudent financial stewardship will be crucial to maintaining stability amid tightening fiscal constraints.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Revised budget warrants a balancing act",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/revised-budget-warrants-a-balancing-act-1764859771",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       December 05, 2025 00:00:00  \nWhen annual examinations of government primary and secondary schools along with pre-test examinations of grade 10 are used as a pawn for realising demands by teachers, the rot set in the country's education is laid bare. Although the Bangladesh Government Secondary Teachers' Association has temporarily called off their work abstention programme after two days, the primary school teachers have decided to continue their abstention and non-participation in the annual examinations. Teachers of all the associations refrained from holding the crucial examinations scheduled on Monday and Tuesday. Examinees had to return home without appearing for the scheduled exams. \nAssistant teachers of more than 65,500 government primary schools are unbent on their demands and a faction, the Primary Assistant Teachers' Organisation Unity Council (PATOUC) declares that unless their demands were met by Wednesday, December 3, they would lock down the schools all across the country. The Primary Teachers' Demand Implementation Council (PTDIC), another faction of the boycotting teachers simply stay away from schools and have expressed their inability to hold annual examinations for their students. \nStudents of secondary schools have been given a chance to get over the trauma but the younger ones at the primary level may have to suffer the agony of not completing their annual examinations in time. The uncertainty and confusion may take a heavy toll on their preparation for the final examination of the academic year. This is unimaginable and quite unprecedented. The pandemic year saw a more pervasive disruption of the academic study. Today's secondary students were the worst victims of the pandemic Covid-19 and post-Covid academic disruptions. This consideration alone demanded sanity to prevail. \nTeachers may have genuine grievances but starting a movement at the time of year-end final examination on their part smacks of a devious ploy. Earlier the non-government teachers opted for protests like sit-ins, hunger strikes and road blockades for realising their three-point demands. These three-point modest demands were 20 per cent house rents, an allowance of Tk1,500 medical allowance and a 75 per cent festival bonus. They also demanded inclusion of non-MPO institutions in the monthly pay order (MPO) scheme. An offer of 15 per cent house rent of the basic salary was announced and the teachers of non-government institutions called off their strike programmes. \nEssentially, teachers of both non-government and government schools have launched the protest programmes in order to press for rise in their pay package and other benefits. One such common demand involves elevation of assistant teachers to 10th grade on the pay scale. Around 65,000 primary headmasters have been upgraded to the 10th grade. If the assistant teachers' status is upgraded, the headmasters can demand further upgrading of their positions. Both factions of government primary teachers, however, have also three-point demand programmes. But after the government assured that they would be placed in the 11th grade of the pay scale, the PTDIC alliance withdrew their programmes. \nThe result is that some schools were locked down and others held examinations on Wednesday. Right now the education system at the primary level has experienced a complete breakdown with the PATOUC forcing a shutdown at many schools. Headmasters of some schools have somehow managed to conduct examinations with help from guardians. Even upazila education officers extended a helping hand to conduct the annual examinations.\nEvidently, it is an awful mess. One faction of assistant teachers has accepted the offer of 11th grade but the other has refused to accept the deal. They stick to their demands for the 10th grade and resolution of complexities in securing higher grades after 10 and 16 years in service along with cent per cent departmental promotion to the post of headmaster. However contentious or not the demands are, the fact remains that the current service rules do not permit the government to accept the demands in their present form. There is a need for a thorough discussion of the problems facing the administration and the protesting teachers. \nClearly, no one is bearing the brunt as the innocent school-going children do. Much as the demands may have merits, the ploy of holding students hostage in order to press for their demands does not go well with the people, the guardians in particular. This arm-twisting tactic is sure to create bad blood between teachers and guardians. Even they may end up antagonising their students. The interim government has its limitation to accommodate all the demands in the service rules. By the time enough damage has been done so far as the already fragile and outdated education at the primary and secondary levels is concerned. \nThis country has been struggling with its system of education incompatible with the demands of the time. Then the quality of teachers also matters. People complain that when educated youths fail to land a high-paid job, they opt for the teaching profession at the primary and secondary levels. This cannot be ruled out, although there are rare exceptions to this rule. A few will definitely qualify for the 10th grade but the majority will leave much to be desired for accessing the grade under the education cadre service. \nSure enough an overhaul of the education system is urgent. This will have to happen in the interest of making education compatible with the average global standard, if not with the best in the world. Not all teachers will fit in the scheme. In that case, emoluments and other facilities have to be raised further than today's teachers have demanded. Investment has to match with the quality of education. Big investment in education has returns in spades.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Education heading for  the wilderness",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/education-heading-for-the-wilderness-1764859864",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       December 05, 2025 00:00:00  \nThe recent story of a boy who went viral for climbing onto the roof of the Dhaka Metro Rail train was initially seen as a dangerous act. But his interview with journalists revealed a much more alarming and neglected issue in our country. Yasin is his name but he does not know how he came to Dhaka or who his parents are. He has only roads, parks, and railway stations to call home. His only closer relation is his brother, who lives in Brahmanbaria. He shuttles between Dhaka and Brahmanbaria by climbing on the roof of trains without tickets to visit his brother. \nWhen jokingly asked by journalists whether he is afraid of being put in jail, Yasin simply replied that \"That's alright as long as I am provided with food and not beaten.\" Yasin's heart-breaking reply made us realise the kind of abusive and deprived upbringing he endured, and how our country has failed him.\nLike Yasin, countless children in our country have nowhere to call home and are left to survive on their own on the street. Many of them are often subjected to abuse and trafficking. With no other way to survive, they often turn to petty crimes. To escape the harsh reality, many of them also fall victim to drug addiction.\nThe incident that took place at the Dhaka Metro train involving Yasin revealed the fact that although Bangladesh has developed its infrastructure by taking on many mega projects, such as the Padma Bridge and the Dhaka Metro Rail, our country still has many unresolved issues that should have taken priority. The safety and well-being of all children is an essential part of any successful country.\nThousands of children are living on the streets of Dhaka, according to the UNICEF. Some of these children are from broken families, some escaped abuse and some were abandoned at birth. Many of these children do not survive the hostile environment, some get trafficked. There is no one to look after them, care for them, or even notice them. Along with the daily hostility and abuse they face, it is obvious why Yasin and many others like him would find jail to be a desirable place. It only proves that it is not their reckless behaviour that we should be more concerned about, but rather how we and our country have failed these children.\nThere are some shelters for these children, but they are not sufficient in either number or in resources. Most shelters are abusive and extremely strict, prompting many children to flee. Children like these need rehabilitation through counselling, education, vocational training and social integration.\nWe have the National Child Policy 2011 and the Children Act for the protection of children from exploitation, abuse, and neglect and for promoting their rights to education, health and other basic needs. However, these instruments have failed to make any difference to the lives of homeless children. We need to ensure that homeless children receive rehabilitation with the help of social workers, psychologists, educators and law enforcement agencies. Instead of providing the kids with temporary shelter, we have to ensure they are taken to a safe environment that focuses on their long-term rehabilitation and social integration.\nAlso, as a society, we must bring about a change in the way we perceive the actions of homeless children. Rather than thinking that they are at fault, we should think about how we have failed them. At an age where they are supposed to be going to schools and playing with their friends and be under the protection of their parents, they are on the streets fending for themselves. They are not the criminals but the victims. They deserve empathy, not judgement.\nYasin's story is a wake-up call that made us realise how countless children are living a horrible life and how they are being neglected. It is high time we stood by them and ensured their childhoods are saved.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The stark truth about homeless children",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-stark-truth-about-homeless-children-1764859902",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 05, 2025 00:00:00  \n\nAnimal cruelty is a criminal offence in Bangladesh, and the country's legal system provides clear mechanisms to address any intentional harm or killing of animals. When such an act takes place, the law allows the authorities to take immediate steps to investigate and prosecute the offender. For new learners and general readers, understanding how these legal provisions operate is essential to knowing what actions the state can take in response to such cruelty.\nBangladesh's primary law on this issue is the Animal Welfare Act, 2019. This Act declares that no person may cause unnecessary pain, suffering, injury or death to any animal. Under this law, intentional killing or torture of an animal is considered a punishable offence. The punishment can include imprisonment for up to six months, a financial penalty up to Tk10,000 or both. This law applies to all animals, including domestic pets, stray animals and animals living in public areas.\nThe Penal Code of 1860 also plays an important role. Although it is an older law, it still provides significant protection. Under Section 428 of the Penal Code, causing death of or injury to an animal valued below Tak10 can result in up to two years of imprisonment, a fine, or both. Section 429 is stricter: if the animal is valued above Tk 50, the offender may face up to five years of imprisonment, a fine, or both. Dogs, cats and other common animals generally fall under this category due to their minimum market and care value. These sections allow courts to impose more severe punishment when the act is deliberate and results in the death of multiple animals. \nIf the court finds the accused guilty, penalties may include imprisonment, financial fines or both. In serious cases involving deliberate and repeated cruelty, the court may choose stricter sentencing. Administrative measures may also be taken if the crime is linked to the misuse of government residence or property.\nCruelty to animals is not just a violation of the law; it is a violation of social and ethical values. Every citizen has a duty to protect the animals around them and to report any acts of violence or neglect. Public cooperation is essential in building a humane society where animals are treated with respect and care. Anyone who witnesses such cruelty should immediately inform the nearest police station or local authority so that proper action can be taken under the law.\nMd. Nahid Hasan Chowdhury Rifat\nStudent \nBangladesh University of Professionals \nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Justice for animal cruelty",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/justice-for-animal-cruelty-1764859927",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-12-2025"
    }
]