[
    {
        "full_article": "In suggesting that the Government should come with regulatory measures to prevent vulgarity or perversity in the name of humour being aired, the Supreme Court has expanded the scope of petitions by YouTubers caught in a criminal case over alleged obscenity in a digital programme. The Court has sounded the right note by calling for a discussion among stakeholders on regulations that would not impinge on the freedom of speech and expression and will be within the framework of “reasonable restrictions” permitted in the Constitution. However, such regulations may be superfluous, as existing laws provide for dealing with possible obscenity or vulgarity in electronic and digital content. That those associated with the controversial programme, ‘India’s Got Latent’, are facing FIRs and have sought protection from arrests show that the present regulations may be sufficient. Under the Bharatiya Nyaya Sanhita (BNS), display of content in electronic form shall be deemed to be obscene, “if it is lascivious or appeals to the prurient interest”, and is a punishable offence. Similar penal provisions are available in the IT Act. The Programme Code under the Cable Television Network Rules prohibits programmes that offend decency, among other things. The Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 provide for age-based classification and a three-tier system of grievance redress, under which users could approach the platform, a self-regulatory body and a government inter-departmental committee.The debate between ‘clean’ and ‘dirty’ humour is age-old, but the distinction is well-understood. It is only in the context of public outrage over specific instances of obscenity or vulgarity that voices are raised about the need to maintain decency and morality. In this case, the folly of the participants in making sexually perverse comments is matched by the zeal of the complainants and the police, mainly because of the content being leaked outside a paying audience. The participants may have thus rendered themselves vulnerable to prosecution, but a mature society should consider whether anyone should go to prison for such a verbal offence. The tendency to get the police to file FIRs wherever someone complains is also to be deprecated. The Internet’s universal reach should not become an excuse to confer universal jurisdiction. This often takes the case to the Court, as those named in such FIRs want multiple cases to be clubbed, leading to attention and a widening of the debate. An extreme case such as this does evoke extreme reactions, but law enforcement and legal institutions should not be overzealous in their response. Published - March 06, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        government\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        police\n                    \n                            /                      \n                        \n                        judiciary (system of justice)",
        "headline_1": "Humour and perversity: On regulatory measures to prevent vulgarity",
        "headline_2": "With enough laws to deal with obscenity, new regulations may be superfluous",
        "link": "https://www.thehindu.com/opinion/editorial/humour-and-perversity-on-regulatory-measures-to-prevent-vulgarity/article69295232.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "06-03-2025"
    },
    {
        "full_article": "When an acronym was coined to refer to a newly-created cadre of health workers for the country, as political gestures are wont to, care was taken to ensure the word invoked a sense of promise. The government decided to call them Accredited Social Health Activists (ASHA in Hindi means hope). In 2005, the Centre launched the National Rural Health Mission, and nominated ASHAs to be the link between the community and the public health-care delivery system. Today, there are over a million ASHAs across the country, and each one is firmly ensconced as the fulcrum of public health care in their area of operation in rural India. They now perform a full complement of functions: record birth and death data, implement interventions in non-communicable diseases and communicable diseases, neglected tropical diseases; and serve a crucial reproductive, maternal, new born, child and adolescent health role, among others. Monitoring health, hygiene and sanitation in the community is also upon them. The role that the ASHAs played during the COVID-19 pandemic as health-care workers trusted by the community raised their profile significantly, and the humble Indian health worker went global. The ASHAs were chosen for the WHO Director-General’s Global Health Leaders Award in 2022, and were recognised for their ‘outstanding contribution towards protecting and promoting health’. A recent PLOS Global Public Health study established that the likelihood women access maternal services, and have a safer, institution-based delivery, goes up by 1.6 times if they were connected with ASHAs.And yet, 20 years after the ASHAs were created, the workers are still on the streets, protesting for fair wages and equitable treatment. The flaw lies in the way they were designated at the inception — as volunteers. As such, they remain eligible only for a meagre fixed salary from the Centre and the rest of the compensation provided as incentive (shared by the Centre and States) against a deliverable, for instance, for facilitating an institutional birth. As per estimates, an ASHA worker can make anything between ₹5,000 and ₹15,000 a month. In 2018, the government approved an ASHA benefit package, providing coverage for accidents, deaths and disability. But the truth is there is a heavy load on the ASHAs; they work long hours, travel long distances, frequently miss meals, and have little time to take care of their own health needs. It is high time that the government fulfils the hopes of its warriors of hope, and treats ASHAs as permanent employees, instead of as volunteers, to enable them to draw adequate compensation and emoluments comparable to what is given to government employees. Published - March 06, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        health\n                    \n                            /                      \n                        \n                        health-workers union\n                    \n                            /                      \n                        \n                        medical staff\n                    \n                            /                      \n                        \n                        rural health\n                    \n                            /                      \n                        \n                        personal data collection\n                    \n                            /                      \n                        \n                        disease\n                    \n                            /                      \n                        \n                        communicable diseases\n                    \n                            /                      \n                        \n                        non-communicable diseases\n                    \n                            /                      \n                        \n                        parent and child\n                    \n                            /                      \n                        \n                        children\n                    \n                            /                      \n                        \n                        health and hygiene\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        wage and pension\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "Warriors of hope: On India’s ASHA’s, inadequate compensation",
        "headline_2": "ASHAs need adequate remuneration to be effective in their role",
        "link": "https://www.thehindu.com/opinion/editorial/warriors-of-hope-on-indias-ashas-inadequate-compensation/article69294359.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "06-03-2025"
    },
    {
        "full_article": "Painting ‘half the sky’ their way. No show-sha\nStep back, men. It’s raining women, or will be this IWD weekend. There’ll be the usual platitudes – and flatitudes. All I ask for is latitude to honour those doing their own thing without wanting to break paths or ceilings. Just ordinary women.\nYes, yes, aam aurat was already Most Favoured Notion; moved into yet another role, from daughter/sister/mother to political fodder. No point ruminating on those splashed with cash, more motivated than motivating. Everyone by now knows that Maharashtra’s largesse-giving Mahayuti got greater ‘pampering’ than yojana-receiving ‘ladli behen’.\nNo, this IWD I don’t want to hail our usual WMDs, Women of Mass Discussion. Like hosannah-ed head henchos. Or 20-somethings of our endless start-ups. No, not even savvy home-chefs originally plated up by Covid; but, instead, their peelers, choppers and wash-uppers who also eyed the cake.\nWomen who embody empowerment but don’t wear it on their sleeves.\nLike those walking through newly opened doors, and then using them as windows of bigger opportunity. Like ‘parlour didi’ Reshma, who upskilled, accessed newly available loans, acquired the sheen of her clients and set herself up independently.\nLike Kasturi, whom I met selling home-crafted kandeels, but was studying to be a CA. Two Diwalis later, she had upped her aspiration to company secretary.\nLike mother-daughter duo of takeaway-dinner stall. Smart16 beti is the ‘face’, briskly dispensing bhakri–rotis from a hot case; shabbier ai squats invisibly below handing her plastic packets of bhaji. One smooth silent cycle, 7-10pm, or ‘till stocks last’.\nLike the tower block’s ‘arriviste’ who, unfazed by its toned Spandex gangs, does her stretch-sequence in shiny sari. Bindi-ed and bindaas.\nLike spunky octogenarians who sing bhajans at our complex’s Ganapati celebration, and as gamely shimmy to ‘Chin-chin-chu’ at its ‘Grand Variety Entertainment’. Each ordinary evening, they descend, showered, powdered and fresh sari-ed to bond like any Cosmo sisterhood – till they decide when they’re done. Hungry husbands can wait.\nLib without too much lip. That’s what I’ll celebrate this IWD.\n***\nAlec Smart said; “USA Gaza-ed Zelenskyy, Puttin’ its arm around Russia. UKraine rescued. The neo-Great Game begins.”\n\n",
        "headline_1": "The other woman",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/the-other-woman-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-03-2025"
    },
    {
        "full_article": "To survive tariff wars, India needs to be clever & its key producers must up their quality game fast\nTrump’s reciprocal tariffs will hit Indian exports on April 2. Per a Citi Research analysis, the annual loss for India could be as high as $7bn. Currently, US-India trade amounts to $150bn, skewing heavily in India’s favour. In fact, India’s $45.7bn surplus put it in Trump’s spotlight. He brought it up hours before meeting Modi in Feb, and again on Tuesday when he told Congress, “(India) charge us tremendously high tariffs than we charge them.” US has a $1.7tn trade deficit; India accounts for just 2.7% of it but its tariff walls are indeed high. Last year, India charged an average of 11% on US goods, whereas US charged only around 3%. Beyond averages, Trump has long complained about India’s 100% tariff on cars. Industrial ethyl alcohol faces 150% duty, food items 68%, footwear 15-20%. It’s not easy for America to sell to India.\nTrump’s intent has been clear since his campaign, and India tried to pre-empt tariffs by reducing some duties in last month’s budget. It also offered to buy more US oil, gas and military hardware, eventually raising mutual trade to $500bn by 2030. But Trump 2.0 is not playing the waiting game – he’ll sign out of White House in 2029. So, what can India do before tariffs take effect in four weeks? As our columnist Ajay Srivastava wrote on Wednesday, first, don’t waste time signing an FTA because Trump doesn’t value them. He scrapped the one he signed with Canada and Mexico in 2019. Also, don’t retaliate. Instead, scrap tariffs on 90% of American industrial goods that are already free to import under other FTAs, and seek reciprocal concessions. Meanwhile, strike deals with other countries affected by Trump’s tariffs. Canada, for instance, will have lots of spare oil, fertiliser, gold, copper and plastic. Forget the rancour and grab the deals.\nTariffs are a headwind for Indian pharma – $8bn US sales last year – steel, aluminium, chemicals, jewellery, agri products, etc. Long term, our industries will have to become more resilient and find new markets because the world won’t wait for them to come of age. The auto sector – Trump’s pet peeve – has flourished with protections in India for decades, yet India exported only 0.7mn cars last year. Mexico made 4mn and exported 3.5mn. And S Korean Hyundai is America’s 4th largest carmaker now. Time we grew up too.\n\n",
        "headline_1": "Grow up, industry",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/grow-up-industry/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-03-2025"
    },
    {
        "full_article": "Gold: cop’s daughter smuggles it, Indians obsess over owning it & now, global investors love it\nAs much as Indians adore gold, GOI dislikes the foreign exchange outgo on it. Betwixt our bottomless hunger for the shiny metal and govt’s import duties on it, smugglers continue to make merry. These days, roiling equities and Trump’s trade war are further shoring up gold’s safe investor haven status. Global gold prices are at an all-time high, having already broken records 10+ times this year, and more rallies are safely forecast. So, that an actress was found smuggling gold into Bengaluru isn’t surprising per se. What’s more worrying is how easily she’d gamed airport security.\nDaughter of a DGP, she took advantage of some special protocol for senior govt officers to evade proper checking. Each of us has experienced harassment by VIP privileges first hand. But if these are also an easy cover for crime, that must be prosecuted, and systemically counteracted, asap. It is now being emphasised from the IPS officer’s side that the actress is his stepdaughter, and also that she got married four months ago. If these facts are intended to establish his distance from her, that’s truly strange. Why should either detail dilute the parental relation?\nBappi Lahiri remains India’s gold standard – that’s a more sparkling takeaway from the story. We love covering ourselves in the yellow metal like he did. Amrapali to Ponniyin Selvan, Vyjayanthimala to Aishwarya Rai, more than half century between them, the same extra-jewelled look remains the go-to fashion. Overall, Indian women are now said to own over a staggering 11% of the world’s gold reserves. Not that our women shine alone, no more than a bride at a wedding. Men are very much in the competition. The Pushpa look, à la bling bling chains and rings chunky like knuckle-dusters, is taken from reality. Gold is a gender-neutral love affair. \n\n",
        "headline_1": "Bling it on",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/bling-it-on/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-03-2025"
    },
    {
        "full_article": "The Supreme Court, hearing the obscenity case against Ranveer Allahbadia on Monday, reiterated the right to free speech as well as its disinclination towards censorship. But it also said such a view wasn’t a licence for “depraved thoughts” and “filthy words”.\nSounds neat? But it isn’t. Obscenity is a criminal offence that invites jail-time and a fine. Yet, it is impossible to define it. Which is why it’s a constant tussle to decide if what’s perceived as ‘obscene’ ends up curtailing the right to free expression.\nRead TOI+ for full story\n\n",
        "headline_1": "What’s obscene? What about free speech?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/whats-obscene-what-about-free-speech/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-03-2025"
    },
    {
        "full_article": "At a press briefing on Tuesday, the chairperson of the inquiry commission on enforced disappearances once again stated how the highest level of the ousted Awami League government had been directly involved in cases of enforced disappearances, abusing the state's security apparatus to this heinous end. While this has been known for some time now, Tuesday's revelation reinforced the extent to which the fallen regime perverted the purpose of security forces to commit this absolute aberration of justice, rule of law, and human rights. Not only is it deeply saddening, but it is also a dark, shameful stain on the country's image as well as collective psyche.\nThe commission, which has been investigating cases of enforced disappearances since its formation on August 27, 2024, said it had interviewed 45 members of law enforcement and intelligence agencies, and identified those within these forces who had carried out the orders of their political masters. The commission chief also mentioned the prevailing apprehension among security forces in this regard and warned against what he called \"community shielding\" of the perpetrators, clarifying that individuals directly involved in this abominable crime must take personal responsibility for their actions.\nWe could not agree more. As we learnt from the inquiry commission's preliminary report, submitted to the chief adviser in December, various security agencies—from different wings of the police to intelligence bodies—were involved in a well-coordinated system set up by the fallen regime to abduct, detain, disappear, torture, and execute or frame in trumped up charges those critical of the government. Members of these forces thus strayed from their true purpose—serving the people and upholding the rule of law—at the behest of the deposed prime minister and her cohorts. Therefore, justice must be served, and as the commission chief said, those involved must be held accountable.\nWe appreciate the inquiry commission's efforts to bring justice to the victims of enforced disappearances. We also believe all details of this clandestine system of suppression should be made public. Doing so would serve as a lesson for the nation, ensuring that such a horrific abuse of our law enforcement and security forces, which are meant to protect us, is never repeated. To this end, laws could be enacted if necessary to shield security agencies from the undue influence of any government. This we suggest with the best interests of these institutions and the nation at heart.\n",
        "headline_1": "Bring the true perpetrators of enforced disappearance to book",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/bring-the-true-perpetrators-enforced-disappearance-book-3840396",
        "news_paper_name": "The Daily Star",
        "publish_date": "06-03-2025"
    },
    {
        "full_article": "US President Donald Trump and the Republicans gave many indications that they were not fans of the Biden-era foreign policy towards Russia's invasion of Ukraine, which was sticking with Ukraine for \"as long as it takes.\" Before his second inauguration, what Trump would do with US military support for Ukraine was a tense topic under his \"America First\" transactional foreign policy. Then it really exploded, much beyond the worst nightmare of European leaders. Vice-President JD Vance and Trump attacked Ukraine's President Volodymyr Zelensky, with Trump going on to accuse Zelensky of playing with \"World War III.\" During the internationally televised meltdown, the message was clear, if it had not been before: in the current US foreign policy, the US is only interested in supporting Ukraine if it serves the current president and his administration's broader political goals.\nUnderpinning what was largely an unstrategic—not to mention immoral—and ill-tempered treatment of the Ukrainian leader, is Trump's larger vision that the post-World War II-era geopolitics is one that has led to what he calls \"America's decline.\" For Trump, it's always, \"What's in it for me?\" And that policy is framed as \"America First.\" But Trump's notions about what is to his advantage remains questionable. He believes that his country has the power to secure any deal under him, similar to Zelensky's foe, Russian President Vladimir Putin. Trump has broken ranks with European leaders on Putin. Before Zelensky's visit, he called the Ukrainian leader a dictator, and said Putin should be allowed to return to G7, from which he was expelled in 2014 after annexing Crimea.\nOn Monday, the US president paused all military aid to Ukraine, as reported by Bloomberg. Prior to the news, Trump had again taken to social media to chide Zelensky's assessment of the war with Russia. In a social media post, pointing to recent comments in which Zelensky said the end of his country's war with Russia remains far off, Trump said the US \"will not put up with it for much longer,\" adding that Zelensky's assessment was \"the worst statement that could have been made.\" To reporters on Monday afternoon, Trump continued to suggest that Zelensky \"doesn't want to make a deal,\" and that one could \"be made very fast.\" Trump went on to say he believed that \"Russia wants to make a deal,\" and that \"certainly, the people of Ukraine want to make a deal. They've suffered more than anybody else.\"\nThe warnings from the meltdown—and the clear fact that Trump openly dislikes Zelensky—extended to Europe. Zelensky left early; the deal to offer Ukraine's rarest minerals to the US remained unsigned on the table. European leaders have stepped up, and the UK has taken on an urgency to seize the moment. The UK signed a $2 billion deal with Ukraine and paved a way for the country to tap into Russian frozen assets, which have been under Europe's jurisdiction. The deal will allow Ukraine to use export finance to buy more than 5,000 air defence missiles, which will be made in Belfast.\nOn Monday, while Trump continued to sideline Ukraine, British Prime Minister Keir Starmer also declared a four-point plan for Ukraine, which included a \"coalition of the willing\" that would come together to draw up a peace plan to end the war. He said he would present it to the US president for his support. Unlike NATO and other alliances, \"a coalition of willing\" is designed to be palatable to the US president in the sense of nation-states that are willing to join in by not sending in their troops. The UK and France have mentioned that they are willing to commit troops in the event of a peace deal.\nStarmer, European leaders, and Zelensky reiterated that the success of a peace deal would need strong US backing. Starmer told the UK members of parliament that Trump's commitment to achieving peace in Ukraine is \"sincere.\" As the British prime minister spoke of the \"heavy lifting\" that Europe would have to do but reiterated the need for US support in the House of Commons, the US president posted on social media, saying, \"Europe… stated flatly that they cannot do the job without the US—probably not a great statement to have been made in terms of a show of strength against Russia. What are they thinking?\"\nTrump's strangely antagonistic statements towards Europe on the issue of Ukraine, along with the bullying of Zelensky, has generated rife speculations of US military aid cuts in the media. According to analysts, large spending cuts would definitely result in greater loss of life and could easily result in Ukraine losing the war.\nThe war is currently stalemated, but Russia has the initiative. Ukraine's defences on the eastern front are weak, though not breaking; it retains an enclave in Russia's Kursk region. Russia has made small but continuous gains in Ukraine's east since the Ukrainian counteroffensive halted in November 2023, but at a high cost. In 2024, the Russians suffered more than 420,000 casualties, and the combat losses since 2022 are set to cross one million by mid-year, and Putin has not yet called for a second mobilisation. The US provides Ukraine with the full spectrum of equipment that a military needs.\nTo understand the importance of the US, militarily for Ukraine: the packages run the gamut from heavy weapons to munitions—artillery shells and air defence missiles—to medical equipment and cold weather gear supplies. According to the Center for Strategic and International Studies (CSIS), recent packages appear to provide the monthly production of equipment that is in short supply in the US, such as artillery shells, air defence systems, and anti-tank weapons. Around a dozen HIMARS to boost Ukrainian firepower and a dozen National Advanced Surface-to-Air Missile Systems (NASAMS) for air defence were contracted in 2022 and will soon appear on the battlefield in Ukraine.\nThe focus on military equipment should not discount the \"soft\" support—training and intelligence data, for example—that the US provides. Although such support cannot be counted in the same way that equipment can, it has been critical in building Ukraine's military capabilities, and Europe cannot replace the same intelligence as to when Russia would attack or not.\nTrump's approach to the so-called \"peace deal,\" which he keeps referring to, has so far included dialogue with Putin. On February 12, Donald Trump said Ukraine would not recover all its territories or join NATO, and said he would meet with Russian strongman Vladimir Putin. On February 13, Trump broke ranks with G7 leaders, who expelled Russia after it annexed Crimea in 2014, and said Putin should be allowed to return. For Trump, his path to \"peace\" between Russia and Ukraine is an image of himself standing between the countries. He has not agreed to provide any security guarantees that Starmer has spoken of, and solely focused on the deal to open up Ukrainian minerals to US companies, arguing that the presence of US workers in Ukraine itself would discourage Russia from attacking or encroaching on the Ukrainian territory.\nBut if Trump's ultimate goal is normalisation with Moscow, and he is willing to make that deal, where is the line where he would settle with Putin? Vladimir Putin is not a reliable ally, with the robust track record of turning back on agreements, and if Trump wants to rewrite the history of the US and Russia, what are the concessions he would be willing to settle on with Russia? If those concessions come at the cost of Ukraine's sovereignty, neither Ukraine nor Europe would be onboard. On Monday, Kremlin spokesperson Dmitry Peskov told reporters, \"We see that the collective West has begun to partially lose its unity.\"\nWhile Zelensky has said the US-Ukraine relationship is salvageable, and Europe refuses to—on the diplomatic front—reconsider the US as a steady ally, the prospects for Ukraine remain as bleak as ever. Trump continues his divisive language, but as we have seen before, his actions are often divorced from his words. US relations with Russia have always enjoyed a rare bipartisan consensus, even during recent times, despite talks of aid cuts. But the current atmosphere seems to have upended the earlier equation—for now. After the fiery meeting that drew backlash, Trumps cabinet, such as Secretary of State Marco Rubio and others, continue to back him and have vaguely said that the efforts to end the war need a \"reset.\" It is unclear whether the entire administration remains aligned with Trump on whatever position he has on normalising relations with Russia, but his critics have accused him of essentially selling out Ukraine.\nIn the coming days, the best case scenario would be the continuation of US and European aid to stabilise front lines, defend Russian attacks, and find a footing for a negotiated settlement, and perhaps Russia would be more willing to make a deal as its cost of war piles up, as casualties are looking to surpass a million. What will happen is frankly too soon to tell, but the way the meeting-turned-shouting match between Zelensky and Trump blew up on live television—juxtaposed with the new tone of US foreign policy—the writing is on the wall: expect the unexpected.\nRamisa Rob is in-charge of Geopolitical Insights at The Daily Star.\n\nViews expressed in this article are the author's own.\nWe welcome your contributions and analysis of global events, and responses to our articles. To submit articles to Geopolitical Insights, please send an email to [email protected].\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Trump and Zelensky: Is the damage irreparable?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/geopolitical-insights/news/trump-and-zelensky-the-damage-irreparable-3839936",
        "news_paper_name": "The Daily Star",
        "publish_date": "06-03-2025"
    },
    {
        "full_article": "Like many countries, Bangladesh was caught off guard by the speed and extent of USAID funding cuts under the Trump administration. Although there is no official data on how many people have lost, or may lose, their jobs due to the freezing of funds, estimates from the development sector suggest that between 30,000 and 40,000 people may be affected. This is deeply concerning, particularly because it will put significant strain on the economy.\nAccording to diplomatic sources, USAID provides Bangladesh with $300-400 million annually for health, nutrition, agriculture, livelihoods, labour rights, human trafficking prevention, and democratic development. These funds have been instrumental in Bangladesh's progress in areas such as maternal health, climate resilience, and rural development. However, following Donald Trump's inauguration as US president on January 20, his administration swiftly suspended most USAID funding and activities, except for emergency food aid, including assistance for Rohingya refugees in Bangladesh. This move has not only left thousands of development workers unemployed but also cast severe doubt over the future of various development projects.\n\nMany development projects currently facing an existential crisis are similarly essential not only for their beneficiaries but also for society at large. As such, the government must not allow them to collapse. It should instead conduct a thorough evaluation to identify the most critical initiatives and explore ways to sustain them. This could include direct government funding for the high-priority projects, partnerships with international organisations, or securing alternative donor support. NGOs, too, must adapt by assessing their efficiency, optimising operational costs, and exploring sustainable funding sources.\nMany of these now-unfunded projects serve the most vulnerable segments of our society. Whether providing crucial immunisations, essential medicines, affordable birth control, or income-generating opportunities for the poor, their loss will have a far-reaching impact. Some projects also focus on promoting workers' rights or supporting labour-related cases. With funding now frozen, many of these labour rights initiatives could be sidelined, leaving workers even more vulnerable to exploitation. In a country like Bangladesh, where a significant portion of the workforce is employed in the informal sector with weak labour protections, this could be devastating.\nMany development projects currently facing an existential crisis are similarly essential not only for their beneficiaries but also for society at large. As such, the government must not allow them to collapse. It should instead conduct a thorough evaluation to identify the most critical initiatives and explore ways to sustain them. This could include direct government funding for the high-priority projects, partnerships with international organisations, or securing alternative donor support. NGOs, too, must adapt by assessing their efficiency, optimising operational costs, and exploring sustainable funding sources. Without compromising beneficiary support, they should implement cost-saving measures and seek collaborations with the private sector, philanthropic institutions, and public-private partnerships to reduce dependency on foreign aid.\nThe USAID funding cuts have posed a serious challenge, but they also underscored the need for a more self-reliant development model. A coordinated approach by the government, NGOs, and the private sector is therefore essential to ensure that crucial programmes continue to serve those who need them most.\n",
        "headline_1": "We need a more self-reliant development model",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/we-need-more-self-reliant-development-model-3839931",
        "news_paper_name": "The Daily Star",
        "publish_date": "06-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Augmenting export earnings",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/augmenting-export-earnings-1741189395",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Demolition of illegal brick kilns: who to bell the cat?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/demolition-of-illegal-brick-kilns-who-to-bell-the-cat-1741189511",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Why young Bangladeshis choose startups?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-young-bangladeshis-choose-startups-1741189536",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Enduring impact of Orientalism",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/enduring-impact-of-orientalism-1741189562",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-03-2025"
    }
]