[
    {
        "full_article": "Shocked that an acid attack victim had not got closure 16 years after the crime was committed, the Supreme Court of India made a slew of oral observations early this week calling the slow pace a “mockery of the system”. The Chief Justice of India (CJI), Justice Surya Kant, said acid attackers must not be shown any sympathy by courts, and called for the “entire system” to respond against them. Shaheen Malik was 26 and was studying for an MBA degree when she was attacked outside her office in Haryana in 2009. Till 2013, “nothing happened” in her case, she told the CJI. The case was finally transferred to Rohini court in Delhi from Haryana, where the trial is pending and “final arguments” are on. Ms. Malik has undergone reconstructive surgeries, and in 2021, she set up Brave Souls, an NGO which offers medical and legal support to acid attack survivors. In fact, she was knocking at the Court’s door with a PIL seeking formal recognition of survivors as persons with specified disabilities under the Rights of Persons with Disabilities Act, 2016. She was bringing the Court’s notice to those acid attack victims who had been forcibly fed acid and were not marked for life like others who had acid thrown at them but nevertheless lived with terrible suffering.The CJI asked the Centre to consider bringing an ordinance. Solicitor-General Tushar Mehta, appearing for the Centre, said no respondent could oppose the cause of the petitioners. Perpetrators of acid attacks who leave victims, mostly women and minors, scarred inside and outside for the rest of their lives “must meet with the same ruthlessness as they showed their victims”, he said. The CJI ordered the Registrar-General of the High Courts to provide the number and details of pending trials in acid attack cases; he also proposed setting up of special courts to exclusively conduct acid attack cases on a day-to-day basis. In the past, in Laxmi vs Union Of India and Ors., the Court had directed the government to ensure that acid attack victims got proper treatment, aftercare and rehabilitation, also asking it to look into the banning of sale of acid across the counter. Section 124 of the Bharatiya Nyaya Sanhita deals with acid attacks and the punishment to be meted out, but reality paints a grim picture, with trials being long-drawn and conviction rates low. According to latest National Crime Records Bureau data, there were 207 incidents of acid attacks across the country in 2023, with West Bengal ignominiously topping the list with 57 cases, followed by Uttar Pradesh (31). Victims of acid attacks, one of the worst forms of gender violence imaginable, deserve a lot better. Published - December 06, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        crime, law and justice\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        disabled\n                    \n                            /                      \n                        \n                        children\n                    \n                            /                      \n                        \n                        West Bengal\n                    \n                            /                      \n                        \n                        Uttar Pradesh",
        "headline_1": "​Marked for life: On acid attack survivors",
        "headline_2": "Acid attack victims deserve better from courts and law enforcement",
        "link": "https://www.thehindu.com/opinion/editorial/marked-for-life-on-acid-attack-survivors/article70362175.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "06-12-2025"
    },
    {
        "full_article": "President Donald Trump counts the crisis in Congo as among the conflicts he has helped resolve. On December 4, he hosted the leaders of Rwanda and the Democratic Republic of Congo in Washington for the signing of a formal peace agreement, which endorsed an earlier deal concluded by the Foreign Ministers of both countries. Mr. Trump hailed the accord as a “historic” step towards bringing prosperity to Africa, while Congolese President Félix Tshisekedi and his Rwandan counterpart Paul Kagame, who had frequently exchanged insults, praised his mediation. Mr. Trump also promised American investments in the resource-rich Congo if peace holds. On Thursday, he said he would send “our biggest and greatest companies over to the two countries”, adding that “we are going to take some of the rare earth, take out some of the assets and pay ... and everybody is going to make a lot of money”. But beyond the grandiosity of the ceremony, the situation remains complex and violent, with fighting continuing to rage in eastern Congo between Congolese forces and the M23 rebels. Under the agreement, Rwanda wants Congo to disarm the Hutu militias operating from its territory, while Congo wants Rwanda to withdraw troops from the east. Ultimately, however, the success of the deal hinges on securing peace between the Congolese government and M23.The crisis in Congo can be traced back to the 1994 Rwandan genocide in which about 8,00,000 people, mostly Tutsis, were massacred by ethnic Hutu militias. After the genocidal regime in Kigali fell, thousands of Hutus fled to Congo in the mid-1990s. Rwanda now claims that some of the militias that took part in the genocide continue to operate from Congolese territory. M23, which takes its name from a failed peace agreement signed between a Tutsi-led rebel group and the Congolese government on March 23, 2009, says it is fighting to protect the rights of Congo’s Tutsi ethnic minority. The Congo and UN experts say neighbouring Rwanda, ruled by a Tutsi-led government, is backing M23. In 2012, shortly after its formation, M23 seized much of Goma in eastern Congo, but withdrew when Rwanda came under international pressure. It started another rebellion in 2021, capturing Goma again and expanding its reach. Alongside the U.S.-brokered talks between the Congo and Rwanda, a parallel dialogue between M23 and Kinshasa, facilitated by Qatar, is also under way. Congo wants M23 to withdraw from the eastern regions it controls, but the rebels have shown little interest in doing so. Mr. Trump’s declaration that he brought the war to an end appears premature, given the complexity of the crisis. For peace, the wounds of the genocide must be healed, inter-racial relations between Hutus and Tutsis improved, non-state militias disarmed and ties between Rwanda and the Congo stabilised. Published - December 06, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Democratic Republic of Congo\n                    \n                            /                      \n                        \n                        Rwanda\n                    \n                            /                      \n                        \n                        peace negotiations\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        crime\n                    \n                            /                      \n                        \n                        national or ethnic minority\n                    \n                            /                      \n                        \n                        Qatar\n                    \n                            /                      \n                        \n                        human rights",
        "headline_1": "Deal without peace: On the U.S. and Congo-Rwanda accord",
        "headline_2": "Trump’s announcement of the accord between the Congo and Rwanda is premature",
        "link": "https://www.thehindu.com/opinion/editorial/deal-without-peace-on-the-us-and-congo-rwanda-accord/article70362193.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "06-12-2025"
    },
    {
        "full_article": "This week, something strange happened in India’s aviation world. The government had made new rules to ensure that pilots got enough rest so they could fly safely.\nThese rules are called FDTL – Flight Duty Time Limitations. They were supposed to start long ago, but India’s biggest airline, IndiGo, still wasn’t ready.\nWhen the rules finally had to be followed, IndiGo said it couldn’t handle them. So it started cancelling hundreds of flights every day. This left thousands of passengers stuck at airports for hours, with no idea when they would fly. Some ticket prices even shot up to Rs 1 lakh for a normal economy seat!\nIt almost felt like IndiGo was saying to the government:\n“If you force these rules, we’ll cancel flights and create chaos.”\nWhy could IndiGo do this? Because it is too big. It controls more than 60% of all flights in India. That means if IndiGo stops flying normally, the whole country feels it. In many other countries, no single airline is this powerful.\nThe government finally gave up and said the new pilot-rest rules would not be applied for now. They said this was “for passengers’ good”, but honestly, they didn’t have much choice. The airports were already a mess.\nPilots are upset too. They say airlines should have hired more pilots to prepare for the rules, but didn’t. In fact, no new beginner pilots were hired this year.\nSo flights may become normal again soon. But the bigger problem remains: If a few airlines become too powerful, they can break rules and get away with it.\nTo fix this, India needs more airlines and more competition—so no single company can hold passengers, or the government, “hostage” again.\n\n",
        "headline_1": "Passengers treated like hostages",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/passengers-treated-like-hostages/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-12-2025"
    },
    {
        "full_article": "India’s Prime Minister Modi and Russia’s President Putin had an important meeting. It came at a time when the world’s politics are changing fast.\nFirst, the meeting showed that both countries want to make their own decisions, without being controlled by bigger powers.\n\nRussia wants to show it isn’t isolated or totally dependent on China after the Russia-Ukraine war.\n\nIndia wants more freedom while dealing with the US on tough trade talks.\n\n\nSecond, they talked about the Ukraine war. Modi said India supports any effort to bring peace. This matters because the longer the war continues, the more Russia depends on China — something both India and Western countries worry about.\nThird, India and Russia want to strengthen their partnership in more areas.\nThey discussed:\n\nA new agreement to make it easier for people to travel and work between both countries\nA plan to expand economic cooperation beyond just defence and energy, where they already work closely\n\n\nIndia also reminded Russia that some military equipment deliveries have been very delayed, and asked them to speed things up. On buying energy, India said it will always choose the best price and the best deal for itself.\nOverall, as global friendships and rivalries shift — with a stronger China and an unpredictable America — India and Russia want to find the best place for themselves in the world. Meeting an old, trusted partner helps both feel more secure.\n\n",
        "headline_1": "PutiNamo",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/putinamo/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-12-2025"
    },
    {
        "full_article": "Electoral politics is a zero-sum game, and not such a sweet deal after all \nWhen people talk politics to me and ask whether I’m pro-govt or anti-govt, pro- opposition or anti-opposition, I ask them how much they like jalebis. \nWinston Churchill – arch-imperialist, engineer of the Great Bengal Famine that claimed millions of lives, and loathsome specimen of the inhuman race – got it right for once when he said that democracy is the worst form of govt except for all the others that have been tried from time to time. \nDemocracy is not perfect, and its biggest imperfection is democracy itself. Democracy is founded on the elective principle of choice between govt and opposition. This necessitates democracy to be a binary system. A zero-sum game in which one side’s win can result only from another side’s loss. \nComputers operate on a binary system. A computer’s response to an input can be either 0 or 1. It cannot be both at the same time. \nParliamentary democracy makes us choose between govt and opposition or anti-govt, between zero and one. We can’t choose both together. \nBut unlike computers, we are not programmed to be binary entities. We might sometimes want zero and sometimes one, and sometimes both zero and one at the same time. \nThat’s where jalebis come into it. In his The Story of Civilisation, CEM Joad,  addressing his youthful readership, asked if one would be happy to eat only treacle toffee, assuming that it was one’s favourite food, all the time. And of course the answer is no. \nJoad said civilisation is based on the Aristotelian Golden Mean, the Buddha’s Middle Path, which lies between all treacle toffee and no treacle toffee at all, between all zeros and all ones, between opulence and destitution, between all govt and no govt, all opposition or no opposition.\nI like jalebis, but not all the time. I like daal-roti as well, or a slice of pizza. Similarly, there are times when I agree with govt and times when I agree with opposition. Does that make me a split personality, or just a split voter? \nSo when I’m asked about my politics, I say I like jalebis, but not all that much…\n\n",
        "headline_1": "Jalebis and democracy",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/jalebis-and-democracy/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-12-2025"
    },
    {
        "full_article": "China’s tax on condoms won’t make Chinese have more kids. Communist patriarchy can’t even see women’s POV\nSeriously? A tax on condoms? Yup, that’s what Chinese authorities are gifting folks this new year. The laughable logic is that this will make having kids less expensive than not having them. Obviously not, even if high costs of raising children are a key reason for China’s plummeting birth rate. Because anybody whose pocket protests at paying a tax on condoms, will hardly welcome paying the much, much higher price of bringing up baby. Maybe it betrays how frustrated and desperate govt is getting. In the decade since it ended the one-child policy, people have resisted all its go-forth-and-multiply bait. \nInstead, marriage registrations have halved. Remember that in China, like India, social norms mean that most children are still born in wedlock. And like a lot of other countries, China’s response to the decline of marriage and birth rates is to pile up the pressure on women. Given how central women’s high labour force participation rate (60%) has been to the Chinese economic miracle, nobody is quite sending them to the kitchen. But hey, women, how about just doing a job instead of chasing a career – this is what a lot of local govt policies and employers are ‘suggesting’ to women. It’s all horribly patriarchal, but pretends as if the crux of patriarchy isn’t that women aren’t the primary decisionmakers. Several govts fail at telling men to share childcare & domestic chores, reduce work hours & take paternity leave. China’s communists may be worse because there are no women among party bosses: there are none in the politburo or standing committee. \nIn richer China, in megacities like Shanghai, couples who are refusing to have children are even more out of CCP’s mindreach. DINKs, double income no kid pairs, are living up their arty-party lifestyles. Why not? It’s their choice. Ordering that babies be made is impossible – even in China. \n\n",
        "headline_1": "Commies & Babies",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/commies-babies/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-12-2025"
    },
    {
        "full_article": "Nothing reveals the story of why we failed to institutionalise democracy in Bangladesh better than our failure to build an independent judiciary. Though it is clearly stated in our constitution, it took us 53 years or so to lay its final foundation stone. What edifice we will build on this foundation lies in our future.\nWith so many things we have criticised the interim government for, the separation of the judiciary is one area where it deserves our praise. Without a separate secretariat under the authority of the chief justice—for which an ordinance has been recently issued—the judiciary would never have come out of the dominance of the executive branch, and especially of the law ministry, which resulted in the total destruction of the legal system in the country. Thanks are due to Prof Yunus, the head of the government, and Asif Nazrul, the law adviser. Praise must also be extended to the current chief justice, whose relentless work behind the scenes brought about the present reality.\nWhat must not be overlooked is that none of our democratically elected governments—led by Khaleda Zia and Sheikh Hasina—or the military governments of General Ziaur Rahman and General H M Ershad did anything to set up an independent judiciary.\nThree events—one judgment (1999), one initiative by a caretaker government (Fakhruddin Ahmed, 2007), and another by the present interim government (Prof Yunus, 2025)—have finally removed all the legal hurdles and paved the way for the establishment of an independent judiciary.\nIn 1995, Md Masder Hussain, then a district judge, on behalf of 441 subordinate judges, lodged a petition challenging government control over recruitment, transfer, placement, promotion, etc of judges. On May 7, 1997, the High Court delivered a judgment with eight directives. The government appealed and the Appellate Division delivered a historic verdict on December 2, 1999, outlining 12 directives. The judgment recommended the creation of a separate judicial service; establishment of a judicial service commission; separate service rules under Article 115 of the constitution; a judicial pay commission; financial and administrative autonomy to reduce executive interference in the judiciary, etc. This was, however, not followed through properly.\nIn 2007, during the caretaker government headed by former Bangladesh Bank governor Fakhruddin Ahmed, the long-awaited steps to set up the Judicial Service Commission, the judicial service rules, and the Judicial Pay Commission were taken. On November 1, 2007, the caretaker government formally separated the lower judiciary from the executive, as a major part of implementing the 1999 Appellate Division verdict. But the dream of a full separation remained elusive.\nOn November 30, 2025, the current government issued the Supreme Court Secretariat Ordinance, formally establishing a separate secretariat for the judiciary, the most vital of steps for an independent judiciary.\nSo why did it take 53 years to do something so clearly spelt out in Part II of the constitution under the Fundamental Principles of State Policy, that \"the State shall ensure the separation of the judiciary from the executive organs of the State\"?\nThere are two basic reasons: first, our political culture of non-accountability and, second, a bureaucratic stranglehold that never allows the growth of independent institutions, especially those that can question their authority.\nFrom the start, we favoured a powerful government and brought in a constitution in which the distribution of power among the three organs of the State—the legislature, judiciary, and executive—favoured the last. We misinterpreted Lincoln's dictum of a \"government of the people, by the people and for the people\" to mean that as long as a government is elected, whatever it does reflects the \"will\" of the people and must therefore be allowed a free hand in running public affairs. In forming a powerful government, we missed the chance for an accountable one.\nAs for the legislative branch, from the very start, we did not allow it to evolve as an independent institution. It has always acted as a rubber stamp of the majority party in parliament. The fact that we never separated the role of the Leader of the House from that of the head of government—the prime minister—brought the House directly under the control of the latter.\nFirst in Pakistan and later in Bangladesh, Quaid-e-Azam Mohammad Ali Jinnah and Bangabandhu Sheikh Mujibur Rahman, founders of the two states respectively, chose to occupy the highest executive office. This made the legislature totally subservient to the head of government. In both Jinnah's and Mujib's cases, the same person held the positions of Leader of the House, head of the government, and head of their party. This did not provide the opportunity for the House to emerge with any real degree of independence. In Pakistan's case, Jinnah chose to be governor-general—the post that Lord Mountbatten had held—instead of being prime minister, as Nehru did in India, thus diminishing the prospect of the rise of a parliamentary system of government in Pakistan for which the struggles continue even today.\nMujib, on the other hand, opted to be prime minister—although he was president of the government-in-exile—and thereby shifted the focus to the elected House. However, he did not show the foresight to appoint a separate Leader of the House and a different party president. Combining the three posts—prime minister, leader of the House, and party chief—created a lethal convergence of power that inevitably led to centralisation in governance that proved disastrous and found its ultimate expression under Sheikh Hasina.\nThe role of the Speaker was always that of a lackey rather than an independent manager of parliamentary proceedings. If we examine the type of individuals who were \"appointed\" as Speakers, it becomes clear that none had either the personality or the intention to uphold the interests of the House above those of the ruling party, and especially the prime minister. Most of them owed their positions to the PM—in the case of Shirin Sharmin, the last of them, she was not even an elected MP but a chosen one from the reserved seats for women—and hence they tended to serve the chief executive rather than the highest seat of law-making.\nAs for elected MPs, they rarely gave importance to the voters who elected them after the polls. Instead, their allegiance shifted almost entirely to the party that nominated them. This was due to the perks, development funds, and various executive powers that came only from the ruling party and government, and not from voters, resulting in further erosion of the legislature.\nIt was the judiciary that had some chance of keeping the executive accountable, and hence everything was done to clip its wings in every way possible. Here, the role of bureaucrats was critical. Not only did they act on their own to subvert the rise of an independent judiciary, but they also advised politicians that such an institution would pose a threat to the government's freedom to act.\nThere is also the fact that members of the judiciary itself, both at junior and higher levels, contributed to its subservience. There is not a single instance of a judge resigning in protest against the misuse of the justice system. On the contrary, several examples show that the judiciary, far from resisting, actually welcomed executive interference. Through denial of bail, jailing dissenters, permitting the misuse of remand, not questioning the merit of frivolous cases at the very outset, and not upholding an individual's right to liberty and protection from legal harassment, members of the judiciary often allowed the executive to flaunt its power and intimidate the people. They conveniently, and sometimes self-servingly, forgot that the law exists for justice. When its application compromises justice, a judge must opt for justice, not an interpretation that serves the government over citizens.\nThe law, for example, clearly states that only one case may be lodged for a particular crime, yet dozens—sometimes hundreds—were permitted. Why did the judiciary never question this? When denying bail, the court rarely seems to reflect on the fact that a person's liberty, guaranteed by the constitution, is being taken away. The misuse of remand barely enters a judge's mind. The handling of cases involving political opponents of past governments stands as the most shameful abdication of the courts' role. Regrettably, elements of this pattern remain even today, which we hope will soon cease.\nThe instances of naming hundreds of accused and, in many cases, arresting them without a shred of evidence have reduced the image of the judiciary to that of an extension of government. The judiciary may argue that these are abuses by law enforcement agencies and fall outside its purview. But when the misuse and abuse of the law denigrate the judiciary as a whole, should it not publicly condemn such practices or urge the government to stop them? The higher judiciary, especially the chief justice, can and should express such views. The moral and ethical values of their profession oblige this role.\nThe point we wish to emphasise is that even after all the rules are passed and judicial independence is formally guaranteed, its actual implementation will require moral courage from judges themselves. They must adhere to the spirit of dispensing justice, rather than just mechanically interpreting the law, and certainly not serving the executive branch or the \"privileged accused.\" Under various legal loopholes, cases remain pending for years. The misery this causes for the poor, ordinary people, and the amount of money and time they have to spend to appear at each hearing, seems to elicit little concern from our judges.\nSo, judges, especially those of the High Court and the Appellate Division, must always uphold the supremacy of the judiciary and never do anything that directly or indirectly denigrates this revered institution. We think the most shameful insult that the higher judiciary inflicted upon itself was when five Appellate Division judges stood on their knees instead of their feet in compliance with the wishes of the then prime minister to oust a sitting chief justice, SK Sinha. The reason? Because he refused, on constitutional grounds, to do what Sheikh Hasina wanted. Instead of standing with the chief justice, they declared that they would henceforth not work with him. The credibility and prestige of the Appellate Division stood shattered.\nAn immediate test of the coming elected executive will be how quickly and faithfully it passes into law the elements of judicial independence that have so far been put in place through ordinances. We also expect that future MPs will demonstrate greater respect for their voters, and not merely engage in habitual genuflection to their party, especially to its chief.\nWith the final guaranteeing of judicial independence, we hope this vital institution of modern civilisation will finally emerge here with the glory and prestige it deserves by serving the people rather than the government of the day.\nIf the executive operates within its limits, the legislature—especially MPs— restrains itself to build a transparent and accountable governance framework instead of advancing partisan interests or chasing so-called development projects, and the judiciary truly distinguishes itself in the service of accountability and justice for all, especially the poor, then—and only then—will we have a real chance to build a genuine democracy in this beloved country of ours.\nMahfuz Anam is the editor and publisher of The Daily Star.\n\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "An independent judiciary seems near at hand, but can still slip away",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/the-third-view/news/independent-judiciary-seems-near-hand-can-still-slip-away-4050826",
        "news_paper_name": "The Daily Star",
        "publish_date": "06-12-2025"
    },
    {
        "full_article": "Mothers are the epitome of sacrifice, the symbol of eternal kindness and the always-available emotional anchor. They will protect their children with their lives. Yet these same loving mothers (along with fathers) often end up raising the very men who grow into entitled, emotionally stunted adults. Patriarchy is not just perpetuated by men but by women conditioned by patriarchal values.\nIn societies such as ours, where male preference dominates every class, religion and neighbourhood, mothers unintentionally become collaborators of male exceptionalism. They raise boys who believe they are gifts from heaven, which wouldn't bother the rest of us women if we didn't have to live with them for the rest of our adult lives.\nDisclaimer: Yes, there are those rare, absolutely lovely men who genuinely believe women are their equals, who will fight for our rights with other men, happily take care of the baby and cook dinner without feeling emasculated and well, basically, who seem almost too good to be true. Most likely, it was their mothers who drilled into their heads that respect is non-negotiable—\"or else no supper, no TV, no video games.\" But these men are the exceptions.\nLet's talk about the majority of men. From the moment a boy is born, the royal treatment begins. Just like in the UNICEF cartoon show Meena, which exposes the blatant bias towards sons, the boys get the choicest food, the nicer toys, and the best opportunities available. Girls, on the other hand, are trained, gently but firmly, to give up things for their brothers, to take care of them, and consider their needs more important than their own. And it is the mothers who play a big role in establishing these rules from the very beginning.\nBy the time boys reach adulthood, many mothers have held them so tightly in the grip of affection that it borders on emotional smothering. This makes the recipient used to being the sunshine of the household, unwilling to accept anything less than premium treatment, regardless of his own behaviour.\nWhen the son marries, the dynamics shift quite dramatically. The same gentle, self-sacrificing, doting mother can transform into a territorial hawk. She devotes her energies to save her son from the inept, unfit female she must call her daughter-in-law. Trying to prove that her daughter-in-law falls short in every category becomes a primary mission. The cooking is never quite right, the son is not being taken care of because the daughter-in-law is so lazy, the children are not being raised properly, her relatives visit too often, she has no sense of aesthetics and just comes from \"inferior stock\". Meanwhile, these mothers continue to pour their adoration on their sons like the thickest rabri (cream concentrated from unbelievable amounts of milk). The son must have the head of the fish, the juice from fifty pomegranates and the eggs of the hilsa—basically the best of everything. This will also extend to the grandsons, but never the daughter-in-law. Because males are born with this privilege.\nOf course, there are exceptions: sometimes the daughter-in-law is the hyena, and the mother-in-law the suffering rabbit, because the son has turned out to be a spineless maggot or is in cahoots with the scheming wife. But again, these aren't the norm.\nBut why do women do this? Why do they perpetuate this absurd sense of male entitlement that turns so many men into selfish, insensitive, boorish beings?\nBecause this is what they have seen all their lives. Boys as kings, girls as helpers. Sons as legacy; daughters as support staff.\nUnfortunately, religious norms are interpreted through the same patriarchal cultural context. Everything reinforces the idea that men are inherently superior.\nAnd so, the cycle continues.\nA boy who always gets his way and is never taught compassion or accountability grows into a man who expects the same treatment from the world. When he doesn't get it, disappointment quickly turns into frustration, anger, and sometimes even violence.\nContrary to popular belief, raising a boy is harder than raising a girl. Because society already places the boy on a pedestal. So, how do we teach him how to climb down?\nFor starters, mothers must recognise that they are their sons' first teachers and arguably the most influential ones. This means teaching boys from childhood that girls are equal in value and deserve equal respect. Mothers must hold their sons to the same behavioural standards as daughters. They must expect their sons to have empathy, responsibility and generosity, and not make excuses for them when they are being selfish, arrogant and rude.\nAnd when the son grows up and marries, mothers must swallow that instinct to cling and be territorial. Instead of searching for faults in the daughter-in-law, they can actively look for reasons to praise her, support her, and make her feel welcome. Instead of serving the son the biggest portion, they might ask the daughter-in-law what her favourite dish is.\nThese small shifts matter and can change the way men behave towards women, including their mothers, whom many take for granted.\nBecause if mothers keep showering sons with unquestioned indulgence, they risk raising men who believe the world owes them the same level of devotion and lash out when it doesn't. If we want decent men, we must start by raising decent boys.\nAasha Mehreen Amin is joint editor at The Daily Star.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Dear mothers, stop coddling your sons",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/no-strings-attached/news/dear-mothers-stop-coddling-your-sons-4050831",
        "news_paper_name": "The Daily Star",
        "publish_date": "06-12-2025"
    },
    {
        "full_article": "The government-commissioned white paper on Bangladesh's much-publicised journey towards \"Digital Bangladesh\" has delivered a sobering verdict. What was once marketed as a transformative national project has now been revealed—through the task force led by Professor M Niaz Asadullah—to be mired in systemic governance failures, entrenched corruption, and pervasive political capture. The conclusion drawn by the task force, after reviewing 52 ICT Division projects, should worry anyone concerned with the country's development trajectory.\nThe white paper documents how political influence seeped into the very architecture of the previous Awami League government's digital modernisation drive: at least 12 major projects and 65 components were named after political personalities or directly leveraged for partisan visibility. Flagship connectivity initiatives such as Info-Sarker II and III devolved, in the report's words, into \"a textbook case of triple rent seeking.\" The Bangladesh Hi-Tech Park Authority—tasked with fostering innovation and industrial diversification—fared no better. Instead of nurturing a technology ecosystem guided by demand and feasibility, the authority found itself redirected towards political pageantry and patronage. IT parks and training centres were launched not on the basis of market need, infrastructure readiness or the capacity to attract tenants, but on where they could deliver the most partisan mileage.\nIrregularities revealed, includes: equipment priced at up to four times the global rate, cartel-like vendor networks, manipulated tenders, weakened state control over critical infrastructure, and an unhealthy reliance on private monopolies in connectivity projects. To shield themselves from scrutiny, some project authorities allegedly adopted \"dual governance\" models that enabled donor-affiliated consultants to influence procurement and programme design. Even education-focused initiatives such as the Sheikh Russel Digital Lab (SRDL) and School of Future were found to be non-functional. Meanwhile, the Digital Sylhet City Project has been one of the starkest examples of politicised failure. Conceived as an urban connectivity solution, it collapsed under the weight of patronage politics. Wi-Fi coverage reached less than five percent of targeted beneficiaries, and no agency accepted responsibility for its operations. These failures represent more than just wasted public funds—they constitute a profound lost opportunity for young Bangladeshis as the world accelerates into an era defined by digital capability. Reviewing one of the most celebrated projects of the previous regime is a necessary step towards understanding how the absence of democratic accountability erodes public institutions and drains scarce national resources. It shows that patron-client politics does not simply distort priorities; it often cripples entire governance mechanisms. The interim government must take the task force's recommendations seriously. And political leaders—whether in office or aspiring to be—would do well to absorb the lesson at the heart of this white paper: without transparency, oversight, and genuine accountability, no grand vision, however dazzling in rhetoric, can deliver the transformation it promises.\n",
        "headline_1": "Digital Bangladesh, a tale of governance failures",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/digital-bangladesh-tale-governance-failures-4051281",
        "news_paper_name": "The Daily Star",
        "publish_date": "06-12-2025"
    },
    {
        "full_article": "Nothing reveals the story of why we failed to institutionalise democracy in Bangladesh better than our failure to build an independent judiciary. Though it is clearly stated in our constitution, it took us 53 years or so to lay its final foundation stone. What edifice we will build on this foundation lies in our future.\nWith so many things we have criticised the interim government for, the separation of the judiciary is one area where it deserves our praise. Without a separate secretariat under the authority of the chief justice—for which an ordinance has been recently issued—the judiciary would never have come out of the dominance of the executive branch, and especially of the law ministry, which resulted in the total destruction of the legal system in the country. Thanks are due to Prof Yunus, the head of the government, and Asif Nazrul, the law adviser. Praise must also be extended to the current chief justice, whose relentless work behind the scenes brought about the present reality.\nWhat must not be overlooked is that none of our democratically elected governments—led by Khaleda Zia and Sheikh Hasina—or the military governments of General Ziaur Rahman and General H M Ershad did anything to set up an independent judiciary.\nThree events—one judgment (1999), one initiative by a caretaker government (Fakhruddin Ahmed, 2007), and another by the present interim government (Prof Yunus, 2025)—have finally removed all the legal hurdles and paved the way for the establishment of an independent judiciary.\nIn 1995, Md Masder Hussain, then a district judge, on behalf of 441 subordinate judges, lodged a petition challenging government control over recruitment, transfer, placement, promotion, etc of judges. On May 7, 1997, the High Court delivered a judgment with eight directives. The government appealed and the Appellate Division delivered a historic verdict on December 2, 1999, outlining 12 directives. The judgment recommended the creation of a separate judicial service; establishment of a judicial service commission; separate service rules under Article 115 of the constitution; a judicial pay commission; financial and administrative autonomy to reduce executive interference in the judiciary, etc. This was, however, not followed through properly.\nIn 2007, during the caretaker government headed by former Bangladesh Bank governor Fakhruddin Ahmed, the long-awaited steps to set up the Judicial Service Commission, the judicial service rules, and the Judicial Pay Commission were taken. On November 1, 2007, the caretaker government formally separated the lower judiciary from the executive, as a major part of implementing the 1999 Appellate Division verdict. But the dream of a full separation remained elusive.\nOn November 30, 2025, the current government issued the Supreme Court Secretariat Ordinance, formally establishing a separate secretariat for the judiciary, the most vital of steps for an independent judiciary.\nSo why did it take 53 years to do something so clearly spelt out in Part II of the constitution under the Fundamental Principles of State Policy, that \"the State shall ensure the separation of the judiciary from the executive organs of the State\"?\nThere are two basic reasons: first, our political culture of non-accountability and, second, a bureaucratic stranglehold that never allows the growth of independent institutions, especially those that can question their authority.\nFrom the start, we favoured a powerful government and brought in a constitution in which the distribution of power among the three organs of the State—the legislature, judiciary, and executive—favoured the last. We misinterpreted Lincoln's dictum of a \"government of the people, by the people and for the people\" to mean that as long as a government is elected, whatever it does reflects the \"will\" of the people and must therefore be allowed a free hand in running public affairs. In forming a powerful government, we missed the chance for an accountable one.\nAs for the legislative branch, from the very start, we did not allow it to evolve as an independent institution. It has always acted as a rubber stamp of the majority party in parliament. The fact that we never separated the role of the Leader of the House from that of the head of government—the prime minister—brought the House directly under the control of the latter.\nFirst in Pakistan and later in Bangladesh, Quaid-e-Azam Mohammad Ali Jinnah and Bangabandhu Sheikh Mujibur Rahman, founders of the two states respectively, chose to occupy the highest executive office. This made the legislature totally subservient to the head of government. In both Jinnah's and Mujib's cases, the same person held the positions of Leader of the House, head of the government, and head of their party. This did not provide the opportunity for the House to emerge with any real degree of independence. In Pakistan's case, Jinnah chose to be governor-general—the post that Lord Mountbatten had held—instead of being prime minister, as Nehru did in India, thus diminishing the prospect of the rise of a parliamentary system of government in Pakistan for which the struggles continue even today.\nMujib, on the other hand, opted to be prime minister—although he was president of the government-in-exile—and thereby shifted the focus to the elected House. However, he did not show the foresight to appoint a separate Leader of the House and a different party president. Combining the three posts—prime minister, leader of the House, and party chief—created a lethal convergence of power that inevitably led to centralisation in governance that proved disastrous and found its ultimate expression under Sheikh Hasina.\nThe role of the Speaker was always that of a lackey rather than an independent manager of parliamentary proceedings. If we examine the type of individuals who were \"appointed\" as Speakers, it becomes clear that none had either the personality or the intention to uphold the interests of the House above those of the ruling party, and especially the prime minister. Most of them owed their positions to the PM—in the case of Shirin Sharmin, the last of them, she was not even an elected MP but a chosen one from the reserved seats for women—and hence they tended to serve the chief executive rather than the highest seat of law-making.\nAs for elected MPs, they rarely gave importance to the voters who elected them after the polls. Instead, their allegiance shifted almost entirely to the party that nominated them. This was due to the perks, development funds, and various executive powers that came only from the ruling party and government, and not from voters, resulting in further erosion of the legislature.\nIt was the judiciary that had some chance of keeping the executive accountable, and hence everything was done to clip its wings in every way possible. Here, the role of bureaucrats was critical. Not only did they act on their own to subvert the rise of an independent judiciary, but they also advised politicians that such an institution would pose a threat to the government's freedom to act.\nThere is also the fact that members of the judiciary itself, both at junior and higher levels, contributed to its subservience. There is not a single instance of a judge resigning in protest against the misuse of the justice system. On the contrary, several examples show that the judiciary, far from resisting, actually welcomed executive interference. Through denial of bail, jailing dissenters, permitting the misuse of remand, not questioning the merit of frivolous cases at the very outset, and not upholding an individual's right to liberty and protection from legal harassment, members of the judiciary often allowed the executive to flaunt its power and intimidate the people. They conveniently, and sometimes self-servingly, forgot that the law exists for justice. When its application compromises justice, a judge must opt for justice, not an interpretation that serves the government over citizens.\nThe law, for example, clearly states that only one case may be lodged for a particular crime, yet dozens—sometimes hundreds—were permitted. Why did the judiciary never question this? When denying bail, the court rarely seems to reflect on the fact that a person's liberty, guaranteed by the constitution, is being taken away. The misuse of remand barely enters a judge's mind. The handling of cases involving political opponents of past governments stands as the most shameful abdication of the courts' role. Regrettably, elements of this pattern remain even today, which we hope will soon cease.\nThe instances of naming hundreds of accused and, in many cases, arresting them without a shred of evidence have reduced the image of the judiciary to that of an extension of government. The judiciary may argue that these are abuses by law enforcement agencies and fall outside its purview. But when the misuse and abuse of the law denigrate the judiciary as a whole, should it not publicly condemn such practices or urge the government to stop them? The higher judiciary, especially the chief justice, can and should express such views. The moral and ethical values of their profession oblige this role.\nThe point we wish to emphasise is that even after all the rules are passed and judicial independence is formally guaranteed, its actual implementation will require moral courage from judges themselves. They must adhere to the spirit of dispensing justice, rather than just mechanically interpreting the law, and certainly not serving the executive branch or the \"privileged accused.\" Under various legal loopholes, cases remain pending for years. The misery this causes for the poor, ordinary people, and the amount of money and time they have to spend to appear at each hearing, seems to elicit little concern from our judges.\nSo, judges, especially those of the High Court and the Appellate Division, must always uphold the supremacy of the judiciary and never do anything that directly or indirectly denigrates this revered institution. We think the most shameful insult that the higher judiciary inflicted upon itself was when five Appellate Division judges stood on their knees instead of their feet in compliance with the wishes of the then prime minister to oust a sitting chief justice, SK Sinha. The reason? Because he refused, on constitutional grounds, to do what Sheikh Hasina wanted. Instead of standing with the chief justice, they declared that they would henceforth not work with him. The credibility and prestige of the Appellate Division stood shattered.\nAn immediate test of the coming elected executive will be how quickly and faithfully it passes into law the elements of judicial independence that have so far been put in place through ordinances. We also expect that future MPs will demonstrate greater respect for their voters, and not merely engage in habitual genuflection to their party, especially to its chief.\nWith the final guaranteeing of judicial independence, we hope this vital institution of modern civilisation will finally emerge here with the glory and prestige it deserves by serving the people rather than the government of the day.\nIf the executive operates within its limits, the legislature—especially MPs— restrains itself to build a transparent and accountable governance framework instead of advancing partisan interests or chasing so-called development projects, and the judiciary truly distinguishes itself in the service of accountability and justice for all, especially the poor, then—and only then—will we have a real chance to build a genuine democracy in this beloved country of ours.\nMahfuz Anam is the editor and publisher of The Daily Star.\n\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "An independent judiciary seems near at hand, but can still slip away",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/the-third-view/news/independent-judiciary-seems-near-hand-can-still-slip-away-4050826",
        "news_paper_name": "The Daily Star",
        "publish_date": "06-12-2025"
    },
    {
        "full_article": "As the country hurtles towards a general election in February, the law and order situation continues to cause concerns. Reports about recent incidents such as the twin killings outside a judge's court in Khulna or the viral footage of a politician gunned down in a shop in Dhaka's Pallabi area—however isolated they may seem—contract the optimism of Home Adviser Jahangir Alam Chowdhury who insists that there is \"no risk\" of the security situation deteriorating before the polls. He claims the environment is \"steadily improving\" following the tumultuous ousting of the Awami League regime. This, however, remains at odds with the reported reality.\nData from the Centre for Governance Studies (CGS) suggests that the country is still reeling from that violent hangover. Firearms-related offences surged by 30 percent year-on-year in the first half of 2025. Police ledgers are equally dismal: in the past 15 months, 4,809 murder cases were filed nationwide, 3,236 of them in the first 10 months of this year, as this newspaper reported. That equates to more than 10 bodies a day. Further CGS data offers a slightly more nuanced, though hardly reassuring, view. The monthly average of murders fell to 322 in the first half of this year from 343 in the same period a year earlier. However, this is still a roughly 28 percent increase over the 2023 average.\nThe problem is threefold. First, the machinery of law enforcement remains brittle. The police force, having acted as the blunt instrument of the previous regime, collapsed in morale and efficacy following last year's uprising. They have yet to regain their footing. A police spokesperson admits that stopping targeted killings—often born of hyper-local grudges—is difficult. Second, during the chaos of the political changeover, many police stations were looted. More than 1,300 firearms remain missing, a floating arsenal now likely in the hands of the gangs and political muscle carving up turf in different localities. Rewards offered for their return have yielded little. Third, the political vacuum is being supplemented by old habits. With the election schedule looming, prospective candidates are not merely canvassing; they are battling for dominance, with reports indicating a sharp rise in intra-party clashes. Worse still, \"top criminals,\" released from prison or emboldened by the security void, are now being recruited to intimidate rivals.\nThe interim government is tasked with shepherding a democratic transition, but the terrain is being mined by political vendettas, factional feuds, and a resurgent underworld. Security analysts warn that without a focused crackdown, specifically the recovery of illegal arms and the re-arrest of resurgent criminals, the days to the upcoming polls will hardly be peaceful. The government has done relatively well to stabilise the economy. Now, it must secure the streets to make sure the path to the ballot box becomes peaceful.\n",
        "headline_1": "Prevent pre-election violence at any cost",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/prevent-pre-election-violence-any-cost-4050626",
        "news_paper_name": "The Daily Star",
        "publish_date": "06-12-2025"
    },
    {
        "full_article": "We are concerned by the falling paddy prices across the country at a time when Aman harvesting is at its peak. Data from more than a dozen districts show that despite good yields this season, farmers are counting losses instead of profits. Paddy prices have reportedly fallen by Tk 100–150 per maund within just two weeks, leaving many growers unable to recover their production costs. Farmers and traders point to a surge in rice imports during the harvest season as the primary cause behind this sudden price drop. While the country imported no rice in FY 2023-24, it brought in 14.36 lakh tonnes in FY 2024-25—the highest in a decade. This has lowered paddy prices at a time when domestic supply is naturally at its peak.\nFor farmers, the consequences are severe. Growers like Shakiul Islam in Gaibandha and Sarwar Alam in Dinajpur report production costs of around Tk 1,240 per maund, yet the market is offering only Tk 1,150–1,180. According to the Bogura Department of Agricultural Extension (DAE), production costs for one kilogramme (kg) of Aman paddy increased by Tk 1 to Tk 31 compared to last year. Per bigha costs have also risen due to the higher prices of pesticides and fertilisers. Many farmers also allege that prices fall sharply when they sell, but rise once the grain reaches millers and traders. For those who already suffered losses from potato cultivation earlier this year, facing another round of financial uncertainty is particularly troubling.\nClearly, the government's decision to delay imports when prices were high, and then to rush imports during the domestic harvest has disrupted the market and pushed prices down artificially. Experts have rightly described this as a management failure. These actions have offered little relief to consumers while causing significant harm to growers. Moreover, the government's procurement target—only 50,000 tonnes at Tk 34 per kg—is far too small to meaningfully support farmers or stabilise prices. Strict quality requirements are also preventing many growers from selling their grain to government silos.\nTherefore, to ensure fair prices for Aman growers, the government must take decisive action. Imports should be suspended immediately, at least during the peak harvest period, and domestic procurement must be expanded substantially so that farmers can sell their produce at a better rate. Policies governing imports and procurement should be revised to align with domestic production cycles and protect growers. Last but not least, the government should consider forming an Agricultural Price Commission, as proposed earlier by agricultural experts and policymakers, to ensure fair prices for farmers, maintain market stability, and safeguard consumer interests.\n",
        "headline_1": "Ensure fair prices for Aman farmers",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/ensure-fair-prices-aman-farmers-4049941",
        "news_paper_name": "The Daily Star",
        "publish_date": "06-12-2025"
    },
    {
        "full_article": "For two weeks, essential health services and routine vaccination programmes have been disrupted as several groups of health workers, including government nurses, medical technologists, pharmacists, and health assistants, continue demonstrations to press long-standing demands. The consequences of such disruptions will be delayed treatment for critical patients, cancellation of basic health services and suspension of newborn registrations and vaccinations, which are essential for preventing disease outbreaks. Such disruptions are unacceptable in any functioning health system.\nSo why has the health ministry failed to resolve this dispute? The Directorate General of Health Services (DGHS) claims that most of the workers' demands have been accepted in principle and that implementation is \"in progress.\" Yet, the workers are not convinced and allege that earlier promises were never fulfilled. This loss of trust has become the core obstacle.\nThe demands themselves highlight long-standing structural issues. Health assistants seek amendments to recruitment rules, an upgrade of their entry post from grade 16 to grade 14, elimination of salary disparities, and recognition as technical staff. Medical technologists and pharmacists want their entry grade raised from 11 to 10—reforms they say have been promised before but never delivered. Nurses are also demonstrating over career progression and pay inequities. These demands merit careful consideration. However, prolonged work stoppages in essential services directly endanger lives and violate service regulations designed to protect patients. The threat of a complete shutdown of hospitals, clinics, diagnostic centres, and educational institutions underscores how vulnerable the health system is to administrative delays and inadequate labour-management mechanisms. Healthcare cannot be held hostage to stalled negotiations. This crisis exposes a larger weakness in public administration: a reactive approach that waits for public pressure instead of addressing these issues early, transparently, and with fixed timelines. When negotiations extend indefinitely and commitments are vague, workers lose faith. When health workers walk out, patients suffer.\nThe government must therefore act swiftly and decisively. If the demands are financially and structurally logical, the relevant ministries should publish a clear implementation roadmap with dates, responsible officials, and measurable steps. If some reforms require budget adjustments or longer timelines, those realities must be communicated openly. Only visible progress can restore credibility. At the same time, health workers must uphold their duty to ensure continuity of essential services. Many countries allow health-sector strikes only under minimum-service requirements. Bangladesh needs similar safeguards to prevent complete shutdowns of critical care and vaccinations. This crisis can be resolved quickly if the government demonstrates clear action and workers respond in good faith. Ultimately, a functional health system relies on trust between authorities, providers, and the public. Rebuilding that trust must begin now.\n",
        "headline_1": "Healthcare workers’ strikes cannot continue",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/healthcare-workers-strikes-cannot-continue-4049721",
        "news_paper_name": "The Daily Star",
        "publish_date": "06-12-2025"
    },
    {
        "full_article": "The latest Health and Morbidity Status Survey 2025 gives a stark warning about the nation's health. According to the survey, hypertension now affects 78 out of every 1,000 people, making it the most prevalent disease in the country. Not far behind are peptic ulcers (64 per 1,000) and diabetes (43 per 1,000). These chronic conditions require consistent monitoring, reliable diagnostics, and long-term treatment. Their rising prevalence points to a population increasingly burdened by non-communicable diseases at a scale our current health system is not prepared to manage.\nThe survey covered 1.9 lakh people from 47,040 households between November and December last year, and found that one-third of respondents experienced some form of illness in the 90 days preceding the study. Another troubling finding is that 51.2 percent of respondents relied on self-treatment or local pharmacies, while around 20 percent sought private healthcare, and only 11 percent went to government facilities. Such high dependence on informal care reflects a severe lack of accessibility to public healthcare. It also fuels antimicrobial resistance (AMR) as antibiotics—often dispensed without proper diagnosis—are frequently misused. Experts warn that AMR is no longer a distant threat; it is a growing reality, making common infections harder and more expensive to treat.\nAnother finding deserving the government's attention is the higher illness rates among women, both young and elderly, compared to men. Moreover, the persistent burden of out-of-pocket expenditure on the population, which averaged Tk 2,487 in the three months preceding the survey, is another serious concern. Such high healthcare costs are crippling for low- and middle-income families. The alarming trends underscore the urgency of health sector reforms.\nThe Health Sector Reform Commission had already made crucial recommendations with urgency to address the challenges exposed by the survey. It is, however, concerning that out of its 33 key reform proposals, the government has halted implementations of 15 following the Cabinet Division review. Notably, the excluded recommendations include VAT and tax exemptions on essential antibiotics and medicines for cancer, diabetes, and hypertension, along with proposals for a permanent health commission and a separate public service commission for doctor recruitment. Pushing back these reforms at a time when our health sector is already facing major challenges such as inadequate funding, a shortage of health workers, unequal access to services, and weak governance is most unfortunate.\nWe urge the government not to downplay the issues plaguing our health sector and to urgently implement the reforms to make healthcare delivery pro-people.\n",
        "headline_1": "A warning for our health system",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/warning-our-health-system-4049086",
        "news_paper_name": "The Daily Star",
        "publish_date": "06-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 06, 2025 00:00:00  \nWith close to 9.0 million hectares of available cultivable land, which too is shrinking by around 2,500 hectares annually, thanks mainly to urbanisation, feeding some 175 million mouths is a challenge of miraculous proportions. But the farming community of the country has been successfully meeting the challenge so far. Obviously, extensive application of modern farm practices had helped achieve that feat. But, of late, new challenges emerging from climate change, rising input costs and other issues are coming in the way of the farming communality's ability to maintain the robust productivity they achieved so far. Despite their best efforts, the proportion of output in comparison to the inputs, is not increasing but falling. In other words, the returns are diminishing. According to a new study, styled, 'Perspectives on the Agrifood System in Bangladesh', carried out by a state research body and policy think tank, Bangladesh Institute of Development Studies (BIDS), the country's agrifood system growth, has begun to slow down with the 'total factor productivity (TFP)' levelling out. TFP is the output that a given sum of inputs including labour and capital can generate. \nThat means the country's agriculture sector which employs around 40 per cent of the country's workforce and shares an estimated 12 per cent of the GDP, has lost its growth momentum despite the fact that this sector, since 2000, has been able to achieve rapid labour and proactivity gains. The villain, as is well- known to everybody by now, is the climate variability with its increasing level of temperatures and erratic rainfalls resulting in crop failures and ever-declining yields of rice, wheat, pulses, vegetables and oilseeds. As reported, researchers, through their long-term modelling have projected that such decline in the yields of these vital crops will continue until 2050. It is no doubt a piece of bad news for the farming sector in particular and the nation in general. Actually, what experts have found out through their researches is identical to the experience being gained by the workers in the field by way of their daily struggles. As the extreme heat is forcing labourers to work for fewer hours, their daily earnings, as expected, have been falling in direct proportions. Unsurprisingly, the research findings also say that agricultural labour productivity, in the face of extreme heat, has dropped by an estimated 11 per cent. In some areas of the country that have been experiencing very extreme heat waves, the workers' earnings have dropped further by about 20 per cent, say reports. \nAs suggested by experts, an obvious way out of this low productivity trap is crop diversification on a wider scale, adoption of modern cultivation practices with the application of advanced technology and better risk management. But so far as crop diversification is concerned, there are certain constraints. For example, rice occupies about 80 per cent of the gross cropped area of agricultural land. Add to that the country's continued dependence on the imports of food items including some basic items including wheat, pulses, edible oil, dairy, etc. it implies that the nation's food system is exposed to global market volatility. The domestic food market, on the other hand, is also held hostage to the oligopoly of millers and big corporate interests.\nOverall, it implies a constant challenge to ensuring the nation's food security. All these issues call for enhancing the country's agro-productivity through a right mix of modern farming practice and economical use of resources. Hopefully, through helping farmers and entrepreneurs to efficiently manage farm production and adopting a proper food policy, the government should be able to meet the rising challenge to the nation's food security.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Managing farm productivity risks",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/managing-farm-productivity-risks-1764944103",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       December 06, 2025 00:00:00  \nCounterfeiting is a crime that has existed for millennia, but in contemporary Bangladesh it has evolved into one of the most sophisticated forms of financial deception. Detecting the newest generation of fake notes has become extraordinarily difficult, even bordering on impossible for the untrained eye. Professional bankers who handle cash daily also fall victim at times when they unknowingly accept counterfeit currency from customers and later end up compensating the loss from their own pockets. If experts cannot reliably tell the fake from the real, what hope is there for the rest of us? \nOf course, counterfeit notes do not all come from the same mould. They exist on a spectrum of sophistication that stretches from crude reproductions to high-grade forgeries highly difficult to identify. The most dangerous variety emerges when genuine 100-taka notes are chemically bleached and reprinted as 500-taka notes. The original paper and many of the embedded security features remain intact while the new printing achieves striking precision in alignment and colour. Because the paper's texture feels right, people rarely look twice. \nIn contrast, ordinary counterfeits that are not derived from genuine currency reveal themselves more readily once they circulate and lose their initial crispness. When these notes first enter the market, they appear new and crisp and only the highly trained can spot the subtle differences at this stage. But as they move from hand to hand, their disguise starts to slip. The paper thins, the surface goes limp and the colours lose their sharpness, alerting the holder to its inauthenticity. This leaves the person holding the note to shoulder the loss and face the quiet suspicion that follows.\nA generation ago, most Bangladeshis encountered counterfeit money only in films and television dramas. That world belongs to the past. Reports now indicate that fake currency enters the country in volumes comparable to narcotics smuggled across the same borders. Recent months have witnessed multiple large-scale seizures by the RAB, police and DB units where entire factories fitted with offset printers, specialised inks and counterfeit notes worth millions have been uncovered. \nThe methods of production and distribution have also adapted to the technological age. Online platforms now serve as open marketplaces for fake currency. Social media sites including Facebook, TikTok, Telegram and WhatsApp carry offers of what sellers describe as A grade prints or notes that look exactly like the original. Some Facebook posts even brazenly quote prices of about Tk 36,000 for 100,000 in counterfeit currency, implying a perceived quality so high that such a premium can be demanded. \nThe approaching national election creates an environment that makes the circulation of large volumes of fake money more likely. Campaigns need massive amounts of cash to operate. Naturally, this cash changes hands rapidly, often in low light or hurried conditions where careful scrutiny is nearly impossible. Such conditions give counterfeiters a convenient opening to push forged notes into the market. Illegal gambling dens provide another long-established channel for distributing fake currency. High stake games involve stacks of notes exchanged under pressure and in dimly lit rooms. Participants know that counterfeit notes may appear during these exchanges, yet the speed of the games leaves little space for caution. \nThe entry of such large volumes of fake currency into the financial system has severe implications for the economy. Currency retains its value because people trust that a note received in exchange for labour or goods will be accepted tomorrow in the same way it is accepted today. Widespread counterfeiting weakens this confidence. The immediate victim of a counterfeit note suffers a dual loss upon discovery. They lose the face value of the note and they also risk being accused of intentional fraud when they attempt to pass it on. When people begin to fear the very notes they hold, the entire economic mechanism is at risk of paralysis. \nViewed from the wider economic lens, counterfeit money increases the effective volume of cash in circulation without a corresponding rise in goods and services. The result is downward pressure on purchasing power and upward pressure on prices. This disproportionately harms low-income groups and complicates the government's fiscal and monetary policy implementation. In this context, counterfeit currency constitutes a serious threat to national security as well. Within the existing political reality, the flooding of markets with fake notes could very well be used as a tool to rattle the economy and set the public on edge.\nBecause of modern security features, counterfeit notes can never be perfect and always have some gaps. Some counterfeit notes bleed colour when wet while others have a distinct chemical smell from the ink. Even the most carefully crafted forgeries are usually exposed by machines designed to detect flaws. That said, allegations of counterfeit notes being dispensed by ATMs would be deeply troubling if ever proven. \nThe practical reality is that ordinary citizens lack the time, tools and often the trained habit to meticulously check every note in their busy lives. Their vulnerability increases because the legal system, despite its best efforts, has been unable to stem the tide. Individuals caught producing or distributing counterfeit money often face prison sentences but upon release, whether after serving their term or on bail, they frequently return to the same criminal activities. This cycle of recidivism is common. Ensuring that convicted individuals receive sentences commensurate with their crimes would be an important step in curbing this trade. \nIn the end, the most effective response to technology-enabled counterfeiting is more technology. Digital payments through mobile financial services, cards and bank transfers eliminate the possibility of counterfeit insertion entirely. Since counterfeit notes spread through cash-based exchanges, reducing dependence on physical currency would directly undermine the criminal groups that profit from it. \nEach fake note embodies a deliberate assault on honest labour. The worker who toils through heat and dust only to receive worthless paper suffers a profound injustice. Eliminating counterfeit money therefore not only preserves trust in currency but also the principles of trust, labour and equity that support a stable society.\nshowaib434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Fake note and the  honest man's loss",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/fake-note-and-the-honest-mans-loss-1764944688",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       December 06, 2025 00:00:00  \nThree and a half decades ago, people of Bangladesh ousted the country's first autocratic regime through a mass uprising that reached its climax during the last three months of 1990. The united stance of all the students' organisations, keeping aside their political rivalry for the time being, on October 10 of the year became the ultimate turning point of the mass movement. On the day, Jihad, an activist of Jatiyatabadi Chhatra Dal (JCD) was shot dead in Dhaka during the anti-Ershad movement. Killing of Jihad triggered massive protests across the country while student leaders of Dhaka University took oath to move together until the fall of the autocratic Ershad. \nThe following 55 days were eventful as students inspired the mass people to join the agitation and also compelled the leading political parties intensify movement. Things turned another crucial stage on November 27 when physician Shamsul Alam Khan Milon was killed by goons of Ershad at Dhaka University campus. It sparked horror and anger among the people and issued the final call for Ershad. People dared to defy curfew and police barricades across the country making it impossible for Ershad government to keep the state functional. \nSensing the helplessness of the autocratic regime, the two major political parties, led by Khaleda Zia and Sheikh Hasina, along with others made the final push. Finding no other way dictator Ershad, who had been in power for more than eight years, announced his decision to step down on December 4. This scribe, then a college student, vividly remembered the moment of getting the news through Voice of America Bangla service at night. On December 6, the dictator formally resigned by handing over the power to Shahabuddin Ahmed, the chief justice of the Supreme Court, as the acting president. Thus, people of Bangladesh witnessed another victory at their long fight to restore democracy.\nLooking back, the democratic movement against the dictatorial regime of Erashd faced a series of barriers due to division among the political parties. On March 24 in 1982, H M Ershad, the then army chief, forcefully removed democratically elected president Abdus Sattar and declared himself as Chief Martial Law Administrator (CMLA). As Sattar was nominated a candidate of Bangladesh Nationalist Party (BNP), Ershad's action was mainly targeted against the political party founded by Major Ziaur Rahman, the first military ruler of Bangladesh. The assassination of Zia on May 30 in 1981 was a turning point in the history of Bangladesh that opened the window for more than a decade-long dictatorial regime in the country. \nAfter the brutal assassination of Bangabandhu Sheikh Mujibur Rahman along with his family members except two daughters on August 15 in 1975, the country entered into an uncharted territory as following months were turbulent with bloodsheds and uncertainty. Zia, however, took over as CMLA in 1976 and became the sixth president of Bangladesh on 21 April in 1977. He gradually brought some stability in the country and re-introduced multi-party democracy and founded BNP though many of his moves and works were contentious. Some people term 15 years of Zia-Ershad regime (1975-1990) as a black chapter in the history of Bangladesh whereas many argue that Mujib regime (1972-1975) was nothing but chaotic and full of misrule. The truth is, however, complex and it is not easy to evaluate the Mujib and Zia regimes dispassionately. \nErahsd regime was full of bad governance and intimidation though the dictator apparently tried to improve the lives of people with a limited success. He largely ignored the demand for democracy and economic advancement. His artificial effort to democratise the country by arranging third and fourth national elections in 1986 and 1988 flopped. To validate his illegal power grabbing he held a national referendum in 1985 and claimed that with 70 per cent turnaround he won over 90 per cent of 'yes' vote despite a clear boycott by mass people. In this process, he distorted the election culture and institutions. The list of his misdeed is long.\nInterestingly, after his ouster in 1990, Ershad got a political lifeline in 1996 when Bangladesh Awami League (BAL) returned to power after 21 years and Hasina became the prime minister for the first time. An unseen future of alliance had seeded and Ershad continued to support Hasina until his death on July 14 in 2019. A dictator extended his support to another dictator only to undermine the democratic aspiration of the mass people.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Lingering curse  of autocracy",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/lingering-curse-of-autocracy-1764944728",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 06, 2025 00:00:00  \n\nA growing number of young people in our country are becoming increasingly trapped in mobile games, online betting and virtual casinos. With easy access to smartphones and the internet, combined with a lack of proper supervision, these harmful activities are spreading rapidly among the youth. Many students are drifting away from their studies, responsibilities and family life. They spend long hours on their phones, risking money on gambling-based platforms. As a result, they suffer financial losses, alongside moral, emotional and psychological harm.\nThis issue is no longer limited to individual behaviour; it has emerged as a serious social concern with long-term implications. If timely and effective steps are not taken, a significant portion of our young generation may fall victim to this destructive addiction, jeopardising not only their personal development but also the nation's future human resources.\nTo address this growing threat, reliance on strict law enforcement alone will not suffice. A coordinated effort from families, educational institutions, and the government is crucial. Online gambling websites and mobile-based betting apps must be identified, restricted and shut down to curb accessibility. At the same time, continuous awareness programmes should be launched to educate young people about the risks associated with online gambling and excessive gaming. Schools and colleges should play a proactive role by promoting creative activities, sports and community engagement, thereby offering healthier and more constructive alternatives.\nProtecting the youth is essential for safeguarding the nation's overall progress. Now is the time to take strong, effective and sustained action to prevent an entire generation from falling into the trap of digital addiction.\nMuhammad Shafayat Hussain\nStudent\nDepartment of Physics\nKushtia Government College, Kushtia\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Rising threat of online gambling",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/rising-threat-of-online-gambling-1764944756",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-12-2025"
    }
]