[
    {
        "full_article": "The Budget session of Parliament was notable for reasons both good and bad. The sittings of the two Houses stretched beyond midnight to clear the Waqf (Amendment) Bill 2025. The debates reflected the significant divergence of opinion on the management of Waqf properties, but were held in a convivial atmosphere. The Chairs of both Houses were elated to preside over a productive session and the ruling BJP was content to find allies strongly on its side, particularly on the Waqf law amendment. Parliament also approved President’s Rule in Manipur, following debates held past midnight. The Opposition was buoyant that it got to have its say. It had its constituents holding together, and it even attracted some fence-sitters on select issues during the session. The BJP not only managed to steer the legislative agenda but also played to the gallery to please its political constituency. It was, however, not all good news. Off the floor of Parliament, business advisory committee meetings of the two Houses saw sharp exchanges, in one instance prompting Rajya Sabha Chairman Jagdeep Dhankhar to walk out. The stand-off between the Congress and Lok Sabha Speaker Om Birla, on the Lok Sabha Leader of the Opposition, Rahul Gandhi, not being given adequate opportunities to speak, remained unresolved.The vote on the Waqf Bill exposed the differences within the Biju Janata Dal (BJD) as well as the divergence between prospective allies, the BJP and the AIADMK. The BJD’s decision not to issue a whip riled many within the party, more so considering BJD patriarch Naveen Patnaik’s clear stance against the Waqf Bill. One of the reasons for the AIADMK-BJP split in 2023, was the regional party’s fear of losing its minority voter base. The AIADMK voted against the Waqf Bill, underscoring its reservations about the BJP’s agenda. While the YSRCP, the AIADMK and the BJD showed an eagerness to keep a distance from the BJP, the JD(U) and the TDP ended up in an embrace of their dominant ally. The merits of the Waqf amendments may be debatable but the government’s refusal to take the Muslim community into confidence on an important piece of legislation is a classic sign of majoritarianism. Barring a nominated member in the upper House, no Muslim MP supported the amendments. The Waqf debate also highlighted the fact that the ruling alliance does not have a single elected member from the community in Parliament. Beyond the veneer of efficient outcomes, the session sharpened political and communal polarisation. Discussions should ideally expand the common ground, but this session failed on that count. Published - April 07, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Union Budget\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        Waqf\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Manipur\n                    \n                            /                      \n                        \n                        Rajya Sabha\n                    \n                            /                      \n                        \n                        Lok Sabha\n                    \n                            /                      \n                        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        Biju Janata Dal\n                    \n                            /                      \n                        \n                        All India Anna Dravida Munnetra Kazhagam\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        minority group\n                    \n                            /                      \n                        \n                        Yuvajana Sramika Rythu Congress Party\n                    \n                            /                      \n                        \n                        Janata Dal (United)\n                    \n                            /                      \n                        \n                        Telugu Desam Party\n                    \n                            /                      \n                        \n                        Indian National Congress",
        "headline_1": "​The missing middle: on Budget session of Parliament, debate",
        "headline_2": "No legislation finds bipartisan support in Parliament",
        "link": "https://www.thehindu.com/opinion/editorial/the-missing-middle-on-budget-session-of-parliament-debate/article69419897.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "07-04-2025"
    },
    {
        "full_article": "While ordering the Wikimedia Foundation to undo changes on the Wikipedia page on Asian News International (ANI), the Delhi High Court said “people at large have a tendency to accept statements made on [Wikipedia’s] web pages … as gospel truth”. In the hearing of the defamation suit that ANI had filed in 2024, the court had taken some questionable positions. For example, it sought the identities of the volunteers who edited the ANI page, whose anonymity the platform allows to protect them from retaliation. When the Foundation sought more time, the court observed: “We will close your business transactions here... We will ask the government to block Wikipedia… If you don’t like India, please don’t work in India.” The Foundation had appealed for its right to safe harbour under the Information Technology Act 2000, but the court concluded in favour of the plaintiff because, it observed, “statements on the page pertaining to the plaintiff are all sourced from … editorials and opinionated pages”. Wikipedia is written and maintained by volunteers who are expected to follow the platform’s guidelines. Unlike newspapers or scientific journals, the encyclopedia does not purport to publish new information; volunteers are instead expected to repeat with attribution or reproduce with references, information originally published elsewhere, with a preference for reputable sources. In this light, the court order is problematic.Elements of truth today are often mistaken to be someone’s opinions and vice versa. Politicians and government agencies have been known to punish civil society for repeating an allegedly offensive claim rather than address the original claim itself. Opinions are rejected even as data is withheld to deny those who express them opportunities to align them with verifiable facts. In this case, the court had expressed concern for ANI’s credibility, whether volunteers who edited the ANI page had followed the platform’s guidelines in letter and spirit, and whether the opinion as expressed on the page could be allowed to stand. In the process, it established that the Foundation’s ability to maintain the democratic structure that has allowed Wikipedia to become so popular and reliable is limited for India’s users: to the extent of public tolerance for certain opinions. Ultimately, the aforementioned “people’s tendency” and the state’s ability to influence it put Wikipedia and similar decentralised collaborations at risk. That is a tragedy. These collaborations adopted their designs to sidestep the sort of centralised information control that some countries, including India, have sought. Courts and the state would do well to accommodate these collaborative efforts rather than treat them with contempt — and the people should engage with these efforts and their guidelines as well.\r Published - April 07, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        media\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        journals and diaries",
        "headline_1": "​Tragedy of a commons: on Wikimedia and the free flow of information",
        "headline_2": "Courts and the state must not throttle free flow of information",
        "link": "https://www.thehindu.com/opinion/editorial/tragedy-of-a-commons-on-wikimedia-and-the-free-flow-of-information/article69419922.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "07-04-2025"
    },
    {
        "full_article": "Will India or Vietnam make the best of an iconic American company’s supply chain woes?\nBloodbath. For US stock after stock, that was the commonest fate on Liberation Day. Apple, the world’s most valuable company, saw its shares slide 16% over Thursday and Friday. The April 2 tariffs have it in a pincer grip. China, which still assembles about 80% of the about 220mn iPhones sold in a year, has been hit with a 54% tariff. Analysts say this could mean a whopping 40% rise in iPhone prices. They are still lifting their jaws off the ground after watching Trump knocking out American icons like this. Apple has to deal with this blow in a flattening smartphone market. In its woes is the story of all businesses scrambling to rejig their global supply chain in the stormy new tariffverse.\nAs TOI reported yesterday, the company has already made “unusually high” number of shipments to US, from factories in India and China. So it may be able to hold off a retail price hike for a bit. India, which assembles around 15% of iPhones, has been hit with a 26% tariff. This is lower than China’s but way more than companies planned for when they started diversifying here, impelled by Trump’s first term and then by Covid. India, however, saw limited benefits from this China Plus strategy compared to countries like Vietnam. Factors ranging from simplifying tax laws to proactively signing FTAs helped the others pull ahead of us in expanding their export shares. This time around, the stakes are even higher. China’s now thrown retaliatory tariffs into the ring. “They panicked – the one thing they cannot afford to do,” Trump said. But our columnist today suggests that Washington will not be engaging in tariff negotiations with China anyway.\n\nBetween them things are bound to get worse. Other countries hope to get a happier hearing. Vietnam, hit with a 49% tariff, has talked to Trump already, offering to pull down its own tariff wall altogether in exchange for US softening. Vietnam has a $123.46bn trade surplus with US, compared to India’s $45.66bn. They will both do what it takes to benefit from the strategic decoupling of US from China. If the April 2 tariffs stay sticky, it should be advantage India. But the ifs are infinite. One thing that’s certain is that any smartphone manufacturing that moves to US is less likely to be done by Americans – than by their robots.\n\n",
        "headline_1": "Who’ll grab Apple pie",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/wholl-grab-apple-pie/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-04-2025"
    },
    {
        "full_article": "Bigger must have bigger stick, na?\nConsider this land whose creeds, ethnicities and nose-shapes were as multitudinous as the streams that enriched its mighty rivers which then merged  with humanity’s boundless ocean. Its family had lived harmoniously for countless generations, ‘Owner’s Pride. Neighbour’s Envy’. But this exemplary brotherhood was coming increasingly unstuck. Instead of ‘We are the world’ it was more ‘Things fall apart, the centre cannot hold’. In fact, centre often didn’t want to.\nThus encouraged, Biggest Brother to start bossing over smaller siblings. Yes-ji,   traditionally, even legally, he had greater rights to property and decision-making. But so far he’d been congenial, and not merely for the sake of familial unity. He was actually a big hearted guy, more like all-embracing philosophy than rigid religion. But to quote Yeats again, ‘All this has changed, changed utterly.’ \nFirst, Biggest Bro put his foot down when a sibling wanted to marry a man of her own choice. Only because he’d quite baselessly decided that not any pyar-vyar, but impurely ulterior motives had ensnared naive behna. His cohorts ganged up and hounded the hapless couple to death. \nThen he dictated what everyone should eat. Or not eat. Since the larger family had diverse likes, this deprived some members of their regular food, and occasionally even livelihood. \nEat, love, so of course pray was pushed on the ban-wagon. One Mumbai Christmas, ‘midnight mass’ lost its raison d’être by being shifted to 9pm. Another brother has been most affected. This March 14, his holy month coincided with Biggest Bhaiya’s boisterous festival. So in UP and elsewhere,  Smaller played safe and postponed jumma prayers till Bigger finished playing Holi.  \nLast week saw two onslaughts. An uncharitable bill on most-put-upon brother’s charities. And, double festive-spoiler whammy. Eid namaz was forced out of its public spaces, and meat out of biryani in Biggest Bro states. Since his ‘pure veg’ festival had begun, ‘No slaughter within 500 metres of place of worship’. This amounted to blanket ban since every corner now boasts a shrine. \nAs it must, no? Doesn’t everyone believe that God must be everywhere? \n                                             ***\nAlec Smart said: “Tariff pe tariff. Trade justice denied.”\n\n",
        "headline_1": "Brothers Karma-zov",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/brothers-karma-zov/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-04-2025"
    },
    {
        "full_article": "As someone who has made a mark through relentless networking, it is unlikely that Bangladesh’s chief adviser Muhammad Yunus was unaware of the ramifications of his remarks on his return from China. His observation of India’s north-eastern states being landlocked and Bangladesh having the “ownership of the ocean” could have been viewed as a clumsy expression of Indo-Bangladesh synergies. However, after his narration of the benefits that could accrue to China by incorporating the Seven Sisters into its backyard, Yunus left no room for ambiguity. Having failed to cut through India’s diplomatic frostiness since the overthrow of Sheikh Hasina’s govt in August last year, the interim administration has chosen to flaunt its proximity to Beijing.\nRead full story on TOI+\n\n",
        "headline_1": "Dhaka-Beijing bhai bhai? India may need more stick-less carrot approach",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/dhaka-beijing-bhai-bhai-india-may-need-more-stick-less-carrot-approach/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-04-2025"
    },
    {
        "full_article": "Let’s face it, comedy is hard. Making people with different sensibilities laugh in a country as diverse as India is incredibly difficult. Those who have mastered this art have become global celebrities. Of course, for every successful comedian, hundreds of others try as well. However, true talent in pure observational humour, delivered with panache, is rare. There are two other ways — shortcuts, really — to make people laugh even with relatively less talent: (1) using taboo sexual topics and (2) insulting or mocking prominent figures aka roasts. These shortcuts help a comedian get noticed, earn views, and generate buzz, at least in the short term.\n \nRead full story on TOI+\n\n",
        "headline_1": "Stand up for standups even when you don’t like their comedy",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/The-underage-optimist/stand-up-for-standups-even-when-you-dont-like-their-comedy/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Hope rekindled for Rohigya repatriation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/hope-rekindled-for-rohigya-repatriation-1743954083",
        "news_paper_name": "The Financial Express",
        "publish_date": "07-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Slippery ground of Rohingya repatriation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/slippery-ground-of-rohingya-repatriation-1743954143",
        "news_paper_name": "The Financial Express",
        "publish_date": "07-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Is there light at the end  of dark tunnel?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/is-there-light-at-the-end-of-dark-tunnel-1743954275",
        "news_paper_name": "The Financial Express",
        "publish_date": "07-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Keep up the Ramadan spirit",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/keep-up-the-ramadan-spirit-1743954293",
        "news_paper_name": "The Financial Express",
        "publish_date": "07-04-2025"
    }
]