[
    {
        "full_article": "On his way to Brazil to attend the ongoing BRICS summit, Prime Minister Narendra Modi has made back-to-back bilateral visits to Ghana, Trinidad and Tobago, and Argentina. Each stop was with a view to enhancing bilateral cooperation in fields which included some common themes on pharmaceuticals and vaccines, digital technology, food security and critical minerals. In Accra, India-Ghana ties were upgraded to a comprehensive partnership, with discussions on helping Ghana become a “vaccine hub” for West Africa. In the Port of Spain, Trinidad and Tobago, there was a major MoU on “Indian pharmacopeia”, to improve access to quality and affordable generic medicines from India. In Buenos Aires, President Javier Milei agreed to enhance cooperation on critical minerals as well as Argentina’s vast reserves of shale gas and oil, while India pitched its pharma to Argentina. The three stops were in countries of the “developing world” or the Global South, and the onward journey to Brazil, and then to Namibia, also highlight India’s commitment to building alternative economic mechanisms to the “developed world” or Global North. India’s offer of cooperation for low-cost solutions to global challenges includes the promotion of India-led international organisations such as the Coalition for Disaster Resilient Infrastructure (CDRI) to these countries. Mr. Modi also made his signature pitch to the Indian diaspora — his speech in the Port of Spain, where Indian labour was brought by British colonial ventures since 1845, is one to note. Referring to the Indian ancestry of President Christine Carla Kangaloo and Prime Minister Kamla Persad-Bissessar, Mr. Modi said that the 35 million Indian diaspora worldwide were India’s “pride”.It is also impossible to escape the deep connections between India and the five nations in terms of political history. Each country shares a bond — colonies that suffered under British, Spanish, Portuguese and German forces — and why some of them joined the Non-Aligned Movement. They have all, at various points, committed to building South-South cooperation, and India and Brazil’s role in founding the BRIC mechanism, along with Russia and China, and IBSA with South Africa, was an outcome, strongly pitching the interests of the Global South. None of the countries on the tour can be called “anti-West”, and New Delhi has had some differences with them over specific conflicts (Ukraine and Gaza). The motivating force behind the ties, however, and consequently Mr. Modi’s nine-day itinerary, is more about a common desire to look beyond the present global order to one that is more equal, representative, and sensitive to the needs of developing and under-developed nations.\r Published - July 07, 2025 12:30 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Brazil\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        South Africa\n                    \n                            /                      \n                        \n                        summit\n                    \n                            /                      \n                        \n                        Trinidad and Tobago\n                    \n                            /                      \n                        \n                        Argentina\n                    \n                            /                      \n                        \n                        pharmaceutical\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        Spain\n                    \n                            /                      \n                        \n                        Portugal\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        vaccines\n                    \n                            /                      \n                        \n                        food security\n                    \n                            /                      \n                        \n                        critical minerals",
        "headline_1": "Common goals: On India and a five-nation tour",
        "headline_2": "Prime Minister Narendra Modi’s visits reflect India’s efforts to engage with others of the Global South",
        "link": "https://www.thehindu.com/opinion/editorial/common-goals-on-india-and-a-five-nation-tour/article69780363.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "07-07-2025"
    },
    {
        "full_article": "Fresh appointments for U.S. student visa interviews have commenced at consulates as per the extended vetting programme that includes rigorous checking of the applicant’s social media activities. A chunk of visa applications is still pending at a time when the visa processing winds down and students prepare to depart. Fresh appointments were frozen for nearly a month until the extended vetting programme could be launched. With a wait time of more than a month, many visa applications may go down to the wire as classes begin by the end of August/beginning of September. The extended vetting is only one among many disruptors to the flow of Indian students to the U.S. Many other policy proposals have had a chilling effect. The Trump administration’s nominee to head the U.S. Citizenship and Immigration Services has vowed to end the Optional Practical Training programme (OPT) that allows students time to work in the U.S. after graduation while still on student visa, and which serves as a segue toward jobs, work visas and green cards. Ending OPT will disincentivise studying in America. The Trump administration has also said that it will provide only fixed-tenure student visas. The axing of government spending and funding of research and other activities of higher education institutions has had its impact — there are reports of universities rescinding PhD admissions of Indian students. Anecdotal evidence points to a sharp decline in visa issuance in several cities and increased scrutiny of the ranking of institutions granting admissions. Many of the applicants this year had begun the application process before the 2024 U.S. presidential election and, therefore, have sought to go through the process despite the fears. Next year will truly gauge how attractive the U.S. still is for Indian students.When the Trump administration took office, it was felt that the worst of its anti-immigrant impulses would be softened by the tech billionaires who were supporting it. In the past, too, big business had driven policies bringing in talented immigrant workers and foreign students in Republican administrations. The exit of Elon Musk, however, is not a singular event but part of a trend of top techies exiting the Trump team. The cuts on green energy research in the recently passed “Big Beautiful Bill” only serve to highlight the almost complete dominance of right-wing extremists in the administration, marked by the extreme views of its leading lights such as Stephen Miller, White House Deputy Chief of Staff for Policy. The decline of the U.S. as a major attraction for Indian talent is perhaps only an indicator of how much India may have to pivot away from the U.S. in other areas as well. Published - July 07, 2025 12:15 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        media\n                    \n                            /                      \n                        \n                        students\n                    \n                            /                      \n                        \n                        immigration\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        Citizenship\n                    \n                            /                      \n                        \n                        US PRESIDENTIAL POLLS\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "​Pivot away: On U.S. student visas, Trump administration",
        "headline_2": "The squeeze on U.S. student visas is indicative of right-wing dominance",
        "link": "https://www.thehindu.com/opinion/editorial/pivot-away-on-us-student-visas-trump-administration/article69780346.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "07-07-2025"
    },
    {
        "full_article": "On the woman within 6 seconds of the 4 minute mile \nLast month, Faith Kipyegon, the genius Kenyan runner, made a concerted effort to become the first woman to break the 4 minute barrier for the mile. It was Paris in springtime and a glee club of supporters egged her on, with the legendary Carl Lewis leading the band. \nTook me back to when my dad, then doing a military course in Surrey, said come with me to Oxford to see a race. I refused, saying I wanted to watch Cisco Kid on the telly. But at six years I didn’t have much clout and very soon we were into the one hour drive to Iffley Park, a father trying to explain the joys of athletics to a pouting child.\nI love to say that I was part of history that day when Roger Bannister broke the 4 minute barrier. But instead of being riveted by the magical moment we were about to witness that would be counted right up there with Tenzing and Hillary, Eliud Kipchoge, Tiger Woods, Muhammad Ali, Roger Federer and Usain Bolt, I was thinking about what Cisco Kid was doing in this sorely missed episode. \nIn the telling and retelling of the story over the years I have sanitised it and widened its scope. No fault of the listener if he believes that I was there at the finishing line to welcome Roger Bannister, along with his pacers Chris Chataway and Chris Brasher, and that the hero of the hour caught his breath and then lifted me up in his arms in the moment of triumph. Truth be told there was much screaming and shouting and for the crowd of officials and others surrounding him he could hardly be seen and at six years when you are sulking 4 minute miles come well below an ice lolly in order of precedence. Actually, 3 minutes, 59.4 seconds.\nStill, I guess I was there when sports history was being made. And last month too, with millions of people all around the world glued to YouTube, the exuberance and joyousness of pure sport, the singular courage and daring do of athletics, and the art and science of going that one bridge further and breaking the record were in focus. Faith lopped a whole second of her personal best and is now six seconds short of the barrier. She will do it one day soon, never mind Cisco Kid. \n\n",
        "headline_1": "Keeping the Faith",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/keeping-the-faith-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-07-2025"
    },
    {
        "full_article": "Fixation with exiling old vehicles is mistaken. The fault is not in a car’s age, but its emissions \nThere’s one ranking Delhi regularly tops: World’s most polluted capital city. But while it grabs the most amount of repelling headlines, its terrible air quality is actually widely shared across north India. Logically, any ‘fix’ the capital finds should be scalable and do a whole lot of good beyond it. Illogically, one of its pet projects over the past decade has been phasing out 10-15 year old cars, merrily relocating these elsewhere. A serious escalation of the scheme on July 1 saw old vehicles being denied fuel and even impounded. Public outrage was predictable and substantial, pushing a govt climbdown. What the episode has really highlighted is that even as acute air pollution takes a grim toll on our health and wealth, our environmental firefighting continues to be weak in both science and vision.\nAs Delhi’s L-G has noted, buying a vehicle is an investment of hard-earned life savings for the middle class. And when this is crushed via rigid ageism, it’s a travesty of environmental justice. London to Tokyo, Wellington to Brussels, why don’t other capital cities say no to older vehicles per se? Because, to state the obvious, nothing stops newer vehicles from being grossly polluting, if there is some technical issue or poor maintenance. Well-serviced older vehicles can very well be the more sustainable alternative. These decisions have to be made case by case. This needs emissions monitoring to really kick up. Instead, Delhi authorities themselves seem to have zero confidence in the PUC process. There is a widespread feeling that pollution-control centres are corrupt and their certifications are fraudulent. Govt to NGT, SC to CAQM, all the decision-makers need to solve this problem in earnest.\nOne thing that really gives away the shallowness of India’s end-of-life schemes, is how little work has gone into formalising the salvage economy. How much automobile shredder residue Suzuki is recycling in Japan – 96% – can be known with the click of a button. In India this is as much of a data blackhole as how much pollution is caused by how many vehicles. One resource that needs much more investment, and can be a game changer, is remote sensing of emissions. This technology measures real-world vehicle performance. Comprehensive monitoring won’t by itself give us better air quality. Tough decisions will still need social negotiations. But right now, all decision-making is gravely undermined by gaps in emissions data. \n\n",
        "headline_1": "Reverse gear",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/reverse-gear/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-07-2025"
    },
    {
        "full_article": "India must shed its protectionist mindset and trade more with resource-rich South America \nThat Modi’s ongoing five-nation tour includes Argentina and Brazil isn’t a trivia. These two key South American nations can be important fulcrums of a potential Indian pivot to the continent. While India-South America trade has been steadily growing, it’s far below potential. This has much to do with our unambitious approach to the region. True, India has a preferential trade agreement (PTA) with MERCOSUR bloc that includes Brazil, Argentina, Uruguay, Paraguay and Bolivia. The idea was that the PTA would be gradually expanded and upgraded to a free trade agreement (FTA). However, progress has been really slow and India’s exports to Latin America in FY2025 stood at just $15.17bn – less than 2% of the region’s total imports. \nBut trade is back on the agenda during Modi’s visits, and rightly so. While one still hopes that an India-US trade deal can be clinched, New Delhi must be prepared for all eventualities. And with Trump keen on using tariffs as a strategic weapon to achieve geopolitical goals – take the Lindsey Graham-proposed bill to hit countries buying Russian oil with 500% tariff – India must diversify its trade relations. South America is a natural resources powerhouse. With vast deposits of oil, gas, copper, lithium, rare earths etc it can power India’s industrial growth, advance critical sectors like EV batteries, and bolster food security. \nThe key for GOI would be to expand its diplomatic bandwidth and take a courageous approach to trade. We must cast away the protectionist mindset and be ready to compete. That’s the only way beneficial FTAs can be worked out. Vietnam, which recently worked out a trade deal with US, has been following precisely this strategy, having inked 20 FTAs, with 16 already implemented. China already has a huge presence in Latin America. So, the latter is looking for balance. This is the perfect time for India to step up. \n\n",
        "headline_1": "LatAm pivot",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/latam-pivot/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-07-2025"
    },
    {
        "full_article": "Cultures that fetishise food stick women in the kitchen for hours on hours. Gender parity takes off where the cuisine is functional, UK to Germany, overcooked cabbage to sausage\nThere’s a pungent paradox simmering in the world’s most celebrated kitchens: the better the cuisine, the worse the gender politics that come marinated with it. Somewhere between turmeric and tears, food becomes a trapdoor – one that opens only under female feet.\nThe hypothesis isn’t flambéed for effect. It’s slow-roasted in history: behind every mouthwatering national dish is a woman whose labour was ritualised, romanticised, and eventually rendered invisible.\n\nBecause once a culture begins to fetishise food, it quietly starts domesticating the female body – one rolling pin at a time.\nRead the full story on TOI+.\n\n",
        "headline_1": "Gender’s gourmet trap",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/genders-gourmet-trap/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-07-2025"
    },
    {
        "full_article": "Despite countless lives being lost in road crashes across the country year after year, it is astounding that the crisis continues to be met with a shocking level of indifference or ineffectiveness from those responsible for road safety. According to the latest data from Road Safety Foundation (RSF), at least 696 people were killed in June. That is, mind you, an average of over 23 lives lost every day. For context, as per Bangladesh Jatri Kalyan Samity, 614 people were killed in May and 583 in April. While the June data was likely influenced by increased road trips during the extended Eid-ul-Azha holiday, the overall trend points to a chronic problem that cannot be blamed on seasonal home rush alone.\nThese persistently grim statistics should have jolted us into decisive interventions long ago. The question is, why didn't they? A closer look at the June data reveals just how pervasive and multidimensional the crisis has become. Motorcycles—which are proving increasingly hard to regulate—alone accounted for over 37 percent of total crashes and nearly 33 percent of fatalities. Pedestrians made up more than 17 percent of the deaths, while another 15 percent were drivers and their assistants. The RSF has identified excessive speeding as the leading cause of most accidents. Other long-standing factors include unfit vehicles, poorly designed and maintained roads, unskilled and overworked drivers, weak traffic enforcement, and the widespread disregard for traffic laws.\nThis deadly mix has created an environment of near-total anarchy on our roads, and unless it is systematically addressed, road casualties will continue to claim lives. In this context, the government's ongoing effort to draft a new road safety law based on the UN-endorsed Safe System Approach seems like a positive step. Reportedly, a preliminary draft is currently under review. Structured around the five key pillars of this approach—safer people, safer roads, safer vehicles, safer speeds, and post-crash care—the draft law promises to address core issues that the current Road Transport Act, 2018 has failed to tackle adequately.\nBut let us be clear: legislation alone cannot save lives. The Road Transport Act, for all its flaws, has provisions that could have improved road safety if implemented properly. Unfortunately, it has remained largely toothless due to a lack of political will, institutional coordination, and enforcement. The same fate must not befall the new law. If passed, it must be enforced without fear or favour, and accompanied by serious investments in traffic management, public awareness, driver training, and post-crash response systems.\nGiven the persistent fatalities, we urge the interim government to take the crisis of road safety with the urgency it deserves. The authorities must do everything necessary to finally break the cycle of neglect and lack of accountability that has allowed so many lives to be lost in vain. There is no excuse left for inaction.\n",
        "headline_1": "Time to end the carnage on our roads",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/time-end-the-carnage-our-roads-3931741",
        "news_paper_name": "The Daily Star",
        "publish_date": "07-07-2025"
    }
]