[
    {
        "full_article": "The Reserve Bank of India (RBI) Monetary Policy Committee’s decisions, on Friday, show that the central bank is now unequivocally choosing growth in the perennial growth-inflation trade-off. This is the correct approach at this time. The first major decision was to cut the repo rate by 50 basis points to 5.5%. It comes on the back of two cuts of 25 basis points each, in February and April. With the latest retail inflation coming in at a 69-month low, and generally exhibiting a subdued trend, price stability has now been relegated as a secondary concern. These rate cuts will, once the banks transmit them to borrowers, make it cheaper for companies and consumers to borrow to invest and purchase. The second major decision, of slashing the cash reserve ratio by 100 basis points, will help with the transmission of the rate cuts. The less that banks have to keep with themselves, as stipulated by the cash reserve ratio, the more they can lend out — and now at lower rates. It is worth noting, however, that the central bank has again changed its stance. In April, it had moved from being neutral to being accommodative, indicating that it was inclined to cut rates further. It has now moved back to neutral, meaning more rate cuts in the short term are unlikely, unless growth falls well short of expectations. This is a sensible stance to take, given the vast uncertainties that the Indian and global economies are facing. The neutral stance also means that the RBI is equally predisposed to raise rates again in the event of an unforeseen and sustained spike in prices. The monsoon is yet to fully play out, after all.The timing of these decisions is sound. Inflation is low and not likely to jump any time soon if current factors remain unchanged. Further, there are no major elections now that would otherwise have necessitated a pre-emptive strong grip on price levels. On the other hand, growth is lower than it could be. The RBI has projected growth in the current financial year 2025-26 to be 6.5%, which is no faster than what the government provisionally estimated for the previous year. Fiscal policy in terms of government spending has reached the limit of the stimulus it can provide. After a decade of increasing outlays, government capital expenditure can at best be maintained at the level it is at, but cannot reasonably be expected to grow much further. Finance Minister Nirmala Sitharaman and officials in the Ministry of Finance have indicated as much. Apart from developmental and social priorities, the government now has additional defence spending to account for. Monetary policy has to step up and boost growth, and it is good to see the RBI and the government on the same page. Published - June 07, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        central bank\n                    \n                            /                      \n                        \n                        inflation and deflation\n                    \n                            /                      \n                        \n                        interest rate\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        social conditions\n                    \n                            /                      \n                        \n                        election",
        "headline_1": "​Same page: on monetary policy, the RBI, the Government",
        "headline_2": "The RBI and the government are now aligned on boosting growth",
        "link": "https://www.thehindu.com/opinion/editorial/same-page-on-monetary-policy-the-rbi-the-government/article69665242.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "07-06-2025"
    },
    {
        "full_article": "President Donald Trump’s decision to ban citizens from 12 countries from entering the United States, citing national security concerns, is yet another attempt by his five-month-old administration to tear down legal migration. Mr. Trump’s decision in 2017, during his first term, to ban citizens from seven Muslim-majority countries had triggered chaos and protests at America’s airports, evoked criticism of the unstated racism and xenophobia, and led to legal challenges. This time, Mr. Trump has focused on mostly West Asia and Africa. Citizens from Afghanistan, Myanmar, Chad, the Republic of Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen would be banned, while people from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela will face restrictions. The ban applies only to people outside the U.S. but those with active visas who leave the country could face difficulty during re-entry. Mr. Trump argued that the ban, which came days after the arrest of an Egyptian man for carrying out an attack on a group honouring the Gaza hostages, would help prevent terrorist attacks and keep out those who overstay their visas. Egypt, a close American ally, and Spain, which saw 20,000 of its citizens overstay their visas in 2023, are not on the list, but Chad, whose visa overstay number is as low as 400, is.Since his swearing-in as the President, in January, for the second time, Mr. Trump has taken a series of measures to crack down on migration. He has suspended the asylum system at the southern border and ended temporary legal residency for Haitians, Venezuelans and Cubans. He has also removed the legal status of thousands of foreign students and instructed U.S. diplomatic missions to pause scheduling new visa interviews as his administration prepares to vet the social media handles of students and scholars. His policies targeting international students have already spread chaos and uncertainty across America’s universities. Now, the outright ban on citizens from a group of countries reinforces the erosion of the self-image of the U.S. — “the shining city on a hill” as Ronald Reagan once called it — as a pluralistic, open society. Mr. Trump’s claim that immigrants bring crime into the U.S. is ill-founded. Many of the people seeking entry into the U.S., from countries that had seen American military intervention, such as Haiti and Afghanistan, are fleeing war, persecution and systemic violence. They are not national security threats but victims in search of refuge. By shutting America’s doors on them, and immigrants in general, Mr. Trump is not making the U.S. safer. Rather, he is turning a country, which historically welcomed immigration and has benefited from it, into an insular, paranoid, self-doubting republic. Published - June 07, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        migration\n                    \n                            /                      \n                        \n                        arrest\n                    \n                            /                      \n                        \n                        Afghanistan\n                    \n                            /                      \n                        \n                        Myanmar\n                    \n                            /                      \n                        \n                        Guinea\n                    \n                            /                      \n                        \n                        Haiti\n                    \n                            /                      \n                        \n                        Iran\n                    \n                            /                      \n                        \n                        Libya\n                    \n                            /                      \n                        \n                        Somalia\n                    \n                            /                      \n                        \n                        Sudan\n                    \n                            /                      \n                        \n                        Yemen\n                    \n                            /                      \n                        \n                        Cuba\n                    \n                            /                      \n                        \n                        Laos\n                    \n                            /                      \n                        \n                        Sierra Leone\n                    \n                            /                      \n                        \n                        Togo\n                    \n                            /                      \n                        \n                        Turkmenistan\n                    \n                            /                      \n                        \n                        Venezuela\n                    \n                            /                      \n                        \n                        Egypt\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        students",
        "headline_1": "​Insular, paranoid: on Donald Trump, the U.S., legal migration",
        "headline_2": "Donald Trump is turning the U.S. into a self-doubting republic",
        "link": "https://www.thehindu.com/opinion/editorial/insular-paranoid-on-donald-trump-the-us-legal-migration/article69665647.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "07-06-2025"
    },
    {
        "full_article": "The Reserve Bank of India (RBI) just made a big decision. It cut interest rates again — this time by 0.5% (or 50 basis points). That’s good news for people who have to pay EMIs (monthly loan payments), because their payments could now become cheaper.\nSo why did RBI do this? The goal is to help India’s economy grow faster. In the last few months, the economy grew by 7.4%, which sounds great. But most of that growth came from the government spending money on building things like roads and bridges. Factories and companies making goods (that’s called manufacturing) didn’t grow much. And that’s a problem because strong factory growth means more jobs and more money in people’s pockets.\nFor India to grow well this year, people need to spend more — especially on things like cars and homes. These industries give jobs to millions of people. To help with that, RBI has already made loans cheaper three times this year. Now it’s hoping that cheaper loans will make more people buy homes and cars, which will boost the economy.\nPrices of things (inflation) have finally stopped rising so fast, so the RBI felt safe enough to cut rates. But some experts think people aren’t buying more because they simply don’t earn enough. After Covid, many carmakers and builders started making only expensive models. Small, cheaper cars and homes became rare. So middle-class families couldn’t afford them.\nNow, with cheaper loans, the RBI hopes more middle-income families can buy these things again. If that happens, businesses will also invest more in new projects — and that will help the economy grow. But if it doesn’t, the government may need to focus on helping people earn more money.\nRBI has said it won’t cut rates again soon. So now, everyone’s waiting to see: Will this plan work?\n\n",
        "headline_1": "RBI Tries to Help the Economy Grow",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/rbi-tries-to-help-the-economy-grow/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-06-2025"
    },
    {
        "full_article": "RBI can’t do anything about sluggish incomes \nRBI’s generous 50bps rate cut cheered markets on Friday, and should ease pressure of EMIs on borrowers soon. But a bigger test lies ahead – will it spur demand, and growth? Although Q4 data for fiscal 2025 was encouraging, its 7.4% growth was mostly powered by govt-led construction. Manufacturing growth remained sluggish, which is a dampener for the central bank’s “growth aspiration” of 7-8%. RBI has already set its growth expectation for the current fiscal at a modest 6.5%. For India to grow in the target range, private consumption – which accounts for close to 60% of GDP – must shift gears, and the three rate cuts this year – altogether 100bps – will make borrowing significantly cheaper. RBI and govt will hope this stimulates demand for housing and automobiles, key industries that employ millions and have significant multiplier effects.\nWhile inflation has finally cooled to a comfortable level, creating room for rate cuts, some experts have diagnosed sluggish demand and slowing price rise as a sign of weak incomes. Post-Covid, the housing and automobile markets became premiumised. Small hatchbacks, once the base of the car market, are now a tiny segment. Likewise, smaller apartments fell off builders’ plans. Essentially, mid-income earners got priced out. Cheaper credit could change that, and if private demand booms, so will private capex. That’s the hope. But if these rate cuts don’t translate into growth, govt will seriously need to look at the problem of income stagnation. RBI has already changed its policy stance from accommodative to neutral, signalling a reluctance to make more cuts this year.\n\n",
        "headline_1": "Beyond The Cut",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/beyond-the-cut/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-06-2025"
    },
    {
        "full_article": "Trump, Musk & the Drama of a Famous Friendship\nYou’ve seen it before: two super-famous people become best friends, then have a huge falling out. It’s like when movie stars split up – people can’t stop watching. Now, something similar is happening with Donald Trump (the former US President) and Elon Musk (the super-rich tech guy behind Tesla and X).\nThey were once so close, people joked about giving them a “friendship name” like “Trelon” or “Elonald” — just like how we had “Brangelina” for Brad Pitt and Angelina Jolie.\nMusk even stood in the White House and said his favorite cryptocurrency, DOGE, should be used everywhere – kind of like a new way of life. That’s how strong their bond seemed. But suddenly, they’re not so friendly anymore. Will they make up? Maybe. Maybe not.\nExperts say that boys’ friendships can be different from girls’. They don’t always talk about feelings but often stick together because of shared interests — like playing cricket or working on a project. Also, boy groups often have a leader. That’s what’s happening here — both Musk and Trump want to be the boss.\nThey also have their own reasons to stay friends. Musk doesn’t want people to stop buying his company’s shares. Trump wants people to keep talking about him online. But their friendship is now full of drama — and the world is watching like it’s a TV show.\nSome people worry it might get worse. Both of them have big egos, and when friends with strong personalities compete too much, it can turn into a battle instead of friendly fun. There’s even talk about weird stuff like ketamine (a medicine that’s not meant to be used casually) possibly being involved — not helpful in any friendship!\nSo the big question is: Can Trelon be saved? Or will this be the end of the Trump-Musk bromance?\n\n",
        "headline_1": "Alpha X-Pals",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/alpha-x-pals-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-06-2025"
    },
    {
        "full_article": "Trump, Musk & truth about male friendship\n Everyone loves a messy celebrity breakup. Brangelina to TomKat to Bennifer, the only thing more voyeuristically entertaining than a supercouple is its bustup. The Trump-Musk lovefest never got its own moniker. But the possibilities – Trelon, Donusk, Elonald – have always been there. At Musk’s farewell press conference in the Oval Office just a week ago, the violins were still playing. He said DOGE would spread to permeate all govt, as a way of life, sort of like Buddhism. The relationship soured overnight. We’ll have to see whether this is a break-up that’ll soon end in a make-up.\nPundits say male friendships lack the emotional sharing that enriches female friendships, but go long distances by staying anchored in shared activities. Male friend groups also tend to be more hierarchical. Like Plato being pupil to Socrates. Or the captain centring the neighbourhood cricket team. So it comes down to boys being boys. Musk and Trump are figuring out who is the dom.\nBoth alphas have good reasons to de-escalate. Musk doesn’t want tanking stock prices. Trump wants the algorithm to keep spinning his politics. The stench of Epstein-ian secrets is also in the air. Like the most modish of modern relationships, the play is all in public gaze. Janata is bringing popcorn to the watch party – but also plenty of advice. Top one is that every big beautiful male friendship is doomed, not to mention the friends themselves, when healthy competition mutates into a chainsaw. The Trump-Musk mix is brimful of ego. Adding ketamine, which many know only as a horse tranquiliser, to the mix can’t be helping. Who will be the yuger man, and pull Trelon back from mutually assured destruction?\n\n",
        "headline_1": "Alpha X-Pals",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/alpha-x-pals/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-06-2025"
    },
    {
        "full_article": "On World Environment Day, the conversation around plastic pollution takes centre stage—globally, in treaty rooms and international campaigns, and locally, as we stare at rivers choked by waste and fields littered with non-biodegradable remnants of daily survival. But too often, we isolate the plastic crisis from the human beings at its centre: the families, farmers, vendors, and millions for whom plastic is not a convenience but a necessity—a needed tool for carrying goods to work on a rainy day, building shelter to withstand torrential rains when there is no roof overhead, or simply storing belongings when even a tin trunk is unaffordable.\n\nPlastic must be removed from our lives, for it kills—whether through choking rivers and oceans, or through the CO2 emitted in its production. But this can only happen when alternatives become reachable for the unrecognised faces who use it daily, not just for ease but for necessity. In a country like Bangladesh, where the vast majority live on the edge of survival, affordability and availability dictate choice. The conversation around alternatives must begin by asking: What will people use instead? And how will they afford it? If those answers remain unclear, expecting sudden behavioural shifts or blanket bans is not only unrealistic, it is unjust.\nWe need to find a solution that is both humane and environmentally responsible. We cannot presume to restrict plastic use only through regulation. We must provide alternatives and instil an understanding of the harm it causes, especially among those who rely on it most. People must feel connected to the cause, to understand that this is about protecting the rivers, the land, and the environment we all share. When the message speaks to the heart, not just through statistics or enforcement, it inspires collective responsibility. That is where real, lasting change begins.\nToday, we speak of climate treaties and plastic bans. But unless the state becomes personal—unless the farmer understands why it matters to him, unless the mother in a char village sees what plastic waste might do to her child's future—we will not see real transformation. A policy that asks millions to give up a necessity must not descend like an order. It must rise from understanding, built through empathy and communicated in language that respects people's lives and acknowledges their realities.\nThe global plastic treaty being negotiated, as reported in IISD's Earth Negotiations Bulletin, is a welcome step. But it must not absolve us of our responsibilities at home. Plastic is already having an incredibly negative impact on the quality of our lives. Our rivers are clogged. Our waste systems are inadequate. While international consensus can help us gain legitimacy in our actions, we are already suffering daily from the lack of regulation and alternatives. We cannot wait for consensus to take shape. We need to act now—but act wisely—so that the millions who rely on plastic today are able to shift to alternatives, even if those alternatives are not yet as useful.\nAt the same time, we must resist imported narratives that do not fit our context. Western countries, with their histories of industrial growth, carbon emissions, and pollution, have created much of this crisis. But this is not about them feeling guilt. Guilt can be brushed aside—by individuals, by corporations. What we must appeal to is conscience. One person's conscience can lead hundreds to positive action. If there is to be a global commitment to healing, it should not be framed as reparations for the past, but as a response to the suffering of the present. Let conscience, not compensation, guide the way forward.\nBack home, we must learn to see the nuances. Not all plastic is single-use or wasteful. In Bangladesh, we reuse everything. A plastic bottle may be used for months. Plastic furniture allows families to live with dignity. On a recent visit to a shop in Kachua, I was handed a plastic bag labelled \"100 percent biodegradable.\" Bioplastics like those being developed by Sonali Bag may hold promise. But we must ensure that sustainability does not become another form of inequality, where the poor are penalised for using what they can afford, while the rich purchase expensive \"eco\" products.\nEven a seemingly progressive decision, such as banning plastic and requiring only glass in offices, raises valid questions. The intention is noble. But how do small businesses comply? What happens to vendors who cannot afford the transition? Policy without inclusion becomes exclusion.\nSo, what should we do?\nWe must begin with awareness that respects, not lectures. Speak to people in their own language—not only linguistically, but through their lived experience. Show them that if the rivers are blocked, if the fish die, if the soil degrades, their own lives will be affected. And then, crucially, provide real alternatives. No one wants to harm the environment. But no one should be forced to choose between dignity and sustainability.\n\nIt is possible to mobilise people—especially the young—when they feel part of a collective mission. It is possible to educate without blame. To act without alienating. To build, not just ban.\nLet us mark this World Environment Day not with more slogans, but with sincerity. Let us appeal not just to policies and politics, but to the hearts of people. Because only when environmental responsibility becomes personal, deeply human and emotionally understood, will we begin to see real change.\nLet us make the state personal. Let us make conscience our most powerful policy.\nRuna Khan is founder and executive director of Friendship.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Why change must start with people",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/why-change-must-start-people-3912156",
        "news_paper_name": "The Daily Star",
        "publish_date": "07-06-2025"
    },
    {
        "full_article": "As Muslims around the world prepare to celebrate Eid-ul-Azha, it is a time to reflect on the values of sacrifice and gratitude that this festival embodies. These principles resonate deeply especially when millions in Gaza are facing hunger and death under Israeli attacks, and hundreds of Rohingya children are being denied their right to education. Closer to home, some workers are returning to their villages without receiving salaries or bonuses. Then there are the road accidents that have become a tragic routine during every Eid, as tens of thousands of people travel from cities to spend the holidays with loved ones.\n\nAlthough, like during Eid-ul-Fitr earlier in the year, bus, train, and launch journeys have so far been relatively smooth, several road accidents and at least one robbery on the highway have already occurred, despite increased patrols by law enforcement. However, the responsibility of ensuring safety on highways and river routes does not rest solely with the authorities—it is shared by passengers, transport owners, and drivers alike. Passengers, too, must avoid overcrowded or unfit vehicles, while owners and drivers must prioritise safety over profit, avoiding reckless driving. Law enforcement officials must also remain vigilant.\n\nAnother critical aspect that calls for both responsible behaviour and proper planning is the sacrifice of animals. As we celebrate this act of devotion, we must not lose sight of our duty to show kindness to all living beings. Sacrificial animals should not be subjected to unnecessary cruelty. In cities and municipalities, we must ensure that animal waste and other refuse from our households and neighbourhoods are properly disposed of, and that streets, footpaths, and house premises where animals are kept or sacrificed are thoroughly cleaned.\n\nThis Eid-ul-Azha marks the first in which municipal and city corporations are being overseen by administrators rather than elected representatives. Many of these administrators are also juggling responsibilities in other government departments. However, this must not be used as an excuse for delays in post-Eid cleanliness drives. On the contrary, swift waste disposal should be treated as a top priority, especially as monsoon rains could worsen the stench and spread of blood, creating ideal conditions for the breeding of dengue mosquitoes. We also hope that the efforts of Dhaka South City Corporation will not be disrupted, as they were for 21 days when supporters of BNP leader Ishraque Hossain staged protests at Nagar Bhaban.\nWe wish everyone a safe and joyful Eid.\n",
        "headline_1": "We must uphold the spirit of Eid-ul-Azha",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/we-must-uphold-the-spirit-eid-ul-azha-3911846",
        "news_paper_name": "The Daily Star",
        "publish_date": "07-06-2025"
    },
    {
        "full_article": "We are surprised to learn of the promulgation of the National Freedom Fighters Council (Amendment) Ordinance-2025 that replaces the National Freedom Fighters Council Act-2022, redefining some key aspects related to the Liberation War. At a time when the nation is navigating an extremely fragile transition to democracy, this adds yet another element of confusion and controversy that we could do without. Codifying a more restrictive, combat-oriented definition of freedom fighters (FFs) and the war itself might seem justified in an ideal sense, especially given the history of political exploitations under Awami League. But it also reflects a potential reframing of national memory that no bureaucracy should be entrusted with.\n\nIt's true that much of the initial confusion about the ordinance stemmed from flawed reporting, particularly erroneous claims about the \"revocation\" of the recognition of Bangabandhu Sheikh Mujibur Rahman, Tajuddin Ahmad, and other national heroes as freedom fighters. But partly responsible for it is the redefinition of a \"freedom fighter\" and the introduction of three new categories, including that of an \"associate of the Liberation War\"—thus dividing all previously recognised under the broad term of freedom fighters into distinct groups. For example, all Members of the National Assembly (MNAs) and Members of the Provincial Assembly (MPAs) who were aligned with the wartime provisional government and later became members of the Constituent Assembly will now be considered \"associates,\" whereas those who led the provisional government will continue to be recognised as FFs. These categories overlap in some cases, and exclude in others, creating grounds for ambiguities.\n\nWhile the reclassification may not affect the benefits received by freedom fighters or their families—as later clarified by the adviser to the Ministry of Liberation War Affairs—the real question is: was this reframing, and the symbolic rollback of recognition for some, necessary at all? If there are concerns about \"fake\" freedom fighters, this approach will certainly not help. On the contrary, it piles on existing bureaucratic workload by necessitating fresh examinations of status. By defining a \"freedom fighter's family\" strictly as their spouse, son, daughter, father, or mother, the ordinance appears to align with the post-uprising restructuring of job quotas that no longer extend to their grandchildren. But again, these objectives could have been pursued without wading into what some perceive as a revisionist attempt. At the very least, the government could have consulted with political parties to generate consensus on such a divisive issue.\n\nThe government has interfered in such historical matters in the past as well. Instead of doing what is ideally the responsibility of historians or society at large, we feel the interim government, which by definition is meant to do only crucial tasks, should focus on more urgent and present-day reforms that the nation is eagerly waiting to see. And whatever it does, it should stop bringing a top-down approach to critical reforms.\n",
        "headline_1": "How is this a priority for the government?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/how-priority-the-government-3911416",
        "news_paper_name": "The Daily Star",
        "publish_date": "07-06-2025"
    },
    {
        "full_article": "The extent to which the right to file cases has been exploited in the wake of the July uprising boggles the mind. It was only the other day that we commented on the questionable manner in which a 69-year-old former professor accused in an attempted murder case was treated. The case—filed by a former Jagannath University Chhatra Dal leader who was injured in a clash at the height of the uprising—had several hallmarks of a dubious case, including its lodging after about seven months since the alleged crime and mass listing of accused individuals (193 in total). Yet she was singled out, arrested, denied bail, and sent to jail. As we try to process the role likely played by police and magistrate courts in enabling such cases, we are again reminded of their absurdities by yet another case reported by this daily.\nThe victim this time, strange as it may seem, is a \"dead\" man coming alive. According to our report, Md Selim, a grocer from Mymensingh's Phulbaria, was falsely declared dead in a murder case filed over the July uprising. Lodged by his elder brother, with two other brothers serving as witnesses, the case claims that Selim was shot dead by police in Dhaka's Jatrabari on August 3 and later buried in Gopibagh. It also falsely implicates 41 people, including the ousted PM Sheikh Hasina.\n\nSelim is now fighting a surreal legal battle just to prove he exists, scurrying from office to office, facing severe harassment, and fearing for his life as a potential murder would fit the narrative of his \"death.\" The motive behind this case, as recent police investigations have uncovered, is a family dispute over inherited land. With Selim having no sons, his three brothers allegedly sought to seize his share by exploiting the chaos of the uprising to eliminate him, at least on paper.\nSelim is now fighting a surreal legal battle just to prove he exists, scurrying from office to office, facing severe harassment, and fearing for his life as a potential murder would fit the narrative of his \"death.\" The motive behind this case, as recent police investigations have uncovered, is a family dispute over inherited land. With Selim having no sons, his three brothers allegedly sought to seize his share by exploiting the chaos of the uprising to eliminate him, at least on paper.\nThat the legal system could be weaponised so easily for personal gain, and that such a bizarre case could progress as far as it did, speaks volumes about the merit of many of the cases filed over July atrocities. The incident also raises alarm about the integrity of those responsible for vetting or handling such cases. If an alive man can be shown as dead, and a 69-year-old widow arbitrarily jailed, how many other opportunistic or retaliatory cases have slipped through the cracks? We call on the authorities to urgently review all such politically or personally motivated cases, and hold to account those filing or enabling them. No one must be allowed to exploit the legal system or the July uprising.\n",
        "headline_1": "'Dead' man coming alive is the new face of July case fiasco",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/dead-man-coming-alive-the-new-face-july-case-fiasco-3909296",
        "news_paper_name": "The Daily Star",
        "publish_date": "07-06-2025"
    }
]