[
    {
        "full_article": "Shocked that an acid attack victim had not got closure 16 years after the crime was committed, the Supreme Court of India made a slew of oral observations early this week calling the slow pace a “mockery of the system”. The Chief Justice of India (CJI), Justice Surya Kant, said acid attackers must not be shown any sympathy by courts, and called for the “entire system” to respond against them. Shaheen Malik was 26 and was studying for an MBA degree when she was attacked outside her office in Haryana in 2009. Till 2013, “nothing happened” in her case, she told the CJI. The case was finally transferred to Rohini court in Delhi from Haryana, where the trial is pending and “final arguments” are on. Ms. Malik has undergone reconstructive surgeries, and in 2021, she set up Brave Souls, an NGO which offers medical and legal support to acid attack survivors. In fact, she was knocking at the Court’s door with a PIL seeking formal recognition of survivors as persons with specified disabilities under the Rights of Persons with Disabilities Act, 2016. She was bringing the Court’s notice to those acid attack victims who had been forcibly fed acid and were not marked for life like others who had acid thrown at them but nevertheless lived with terrible suffering.The CJI asked the Centre to consider bringing an ordinance. Solicitor-General Tushar Mehta, appearing for the Centre, said no respondent could oppose the cause of the petitioners. Perpetrators of acid attacks who leave victims, mostly women and minors, scarred inside and outside for the rest of their lives “must meet with the same ruthlessness as they showed their victims”, he said. The CJI ordered the Registrar-General of the High Courts to provide the number and details of pending trials in acid attack cases; he also proposed setting up of special courts to exclusively conduct acid attack cases on a day-to-day basis. In the past, in Laxmi vs Union Of India and Ors., the Court had directed the government to ensure that acid attack victims got proper treatment, aftercare and rehabilitation, also asking it to look into the banning of sale of acid across the counter. Section 124 of the Bharatiya Nyaya Sanhita deals with acid attacks and the punishment to be meted out, but reality paints a grim picture, with trials being long-drawn and conviction rates low. According to latest National Crime Records Bureau data, there were 207 incidents of acid attacks across the country in 2023, with West Bengal ignominiously topping the list with 57 cases, followed by Uttar Pradesh (31). Victims of acid attacks, one of the worst forms of gender violence imaginable, deserve a lot better. Published - December 06, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        crime, law and justice\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        disabled\n                    \n                            /                      \n                        \n                        children\n                    \n                            /                      \n                        \n                        West Bengal\n                    \n                            /                      \n                        \n                        Uttar Pradesh",
        "headline_1": "​Marked for life: On acid attack survivors",
        "headline_2": "Acid attack victims deserve better from courts and law enforcement",
        "link": "https://www.thehindu.com/opinion/editorial/marked-for-life-on-acid-attack-survivors/article70362175.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "07-12-2025"
    },
    {
        "full_article": "President Donald Trump counts the crisis in Congo as among the conflicts he has helped resolve. On December 4, he hosted the leaders of Rwanda and the Democratic Republic of Congo in Washington for the signing of a formal peace agreement, which endorsed an earlier deal concluded by the Foreign Ministers of both countries. Mr. Trump hailed the accord as a “historic” step towards bringing prosperity to Africa, while Congolese President Félix Tshisekedi and his Rwandan counterpart Paul Kagame, who had frequently exchanged insults, praised his mediation. Mr. Trump also promised American investments in the resource-rich Congo if peace holds. On Thursday, he said he would send “our biggest and greatest companies over to the two countries”, adding that “we are going to take some of the rare earth, take out some of the assets and pay ... and everybody is going to make a lot of money”. But beyond the grandiosity of the ceremony, the situation remains complex and violent, with fighting continuing to rage in eastern Congo between Congolese forces and the M23 rebels. Under the agreement, Rwanda wants Congo to disarm the Hutu militias operating from its territory, while Congo wants Rwanda to withdraw troops from the east. Ultimately, however, the success of the deal hinges on securing peace between the Congolese government and M23.The crisis in Congo can be traced back to the 1994 Rwandan genocide in which about 8,00,000 people, mostly Tutsis, were massacred by ethnic Hutu militias. After the genocidal regime in Kigali fell, thousands of Hutus fled to Congo in the mid-1990s. Rwanda now claims that some of the militias that took part in the genocide continue to operate from Congolese territory. M23, which takes its name from a failed peace agreement signed between a Tutsi-led rebel group and the Congolese government on March 23, 2009, says it is fighting to protect the rights of Congo’s Tutsi ethnic minority. The Congo and UN experts say neighbouring Rwanda, ruled by a Tutsi-led government, is backing M23. In 2012, shortly after its formation, M23 seized much of Goma in eastern Congo, but withdrew when Rwanda came under international pressure. It started another rebellion in 2021, capturing Goma again and expanding its reach. Alongside the U.S.-brokered talks between the Congo and Rwanda, a parallel dialogue between M23 and Kinshasa, facilitated by Qatar, is also under way. Congo wants M23 to withdraw from the eastern regions it controls, but the rebels have shown little interest in doing so. Mr. Trump’s declaration that he brought the war to an end appears premature, given the complexity of the crisis. For peace, the wounds of the genocide must be healed, inter-racial relations between Hutus and Tutsis improved, non-state militias disarmed and ties between Rwanda and the Congo stabilised. Published - December 06, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Democratic Republic of Congo\n                    \n                            /                      \n                        \n                        Rwanda\n                    \n                            /                      \n                        \n                        peace negotiations\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        crime\n                    \n                            /                      \n                        \n                        national or ethnic minority\n                    \n                            /                      \n                        \n                        Qatar\n                    \n                            /                      \n                        \n                        human rights",
        "headline_1": "Deal without peace: On the U.S. and Congo-Rwanda accord",
        "headline_2": "Trump’s announcement of the accord between the Congo and Rwanda is premature",
        "link": "https://www.thehindu.com/opinion/editorial/deal-without-peace-on-the-us-and-congo-rwanda-accord/article70362193.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "07-12-2025"
    },
    {
        "full_article": "This week, something strange happened in India’s aviation world. The government had made new rules to ensure that pilots got enough rest so they could fly safely.\nThese rules are called FDTL – Flight Duty Time Limitations. They were supposed to start long ago, but India’s biggest airline, IndiGo, still wasn’t ready.\nWhen the rules finally had to be followed, IndiGo said it couldn’t handle them. So it started cancelling hundreds of flights every day. This left thousands of passengers stuck at airports for hours, with no idea when they would fly. Some ticket prices even shot up to Rs 1 lakh for a normal economy seat!\nIt almost felt like IndiGo was saying to the government:\n“If you force these rules, we’ll cancel flights and create chaos.”\nWhy could IndiGo do this? Because it is too big. It controls more than 60% of all flights in India. That means if IndiGo stops flying normally, the whole country feels it. In many other countries, no single airline is this powerful.\nThe government finally gave up and said the new pilot-rest rules would not be applied for now. They said this was “for passengers’ good”, but honestly, they didn’t have much choice. The airports were already a mess.\nPilots are upset too. They say airlines should have hired more pilots to prepare for the rules, but didn’t. In fact, no new beginner pilots were hired this year.\nSo flights may become normal again soon. But the bigger problem remains: If a few airlines become too powerful, they can break rules and get away with it.\nTo fix this, India needs more airlines and more competition—so no single company can hold passengers, or the government, “hostage” again.\n\n",
        "headline_1": "Passengers treated like hostages",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/passengers-treated-like-hostages/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-12-2025"
    },
    {
        "full_article": "India’s Prime Minister Modi and Russia’s President Putin had an important meeting. It came at a time when the world’s politics are changing fast.\nFirst, the meeting showed that both countries want to make their own decisions, without being controlled by bigger powers.\n\nRussia wants to show it isn’t isolated or totally dependent on China after the Russia-Ukraine war.\n\nIndia wants more freedom while dealing with the US on tough trade talks.\n\n\nSecond, they talked about the Ukraine war. Modi said India supports any effort to bring peace. This matters because the longer the war continues, the more Russia depends on China — something both India and Western countries worry about.\nThird, India and Russia want to strengthen their partnership in more areas.\nThey discussed:\n\nA new agreement to make it easier for people to travel and work between both countries\nA plan to expand economic cooperation beyond just defence and energy, where they already work closely\n\n\nIndia also reminded Russia that some military equipment deliveries have been very delayed, and asked them to speed things up. On buying energy, India said it will always choose the best price and the best deal for itself.\nOverall, as global friendships and rivalries shift — with a stronger China and an unpredictable America — India and Russia want to find the best place for themselves in the world. Meeting an old, trusted partner helps both feel more secure.\n\n",
        "headline_1": "PutiNamo",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/putinamo/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-12-2025"
    },
    {
        "full_article": "Electoral politics is a zero-sum game, and not such a sweet deal after all \nWhen people talk politics to me and ask whether I’m pro-govt or anti-govt, pro- opposition or anti-opposition, I ask them how much they like jalebis. \nWinston Churchill – arch-imperialist, engineer of the Great Bengal Famine that claimed millions of lives, and loathsome specimen of the inhuman race – got it right for once when he said that democracy is the worst form of govt except for all the others that have been tried from time to time. \nDemocracy is not perfect, and its biggest imperfection is democracy itself. Democracy is founded on the elective principle of choice between govt and opposition. This necessitates democracy to be a binary system. A zero-sum game in which one side’s win can result only from another side’s loss. \nComputers operate on a binary system. A computer’s response to an input can be either 0 or 1. It cannot be both at the same time. \nParliamentary democracy makes us choose between govt and opposition or anti-govt, between zero and one. We can’t choose both together. \nBut unlike computers, we are not programmed to be binary entities. We might sometimes want zero and sometimes one, and sometimes both zero and one at the same time. \nThat’s where jalebis come into it. In his The Story of Civilisation, CEM Joad,  addressing his youthful readership, asked if one would be happy to eat only treacle toffee, assuming that it was one’s favourite food, all the time. And of course the answer is no. \nJoad said civilisation is based on the Aristotelian Golden Mean, the Buddha’s Middle Path, which lies between all treacle toffee and no treacle toffee at all, between all zeros and all ones, between opulence and destitution, between all govt and no govt, all opposition or no opposition.\nI like jalebis, but not all the time. I like daal-roti as well, or a slice of pizza. Similarly, there are times when I agree with govt and times when I agree with opposition. Does that make me a split personality, or just a split voter? \nSo when I’m asked about my politics, I say I like jalebis, but not all that much…\n\n",
        "headline_1": "Jalebis and democracy",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/jalebis-and-democracy/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-12-2025"
    },
    {
        "full_article": "China’s tax on condoms won’t make Chinese have more kids. Communist patriarchy can’t even see women’s POV\nSeriously? A tax on condoms? Yup, that’s what Chinese authorities are gifting folks this new year. The laughable logic is that this will make having kids less expensive than not having them. Obviously not, even if high costs of raising children are a key reason for China’s plummeting birth rate. Because anybody whose pocket protests at paying a tax on condoms, will hardly welcome paying the much, much higher price of bringing up baby. Maybe it betrays how frustrated and desperate govt is getting. In the decade since it ended the one-child policy, people have resisted all its go-forth-and-multiply bait. \nInstead, marriage registrations have halved. Remember that in China, like India, social norms mean that most children are still born in wedlock. And like a lot of other countries, China’s response to the decline of marriage and birth rates is to pile up the pressure on women. Given how central women’s high labour force participation rate (60%) has been to the Chinese economic miracle, nobody is quite sending them to the kitchen. But hey, women, how about just doing a job instead of chasing a career – this is what a lot of local govt policies and employers are ‘suggesting’ to women. It’s all horribly patriarchal, but pretends as if the crux of patriarchy isn’t that women aren’t the primary decisionmakers. Several govts fail at telling men to share childcare & domestic chores, reduce work hours & take paternity leave. China’s communists may be worse because there are no women among party bosses: there are none in the politburo or standing committee. \nIn richer China, in megacities like Shanghai, couples who are refusing to have children are even more out of CCP’s mindreach. DINKs, double income no kid pairs, are living up their arty-party lifestyles. Why not? It’s their choice. Ordering that babies be made is impossible – even in China. \n\n",
        "headline_1": "Commies & Babies",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/commies-babies/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-12-2025"
    },
    {
        "full_article": "Israel's problem is that despite its military power and its economic and technological superiority in the Middle East, it has limited capacity to portray its destructiveness as successful victories.\nThis limitation lies not only in Israel's small size and population, but more in the fact that it owes a large extent of its political, military and economic strength to the United States. Without unlimited US support, it could neither have executed what it has done so far, nor continued a genocidal war for more than two years without bearing heavy economic losses and civilian casualties. Even with US backing, Israel cannot evade international pressure and condemnation.\nOverall, this war has revealed the depth of Israel's dependence on the United States—so much so that fears are rising within Israel about the possible erosion of its independence and the transfer of decisions relating to war and peace to the White House. The UN General Assembly resolution calling for an end to Israel's 1967 occupation, and its withdrawal from Gaza and the West Bank, further demonstrates Israel's isolation from the rest of the world and its reliance on the US.\nFurthermore, the rise of other Arab and regional powers, such as Saudi Arabia and Turkey, in parallel with the atrophy of Israel's position in US strategy in the Middle East—as evidenced by Washington's increased reliance on them on issues concerning Gaza and Syria—signals a weakening of Israel's independent standing. This is also reflected in the indifference towards the narrative of \"normalisation,\" especially after the decline of Iran's influence in the region.\nThe trajectory of the genocidal war creates a pathway to a future in which Israel can be seen and treated like any other state, without exceptional global indemnity for acts such as genocide.\nIsrael has exposed its reality as a colonial, settler, racist and theocratic state—one that practices genocide against other people. It has lost precisely where it once sought recognition for itself.\nIsrael has forfeited its claim to monopolise the status of the \"victim\" after pursuing a brutal policy of genocide, and it has forfeited its image as a democratic state by enacting openly discriminatory policies towards Palestinians. It has lost the sympathy it sought to cultivate in the West. It can no longer be viewed as a \"single weak state targeted by ferocious neighbours\" that, in \"self-defence,\" can justify threatening or killing them. It can no longer play the victim card.\nAs a result, Israel is losing its legitimacy on the international stage, echoing the mechanisms and dynamics that led to the collapse of the apartheid regime in South Africa.\nIsrael has also become a political, security, military, financial and moral burden on Jewish communities in the West, while losing its status as a safe haven for Jews. It has become the only place in the world that poses a danger to Jewish lives because of the policies of Israel's rulers.\nGlobally—from governments to societies—Israel is increasingly viewed as a state acting against international values, standards and resolutions, and as a security, political and financial burden. It has become a destabilising force and a threat to the values of freedom and equality by manipulating and conflating anti-Israel sentiment with anti-Semitism. That strategy, too, has stopped working. Today, it is clear to the world that Israel's attempt to dodge criticism by invoking religion or the history of the Holocaust has long been a tactic to evade accountability for the inhuman killing of another population over generations.\nThe war has exposed Israel's weakness and the impossibility of eliminating the Palestinian people or removing their cause from international and Arab agendas. Israel's attempt to annihilate Palestinians without restraint has led to the current international backlash against it.\nYousef SY Ramadan is the ambassador of Palestine to Bangladesh.\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Israel stands exposed even if global powers fail to act",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/israel-stands-exposed-even-if-global-powers-fail-act-4052281",
        "news_paper_name": "The Daily Star",
        "publish_date": "07-12-2025"
    },
    {
        "full_article": "A primary school teacher on strike was seen bleeding profusely from the wounds inflicted by the agitated guardians who blamed him and his colleagues for turning their wards into hostages to push for better pay and benefit. There was a lot to unpack from the image. As I scrolled down to the comment section, there was no sympathy for the striking teacher or protest against the violence. \"Good, he deserves it!\" reads one comment. What does such a reaction say about where our sympathies lie as well as how our institutions fail? This crisis over primary school exams operates across four interlocking axes: ethical, financial, moral, and political. And none, it seems, can be solved in isolation.\nThe teachers have the legal right to indulge in civic protest. But is it ethical to do so by compromising their primary duty towards their students? Additionally, what about the children's rights to education enshrined in the Unesco mandate? Adults' financial concerns should not infringe on the basic rights of children, who are right-bearing entities. The cry for a raise is not unique to the teachers: inflation and household costs have hit every sector. Then again, is it moral to use exams as bargaining chips with children as the currency? Is it ethical to betray the guardians who have entrusted their children, hoping the teachers will ensure their education? The guardians feel the added pressure that the disruption caused by the teachers will create a session lag costing more both in terms of time and money. Conversely, the striking teachers can well argue that their demands are far from sudden. They have voiced their resentment over pay grade anomalies, promotion bottlenecks, and perceived humiliation relative to other cadres in different forums and formats. Regular political dialogues have failed, and the failure of preventive governance has now pushed the teachers towards last-minute brinkmanship around exams. So, it is necessary to reflect on the issues that gave rise to the current situation.\nThe assistant teachers of 65,000-plus government primary schools have been pressing for a three-point demand. They want to upgrade their pay scale (from grade 13 to grade 10/11), resolve higher-grade benefits after 10 and 16 years of service, and ensure 100 percent departmental promotion from assistant to head teacher. The protest intensified in November with a call for the complete shutdown and boycott of the annual exams starting December 1.\nAs a result, many schools failed to hold exams. In some cases, the headmaster, with assistance from guardians, held or invigilated the exams. The authorities served legal notices to absent teachers, issued transfer orders, and even threatened to take actions under criminal law. Social media is rife with images of heated arguments, scuffles, or symbolic acts (tearing up question papers, locking school gates, shouting matches with head teachers or local officials).\nI wish the conflict was a mere sectoral wage dispute. It is a confrontation staged on the bodies and futures of children. The guardians and teachers are only addressing a small portion of the problem, while the teachers' councils continue to battle the financial issue with the overburdened interim government. In this tussle, parents blame teachers, educators blame the ministry, and children remain voiceless.\nThe same ethical scripts were seen earlier, where the bargaining chips were patients during the health sector strike, passengers during transport blockades, or ordinary citizens as collateral damage in struggles between organised groups and the state. Can we call this yet \"another government-versus-everyone standoff\" a \"labour dispute\"?\nThe deeper political truth is uncomfortable. All the promises of reform were doomed because everyone wants a slice of the pie. Nobody wants to bake it. They believe that the only way to achieve something is by making disruption unbearable. The formula is simple. Negotiation requires disruption. Unless you block a road or boycott an exam, no one listens. Primary teachers have attempted to follow the national strategy. But by the time they have come to the scene, the patience of the government has withered away. And they responded, not with carrots, but with sticks. And some teachers lost their last vestige of prestige by grasping the feet of marauding police constables. The irony lies in the expectation of low-paid teachers to uphold the moral standards of those unaffected by pay rigidity.\nHead teachers and local government officials intervened to provide a lifeline. Caught between ministry orders and teacher resentment, they allowed exams to continue, creating friction with both groups. The crisis also showed the urban/rural rift where the city-based guardians tend to react more assertively than the rural ones. Since most of the primary teachers are women, the lack of sympathy also hints at gendered devaluation of care work.\nThe crisis, therefore, is not a teachers' strike. It's a mirror held up to Bangladesh. Ours is a governance system that waits for explosions instead of preventing fires. We have never been able to find a balance between the welfare state and neoliberal corporatisation. Our essential workers, and by extension all public- and semi-public sector officials, survive on words rather than salaries. We have adopted a culture of protest that aims to inconvenience others, believing it to be the most persuasive form of communication. The practice of buying off the leaders and diluting the protests is so common that our moral climate is made up of fragile trust and negotiable respect. The country reminds us of the arithmetic problem we had as children, involving a water reservoir with more pipes leaking water than ones filling it. Meanwhile, we act like plumbers busy arguing about whose wrench is more prestigious.\nThe announcement of the strike's suspension serves as a rehearsal for a mediated agreement. In a few weeks, we will go back to an uneasy calm, and our teachers will return to their classes pretending nothing had happened. The cracks, however, will remain unhealed and unattended.\nA more honest approach would require endorsing a teacher pay scale that maintains transparency and parity; developing a contingency plan for dispute resolution so that classrooms aren't used as bargaining arenas; and creating exam alternatives to protect children from the adult's power struggles. After all, schools exist for children. They shouldn't be used as pawns in our political game. The other stakeholders of the school are our teachers, who must be respected as essential workers building the nation's foundational blocks. Treating them like vocational workers cannot be beneficial for the country's future.\nThe image of a bleeding teacher, cursed by the public with no moral support to hold him, is a national crisis. We can consider it an outburst of the guardians' anger or frustration over their fear for their children's future or a self-reflective concern about paying more for coaching or an extra year caused by the teacher's work absence. Regardless, the hostility mirrors how there is a structural faultline that causes occasional tremors in our social life—an issue not unique to the primary teachers' protest but a cross-sectoral phenomenon affecting our country.\nDr Shamsad Mortuza is professor of English at Dhaka University.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Primary teachers’ strike is a mirror held up to Bangladesh",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/blowin-the-wind/news/primary-teachers-strike-mirror-held-bangladesh-4051426",
        "news_paper_name": "The Daily Star",
        "publish_date": "07-12-2025"
    },
    {
        "full_article": "Israel's problem is that despite its military power and its economic and technological superiority in the Middle East, it has limited capacity to portray its destructiveness as successful victories.\nThis limitation lies not only in Israel's small size and population, but more in the fact that it owes a large extent of its political, military and economic strength to the United States. Without unlimited US support, it could neither have executed what it has done so far, nor continued a genocidal war for more than two years without bearing heavy economic losses and civilian casualties. Even with US backing, Israel cannot evade international pressure and condemnation.\nOverall, this war has revealed the depth of Israel's dependence on the United States—so much so that fears are rising within Israel about the possible erosion of its independence and the transfer of decisions relating to war and peace to the White House. The UN General Assembly resolution calling for an end to Israel's 1967 occupation, and its withdrawal from Gaza and the West Bank, further demonstrates Israel's isolation from the rest of the world and its reliance on the US.\nFurthermore, the rise of other Arab and regional powers, such as Saudi Arabia and Turkey, in parallel with the atrophy of Israel's position in US strategy in the Middle East—as evidenced by Washington's increased reliance on them on issues concerning Gaza and Syria—signals a weakening of Israel's independent standing. This is also reflected in the indifference towards the narrative of \"normalisation,\" especially after the decline of Iran's influence in the region.\nThe trajectory of the genocidal war creates a pathway to a future in which Israel can be seen and treated like any other state, without exceptional global indemnity for acts such as genocide.\nIsrael has exposed its reality as a colonial, settler, racist and theocratic state—one that practices genocide against other people. It has lost precisely where it once sought recognition for itself.\nIsrael has forfeited its claim to monopolise the status of the \"victim\" after pursuing a brutal policy of genocide, and it has forfeited its image as a democratic state by enacting openly discriminatory policies towards Palestinians. It has lost the sympathy it sought to cultivate in the West. It can no longer be viewed as a \"single weak state targeted by ferocious neighbours\" that, in \"self-defence,\" can justify threatening or killing them. It can no longer play the victim card.\nAs a result, Israel is losing its legitimacy on the international stage, echoing the mechanisms and dynamics that led to the collapse of the apartheid regime in South Africa.\nIsrael has also become a political, security, military, financial and moral burden on Jewish communities in the West, while losing its status as a safe haven for Jews. It has become the only place in the world that poses a danger to Jewish lives because of the policies of Israel's rulers.\nGlobally—from governments to societies—Israel is increasingly viewed as a state acting against international values, standards and resolutions, and as a security, political and financial burden. It has become a destabilising force and a threat to the values of freedom and equality by manipulating and conflating anti-Israel sentiment with anti-Semitism. That strategy, too, has stopped working. Today, it is clear to the world that Israel's attempt to dodge criticism by invoking religion or the history of the Holocaust has long been a tactic to evade accountability for the inhuman killing of another population over generations.\nThe war has exposed Israel's weakness and the impossibility of eliminating the Palestinian people or removing their cause from international and Arab agendas. Israel's attempt to annihilate Palestinians without restraint has led to the current international backlash against it.\nYousef SY Ramadan is the ambassador of Palestine to Bangladesh.\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Israel stands exposed even if global powers fail to act",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/israel-stands-exposed-even-if-global-powers-fail-act-4052281",
        "news_paper_name": "The Daily Star",
        "publish_date": "07-12-2025"
    },
    {
        "full_article": "The government-commissioned white paper on Bangladesh's much-publicised journey towards \"Digital Bangladesh\" has delivered a sobering verdict. What was once marketed as a transformative national project has now been revealed—through the task force led by Professor M Niaz Asadullah—to be mired in systemic governance failures, entrenched corruption, and pervasive political capture. The conclusion drawn by the task force, after reviewing 52 ICT Division projects, should worry anyone concerned with the country's development trajectory.\n\nThe white paper documents how political influence seeped into the very architecture of the previous Awami League government's digital modernisation drive: at least 12 major projects and 65 components were named after political personalities or directly leveraged for partisan visibility. Flagship connectivity initiatives such as Info-Sarker II and III devolved, in the report's words, into \"a textbook case of triple rent seeking.\" The Bangladesh Hi-Tech Park Authority—tasked with fostering innovation and industrial diversification—fared no better. Instead of nurturing a technology ecosystem guided by demand and feasibility, the authority found itself redirected towards political pageantry and patronage. IT parks and training centres were launched not on the basis of market need, infrastructure readiness or the capacity to attract tenants, but on where they could deliver the most partisan mileage.\n\nIrregularities revealed, includes: equipment priced at up to four times the global rate, cartel-like vendor networks, manipulated tenders, weakened state control over critical infrastructure, and an unhealthy reliance on private monopolies in connectivity projects. To shield themselves from scrutiny, some project authorities allegedly adopted \"dual governance\" models that enabled donor-affiliated consultants to influence procurement and programme design. Even education-focused initiatives such as the Sheikh Russel Digital Lab (SRDL) and School of Future were found to be non-functional. Meanwhile, the Digital Sylhet City Project has been one of the starkest examples of politicised failure. Conceived as an urban connectivity solution, it collapsed under the weight of patronage politics. Wi-Fi coverage reached less than five percent of targeted beneficiaries, and no agency accepted responsibility for its operations. These failures represent more than just wasted public funds—they constitute a profound lost opportunity for young Bangladeshis as the world accelerates into an era defined by digital capability. Reviewing one of the most celebrated projects of the previous regime is a necessary step towards understanding how the absence of democratic accountability erodes public institutions and drains scarce national resources. It shows that patron-client politics does not simply distort priorities; it often cripples entire governance mechanisms. The interim government must take the task force's recommendations seriously. And political leaders—whether in office or aspiring to be—would do well to absorb the lesson at the heart of this white paper: without transparency, oversight, and genuine accountability, no grand vision, however dazzling in rhetoric, can deliver the transformation it promises.\n",
        "headline_1": "Digital Bangladesh, a tale of governance failures",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/digital-bangladesh-tale-governance-failures-4051281",
        "news_paper_name": "The Daily Star",
        "publish_date": "07-12-2025"
    },
    {
        "full_article": "We are alarmed by the sharp increase in HIV infections in Bangladesh. The latest HIV/AIDS Situation Report-2025 reveals that 1,891 new infections were recorded between last November and this October, 453 more than the previous year. This is also the highest year-on-year increase since 2000. The fact that this surge occurred during a period when overall HIV testing actually declined by nearly two lakh is particularly concerning. When fewer tests produce more positive results, it suggests that transmission is increasing faster than expected, and that ongoing preventive measures are not sufficient. The report by the DGHS also shows that the proportion of HIV-positive individuals receiving treatment has fallen from 78 to 74 percent. Meanwhile, 18 percent of those potentially living with HIV remain unaware of their status, allowing the virus to spread silently.\nThe surge in cases is linked to several factors, according to health officials. While overall testing declined because fewer migrant workers were screened—dropping from 13.05 lakh last year to 10.11 lakh this year—testing among key populations, including people who inject drugs, sex workers, and transgender individuals, rose sharply, leading to more detections. This year, 1.17 lakh people from these groups were tested, compared to about 97,000 the previous year. These populations accounted for 56 percent of new cases, underscoring their vulnerability and the need for targeted services without any interruption. The surge also included 217 new cases among the Rohingyas.\nAnother likely factor is the expiry of a government programme, disrupting vital prevention services such as condom and needle distribution, which may have increased the threat for high-risk groups, although health officials say more research is needed to confirm its impact. Experts have also warned that late diagnosis and poor awareness are increasing HIV-related deaths in the country, with Chattogram emerging as particularly vulnerable.\nThe government, therefore, must take urgent action to reverse the current trends. It must strengthen prevention programmes while relying less on temporary donor-funded initiatives. This involves expanding screening, testing and treatment services across all districts of all vulnerable groups, including migrant workers, and improving coordination between relevant government agencies and community-based organisations. These organisations should be empowered to work closely with vulnerable groups. The national awareness campaigns must also be better designed to reach all segments of society. Addressing social stigma is equally important, as it prevents many from seeking timely testing and care.\nThe sharp rise in cases is a clear warning that Bangladesh risks falling behind in the global fight against HIV, so comprehensive action including ensuring sustainable funding, a coherent national strategy, and strong political commitment is essential.\n",
        "headline_1": "Rising HIV cases concerning",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/rising-hiv-cases-concerning-4050841",
        "news_paper_name": "The Daily Star",
        "publish_date": "07-12-2025"
    },
    {
        "full_article": "As the country hurtles towards a general election in February, the law and order situation continues to cause concerns. Reports about recent incidents such as the twin killings outside a judge's court in Khulna or the viral footage of a politician gunned down in a shop in Dhaka's Pallabi area—however isolated they may seem—contract the optimism of Home Adviser Jahangir Alam Chowdhury who insists that there is \"no risk\" of the security situation deteriorating before the polls. He claims the environment is \"steadily improving\" following the tumultuous ousting of the Awami League regime. This, however, remains at odds with the reported reality.\nData from the Centre for Governance Studies (CGS) suggests that the country is still reeling from that violent hangover. Firearms-related offences surged by 30 percent year-on-year in the first half of 2025. Police ledgers are equally dismal: in the past 15 months, 4,809 murder cases were filed nationwide, 3,236 of them in the first 10 months of this year, as this newspaper reported. That equates to more than 10 bodies a day. Further CGS data offers a slightly more nuanced, though hardly reassuring, view. The monthly average of murders fell to 322 in the first half of this year from 343 in the same period a year earlier. However, this is still a roughly 28 percent increase over the 2023 average.\nThe problem is threefold. First, the machinery of law enforcement remains brittle. The police force, having acted as the blunt instrument of the previous regime, collapsed in morale and efficacy following last year's uprising. They have yet to regain their footing. A police spokesperson admits that stopping targeted killings—often born of hyper-local grudges—is difficult. Second, during the chaos of the political changeover, many police stations were looted. More than 1,300 firearms remain missing, a floating arsenal now likely in the hands of the gangs and political muscle carving up turf in different localities. Rewards offered for their return have yielded little. Third, the political vacuum is being supplemented by old habits. With the election schedule looming, prospective candidates are not merely canvassing; they are battling for dominance, with reports indicating a sharp rise in intra-party clashes. Worse still, \"top criminals,\" released from prison or emboldened by the security void, are now being recruited to intimidate rivals.\nThe interim government is tasked with shepherding a democratic transition, but the terrain is being mined by political vendettas, factional feuds, and a resurgent underworld. Security analysts warn that without a focused crackdown, specifically the recovery of illegal arms and the re-arrest of resurgent criminals, the days to the upcoming polls will hardly be peaceful. The government has done relatively well to stabilise the economy. Now, it must secure the streets to make sure the path to the ballot box becomes peaceful.\n",
        "headline_1": "Prevent pre-election violence at any cost",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/prevent-pre-election-violence-any-cost-4050626",
        "news_paper_name": "The Daily Star",
        "publish_date": "07-12-2025"
    }
]