[
    {
        "full_article": "February’s sharp rise in the monthly services Purchasing Managers’ Index (PMI), to 59, has provided a welcome relief to investors and policymakers, following the rise in GDP growth numbers, released by the National Statistical Office (NSO) for the December quarter of the current fiscal (Q3FY25). The strong rebound in the services PMI, up from 56.5 in January, which marked a 25-month low, helped offset the decline in the manufacturing PMI, which fell to a 14-month low of 56.3 in February. A PMI reading above 50 signals expansion, while anything below this indicates contraction. The PMI survey, conducted every month by S&P Global across over 40 countries, is a key indicator of economic momentum. The fact that manufacturing and services — sectors that have accounted for about 80% of India’s GDP since 2010 — remain in expansion mode is positive. This resilience persists despite capital outflows from Indian markets, suggesting that the country’s economic fundamentals remain strong. A more telling indicator of long-term economic strength is the quarterly earnings of the Sensex, India’s benchmark index comprising 30 of the most valued and actively traded companies on the Bombay Stock Exchange (BSE). The Q3FY25 results point to solid net profit growth for nearly all firms.However, looming economic risks remain. The threat of reciprocal tariffs announced by United States President Donald Trump, and set to take effect on April 2, poses a challenge for the manufacturing sector. Meanwhile, the services sector is facing a different disruption: the rapid pivot to artificial intelligence (AI)-driven solutions. While the NSO reported 6.2% real GDP growth for Q3FY25, top executives from India’s leading IT firms have, at an industry event in Mumbai, cautioned that growth in the sector could be as low as 5.1% in FY25, up from 3.8% in FY24. Although this may seem concerning for an industry that has enjoyed a 16% compounded annual growth rate for nearly 25 years, it still represents an increase of $29 billion, bringing the sector’s expected value to $283 billion in FY25. In its 2025 Strategic Review report, NASSCOM has identified geopolitical upheavals and rising tariffs as key challenges. But business leaders at the event attributed much of the slowdown to the disruptive impact of AI, which is reducing earnings from new contracts and reshaping hiring and training practices. India’s services and manufacturing sectors face a triple challenge: rapid technological transformation, increasing global protectionism, and the potential for a U.S. recession. This could have significant repercussions for India, given that the U.S. remains its largest trading partner. To navigate these headwinds, India must urgently diversify its trading base. Published - March 08, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        economy (general)\n                    \n                            /                      \n                        \n                        investments\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        stock activity\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        manufacturing and engineering\n                    \n                            /                      \n                        \n                        Artificial Intelligence\n                    \n                            /                      \n                        \n                        Mumbai\n                    \n                            /                      \n                        \n                        computing and information technology\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        trade policy",
        "headline_1": "​Diversify now: On India and looming economic risks",
        "headline_2": "India needs to expand its trading base to overcome global headwinds",
        "link": "https://www.thehindu.com/opinion/editorial/diversify-now-on-india-and-looming-economic-risks/article69303172.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "08-03-2025"
    },
    {
        "full_article": "Earlier this week, Indian Army and Indo-Tibetan Border Police teams rescued 23 workers who were stuck in a rubble of snow and ice, following an avalanche at Mana village, Uttarakhand. Eight workers died in the disaster, which occurred at a Border Roads Organisation construction site that had housed 54 labourers in eight containers. To say that the rescue operation was arduous would be an understatement. The rescue teams worked in a near-continuous 60-hour shift amidst heavy snowfall at an elevation of 10,500 feet above mean sea level. With the roads blocked by the snow, helicopters were used to evacuate those rescued to the Joshimath Army Hospital — five helicopters from the Indian Army, two from the Indian Air Force and one civilian copter. Along with the sheer physical effort expended in the extraction, the rescue operation employed a drone-based detection system to detect the containers that were buried under several feet of snow, ice and rock.Avalanches in the Himalayan States, like the one in Mana, which is among the last outposts in Indian territory and close to the border with China, are not uncommon. Villagers here have historically been ‘winter-migrants’, which means that during the winter months the village is deserted. Coinciding with the ritual closing of the Badrinath temple in November, there is migration to villages lower down, such as Gopeshwar and Jyotirmath, for the winter, with residents returning only when the temple reopens in April or May. This is part of traditional wisdom and has a lot to do with the historical experience of the upper Himalayan stretches being prone to disasters. While these practices may have saved the resident villagers, it still raises the question as to whether the workers — several of them migrants — were adequately aware of the risks of their enterprise. Given the strategic location of the village and the need to develop improved roads for civilian and military access, there will always be a sizeable number of people engaged in activity in regions that are inherently inhospitable and risk-prone. Once disaster strikes, efforts focus on the rescue operation, and once they conclude, there is little reflection on whether preventive measures could have been taken. Avalanches cannot be predicted with precision, but steps can be taken to design containers that are safer to live in and can improve the odds of survival. There is much to learn from the way bomb shelters are imagined or how research stations at Antarctica are designed. All of this requires a greater sensitivity to workers who toil amidst hazards and not merely label these tragedies as inevitable consequences of natural disasters. Published - March 08, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        mountains\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        natural disasters\n                    \n                            /                      \n                        \n                        avalanche/landslide\n                    \n                            /                      \n                        \n                        armed Forces\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Antarctica\n                    \n                            /                      \n                        \n                        Uttarakhand",
        "headline_1": "​Himalayan tragedy: On avalanches in the Himalayan States",
        "headline_2": "Natural disasters are not very predictable, but their impact can be controlled",
        "link": "https://www.thehindu.com/opinion/editorial/himalayan-tragedy-on-avalanches-in-the-himalayan-states/article69303208.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "08-03-2025"
    },
    {
        "full_article": "Kiwis are a marvellously different cricket team\nAustralian cricket legend Dean Jones had this to say about the differences between cricket in Australia and New Zealand: “When kids in Australia come back home after playing cricket, their dads ask, ‘Did you win?’ But with kids in New Zealand, it’s always ‘Did you have fun?’” This perhaps explains why Kiwis are the perennial nice guys of cricket. Despite being one of the most consistent cricketing sides, Black Caps have always worn their success lightly. They will again feature in a major ICC final tomorrow as they take on India in the 2025 Champions Trophy decider. India, according to pundits, are favourites. But that won’t bother Mitchell Santner and his men – they have always been unassuming underdogs.\nCricketers across generations will affirm that the Kiwis are just impossible to dislike. Recall how they lost out on winning the 2019 ODI World Cup on a ridiculous boundary rule after both they and England got tied scores in normal time and super overs. Any other team would have thrown a hissy fit. But not Kiwis. For them cricket is not only about winning. New Zealand Cricket actually has a nationwide programme called Smash Play Junior-Tamariki for 5-12-year-olds that promotes fun and values such as honesty, camaraderie and mutual support.\nThus, in a cricketing world where winning and commercial interests powerfully, sometimes toxically, combine, it’s lovely to have a team that plays hard but doesn’t take itself too seriously. And as their 2021 World Test Championship victory showed, nice guys don’t always finish last.\n\n",
        "headline_1": "One for nice guys",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/one-for-nice-guys/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-03-2025"
    },
    {
        "full_article": "Blame their aura, clout, performance & inflated stock values\nStarbucks’ new CEO Brian Niccol earned $96mn for four months’ work last year when his US baristas earned only $18 an hour, on average. The hourly differential is mind-boggling. But Niccol is no outlier. The median compensation for S&P500 CEOs touched $16.3mn in 2023. In tandem, the pay gap with ‘median’ employees – suits, not baristas, in Starbucks’ case – also grew from 185 times in 2022 to 196 times in 2023. Nobody doubts that inequality has been growing since 1970s, but why? If it is money-grubbing, how do top managers justify it, Alexander Pepper asks in his book If You’re So Ethical, Why Are You So Highly Paid?\nSome say vertiginous CEO pay merely reflects the decision of market forces. They are not ‘overpaid’ because earning more than they deserve would be inefficient, and free markets hate inefficiency. Others say CEO pay is an example of economic ‘rent’ – they are paid way more than the minimum they would be willing to accept. We’ll come to the first view later.\nSo, how are super managers able to extract economic rent? Is it because they are scarce? When corporate profit zooms under a new CEO – other things remaining unchanged – isn’t it fair to attribute the increase to them? In which case, it would be fair that a part of the increase goes to them. The problem with this idea, Pepper points out, is that profits cannot increase if other things remain unchanged. A new CEO comes in, but workers aren’t enthused, productivity doesn’t change, the product doesn’t get better, no extra effort is put in to sell it…It’s impossible then for sales and profits to zoom. So other things have changed, and the question is, what part of the change is objectively, quantifiably, the new CEO’s contribution? Nobody knows.\nYou may argue that these changes were all due to the CEO. But consider, how can the new CEO of a carmaker, sitting in the HQ, influence customer service at a faraway workshop? There’s a good deal of delegation, and some of the best ideas come from unsung managers down the chain.\nA more plausible explanation – not justification – for soaring CEO pay is that the chiefs are part of rarefied social circles. Pepper says board members feel closer to them than to shareholders, and so are inclined to reward them handsomely. Unlike line workers, with whom salary negotiators feel no affinity, CEOs are insiders. But obliging one of your own has social costs. As worker pay remains stagnant, there’s bound to be some outrage. Firms have a workaround for this – camouflaging executive pay so that only a financial whiz can ascertain the real compensation. For example, a large chunk of CEO pay is delivered as shares, but since it’s not ‘money in hand’, CEOs don’t value it very much. Result: they ask for a lot more of it to feel satisfied, and that inflates the bill.\nComing back to the market forces point of view, let’s say the supply of CEOs is limited, and some of them are significantly better than others. As a firm, how do you attract the best? By offering 10-20% above a ‘normal’ CEO pay, or throwing money to get them at any cost? Pepper says saving money here could amount to being penny-wise but pound-foolish. Nobody wants to look foolish.\n\n",
        "headline_1": "Why even sky isn’t the limit for CEO pay",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/why-even-sky-isnt-the-limit-for-ceo-pay/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-03-2025"
    },
    {
        "full_article": "What should Zelenskyy wear to next Trump meet?\nTeam Zelenskyy meets Team Trump in Saudi next week. We don’t know if the principals will be there, but if they are, Zelenskyy will likely swallow his pride. He’s said he wants to “make things right” with US. Does that mean a suit? Trump clearly has a beef about Zelenskyy’s military-casual look. “You’re all dressed up today,” he said as Zelenskyy bounced out of a made-in-America SUV at White House on Feb 28. His minions rubbed it in thereafter. A rightwing media reporter asked, “Why don’t you wear a suit?” Zelenskyy’s reply is now a T-shirt legend in Ukraine: “I’ll wear the costume when this war is over.”\nBut to end the war, Zelenskyy needs a deal. Wearing a suit may be a convenient first step towards it. But does he really need to? Mahatma ditched his suit for a loincloth, “to identify myself with the poorest of the poor in India”. Nor did he slip back into a suit for his Buckingham visit. George V rolled his eyes – so what? His great-grandson, Charles III, politely welcomed an ‘unsuited’ Zelenskyy in Feb 2023, July 2024, and again last Sunday. Trump should also smell the coffee. The doers have hung up their suits. What Steve Jobs started, Zuckerberg, Altman and the other tech bros have regularised. Trump’s right hand, Elon Musk, wears printed tees – one said ‘Tech Support’ – to Oval Office. Last year, Sunak wore trainers during a Downing Street interview.\nDoing what others do, and expect of you, is conformity. Trump-Vance wants to put “ungrateful” Zelenskyy in a suit. Last time, they told him to “come back when he’s ready”. But the question on Ukraine’s streets is, “Will Russia stop killing Ukrainians if we all wear suits?” Nyet. Likewise, the deal depends on substance, not Zelenskyy’s style. He should be himself.\n\n",
        "headline_1": "Dress down",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/dress-down/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-03-2025"
    },
    {
        "full_article": "In his latest social media post, Trump issued a “last warning” to Hamas to release all remaining hostages, even as reports surfaced that Washington had initiated direct talks with the Palestinian group. He also told the people of Gaza that “a beautiful future awaits” them but not if the hostages aren’t released. But in essence, Trump does not deflect from his stance to deport, permanently, the entire Palestinian population of Gaza to an as yet unknown location.\nRead full story on TOI+\n\n",
        "headline_1": "Ugly truth about Gaza ‘riviera’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/ugly-truth-about-gaza-riviera/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-03-2025"
    },
    {
        "full_article": "A little over a year ago, we were alarmed to learn from the Directorate General of Medical Education (DGME) that 42 percent of faculty positions in the 37 government medical colleges were vacant. Now, according to a report by this daily, that number has increased to 43 percent, in a further blow to the education and professional prospects of medical students as well as the future of our healthcare system. It is a truism that good education requires good teachers. Students in many of these colleges, however, would settle for any teacher at all, regardless of their quality. For future healthcare professionals to be reduced to such desperation is neither fair nor conducive to our vision of a robust healthcare system that serves patients and reverses the trend of medical tourism.\nThe severity of this crisis is further underscored by the fact that a staggering 65 percent of professor posts in the medical colleges remain unfilled. At least four medical colleges have no professor at all, while 18 others are struggling with only one to five professors each. The shortage is particularly acute in the 23 newer colleges established during the Awami League's rule, where 75 percent of professor positions remain vacant. This critical gap at the top—depriving students of guidance from experienced mentors—is reflected down the ranks across all colleges, with 45 percent of associate professor posts and 51 percent of assistant professor posts also lying vacant.\nAccording to insiders, this is mostly a result of bureaucratic inertia, including delays in promotions and complexities in determining seniority between cadre and non-cadre doctors, including medical teachers. Many were also sidelined as Officers on Special Duty (OSD) after the political changeover on August 5 last year, exacerbating the crisis. According to an estimate, some 7,500 doctors across different grades are awaiting promotions. The backlog has sparked protests by a platform of cadre doctors who, on February 25, announced a two-hour work abstention starting March 8 if promotions are not granted. They also threatened an indefinite strike from March 11 if their demands remain unmet. Students, too, have staged protests demanding a resolution. Clearly, this issue requires urgent and well-planned interventions, preferably by establishing a separate system for overseeing the recruitment and promotion of doctors, health officials, and medical teachers.\nTeacher crisis is not the only problem plaguing public medical colleges. Some of them have no hospitals of their own, forcing students to travel elsewhere for practical lessons, resulting in a significant loss of study time. Many have attached hospitals, but those are also infested with problems including inadequate facilities, irregularities, mismanagement, poor sanitation, crisis of proper meals, etc. These issues must also be addressed with equal urgency. For now, however, fixing the public medical education sector should be a priority as its failure directly affects the long-term future of healthcare in Bangladesh.\n",
        "headline_1": "Fix persistent shortages of medical college teachers",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/fix-persistent-shortages-medical-college-teachers-3841946",
        "news_paper_name": "The Daily Star",
        "publish_date": "08-03-2025"
    },
    {
        "full_article": "Last year, the Bangladesh government released a draft of the National Artificial Intelligence (AI) Policy, which, given the changing political situation and a lack of public interest in general, did not get enough attention. Despite projecting a lofty vision of catapulting Bangladesh into an era of AI innovation and adoption by harnessing it for the well-being of citizens, economic prosperity, and sustainable development, the draft policy falls short in some aspects, especially compared to the more detailed and exemplary regulatory frameworks such as the Artificial Intelligence Act in the European Union (EU) and AI regulations in China.\nOne of the vital goals of any national AI policy should be ensuring that AI systems are legally required to be reasonably safe, secure, reliable, and protected against errors and biases. That is precisely one of the areas where our policy could be more comprehensive.\nOne of the major risks of AI lies in its susceptibility to errors and biases, which raises a wide range of ethical concerns. Unlike conventional computer programmes, AI systems powered by machine learning can learn from data without explicit directives from human operators. While this gives AI transformative potential—such as in the case of operating self-driving cars and creating art or poetry—it also makes them susceptible to errors.\nThe first type of error comes from the data used to train the AI. It is easier to explain this with a few examples. In 2018, Amazon, the world's largest e-commerce retailer, used an AI recruitment tool that helped check applications. The tool had been trained on checking the CVs submitted to the company in the last 10 years, most of which came from men. Consequently, the algorithm learnt to favour male candidates, and downgrade CVs that included the word \"women.\" After the issue was discovered, Amazon scrapped the tool. Similarly, in 2020, Twitter faced backlash when users discovered that its image-cropping algorithm favoured white faces over black ones. The algorithm was found to have been trained on datasets that did not adequately represent different skin tones, leading to biased decisions that favoured lighter-skinned individuals. Therefore, there is a critical need for diverse and representative datasets when training machine learning models to avoid biases and ensure fair and accurate performance.\nThe second source of errors is the algorithms themselves. For instance, in 2023, autonomous vehicle manufacturer Cruise had to recall its entire fleet of self-driving cars in the US after a vehicle struck a pedestrian, causing severe injuries. These cars were using a particular class of machine learning—deep learning, which is the technology behind today's most advanced AI systems, but it is not yet advanced enough to anticipate incidents like this. Regardless of the volume of training data, it is impossible to prepare these systems for every conceivable scenario. Thus, the potential for such errors always exists.\nFinally, the third source of errors made by artificial systems is that machines lack morality and ethical point of views. In many fields, AI is being used to make decisions with moral implications, often without human oversight. For example, AI systems can identify and track individuals, potentially leading to biased or unjust actions. In some countries, AI algorithms are already being used in the justice system to assess the likelihood of a defendant committing future crimes, influencing decisions on bail, sentencing, and parole. These algorithms analyse various factors, from a person's criminal history to their socioeconomic background, to predict the risk level they pose. Without human supervision, AI can often misread the nuances of criminal cases and generate wrong verdicts. Even with human oversight, AI's decisions can influence a human judge's decision-making process in a wrong way.\nAn examination of Bangladesh's AI policy shows that, even though it addresses several potential sources of errors, some parts of it require further fine-tuning and expansion. For example, while the policy emphasises the need to prevent prejudice, bias, and discrimination in AI (Section 6.1.4), it lacks specific guidelines on ensuring diversity in training datasets, which is crucial for such prevention. Even though the legal and regulatory framework is meant to be established separately in the National Strategy for AI, which is a companion to the National AI Policy, more explicit instructions on data diversity, algorithmic oversight, and ethical considerations would benefit it.\nThe issue of data diversity is probably the most crucial for Bangladesh. Currently, most AI systems are being trained using datasets from developed countries. This can have profound negative implications for developing countries like ours. For example, in the near future, when AI becomes more commonplace, state-of-the-art AI algorithms used in medical diagnostics may not work well for patients in our country because the training dataset did not include enough information about our weather, food habits, and genetic makeup, which are pertinent to our health. Therefore, while data privacy and security are crucial, developing a representative demographic dataset under government supervision is also essential.\nBangladesh must ensure its AI system is fair, secure, and beneficial for all. While the draft National AI Policy marks a first step in that direction, policy gaps in data diversity, algorithmic oversight, and ethical considerations must be addressed more comprehensively in future revisions.\nAmio Galib Chowdhury is graduate research student at the McCoy College of Business, Texas State University, US.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our submission guidelines.\n \n",
        "headline_1": "National AI Policy must address vulnerabilities of artificial intelligence",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/national-ai-policy-must-address-vulnerabilities-artificial-intelligence-3841756",
        "news_paper_name": "The Daily Star",
        "publish_date": "08-03-2025"
    },
    {
        "full_article": "The World Food Programme (WFP)'s decision to cut monthly food aid for Rohingya refugees in Bangladesh from $12.50 to just $6 per person will have devastating consequences. Relief workers have long argued that even the $12.50 allocation is insufficient. A previous round of cuts in 2023, reducing food rations to $8 per month, led to a sharp rise in hunger and malnutrition, according to the UN. Within months, 90 percent of the camp population was \"struggling to access an adequate diet,\" and 15 percent of children suffered from malnutrition—the highest recorded rate. As a result, the cut was later reversed.\nDespite this reversal, relief officials maintain that the current meagre allocation is still inadequate for maintaining a nutritious diet. The WFP itself acknowledges that reducing rations below $6 now would \"fall below the minimum survival level and fail to meet basic dietary needs.\" In other words, the new $6 allocation represents the absolute bare minimum required for survival. How can the international community expect the Rohingya people to subsist on \"the bare minimum\" indefinitely?\n\nWith more than 1.1 million Rohingya refugees in Bangladesh entirely dependent on humanitarian aid, this drastic cut will put immense strain on families already struggling to meet basic needs. It will likely escalate tensions within the camps, potentially leading to increased violence, crime, and drug trafficking. As desperation grows, more Rohingyas may attempt to break out of the camps, increasing the risk of confrontations with locals. Clearly, this situation poses serious challenges for Bangladesh.\nWith more than 1.1 million Rohingya refugees in Bangladesh entirely dependent on humanitarian aid, this drastic cut will put immense strain on families already struggling to meet basic needs. It will likely escalate tensions within the camps, potentially leading to increased violence, crime, and drug trafficking. As desperation grows, more Rohingyas may attempt to break out of the camps, increasing the risk of confrontations with locals. Clearly, this situation poses serious challenges for Bangladesh.\nIt remains unclear whether the WFP's decision was influenced by the Trump administration's termination of USAID funding worldwide, but such suspicions have been raised. When the decision was initially announced in January, emergency food aid was reportedly supposed to remain unaffected. It is therefore even more alarming that the UN has now opted to cut food rations for the Rohingya population.\nGiven the circumstances, the government must urgently develop a contingency plan. The reduction in rations will not only harm the Rohingya population but also risk fuelling unrest in the camps, which could spill over and impact local communities. These outcomes must be prevented at all costs. Therefore, the government should immediately engage the international community to secure funding commitments. The global community has a moral obligation to ensure that Rohingya refugees receive at least the minimum necessary to live a decent life and to support Bangladesh, which, despite its own challenges, has done everything possible to assist them.\n",
        "headline_1": "Rohingya refugees pushed to the brink of starvation",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/rohingya-refugees-pushed-the-brink-starvation-3841621",
        "news_paper_name": "The Daily Star",
        "publish_date": "08-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Devising a policy to resolve NPL issue",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/devising-a-policy-to-resolve-npl-issue-1741355201",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "How Bangladesh can meet  its revenue targets",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/how-bangladesh-can-meet-its-revenue-targets-1741355235",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Easing Dhaka's perennial traffic congestion",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/easing-dhakas-perennial-traffic-congestion-1741355293",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Women's role in society",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/womens-role-in-society-1741355419",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-03-2025"
    }
]