[
    {
        "full_article": "The first phase of Bihar’s Assembly elections on Thursday (November 6, 2025) witnessed a heartening democratic statistic — an impressive voter turnout across 121 constituencies. Provisional estimates have placed the figure at 64.69%, which may rise further as complete data emerge from all polling booths. These same constituencies have consistently recorded turnouts between 55.4% and 55.85% across the last four polls — Assembly and general elections. The nearly nine percentage point jump signals a reinvigorated engagement with the electoral process. The numbers reveal a more compelling story. Despite the Special Intensive Revision (SIR) process reducing registered electors from 3.88 crore in the 2024 general election to 3.73 crore now, the actual voter count surged from 2.15 crore to a provisional 2.42 crore. Predictably, the ruling coalition has rushed to attribute the surge to popular welfare schemes, framing it as pro-incumbency sentiment, while the Opposition has interpreted it as anti-incumbency fervour and a hunger for change. However, drawing definitive conclusions from turnout figures alone would be premature.Academic studies have shown that there has been little correlation between increased voter participation and anti- or pro-incumbency in Assembly elections. But disaggregated data could offer insights. A spike in women’s participation might validate the impact of cash transfer schemes implemented on the eve of the elections by the Nitish Kumar-led government. Conversely, increased youth voting could reflect a yearning for change in a State where unemployment and large-scale migration remain persistent concerns. But the Election Commission of India (ECI) has not yet released gender-based turnout data, leaving such analysis in the realm of speculation. What seems indisputable is that the heightened discourse around the SIR process played a role. The Opposition’s Voter Adhikar Yatra and sustained focus on voter roll issues appear to have sensitised citizens about the sanctity of their franchise. A day before polling, the Leader of the Opposition in the Lok Sabha, Rahul Gandhi, raised concerns about electoral roll discrepancies in Haryana, alleging inadequate action by the ECI. Bihar’s first-phase turnout offers an instructive lesson: concerns about electoral processes are most effectively addressed not merely through criticism but by mobilising organisational machinery to educate and energise voters about registration and participation. The Congress and other Opposition parties would do well to channel their apprehensions about electoral integrity into systematic grassroots work that empowers citizens to claim their democratic rights — a strategy that could possibly yield tangible results at the ballot box while strengthening democratic institutions. Published - November 08, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        General Elections 2024\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        unemployment\n                    \n                            /                      \n                        \n                        migration",
        "headline_1": "​Turnout bump: On the Bihar Assembly elections, first phase",
        "headline_2": "Voter awareness clearly surged following the SIR controversy",
        "link": "https://www.thehindu.com/opinion/editorial/turnout-bump-on-the-bihar-assembly-elections-first-phase/article70253281.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "08-11-2025"
    },
    {
        "full_article": "The U.S. federal government shutdown has entered its 39th day, making it the longest such closure in American history, with a sharp impact on nearly 1.4 million federal employees who have been furloughed without pay, not to mention countless more affected by the suspension of a range of public services. The latest blow to the American public came on the heels of an announcement that major U.S. airlines would be reducing flights at more than 40 airports this week owing to a shortfall in air traffic controllers, leading to a heightened threat to air safety. The shutdown has also crippled normal functions in food and nutrition benefits including food stamps for the poor, early learning programmes for low-income families, services related to the Internal Revenue Service, national parks and social services. At the heart of the debate that led to the congressional stalemate was the expiration of subsidies for health insurance premiums purchased via the Affordable Care Act marketplace. At this point there would appear to be a glimmer of hope for resolution of the partisan logjam as the Senate is expected to vote on an amended budget bill following Republicans presenting a fresh proposal, which includes a short-term stopgap funding measure. Also bundled is a potential one year of fiscal support for food assistance, veterans affairs and military construction.However, the deeper malaise of bitter polarisation in the political discourse persists, even if painful shutdowns come and go. Mr. Trump certainly bettered his first term election victory when he galloped into the White House in 2024. Despite the “red shift” that handed him a win in every swing State last year, liberals and progressives have certainly not thrown in the towel; rather, they have regrouped to make a strong showing in the recent mayoral, gubernatorial and other State-level elections. At stake are the most poignant of policy issues impacting ordinary Americans, including jobs, tariffs and inflation, but also pressing questions on immigration, health care and education. While it is only to be expected that American society, known for fiercely guarding the rights guaranteed in the Constitution’s First Amendment, will regularly and vociferously express divergent views on these critical subjects, the substantive core of good governance will be lost to many unless the spirit of bipartisanship flickers once again amidst the shambles of congressional dysfunction. In this context the debilitation wreaked by the ongoing shutdown only shows that there is a need for a new normal in U.S. politics, a humane, pragmatic middle path between unbridled Trumpism and the old world of progressive America. Published - November 08, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        government\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        air transport\n                    \n                            /                      \n                        \n                        food\n                    \n                            /                      \n                        \n                        nutrition and diet\n                    \n                            /                      \n                        \n                        personal income\n                    \n                            /                      \n                        \n                        family\n                    \n                            /                      \n                        \n                        health insurance\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        immigration\n                    \n                            /                      \n                        \n                        health\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        inflation and deflation\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        aviation safety",
        "headline_1": "Shutdown showdown: On the U.S. federal government shutdown",
        "headline_2": "Unbridled Trumpism has reduced any space for bipartisan cooperation",
        "link": "https://www.thehindu.com/opinion/editorial/shutdown-showdown-on-the-us-federal-government-shutdown/article70253341.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "08-11-2025"
    },
    {
        "full_article": "Politics turns sharply right or left when centrists ignore the social contract of tech-led entrepreneurship model\nThe NYC mayoral result shouldn’t be seen through the lens of a Trump vs Mamdani bout. Yes, a young, foreign-born, Muslim democratic socialist will now lead the capital of capitalism, defying opposition from Trump and other billionaires.\nBut is it because of who he is, or what he publicly stands for? Mamdani the man, or the idea of Mamdani in the context of a moment in history? Clearly the latter.\nJust as America, overall, veered sharply right last year to find solutions to its problems, NYC has now swung left. And both outcomes reflect the growing disenchantment with the centre.\nWhich is unfortunate because centrism – founded on the principles of individual rights, equal opportunity, liberal democracy and cultural pluralism – has shaped the world since WWII. And while it has flaws in practice, it has generally served well.\nTrade, migration, economic growth, cultural mingling, all advance when the mood isn’t polarised, when communities and countries aren’t constantly bad-mouthed and painted as the cause of our troubles. In theory, centrism is meant to carry people along to a better place. That’s its social contract.\nBut the US vote on Nov 5 last year, and NYC’s vote on Nov 4 this year, show the people consider this contract broken. That’s because they find themselves worse off than they were before. There’s the cost of living crisis – a quarter of New Yorkers can’t afford food and rent.\nThe city’s poverty rate was double the national average in 2023, and grew by 7 percentage points in the next two years. Meanwhile, the rich keep getting richer.\nThe number of billionaires goes on rising. When voters get the feeling the system isn’t working for them, they choose the ‘outsider’ promising free childcare, free buses and rent control – all very un-American things.\nBut the mood that’s gripped American voters is also palpable in other democracies. The space for polarisation and populism has been growing in Europe and India.\nEverywhere, the complaint is the same – people’s simple needs aren’t being met. The housing market, especially, is broken everywhere, including India.\nSo, xenophobia and promises of state action can be seductive.\nThat’s bad news for not only centrists but also the technology-led entrepreneurship model they have enabled, which has brought about record growth over the past few decades.\nCentrist leaders must introspect and course-correct before the pendulum swings too far to the right or the left.\n\n",
        "headline_1": "New York & beyond",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/new-york-beyond-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-11-2025"
    },
    {
        "full_article": "Barring Hindu pilgrims from Nankana Sahib is a new low for Pak. But India isn’t consistently sticking to its syncretism\nIn a despicable but not wholly unexpected move, Pakistani authorities separated and barred Hindu pilgrims from travelling to Nankana Sahib for the birth anniversary of Guru Nanak Dev, while allowing Sikh pilgrims through.\nThis was the first Sikh jatha (religious group) to travel to Nankana Sahib after Operation Sindoor. Hindu pilgrims were also part of the group. In barring the latter, Pakistan has further exposed its moral bankruptcy.\nIt’s a failed basket case of a state that can’t stomach the fact it will never be able to catch up with India.\nHence, it resorts to petty tactics. Plus, Pakistan’s deep state has been trying to sow divisions between India’s Sikhs and Hindus by working with known khalistanis abroad. It won’t succeed.\nThat said, there’s also a recent trend in India to replicate Pakistan’s pettiness. But this tit-for-tat approach not only ill behoves our secular, syncretic traditions but also gives joy to Islamabad. Pakistan’s very existence is premised on the idea that a secular India can’t survive.\nWe have proved them wrong for 78 years. When Op Sindoor was launched, dealing Pakistan a bloody nose, it was Colonel Sofiya Qureshi and Wing Commander Vyomika Singh – a Muslim and a Hindu – who together conducted the media briefings.\nIt is this secular India that is the biggest challenge for Pakistan.\nBut this secular strength needs to be nurtured and protected on a daily basis. Traditions like Delhi’s Phool Walon Ki Sair that bring Hindus and Muslims together are an integral part of our syncretic ethos.\nIt’s terrible that Phool Walon Ki Sair won’t be held this year for the first time in more than six decades – thanks to administrative permissions not coming through.\nSuch secular cultural heritage needs to be prioritised. Pakistan is a decrepit, Islamist, schizophrenic state. There’s no need for us to follow its example.\n\n",
        "headline_1": "Petty Pak",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/petty-pak-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-11-2025"
    },
    {
        "full_article": "Is its version of Unesco’s tag the ‘thin end of the veg’?\nLast week Lucknow was declared Unesco ‘Creative City of Gastronomy’. Culture ministry’s proud tomtomming of the honour on X etc: Great. Distinctly vegetarian-looking thal accompanying the boast: Grate.\nThis visual is now bone of contention, with critics pointing out that it should have said ‘Pehley aap ’ to the city’s storied meat-feast. So, what should we call this? Cultural misrepresentation? A ‘skewering’? Revival of the original Mrs G’s ‘derecognition of the princes in 1971’?\nIndeed, some nawabi descendants might find this culinary slight particularly galling in the week when we were celebrating Sardar Patel, who first threw them into the national khichdi .\nHow fair really is the fare featured in the sarkari visual? Did Unesco’s tag honour Lucknow’s ‘Pure Veg’ delectations? True, chaat @Chowk is a major reason why Awadh ki shaam , along with Banaras ki subah , is anointed the ultimate immersive experience.\nTrue, there’s much ‘gastronomic creativity’ in sizzling skewers of ‘ paneer seekh ’ complete with distinctive smoky aroma. But the Chowk also has enough meaty stuff for those unbarred from the Real McKabab; the famed tunde doesn’t yet have some tinda clone.\nTrue, even confirmed carnivores unabashedly join the shahi-tukda-tukda gang in its packed sweetshops, where all distinctions melt away like malai makkhan , the winter specialty . But hailing malai paan gilauri shouldn’t mean guillotining galouti or nullifying nalli-nihari .\nJi-huzoor , saffron is as essential to biryani. And this steam-cooked rice and meat delectation is Lucknow’s first claim to fame. Any dum donkey can tell you that.\nBias-ed? Me? Being bawa doesn’t mean I want only sali-boti with my roti . In fact, I was hooked on maharaj Shankar delectations during my two-year guest-ship at Delhi’s gracious Jain House.\nIt was unputdownable ‘Love in the Time of Karela’.\nIt’s not just us lesser minorities. In food, there aren’t any Hin-du’s and don’ts either, no?\nWhat we, who religiously love to eat, fear is that sarkar’s vegification of Lucknow’s Unesco honour covertly furthers its Eat Pray Love agenda.\nLike it’s saying ‘Promote the chikankari , not chicken curry.’\n\n",
        "headline_1": "Sarkari tarkari",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/sarkari-tarkari/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-11-2025"
    },
    {
        "full_article": "Donald Trump & Zohran Mamdani are good for each other’s aggressive identity politics. But if Trump can paint all Democrats as Mamdanistas, he’ll be the bigger winner nationally\nMamdani is mayor! Which means rejoice, citizens of New York city – cheap groceries, free bus fares, free child care, and laadli behena/ kanyashree for Carrie and Samantha.\nOkay, scratch that last part, but you get the drift, it’s Socialism and the City.\n\nAccording to some, this focus on the common man is exactly what the Democrats need.\nRead the full story on TOI+.\n\n",
        "headline_1": "America’s DONZO moment",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/americas-donzo-moment/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 08, 2025 00:00:00  \nThough recovery of money and other assets laundered out of the country by those in power during the tenure of the ousted autocracy and their crony oligarchs was declared a priority by the interim government, yet, it has proved to be a very complex and audacious task. Despite efforts by the different government bodies including the Bangladesh Bank (BB), which is heading the 11-member inter-agency task force to retrieve the stolen assets, little progress could be made to date. It is not only the complicated nature of the task that is coming in the way of early recovery of the laundered assets. In fact, the interim government's lack of experience in the job has also proved to be a big hurdle. As reported in the last Tuesday's issue of this paper, despite making mutual legal assistance (MLA) requests for particulars about tycoons who are staying overseas after fleeing Bangladesh, rather than coming up with any information, the authorities of those countries concerned asked for more details. \nAdmittedly, such problems have more to do with the Bangladeshi agencies' lack of familiarity with the format of MLA than with non-cooperation from the other side. Now, more than a year in pursuit of the stolen assets, the result so far is nothing to write home about. Understandably, the staff involved in the task would require training on the MLA format to be able to convey our requirements effectively to our overseas counterparts. Also, there are complexities involving international and local laws about repatriation of stolen assets. Even the National Board of Revenue (NBR)'s attempts at realizing evaded taxes against accounts frozen by court order has proved unsuccessful due to counter court cases filed against the move by opponent parties. Evidently, fighting a long and arduous legal battle to get the frozen assets back is out of the question by the interim government with hardly a month or two left in office. Also, the government is not willing to pursue the alternative path of resolving the cases out of the court. Moreover, the central bank's priority should be recovering the funds in the frozen accounts back. However, in this connection, the central bank reportedly instructed individual banks to engage law firms to retrieve laundered funds. The respective banks would be required to sign non-disclosure agreements with the law-firms to be so employed. Hopefully, such measures, though belated may produce some positive results. However, the success would ultimately depend largely on the measure's continuity during the tenure of the post-interim elected government. \n The present government, it appears, is actually learning by doing the complicated job of recovering the money laundered by the top-notches of the former autocratic regime and their crony oligarchs who have the money and the connections abroad. They can hire financial experts to advise them on how best to hide their money. The documentary on Bangladesh's stolen billions released by the Financial Times, a prestigious UK-based newspaper, early last September speaks volumes for this. It explained graphically the level of corruption involved that was 'beyond seen elsewhere' and the immense obstacles especially to reaching settlements, that is, about clinching a deal with whoever stole the money. \nHowever, there are some reports of progress in recovering the assets of one absconding minister of the former regime regarding which the UK authorities have appointed an administrator. However, the government is still a long way to go to achieve any tangible results any time soon. The interim government should at least lay the foundation for the next government to continue work on recovering the country's stolen assets.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Getting back nation's stolen assets",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/getting-back-nations-stolen-assets-1762524729",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       November 08, 2025 00:00:00  \nIt is hard to keep up with the dizzying pace at which the country is changing. Cityscapes are evolving every day. In almost every neighbourhood, new buildings have gone up in the last decade and, wherever space allows, more are still going up. These are the years of growth and modernisation that have transformed lifestyles and attitudes. Almost everyone is thinking, talking and initiating new ventures. People are bustling with activity, taking the changes in their stride. The country has become a vast market of around 170 million people where the young outnumber those of non-working age. If this is not the ideal environment for investment and new business, then what is!\nBut is it really so easy to conduct business here? Most established entrepreneurs would tell you it is not. They would argue that enterprises of all sizes are struggling to survive. Sales are sluggish, partly due to high inflation. There is also the persistent problem of relative unavailability of credit. Every business requires capital, but small businesses often face a perpetual capital crisis. Starting and running a venture demand investment which is not readily available. Those who do start one must often wait a long time before they see any return on their money, time and effort. \nA former businessman who had given up his trade to take a job after finding the struggle too exhausting can provide a realistic view of competitiveness in business. He had inherited a clothing business from his father in his home district. After his father's passing, he took over and discovered that several local retailers owed him substantial amounts of money. These retailers would take products on credit, sell part of them, pay back a fraction of what they owed, and then take more goods on credit again. Over time, the unpaid dues kept mounting. It even grew so large that he had to sell a piece of his own land to raise funds and restock, hoping to revive the business. But the same pattern continued. The final blow came when he learned that some traders instead of paying debt were using their profits to buy land themselves. Eventually, he abandoned any hope of recovery, closed the business and took up a job instead. \nThis kind of story is far too common. It is indeed a challenging task to achieve success in small business. One can see that many of those who were in business a generation ago have been replaced by new faces. Clearly, the next generation of businesspeople would often come from the same families were it not for the fact that these enterprises have become too difficult to run. Running a business often means dealing with scarce capital, but even when money is not the primary issue, it is still hard work and a lot of stress. Keeping a business strong is not easy either. It is a different kind of challenge. A successful business can become too comfortable and afraid to take risks, especially as it gets older. The example of Nokia comes to mind. When the company dominated the mobile phone market, it failed to adapt to the smartphone revolution and quickly lost its edge. All businesses must keep reinvesting profits to grow and avoid being left behind. With so many players in every field, for a new business, it is especially tough to carve out its own space. They have to be innovative and smarter and use every tool at their disposal in order to survive. \nOn the other side of the coin, there are those who see business creation as an almost effortless process and the most natural thing in the world. You have a product or service, you find few customers and off you go. Simple as that. Once it takes off, the task becomes balancing management, growth and daily operations. The many small businesses that supply and support the ready-made garment industry stand as proof. They have managed to operate and survive in a highly demanding sector, adapting effectively to meet the needs of larger exporters. Their success did not happen by chance. It grew out of the opportunities that exist in the business environment and from the determination of entrepreneurs who learnt to utilise complex factors such as labour market to produce efficiently. Our cheap labour is a double-edged sword, both an opportunity and a limitation at the same time. Hiring workers is not difficult for small businesses, but retaining skilled ones is. Because salaries and benefits are lower than in big companies, many workers do not want to stay with small businesses for long. \nFinancial management presents another layer of complexity. Many businesses incur losses simply from a failure to keep accurate track of income and expenses. A lack of knowledge regarding taxes and loan instalments often exacerbates the problems. New entrants are hardly aware of tax laws, and many do not pay their dues not out of intent but ignorance. However, when tax and VAT officials catch up with them, the penalties can be severe.\nPerhaps one of the riskiest activities a business owner can undertake in our context is active participation in politics. In our volatile political landscape, if owners tilt to one side and the other side comes to power, it will definitely affect their businesses. This is not to mention the more insidious pressures that many business people suffer, from demands for unofficial payments to outright extortion by local power brokers and party activists. This places immense burden on the businessmen and forces them into a corner. All in all, doing business in Bangladesh is a high reward endeavour wrapped in high risks. The rewards are immense, but only for those with the nerve and the foresight. \nshowaib434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Small businesses in a  time of strain",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/small-businesses-in-a-time-of-strain-1762524777",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       November 08, 2025 00:00:00  \nDigital addiction has become a serious problem in the country, especially for children and adolescents, as a large number of them are already trapped in depression and frustration, leading to self-destructive attitudes. The frequent appearance of new smartphone models, coupled with the rise in various applications, has made the situation complex and toxic. It becomes increasingly difficult to restrain the use of digital or electronic devices, although most users are aware that they are wasting valuable time, harming their eyes, and gradually losing their concentration. Nevertheless, they are not putting in any effort to reverse the course, making the addiction worse. \nPsychologists say that addiction to anything usually progresses through three levels: entry, moderate, and severe. Most individuals, however, fall into the moderate category from the entry level at a faster pace, and they often cannot realise it. In the case of digital addiction, a moderate level is also a matter of significant concern, as it rapidly alters brain plasticity. In other words, the brain's ability to adapt and reorganise deteriorates and thinking patterns also change. The outcome is a behavioural change towards a negative and destructive direction, characterised by a reduction in tolerance, sensitivity, and adaptability. Instead, digitally addicted people become intolerant, aggressive, careless and self-centred. As a result, their physical and mental health deteriorates also. \nOne of the negative consequences of digital addiction is virtual violence against women and children. It is a new phenomenon, and women of different ages are the main victims of this kind of harassment and violence. By misusing the various tools of the electronic devices and applications, a growing number of men are now harassing women. The harassment turned into a kind of violence traumatising the victims for long. A sad thing is that the abusers include even some family members of the women.\nLast month, the Bangladesh Bureau of Statistics (BBS) released the report of the Violence Against Women Survey 2024. For the first time, the survey showed that there is a growing threat of some critical forms of Technology-Facilitated Gender-Based Violence (TFGBV) in the country. The United Nations Population Fund (UNFP) defined the TFGBV as an act of violence perpetrated by one or more individuals that is committed, assisted, aggravated and amplified in part or fully by the use of information and communication technologies or digital media against a person based on gender.\nAccording to the BBS survey findings, some 8.30 per cent of women in Bangladesh experienced 'unwanted sexual communications, sexual blackmail or image-based abuse or technology-facilitated controlling behaviour in their lifetime.' The prevalence of digital violence against women is higher in urban areas, as 10.30 per cent of surveyed women reported that they were victims of TFGBV. In rural areas, the ratio is 8.30 per cent. Again, married women who did not stay with their husbands for various reasons are the major victims, followed by non-married women. Moreover, the use of digital devices increases exposure to TFGBV. Among women who use any electronic device, 10.30 per cent reported lifetime experience, compared to 3.4 per cent among non-users.\nThere is a long list of forms and acts considered as digital violence or tech-driven violence. Some of these are sextortion (blackmail by threatening to publish sexual information, photos or videos); image-based abuse (sharing intimate images without consent); doxxing (publishing private personal information); cyberbullying and online gender and sexual harassment. \nOverall, the survey findings suggest that TFGBV is a growing concern in Bangladesh, especially among younger, urban and digitally connected women. In most cases, victims do not seek remedies as they are hardly aware of the legal redress or think that the legal procedure is complex. So, addressing the tech-violence requires a comprehensive approach to curbing digital addiction along with mass awareness on the negative consequence of the unrestricted use of electronic devices.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Digital addiction induces tech-violence against women",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/digital-addiction-induces-tech-violence-against-women-1762524812",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 08, 2025 00:00:00  \n\nThe cosmetics industry is growing rapidly, offering hundreds of local and foreign brands. However, this expansion has also opened the door for counterfeit and harmful products, particularly in areas like Chawk Bazar, Islampur and Keraniganj. Research shows that while more than 500 types of cosmetics are available in the country, only 106 are certified by the Bangladesh Standards and Testing Institution (BSTI). The remaining products are circulating without proper quality control or safety testing.\nA study by the Environment and Social Development Organization (ESDO) revealed excessive levels of toxic chemicals such as lead, mercury, and parabens in many popular cosmetics. These substances are known to cause serious health problems, including hormonal disorders, infertility and even cancer. Experts warn that parabens, widely used as preservatives, are especially dangerous when present in high amounts.\nAccording to a report from Dhaka University, around 70 per cent of the cosmetics sold in Bangladesh are fake or adulterated. Many lack essential information such as manufacturer details, expiry dates or import approval. As former DG of the National Consumer Protection Directorate AHM Safikuzzaman mentioned, most imported cosmetics do not even go through legal channels.\nThis is a clear failure of monitoring and enforcement. The BSTI and the Directorate of National Consumer Rights Protection must take stronger measures to identify fake products, test chemical levels and hold dishonest traders accountable. The government should also raise consumer awareness so that people can make informed choices and avoid health risks.\nIt is time to treat this issue with the seriousness it deserves. Protecting consumers from counterfeit and toxic products is not only a regulatory duty but a moral responsibility.\nWafi Uddin Yean\nBBA Student\nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Fake cosmetics flood market",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/fake-cosmetics-flood-market-1762524843",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-11-2025"
    }
]