[
    {
        "full_article": "The basis of good governance and democracy is that it provides enough leeway and wherewithal to address issues related to national security. The smart way to address a problem that started as a legitimate demand for greater autonomy in governance is not by misusing laws that allow for preventive detention against peaceful dissenters but by finding a route to defuse it. That does not mean that those who indulged in violence and arson in Ladakh during the protests for Statehood and Sixth Schedule status should be spared the long arm of the law. Yet, the Centre’s detention of climate activist and social reformer Sonam Wangchuk under the National Security Act (NSA), in response to the protests, is wrong. Mr. Wangchuk has been a consistent and peaceful advocate for the legitimate democratic aspirations of Ladakh, which have found resonance across Leh and Kargil districts, as well as religious, ethnic and political identities. His recourse to non-violent dissent, with sustained agitations for a legislature to address Ladakh’s environmental and livelihood concerns, is in keeping with the historical ethos of Indian politics established during and after the freedom movement. Invoking a law that is intended to counter a threat to the security of the Indian state against a peaceful dissenter reveals a problematic intolerance for democratic expression.In recent judgments, the Supreme Court of India has repeatedly clarified that a clear distinction must be made between a “law and order” issue and a threat to “public order”. The NSA, which is meant to address “public order”, pertains to acts that disturb “the even tempo of the life of the community”. There is no evidence to suggest that Mr. Wangchuk’s activism reaches this benchmark. The Centre appears to have failed to apply its mind and reach a “requisite subjective satisfaction”, as demanded by the Court, to show that his actions posed any real threat to “public order”. The Centre’s response has clearly sought to conflate dissent with acts akin to sedition. Mr. Wangchuk’s case is not an isolated one, as in the past, similar Acts were used to stifle dissent and bypass due process, as was the case with the detention of Kashmiri politicians following the abrogation of the special status of erstwhile Jammu and Kashmir. Ladakh’s aspiration for self-governance is genuine and requires the Centre’s nuanced and empathetic response, more so as it is a sensitive border region. The Centre must revoke Mr. Wangchuk’s detention immediately and re-engage in a meaningful dialogue with the people of Ladakh. Not doing so will only precipitate another crisis.\r Published - October 08, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        national security\n                    \n                            /                      \n                        \n                        Ladakh\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        Jammu and Kashmir\n                    \n                            /                      \n                        \n                        politics",
        "headline_1": "Release Wangchuk: On Sonam Wangchuk and the National Security Act",
        "headline_2": "Detention of peaceful activists does not serve national interest",
        "link": "https://www.thehindu.com/opinion/editorial/release-wangchuk-on-sonam-wangchuk-and-the-national-security-act/article70134562.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "08-10-2025"
    },
    {
        "full_article": "John Clarke, Michel Devoret and John Martinis’s experiments in the 1980s proved that the strange laws of quantum mechanics could govern not just subatomic particles but entire circuits visible to the eye. Their discovery of macroscopic quantum tunnelling and energy quantisation in an electric circuit won them the 2025 Physics Nobel Prize. This marks a significant interval since quantum mechanics last directly featured in a Physics Nobel, noticeable given the field’s enduring vitality, and at a time when the world anticipates profound revolutions in computing and communications. Their experiments at the University of California, demonstrated quantum behaviour in a circuit comprising two superconductors separated by an ultrathin insulating barrier, also known as a Josephson junction. In classical physics, a current flowing through this system would be trapped in a zero-voltage state unless it had enough energy to cross the barrier. But at temperatures near absolute zero, they found that the current could escape by ‘tunnelling’ through the barrier, a uniquely quantum phenomenon. The system also behaved as if it were a single large particle, with discrete energy levels instead of a continuous range. To ensure these effects were not artefacts of noise in the circuits, the team took elaborate pains to isolate them from stray microwave radiation. Their results confirmed that a superconducting phase difference, a collective property of the trillions of pairs of electrons that sustained superconductivity, behaved as a single quantum variable.Josephson junctions are the foundation of superconducting qubits, which animate many of today’s leading quantum computers; superconducting circuits also underpin ultrasensitive magnetometers, quantum voltage standards and single-photon detectors used in astronomy and biomedical imaging. By confirming that quantum laws apply to objects “big enough to hold in your hand”, the laureates opened a new domain of applied quantum engineering. Today, the challenge is not to prove that macroscopic quantum behaviour exists but to preserve it long enough to be useful. Quantum states are exquisitely sensitive to their surroundings; research thus focuses on materials with lower loss, better filtering and cryogenic control and hybrid architectures that combine superconducting circuits with mechanical, photonic or spin-based systems. The 2025 prize also exemplifies the value of inquiry driven solely by curiosity about nature’s limits. When the laureates set out to test whether quantum mechanics could govern a macroscopic electrical circuit, no one foresaw its consequences. Their pursuit of a fundamental question produced the principles underpinning the pursuit of engineers today, including in India, of new technologies — and prestige for their host countries.\r Published - October 08, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        physics\n                    \n                            /                      \n                        \n                        award and prize\n                    \n                            /                      \n                        \n                        university\n                    \n                            /                      \n                        \n                        research\n                    \n                            /                      \n                        \n                        computing and information technology\n                    \n                            /                      \n                        \n                        astronomy\n                    \n                            /                      \n                        \n                        science (general)\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "​Radical tunnel: On the Physics Nobel 2025",
        "headline_2": "The Physics Nobel exemplifies value of inquiry not driven by immediate utility",
        "link": "https://www.thehindu.com/opinion/editorial/radical-tunnel-on-the-physics-nobel-2025/article70135800.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "08-10-2025"
    },
    {
        "full_article": "There are specialists on all subjects who tell us everything we want to know – except who they are\nTrump’s tantrums on tariffs, the Russia-Ukraine war, and the Israel-Palestine conflict. The predictable unpredictability of climate change. \nWhat do all of these mean in our day-to-day lives, and how do they affect the price of onions? Busy as we are with our jobs, our household chores, our studies, our hobbies, we don’t have the time or the knowhow to figure this out for ourselves. \nFortunately for us, we don’t have to. There are specialists called experts who do this for us. News reports and commentaries are full of quotes from experts on all manner of subjects which you would care to name, and also not a few you mightn’t. \nName, or not name, a subject and out will pop any number of experts on it, like so many Jacks-in-the-Boxes. Some subjects, such as Kashmir, have more experts than a porcupine has quills.  \nWhile some of these experts have names, the majority of them are referred to by the generic or vanilla term, ‘expert’. Sometimes experts are not called experts but ‘a reliable source who did not want to be named’. \nIn an age when flaunting one’s identity and getting one’s name into the public limelight are as compulsive an urge as the taking of selfies, such modesty on the part of experts, aka reliable sources who do not want to be named, can be deemed a laudable example of modest self-effacement. \nBut such anonymity has its downside. For instance, how are we to tell if an expert or a reliable source not wanting to be named, on say, climate change, is not also moonlighting as an expert or reliable source not wanting to be named on, say, the role played by Donald Trump’s signature hairstyle on the dynamics of geopolitical multilateralism? \nHowever, there are experts on experts whose expertise lies in establishing the bona fides of other experts. We know this for sure because we are told so by a reliable source who does not wish to be named…\n\n",
        "headline_1": "Experts anonymous",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/experts-anonymous/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-10-2025"
    },
    {
        "full_article": "Trump’s desperate for peace Nobel. He isn’t the first strange candidate who’s so keen on this prize\nTrump has wanted a peace Nobel for the longest time, but never as much as now. Just over a week ago he said if he doesn’t get it this time, on Oct 10 – he’s been nominated four times before – “It’d be a big insult to our country.” He never says that lightly – last time was in 2020, when he said if Biden’s running mate Kamala Harris ever became president, “That would be an insult to our country.”\nWhy Trump wants the peace Nobel is a mystery. Winners are in dubious company. Gandhi’s soul would be ever so grateful for being spared an honour that the likes of Henry Kissinger and Aung San Suu Kyi earned in later years. Kissinger, who prolonged the Vietnam war and had a hand in the bombing of Cambodia and Laos; Suu Kyi, who defended her military’s persecution of the Rohingya.\nMaybe Trump wants it only because Obama got it. In the words of a veteran Republican: “Obama has been living in Trump’s head rent-free for the last two decades.” But Obama got the Nobel as a nudge for shunning the militarism of his predecessor Bush – and ignored it. Can’t blame the Nobel committee if they won’t trust another US president.\nBut you have to give it to Trump for trying. He returned to office talking about stopping the Russian krieg. Success would have cemented his place at the head of this year’s 338 candidates, but Putin didn’t oblige. Regardless, Trump is claiming to have stopped seven wars already – Op Sindoor among them. While India’s factual denials have left him sore, Pakistan has rubbed salve with praise and a Nobel nomination.\nUnfortunately, Pakistan’s and Israel’s nominations came months after this year’s cutoff date of Jan 31, but they’ll keep Trump in the running in 2026. He might have deals in Gaza and Ukraine by then. If he doesn’t, he can learn from former Japanese PM Eisaku Sato, who used the services of a businessman friend to lobby the Nobel committee, and wangled a Nobel. Bear in mind that lobbying doesn’t always work. It didn’t for the unnamed leader whose campaign sent 750,000 letters to the committee in the 1990s. It didn’t for Clinton, despite his photo-ops in Vietnam and Ireland, and with Yasser Arafat. And it didn’t for the Iranian poet who sent 18 crates of pistachios for a lit Nobel – only to get disqualified. Trump should try being subtle therefore, and if he doesn’t win, he shouldn’t ban other Americans from accepting Nobels.\n\n",
        "headline_1": "Noblesse Oblige?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/noblesse-oblige/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-10-2025"
    },
    {
        "full_article": "Incentives can’t get strangers to help accident victims. Only trust in police will bring in change\nUP govt has announced its implementation of Union road ministry’s April measure – raising the ‘incentive’ for bystanders whose immediate help saves an accident victim’s life from ₹5k to ₹25k. It returns focus to a scheme based on faulty logic from scratch. India’s Good Samaritan rules were made in 2015 on a nudge from Supreme Court, which had sought protection of bystanders from police harassment, for helping accident victims. That’s got to be good, right? Of course. But doing good can go wrong. \nConsequences of getting ‘involved’ with police are unpredictable – bystanders risk becoming deer caught in cop headlights; it’s all too easy to get trapped in a morass. Long loaded questioning of a Good Samaritan, pressure to become a witness, irrelevant personal details sought, getting caught in a medico-legal case, are deterrent enough. However harsh it sounds, a perception is cast in stone that helping is avoidable because of police harassment. It’s one reason why bystanders and witnesses instead of helping, record horrific events – both to distance, yet ‘do something’. People will help only if there’s no fear of police – an ambitious project given not an inch has moved on police reforms.\nGiven this, to expect that compassion or sense of duty can be incentivised – introduced in 2021, to end by March 2026 – by jacking up ‘prize money’ without doing anything to infuse trust in law & order machinery is looking in the wrong direction. 2015 rules have SOPs for police engagement with bystanders. How is that going? How this scheme’s panned out speaks for itself – SOPs are largely ignored while incentives can’t buy trust. India’s appalling record on road safety and increasing fatalities remains unmoved – can promising to pay people more do anything except open a new avenue for potential fraud?\n\n",
        "headline_1": "Bystander’s Dilemma",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/bystanders-dilemma/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-10-2025"
    },
    {
        "full_article": "By Satish K Kapoor\nLove is an interplay between timelessness and time. It is fundamental to existence, a natural expression of the higher Self. It burns like fire, purifies like water and bears hardships like the earth. Lighter than air, it gives flight to images that reflect art, architecture, poetry and other creative forms. Love of the Divine entails recognition of the cosmic spirit in all, and respect of life in its myriad forms – from plants, birds and animals to humans.\nHuman love is a reflection of divine love. But while the former is an emotion in a limited sense, the latter is a state of divine awareness, and hence unlimited. Human love is self-seeking and gives short-term satisfaction; divine love is self-denying yet fulfilling. The former gives pleasure, the latter bliss. Human love is characterised by a personal, social, or cultural bond. Divine love is unbound and unconditional – it is love for love’s sake. Human love can fail or fade due to a loss of trust in others, ideological differences, boredom, the termination of life, or the exigency of circumstances, but divine love remains unaffected by such factors.\n\nIn terms of guna, quality, love is of three types: sattvic, rajasic, and tamasic . Sattviclove possesses great moral and spiritual beauty. It is tender and unalloyed. In a higher sense, it is the beneficent affection of God for humanity, or the reverent attitude of a devotee towards God. Shabari, an ascetic woman devotee, who figures in the Ramayan, tastes each jujube fruit before serving it to Ram. In Shrimad Bhagavatam, gopikas dance to notes of Krishna’s flute. Mirabai and Surdas (16th century) were deeply imbued with divine love, and they penned soulful prayers that are sung to this day.\nRajasic love is characterised by the element of the individual self. It is passionate with a purpose. Love of progeny, wealth, name and fame is rajasic . In its higher state, rajasic love assumes the form of respect, friendship, generosity, philanthropy or institutionalised social service.\nTamasic love is characterisedby selfishness, sensuality, fickleness, and often one-sidedness. It fails to hear the voice of reason and of conscience, as during adolescence. It cripples noble instincts, aspirations and ideals. A selfish person wants to possess, exploit, or subdue others. He indulges in crime or violence in the name of love.\nTrue love never fails, like the gravitational pull, and is limitless, like the vastness of space. It encompasses the full spectrum of human relations and sensibilities. In society, love prospers through the spirit of compassion, service and sacrifice.\nSufi mystic Rumi observed: “Love is a bridge between you and everything.” The idea of totality of existence has found adherents among scientists such as Fritjof Capra, David Bohm, and Erwin Schrödinger. Swami Vivekananda said, “The absolute is an ocean, while you and i, and suns and stars, and everything else are various waves…And what makes the waves different? Only the form, and that form is time, space and causation, all entirely dependent on that wave.” Love can create a conflict-free society if each one realises that the same soul pervades all.\nThe Sufi tradition distinguishes between ishq majazi, love of physical form, and ishq haqiqi, love of the formless Being. Falling in love is human; rising in love is divine.\n\n",
        "headline_1": "Falling in love is human. I love the divine",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/falling-in-love-is-human-i-love-the-divine/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-10-2025"
    },
    {
        "full_article": "It is true that battery-run rickshaws have provided a source of income to thousands from low-income groups; their operation also makes practical sense in an increasingly fast city. However, the unregulated way in which these vehicles operate comes at a heavy cost. Most drivers have no training in driving or traffic rules. Moreover, these rickety vehicles can, and often do, run at speeds of up to 30 km per hour, making them quite accident-prone.\nAccidents involving battery-run rickshaws have therefore been on the rise, often resulting in injuries and even fatalities. According to Bangladesh Jatri Kalyan Samity, battery-powered rickshaws were involved in about 15 percent of the 315 road accidents in Dhaka during the Eid rush between March 24 and April 7. This pattern of road risk has often raised concerns, with a report in this paper citing urban planners who warn that without regulation these rickshaws may cripple Dhaka's transport network. Underlying their concern is the fact that drivers frequently ignore traffic signals and cross intersections at high speed, exacerbating congestion.\nWith no central registry or licensing system for those involved in this system in the country, the exact number of battery-powered rickshaws is unknown. But it is estimated that around five lakh vehicles operate in Dhaka city alone, far outnumbering paddle rickshaws. It is, therefore, heartening that the government has drafted a policy to regulate battery-powered rickshaws nationwide. The policy will reportedly prohibit these electric three-wheelers on highways and introduce mandatory registration, fitness certificates, and driving licences.\n\nMoreover, if the government's pilot project using a Buet-designed model of the battery-run rickshaw turns out to be successful, it will make these vehicles structurally safer. The idea is to introduce the new models in selected areas of Dhaka, track illegal rickshaws there, and gradually replace traditional rickshaws with the safer new models in each zone. According to Dhaka North City Corporation, 20,000 drivers have already received training, with sessions continuing for others.\nThe government policy will also set vehicle fitness standards, provide for driver training, and impose penalties for violations of traffic rules. Drivers will be required to own the vehicle they operate, discouraging individuals from owning multiple rickshaws. Establishing discipline will understandably be very challenging given the staggering number of vehicles. But it is imperative that the policy is implemented without delay, accompanied by expanded training workshops for drivers, to ensure the safety of both operators and the public.\n",
        "headline_1": "Battery-run rickshaws must be regulated",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/battery-run-rickshaws-must-be-regulated-4003156",
        "news_paper_name": "The Daily Star",
        "publish_date": "08-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 08, 2025 00:00:00  \nWith the number of people in their old age (65 years and above) remaining at around 12 million in 2025, representing 7.0 per cent of the total population, Bangladesh is going through a fast demographic transition. Since people need different types of support and care in old age, their families, the government and society in general have to share those responsibilities. But unlike advanced societies, Bangladesh as a lower income economy lacks the required governmental, societal, even familial support systems to look after its senior citizens. Small wonder that in old age people here become an unavoidable burden on society. It is time, as an economy transitioning to a middle income one, Bangladesh also came out of its traditional outlook about old age and committed required social and state resources for the well-being of its senior citizens. \nIn this connection, it is a welcome development that the interim administration is giving the issue some serious consideration. Notably, at a recent social occasion marking the International Day for Older Persons, observed on October 1, the planning adviser, Dr Wahiduddin Mahmud informed that the government would include the issues of elderly people in its reform agenda. As implementation of all the rules and regulations will not require a large amount of money, the adviser assured that the interim government would prepare some policies as required for the well-being of the senior citizens within a short period of time. \n It is undoubtedly a well-meaning and well-timed move from the government for the nation's elder members and a step forward in recognising their needs. Also, in addition to the financial benefits they would get, arrangements should be in place so that senior citizens' issues get the priority they deserve at the public places like hospitals, banks and public transports. Their other needs depending on the social class they are part of would also require addressing. For members of richer segment of society in their old age need association, not money. Older people from poor background, on the other hand, are more in need of money than association to survive. So, all the special needs of old people have to be kept in mind by policymakers while preparing strategies for their well-being. The younger members of society would also need to increase their awareness about the special needs and sensitivities of the senior citizens.\nAt this point, it is important to note that recognition of the issues of the elderly people and framing policies as well as allocating state resources to meet their needs will not be enough. As long as the mindset of the government functionaries about the elderly people unable to contribute to society in the traditional sense of the term change, they would be looked upon as dependent and the state resources to be allotted for them as a favour and not a right. It is not solely the government people, society at large and even families to which senior citizens belong still consider any government or social benefit provided to their elder members purely as a handout. In that case, recognition of older people's requirements by the government and society and the provision of some financial and other kinds of benefits for them will be enough. The senior members of society should be given to think that what they would receive from the state and society is not just an act of kindness, but a right they have earned by way of contributing to their families and society during the productive years of their lives.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Recognising rights  of senior citizens",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/recognising-rights-of-senior-citizens-1759846930",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       October 08, 2025 00:00:00  \nFor decades, policymakers, labour rights activists and economists in Bangladesh have been drawing attention to the vast informal workforce involved with a large portion of the national economy. Despite its undeniable contribution, this sector remains excluded from official recognition, legal protection and social security coverage. As the country inches closer to its graduation from the Least Developed Country (LDC) category in 2026, the urgency to integrate this scattered and often invisible workforce into the formal system has become more pressing than ever.\nInformal employment refers to jobs that are not regulated, registered or protected under national labour laws. These positions typically lack standard employment guarantees such as paid leave, termination notice, pensions or health benefits. Instead, they rely on informal arrangements, personal relationships, or kinship ties rather than legally binding contracts. Workers in this sector have little or no access to unemployment insurance, workplace safety protections or social safety nets.\nThese jobs are most commonly found in small, unregistered businesses, micro-enterprises or households. A majority of these enterprises fall outside the tax net and government oversight. This means that their economic contribution remains largely invisible in policy design and implementation, despite being central to national productivity.\nThe recently published Labour Force Survey 2024 by the Bangladesh Bureau of Statistics (BBS) highlights just how extensive informal work is. Out of a total labour force of 69.10 million, as many as 58.04 million - or 84 per cent - are employed informally. Breaking it down further, the survey shows that 95.96 per cent of female workers and 78.08 per cent of male workers are under this category. Geographically, 13.22 million informal workers are in urban centres, while 44.82 million remain concentrated in rural areas.\nSectoral distribution tells an even clearer story. Agriculture, long considered the backbone of the economy, has an overwhelming 97 per cent of its workforce in informal employment. The industrial sector has 89 per cent informal employment, while the service sector, often assumed to be more structured, still employs 67 per cent of its workers outside the formal framework.\nThese figures are not anomalies. In 2023, informal workers numbered 59.68 million - accounting for 84.07 per cent of the workforce - while in 2022, the share was 84.9 per cent. Prevalence of such high ratios shows that informality is not declining despite economic growth, export expansion and urbanisation. Rather, it remains a defining feature of Bangladesh's labour market.\nThe informal economy is not marginal, it is central. Various studies estimate that the sector contributes between 40 and 43 per cent of Bangladesh's GDP. A joint study by Karmojibi Nari and FES Bangladesh, which covered workers across all divisions, found that most informal jobs were concentrated in retail and sales, agriculture and livestock, food and beverage services, transport; and crafts. Nearly 69 per cent of these workers are aged between 25 and 44, underscoring that the most productive segment of the population remains deprived of protection and rights.\nWithout these jobs, millions of people would be unemployed or underemployed, creating severe social and economic instability. Yet, their contribution remains unacknowledged in government accounts, policy planning and wage structures.\nLabour rights experts and worker leaders have therefore urged the government to formally recognise the informal workforce in the upcoming amendment of the Bangladesh Labour Act, 2006. Their demands include: a national wage board that considers the realities of informal employment, a digital national database to register all workers, linked with a unique worker identity card; and expansion of social protection schemes, including workplace accident and health insurance; and unemployment allowances.\nSuch measures, they argue, would not only uphold workers' rights but also allow the state to better manage and regulate labour relations in line with international commitments and the requirements of LDC graduation.\nLeaving the informal workforce outside the scope of national labour legislation undermines both economic planning and social justice. Workers without contracts are vulnerable to exploitation, unfair dismissal and hazardous working conditions. Women in particular, who make up an overwhelming majority in the informal workforce, suffer disproportionately due to the absence of maternity benefits, workplace safety measures and wage parity.\nAt present, Bangladesh's Minimum Wage Board covers only 42 sectors, leaving the overwhelming majority of workers outside its scope. Unless deliberate efforts are made to expand coverage and include informal workers, the divide between formal and informal employment will continue to widen.\nExperts stress that the proposed digital database should be dynamic, not static. It should be regularly updated and integrated with national identification systems so that government benefits - from healthcare support to accident insurance - can be directly delivered. Moreover, recognition of informal workers would allow the state to extend disaster-relief measures, microcredit facilities and skill development programmes more effectively.\nThe informal sector is not a temporary or peripheral aspect of the economy; it is its dominant reality. Yet, for too long, the millions who keep this sector alive have remained invisible in law, policy, and governance. Their lack of recognition not only denies them rights and protections but also diminishes their immense contribution to the nation's GDP and overall development. As Bangladesh prepares for the next stage of its economic journey, the inclusion of informal workers into the formal system is no longer optional, it is inevitable.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The urgency of recognising informal workforce",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-urgency-of-recognising-informal-workforce-1759846954",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 08, 2025 00:00:00  \n\nIn today's world, the rapid rise of digitisation has undeniably transformed the way we live, work and connect. From instant communication to virtual entertainment, technology has made life faster and more accessible than ever before. However, beneath the surface of this convenience lies a pressing concern: the erosion of human emotion. \nIn the past, human interactions were driven by effort and time. Writing letters, for instance, was not merely about delivering information; it was about crafting emotions on paper. People would wait for weeks, sometimes months, to receive a reply, and the joy of opening a letter was far greater than the instant notifications of a text message today. The anticipation itself was an emotional journey. Now, with emails, messaging apps, and video calls available at the click of a button, the depth of connection has weakened. The human heart no longer feels the weight of waiting, and emotions that once defined relationships are slowly vanishing.\nSimilarly, meeting loved ones once required travel, patience, and commitment. Families and friends would cross miles to spend quality time together. The journey itself held meaning-sacrifices of time, money and effort made the meeting more precious. Today, however, video calls have largely replaced those visits. While they provide convenience, they strip away the raw emotions tied to presence, touch, and shared experiences. A virtual smile on a screen cannot replicate the warmth of a hug, and a digital \"like\" cannot replace the joy of being physically celebrated by others.\nEven in celebrations, the emotional depth has shifted. Birthdays, weddings and festivals once gathered families and communities under one roof. People invested energy in being physically present, exchanging laughter, stories and heartfelt moments. In contrast, digitisation has normalised sending wishes through social media posts or pre-written messages.\nIt is important to recognise that digitisation is not inherently harmful; it has improved accessibility and connectivity beyond imagination. However, the emotional cost is undeniable. By prioritising speed and convenience, we risk losing patience, sincerity and the warmth that once defined human connections. Technology has made communication effortless but in the process, it has stripped away the very emotions that made human bonds unique and irreplaceable.\nIf the past was about effort, anticipation and depth, the present is about instant gratification. In this shift, we must ask ourselves: are we truly connecting, or are we merely communicating?\nAsiq Mohammad Mokbel Hossen\nDepartment of Accounting & Finance\nNorth South University\nAsiq@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "How digitisation is killing our emotion",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/how-digitisation-is-killing-our-emotion-1759846973",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 08, 2025 00:00:00  \n\nSafe water is a basic necessity for a large city like Dhaka. However, due to corruption and mismanagement in government and local water supply projects, it often fails to reach the people effectively. Funds allocated for new tubewells or pipelines are frequently misused, and many areas experience irregular water supply because pipelines are only partially installed.\nCorruption is especially evident in drainage and water purification projects. The use of substandard materials reduces the effectiveness of infrastructure, while recurring waterlogging and flooding during the monsoon threaten public safety and damage city resources. Water supplied is often inadequately purified due to low-quality materials, leading to outbreaks of diseases such as typhoid, diarrhea, and hepatitis.\nWith insufficient access to safe water, citizens are forced to rely on alternative sources, including illegal connections, unclean hand pumps, or pond water, which further endangers public health.\nTo prevent Dhaka's water crisis from becoming lingering and severe, it is imperative to ensure transparency, proper management and active citizen participation in water supply projects. Depending on accountable governance and community involvement can safe water be made accessible to all.\nAshikujaman Syed\nsyedashikujaman@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Dhaka's crisis of safe water",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/dhakas-crisis-of-safe-water-1759846994",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-10-2025"
    }
]