[
    {
        "full_article": "Although the India-Russia relationship goes back decades, the strategic partnership and practice of annual summits marked 25 years this year, with President Vladimir Putin’s visit to Delhi last week. It was his first visit to India since Russia’s 2022 invasion of Ukraine, which ranged the entire West against Moscow, and particularly Mr. Putin himself, who has an international criminal court (ICC) warrant in his name. He has made it clear in recent days that he does not intend to accept the U.S.’s peace proposal without changes, and has stepped up attacks into Ukraine, which has further heightened tensions with Europe. To have invited Mr. Putin at such a time indicates that the Modi government is sending a message to Moscow and western capitals. Prime Minister Narendra Modi’s decision to receive Mr. Putin in person, and for the government to accord him a state visit, both actions for the first time in its tenure, send the message that Mr. Putin remains a friend despite western attempts to isolate him. The second is that while Mr. Modi consistently speaks of peace efforts, he will not be goaded into criticising Russia for the war. The third is that as geopolitical factors including stringent sanctions on Russian and Indian oil companies and the U.S.’s tariff surcharge of 25% are pressuring India into giving up these imports, India still seeks other ways of engaging Russia economically. To that end, in describing the takeaways from the Modi-Putin meet, officials have highlighted the labour mobility agreement, an MoU to jointly set up a urea plant in Russia, and the adoption of the economic road map launched during Mr. Modi’s 2024 Moscow visit. The road map includes encouraging more trade, developing connectivity using maritime corridors, and mechanisms to enable a national currency payment system to circumvent sanctions.However, the two sides did not announce any agreements in strategic areas that the West would be sensitive to — for defence hardware, nuclear power projects and space cooperation. Despite Mr. Putin’s offer of “uninterrupted” oil supplies, India also announced no plans to step up oil imports. This will make the goal of $100 billion in bilateral trade by 2030 more difficult. The omission of strategic issues from the agenda is a sign that the government remains aware of western concerns, taking care not to upset current negotiations with the U.S. and the European Union on trade agreements and high-level visits, even as Mr. Modi referred to ties with Russia as the “Dhruv Tara (lode star”). While balancing ties with two sets of partners inimical to each other, however, New Delhi must be mindful that asserting strategic autonomy will require taking consistent steps with both, rather than pendulum movements from one to another. Published - December 08, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        international court or tribunal\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        peace negotiations\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        waterway and maritime transport\n                    \n                            /                      \n                        \n                        European Union",
        "headline_1": "​Balancing, not swinging: on India-Russia ties, Indian diplomacy",
        "headline_2": "India needs to assert strategic autonomy by engaging both Russia and West",
        "link": "https://www.thehindu.com/opinion/editorial/balancing-not-swinging-on-india-russia-ties-indian-diplomacy/article70368877.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "08-12-2025"
    },
    {
        "full_article": "‘Controlled flight into aviation chaos’ is an apt phrase to describe what Indigo, India’s largest private airline, caused since last week during peak travel season, the golden month of December. The widespread disruption, which continues in the domestic sector, saw a spectrum of passenger distress — social, holiday and business plans disrupted, medical patients in anguish, senior citizens in agony and even defence personnel posted at the Siachen Glacier left stranded midway while rushing home, in south India, for a 10-day break. There are many more untold stories at airports across India. Interestingly, the airline’s international flights were estimated to be less than 10% of the cancellations, as they ensure a higher revenue flow but also tough passenger compensation rules. The carrier’s official explanation was ‘unforeseen operational challenges’, from technology glitches, schedule changes, weather conditions, and the implementation of updated crew rostering rules (Flight Duty Time Limitations, or FDTL). At the heart of the issue was the airline’s baffling misreading of the last reason cited — of the two-phase plan by the Directorate General of Civil Aviation (DGCA) to regulate flight crew duty hours, in alignment with global safe practices. These include an increase in the mandatory weekly rest period for pilots from 36 hours to 48 hours, a weekly cap on landings between midnight and early morning from six to two, restricted pilot flying hours on flights extending into night hours, and personal leave not being counted in the 48-hour weekly rest period. The regulations, initially proposed in early 2024, had a final implementation date set from November 1, 2025.With the issue finding resonance in Parliament, there were appeals made to the airline’s management to restore services. DGCA data shows the airline having disproportionately increased its domestic flights from 14,158 in summer to 15,014 in the winter schedule against an availability of 4,551 Airbus flight deck crew. Even though responses have been sought from and directives issued to the airline, in addition to fare caps introduced for other airlines, the meltdown has only raised a core point — why the aviation market, largely a private airline-run duopoly, was allowed to slide into disorder as seen in the Ministry’s responses much after the upheaval. With temporary waivers in the FDTL having been granted to the airline as a one-time measure to help it restore its schedules, pilot bodies are right in flagging what they term as a dilution of safety measures and crew welfare. The lessons are clear: the Indian air passenger deserves better compensation and rights. And the regulator must ensure stringent monitoring, without fear or favour, of every airline, big or small. Published - December 08, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        aviation safety\n                    \n                            /                      \n                        \n                        Airlines\n                    \n                            /                      \n                        \n                        Indigo\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        air transport",
        "headline_1": "Chaos foretold: on the Indigo crisis, air safety",
        "headline_2": "Indigo seems to have wilfully misread the plan for changes to crew duty hours",
        "link": "https://www.thehindu.com/opinion/editorial/chaos-foretold-on-the-indigo-crisis-air-safety/article70368864.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "08-12-2025"
    },
    {
        "full_article": "​​When I was five, I entered a fancy dress competition at school. I was a talkative kid, but not a particularly imaginative one. So, I dressed up as a bride. I want to blame popular culture, and ‘Hum Aapke Hain Koun’ would have been a convenient scapegoat, but that film was still years away from release. So really, the choice was mine. But why would a child want to dress up as a bride? Because the culture I was growing up in didn’t just allow it, it quietly encouraged it. But if you think this conditioning has faded, think again.\nJust a few days ago, the internet’s favourite grumpy aunt, Jaya Bachchan, reminded us how deep these expectations still run. In a conversation with Barkha Dutt, she called marriage an outdated institution and casually suggested that her granddaughter Navya shouldn’t marry at all. “Just enjoy life,” she said. One simple line, and the internet combusted. Women in the comments section largely agreed with her. Men, however, were peeved. They dredged up Rekha, pitied Amitabh Bachchan, and did everything but engage with what Jaya was actually saying.\n\nJAYA HO: She voiced the truth we tiptoe around: that, for many women, marriage is not liberation. It’s a box\nSocietal Burden\nIn Jan this year, hospitality chain OYO changed its check-in policy in some cities. “In some hotels, due to local conditions, unmarried/unrelated couples may not be allowed to check in,” stated their website. OYO’s initial openness to unmarried couples wasn’t born out of a desire to be progressive; it simply spotted a growth industry. The policy change is basically an attempt to appear more ‘societally acceptable’. And that is the heart of the problem. Societal acceptability imprisons women more than anyone else. This is the trap Bachchan was pointing to.\nLast Dec, the entire extended family had gathered at a cousin’s wedding, which made the experience equal parts fun and frown-inducing. Because the bride was much younger than me, the dreaded question resurfaced: So, when are you getting married? Every angle was deployed: emotional guilt-tripping about my poor parents and their dreams, and practical queries like, “Aren’t you afraid of loneliness?” I dodged all of it politely. But the whole episode reminded me why the idea of marriage doesn’t sit well. For me, it has always been an inherently misogynistic institution. The expectation that women must give up their surnames, homes, and families has been debated endlessly. But the larger problem is the towering structure built around marriage. Single woman regularly encounter absurd obstacles. Why, for instance, is my marital status relevant when I try to rent an apartment? Recently, I was denied a Schengen visa because I lacked “strong ties to my home country.” Apparently, my family, friends, and career are meaningless unless I am married with kids. This systemic bias devalues single women’s lives and contributions. Meanwhile, married couples in India enjoy several socio-economic benefits. Even though joint tax filing doesn’t exist here, a married person can claim deductions for a spouse’s medical expenses; an unmarried partner cannot. Home-loan benefits apply only to borrowers or co-borrowers, which again works neatly within marriage but rarely outside it. This disparity is a quiet form of prejudice.\nThe trad wife resurgence\nIn the age of social media, the ‘trad wife’ has made a glossy comeback. A trad wife is a woman who proudly embraces the old-school role of homemaker, radiating curated domestic bliss. This lifestyle comes with a loving husband, a manicured home, and perfect aesthetics. They’ll film themselves making cereal from scratch, but never scrubbing toilets or washing the mountain of dishes they used. Why? Because the trad wife phenomenon is tied to a very specific performance of femininity. They belong to what Thorstein Veblen called the ‘leisure class’: those exempt from productive work who signal status through conspicuous consumption and curated leisure. It springs from a strain of ‘choice feminism’ that claims it’s empowering to choose homemaking, without acknowledging the labour required to sustain that choice. The possible implications of such videos might be the adherence to gender roles gets solidified. And that has the potential to reverse the progressive wheel. We already know that many women in India stop working after marriage because of childcare, caring for elders, or simply the overwhelming load of running a household and a job. Men, socialised for generations as breadwinners, limit themselves to providing financially. The roles may be shifting, but not nearly enough.\nM for marriage, M for misogyny\nHistorically, marriage was about alliances, land, and property. Women were bargaining chips. Royal daughters were traded to secure political deals; conquered women were taken as war spoils, a way for victors to assert dominance. Some, as glamorised in ‘Padmaavat’, chose death by sati over surrender, an agonising choice between sexual violence and self-immolation. Women still die because of marriage. In 2023 alone, India recorded over 6,100 dowry-related deaths. Marriage has never prioritised women’s well-being. Yet women are told it is essential for fulfilment.\nResearch consistently shows that men gain significant benefits from marriage: longer life spans, better health, and increased economic stability. Married women, however, tend to have shorter life expectancies. Their happiness depends entirely on the quality of the marriage; the mere fact of marriage brings no inherent joy. My problem isn’t that men benefit. It is that women don’t. And this brings me back to Jaya Bachchan. Because deep down, we know that with her one line, “just enjoy life,” she named the thing we’re all trying to avoid saying aloud: For many women, marriage is not liberation. It’s containment.\nSo, maybe the most radical thing we can do is admit it. And stop asking women about their wedding plans.\nBlurb: Men gain significant benefits from marriage: longer life spans, better health, more economic stability. The happiness of women, however, depends on the quality of the marriage; the mere fact of marriage brings no inherent joy.\n\n",
        "headline_1": "Why Jaya Bachchan’s truth bomb on marriage has hit a nerve",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/why-jaya-bachchans-truth-bomb-on-marriage-has-hit-a-nerve/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-12-2025"
    },
    {
        "full_article": "This week, something strange happened in India’s aviation world. The government had made new rules to ensure that pilots got enough rest so they could fly safely.\nThese rules are called FDTL – Flight Duty Time Limitations. They were supposed to start long ago, but India’s biggest airline, IndiGo, still wasn’t ready.\nWhen the rules finally had to be followed, IndiGo said it couldn’t handle them. So it started cancelling hundreds of flights every day. This left thousands of passengers stuck at airports for hours, with no idea when they would fly. Some ticket prices even shot up to Rs 1 lakh for a normal economy seat!\nIt almost felt like IndiGo was saying to the government:\n“If you force these rules, we’ll cancel flights and create chaos.”\nWhy could IndiGo do this? Because it is too big. It controls more than 60% of all flights in India. That means if IndiGo stops flying normally, the whole country feels it. In many other countries, no single airline is this powerful.\nThe government finally gave up and said the new pilot-rest rules would not be applied for now. They said this was “for passengers’ good”, but honestly, they didn’t have much choice. The airports were already a mess.\nPilots are upset too. They say airlines should have hired more pilots to prepare for the rules, but didn’t. In fact, no new beginner pilots were hired this year.\nSo flights may become normal again soon. But the bigger problem remains: If a few airlines become too powerful, they can break rules and get away with it.\nTo fix this, India needs more airlines and more competition—so no single company can hold passengers, or the government, “hostage” again.\n\n",
        "headline_1": "Passengers treated like hostages",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/passengers-treated-like-hostages/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-12-2025"
    },
    {
        "full_article": "India’s Prime Minister Modi and Russia’s President Putin had an important meeting. It came at a time when the world’s politics are changing fast.\nFirst, the meeting showed that both countries want to make their own decisions, without being controlled by bigger powers.\n\nRussia wants to show it isn’t isolated or totally dependent on China after the Russia-Ukraine war.\n\nIndia wants more freedom while dealing with the US on tough trade talks.\n\n\nSecond, they talked about the Ukraine war. Modi said India supports any effort to bring peace. This matters because the longer the war continues, the more Russia depends on China — something both India and Western countries worry about.\nThird, India and Russia want to strengthen their partnership in more areas.\nThey discussed:\n\nA new agreement to make it easier for people to travel and work between both countries\nA plan to expand economic cooperation beyond just defence and energy, where they already work closely\n\n\nIndia also reminded Russia that some military equipment deliveries have been very delayed, and asked them to speed things up. On buying energy, India said it will always choose the best price and the best deal for itself.\nOverall, as global friendships and rivalries shift — with a stronger China and an unpredictable America — India and Russia want to find the best place for themselves in the world. Meeting an old, trusted partner helps both feel more secure.\n\n",
        "headline_1": "PutiNamo",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/putinamo/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-12-2025"
    },
    {
        "full_article": "Electoral politics is a zero-sum game, and not such a sweet deal after all \nWhen people talk politics to me and ask whether I’m pro-govt or anti-govt, pro- opposition or anti-opposition, I ask them how much they like jalebis. \nWinston Churchill – arch-imperialist, engineer of the Great Bengal Famine that claimed millions of lives, and loathsome specimen of the inhuman race – got it right for once when he said that democracy is the worst form of govt except for all the others that have been tried from time to time. \nDemocracy is not perfect, and its biggest imperfection is democracy itself. Democracy is founded on the elective principle of choice between govt and opposition. This necessitates democracy to be a binary system. A zero-sum game in which one side’s win can result only from another side’s loss. \nComputers operate on a binary system. A computer’s response to an input can be either 0 or 1. It cannot be both at the same time. \nParliamentary democracy makes us choose between govt and opposition or anti-govt, between zero and one. We can’t choose both together. \nBut unlike computers, we are not programmed to be binary entities. We might sometimes want zero and sometimes one, and sometimes both zero and one at the same time. \nThat’s where jalebis come into it. In his The Story of Civilisation, CEM Joad,  addressing his youthful readership, asked if one would be happy to eat only treacle toffee, assuming that it was one’s favourite food, all the time. And of course the answer is no. \nJoad said civilisation is based on the Aristotelian Golden Mean, the Buddha’s Middle Path, which lies between all treacle toffee and no treacle toffee at all, between all zeros and all ones, between opulence and destitution, between all govt and no govt, all opposition or no opposition.\nI like jalebis, but not all the time. I like daal-roti as well, or a slice of pizza. Similarly, there are times when I agree with govt and times when I agree with opposition. Does that make me a split personality, or just a split voter? \nSo when I’m asked about my politics, I say I like jalebis, but not all that much…\n\n",
        "headline_1": "Jalebis and democracy",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/jalebis-and-democracy/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-12-2025"
    },
    {
        "full_article": "Israel's problem is that despite its military power and its economic and technological superiority in the Middle East, it has limited capacity to portray its destructiveness as successful victories.\nThis limitation lies not only in Israel's small size and population, but more in the fact that it owes a large extent of its political, military and economic strength to the United States. Without unlimited US support, it could neither have executed what it has done so far, nor continued a genocidal war for more than two years without bearing heavy economic losses and civilian casualties. Even with US backing, Israel cannot evade international pressure and condemnation.\nOverall, this war has revealed the depth of Israel's dependence on the United States—so much so that fears are rising within Israel about the possible erosion of its independence and the transfer of decisions relating to war and peace to the White House. The UN General Assembly resolution calling for an end to Israel's 1967 occupation, and its withdrawal from Gaza and the West Bank, further demonstrates Israel's isolation from the rest of the world and its reliance on the US.\nFurthermore, the rise of other Arab and regional powers, such as Saudi Arabia and Turkey, in parallel with the atrophy of Israel's position in US strategy in the Middle East—as evidenced by Washington's increased reliance on them on issues concerning Gaza and Syria—signals a weakening of Israel's independent standing. This is also reflected in the indifference towards the narrative of \"normalisation,\" especially after the decline of Iran's influence in the region.\nThe trajectory of the genocidal war creates a pathway to a future in which Israel can be seen and treated like any other state, without exceptional global indemnity for acts such as genocide.\nIsrael has exposed its reality as a colonial, settler, racist and theocratic state—one that practices genocide against other people. It has lost precisely where it once sought recognition for itself.\nIsrael has forfeited its claim to monopolise the status of the \"victim\" after pursuing a brutal policy of genocide, and it has forfeited its image as a democratic state by enacting openly discriminatory policies towards Palestinians. It has lost the sympathy it sought to cultivate in the West. It can no longer be viewed as a \"single weak state targeted by ferocious neighbours\" that, in \"self-defence,\" can justify threatening or killing them. It can no longer play the victim card.\nAs a result, Israel is losing its legitimacy on the international stage, echoing the mechanisms and dynamics that led to the collapse of the apartheid regime in South Africa.\nIsrael has also become a political, security, military, financial and moral burden on Jewish communities in the West, while losing its status as a safe haven for Jews. It has become the only place in the world that poses a danger to Jewish lives because of the policies of Israel's rulers.\nGlobally—from governments to societies—Israel is increasingly viewed as a state acting against international values, standards and resolutions, and as a security, political and financial burden. It has become a destabilising force and a threat to the values of freedom and equality by manipulating and conflating anti-Israel sentiment with anti-Semitism. That strategy, too, has stopped working. Today, it is clear to the world that Israel's attempt to dodge criticism by invoking religion or the history of the Holocaust has long been a tactic to evade accountability for the inhuman killing of another population over generations.\nThe war has exposed Israel's weakness and the impossibility of eliminating the Palestinian people or removing their cause from international and Arab agendas. Israel's attempt to annihilate Palestinians without restraint has led to the current international backlash against it.\nYousef SY Ramadan is the ambassador of Palestine to Bangladesh.\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Israel stands exposed even if global powers fail to act",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/israel-stands-exposed-even-if-global-powers-fail-act-4052281",
        "news_paper_name": "The Daily Star",
        "publish_date": "08-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 08, 2025 00:00:00  \nThe digital era, characterised by unprecedented connectivity, has reshaped communication, commerce, education and daily life. As more and more services go online, internet access is no longer a matter of convenience but a basic necessity. In fact, its importance is so widely recognised that the United Nations and several countries now recognise the right to access the internet as a fundamental human right. In Bangladesh too, digitalisation has been a central theme of national branding for well over one and a half decades. Clearly, there is an unreserved national consensus across all political hues on digital transformation. No dissenting voice is heard so far as the concept of digitalisation goes. So, the general expectation is for the optimum utilisation of technology and a steady rise in internet penetration. However, a recent report in The Financial Express, citing data from the Bangladesh Telecommunication Regulatory Commission (BTRC), presents an intriguing anomaly.\nOver the past four months, the country witnessed the number of total internet users fall sharply to 131.49 million in October 2025, down from 135.99 million recorded in July. This represents a striking drop of over 4.5 million users in a remarkably short period. A closer look reveals that mobile internet users account for virtually the entire contraction, dropping from 121.53 million in July to 116.87 million in October, while fixed broadband subscriptions remained steady. This sharp decline in mobile internet subscriptions points to a weakening demand for mobile data services, even though telecom operators continue to expand networks and offer an array of data packages.\nIndustry analysts attribute the slowdown to a combination of factors including persistent economic pressures reducing consumers' ability to purchase smartphones or maintain regular data usage; rising costs of mobile internet prompted by adjustments in tariff structures; and the rollout of stricter SIM verification rules that have curtailed irregular or duplicate SIM ownership. The reduction in multi-SIM usage - once common among users seeking network-specific benefits - has also contributed to the contraction. In addition, some observers note a gradual behavioural shift, with households increasingly opting for shared broadband connections.\nThe interim government has undertaken several measures, including reduction of bandwidth prices at two stages of the supply chain, to make internet services more affordable. Following these reforms, the Chief Adviser's Special Assistant for ICT Division argued a few months ago that there was no logical reason or any excuse left for private mobile operators not to lower their internet charges. However, mobile operators are yet to reduce the prices of their data packages and are therefore not passing on the benefits of this crucial government policy to consumers. Instead, they appear to be using the reduced bandwidth costs merely to widen their profit margins. Thus, the high cost of mobile data at a time of severe economic constraints could well be a major reason behind the decline in mobile internet subscriptions. It is also worth noting that roughly 46 per cent of Bangladesh's population still relies on feature or button phones, leaving a large segment deprived of the benefits of various government digital initiatives due to their lack of internet connectivity. Had mobile data been more affordable, many of the feature phone users might have been able to access online services and integrate comprehensively into the country's digital transformation.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Intriguing case of decline in internet subscription",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/intriguing-case-of-decline-in-internet-subscription-1765121320",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       December 08, 2025 00:00:00  \nBangladesh's export sector has of late been facing headwinds mainly from the dual impact of the fall in demand in the international market and the reciprocal tariff imposed by the USA. According to the Export Promotion Bureau (EPB), last November Bangladesh exported merchandise worth US$3.89 billion. This is less than what the country exported in the same month last year by 5.54 per cent, the earning from exports was worth US$4.11 billion. Garments as usual is obviously the most exposed to any negative development in the world market. So, by earning about US$3.14 billion in November, the largest share of last month's fall in merchandise export was also borne by this sector (at 4.8 per cent) since in the same month last year, the apparel sector fetched US$3.30 billion. \nHowever, a single month's poor performance may not be enough argument to say that the country's export is performing badly. But a similar trend of fall in exports compared to the previous year has been demonstrated during the past three months, too. Even making allowances for the disruptions in business activities caused in the wake of the July uprising of 2024, the development is still concerning. If Bangladesh's graduation takes place as scheduled in November next year (2026), the export sector is going to come up against the challenges of a highly competitive market as it would then be bereft of the preferential treatments it so far received from the major export destinations like the European markets. So, as the proverbial early bird catches the worm, so the preparations should be afoot to meet the upcoming post-graduation challenges for export. But to engage in future challenges, the issues that are urgent need to be addressed first. For the export figures presented in the foregoing do not merely reflect statistical fluctuations but a fundamental weakness in our export strategy. As is often discussed, the root cause of this weakness lies in the lack of export diversification. And the problem is that the ready-made garments (RMG) dominate the export basket taking an overwhelming share of 84.7 per cent of total exports. So, Bangladesh fell behind as it did not invest early enough in what the global market was clearly signalling-- man made fibre (MMF) and technical textiles over cotton basics, backward linkages in synthetics, quick turn design and product development and parallel bets on non textile value chains such as electronics and medical devices that peers cultivated a decade ago.\nThe result is a revenue ceiling, when fashion downgrades to value lines during global slowdowns. A country concentrated in basics absorbs the price hit, while diversified competitors cross subsidize with higher margin categories that buyers cannot easily bargain down. Leather and footwear should be first in line with modern effluent treatment across the Savar tannery estate, traceability systems and design support. Bangladesh can develop branded original equipment manufacturer (OEM) footwear and leather goods where per pair realizations exceed basic apparel. Incentives should reward environmental compliance, LWG certification and higher local value addition in accessories.\nAgro processing is another natural winner. The country already exports processed foods to scores of markets, but Sanitary and Phytosanitary Standards (SPS) compliance, cold chain logistics and packaging finance are chronic bottlenecks. A ring fenced incentive for Hazard Analysis Critical Control Points /Brand Reputation Compliance Global Standards, formerly British Retail Consortium (HACCP/BRC) certification, zero interest loans for cold storage, and faster testing at accredited labs would unlock scale.\nPharmaceuticals have a strong domestic base and growing exports. What holds back the next step is regulatory recognition and approvals. \nWhile neighboring countries invested in developing technological capabilities and high-value manufacturing, Bangladesh remained complacent with its garment-centric model. The absence of forward-looking industrial policies has left the country unprepared for shifting global demand patterns and vulnerable to sector-specific downturns. The government's export incentive structure further compounds this problem by reinforcing existing imbalances. Of the Tk 7,500 crore allocated for export incentives in FY2023-24, approximately 65 per cent went to the already-dominant garment sector. Meanwhile, emerging sectors with significant growth potential received disproportionately small allocations despite their need for support to achieve competitive scale.\nThis misallocation represents a missed opportunity to nurture promising sectors that could diversify our export base. The pharmaceutical industry, for instance, has demonstrated remarkable potential, growing at 15.6 per cent annually with exports reaching US$188 million in 2023. With appropriate incentives, industry experts project this figure could exceed US$1.0 billion by 2030. Similarly, the ICT sector, which currently contributes just US$1.3 billion in exports, has the capacity to reach US$ 5.0 billion within five years if given proper policy support.\nLight engineering products represent another untapped opportunity. Countries like Taiwan and South Korea transformed their economies by focusing on this sector, yet Bangladesh's light engineering exports remain below US$500 million annually despite a skilled workforce and growing domestic capabilities. Redirecting even 20 per cent of current garment incentives towards these sectors could catalyse exponential growth and create a more resilient export economy.\nIndividual success stories demonstrate what becomes possible when innovation receives proper support. Kazi IT Center, starting as a small software development firm, now exports specialised healthcare management systems to seven countries, generating US$12 million annually. Similarly, Dhaka-based Bengal Plastic has successfully penetrated high-value European markets with specialised industrial components, commanding prices comparable to Chinese competitors.\nThese examples illustrate that Bangladesh can compete globally in diverse sectors when entrepreneurs receive adequate support and policy backing. The path forward requires a fundamental rethinking of our export strategy-one that balances continued support for established sectors while aggressively developing new export capabilities.\nFor Bangladesh to reverse its declining export revenue, policymakers must implement a balanced incentive structure that nurtures emerging sectors, invest in skills development beyond traditional manufacturing, and establish specialized export promotion agencies for high-potential industries. Without these changes, the country risks watching its hard-earned export gains continue to erode in an increasingly competitive global marketplace.\nThe choice before Bangladesh is clear: continue down the path of dangerous concentration or embrace the challenging but necessary work of diversification. Our economic future depends on making the right decision.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The headwinds export sector faces",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-headwinds-export-sector-faces-1765121372",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       December 08, 2025 12:00:00  \nMost people view butterfly, a unique creation in the living world, as an aesthetic treat to the eye or a source of entertainment. But whoever could think of a butterfly fair instead of a show of the most decorated wingy creature! And that too an annual affair! \nYes, the Jahanrirnagar University has made it an annual event on its academic calendar. This year's was the 15th such fair with the slogan, \"Urle akashe projapati, prokiti paye notun gati' (If butterflies are on their wings, Nature acquires a new dimension). This succinctly captures the true value of the colourful tiny creatures in the grand scheme of coexistence of living beings including the human. \nThey may be small and fragile creatures having a short lifespan, but in that short existence they serve their purpose of coming to this world. The beautiful patterns of their wings are so varied and unique for each subspecies that they ask human beings to 'watch me', 'no, me, please' type of contest. This may be for the gratification of the human eye. But when their lifespan vary from just two days to nearly a year and their adult lifehood is around two weeks on an average, it is important to know what their contribution is to the worlds of flora and fauna. \nButterflies are busy like bees but they flutter about faster than the latter from one flower to the other to drink nectar. Unlike bees, they have no hives for storing honey but in the process of making rounds, they do a world of good. The pollen grains their legs, antennae and fine hair come in contact at the time of sending their proboscis deep inside a flower to collect nectar is transferred from anthers to stigma, a crucial part of the female reproductive structure of a flower. This is vital for fertilisation, leading to seed and fruit development. \nThere are as many as 17,500 types of butterflies in the world. Without them and bees, many of the crops, flowers and fruits would not be able to regenerate their own kinds. This shows that their contribution to human and other animals' foods is substantial. Where foods are concerned, economy follows close behind. Butterflies thus help production of crops and fruits for the human species. But in return human beings are inadvertently doing enormous harm to this species. Pesticides and chemical fertilisers used indiscriminately are proving a threat to their existence. Therefore, use of organic fertilisers would be the right option. After all, Nature does not tolerate too much tinkering with the normal process of the life cycle of fauna and floral world. \nHumans must respect the principle, 'live and let others to live'. It is quite evident that in the interest of their existence, people must not cross the limit where inter-species relations are upset, tipping the balance. If food security for human beings is important, so is for all other species including the smallest of creatures. Economy is important but any bias attitude towards food production can spoil the entire system unless the natural selection is allowed to carry on normally. Manipulation only makes matters worse.\nIt is good to know that the Jahangirnagar University's butterfly fair draws a very good number of children who take part in various competitions including painting of butterflies. Butterfly enthusiasts are apprised of the role the beautiful creatures play in rebalancing the relations between humans and the rest of the members of the world of fauna.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Butterfly fair more than an exhibition",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/butterfly-fair-more-than-an-exhibition-1765121449",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 08, 2025 00:00:00  \n\nWinter arrives quietly, with foggy mornings, cold winds and the familiar chill in the air. While many look forward to this season with warm clothes, blankets and hot meals, the same period becomes a harsh struggle for countless poor and homeless people around us. They live in our neighbourhoods, our villages and our city slums. Many street children and vulnerable individuals do not even have a secure place to sleep, spending their nights on footpaths, railway stations or under open skies.\nFor those whose daily battle is securing food, buying warm clothes is a distant luxury. Many try to survive the cold by wrapping themselves in old sacks, torn garments or pieces of polythene. When they fall ill from cold-related diseases, treatment remains out of reach. Some huddle around makeshift fires, while others curl up in corners simply trying to endure. Sadly, these people often remain invisible to society, even though they are very much part of it.\nAlthough charitable initiatives exist, they often remain distant and disconnected from the immediate needs of the people right beside us. The worst suffering of winter is felt by these silent neighbours, who rarely receive the warmth of our attention or compassion.\nThis reality places a moral and social responsibility on all of us to look out for those around us. Local, neighbourhood-based initiatives can make a significant difference. Volunteer groups can identify poor families, street children and elderly residents in need of warm clothing. Unused but good-quality coats, sweaters, blankets and shawls sitting in our closets can bring real relief to these families. Those who are able can also arrange hot meals or purchase new winter clothes for several households.\nLet this winter not be a season of suffering for the poor, but a time of warmth created through collective care and humanity. \nRafijul Islam Rahat\nPabna University of Science and Technology\nrafijul2004@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Looking after neighbours this winter",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/looking-after-neighbours-this-winter-1765121559",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-12-2025"
    }
]