[
    {
        "full_article": "In his third White House visit in six months, Israeli Prime Minister Benjamin Netanyahu, on Monday (July 7, 2025), heaped praise on U.S. President Donald Trump for his “pursuit of peace and security... in the Middle East” and even nominated him for a Nobel Peace Prize but stopped short of making any commitment on the most pressing issue in West Asia today — a ceasefire in Gaza. While indirect talks between Hamas representatives and Israel continue in Doha, Israel appears to be readying the forcible relocation of Palestinians to the south of Gaza. Defence Minister Israel Katz says he has instructed the Israeli Defence Forces (IDF) to come up with a plan to relocate the entire population of Gaza, of 2.3 million people, to the ruins of Rafah, which the Israelis call a “new humanitarian city”. There were reports in the Israeli media about the IDF chief, Eyal Zamir, opposing the plan, saying that “the hungry and angry” Palestinians “could turn on the IDF”. The IDF killing dozens of Palestinians, including children, in Gaza is a daily occurrence; starving civilians are shot down in aid centres. Doctors who served in Gaza in the past 20 months have horror stories of babies being starved to death or bodies of children being brought to hospitals with sniper wounds in their heads. None of this moves Mr. Netanyahu and his backers in the West, including Mr. Trump, who calls himself “a man of peace”.Mr. Trump had said before the meeting that he would be “very firm” with Mr. Netanyahu on the need for a ceasefire. But words alone are not enough. Mr. Trump has the leverage to compel Israel to accept a ceasefire in Gaza. He demonstrated his influence in the final hours of the Iran-Israel war, publicly demanding that Tel Aviv turn back its fighter jets that had taken off to bomb Iran. Israel complied, after carrying out only a symbolic strike. Today’s Israel is dependent on the U.S. as ever before. During the war on Iran, Israel had to rely on America for offensive and defensive support. Israel needs American weapons to continue its devastating war in Gaza. And Mr. Netanyahu, who is facing an arrest warrant from the International Criminal Court for war crimes and crimes against humanity, needs American political and diplomatic backing to continue his wars across West Asia with impunity. If the U.S. continues to support Israel and refuses to use its leverage to end the Gaza war, it will be condemned by future historians and fact-finders as a country that was complicit in Israel’s crimes against Palestinians. There are no excuses for Israel to prolong this brutal war, which has killed an estimated 70,000 people in 20 months. The slaughter must stop, and Israel must be held accountable for its crimes.\r Published - July 09, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        international court or tribunal\n                    \n                            /                      \n                        \n                        defence equipment\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        war\n                    \n                            /                      \n                        \n                        crime\n                    \n                            /                      \n                        \n                        crime, law and justice\n                    \n                            /                      \n                        \n                        award and prize",
        "headline_1": "Stop the slaughter: On Trump, Israel and the Gaza war",
        "headline_2": "Trump must use his leverage to force Israel to end the war in Gaza",
        "link": "https://www.thehindu.com/opinion/editorial/stop-the-slaughter-on-trump-israel-and-the-gaza-war/article69788125.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "09-07-2025"
    },
    {
        "full_article": "The Union Cabinet recently approved a ₹1-lakh crore Research Development and Innovation (RDI) scheme that aims to incentivise the private sector to invest in basic research. The scheme will primarily consist of a special purpose fund established within the Anusandhan National Research Foundation (ANRF), which will act as the custodian of funds. The funds will be in the form of low-interest loans. The ANRF is conceived as an independent institutional body, with oversight by the Science Ministry, to allocate funds for basic research and to incentivise private sector participation in core research. The involvement of the ANRF here is a novel move as the newly created organisation is meant to be the equivalent of a single-window clearance mechanism for funding research and development for universities and academic institutions. It is also expected to get about 70% of its budget from private sources. In sum, through the RDI and the ANRF, the government is looking to stake the bold claim that it has played its part and that it is now up to the private sector to come forward and reverse the ratio from where the government today accounts for about 70% of India’s R&D spend. However, already incipient in the government’s tall ambitions are traces of what has caused previous such schemes to falter. The first of these is conservatism.It turns out that a condition for availing funds is that only products that have reached a certain level of development and market potential or, what are called Technology Readiness Level-4 (TRL-4) projects, would be eligible. There are nine TRL levels, a hierarchy that was first conceived by the United States’ National Aeronautics and Space Administration (NASA) in the 1970s. TRL-1 represents a basic level of research and TRL-9 a state of advanced readiness. TRL-4 appears to be an arbitrary decision to support any promising research that has progressed halfway. Were there such a magic sauce, venture capital industries, premised on the fickleness of predicting the ‘next big thing’, would not exist. The scheme also seems to forget that technologically advanced countries have become what they are because of their military industrial complexes — where the spectre of war incentivises the development of technology that is risky and expensive but, over time, may prove to be of immense civilian value — examples are the Internet or the Global Positioning System. India continues to haemorrhage scientists to the West due to the lack of opportunities commensurate with their training. Finally, it lacks a deeply skilled manufacturing sector that can make the products that scientists conceive of. Budgetary allowances cannot overnight fix that which requires major surgery. Published - July 09, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        research\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        science (general)\n                    \n                            /                      \n                        \n                        university\n                    \n                            /                      \n                        \n                        finance (general)\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        internet\n                    \n                            /                      \n                        \n                        satellite technology\n                    \n                            /                      \n                        \n                        scientific institutions\n                    \n                            /                      \n                        \n                        government departments",
        "headline_1": "​Quick fix: On India’s Research Development and Innovation scheme",
        "headline_2": "Budgetary allowances alone won’t solve India’s R&D problem",
        "link": "https://www.thehindu.com/opinion/editorial/quick-fix-on-indias-research-development-and-innovation-scheme/article69787992.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "09-07-2025"
    },
    {
        "full_article": "When tech-based welfare delivery fails, who helps India’s digitally unlettered poor?  \nFor ten months members of an all-women household in a tribal village in MP – 80-year-old Gaura Bai, her widowed daughter-in-law and her three small grandkids – have lived under a tree, after razing their own kuccha house in village Lohari, Dhar district. They demolished their hut last Sept because, as TOI’s July 7 story of the shocking incident (‘House Lost, Hope Stalled’) reported, their panchayat told them that to claim the amount under PMAY-Rural, she would have to demolish the structure, ‘show the computer an image proving’ she had no house. This was, of course, a total misreading of the scheme. Tragedy is that most of India’s disadvantaged rural groups, like Dalit or tribal women, are so impoverished, they aren’t equipped to spot an absurdity or a fraud – far less cross-check or factcheck a sarpanch or officials. And should they dare to question officials, consequences can be severe.\nHer application was made using her MNREGA card. But a ‘system glitch’ stalled her allotment. Till March 2025, in MP, over 37L PMAY-Rural houses had been built. Gaura Bai can be seen as one case that fell through the cracks, unseen in all the govt and thinktank audits on PMAY-R. But that’s not the point. She has paid the devastating cost of an overly tech-dependent system, which has no Plan B that can be locally addressed. Given 60% of PMAY-R allotment is meant for SCs and STs, how can govts not see the chasm between tech-enabled systems and beneficiaries of the scheme – a largely digitally unlettered population? The TOI report resulted in govt assuring Gaura Bai accommodation till her allotment is resolved. Who compensates her for the hardship of 10 months? Who is accountable for technical flaws? Gaura Bai’s case came to light courtesy TOI’s report. How many Gaura Bais may be out there, stranded on a technical error?\n\n",
        "headline_1": "All The Gaura Bais",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/all-the-gaura-bais/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-07-2025"
    },
    {
        "full_article": "Gaura Bai is an 80-year-old woman who lives in a small tribal village in Madhya Pradesh. She used to live in a simple mud house with her widowed daughter-in-law and three little grandchildren. But for the last 10 months, they have been living under a tree. Why? Because of a big mistake.\nLast September, their village officials told Gaura Bai that if she wanted to get money from a government housing scheme called PMAY-Rural (which helps poor people build homes), she had to first destroy her old house and take a picture showing she had no home. They said this photo was needed for the computer to accept her application.\nBut that was completely wrong. The rule didn’t say that at all. Sadly, Gaura Bai and her family believed the officials, because they didn’t know how the system really worked — and they didn’t feel they could question what they were told.\nShe applied for the house using her MNREGA job card, but then something went wrong with the computer system – a ‘glitch’ – and her name was not added to the list. So while lakhs of homes were being built for others, she was left with nothing.\nBecause she doesn’t use technology or the internet, she had no way of checking what went wrong or how to fix it. And she’s not alone — many poor families in villages, especially women from Dalit or tribal communities, don’t know how these digital systems work. They are expected to use online apps and portals, but often no one helps them when the system fails.\nThankfully, a newspaper, The Times of India, wrote about her story. After that, the government promised to give her temporary shelter and fix her housing problem. But what about the 10 months she already spent in the open, suffering with her family?\nAlso, what about the many other people like Gaura Bai whose stories don’t make it to the news?\nThis shows a big problem — when technology is used to help people, there must also be a backup plan in case the tech fails. Otherwise, people who need the most help can be forgotten and left behind.\n\n",
        "headline_1": "Who Helps People Like Gaura Bai?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/who-helps-people-like-gaura-bai/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-07-2025"
    },
    {
        "full_article": "Language chauvinism is a political strategy for BMC polls. But it can create dangerous social divisions\nThere’s constructive politics, which concerns itself with the lot of the people, and there’s cynical politics, which only serves the interests of its conductors. By those measures, it’s hard to fit Maharashtra’s ongoing language row into a constructive politics mould. While there might have been a case for not burdening little schoolchildren with a third language – Hindi – and charges of “Hindi imposition” may have resonated in the state, they ceased to be an issue when Maharashtra govt withdrew the three-language order under intense opposition last month. The Thackeray cousins were still entitled to their triumphal event – Marathicha Awaaz – last Saturday because politics, like Wimbledon matches, requires constantly scoring points against opponents. However, by targeting Hindi speakers in and around Mumbai they’re letting a genie out of the bottle that’s never easy to lure back inside.\nBy what stretch of ideology does the debate over teaching Hindi in Maharashtra’s primary schools justify the slapping of a non-Marathi-speaking mithai shop owner and his employee? The accused in this case are members of Raj Thackeray’s MNS, which has a record of thumbing its nose at the law. As he warned during Saturday’s rally – “You may rule the assembly, but we rule the streets.” The irony – lost on him – is that after almost 20 years of hate-mongering against “outsiders” – Hindi-speaking north Indians – his party has not found acceptance in Maharashtra’s heart. It does not have a seat in Lok Sabha or the state assembly. The only time it had double-digit assembly seats – 13 in 2009 – it earned lasting infamy when its members assaulted Samajwadi Party’s Abu Azmi in the House for taking his oath in Hindi.\nBut consider the ramifications of a rejected party’s rejected ideology – a Maharashtra minister tried to join an MNS protest on Tuesday. With municipal polls due across the state, other politicians may also try othering Hindi speakers. Meanwhile, BJP’s Jharkhand MP Nishikant Dubey has dared Sainiks of all colours to visit “Bihar, UP, TN” for a taste of “patak patak ke marenge”. None of this is constructive. A toxic discourse doesn’t serve voters anywhere. It doesn’t solve Mumbai’s civic issues, nor does it improve the learning outcomes of Maharashtra’s children. Maharashtra prides itself on being one of India’s biggest engines of growth. It’s aiming to be a $1tn economy. It can’t get there with this brand of divisive cynical politics.\n\n",
        "headline_1": "Talking Mumbai",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/talking-mumbai/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-07-2025"
    },
    {
        "full_article": "In Mumbai, some politicians are using language to create fights just to win elections. This is not helpful for the people at all.\nHere’s what happened: The Maharashtra government had said that schoolchildren must learn three languages, including Hindi. But many people didn’t like this rule. They felt Hindi was being forced on them. So, the government took back the rule last month. That should have been the end of the issue.\nBut some leaders still want to get attention. Last Saturday, two cousins – Uddhav Thackeray and Raj Thackeray – held a big event called Marathicha Awaaz, which means “Voice of Marathi”. They wanted to show they are fighting for the Marathi language. But things went too far.\nA sweet shop owner and his worker, who didn’t speak Marathi, were slapped by members of Raj Thackeray’s party, the MNS, just because they were speaking Hindi. This is very wrong and scary.\nRaj Thackeray’s party has done such things before – like attacking a politician in 2009 just because he took an oath in Hindi. Even after all this, the MNS has never become a big or successful party. They have no seats in Parliament or the Maharashtra assembly now.\nNow that local elections (like for Mumbai’s BMC) are coming, some politicians are again trying to turn Marathi speakers against Hindi speakers. This is a dangerous game.\nOne BJP leader from Jharkhand even replied angrily, saying if Marathi leaders came to states like Bihar or UP, they would be beaten up. This kind of talk only spreads hate.\nBut does this help Mumbai’s people? No. It doesn’t fix roads, water problems, schools, or hospitals. It doesn’t help kids learn better in school either.\nMaharashtra is a rich and powerful state. It wants to grow into a $1 trillion economy. But that dream won’t come true if leaders keep fighting over language and dividing people. We need politics that brings people together, not tears them apart.\n\n",
        "headline_1": "Talking About Mumbai and Language Fights",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/talking-about-mumbai-and-language-fights/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 09, 2025 00:00:00  \nThough there is no supply shortage, the prices of different categories of rice, the staple food of the Bangladeshis, have been rising since last month, leaving market watchers intrigued. Because, the overall yield of Aman, the second largest rice crop, despite the floods that damaged this crop on some 350,000 hectares of land mainly in the coastal districts this season (FY25), did not suffer much. If anything, the total production of Aman at 16.5 million tonnes in FY25 was close to that of the previous year's (at 16.6 million tonnes), according to the Bangladesh Bureau of Statistics (BBS). The higher yield of Aman should have a positive impact on its price. Again, the higher yield of Boro this season could have at least helped keep the price of the staple grain stable, if not brought it down. Import of this grain by the government as well as the private sector also continued. None of these positive factors could hold back the rice price from going up stubbornly to the dismay of not only the general consumers, but also of some rice traders. \nReportedly, the prices of the finer varieties of rice have registered a sharp increase in the city's kitchen markets in recent weeks. The prices of the medium and coarse varieties, too, have reportedly increased by Tk3.0 to Tk5.0 per kg. Interestingly, rice traders, both retailers and wholesalers, appeared clueless about the irrational price hike of this basic commodity. However, most of them would like to blame it on rice mill operators, or millers. The millers were reportedly hoarding rice to create artificial supply crisis. On their part, the millers are pointing the finger at the corporate rice traders for the unexplained volatility of the rice market. \nSome local rice millers, however, the government's paddy procurement drive at a higher than market price is responsible for this. This view contradicts the facts on the ground since the government's boro purchase drive has hardly been a success. The unusual price hike remains shrouded in mystery. Even the Food Ministry could not solve the mystery of this food price surge through a recent probe it carried out. So, it has launched an anti-hoarding drive with the help of the local administration across the country. Let us hope that the drive would produce some results. However, the government cannot hope to effectively deal with this all important issue of unreasonable price hike of rice in an ad hoc manner. Failure on the part of the government to bring down the price in this peak harvest season risks emboldening the evil quarters at work to render the rice market further volatile. Given that over the last one month the price of coarse rice has gone up by nearly 10 per cent is indeed bad news for the majority of the population belonging to the low-income bracket. It tells on their tight family budget.\nAlready hit hard by ever-rising cost of living with no commensurate increase in income level, this section of the people has their back to the wall. The government needs to address it through measures equal to cushioning the effect of the soaring price of rice on the average citizens.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Irrational price  hike of rice",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/irrational-price-hike-of-rice-1751988222",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       July 09, 2025 00:00:00  \n\nOne of the most alarming and persistent challenges confronting the nation today is the scourge of drug abuse and the illicit trafficking of narcotic substances, threatening public health, law and order, and the very fabric of society. Despite repeated calls for effective action and the observance of international days dedicated to raising awareness against drug abuse, the grim reality is that drug trafficking continues unabated, with ever-expanding tentacles reaching vulnerable populations and pushing countless individuals into the abyss of self-harm.\nThe recently observed International Day against Drug Abuse and Illicit Trafficking served as a sombre reminder of the scale and severity of the problem. Statistics shared on this occasion revealed a troubling picture: drug trafficking is steadily rising, and the number of people succumbing to drug addiction is also on an upward trajectory. The authorities' struggle to counter these twin threats was candidly acknowledged by none other than the Home Adviser to the interim government. He admitted that the law enforcement and oversight agencies have not succeeded in stemming the tide, let alone eliminating it.\nThis admission underscores a critical policy failure --- the inability of institutions to keep pace with the rapidly evolving and highly organised networks of drug traffickers. These networks have become increasingly sophisticated, exploiting gaps in law enforcement, porous borders, weak regulatory systems and, in many cases, the collusion or negligence of officials. Traffickers have developed elaborate supply chains, with international links that channel narcotics across borders and into the hands of local distributors who, in turn, push drugs onto the streets.\nAmong the most trafficked substances are heroin, yaba (a methamphetamine-based pill), phensedyl, and cannabis. Yaba, in particular, has wreaked havoc among the youth, drawing them into a vicious cycle of craving, health deterioration, and crime. The high profit margins in this illegal trade incentivise ever more dangerous actors to enter the market, fuelling an arms race of sorts between traffickers and law enforcement agencies.\nThe number of drug addicts in the country is 8.3 million. While the drug addicted persons are predominantly male, addiction is also found among women and adolescents. This estimate comes from a recent survey, the first of its kind conducted by the government body, the Department of Narcotics Control (DNC). \nAccording to the DNC survey, the number of men among the total addicts stands at 7.76 million, while 285,000 are women and 255,000 children and adolescents. Of the addicts, 6.1 million (52 per cent) are addicted to cannabis (ganja), 2.3 million (20 per cent) to yaba, 2.02 million (17 per cent) to alcohol, 346,000 to phensedyl and similar drugs, and 320,000 to heroin. The survey said 300,000 people take sleeping pills as drugs, 160,000 take glue/adhesives like dandy and 39,000 take intravenous drugs. While the substance-wise total adds up to around 11.7 million, many users are addicted to more than one substance, so the adjusted total is 8.3 million. \nOn each International Drug Day, the DNC publishes an annual 'Drug Report'. This year's version, Drug Report 2024, notes that despite not being a drug-producing country, Bangladesh is geographically vulnerable due to its proximity to international drug trafficking routes such as 'Golden Triangle' (Myanmar, Laos, Thailand), Golden Crescent (Iran, Afghanistan, Pakistan), and Golden Wedge (parts of India, Nepal, Bhutan).\nBangladesh shares borders with India and Myanmar across 32 districts, making it a transit point for both traditional and synthetic drugs for over four decades. The report identifies 104 high-risk border points: 43 points at eight districts in the western region, 21 points at four districts in the eastern region, 21 points at five districts in the northern region and 19 points at Cox's Bazar.\nAccording to the UNCTAD's (United Nations Conference on Trade and Development) 2023 report, Bangladesh loses USD$481 million (approximately Tk 5,900 crore) annually to drug trafficking. Bangladesh ranks fifth in the world in terms of money laundering through drug trade.\nThe social fallout of rampant drug trafficking and abuse is profound. Families are torn apart as members become addicted, often turning to petty crime or even violent acts to feed their habit. Young people, who should be investing their time in education and skill-building, instead find their futures derailed by addiction. The broader community suffers from rising levels of insecurity, as drug-related crimes including robbery, extortion, and gang violence proliferate. Moreover, the burden on the healthcare system grows, with increasing numbers of addicts requiring medical attention, rehabilitation, and psychological support.\nDespite these devastating consequences, the efforts to contain the problem have been piecemeal at best. While there have been periodic crackdowns and seizures of contraband, these measures are too often reactive rather than proactive, and lack the sustained momentum needed to dismantle the deeper structures of drug trafficking syndicates. \nThe admission by the Home Adviser of the authorities' failure to curb the drug menace should not be taken as a mere statement of fact but as a rallying cry for urgent, coordinated and determined action. Unabated drug trafficking is not just a law and order problem; it is a multifaceted societal crisis demanding comprehensive response. Political will must be mobilised at the highest levels, community initiatives ecouraged and supported, and enforcement mechanisms modernised and made more transparent. \nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The menace of unabated  drug trafficking",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-menace-of-unabated-drug-trafficking-1751988283",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 09, 2025 00:00:00  \n\nBangladesh's suburban regions are rapidly evolving into urban centres, bringing both development opportunities and rising environmental and social challenges. To ensure that urbanisation remains economically and environmentally sustainable, the private sector-especially banks-must step forward alongside the government.\nBanks play a vital role in achieving Sustainable Development Goal 11 (Sustainable Cities and Communities) by financing eco-friendly infrastructure, affordable housing, clean transportation, and resilient public services. \nThrough green loans, project financing, and public-private partnerships, banks enable cities to grow smarter, safer, and more equitably.\nThe Bangladesh Bank's 'Sustainable Finance Policy' (2020) requires financial institutions to assess environmental risks and promote green financing. In 2023, banks invested over Tk 12.64 billion in sustainable projects-ranging from renewable energy to rainwater harvesting and LEED-certified buildings.\nMoreover, banks can influence sustainable practices at the household level by linking home loans and microloans to environmental incentives. For instance, offering interest subsidies for homes with solar panels or water-saving systems can encourage individuals to adopt eco-friendly lifestyles.\nBanks like Dutch-Bangla Bank and Prime Bank are already setting examples through initiatives like \"Green Office\" programmes and investments under the Green Transformation Fund in agriculture and textiles. Meanwhile, digital banking, accelerated during the COVID-19 period, is also promoting environmental sustainability by reducing paper, energy, and time use.\nThe Banking Companies (Amendment) Act 2020 and Bangladesh Bank's Sustainable Finance Guidelines are reshaping the financial sector's role from profit-making to socially and environmentally responsible investing.\nBanks must now act not only as financiers but also as proactive partners in sustainable urban development. With visionary policies, innovative credit products, and public awareness efforts, the banking sector can become a key force in building greener, more liveable cities for future generations.\nMd. Hassan\nDepartment of Development Studies\nIslamic University, Kushtia\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Banks' role in sustainable urbanisation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/banks-role-in-sustainable-urbanisation-1751988308",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 09, 2025 00:00:00  \n\nBiodiversity is the foundation of life on Earth. It provides us with oxygen, food, medicine, and climate stability. Yet, we are witnessing its alarming decline due to human activities-urbanisation, deforestation, pollution, illegal hunting, and climate change. The consequences are far-reaching, not just for ecosystems, but for human survival.\nForests, wetlands, oceans, and polar regions each hold unique biodiversity, playing vital roles in maintaining ecological balance. From pollination and water purification to protection against floods and erosion, nature performs invaluable services. But when we destroy habitats, pollute air and water, or introduce invasive species, we disturb this balance. Species are disappearing at an unprecedented rate, and with each loss, the chain of life is weakened.\nThis crisis has direct impacts on us. Food security is threatened when pollinators vanish or crops fail due to biodiversity loss. Forest loss increases flood risks. Medicinal resources, many of which come from plants and animals, are lost before they are even discovered. Reduced biodiversity affects livelihoods, agriculture, fisheries, tourism, and many local economies depend on it.\nThis is not a problem for governments alone. Protecting biodiversity requires collective action. Awareness is the first step. Schools and media must promote the importance of biodiversity. Governments should enforce environmental laws, expand protected areas, and promote eco-friendly development. Shifting to renewable energy, adopting sustainable farming, and restoring damaged ecosystems are essential. As individuals, we can help too by reducing plastic use, conserving water and energy, planting trees, and respecting wildlife. International cooperation is equally vital through shared research, conservation programmes and knowledge exchange. Let us act now to preserve the delicate web of life. A future where humans and nature thrive together is still possible, if we take responsibility today.\nSadia Sultana Rimi, Student, Department of Mathematics\nJagannath University\nsadia15.jnu@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Biodiversity and our responsibility",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/biodiversity-and-our-responsibility-1751988333",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-07-2025"
    }
]