[
    {
        "full_article": "The Free Trade Agreement (FTA) between India and the United Kingdom marks a strong step towards securing India’s bilateral ties in an increasingly fragmented global trade environment. The key highlight for India is that 99% of its exports will attract no duties. Apart from being hailed by business leaders, industry associations representing sectors such as engineering goods, apparel, and gems and jewellery — each among the top Indian exports to the U.K. — have expressed strong optimism for future trade growth. Engineering exports, for example, are expected to nearly double to $7.55 billion by 2029-30, according to the Engineering Exports Promotion Council of India. Overall bilateral trade is expected to double to $120 billion by 2030. The other major win is that Indian workers temporarily working in the U.K. and their employers will be exempt from making social security contributions for three years. This is likely to ease the hiring of Indian workers in the U.K. The FTA also eases the movement of professionals and investors, which should go some way in reviving India’s flagging foreign direct investment levels. On the flip side, India has agreed to cut its tariffs on 90% of the tariff lines imported from the U.K., with 85% of these to be reduced to zero tariff within a decade. While the reduction in automotive tariffs is unlikely to meaningfully change the price-conscious behaviour of Indians, the slashing of import duties on whiskey and gin will increase competition in India and perhaps slow the ongoing premiumisation trend.Although the Modi government has been quick to criticise the FTAs signed by the UPA for putting India at a disadvantage, some of its own FTAs have faced the same issue. The India-UAE CEPA (2022), for example, has seen India’s trade balance worsen over the years. The FTA with Australia, too, has not resulted in gains for Indian exports. Indian farmer organisations — opposed to the U.K. FTA since talks began — are up in arms over the reduced tariffs on lamb and salmon and other edible products. Here, too, the government must act to ensure that India’s farmers, already in a low-income, low-margin situation, are not elbowed out. Then, there is the fact that trade experts agree that the India-U.K. FTA will be the template for future agreements with the EU and the U.S. India must be careful here. While the U.K. is a relatively small trading partner, the EU and the U.S. deals — when they happen — will have a more significant impact. India has already cut import duties on several food and auto products in line with U.S. demands. With a less than 2% contribution to global exports, Indian manufacturing needs to be helped, not undermined.\r Published - May 09, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        employer\n                    \n                            /                      \n                        \n                        malts and wines\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        United Progressive Alliance\n                    \n                            /                      \n                        \n                        United Arab Emirates\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        meat\n                    \n                            /                      \n                        \n                        fishing industry\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        European Union\n                    \n                            /                      \n                        \n                        jewelry\n                    \n                            /                      \n                        \n                        textile and clothing\n                    \n                            /                      \n                        \n                        manufacturing and engineering\n                    \n                            /                      \n                        \n                        social security",
        "headline_1": "​Caution and optimism: On India’s FTA with the United Kingdom",
        "headline_2": "The FTA with the United Kingdom should not elbow out India’s farmers",
        "link": "https://www.thehindu.com/opinion/editorial/caution-and-optimism-on-indias-fta-with-the-united-kingdom/article69553472.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "09-05-2025"
    },
    {
        "full_article": "India carried out precision military strikes across nine locations in Pakistan and Pakistan-occupied-Kashmir early on Wednesday (May 7, 2025). Targets included Bahawalpur, the headquarters of the Jaish-e-Mohammed, and Muridke, a nerve centre of the Lashkar-e-Taiba — terrorist outfits bred by Pakistan to target India. India said the strikes were to destroy the camps used to train terrorists and to “pre-empt as well as deter” more such cross-border attacks following the terror attack in Pahalgam on April 22, 2025 in which 26 people were killed by terrorists who identified the targets by their religion. India’s military strikes were “measured, non-escalatory, proportionate, and responsible”, the government said. In 2019, India had carried out surgical strikes in Balakot in Khyber Pakhtunkhwa in north Pakistan, after the Pulwama terrorist attack. The response this time has been sharper and more resolute. Muridke and Bahawalpur are in Punjab, the heartland of Pakistan’s ruling elite, that has been playing the double game on terrorism. Pakistan has, for decades, used terrorism as a low-cost instrument of war against India, under an umbrella of nuclear blackmail. India has been trying to figure out an appropriate response to this. With Balakot, and now Operation Sindoor, the point is clear — India can have an overt military response in the event of a terrorist attack against it, apart from economic and diplomatic measures. India has also underscored the point that there were no civilian, economic or military targets on Wednesday.Overt military action in response to Pakistan-sponsored terrorism marks a change in India’s strategy under Prime Minister Narendra Modi. How this will change Pakistan’s behaviour remains uncertain. The strikes destroyed terrorist bases, but that setback may not be long term, considering the perennial supply of radicalised youths in Pakistan. Pakistan has not only raised terrorists who target India but also harboured Osama bin Laden, the most wanted terrorist for the West, even while it was claiming to be an ally in the war on terror. Pakistan’s character will have to change if it is to behave differently. India has reached out to other countries, and world powers must use their considerable leverage to coerce Pakistan to act responsibly. The retaliatory strikes apart, the investigation into Pahalgam should continue in full vigour and be taken to its logical conclusion. India should also watch out for escalatory moves by Pakistan and be prepared to respond militarily and diplomatically. The Centre on Wednesday pointed out that the terrorists wanted to disturb normalcy in Kashmir and create communal rift in the country. All political parties have supported the military operation. While strengthening the domestic political consensus on the issue, the Centre should also ensure that elements who try to create communal strife and play into the hands of Pakistan are restrained. Any missteps will carry a great risk. Published - May 08, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        Pulwama attack 2019\n                    \n                            /                      \n                        \n                        Balakot Air Strikes\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Jammu and Kashmir",
        "headline_1": "​Strokes of justice: On ‘Operation Sindoor’ and after",
        "headline_2": "India must be prepared for escalatory action by Pakistan",
        "link": "https://www.thehindu.com/opinion/editorial/strokes-of-justice-on-operation-sindoor-and-after/article69550051.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "09-05-2025"
    },
    {
        "full_article": "On arty-crafty terms replacing good old-fashioned words\nAn Australian friend has sent me an article from a local newspaper which says that the Down Under continent is being ‘uplifted’. Is the land of Oz levitating to the top of the world? Not quite. \n‘Uplifted’ doesn’t have anything to do with geology. Or with such gravity-defying, cosmetic surgery procedures like tummy tucks and double chin eliminations, but is the latest addition to the argot of the hospitality industry. \nIf a hotel offers to change the standard room you booked for a superior room, you are being uplifted. What’s wrong with an old-fashioned upgrade? Upgrade has been downgraded and replaced by the presumably more uplifting ‘uplifted’. Want an extra dollop of cheese on your pizza? By all means. Get uplifted. \nOral snobbery, or snobspeak, which is reinventing language seeks to poshify everyday vocabulary. In the mid-50s, British novelist Nancy Mitford distinguished between U and non-U language, in which U stood for upper class and non-U for non-upper. For example, U-speakers would say scent, whereas non-U speakers would say perfume; a U-speaker would use the loo, while a non-U speaker would go to the toilet. \nIn today’s snobspeak, a restaurant menu or an art gallery exhibition is invariably curated. This does not mean getting hold of a cleric called a curate to preside over the proceedings. Curated merely means ‘put together’, but put together is verbal vanilla, oral plain Jane, while curated sounds glam and arty-crafty. \nLike ‘artisanal’. Artisanal should evoke the image of a workman, an artisan, sweat beading the brow, sleeves rolled up on brawny arms, wielding an implement of arcane use. \nBut artisanal now refers to small-batch food items that aren’t mass-produced, like ice cream, or cheese, or cupcakes, or ‘hand-cut’ sandwiches, as distinct, presumably, from ‘foot-cut’ sandwiches, with or without benefit of boots. \n‘Bespoke’ is the artisanal word for custom-made, or made to order. Being more hoity, not to mention toity, bespoke is snobspeak for customised.  \nBut even as snobspeak invents new buzzwords for its lexicon, it runs the risk of being told to shove a bespoke uplifted into your artisanal. \n\n",
        "headline_1": "Snobspeak doubletalk",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/snobspeak-doubletalk/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-05-2025"
    },
    {
        "full_article": "Modi’s meeting with GOI secys underlines the critical need for supply chain management in these times\nIndia launched Op Sindoor as a measured crackdown on Pakistan-sponsored terrorists, but if Pakistan wants a long conflict, India is comfortably placed economically and logistically. Forex reserves are enough to cover about 30 months of oil and gas imports – or a year of all imports. They are also roughly twice as much as Pakistan’s GDP. On the food front, wheat and paddy stocks are way above govt’s comfort level. There’s a strong and diversified manufacturing base. Growth rate remains high, inflation is under control. Altogether, India is in a good place.\nBut this is no time to be complacent. India’s air defences proved their worth on Thursday by intercepting almost all incoming Pakistani drones and missiles. But we should budget for all eventualities in a conflict. That means keeping a close eye on critical infra. So, contingency plans are important. Underlining the importance of supply chain management, Modi reviewed national preparedness in a meeting with secretaries of various ministries on Thursday. He asked them to work together, not in departmental silos, to ensure there are no disruptions in case of a larger conflict.\nThis is something govt will need to monitor continuously. Since the private sector mainly runs supply lines, coordination with it will be key. Indians are not short of a sense of national purpose, but channelling it can be a challenge. That’s why govt did well to start with mock drills on Wednesday. Besides physical supply chains, the security of digital systems also needs to be ensured. Cyberattacks have increased since the Pahalgam attack on April 22, and BSE and NSE have already curbed website access for foreign entities. Cert-In and other agencies must ensure Indian telecoms and payment systems remain safe. There should be no weak link in India’s chain fence.\n\n",
        "headline_1": "Keep It Flowing",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/keep-it-flowing/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-05-2025"
    },
    {
        "full_article": "Pak generals should know that a far better-resourced India will respond to every escalation \nThe generals in Rawalpindi GHQ are leading Pakistan down a dangerous path of escalation. After Operation Sindoor successfully targeted multiple terrorist bases inside Pakistan, there were signs that Pakistan’s civilian govt was willing to de-escalate. But Pak army swatted such notions aside, vowed retaliation and forced the civilian dispensation to fall in line. This is the real tragedy of Pakistan where the civilian govt has been reduced to a mere rubber stamp by military generals. But the generals must know that in the current round of escalation, cessation of hostilities must come from Pakistan. India has and will respond forcefully to every provocation from across the border. This is the new normal. It needs reminding that the escalation was initiated by Pakistan with the April 22 Pahalgam attack. India only responded with a measured, high-precision operation against the terrorists and their handlers. \nYet, Pak generals chose to further increase provocations by trying to target multiple Indian military installations with drones and missiles on the intervening night of May 7-8. That all of them were intercepted and shot down by India’s Integrated Counter UAS Grid and Air Defence systems, which included the top-of-the-line S-400, highlights New Delhi’s superiority in this regard. In fact, since Balakot 2019, India has spent considerable resources on getting a state-of-the-art air defence grid up and running. \nPakistan, which again tried to breach Indian defences at various points along the International Border yesterday, clearly has nothing comparable. Indian forces, in response to Pakistan’s failed targeting of military installations, pierced Pakistani air defence systems with Israeli-origin Harop and Harpy drones, knocking out the air defence system in Lahore – reportedly a Chinese-supplied HQ-9. Drones are another area where India punches way above Pakistan. While New Delhi is marching towards becoming a drone manufacturing hub, Islamabad has no comparable industrial depth and can only perhaps rely on Turkish and Chinese drones. \nGiven these metrics, Islamabad can ill afford to carry out a long-drawn conflict with New Delhi. It simply doesn’t have the resources. It’s actually likely to run out of ammo if it chooses an escalatory matrix. India’s solid ordnance base ensures no such concerns. Note also that Pakistan’s iron-brother China has been very careful not to get dragged into the conflict. Thus, Pakistan’s playing a losing game here. India’s economic size, ability to absorb the fallout of conflict, and far greater conventional military depth give it a clear edge. India’s consistently stuck to the de-escalatory paradigm. Pak generals should get off the suicide track and stand down now.  \n\n",
        "headline_1": "Stand Down, ’Pindi",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/stand-down-pindi/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-05-2025"
    },
    {
        "full_article": "In planning & execution, Op Sindoor was flawless. It’s also a warning to those in Pak considering escalation\nWhen India struck terrorist camps across LoC in Sept 2016, to avenge Uri, the world was surprised. Same after Balakot. Op Sindoor takes payback for terrorism to another level. The rubble of JeM’s Markaz Subhan Allah HQ in Bahawalpur bears the eloquent imprint of Indian resolve. Eight other terrorist camps located 9-30km inside Pakistan-controlled territory also lie pulverised. That this havoc was wrought in a span of 25 minutes yesterday shows how India’s resolve to punish terrorists and their masters has hardened, and its capabilities have matured, under Modi.\nIf the scale of India’s retaliation for Pahalgam is unprecedented, its planning and execution are flawless. After the massacre of 26 tourists in Pahalgam on April 22, calls for a swift Balakot-like response were growing, but govt resisted the pressure, giving the military time and a “free hand” to plan an operation. Meanwhile, it turned the screws on Pakistan by other means, like suspending cross-border trade and the Indus Waters Treaty.\nOperational secrecy was maintained so well that the missiles, when they hit home, literally caught everyone napping. JeM chief Maulana Masood Azhar has acknowledged that some of his close aides were killed in the strike on his Markaz in Bahawalpur. But the significance of these strikes goes beyond the body count. An attack deep inside Pakistan’s Punjab province should make it clear that, when it comes to pursuing terrorists, no place is off-limits anymore. As Modi promised after Pahalgam, they will be pursued “to the ends of the earth”.\nAt the same time, Op Sindoor is a highly measured action. Great care was taken not to hit military or civilian sites. India has emphasised that it struck terror camps in the light of credible warnings of more Pahalgam-like attacks. The intent is “non-escalatory”, but it’s up to Pakistan now to ensure things don’t get out of hand. India does not harbour terrorists, and if Pakistan attacks Indian military or civilian targets, the responsibility for what happens afterwards is on it. So, if Pakistan’s blustering army chief Asim Munir wants a face-saver, he should factor in a hard Indian response. And he shouldn’t count on ‘Iron brother’ China, which, in a careful statement, has merely termed India’s action “regrettable”, and urged “both sides to act in the larger interest of peace and stability”.\nIf Munir and others in Pakistan are wondering who – India or they – has the bigger stomach for a fight, they should look at their stock market, which tanked on Wednesday, while India’s held its nerve. That’s a huge change from 2016, when the Sensex plunged 465 points on news of India’s surgical strikes. This new India is confident and ever ready to pay back in a bigger coin.\n \n\n",
        "headline_1": "9 Strikes, 1 Message",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/249941/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-05-2025"
    },
    {
        "full_article": "We strongly protest India's action of pushing at least 123 individuals, including Rohingyas and Bangla-speaking people, into Bangladesh through the Kurigram and Khagrachhari border points. Reportedly, Border Guard Bangladesh (BGB) has detained these individuals and is currently verifying their identities, as they possess no IDs or passports. Furthermore, the BGB has issued a high alert along the border and lodged a strong protest note with India's Border Security Force (BSF), advising against such push-ins.\nFlag meetings with the BSF have also been requested at various levels. Meanwhile, the Police Headquarters has alerted the superintendents of police in 31 bordering districts to ensure that our national security is not compromised amid the escalation of the India-Pakistan conflict. At a time when tensions between India and Pakistan have reached their highest point in years, it is shocking that India would choose this moment to push individuals into Bangladesh without consulting the Bangladeshi authorities.\n\nWe must say that there is no basis in international law for such unilateral \"push-ins.\" In fact, it is entirely contrary to accepted diplomatic norms. Why did India not consult the Bangladeshi government before deciding to send these people? This is a question Bangladesh must raise. At the same time, our border security forces must remain on high alert. \nOut of these individuals, 44, including 35 Rohingyas, were detained from the Roumari and Bhurungamari upazilas of Kurigram—30 in Roumari and 14 in Bhurungamari. Meanwhile, in Khagrachhari, at least 79 additional Bangla-speaking individuals were detained after being pushed in through three border points—27 at the Shantipur border in Matiranga upazila, 22 at the Taitong border in Dighinala upazila, and 30 at the Panchhari border in Panchhari upazila. According to a resident of Shantipur who had sheltered one of the individuals arriving from India, these people were flown from Gujarat to Agartala and then forcibly pushed across the border. They were also reportedly warned by BSF personnel never to return, or they would be shot.\nWe must say that there is no basis in international law for such unilateral \"push-ins.\" In fact, it is entirely contrary to accepted diplomatic norms. Why did India not consult the Bangladeshi government before deciding to send these people? This is a question Bangladesh must raise. At the same time, our border security forces must remain on high alert. After all, we still do not know the identities of the individuals who have been pushed in. Moreover, it remains unclear whether India intends to carry out further push-ins—including of Rohingyas from Myanmar—into Bangladesh in the future.\nIn their interactions with Indian officials, Bangladesh authorities must make it clear that any such action must involve consultation with the local authorities first. No unilateral decision that threatens our national security, sovereignty, or territorial integrity can be accepted.\n",
        "headline_1": "India's unilateral 'push-ins' in Bangladesh a blow to already strained ties ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/indias-unilateral-push-ins-bangladesh-blow-already-strained-ties-3890441",
        "news_paper_name": "The Daily Star",
        "publish_date": "09-05-2025"
    },
    {
        "full_article": "The chainsaws arrived at dawn. For two centuries, the banyan tree had stood sentinel over Madaripur's crossroads, its aerial roots cascading like the beard of a Sufi saint. Villagers once gathered beneath its canopy to light candles, tie red threads to its branches, and whisper wishes to the unseen. But on May 5, 2025, the tree's leaves trembled not with monsoon winds but with the growl of engines. The cleric's sermon echoed through the crowd: \"This tree is bid'ah—a corruption. Cut it down, and purify the land.\" By noon, the trunk lay splintered, its roots clawing at air.\nThis was no mere deforestation. It was an assassination—a calculated silencing of memory, faith, and ecology. To understand why a tree became a threat, we must untangle the Bengal Delta's fraying tapestry, where syncretic traditions collide with ascendant orthodoxy, and where governance falters as polarisation sharpens. \nThe Banyan as archive: Eaton's Bengal frontier revisited\nHistorian Richard M Eaton famously described Bengal's Islamisation as a \"slow accretion\"—a 500-year osmosis where Sufi mystics, rice-cultivating peasants, and Hindu-Buddhist rituals merged into a distinct spiritual ecosystem. Shrines (mazars) sprouted under banyans, saints became pir-ojhas (healer-guides), and the delta's monsoon rhythms shaped a faith as fluid as its rivers.\nBut today, clerics invoke bid'ah to oppose this legacy. The Madaripur banyan, like Eaton's syncretic shrines, embodied a living negotiation: Hindu devotees tied threads for fertility; Muslims sought cures for illness; atheists found shade to dream. Its destruction mirrors the recent attacks on 105 Sufi shrines, a rejection of Eaton's \"accretion\" for Salafist purity.\nRitual, memory, and organised violence\nThe attack followed a chilling script. First, the clerics recast the tree's rituals as shirk (idolatry), erasing shared history. WhatsApp groups spread fatwas; 200 men gathered. The felling was filmed—a performance of power. Authorities issued a perfunctory police report, but no arrests followed.\nHere, anthropologist Michael Taussig's concept of \"epistemic murk\" resonates: the deliberate blurring of fact and myth to justify state-sanctioned violence. The tree's assassination became a spectacle, its death a ritual to assert dominance over communal memory. As Walter Benjamin observed, \"Every monument of culture is also a monument of barbarism.\" The banyan's stump, now a relic, testifies to this paradox—a site of both cultural erasure and insurgent mourning.\nThe viral 14-second video of the act, two men sawing the trunk while onlookers stood by, captured this rupture. Shared widely on social media, it became a digital relic of erasure, a modern-day iconoclasm where violence is both documented and normalised.\nGovernance as ghost: Complicity in cultural erasure\nThe landowner, eager to build a house, sold the tree for a paltry Tk 1,500 to a local madrasa. \"Removing it would be costly,\" he shrugged, exposing how economic pragmatism and religious institutions collude in the destruction of heritage. When officials finally arrived, they declared the tree \"partially cut\" and formed a committee—a bureaucratic pantomime of concern. District Forest Officer Jahangir Alam called the banyan a \"protected species,\" yet his intervention came only after the chainsaws had bitten deep.\nThis hypocrisy mirrors global failures: Maui's 150-year-old banyan, scorched by wildfires, stands as a charred testament to ecological neglect. In Madaripur, as in Hawaii, governance is a ghost—present in rhetoric, absent in action.\nSyed Mustafa Siraj's Aleek Manush: Roots of dissent\nSyed Mustafa Siraj's novel Aleek Manush (Mythical Man) offers a literary premonition of Madaripur's tragedy. The protagonist, Shafiujjaman, rebels against his father's rigid orthodoxy, symbolising Bengal's clash between syncretic traditions and puritanical zeal. A line haunts: \"They fear trees because roots cannot be jailed.\"\nIn the novel, rural shrines and banyans serve as sanctuaries for dissent, much like Madaripur's tree. Siraj, an atheist who championed pluralism, frames the banyan as a \"silent historian\"—its rings encoding centuries of coexistence. The novel's climax, where a shrine is desecrated by fundamentalists, mirrors the real-world. Both narratives reveal how orthodoxy weaponizes fear to fracture communal bonds.\nEchoes of environmental carnage\nEnvironmentalist Kazi Faisal's condemnation cuts through the noise: \"A century-old tree is not just a tree—it is part of an ecosystem.\" His words, steeped in urgency, underscore the banyan's role as a keystone species—its figs feeding bats, its hollows sheltering owls. The UN's 2025 Ecocide Report warns that such losses accelerate biodiversity collapse, yet Madaripur's birds now circle a void.\nFaisal's grief mirrors global lament: In England, the Sycamore Gap tree—a 200-year-old icon felled in three minutes—sparked national outrage. Its assailants, revelling in viral infamy, embodied the same nihilism as witnessed in Madaripur.\nFrom Tagore to Benjamin\nTagore's poem Subarnarekha mourns a felled banyan: \"You were my oldest scribe—your rings held my floods' fury.\" Madaripur's loss mirrors this elegy. Meanwhile, Walter Benjamin's \"angel of history\"—staring backward at wreckage while being blown into the future—finds a metaphor in the tree's splintered trunk.\nSiraj's Aleek Manush deepens this dialogue. His protagonist's anarchist cry—\"The state is a torture machine\"—echoes the essay's critique of governance paralysis. The novel's magic realism, where jinns (spirits) haunt uprooted trees, mirrors the uncanny grief of Madaripur's villagers.\nReplanting memory\nThe stump remains. Children still place offerings there—a candy, a scribbled wish. It's a quiet revolt, a refusal to let memory die.\nTo replant Bengal's future, we must: \nLegislate the sacred: Protect heritage trees as \"living monuments,\" as India's 2002 Biodiversity Act recognises community-conserved ecosystems.\nProsecute cultural ecocide: Jail not just chainsaw-wielders but ideologues, as Britain did for the Sycamore Gap vandals.\nTeach syncretism: Revive Eaton's \"accretion\" in school texts, honouring the delta's pluralistic DNA.\nAs the bulldozers retreated, a villager whispered: \"A tree's soul flies into seeds on the wind.\" Let those seeds take root—in law, in soil, in us.\nZakir Kibria is a writer and policy analyst. He can be reached at [email protected].\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Chainsaws at dawn: The assassination of a Banyan tree",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/chainsaws-dawn-the-assassination-banyan-tree-3889821",
        "news_paper_name": "The Daily Star",
        "publish_date": "09-05-2025"
    },
    {
        "full_article": "We are deeply concerned about the lack of meaningful initiatives from the relevant authorities to ensure road safety, as crashes continue to claim lives across the country. According to the Bangladesh Jatri Kalyan Samity (BJKS), 583 people were killed and 1,202 injured in 567 road accidents in April alone. BJKS has identified several major causes of these crashes, with motorcycle accidents contributing to the highest number of casualties last month. Other causes include the operation of battery-powered rickshaws on highways, a lack of signs, markings, and lights on national roads, disobedience of traffic rules, unfit vehicles, unskilled drivers, and reckless driving. Although these reasons are well known, and experts and road safety advocates have long urged action, we have yet to see any effective measures from the authorities.\nThe current situation reflects the failure of successive governments to treat road safety with the urgency it deserves. Particularly during the 15 years of Awami League rule, corruption, mismanagement, and political influence plagued the transport sector. Powerful figures in transport associations, working hand in glove with police and political leaders, sustained a corrupt system that served their interests. Even though a student-led movement in 2018 led to the enactment of the Road Transport Act (RTA) 2018, it remains largely unimplemented to this day.\nWe had hoped for improvements under the interim government, but disappointingly, little progress has been made since it took office nine months ago. Extortion and anarchy still dominate the sector, with transport associations now run mostly by BNP leaders and activists instead of their Awami League predecessors. Meanwhile, unlicensed and noncompliant drivers continue to cause accidents. One example of the government's lack of impact is that although it had announced a decision to remove outdated vehicles from roads by May, there has been little visible interest from owners or government effort to enforce it. Such a lacklustre response to a national crisis is unacceptable.\nWe urge the authorities to take a holistic approach to restoring order on our roads. Implementing the RTA is essential, but we must also tackle the pervasive extortion and political interference in the sector. Establishing a commission to reform the transport system is also an option that should be considered. The BJKS and other organisations have already identified the main causes of disorder and proposed solutions. The government must take these recommendations seriously and act without delay to ensure road safety.\n",
        "headline_1": "Will road fatalities go on without end?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/will-road-fatalities-go-without-end-3889791",
        "news_paper_name": "The Daily Star",
        "publish_date": "09-05-2025"
    },
    {
        "full_article": "The struggles in the banking sector, stemming from a weakened capital base after years of unchecked irregularities during the Awami League's tenure, continue to attract attention. According to data from Bangladesh Bank, the capital-to-risk weighted asset ratio (CRAR)—which measures a bank's capital relative to its risk-weighted assets—fell to just 3.08 percent across the sector at the end of 2024. This is significantly below the 10 percent minimum required under the Basel III framework, down from 6.86 percent recorded three months earlier and 10.64 percent recorded in June 2023.\n\nWhile some banks continue to maintain healthy capital buffers, there is a stark divide within the industry with a number of banks facing alarming shortfalls. For example, at the end of December, state-run banks recorded a CRAR of negative 8.42 percent, Islamic banks stood at negative 4.95 percent, and specialised banks at negative 41.02 percent. In contrast, private commercial banks posted a CRAR of 10.98 percent, while foreign banks reported a robust 42.09 percent.\n\nAccording to industry insiders, these capital shortfalls could jeopardise the stability of the entire financial sector. Moreover, investors and depositors are likely to lose confidence in the affected banks. As a result, the credit ratings of these institutions could be downgraded, making it more difficult and costly for them to raise funds and improve their financial positions.\n\nIt is also worth noting that several banks failed to finalise their annual financial statements by the April 30 deadline. Bangladesh Bank has applied to the finance ministry for a one-month extension on behalf of these banks. In the past, banks were granted various regulatory forbearances, including deferrals on provisioning requirements during the finalisation of annual statements. However, this time the banking regulator has not provided any such relief. Furthermore, in March this year, the central bank tightened the dividend policy for banks, barring those that availed of deferral facilities to meet provisioning requirements from paying dividends from 2024 onwards.\n\nThe ongoing instability in the sector is a direct legacy of the Awami League government's negligence and the corruption it allowed within the sector. This includes permitting banks to defer provisioning requirements, implementing a lax dividend policy, and other regulatory shortcomings. Therefore, although delayed, it is encouraging to see that the central bank has taken measures that, though painful, were long overdue. In the past, we have seen how weak and problematic banks have used such regulatory forbearance to hide capital shortfalls. Rather than continuing to provide the same facility that failed to improve the banks' health and worsened banking discipline, the central bank would be better off exploring other measures to improve overall stability in the sector.\n",
        "headline_1": "Keep a close eye on banks’ health",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/keep-close-eye-banks-health-3888001",
        "news_paper_name": "The Daily Star",
        "publish_date": "09-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 09, 2025 00:00:00  \nThe steady rise in the consumption of locally produced toiletry and hygiene products marks a significant and welcome shift away from reliance on imports. Recent reports indicate that homegrown toiletry and beauty brands are increasingly replacing expensive imported alternatives, driven by affordability, improved quality and an expanding range of offerings. Over the past two decades, the domestic industry has undergone remarkable transformation, with many product categories now experiencing double-digit growth. According to a Financial Express (FE) report, the sector saw particularly sharp growth during the COVID-19 pandemic, when global health consciousness surged amid widespread medical emergencies. Sales of liquid handwash, sanitisers, and antibacterial soaps soared almost overnight, prompting both multinational and local companies to rapidly increase production to meet the unprecedented demand.\nBesides the hygiene products, domestic manufacturers are steadily gaining market share across a wide range of products - tissue paper, toothpaste, shampoo, face creams, deodorant, shaving foam etc. They are doing so by providing affordable alternatives to imported brands. Industry insiders estimate that the sector's annual turnover has surpassed Tk 200 billion, nearly $1.8 billion, driven by a combination of factors including a growing consumer base, rising disposable incomes across both urban and rural areas. Presently, local and multinational companies account for about 70 per cent of the market, while imports make up the remaining 30 per cent. Notably, local brands represent around 30 per cent of that 70 per cent share.\nMarket observers point out that consumer preferences are no longer dominated solely by global names. Instead, today's consumers prioritise functionality, affordability, and familiarity - reason why local brands have found an opportunity to thrive. By focusing on innovation, competitive pricing, and meeting the hygiene demands of a wider range of conscious public, local manufacturers are reshaping a market once dominated by international brands. Reports suggest that the quality of local products is generally good and, in many cases, comparable to imported brands and they come at far lower prices. One of the key factors driving this local success story is the widespread use of small sachets - single-use packs of shampoo, toothpaste, or soap priced between Tk 2.0 and Tk 5.0. These budget-friendly options have opened up new demand, particularly in rural communities, among low-income households, restaurants, and budget hotels.\nDespite these impressive gains, local manufacturers face a critical challenge---their heavy dependence on imported raw materials, which accounts for about 90 per cent of inputs, according to industry leaders. Experts suggest that rationalising import duties on essential raw materials would help domestic players strengthen their hold on the local market and make their products more competitive abroad. There is a clear need to explore international markets, understand consumer preferences, and ramp up exports. While a few companies have already begun exporting, the current export volume remains well below the sector's true potential. It is time the industry people seriously looked into the prospect of exporting, especially in the Middle Eastern, African as well as South Asian markets.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Expanding market of local toiletry, hygiene products",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/expanding-market-of-local-toiletry-hygiene-products-1746722169",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       May 09, 2025 00:00:00  \n\nInternal armed conflicts, wars and proxy wars---some of those prolonged--- have been continuing in quite a few regions of the world. But none of those between two nuclear powers! The latest air strike codenamed \"Operation Sindoor\" launched on Pakistan by India on the early morning of Wednesday now brings the two nuclear-armed neighbours on to the brink of an all-out war. This has some similarities with the invasion of Ukraine by Russia but the contexts and stated aims are totally different. \nWhile Russia wanted to get back its strategic territories such as Crimea that was attached to Ukraine during the Soviet Union and stop the latter from joining the North Atlantic Treaty Organisation (NATO), the arch rivals of the subcontinent have fought over Kashmir ever since its division into the two nations in 1947. This time tension started to build up following the killing of 26 innocent tourists in Pahalgam in India-administered Kashmir on \nApril 22. \nAlthough India claims it carried out 'precision attacks' non-escalatory in nature, once such attacks are unleashed, escalation of the feud is no longer under its control. Since there is India's rival which claims it has been unjustifiably blamed for the Pahalgam massacre, much will depend on how the latter reacts. The Indian air strike, as Pakistan considers, is violence of its sovereignty. So, the National Security Committee of Pakistan government also authorised the country's armed forces to respond to Indian aggression at \"time and manner\" of their choosing. Retaliatory action is on the cards. \nHow intense and extensive the counter offensive will be may decide whether the war will be a large-scale conventional war or worse, will trigger a nuclear war. A top leader of Pakistan did not rule out such a possibility. Can India and Pakistan afford even a conventional war of scale? Spokesperson for UN chief Antonio Guterres has put it succinctly even in a broader context, \"The world cannot afford a military confrontation between India and Pakistan\". \nAt a time when global trade and manufacturing have been severely jolted by Donald Trump's reciprocal tariffs, the fallouts of a war between India and Pakistan will not only cripple the economies of the two warring nations but also cause those of the South Asian nations to bleed. Even its negative ramification for the global economy is likely to be significant. Already Israel's escalating aggression on Palestine, Syria, Lebanon and Yemen has turned the Middle East into a cinder box and the Ukraine war shows no sign of ceasing. The Myanmar conflict stays at a stalemate because of the earthquake. Another war in South Asia, a region already counting trade losses because of aggressive tariff policy, will either harm or shatter economies of some of the neighbours. \nFlight and cargo operation will be costlier and import and exports are likely to face disruptions or may be delayed. But the greatest casualty will be the regional tie that has been under stress for sometime. The India-Pakistan rivalry has made the South Asian Association for Regional Cooperation (SAARC) non-functional. The political non-cooperation has been responsible for rendering the South Asian Free Trade Area (SAFTA), a free trade arrangement within the bloc, equally irrelevant. Now this latest escalation of conflict between the two powerful nation in the region will have its adverse impacts on social, people-to-people and cultural relations as well. The least said about economic and commercial cooperation the better. \nWorld leaders have urged restraint from both sides. The Iranian Foreign Minister Abbas Araghchi has started shuttling between Islamabad and New Delhi to impress upon the leaders of the two nations about the futility of armed aggressions against each other. Meanwhile, the news that Jaish-e-Mohammed confirmed that 10 relatives of its leader Masood Azhar, the architect of terrorist attacks on Indian parliament in 2001and the Taj Hotel in Mumbai, were killed in Indian air strike gives some idea about the objective India had in mind. The fate of Masood who was released from Indian jail in exchange for 155 hostages from a hijacked Indian Airlines plane in 1999, however, is not known. \nUndeniably, terrorist groups from Pakistan have a long history of carrying out operations inside India. This has no doubt soured relations between the two neighbours. Yet war cannot be an option for settling contentious issues. History offers lessons for non-aggression. Adolf Hitler in his demonic theory of \"Final Solution\" wanted to exterminate the Jewish people within reach, not limited to the European continent. The irony is that today, the Jews planted in Palestine from all across the world, are now carrying out one of the worst genocides in human history. \nThus war does not settle things, rather it sows the seeds of future enmity and worse crimes again humanity. The India-Pakistan armed conflict may not be solved right away but at least the two sides should opt for de-escalation of tension and status quo in the interest of their economy and the civilians who will suffer the most in case the war escalates and prolongs. Right now the stakes are high for both countries because the war will push them back by a few years because of the turmoil the global economy is in on account of Trump's indiscriminate and aggressive tariff policy.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "War is no solution, negotiations may find one",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/war-is-no-solution-negotiations-may-find-one-1746722227",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       May 09, 2025 00:00:00  \n\nDhaka, the capital and largest city of Bangladesh, is supposed to be the most developed and well-maintained city in the country. But the reality is quite the opposite. Garbage and faeces are often seen left on roads, footpaths and other open spaces. It is so common that people no longer object to such ugly sights. \nThe authorities concerned pay little to no attention to keeping the roads and footpaths of the capital clean. Almost every other road or footpath is found to be fouled with human faeces, making the whole of Dhaka comparable to a big public toilet and posing serious health and sanitation risks to residents. The lack of public toilets is one of the main reasons for this. As one of the most densely populated cities in the world, there should have been a lot more public toilets. Even where there is one, it is costly to use for the people who barely get to keep themselves fed. Although these public toilets indeed need to be maintained, which costs money, the city authorities should bear most of the cost instead of fully relying on the people who use the toilets. Less fortunate people usually find it more logical to relieve themselves in open places.\nThere is also the fact that some areas of Dhaka, particularly the old parts, still lack a proper sewer system, making many houses release human waste to the drainage system. When it rains or pipelines clog --- a common occurrence in many areas, drains overflow. This not only floods streets but also deposits human waste on the roads.\nAs Dhaka is our megacity, many foreigners come here for various purposes. The sight of piled-up garbage and human waste-filled roads cause a sense of revulsion in them in the process our country's image is seriously compromised. Bangladesh has much more to offer than what the outside world thinks, but they get overshadowed by the negatives, such as these sanitation problems. These make the foreigners think poorly of the people here. The government and all other stakeholders should realise it and take all necessary steps to improve the situation.\nHaving human waste out in the open has many health complications. It contains many harmful pathogens such as E. coli, Salmonella, and parasites. These are very harmful to humans and can cause many diseases, including diarrhoea. People often step on the waste unaware and walk back home, which spreads these pathogens. Birds and insects eat the waste and fly around spreading the pathogens. Some of these pathogens are spread by air too.\nThe authorities need to start paying attention to these issues and take necessary actions to solve them. Building more public toilets, allocating more money for maintaining them, ensuring a proper sewer system and preventing people from using the drainage system as the sewer system are some of these steps. Public toilet charge should be lowered to inspire people to use them instead of relieving themselves in open spaces.\nTaking actions against the people who use the drainage system instead of the sewer system to release human waste is also crucially important. People should be made aware of the negative impacts of defecation in open places and the unhygienic release of human waste and the necessity of prompt cleaning to beat the sanitation issues.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Paucity of public toilets  in a mega city",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/paucity-of-public-toilets-in-a-mega-city-1746722281",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 09, 2025 00:00:00  \n\nBooks are a storehouse of knowledge, a symbol of human values, and a cornerstone of societal progress. Through reading, we not only acquire information but also nurture our thinking, imagination, and analytical abilities. Books open our minds to new perspectives-ones that are vital for both individual growth and the advancement of society. \nFar from becoming obsolete, books continue to offer fresh insights with each reading. Yet today, especially after the completion of formal education, many people abandon books altogether. This troubling trend poses a serious obstacle to the creation of a truly knowledge-based society.\nIn the age of technology, the reading habit is increasingly being replaced by the allure of smartphones, social media, and streaming platforms. Instant gratification has taken precedence over reflective thought, reducing our capacity for deep concentration and critical thinking. This shift is not merely a personal setback; it carries broader implications for society. \nThe gradual disappearance of reading habits undermines the foundations of intellectual and cultural development. Books are not just sources of information, they also preserve our history, culture, and values for future generations.\nReinstating the habit of reading must be a collective goal. From the family unit to educational institutions and wider social initiatives, the value of reading should be continuously emphasised. \nChildren, in particular, should be encouraged to see books as lifelong companions. Simultaneously, the integration of books into digital platforms can help make reading more accessible and appealing to younger audiences in today's digital landscape.\nLosing the habit of reading does not simply mean setting aside books-it signals the erosion of knowledge, culture, and vision. \nTo build an enlightened and thoughtful society, we must bring reading back into our daily lives. Let us renew our commitment to books and, through them, reclaim our shared future.\n\nA. R. Salauddin Ferdous\nStudent \nJatiya Kabi Kazi Nazrul Islam University\nTrishal, Mymensingh.\nferdous5803@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Regaining the habit of reading",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/regaining-the-habit-of-reading-1746722307",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-05-2025"
    }
]