[
    {
        "full_article": "Bihar will vote in two phases, on November 6 and 11, to elect a new Assembly, with counting on November 14. The Bihar Assembly election of 2025 is important not only for political reasons but also for the reasons of electoral integrity in India, which is facing a crisis. The Election Commission of India (ECI) is cognisant of the high stakes in Bihar, and for good measure, the Chief Election Commissioner, Gyanesh Kumar, described it as the ‘mother of all elections’. The ECI also listed 17 measures, beginning with Bihar, that could improve voter participation and public trust in the process. The average number of eligible voters in a polling station will be 819, and the highest number of voters in a booth will now be 1,200 compared to 1,500 earlier. The ECI has also taken into account concerns raised by political parties and other observers about the electoral process. Counting of postal ballots will be complete before the last two rounds of Electronic Voting Machine (EVM) and Voter-Verifiable Paper Audit Trail (VVPAT) counting. If there is a mismatch between the Form 17C and EVM data, and wherever mock poll data had not been erased, the counting of VVPAT slips will be mandatory. Among other measures are mobile phone deposit facilities at polling stations, and a one-stop digital platform named ECINet, for real-time voter turnout updates. Surprising turns in turnout data have been a matter of serious concern in recent elections, and this measure could help clear the air. Live feed from all booths will be available for monitoring purposes.The Bihar election has gained a special national significance this time, with the ECI’s abrupt announcement of a Special Intensive Revision (SIR) of the electoral rolls which began in June. The ECI sees the process as a “purification” of electoral rolls, with plans to have it across the country. In Bihar’s final list, roughly 69 lakh names were removed for reasons such as deaths, unproven citizenship, duplicate entries, or permanent migration to other States. Bihar will be critical for the BJP, the Congress, the RJD and the JD(U), with each party hoping to turn a corner in their journeys. The ruling National Democratic Alliance is at the crossroads with an aging Chief Minister Nitish Kumar who is completing nearly 20 years in office. The BJP may want to formally take over the alliance’s reins but it will have to gauge how this might impact the social dynamics. For the Congress, Bihar will be a test case of its key planks — electoral integrity and social justice. All said, this is one election in which the ECI has the highest stakes, and all those invested in Indian democracy hope to see it come out with flying colours.\r Published - October 09, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Bihar\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        Rashtriya Janata Dal\n                    \n                            /                      \n                        \n                        Janata Dal (United)\n                    \n                            /                      \n                        \n                        National Democratic Alliance\n                    \n                            /                      \n                        \n                        democracy",
        "headline_1": "​Vote of confidence: On the Bihar Assembly Election 2025",
        "headline_2": "Bihar election will be a test case for the neutrality and efficiency of ECI",
        "link": "https://www.thehindu.com/opinion/editorial/vote-of-confidence-on-the-bihar-assembly-election-2025/article70139714.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "09-10-2025"
    },
    {
        "full_article": "It would not be an overstatement to say that metal-organic frameworks (MOFs) have redefined what materials can do for society. These porous crystalline structures are built from metal ions coordinated to organic linker molecules and offer gigantic amounts of internal surface area. Their cavities can be tuned to trap greenhouse gases, harvest drinking water from air, and store hydrogen or methane as clean fuels. As industries confront climate change and scarce resources, MOFs exemplify chemistry’s power to reimagine sustainability, atom by atom. The roots of this year’s Chemistry Nobel Prize, awarded to the developers of MOFs, go back to the 1980s, when Richard Robson, then at the University of Melbourne, wondered whether molecular architectures could be designed rather than found. Inspired by a ball-and-stick model used for teaching, he combined copper ions with an organic molecule whose four ends bore nitrile groups. Contrary to expectations, the ingredients self-assembled into an ordered, diamond-like crystal loaded with empty cavities. Susumu Kitagawa, working in Japan, picked up on the same spirit and made a breakthrough in 1997 when he built a 3D framework of cobalt, nickel or zinc ions linked by bipyridine molecules. When drained of water, the framework remained intact, allowing the gaps between its atoms to hold and release gases as required. In 1998, he also proposed that MOFs could be made of soft solids that ‘breathed’ as other molecules moved in and out.Meanwhile in the U.S., Omar Yaghi was dissatisfied with the trial-and-error of conventional reactions and pioneered reticular chemistry, with which he assembled predetermined building blocks into ordered networks. His first frameworks, reported in 1995, were robust two-dimensional nets. By 1999 he unveiled MOF-5, a zinc-based cubic lattice with extraordinary stability and surface area. A few grams contained the internal area of an entire football field. His approach allowed entire families of related MOFs to be designed systematically. Thus, Robson, Kitagawa and Yaghi established a new grammar of matter that allowed others to create thousands of MOFs, some of which moved from prototypes to industrial reactors and semiconductor manufacturing lines. The road ahead is even more promising but also exacting. Researchers are still working to make MOFs more durable in real-world conditions and cheaper to produce at scale. Integrating them into batteries and catalytic filters, for instance, requires engineering as finely tuned as their chemistry. For all these achievements, however, the vision honoured this year transcends any single material. By showing that chemistry can design empty space as precisely as solid matter, the laureates built room not only for molecules but for imagination itself.\r Published - October 09, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        award and prize\n                    \n                            /                      \n                        \n                        chemistry\n                    \n                            /                      \n                        \n                        greenhouse gases\n                    \n                            /                      \n                        \n                        pollution\n                    \n                            /                      \n                        \n                        water\n                    \n                            /                      \n                        \n                        green technologies\n                    \n                            /                      \n                        \n                        climate change\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        Japan\n                    \n                            /                      \n                        \n                        USA",
        "headline_1": "Infinite boxes: On the 2025 Chemistry Nobel Prize",
        "headline_2": "The Chemistry Nobel laureates established a new grammar of matter",
        "link": "https://www.thehindu.com/opinion/editorial/infinite-boxes-on-the-2025-chemistry-nobel-prize/article70139732.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "09-10-2025"
    },
    {
        "full_article": "Investors spooked by Trump’s policies have sought safety in gold, but expecting an endless rally would be a mistake\nGold crossed the $4,000 per ounce milestone this week. That’s over ₹1.2L per 10g in Indian market terms, an all-time record. The world’s 7.2L centenarians will remember a time when an ounce – 28.3g – used to be worth $20.7. In fact, this rate largely held steady for a century from 1834 to 1934, when it was raised to $35 and maintained for the next 34 years. Gold was a stable commodity then, and a stabilising influence on the global economy. Now, it’s a hedge, which explains why its price soars at the first sign of trouble.\nThat sign this year is Trump – born in the $35 era and now going on 80. Gold was at $2,700 on the day he was sworn in eight months ago, so it’s gained about 50% already. It hit $3,000 in March when Trump amped up talk of tariffs and spread uncertainty, and has crossed $4,000 now amid delayed US financial data and a US govt shutdown. Goldman Sachs sees it hitting $4,900 by Dec next year – over ₹1.5L per 10g.\nOf course, predictions are based on assumptions and shouldn’t guide action. When gold went from $38 per ounce in 1972 to $850 in 1980, financial advisers would have egged you on to buy more of it. But by 1999, it had crashed to $251. In 2022, gold tumbled from $2,000 to $1,600. What Trump does next will certainly determine gold’s trajectory, but unexpected events can overtake him and the rest of us. Gold crossed $1,000 amid the 2009 financial crisis, and $2,000 during the pandemic. Both times, fears of inflation from massive govt stimulus spending – over $20tn in the first five months of the pandemic – started the dash for the safety of gold.\nLarry Summers, US treasury secretary under Clinton, said investors rush to gold “when they don’t have confidence in the people who are managing the country”. But Trump’s ad hoc policy-making is affecting confidence beyond US borders. That’s why central banks have been lapping up gold too. As savers and investors, the thing to remember is that the surge in gold’s price isn’t organic. Gold is a haven, yes, but this mad rush could end in a stampede.\n\n",
        "headline_1": "Shine Language",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/shine-language/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-10-2025"
    },
    {
        "full_article": "Indians are racing to the new weight loss drugs like they did to processed foods. Who’s telling them it’s a vicious circle? \nEvidently, it’s not just the celebrities. Past months have seen many of them shed the kilos so dramatically that they just can’t convince peeps that it’s not because of the new weight loss drugs (WLDs), no matter how much they deny it. Yeh jo public hai ye sab janti hai, as the song goes. Now it seems that a lot of this speculation may be informed by first-hand experience. So briskly have Indians taken to Mounjaro that this injectable weight loss therapy has seen 42% and 60% kind of m-o-m growth since its March launch. It’s now looking set to displace our pharma market’s long-standing market leaders (an antibiotic and an anti-diabetic). But this WLD, starting at an average monthly cost of ₹14,000, is a pricey fad. Also a worrying one. \nIndians have acquired mass obesity within a generation. Its core explanation is no different than America’s, although we have shortened their timeline on this just as we seem to be doing with the WLDs. As Johann Hari writes in his sobering Magic Pill, we began to eat foods that didn’t exist before – “designed by the food industry to be maximally addictive, pumped full of just the right proportions of sugar and salt and starch to keep us chomping”. Only, alongside embracing America’s chips and colas, it feels like India’s now eating more samosas and jalebis in a day than previous generations got in a year. Ideally, the magic pills, which are actually weekly injections, should be carefully prescribed to patients who really need them to battle diabetes, heart disease, or other serious cousins of obesity. Instead, reports make it clear that the doctors are shilling these WLDs with little care or caution. \nNext year, when the patent for semaglutide, the active ingredient in major WLDs, expires in India, and their prices accordingly do a generic drop, their uptake may shoot up abnormally. Shouldn’t doctors and regulators be ready for that? Not just all the nausea, vomiting, diarrhea, constipation, loss of muscle mass that we already know about, but also the side-effects that we don’t yet know. In the face of a titanic drug industry plug, public health advice shouldn’t go AWOL. \n\n",
        "headline_1": "Stranger Things",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/stranger-things/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-10-2025"
    },
    {
        "full_article": "Fly to the moon, but the road’s still cratered  \nMumbai got a new airport yesterday at Navi Mumbai. All nice-nice, chakachak.  Delhi too will get a second one at month-end. That hawai adda is not at any Naya NOIDA, but ki farak painda? With both we’ll soar into global aviation’s stratosphere. Provided we don’t miss the flight thanks to down-to-earth jams. Fancy new infra gets jilted by plain old truth: What the big print giveth, the small print taketh away. \nLast week Shri Eknath Shinde was ‘in conversation’ with Shekhar Gupta. Hon Dy CM, Maharashtra, listed the goodies laid on and to be laid on by his Mahayuti govt. He still has clout even though he’s no longer CM, but plays half-second fiddle, along with Ajit Pawar, to his former DCM, now-CM, Devendra Fadnavis. This arrangement looks as convoluted as our daily detours thanks to these projects which will make our rashtra maha again. MMGA.\nSo what if every big-small road looks like it has committed hara-kiri, making it suicidal to get anywhere? Bhau, bund kar re kitkit. Means, it’s because so much infra is in the pipeline. Yes, yes, I know this also means a dash to that new  airport could be a pipe dream.\nShinde-saheb told us it will take just 40 minutes to get from South Bombay to the new airport via the 21.8km Atal Setu. No, our DCM wasn’t spinning a yarn. SoBo-ites can certainly zip to this transharbour bridge via other engineering marvels like Coastal Road, Sea Link and under-construction Worli-Sewri Connector. But, they still swear it out at bottlenecks choking the entry and exit of first two, and godknows when third will be complete. Dilliwalas will suffer same. Last month weren’t they stuck forever on clogged NOIDA expressway? \nSo close I’m living to Atal Setu means I can reach Navi Mumbai in minutes only. Pann bhau, my work is all in purani Mumbai, and that ride takes over an hour because of long-long jams and no buttered zipways! Maybe I should go only where new airport will fly me.                                \n                                  ***\nAlec Smart said: “Has SIR set the Bihar test paper?”\n\n",
        "headline_1": "Infra-Redlight",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/infra-redlight/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-10-2025"
    },
    {
        "full_article": "Prashant Kishor has outsider appeal against the culture of bakaiti (idle talk) shored by complex local networks. But is his idiom of productivity & personal betterment only a sales trick?\nIn this election cycle in Bihar, few have drawn as much curiosity as Prashant Kishor. After a decade crafting electoral wins for others, he now seeks one himself. His padyatra has been a feat, covering 2,697 villages across 235 blocks in 665 days. It has inspired both fascination and fatigue. And overall, his rise reflects a deeper churn in Bihar’s democracy.\nRead full story on TOI +\n\n",
        "headline_1": "PK’s Un-Bihari pitch",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/pks-un-bihari-pitch/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 09, 2025 00:00:00  \nBefore delivering a new and obviously higher pay scale for employees in government service, the National Pay Commission (NPC) has brought civil servants' tax privileges under the scanner. It has asked for a report from the National Board of Revenue (NBR) on the tax privileges granted to the bureaucrats. As many as 2.4 million officials in government service are enjoying tax waiver. They are required to pay taxes on their basic salaries and festival bonus only while private sector employees have to do this on their entire incomes. This is logically indefensible and also unconstitutional. Article 27 of the Bangladesh Constitution guarantees equality of all citizens and their right to equal protection of the law. There are numerous privileges and perks for officials and employees in the public service to enjoy. But this one is quite exceptional. Civil servants in India and the United Kingdom (UK) have to pay taxes on their salaries similar to private sector employees. In the UK, they also pay like other employees the National Insurance Contributions (NICs) at the same rate. \nThis should not be any different in case of Bangladesh. With transparency and accountability often missing from governance, this kind of political pampering only makes the public service murkier. Taxable earnings by individuals irrespective of the sectors cannot enjoy undue waivers. Discriminatory provisions are divisive and widen inequality in society. The economic repercussion of a higher pay scale for government employees is not confined to money only. What compulsion the interim government felt to offer a higher pay scale for government employees is best known to it. At a time when the private sector is facing unprecedented challenges and factories and industries are terminating employees following the turmoil in international trade caused first by Russia-Ukraine war and then by Donald Trump's reciprocal tariff, the new pay scale is likely to destabilise the market further. Purchasing power parity for private sector employees will erode. \nSo, a review of the tax privilege enjoyed by government officials is logical. The money for the pay hike will come from taxpayers. So the earnings by public sector employees must be treated like those of private sector employees. In the post-pandemic period, many in the private sector lost their jobs or were forced to accept a lower pay package. The population living below poverty line has gone up from 18.7 per cent in 2022 to 28 per cent currently. With this favour of higher pay package, market will get jittery and more people will slide below the poverty line. \nAgainst such stark reality, the tax waiver for the privileged government employees is mindless. They must contribute to the exchequer in return for the pay hike. Raising salaries for public sector officials is a needless exercise. The ratio between lower grade and higher grade could, however, be narrowed down. This called for raising salaries for some of the lower grades without affecting the higher slabs of the pay scales. Such employees do not earn enough to qualify for tax return. But the government is adamant to go ahead with its programme for raising salaries of all government employees. The NBR fails to fulfil the target of revenue earning. In this respect, the International Monetary Fund's opposition to tax waiver for civil servants should be taken into account.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Reviewing bureaucrats' tax privileges",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/reviewing-bureaucrats-tax-privileges-1759938819",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       October 09, 2025 00:00:00  \nBangladesh has witnessed an exponential growth of universities during the one and a half decades tenure of the ousted Awami League government. During this period, 87 universities, both public and private, were established, raising the total number of universities to 170 (55 public and 115 private). Regrettably, many of these are universities in name only, operating from rented buildings and suffering from chronic shortages of teachers, staff, and essential resources even a decade after their inception. Worse still, it has recently emerged in the media that ecologically sensitive areas, including parts of the Chalan Beel in Rajshahi and the haor region in Sunamganj, have been earmarked for permanent campuses of certain universities, which would inevitably cause an ecological disaster. \nThus, like many other sectors, the education sector too is in crisis due to the establishment of one university after another under political consideration, not to mention the problem of mismanagement and corruption. The interim government was expected to address these longstanding issues. In fact, several universities established by the previous government have been performing so poorly that, after the formation of the interim government, educationists proposed merging weaker institutions both in the private and public sectors to preserve the overall integrity of higher education.\nHowever, in an apparent bid to appease graduate and postgraduate students of seven government colleges in Dhaka, the government has initiated the process of establishing yet another public university, named Dhaka Central University. But the developments regarding the establishment of the university are quite frustrating. \nFirst and foremost, the establishment of a new university necessitates discussion among stakeholders for well-thought-out planning regarding its academic, financial and logistical aspects. Graduate and postgraduate students of the seven colleges had long been demonstrating for the establishment of a separate university, alleging discrimination by the Dhaka University authorities. Their colleges were hastily affiliated with Dhaka University by the Awami League government in 2017, a move that many students claim has caused academic and administrative complications. Surprisingly, while Honours and Master's students had been demanding a university, HSC students enrolled in some of these colleges and BCS Education Cadre officers appointed in these colleges had remained silent. But as soon as the government announced its plan to set up the university, they began protesting against it.\nSo, three main groups are at play here: Honours and Master's students, BCS education cadre officers, and higher secondary (HSC) students. The demand of HSC students is clear: whether or not a separate university is formed, HSC programmes in their respective colleges must remain unchanged. Meanwhile, the roughly 1,500 BCS education cadre officers are more concerned about their service benefits.\nAs per the draft of the Dhaka Central University Ordinance 2025, unlike the current system, not all subjects will be taught at every college. Instead, the seven colleges will be divided into four schools: Dhaka College, Eden Mohila College, and Begum Badrunnesa Mohila College for the School of Science; Government Bangla College for the School of Arts and Humanities; Government Titumir College for the School of Business; and Kabi Nazrul Government College and Government Shaheed Suhrawardy College for the School of Law and Justice. The new university will be run in a 'hybrid model' as it will hold 40 per cent of classes online and 60 per cent in person, though all exams will be conducted physically.\nAccording to the plan, the colleges that offer higher secondary education will continue to run those programs, and education cadre officers will also remain. However, once it becomes a fully-fledged university, teachers will be appointed according to the university's recruitment policy, and existing teachers can apply if they wish. \nThe teachers' demands included the incorporation of a provision in the ordinance that the BCS general education cadre members will be appointed to all administrative and teacher positions. No changes in names or structures of the colleges or any faculty or school will be made, keeping all movable and immovable properties, including logos of the colleges, intact and no changes in the ownership of those assets under the proposed university will be allowed. Also, there will be no introduction of any new subjects. Any existing subject specially Arabic and Islamic studies taught at the colleges will not be excluded. They proposed establishment of the university at separate location if necessary.\nSecondary education in these colleges will not be affected if it is run under separate administration. But the question is: why are the teachers opposing the formation of the university? Are the reasons cited in the list the real, or is there any hidden agenda? One would expect them to be pleased, because even if not all, many of them would have become university teachers. Besides, decisions about which subjects will be taught and who will be recruited as teachers and officers at a university certainly should not be determined by street protests. In fact, none of the protesting teachers' jobs are at stake here. If the new university does not offer courses in their subjects, at most they would be transferred to other government colleges. It is unimaginable that, just to satisfy their narrow interests of keeping posted in Dhaka and enjoy other perks and privileges, they are objecting to the creation of a new independent university. Amidst the unchecked growth of private universities and rising educational expenses, if the seven large colleges in Dhaka can be truly revamped by integrating them into one university and offer quality, affordable higher education, it deserves support \nfrom all.\naktuhin.fexpess@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Dhaka Central University deserves support from all, not opposition",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/dhaka-central-university-deserves-support-from-all-not-opposition-1759939015",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 09, 2025 00:00:00  \n\nUnemployment is a serious problem for many recent graduates in Bangladesh. The numbers show that the overall unemployment rate rose to 4.63 per cent in late 2024, up from 3.95 per cent the year before. The situation is even more challenging for university graduates, with a 13.5 per cent unemployment rate in 2024. These figures represent many young people who face frustration and social pressure after years of study and effort.\nThis leads to an important question: what can universities do to help solve this problem? Is it enough to just give out degrees, or should they also help students as they move into the job market? I believe universities can and should do more. While they cannot solve unemployment for every graduate, they can create opportunities that encourage motivation, innovation, and self-reliance.\nOne practical idea is to hold a Startup Idea Competition every two years for final-year students and recent graduates. The university could choose the top three or four teams and give them initial funding and mentoring. Support should go beyond just prize money. Universities could also offer things like co-working space on campus, free publicity, and promotion through their official social media. This would help students gain the confidence and resources to turn their ideas into real businesses.\nOf course, questions about accountability and transparency naturally arise. To address this, universities could require funded teams to submit progress reports on a regular basis, such as every two weeks or monthly. This kind of monitoring would ensure that financial support is being used effectively and that startups remain on track.\nThese kinds of programs could have a big impact over time. As student-led startups grow, they could hire new graduates and help reduce unemployment. They might also return the seed funding to the university. Later on, successful alumni could give back by mentoring new students, investing in fresh ideas, and helping to keep a culture of innovation alive on campus.\nIn short, universities should not only produce graduates but also nurture job creators. By investing in startup ecosystems, they can empower young people to transform unemployment into opportunity. The journey from classroom to company may not be easy, but with the right support, it is possible. And perhaps, this is the most meaningful way our universities can prepare students for the future.\nMishutuBaruaPunna\nStudent\nESM, North South University\nmishutu.barua@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Seeding startups, fighting unemployment",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/seeding-startups-fighting-unemployment-1759939039",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 09, 2025 00:00:00  \n\nNon-communicable diseases (NCDs) now account for 70 percent of deaths worldwide, with 80 percent occurring in many developing countries. Advances in medical science have made infectious diseases such as cholera, diarrhea, smallpox, tuberculosis, and measles largely preventable and treatable. Safe water, nutritious food, medical treatment, vaccination programs, and public awareness have increased life expectancy globally.\nHowever, like other countries, Bangladesh is witnessing a sharp rise in NCDs, including age-related diseases, heart disease, stroke, diabetes, osteoporosis, osteoarthritis, high blood pressure, cancer, and mental illness. Heart disease alone accounts for 17 percent of NCD-related deaths, with 82 percent occurring in low- and middle-income populations. Its treatment is often long-term and expensive, placing a heavy burden on ordinary and middle-class patients.\nThe heart, the body's most vital organ, is profoundly affected by lifestyle. Excessive smoking, prolonged sitting, lack of exercise, and consumption of fatty foods lead to fat accumulation and narrowed arteries. Heart attacks can occur when blood flow is partially or completely blocked, depriving the heart of oxygen.While government initiatives are important, individual awareness is equally crucial in adopting healthier habits to take preventive measures.\nAshikujaman Syed\nsyedashikujaman@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Heart health: A growing concern",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/heart-health-a-growing-concern-1759939057",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-10-2025"
    }
]