[
    {
        "full_article": "The first phase of Bihar’s Assembly elections on Thursday (November 6, 2025) witnessed a heartening democratic statistic — an impressive voter turnout across 121 constituencies. Provisional estimates have placed the figure at 64.69%, which may rise further as complete data emerge from all polling booths. These same constituencies have consistently recorded turnouts between 55.4% and 55.85% across the last four polls — Assembly and general elections. The nearly nine percentage point jump signals a reinvigorated engagement with the electoral process. The numbers reveal a more compelling story. Despite the Special Intensive Revision (SIR) process reducing registered electors from 3.88 crore in the 2024 general election to 3.73 crore now, the actual voter count surged from 2.15 crore to a provisional 2.42 crore. Predictably, the ruling coalition has rushed to attribute the surge to popular welfare schemes, framing it as pro-incumbency sentiment, while the Opposition has interpreted it as anti-incumbency fervour and a hunger for change. However, drawing definitive conclusions from turnout figures alone would be premature.Academic studies have shown that there has been little correlation between increased voter participation and anti- or pro-incumbency in Assembly elections. But disaggregated data could offer insights. A spike in women’s participation might validate the impact of cash transfer schemes implemented on the eve of the elections by the Nitish Kumar-led government. Conversely, increased youth voting could reflect a yearning for change in a State where unemployment and large-scale migration remain persistent concerns. But the Election Commission of India (ECI) has not yet released gender-based turnout data, leaving such analysis in the realm of speculation. What seems indisputable is that the heightened discourse around the SIR process played a role. The Opposition’s Voter Adhikar Yatra and sustained focus on voter roll issues appear to have sensitised citizens about the sanctity of their franchise. A day before polling, the Leader of the Opposition in the Lok Sabha, Rahul Gandhi, raised concerns about electoral roll discrepancies in Haryana, alleging inadequate action by the ECI. Bihar’s first-phase turnout offers an instructive lesson: concerns about electoral processes are most effectively addressed not merely through criticism but by mobilising organisational machinery to educate and energise voters about registration and participation. The Congress and other Opposition parties would do well to channel their apprehensions about electoral integrity into systematic grassroots work that empowers citizens to claim their democratic rights — a strategy that could possibly yield tangible results at the ballot box while strengthening democratic institutions. Published - November 08, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        General Elections 2024\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        unemployment\n                    \n                            /                      \n                        \n                        migration",
        "headline_1": "​Turnout bump: On the Bihar Assembly elections, first phase",
        "headline_2": "Voter awareness clearly surged following the SIR controversy",
        "link": "https://www.thehindu.com/opinion/editorial/turnout-bump-on-the-bihar-assembly-elections-first-phase/article70253281.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "09-11-2025"
    },
    {
        "full_article": "The U.S. federal government shutdown has entered its 39th day, making it the longest such closure in American history, with a sharp impact on nearly 1.4 million federal employees who have been furloughed without pay, not to mention countless more affected by the suspension of a range of public services. The latest blow to the American public came on the heels of an announcement that major U.S. airlines would be reducing flights at more than 40 airports this week owing to a shortfall in air traffic controllers, leading to a heightened threat to air safety. The shutdown has also crippled normal functions in food and nutrition benefits including food stamps for the poor, early learning programmes for low-income families, services related to the Internal Revenue Service, national parks and social services. At the heart of the debate that led to the congressional stalemate was the expiration of subsidies for health insurance premiums purchased via the Affordable Care Act marketplace. At this point there would appear to be a glimmer of hope for resolution of the partisan logjam as the Senate is expected to vote on an amended budget bill following Republicans presenting a fresh proposal, which includes a short-term stopgap funding measure. Also bundled is a potential one year of fiscal support for food assistance, veterans affairs and military construction.However, the deeper malaise of bitter polarisation in the political discourse persists, even if painful shutdowns come and go. Mr. Trump certainly bettered his first term election victory when he galloped into the White House in 2024. Despite the “red shift” that handed him a win in every swing State last year, liberals and progressives have certainly not thrown in the towel; rather, they have regrouped to make a strong showing in the recent mayoral, gubernatorial and other State-level elections. At stake are the most poignant of policy issues impacting ordinary Americans, including jobs, tariffs and inflation, but also pressing questions on immigration, health care and education. While it is only to be expected that American society, known for fiercely guarding the rights guaranteed in the Constitution’s First Amendment, will regularly and vociferously express divergent views on these critical subjects, the substantive core of good governance will be lost to many unless the spirit of bipartisanship flickers once again amidst the shambles of congressional dysfunction. In this context the debilitation wreaked by the ongoing shutdown only shows that there is a need for a new normal in U.S. politics, a humane, pragmatic middle path between unbridled Trumpism and the old world of progressive America. Published - November 08, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        government\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        air transport\n                    \n                            /                      \n                        \n                        food\n                    \n                            /                      \n                        \n                        nutrition and diet\n                    \n                            /                      \n                        \n                        personal income\n                    \n                            /                      \n                        \n                        family\n                    \n                            /                      \n                        \n                        health insurance\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        immigration\n                    \n                            /                      \n                        \n                        health\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        inflation and deflation\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        aviation safety",
        "headline_1": "Shutdown showdown: On the U.S. federal government shutdown",
        "headline_2": "Unbridled Trumpism has reduced any space for bipartisan cooperation",
        "link": "https://www.thehindu.com/opinion/editorial/shutdown-showdown-on-the-us-federal-government-shutdown/article70253341.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "09-11-2025"
    },
    {
        "full_article": "Chairman of Adani Group, writing on the Google-Adani project to build an AI and data centre complex in Visakhapatnam, argues India will benefit at multiple levels & all data will be kept here\nThe $15bn partnership between Google and the Adani Group to develop India’s largest AI and data centre hub in Visakhapatnam represents a fundamental shift in how we think about national infrastructure. This is not simply an investment, it is a strategic move to position India at the centre of the global AI economy.\n\nNew pillars of sovereignty | In the 20th century, nations built their power on ports, railways and electricity grids. These remain essential, but the 21st century demands a new foundation: energy, data, and ‘compute’. Control over these resources is no longer optional, it is fundamental to economic independence and technological self-reliance.\nRead Full Story on TOI+\n\n",
        "headline_1": "‘Making India global AI hub’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/making-india-global-ai-hub/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-11-2025"
    },
    {
        "full_article": "That many women today can pursue men they like, reversing centuries-old dictum that men should chase & women should be chaste, is arguably the most fundamental demonstration of gender equality\nLust is not gender-based. Until recently, however, men and women had to follow different manuals. Both macho brags and mothers’ dire warnings pointed to the same norm: The male had to go out and seduce while the female waited for the kiss of true love.\n\nWith birth control iffy and abortions illegal, only marital sex got a thumbs-up, which was for the grim purpose of filling up the world. Anything else was taboo and came with statutory warnings.\nRead full story on TOI+\n\n",
        "headline_1": "Why so much changes when she makes the move",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/why-so-much-changes-when-she-makes-the-move/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-11-2025"
    },
    {
        "full_article": "By Narayani Ganesh\nThe Gita, Buddhist and other faith teachings say that anger is one among the three poisons, the other two being ignorance and desire, the primary sources of suffering and distress. Why do we get angry? There are many reasons why we fly off the handle. Basically, it all boils down to how well we are able to acknowledge our emotions and keep them in control so that they do not go haywire.\nTo control negative emotions does not mean to suppress or ignore them, but to acknowledge their presence, befriend them and ensure that they do not propel one to destructive thought and action. That is, we need to cultivate the art of mindfulness, which will help us stay calm and avoid rashness that may lead to violence and perhaps, regret. Vietnamese Buddhist monk Thich Nhat Hahn would say that mindfulness recognises anger, is aware of its presence, accepts and allows it to be there – once we recognise our anger, we embrace it…. And things are bound to change (for the better).\nAnger is also perceived as a source of powerful wisdom. “In its pure, awakened form, when it is not driven by ego, anger brings good to the world. It can be, for example, the energy that inspires great movements for freedom and social justice, or the force that helps us simply say, ‘No!’ to actions that cause suffering,” says Lion’s Roar editor-in-chief Melvin McLeod. But the tricky part is to know when to rein in that anger so that it does not turn around and become harmful to us and others. For this, one has to cultivate the art of knowing when to stop; when to cool down and knowing how and when to convert the powerful steam released by anger into a force that can fuel positive action. What was poison can be transformed into becoming an antidote to suffering.\n\nAtherapist once advised a frustrated, angry young woman to vent her anger by smashing dinner plates. Others advise to let it all out by shouting or swearing. But all of these only aggravate the negative feeling; giving expression in acts of aggression that may now seem harmless could later manifest as violence in more serious situations.\nYou cannot overcome negative emotions by indulging in negative acts of aggression. The answer is, to understand why you are so angry and try and work around that. If it is because someone has wronged you or you lost your job, your lover, your finances, your health, then smashing dinner plates is not going to help deal with your situation.\nLearning and practising deep breathing and meditation could help immensely. These will also help clear mind clutter and enhance your capacity to think with clarity and purpose, so that you chalk out a plan, step-by-step, for doing things that could make your situation better. To right a wrong, committing another wrong does not work. One has to make a conscious effort to see life from a wider perspective and come to terms with the fact that what you are going through right now is just a passing phase.\nThere is a lot of truth in the saying, “This too shall pass.” Befriend anger and frustration, and cultivate loving kindness, first towards yourself and then towards others. Anger will then fly out the window.\nganeshnarayani@yahoo.com\n\n",
        "headline_1": "Smashing dinner plates is not a solution",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/smashing-dinner-plates-is-not-a-solution/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-11-2025"
    },
    {
        "full_article": "But bosses running bigger cos don’t demand homage\nElon Musk moved closer to the first trillion-dollar pay package on Thursday. He’s already worth $491bn, as of Friday afternoon, and growing valuations of his major companies – Tesla, SpaceX, xAI – could make him the first trillionaire with his current stakes well before the promised $1tn. The prospect of a man possibly worth $2tn, or even more – larger than the revenue of many big companies – in a few years is mind-boggling.\nHow can one man be worth so much, many have asked. But 75% of Tesla’s stock – of which Musk is the single biggest holder – backed the proposal to give him 424mn new shares, doubling his stake in the company, if he meets certain goals over the next 10 years. These include selling 20mn cars – not difficult, considering current sales of 1.8mn a year – and raising Tesla’s market value to $8.5tn, from $1.4tn currently. That sounds tough, but recall how he won shareholder approval for a controversial $56bn bonus in 2018, contingent upon Tesla’s market value touching $650bn over 10 years. Tesla hit trillion-dollar valuation in Oct 2021.\nMusk may do the impossible again. What’s in question, though, is not the possibility but the desirability of his reward. Nvidia, Apple, Microsoft, Alphabet and Amazon are all significantly bigger than Tesla but their chiefs don’t demand the kind of homage that Musk does. Yes, he’s invested in Tesla like nobody else – 15 years ago he pumped his own $35mn to pull it from the brink of bankruptcy – but Satya Nadella, Sundar Pichai and Tim Cook have done more for their shareholders without Musk’s theatrics. In fact, Musk has been a liability for Tesla of late. Last month, a Yale working paper estimated that his abrasive politics had cost Tesla 1mn car sales. He’s promised cheaper EVs, then robotaxis, and now autonomous robots, without delivering, while Chinese rival BYD has stolen a march. Perhaps, the promise of a trillion dollars will make him pull himself and Tesla together.\n\n",
        "headline_1": "Muskular Pay",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/new-in-toi/muskular-pay/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-11-2025"
    },
    {
        "full_article": "It is surprising to learn that the Dhaka North City Corporation (DNCC) has begun constructing a ward office occupying the footpath and a part of the Pragati Sarani near Baridhara point. According to a report, the DNCC initially planned to set up a garbage depot at the site but changed the plan after protests from residents. Later, it decided to turn the spot into an office for the corporation's employees at ward 18, ignoring complaints about the footpath's occupation and its impact on traffic and pedestrian movement.\nWhile we grew accustomed to seeing such protector-turned-violator conduct by public institutions during the Awami League rule, its recurrence now shows that authoritarian tendencies still persist. The site in question is one of the busiest stretches of road in the Baridhara diplomatic zone. Building on a public right of way by cutting down trees, pouring concrete, and installing pillars—without any impact assessment on traffic or pedestrian safety—is not just a case of bad judgement; it is a violation of the very idea of public space. We must also ask, if the corporation itself starts grabbing roads and footpaths, what moral authority does it retain to act against the many encroachments that choke Dhaka every day?\nWhile talking to this daily, an urban planner has rightly termed the DNCC move as \"equivalent to committing a crime.\" He pointed out that DNCC could have rented a space temporarily while exploring more viable long-term options. But instead of choosing a rational path, it is opting to occupy a public road. When asked, the DNCC administrator has said that he does not support any establishment there, and that DNCC is searching for an alternative location for both the garbage depot and the office. But he has not clarified whether the current project has been shelved. Clearly, this is not just an encroachment problem; it is also a governance problem. A government agency cannot simply break the law it is mandated to enforce.\nWe, therefore, call upon the DNCC to immediately suspend the construction, reopen the footpath, and restore the road to public use. If there has been abuse of power by any official or contractor, it must also be investigated. The corporation must decide where the office will go through a transparent process, based on urban planning norms and community consultation. As things stand, Dhaka's road space is already among the most scarce in the world. The DNCC or any other state agency must not exacerbate the problem, and must demonstrate, through action, that the era of arbitrary abuse of public space is over.\n",
        "headline_1": "Halt construction on Pragati Sarani",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/halt-construction-pragati-sarani-4029376",
        "news_paper_name": "The Daily Star",
        "publish_date": "09-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 09, 2025 00:00:00  \nA sudden swing from officially reported positive asset values to a declaration of deeply negative net worth is no routine accounting adjustment. Yet the speed with which this emerged during the merger of the five troubled Islamic banks has raised serious concerns about the credibility of financial reporting and regulatory oversight. Only a day before the Dhaka Stock Exchange suspended trading in their shares, Bangladesh Bank disclosed this sharply negative Net Asset Value in direct contradiction to the most recent financial statements of the banks. Until very recently, those statements showed positive asset positions and were formally submitted to the stock exchange where the five banks continued to trade. Small investors had every reason to rely on these officially approved disclosures, since listed companies are required to report according to strict standards and their submissions are vetted by the securities regulator. The abrupt assertion that the real net asset positions were not only weak but entirely eroded means that shareholders were operating in an information environment where critical information was withheld. Suggesting compensation now, as the central bank did for small investors, amounts to a tacit admission that, yes, a catastrophic failure has indeed occurred within the chain of financial governance. \nThe merger of troubled banks may well have been unavoidable. Years of excessive lending to connected parties, outright plunder through fraudulent transactions and poor recovery performance had hollowed out loan portfolios, with three banks carrying doubtful loan ratios above 90 per cent. The Bank Resolution Ordinance provides a necessary legal framework for such severe distress, and its primary goals of protecting depositors and safeguarding financial stability are entirely reasonable. However, these stability measures cannot override the rights of shareholders who invested legally and in good faith. Majority of these investors are not insiders or controlling families. They are ordinary citizens who saved from salaries or business income and invested through an exchange regulated by the state. To have their investments nullified based on a sudden, contradictory disclosure from the central bank is to penalise the victims rather than the perpetrators. \nClarification on whether shareholders would retain any value from their investments should have been provided well before the trading halt and the formalisation of the merger. If the net asset value was indeed negative, a timely disclosure would have allowed investors to make informed decisions, however difficult, and would have prevented new investors from buying shares on the basis of outdated and overstated figures. A market-driven decline, even a sharp one triggered by such a revelation, would at least have reflected the sober judgment of an informed public. Instead, investors bought and held shares on the strength of information that now appears misleading. This transparency failure demands accountability from all parties responsible for supervision and disclosure, not only from those who mismanaged the banks. \nThe Bangladesh Bank's statement that the government may consider compensation for small investors is therefore a necessary acknowledgment of duty, not a concession. Such compensation is not intended to eliminate all losses but to address the gap between the banks' true financial position and what investors were led to believe. Small investors do not have access to internal audits or special inspection reports. They must rely on published accounts that are supposed to be reviewed by auditors and examined by regulators. If those accounts did not reflect the real state of the balance sheets, the responsibility does not lie with individual shareholders. As this experience has shown, allowing distorted statements to persist until a crisis struck inflicts demonstrable harm. If the state truly encourages investment in the capital market and oversees the institutions listed there, it must take full responsibility to ensure that investors receive a truthful and complete picture.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ensuring justice for small investors",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ensuring-justice-for-small-investors-1762613009",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       November 09, 2025 00:00:00  \nThe decline in global foreign direct investment (FDI) in the first half of the current year is not unexpected, even if it is undesirable. A tariff war initiated by US President Donald Trump has intensified global trade tensions in the first half of 2025. During the period, the world also went through geopolitical uncertainty, mainly as the Russia-Ukraine and Israel-Hamas wars continued. To contain inflationary pressure, some central banks also increased interest rates in the first half of the current year. These three broad factors drove investors to be cautious, resulting in the decline in FDI, according to the latest Global Investment Trends Monitor of the UN Conference on Trade and Development (UNCTAD). \nReleased last month, the report showed that global FDI stood at $737 billion in the January-June period of the current year, which was three per cent lower than the half-year average of 2024. Last year, global FDI stood at $1508 billion, recording a modest rise of 3.70 per cent over the total world FDI in 2023. The modest increase in FDI last year was mainly due to volatile financial conduit flows through several European economies, which often serve as transfer points for investments. If the conduit flows were excluded, world FDI last year dropped by 11 per cent, as pointed out by UNCTAD.\nAgainst the global trend, FDI in Bangladesh surged by 61 per cent in the first half of the current calendar year. Statistics available with Bangladesh Bank showed that the net inflow of FDI reached $1091 million in the January-June period of 2025, which was $594.73 million in the last half of 2024. The amount was $675.66 million in the first half of 2024, a decline of 8.70 per cent from $739.80 million in the last half of 2023. \nThe jump in net FDI in the first half of the current year is a record in recent years, and the surge helped to post a 19 per cent rise in the inflow of net FDI in the last fiscal year (FY25), when net inflow of FDI stood at $1686.24 million against $1415.46 million in FY24.\nThe fiscal year in Bangladesh is constituted on a July-June basis. In other words, the last half of a calendar year and the first half of the following calendar year constitute a fiscal year. For instance, July-December or the last half of 2024 is the first half of FY25 and January-June or the first half of 2025 is the latter half of FY25. \nThe FDI in the last fiscal year posted the second-highest annual inflow of foreign direct investment in the country in recent years. Bangladesh Bank statistics showed that net FDI reached $1710 million in FY22, which was the highest amount in recent years, between FY19 and FY24, to be precise. \nRegarding the latest surge in FDI, the Bangladesh Investment Development Authority (BIDA) issued a press statement stating that the record 19 per cent surge in FDI in the first year after the mass uprising set a different example in the global context. The investment promotion agency stated that countries typically experience a decline in foreign investment following a mass uprising or revolution. \n\"Bangladesh's post-uprising FDI growth stands in sharp contrast to a selection of other nations that experienced significant political or civil unrest around the timeframes analysed,\" said Chowdhury Ashik Mahmud Bin Harun, the Executive Chairman of BIDA, in a Facebook post. For instance, Sudan experienced a 27.60 per cent decline in FDI after the uprising in 2019, while Sri Lanka saw a decline of 19.49 per cent in 2022, Chile 15.68 per cent in 2019, Ukraine 81.21 per cent in 2014, Egypt 107.55 per cent in 2011 and Indonesia 161.45 per cent in 1998. \nAgainst the backdrop, a 19 per cent surge in FDI last fiscal year demonstrates \"Bangladesh's resilience and continued investor confidence despite the internal instability typically associated with mass popular movements,\" he added. \nThe student-led mass uprising during July last year compelled Sheikh Hasina to step down as prime minister and flee to India for shelter. Before ouster, her brutal repressive regime killed at least 1,400 people and injured more than 20,000 during the 36 eventful days of July-August. The fall of the autocratic regime, which was marked by extensive corruption and ruthless oppression, opened a new window of opportunity in Bangladesh. However, the first couple of months after the fall were turbulent. The dust, however, started to settle gradually, and the Yunus-led interim government has been trying hard to bring back normalcy. \nAs the country passed a turbulent period in the third quarter (July-September) of 2024, the net inflow of FDI came down to $104.33 million from $272.22 million in the previous quarter. In the fourth or last quarter (October-December) of 2024, the net inflow of FDI regained and stood at $490.40 million. It jumped to $788.24 million in the first quarter of 2025 (or the third quarter of FY25), indicating a return of foreign investors. In the next quarter (April-June), the inflow of FDI, however, dropped sharply to 303.27 million, indicating that investor's confidence was short-lived. \nSo, the claim made by BIDA regarding the country's 'resilience and investors' confidence' is not well-substantiated. Bangladesh Bank statistics also showed that the net inflow of equity decreased to $81.30 million in the last quarter of FY25, reflecting the injection of a relatively low amount of fresh capital by foreign investors. It means the investors' confidence is still low, and they may wait for some more months. An increased reinvestment of profit by the existing multinational enterprises (MNEs) contributed to the rise in the country's FDI inflow in the FY 2025. Foreign investment in the form of reinvested earnings stood at $758.11 million in FY25 which was $614.87 million in FY24.\nSo, a drop in FDI in the last quarter of the fiscal year (or the second quarter of the calendar year) is also a general trend observed over the last couple of years. Except in 2023, the inflow of FDI declined in the second quarter of 2020, 2021, 2022, 2024, and 2025. \nBIDA chairman, however, rightly mentioned that FDI is likely to drop before the upcoming national election. It means FDI will not gain significant momentum until the second quarter of next year. Before that, there will be a fluctuation in the country's FDI inflow.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Global FDI and Bangladesh",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/global-fdi-and-bangladesh-1762613040",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       November 09, 2025 00:00:00  \nThe global educational landscape has undergone a profound transformation, moving decisively away from rote-learning systems to a creative, student-centric pedagogical methods that promote holistic child development. This global shift prioritises teaching methodologies that nurture essential 21st-century skills such as critical thinking, problem-solving, creativity and collaboration.\nBut Bangladesh's education system, instead, remains largely rooted in traditional rote-learning practices. Although the creative education method was introduced in 2009 to reduce students' dependence on memorising, it has not been fully implemented due to several shortcomings. Chief among these are teachers' limited understanding of creative teaching methods, weaknesses in question paper design, and the tendency of many educators to encourage memorising over comprehension.\nAgainst this backdrop, researchers have recommended extensive training to help teachers gain a clearer understanding of creative teaching approaches, alongside the incorporation of effective, innovative methods into the curriculum to foster creativity among students. Continuous professional development is crucial in this regard. Teachers must regularly update their knowledge and teaching techniques to adapt to evolving educational needs. A well-informed teacher naturally brings more ideas and energy into the classroom. With today's abundance of online learning platforms and resources, teachers have huge opportunities to develop themselves and explore innovative pedagogical practices.\nIt is, however, unfair to blame teachers alone for any lack of creativity. A system might be changed overnight, but not people and their skills. Creativity is hardly ever spontaneous, neither an innate trait; it requires time, effort and cultivation. It is something that must be nurtured through consistent practice, encouragement and institutional support.\nMusic and physical education are recognised globally as integral to children's mental and physical development at the primary level. In Bangladesh, educationists and child rights advocates have long argued for their inclusion in the curriculum. Responding to these calls, a policy decision was made in 2020 to appoint music and physical education teachers in government primary schools. Accordingly, the government had approved a policy to recruit music and physical education teachers in primary schools. However, just two months later, it reversed this decision, abolishing the newly created posts and prompting many educators, cultural activists and child rights organisations to protest, demanding the reinstatement of music and physical education teachers.\nApart from sports and music, arts can also play a vital role in the teaching-learning process, but these subjects remain largely informal and undervalued in Bangladesh's primary education system. Twentieth-century German philosopher Ernst Cassirer highlighted the significance of art, noting that \"Science gives us order in thought, morality gives us order in action, and art gives us order in the apprehension of visible, tangible and audible appearances.\"\nScientific research supports this view. Studies have shown that early exposure to visual art, music, and drama activates multiple areas of the brain and strengthens problem-solving and critical thinking abilities. Arts education enhances students' academic performance, fosters imagination, and improves overall emotional well-being. Moreover, it supports understanding across other subjects - from mathematics and science to language and geography - by developing cognitive flexibility and creative reasoning.\nBeyond academics, engagement with art, music, and sports has profound psychological benefits. Unlike adults, children often struggle to express complex emotions verbally. Creative activities provide them with healthy outlets to communicate their feelings, imagination and dreams. Such activities help channel negative emotions, reduce anxiety and nurture a sense of joy and self-assurance.\nIf Bangladesh is to build a generation capable of innovation and independent thought, creativity must be placed at the heart of its education policy. That means the government needs to invest more in teacher training and promote a classroom environment where joyful learning and exploration are valued more than committing to memory. Only then students will be inspired to think, imagine and new things.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Overstress on classroom study makes learning dull",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/overstress-on-classroom-study-makes-learning-dull-1762613088",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 09, 2025 00:00:00  \n\nWhen the chilly winter dawn fills the sky with the flutter of wings and flocks of birds arrive from distant lands, it feels as if nature itself is singing a song of new life. Hidden in that melody lies an eternal truth of existence - every arrival is destined for departure, every life comes to this earth as a guest. Guest birds travel thousands of miles - their destination unknown, yet their purpose clear: to live, to survive, and to return again. \nTheir arrival breathes new life into the wetlands, rivers, and deltas of our land. Amidst the misty mornings, the sounds of their chirping and the ripples of their wings on water make it seem as though nature is dressed in joy.\nYet, within that joy lies a profound realisation - we humans too are mere guests on this earth, here for only a brief moment. Some live long, some short, but in the end, every journey leads to the same destination. Just as the migratory birds return to their true home when the time comes, we too must one day return to our origin - to the embrace of the earth itself. \nStill, like the guest birds, we should also strive to leave something behind - love, beauty, compassion, and a sense of responsibility. For even if life is short, its meaning can be infinite. As Rabindranath Tagore beautifully said, \"The length of life is not important; its depth is.\" \nThe arrival of migratory birds is not merely a festival of nature - it is also a message of humanity. They teach us that the earth has no borders; the sky and air belong to all. \nThey fly beyond barriers of religion, race, language, and politics - reminding us that the true beauty of life lies in freedom and coexistence. Sadly, we often forget this message. By hunting these birds and destroying their sanctuaries, we are not only disrupting nature's balance but also diminishing our own humanity.\nAnd yet, a little kindness and a little love could restore the safety of their skies. No one on this earth is permanent - neither humans nor birds. Everyone departs one day, but what remains is the beauty they leave behind.\nRashedul Islam\nDepartment of Islamic Studies\nUniversity of Chittagong\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Guest birds embody the message of fleeting life",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/guest-birds-embody-the-message-of-fleeting-life-1762613120",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-11-2025"
    }
]