[
    {
        "full_article": "The Leader of the Opposition in the Lok Sabha, Rahul Gandhi, has raised troubling questions about the conduct of elections based on what transpired in the 2024 Assembly elections in Maharashtra. There are specific issues: the abnormal increase in voters listed in electoral rolls between the general election and Assembly elections, higher turnout numbers after 5 p.m. on voting day, and the Centre amending the Conduct of Election Rules, 1961 to restrict access to CCTV footage of the polling process. Mr. Gandhi has also questioned the process of appointing Election Commissioners, with the Union government refusing to implement a Supreme Court judgment in 2023 that recommended having the Chief Justice of India as a part of the selection panel. While political parties, including the BJP and the Congress, have raised complaints about Electronic Voting Machines in the past, many did not stand scrutiny considering the administrative and technological safeguards. The Congress has now focused on the electoral process, raising more fundamental issues that need to be unpacked separately.A preliminary analysis by The Hindu of registered voters in States where the general election and Assembly elections were proximate showed that there were precedents of sharp increases in the electorate before Assembly elections. While the number of new voters added before the Assembly elections was high — more than 39 lakh voters in just six months following the general election — similar increases were observed in 2014 as well. The increase of nearly four million voters is a large number and the ECI should proactively release machine-readable data on the rolls for verification. Regarding the allegation that turnout increases were abnormal after 5 p.m, the argument does not hold water. This is based on provisional turnout figures, and Election Commission of India (ECI) data show that there was no significant increase in voting after 5 p.m. in Maharashtra. Provisional turnout figures shared via an app by the ECI are not entirely accurate as these are dependent on the manual entry of numbers during elections and may have discrepancies when compared to the accurate machine count. As final figures via Form 17C data from each booth are released only after a lag, it would be incorrect to rely on provisional turnout figures. However, there is another contention that merits the ECI’s response: retaining CCTV footage and providing parties and their nominees access to it to scrutinise complaints. The process of updating electoral rolls must be more transparent and involve political parties for scrutiny and verification. It is also incumbent upon parties to show alacrity during this process than cry foul after the results are out. Ultimately, the onus lies on the ECI to enhance transparency in the electoral process and, specifically, in providing electoral rolls and retaining CCTV footage for scrutiny. Published - June 10, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        Maharashtra Assembly Elections 2024\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        Assembly Elections\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        electronics\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        political parties",
        "headline_1": "​Tighten the process: On the Election Commission of India, election  processes",
        "headline_2": "The ECI must address legitimate concerns about voter rolls and transparency",
        "link": "https://www.thehindu.com/opinion/editorial/tighten-the-process-on-the-election-commission-of-india-election-processes/article69675674.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "10-06-2025"
    },
    {
        "full_article": "The yearning for historical greatness is common among sports fans. Contemporary success and genius notwithstanding, there is often a tendency to hark back to the past and lament that present-day virtuosi are not a patch on the older ones. In tennis, this storyline was expected to unfold in the immediate aftermath of the ‘Big Three’ era as Roger Federer and Rafael Nadal exited, and Novak Djokovic started displaying his waning powers. It is to Carlos Alcaraz and Jannik Sinner’s credit that they have allowed none of this talk to surface. Sunday’s fascinating five-set French Open final was the latest piece of evidence as the Spaniard outlasted the World No. 1 over five hours and 29 minutes of intense, scintillating action. The victory brought Alcaraz his fifth Grand Slam trophy, and the World No. 2 became only the third man after Gustavo Kuerten and Nadal to defend titles at Roland-Garros this millennium. Alcaraz and Sinner have now swept the last six Majors and eight of the previous 11. They are firmly perched at the top of tennis’ current totem pole, and going by the 12th act of their engrossing play in Paris, there is little doubt that it is their rivalry that will prove era-defining for the men’s game.Leading in, it was Sinner who had been more clinical, with the highlight being the ruthless dismantling of 24-time Major winner Djokovic in the semifinal. The 23-year-old had won 29 straight sets at Slams this year, and when he made it 31 by pocketing the first two against Alcaraz, a third straight Major — fourth overall — loomed. But Alcaraz, who came in after triumphs in Monte Carlo and Rome, found a higher gear when threatened — erasing three match points in the fourth set, breaking Sinner when the Italian was serving for the championship and overcoming his own disappointment of failing to serve it out in the fifth stanza to turn the tables fully. Saturday’s women’s final between No. 1 Aryna Sabalenka and No. 2 Coco Gauff was as dramatic and capricious, but alternated between middling and glorious. In the end, it was Gauff who proved steadier, overcoming some treacherous conditions and her erratic opponent in two hours and 38 minutes. Sabalenka, in fact, was the favourite, having also ousted three-time defending champion Iga Swiatek en route. But her power-packed game crumbled in the face of Gauff’s restrained art as the American left her nursing consecutive defeats in Slam finals. For Gauff, 21, it was her second Major, and with a technique that is gradually improving, she is sure to rise further. Published - June 10, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        tennis\n                    \n                            /                      \n                        \n                        France",
        "headline_1": "​History lessons: On the French Open",
        "headline_2": "The top layer in men’s and women’s tennis now sports a settled look",
        "link": "https://www.thehindu.com/opinion/editorial/history-lessons-on-the-french-open/article69675007.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "10-06-2025"
    },
    {
        "full_article": "Medics can’t be bullied by ministers. But how medics deal with patients is also a vital part of healthcare\nIt started with a refusal – correct decision, by the books – by Goa Medical College’s emergency department to administer a routine B12 injection to a 77-year-old. She got the jab in the orthopaedic ward. It ended with an apology to GMC casualty’s chief from Goa’s health minister, who had suspended the doctor in a brazen public show of arrogance on camera. The video of the public humiliation correctly triggered outrage. The minister was not just badly behaved, he displayed an attribute shared by many politicians: pulling rank at the drop of a hat. In April, a UP minister on-camera wanted a Sonbhadra hospital’s CMO “sent to the jungle” because he was not available to “welcome” the minister on arrival. He too, like his Goa counterpart, believed their high-handedness was “speaking up for patients”. But they spoke from a point of privilege and ego alone. However, this thread – that patients need “support” when facing doctors – brings us to another reality of Indian hospitals. One that’s barely discussed.\nSome doctors are often less than civil with patients in public hospitals. Dismissive behaviour with patients and nurses is not infrequent, but barely recorded in any survey. Neither is its impact on care outcomes studied – starting with patients not daring to clear doubts for fear of a dressing-down. As noted by some TOI columnists, there are various surveys of abuse of doctors but none on doctors’ un-bedside manners. The social status of doctors is such that some of them routinely get away with markedly impolite behaviour especially with poor patients. Doctors in govt hospitals are rarely caught on camera – patients have far bigger problems and challenges than to call out ‘doctor saab’.\nThis invisibilisation contrasts with the outrage that follows when a doctor is slighted. Medical fraternity speaks as one. That’s a good thing. But dare a patient speak out against a doctor’s behaviour? True, the doctor-patient ratio in public hospitals shows how burdened doctors are. But it’s good to ask whether that’s the complete explanation. Dismissive behaviour by some doctors perhaps comes, in part, from a sense of privilege. That many in govt hospitals are overworked doesn’t help. The Goa case isn’t one of a kind. Similar miscommunication – where to go for what kind of medical care – plays out daily pan-India. Countries like Australia and UK study doctors’ behaviour towards patients in public health systems. Perhaps, that’s something India should consider.\n\n",
        "headline_1": "Doctors & patients",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/doctors-patients/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-06-2025"
    },
    {
        "full_article": "Arrest and disarming of extremist elements in the state is a must first step for normalisation \nCBI’s arrest of Kanan Singh, chief of radical Manipuri outfit Arambai Tenggol (AT), over the weekend is a hugely consequential step. AT was one of the main protagonists in the terrible ethnic strife in Manipur. It had become a law unto itself under the garb of protecting the state’s territorial integrity. Therefore, defanging this group as well as others spread across both Meitei and Kuki communities – these outfits had armed themselves to the teeth – was a must first step in restoring law and order in the state. Separately, army and central forces have carried out operations across Manipur’s hill and valley districts, arresting 23 members of different extremist outfits and recovering 40 types of arms, grenades and ammunition.\nThis process should have started long ago – under the previous Biren Singh administration. Nonetheless, it’s welcome that authorities have belatedly realised that you can’t begin the normalisation process without disbanding vigilante groups and militant outfits. Kuki and Meitei gangs had raided the armoury of security forces in the state and stolen a tonne of weapons. The guns had to be recovered. Second, trust has to be restored in the state. There’s now total separation between Kuki and Meitei communities. Authorities not only have to impose their writ on the situation but also be seen to be even-handed in ensuring justice.\nTowards this end, reforming Manipur police, which was seen by many to have behaved in a partisan manner during the strife, is a must. With Manipur under central rule, it’s the best time to do this. Third, Manipur’s case shows the dangers of extreme political pandering to parochial interests and making heroes out of thugs. This undermines the authority of the state itself. Given Northeast’s myriad ethnic fault lines, this must be avoided at all costs. Let Manipur be a lesson.\n\n",
        "headline_1": "Mending Manipur",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/mending-manipur/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-06-2025"
    },
    {
        "full_article": "Megalomaniacs turn up the heat, we grab the popcorn\nWe always knew this day would come – the epic fallout between the richest man in the world and the most powerful. A bromance between megalomaniacs was never built to last. As a recovering Bollywood addict, I can’t help but think of Saudagar (1991). Like the film’s titans – Veeru Singh (Dilip Kumar) and Rajeshwar Singh (Raaj Kumar) – Trump and Musk have transformed from best friends to blood enemies.\nRemember when they danced through metaphorical meadows plotting to dismantle old empires, singing ‘Is jangal main hum do sher, chal ghar jaldi crypto beche pher?’ – Kings of the jungle cooking crypto gravy. Musk once declared he loved Trump ‘as much as a straight man can love a man’. Trump gave him magical powers beyond any law.\nThen came the schemers. Chuniya (played by JD Vance – sorry, Amrish Puri) and Baliram (played by Steve Bannon – sorry again, Gulshan Grover) set fire to the friendship. Suddenly accusations fly. Veeru hints at Epstein files, Rajeshwar threatens federal contracts.\nSomewhere, Dilip Kumar delivers the killer line: ‘Hum tumhe marenge aur zaroor marenge, lekin woh kanoon bhi humara hoga, policy bhi humari hogi, aur waqt bhi humara hoga’ – We will get you, law is ours, policy is ours, time will be ours. The only suspense? Who ‘humara’ will be – MAGA or the billionaire oligarch libertarian cabal battling for America’s future.\nToday’s kids won’t know the joy of front-row seats at Priya cinema, but they can re-experience Saudagar by logging onto X and Truth Social to watch these ex-yaars hurl insults and subpoenas. Musk now hints at bankrolling Trump’s opposition, declaring: ‘Jab Musk dosti nibhata hai, toh Starlink free kar deta hai. Aur jab dushmani karta hai, toh blue checkmarks chheen leta hai’ – In friendship he gave free Starlink, in feud he will take away the blue tick.\nTrump’s flex isn’t far behind. ‘Yeh Thakur Trump, itihaas batata naheen, executive order likhta hai’ – Forget history, Thakur writes executive orders.\nWill they reconcile in the third act? Will Chuniya twirl his hair and whisper ‘Balirama, telephone kat kar, Tesla ko short kar’ – Let’s start shorting Tesla. Who knows. All I know is I’m grabbing popcorn for this battle royale. As they said in Saudagar, ‘There is no worse enemy than a man who was once a friend.’\n\n",
        "headline_1": "Return of Saudagar",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/just-another-blog/return-of-saudagar/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-06-2025"
    },
    {
        "full_article": "Supposing a song, book, movie pulls a tourist to India, how might this journey go? \nPerhaps nothing gladdens an ersatz desi heart more than a Western ode to Indian beauty. All the complexities of that EM Forster novel about that cave are nothing in comparison to how it continues to send the odd traveller our way. That one Odissi dancer in one Michael Jackson video is never to be forgotten. More current examples of course result in convulsions of joy. Wes Anderson to Coldplay, we scan any India-ish creation with a Sherlock magnifying glass. Did you spot Jodhpur’s Mehrangarh fort or this spice bazaar or jhumka gali or that Varanasi ghat or Worli gaon? Ed Sheeran’s new song Sapphire has also sent the socials on this look, don’t miss, hunt. \nAs a solidly underperforming tourist destination, India can really do with this kind of free advertising. It’s one thing to be totally overshadowed by France, quite another by petite Dubai with nary a world heritage site. Even domestic tourists have begun switching their Goa bookings to Hanoi, Phuket, Bali and Siem Reap. Hence any global song, book, movie pitching Destination India sparking a national amour propre is logical. But supposing tourists far and near do hark the invite and do hoof over, it still may not, sadly, make for a fairy tale.\nAs Abhijit Banerjee has written in TOI, we may be a very big country, but most tourists don’t seem to know that. Crowds gravitate to the same historical ports of call, the same hill stations, the same beaches. For the most part, authorities don’t even try to moderate the overcrowding, whether it means pollution turning ancient marble to grey or stacked monstrosities destabilising Himalayan mountains, which means tourists having a poor to dangerous experience. Full circle then, the tourist will curse the song, book, movie that made the nightmare look like a dream.\n\n",
        "headline_1": "Holiday CRush",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/holiday-crush/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-06-2025"
    }
]