[
    {
        "full_article": "The case of a 42-year-old woman in Kerala testing positive for Nipah virus on May 8 makes it the third such instance being reported from the State’s Malappuram district in the last two years. The earlier cases were detected last year, in a 14-year-old boy on July 21 and a 24-year-old adult on September 15. With the latest detection of Nipah in the State, Kerala has recorded two outbreaks, in the years 2018 and 2023, involving human-to-human transmission, and four spillovers in the years 2019 and 2021, and two events in 2024. In the May 8 event, even though only one person tested positive for Nipah and seven close contacts tested negative, it is a bit early to call it a spillover. Unlike an outbreak, Nipah spillovers are restricted to a single case with no human-to-human transmission. One reason for the absence of human spread is the timely detection of the case and isolation of the patient. The other reason is the clinical presentation. In the case of Nipah virus spillovers, patients who tested positive for the virus had presented with acute encephalitis syndrome (AES), while in the Nipah outbreaks in 2018 and 2023, the index case and at least a few other infected people had presented with acute respiratory distress syndrome (ARDS). Compared with AES, patients with ARDS present with relatively severe conditions with lung involvement. Besides cough, patients presenting with ARDS have higher viral loads, which serve as a surrogate for disease severity. Immaterial of whether blood, urine or cerebrospinal fluid samples test positive or not, throat swab samples generally test positive if a person is infected by the Nipah virus, which again serve as an indicator of human spread in the case of patients with ARDS. The high viral load, the presence of virus in the throat and the tendency to cough make human spread possible. Greater disease severity in ARDS cases is also the reason for the Nipah deaths in 2018 and 2023. There were 17 deaths from 18 cases in the 2018 outbreak, and two deaths from six cases in the 2023 outbreak. A study by the ICMR-National Institute of Virology (NIV) Pune found that the 2018 Nipah virus had small genetic variations from the Bangladesh strain and was able to cause multisystemic disease in a Syrian hamster model resembling human infection.The Nipah virus is capable of causing different clinical presentations and is endowed with the ability to cause human spread in some cases. This makes a strong case for a quick and thorough genetic study of the virus in humans and bats. With Nipah cases now a very regular occurrence in Kerala, the compulsion to routinely study fruit bats, which are natural hosts for Nipah, cannot be overemphasised. That even the 2018 virus showed small genetic differences from the Bangladesh strain makes it even more important to know whether the virus causing the spillovers without human spread has evolved further. Such studies can be done by more scientists only when the genetic sequences are shared in public databases without any delay.\r Published - May 10, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Nipah Virus\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        viral diseases\n                    \n                            /                      \n                        \n                        Bangladesh\n                    \n                            /                      \n                        \n                        Pune",
        "headline_1": "​Greater regularity: On the Nipah virus",
        "headline_2": "Genetic sequences of Nipah virus must be shared in public databases quickly",
        "link": "https://www.thehindu.com/opinion/editorial/greater-regularity-on-the-nipah-virus/article69557406.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "10-05-2025"
    },
    {
        "full_article": "A storied career is grinding to a halt in phases. Rohit Sharma, as is the trend now among cricketers, is doing the slow fade-out. First up, he retired from T20Is, and now at 38, after a poor run in Tests, the Indian skipper has bowed out of cricket’s longest format. If earlier, players did the reverse of quitting limited-overs cricket and stretching their stint in Tests, as was the case with Sachin Tendulkar, modern heroes prefer the kinetic energy of the abridged versions over the gritty charm of the five-day tussle. As the English sport with an Indian heart grapples with an identity crisis in an era of shorter attention spans, players are perhaps swayed by the magnetism of cash-rich T20 leagues, with the Indian Premier League leading the way. Rohit, though, has other motives in keeping away the shadows from ODIs. Dropped from the 2011 World Cup winning squad, he still hurts over India’s semifinal loss to New Zealand in the 2019 World Cup in England, a championship in which he struck five tons. To make it worse, under his captaincy, India lost the World Cup final to Australia in the 2023 edition at Ahmedabad. That India won the 2024 Twenty20 World Cup and this year’s ICC Champions Trophy, has kept him motivated.Cricket’s beating heart is centred around Tests. A brand that offers second chances, and one that probes the quality in every cricketer. There was a time in the 1980s when Tests were the real deal and ODIs were deemed an after-thought. Much water has flowed in the Thames and Hooghly since then and this is an age in which T20 leagues have more allure. The West Indians led by Chris Gayle were the initial members doing service in diverse T20 leagues across the globe. Rohit and Virat Kohli have donned the India shade from 2007 and 2008, respectively, and their’s have been a long stint. In perhaps forcing Rohit’s exit from Tests, the selectors are doing the slow recasting of Indian batting in Tests. Cheteshwar Pujara, Ajinkya Rahane and now Rohit, had to vacate and much would hinge on Kohli and K.L. Rahul, the senior duo, when India heads to England in June for five Tests. Rohit, the one-day supremo, always outdid his Test avatar. Still, to score 4,301 runs from 67 Tests, in which a significant chunk came as an opener, is remarkable. Published - May 10, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        cricket\n                    \n                            /                      \n                        \n                        Indian Premier League\n                    \n                            /                      \n                        \n                        Test  cricket\n                    \n                            /                      \n                        \n                        Twenty20",
        "headline_1": "Captain’s exit: on the Indian cricket team",
        "headline_2": "India’s Test team seems set for a transition phase",
        "link": "https://www.thehindu.com/opinion/editorial/captains-exit-on-the-indian-cricket-team/article69557537.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "10-05-2025"
    },
    {
        "full_article": "How long will a terror sponsor get financial bailouts? \nAmidst the military escalation by Pakistan – which now includes the irresponsible use of civilian passenger jets as human shields – its latest IMF bailout package was reviewed yesterday. But the spectacle of a sponsor of terror getting bailouts from an international lender is truly jarring. IMF bailouts for Pakistan are akin to giving a delinquent teenager additional pocket money despite a history of irresponsible behaviour. It must stop for the sake of global security. \nDespite an astonishing 24 IMF bailouts since 1958, Pakistan has little to show by way of reforms. Even noted Pakistani economist Kaiser Bengali has said that his country has been reduced to a pauper, taking loans to pay off loans. Any sensible country would have made its economy a priority. But Pakistan spends the money on defence, willingly gets into conflict situations, and fritters the rest away through corruption. Consider two points. According to SIPRI, Pakistan spent $10bn or 2.6% of its GDP on defence in 2024. This, despite Islamabad’s external debt being over $130bn, and forex reserves just $15bn, good for only three months of imports. Pakistan’s army is clearly siphoning off most of the country’s money and bailout support. Yet, Islamabad this year proposes to further increase defence spending by 18% \nSecond, for every Pakistani Rs 100 collected in taxes, trading and commercial imports businesses contribute just 60 paise. Unsurprisingly, a plethora of Pakistan’s politicians fall in the latter category. In other words, Pak generals and politicians are looting the state. But if international lenders threaten to withhold financial support, Pakistan’s leaders have perfected the art of negotiating with a gun to their head, effectively engaging in nuclear blackmail. It’s time to call Pakistan’s bluff. The generals at Rawalpindi GHQ and Pakistan’s corrupt politicians have taken the world for a ride for far too long.\n\n",
        "headline_1": "Delinquent Pak",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/delinquent-pak/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-05-2025"
    },
    {
        "full_article": "SC gives a fine & necessary order  \nOverturning a Delhi HC verdict, Supreme Court on Friday held that public scrutiny of court orders is not just kosher, but also necessary “as a check against judicial caprice or vagaries”, in the words of an earlier 9-judge bench. SC reiterated public gaze was “a powerful instrument for creating confidence of the public in the fairness, objectivity and impartiality of the administration of justice.”\nThe case was about Delhi HC’s order to Wikimedia to take down a website page that discussed the court’s order on the legal dispute between ANI and Wikimedia. ANI had accused Wikimedia of defamation; the page in question detailed the case – this, Delhi HC held, was “contempt of court”. Wikimedia moved SC, which on Friday correctly said that “it is not the court’s job to tell the media: delete this, take that down.”\nCourts frequently bristle at even bona fide criticism, using a very broad definition in the Contempt of Courts Act 1971, which criminalises acts that “scandalise” a court. Even Chandrachud’s pan-India initiative to live-stream court proceedings was also centred on enhancing transparency. SC in this case used twin tests of necessity and proportionality to conclude that to improve any system, including the judiciary, introspection was key, and only robust debate could ensure that, “even on issues before the court”. This is not just a blow for free speech but a step towards a maturing of Indian democracy.\n\n",
        "headline_1": "Good for free speech",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/good-for-free-speech/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-05-2025"
    },
    {
        "full_article": "Don’t judge a drone’s lethality by its price \nMilitary drones aren’t new. America used Pioneer RQ-2As in the ’91 Gulf War. As one of them came in to survey Failaka Island, five Iraqi soldiers made history by waving a white flag and surrendering to it. But almost 35 years on, drone use has become common on the battlefield. Op Sindoor, Ukraine, Myanmar, Red Sea, drones have forced militaries everywhere to rethink strategy. If you find drone warfare intriguing, check out the podcast Drone Wars.\nThere’s no denying that Ukraine mainstreamed the small “homemade” drone as a weapon, but as military expert Mike MacKay points out in an episode, Isis was using cheap, store-bought drones to drop grenades on coalition forces in Iraq in 2016. Where the ’91-vintage RQ-2A was 14ft long and had a wingspan of almost 17ft, a top-end military drone like Reaper MQ-9 – India has ordered 31 of them – now measures almost 66ft across and costs over $30mn. Pakistan’s Turkish-origin Bayraktar Akinci drones also cost several million dollars each. But the drones revolutionising warfare are tiny in comparison, and dirt cheap, often costing no more than a few hundred dollars each. So, even a cash-strapped country like Ukraine can make hundreds of thousands of them. It made over 1mn in 2024 and would double output, funds permitting. \nCan any military hope to acquire 2mn fighter planes? A B2 strategic bomber costs well over $1bn. But the Ukrainian drones – Magura V5 – that knocked out 40% of Russia’s naval fleet in Black Sea cost only about $250,000 apiece. In Red Sea, Houthis have sunk ships with over $100mn worth of cargo, using drones that cost only about $100,000 each. Experts on the podcast say the low cost of drone warfare makes this a cavalry-vs-machine gun moment for militaries all over again. Where tanks and field guns intimidated opponents at one time, now they are sitting ducks for drones.\nChristopher Miller, another drone expert, says militaries will need to adapt rapidly to drone warfare because old front line techniques, like firing mortars, are too slow. Where aiming at and hitting a target with a mortar takes at least five minutes, a drone with AI does the job in 90 seconds. And while a mortar can hit only up to a couple of kilometres, even small drones can fly 15-20km. That’s why S Korea, learning from Ukraine, has decided to phase out its smaller mortars and train troops to become drone pilots. Experts on the podcast say Ukraine has 20 schools to train drone pilots. Its expert pilots can manoeuvre a drone by reckoning or counting rather than using the inbuilt camera. One of them was awarded Ukraine’s Hero of the Republic medal for killing 400 Russian troops in six months. \nYou can shoot down drones, of course. Coalition forces in Iraq did so with guns, but when hundreds of drones – a whole swarm – come at you, countermeasures are harder. You could use sophisticated missiles like the Patriot Interceptor – or the S400 that India used to shoot down Pakistan’s missiles – for bigger drones, but supplies and costs are a hurdle. For now, nobody has a foolproof counter to attacking drones, and as the bigger militaries – US, China, India – start inducting them in bigger numbers, questions about AI capabilities will also have to be dealt with. Autonomous drones could dodge hacking, jamming and GPS-spoofing, but will they hit targets their human masters want them to? That’s the next drone frontier.\n\n",
        "headline_1": "Cheaper than a car, deadlier than a plane",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/cheaper-than-a-car-deadlier-than-a-plane/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-05-2025"
    },
    {
        "full_article": "On arty-crafty terms replacing good old-fashioned words\nAn Australian friend has sent me an article from a local newspaper which says that the Down Under continent is being ‘uplifted’. Is the land of Oz levitating to the top of the world? Not quite. \n‘Uplifted’ doesn’t have anything to do with geology. Or with such gravity-defying, cosmetic surgery procedures like tummy tucks and double chin eliminations, but is the latest addition to the argot of the hospitality industry. \nIf a hotel offers to change the standard room you booked for a superior room, you are being uplifted. What’s wrong with an old-fashioned upgrade? Upgrade has been downgraded and replaced by the presumably more uplifting ‘uplifted’. Want an extra dollop of cheese on your pizza? By all means. Get uplifted. \nOral snobbery, or snobspeak, which is reinventing language seeks to poshify everyday vocabulary. In the mid-50s, British novelist Nancy Mitford distinguished between U and non-U language, in which U stood for upper class and non-U for non-upper. For example, U-speakers would say scent, whereas non-U speakers would say perfume; a U-speaker would use the loo, while a non-U speaker would go to the toilet. \nIn today’s snobspeak, a restaurant menu or an art gallery exhibition is invariably curated. This does not mean getting hold of a cleric called a curate to preside over the proceedings. Curated merely means ‘put together’, but put together is verbal vanilla, oral plain Jane, while curated sounds glam and arty-crafty. \nLike ‘artisanal’. Artisanal should evoke the image of a workman, an artisan, sweat beading the brow, sleeves rolled up on brawny arms, wielding an implement of arcane use. \nBut artisanal now refers to small-batch food items that aren’t mass-produced, like ice cream, or cheese, or cupcakes, or ‘hand-cut’ sandwiches, as distinct, presumably, from ‘foot-cut’ sandwiches, with or without benefit of boots. \n‘Bespoke’ is the artisanal word for custom-made, or made to order. Being more hoity, not to mention toity, bespoke is snobspeak for customised.  \nBut even as snobspeak invents new buzzwords for its lexicon, it runs the risk of being told to shove a bespoke uplifted into your artisanal. \n\n",
        "headline_1": "Snobspeak doubletalk",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/snobspeak-doubletalk/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-05-2025"
    },
    {
        "full_article": "The continued paralysis at the Khulna University of Engineering and Technology (KUET), which has been effectively closed for over two and a half months now, may be a reflection of the present turbulent time itself, but nothing justifies such disruptions as they leave a profound impact on the future of students. The situation, triggered by clashes over a demand of student politics ban on February 18, provides a troubling example of how unchecked disciplinary violations, administrative inertia, political interference, and an inability to compromise can combine to hold an entire institution hostage. Reportedly, despite the syndicate's decision on Sunday to resume academic activities, the reopening has been stalled due to the reluctance of teachers protesting over assaults and smear campaigns against some faculty members.\nKUET teachers have been on strike for five days now. Even though the interim vice-chancellor has been holding repeated meetings and the syndicate is said to have made progress on the teachers' demands, a breakthrough in the stalemate continues to be elusive. Meanwhile, in an apparent repeat of this chaotic mess, Barishal University is heading towards its own shutdown. Over the past week, a group of students have staged protests demanding the VC's resignation—accusing her of \"authoritarianism\" and unprofessional conduct—with a section of teachers also extending their solidarity. Students have declared that they will suspend academic activities, excluding semester exams, from Monday if their demands are not met.\nThese are not isolated disruptions. Since the political upheaval of the July uprising, we have seen repeated episodes of campus unrest across the country, where students, divided into various factions, as well as teachers and administrators all clashed over various grievances but effective solutions were rarely achieved. We have also seen such unrest at various colleges and even the polytechnic institutes, where students recently enforced a shutdown over slow progress on their six-point demand. Although the students' platform has decided to temporarily suspend the shutdown programme, allowing classes to resume, exams will remain on hold for now.\nThis state of affairs in our academic institutions is deeply regrettable. We call on all parties involved to recognise the heavy cost of their uncompromising stances. While some of their demands are genuine, their chosen methods of expression are throwing academic calendars into disarray, delaying exams and graduation, and hurting both current students and future admissions. There is no alternative to proper response from the authorities to address legitimate grievances, but students, and teachers, too have a responsibility here. They must prioritise uninterrupted continuation of academic activities regardless of the issue at hand, while continuing negotiations in parallel. Only through cooperation and compromise can we protect our broader academic interests.\n",
        "headline_1": "Bring paralysed campuses back to life",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/bring-paralysed-campuses-back-life-3890676",
        "news_paper_name": "The Daily Star",
        "publish_date": "10-05-2025"
    },
    {
        "full_article": "I bought a palm leaf flute from a fair. But it no longer plays like it used to. Something feels off within me. Have we truly left behind the ideals of our youth, the ideological childhood of our nation, far behind?\nI recall the nostalgic fields of Nakshi Kantha, the warm afternoon sun, and the flute's melody drifting in the breeze—all forming a national identity, a childhood filled with dreams. The colourful fantasies of adolescence, the stories of struggle, and the spirit of honesty no longer seem to linger in my mind.\nSuddenly, I realise how far we have come. But along the way, we have left behind ideals, struggles, and songs of self-sacrifice. In today's politics of comfort, the melody of that flute is long gone, replaced by an uncomfortable silence that spreads all around.\nBeyond the constitutionally recognised political parties, there exists an invisible yet influential force in society: the \"Comfort Party.\" Members of this group do nothing, say nothing, yet expect others to do everything. They wish others to work, to sacrifice, to struggle—while they simply enjoy the fruits.\nThey possess wealth, power, and influence. Yet, during the times of crisis, they remain invisible. They were absent in the struggle for freedom, silent during anti-corruption protests, and aloof in democratic movements. However, when it's time for indulgence, they are the first to act.\nThe Shapla, or water lily, is Bangladesh's national flower. It floats on the water, its beauty shining only when on the surface. But once removed from the water, its charm fades.\nThe Comfort Party is much like the Shapla: it prefers to float on top, staying away from the depths. It's accustomed to existing in a state of irresponsibility, much like butter floating on milk. But what they fail to realise is that butter eventually melts or transforms into ghee.\nBangladesh's politics can be seen as a chemical process. Milk symbolises the idealistic dreams, butter represents the self-serving comfort, and ghee symbolises the final transformation of sacrifice and outcome.\nOur politics has stalled at butter, never quite reaching the final stage of ghee. The heat, responsibility, and sacrifice required for this transformation are sorely lacking.\nBefore every election, each party promises to eliminate corruption and bring good governance. Yet, over time, all of these remain as mere words. In reality, nothing changes.\nNandalal once asked, \"If I don't do it, who will?\" Today, there is no one asking this question. Members of the Comfort Party believe someone else will do it. They only think of their own comfort. This mentality has left our nation without leadership.\nTo lead the country towards true transformation, we must go through each phase of the milk-butter-ghee process properly. What is needed are people who will lead, who will fight, take risks, and work for the nation, sacrificing their own interests. If today's politics remains centred only around comfort, Bangladesh will become a self-forgetting, lost nation in the future. If we do not awaken now, if we do not return to a genuine, struggling political consciousness, our politics will remain forever silent, much like that palm leaf flute.\nEven in the deepest darkness, morning comes, the dew sparkles, bringing a hopeful message of a new day. We may be lost on the complex political path, but the strength to break barriers go beyond limits and move forward still lies within us.\nForget the boundaries and limitations. Let the heart soar to a new freedom, where the walls of despair break down in the flood of light. Old fatigue will fade, and a new day will begin.\nLet the old fatigue go, let the clouds of despair fade away. The people of this country will one day see their hopes fulfilled. A new dawn will surely come, where true leadership will emerge, where justice, development, and the dream of a new Bangladesh will be realised.\nRahman Mridha is a researcher, writer and former director of Pfizer in Sweden. He can be reached at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "A cautionary tale of political transformation in Bangladesh",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/cautionary-tale-political-transformation-bangladesh-3890586",
        "news_paper_name": "The Daily Star",
        "publish_date": "10-05-2025"
    },
    {
        "full_article": "The July uprising of 2024 paved the way for reimagining Bangladesh's economic future. There is a powerful opportunity to reshape the country's industrial policy to make it more inclusive, strategic, and forward-looking and it means putting women, the half of the population, in front and centre. Despite achieving significant progress, Bangladesh still lacks policies that fully support women across diverse industries and promote their inclusion in the labour force.\nGender integration should no longer be treated as a social obligation, it must be seen as an economic strategy. Gendered industrial policy, particularly in the ready-made garments (RMG) sector, is not just desirable but essential for a just and sustainable economic transition post-July 2024.\nSince the late 1980s, women have been integral to the industrial development of Bangladesh, especially in the export-orientated RMG sector. This feminisation of labour was not accidental; it was incentivised by both state policies and the global demand for cheap labour. Women were seen as \"docile,\" willing to accept lower wages, and less likely to unionise. This strategy paid off in GDP terms: by 2022, the RMG sector alone accounted for over 80 percent of Bangladesh's export earnings, with women making up approximately 60 percent of its workforce (UNDP, 2023).\nHowever, this economic success came with gendered costs. Despite their contribution, women workers were largely excluded from policy dialogues, workplace protections, and leadership roles within the industry. The very policies that enabled industrial growth often treated women's labour as a means to an end, not as a subject of development.\nMost current gender-related policies in Bangladesh are welfare-orientated: they focus on microcredit schemes, skills development, or social safety nets. While these are important, they are not successful in integrating women into the core of economic planning. The concept of \"gender mainstreaming\" has often been reduced to tokenistic inclusivity, rather than a subject of development.\nWhat is needed is a shift from welfare to strategy. A truly gendered industrial policy must ask how economic policies can work for women, not merely with them. This requires a rethinking of how incentives, trade policies, labour laws, and technological advancements impact female workers across sectors.\nFeminist economists such as Gita Sen and Naila Kabeer have long emphasised that markets are not gender-neutral, and overlooking this fact leads to flawed economic outcomes. Even 2024 reports by the IMF and World Bank support this statement, where they showed that closing gender gaps in the labour market could raise the GDP of Bangladesh by up to 40 percent. This makes gender equity not only a moral responsibility but also a macroeconomic opportunity.\nThe RMG sector is the clearest example of gendered exclusion in economic policy. Despite their majority in numbers, female workers have little control over their working conditions. Labour rights violations, wage theft, sexual harassment, and lack of maternity support continue to plague the industry.\nMoreover, automation and shifting global trade patterns now threaten the jobs of thousands of female RMG workers. Without policy intervention, the transition to higher-value manufacturing will likely displace women first. In this context, gender-responsive industrial upgrading becomes essential. Policies should prioritise retraining female workers, subsidising their entry into new sectors like electronics or agro-processing, and promoting female entrepreneurship through access to finance and market linkages. The World Bank adds that increasing female participation in manufacturing alone could boost the output of the sector by 21 percent. These figures show the strategic value of expanding women's roles as Bangladesh moves up the industrial ladder.\nFor example, the RMG Sustainability Council (RSC) can expand its mandate beyond compliance to include gender equity metrics. The Bangladesh Investment Development Authority (BIDA) and the Export Promotion Bureau (EPB) can actively incentivise firms that adopt gender-inclusive workplace practices. While the 2022 Industrial Policy briefly mentions women's participation, future policies must firmly integrate gender targets into their core framework.\nSeveral countries offer useful lessons. Tunisia has integrated gender goals into its industrial upgrading programmes, leading to a more balanced distribution of skilled jobs. The country is also promoting female entrepreneurship in rural areas through small-scale renewable energy technologies, which include training programmes and support for income-generating activities to enhance women's economic empowerment.\nThe gender-inclusive policies of Seychelles aim to expand employment opportunities for women beyond traditional sectors. It emphasises capacity-building to enable women to take on more diverse roles in manufacturing and other industries. The government of Chile offers financial incentives such as bonuses on grants for female-led firms. Gender equality is integrated into industrial development through national strategic plans and training programmes of the Chilean economic development agency, CORFO. The industrial parks in Ethiopia include mandatory daycare centres and female-friendly infrastructure, improving female labour force retention. Vietnam's textile industry invests heavily in technical education for women, ensuring they are not left behind in the shift to automation.\nBangladesh can learn from these models by adapting them to local contexts without just being a mere copycat. When gender is seen as a productivity issue rather than just a social one, policy innovation is bound to happen.\nTo move forward, Bangladesh must integrate gender at every level of industrial policy. The government can offer tax benefits or subsidies to firms that show evident progress in gender equity. This includes narrowing the gender wage gap, promoting women to leadership roles, and ensuring access to safe transport and child care. Technical training centres should prioritise women in emerging sectors like IT, electronics, green energy, and logistics by reserving seats and providing stipends. The recommendations by the IMF also align with them, which is to include women in climate-adaptive sectors and green industry, essential for sustainable growth.\nKey ministries such as the Ministry of Industries, Ministry of Commerce, and Ministry of Labour and Employment need to establish gender audit systems. Authorities must also mandate female representation in industry associations. According to the World Bank, female labour participation has stagnated at 37 percent in recent years despite proven economic benefits. The IMF identifies unpaid care burdens and limited property rights as major obstacles to unlocking the full economic potential of the female workforce. So, the labour laws should be updated to improve maternity benefits, enforce anti-harassment measures, and guarantee equal pay for equal work. These are not radical demands, they are pragmatic steps toward building an inclusive economy.\nThe July uprising has opened a rare political window for structural reform. To achieve economic justice, policymakers must place gender justice at the heart of industrial strategy. A gendered industrial policy does not undermine efficiency or growth; it redefines them. As Bangladesh prepares for a new economic future, it must recognise that industrialisation without women is neither just nor sustainable.\nRassiq Aziz Kabir and Mohammad Iftekharul Islam are policy analysts. They can be reached at [email protected] and [email protected] , respectively.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Why our industrial future depends on women",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/why-our-industrial-future-depends-women-3890571",
        "news_paper_name": "The Daily Star",
        "publish_date": "10-05-2025"
    },
    {
        "full_article": "Our health sector has long been plagued by corruption, inefficiency, and a lack of accountability and good governance. Over the past decades, while healthcare costs have significantly increased, the quality of services has not improved as expected. The lack of adequate healthcare facilities across the country has been a persistent problem, while the absence of healthcare professionals at upazila and union-level facilities has deprived rural and marginalised populations of even basic services. Against this backdrop, the Health Sector Reform Commission's proposals give us hope for building a system that will be efficient, people-oriented, and accessible to all.\nUnfortunately, public health has never been a top priority for successive governments. While sectors such as public administration, energy, transport and communication, local government and rural development, and defence, among others, have received significant budgetary allocations, the health sector has been comparatively neglected. Therefore, the commission's suggestion that our total public health expenditure should rise to around 15 percent of the total budget, or at least 5 percent of GDP, is appreciable. Reportedly, countries making significant progress in achieving universal health coverage globally spend 5 percent or more of their GDP on healthcare. Greater investment is thus crucial, as it will expand healthcare services, reduce out-of-pocket expenses, and ensure financial protection for ordinary citizens.\nThe commission also recommends that the authorities make primary healthcare a constitutional obligation, providing it free of cost to all. It also recommends strengthening the primary healthcare system by integrating union-level health and family planning centres into fully functional primary healthcare centres. In urban areas, such centres should be managed at the ward level. We believe these reforms are crucial to ensure universal access to primary healthcare. Forming an independent Bangladesh Health Commission to ensure a transparent and effective health system is another important recommendation. Additionally, creating an autonomous Bangladesh Health Service by restructuring the current health cadre to enhance professionalism, skills, and accountability, and establishing a dedicated Public Service Commission for healthcare recruitment are steps whose time has come.\nOther major proposals include forming a National Institute of Women's Health, establishing 11 regional health authorities at the divisional level to decentralise healthcare management, integrating multiple government agencies under the Directorate General of Health Services (DGHS), and setting up a pharmacy network to distribute essential medicines either free or at subsidised rates. Additionally, prohibiting pharmaceutical companies from influencing doctors through gifts or free samples, and encouraging doctors to prescribe medicines using their generic names, seem like well-thought-out suggestions.\nThat said, while the recommendations made by the commission are crucial, implementing them will undoubtedly be challenging, especially under an elected political government. We hope the interim government will help overcome these challenges with the support of political parties and work sincerely to achieve the goals set by the commission.\n",
        "headline_1": "The health sector needs a complete overhaul",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/the-health-sector-needs-complete-overhaul-3888226",
        "news_paper_name": "The Daily Star",
        "publish_date": "10-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 10, 2025 00:00:00  \nOne of the most tyrannous legacies of the past autocratic government was the Cyber Security Act 2023 (CSA 2023) passed in September 2023. It was actually a rehash of its equally draconian predecessor, the Digital Security Act (DSA) 2018. However, in line with the promise made by the interim government under Dr Muhammad Yunus since its coming to power, the much abhorred 'CSA 2023,' is learnt to have been shorn of its nine oppressive provisions in the 'Draft Cybersecurity Ordinance 2025' approved by the Advisory Council last Tuesday, May 6. As reported, the gazette notification of the 'Cybersecurity Ordinance 2025' would soon be issued after vetting by the Ministry of Law, Justice and Parliamentary Affairs. \nAdmittedly, the entire nation, especially the members of the families harassed and persecuted by the black law as well as the public in general have obviously been greatly relieved by hearing the welcome news. However, the public would now be eagerly looking forward to seeing that all those people suffering the consequence of the now-repealed infamous law are duly compensated, the victims still in prison are released and all the cases filed under that law are automatically quashed. The issue is concerning, since as of August 2024, some 5,818 cases under the notorious CSA and its precursor the ICT and the DSA had still been pending in eight cyber tribunals during that time (September 2023). The reason for concern has been further intensified by the fact that even the former Information Adviser of the Interim Government, Nahid Islam, in October last year said during a discussion event that the black law still 'embarrassed' them because cases were filed under it (CSA) against some individuals on the allegation that they 'made comments' against him (Nahid). So, until put to a decent burial, the black laws have the history of reappearing in a fresh garb under a new administration to the dismay of all. \nIn fact, the now defunct CSA was a glaring example of how laws can be weaponised by an autocracy using a servile judiciary to muzzle free speech, deny people the right to protest and hold assemblies and exercise all other basic human rights. It may be recalled that the press and the civil society of the time were generally bludgeoned to silence, submission and compliance. But there were still many who proved to be too loyal to serve the autocracy to the utter shame of and detriment to the tradition and the noble calling. So, while hailing the repeal of the infamous law, one needs also to be mindful of the past experience that the ghost of autocracy always survives in the hearts and minds of its apologists and sycophants. They would try to use any loophole in a law, as no law ever was watertight, to resurrect the black laws afresh. If history of the nation is any guide, it cannot be gainsaid that it has left a bitter legacy regarding black laws. For, one might at this point, like to recall how the post-liberation black law, the 'Special Powers Act, 1974' (that could detain people indefinitely without bringing any formal charges against them) had been abused unabashedly by successive administrations. \nUnderstandably, the public want to be reassured that the 'Cyber Security Ordinance 2025' is freed from lapses and loopholes to avoid repetition of past mistakes. The nation has the right to be exonerated of the sins of its past.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ridding nation of  black laws",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ridding-nation-of-black-laws-1746802600",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       May 10, 2025 00:00:00  \n\nThe recent decision by the Dhaka South City Corporation (DSCC) to revoke trade licences of restaurants operating in buildings not originally approved for restaurant use, especially rooftop establishments, has sparked controversy. Citing fire hazards and unauthorised construction, the city corporation presented the crackdown as part of a long overdue effort to improve building safety in the capital. The memory of the deadly fire at Green Cozy Cottage on Bailey Road in February 2024 that killed 46 people still looms large in public discourse, which reinforces the urgency behind such measures. Nevertheless, the abruptness of the move has prompted criticism. What the authorities see as long-delayed enforcement, others view as a hasty swing from negligence to overcorrection that threatens livelihoods in an economy already struggling with high unemployment. \nOn paper, the DSCC's decision might appear as a timely intervention to enforce crucial building codes and fire safety regulations. Restaurants operating in violation of design approvals in Dhaka are hardly new. Many restaurants, especially the rooftop ones, are only accessible by narrow, rickety elevators and often lack fire exits. There is a higher risk of fire at these locations since gas cylinders and cooking equipment are sometimes kept in cramped spaces and flammable materials are often used for decoration. Similar safety concerns recently prompted the Kolkata municipal authorities in India to crack down on their rooftop restaurants, which cited the need to keep rooftops clear for evacuation and rescue during emergencies. Fires in high-rises are especially dangerous, as evacuating from upper floors takes time even under the best circumstances. In poorly designed buildings, the risks only increase. The fact that these restaurants were allowed to open without proper approvals is a clear indication of the failure on the part of both owners and regulators.\nDespite this, the backlash from restaurant owners and workers is not without merit. For one thing, the decision came without warning and with no time to adapt. Many say that securing the approval for a restaurant in Dhaka is a lengthy and cumbersome process. Given the complexity and perceived near-impossibility of full compliance, a number of establishments opted to bypass the regulations entirely and are now operating from buildings not intended for commercial use. As of March 2024, only 1,026 establishments in Dhaka South reportedly held valid trade licences, which is an alarmingly small fraction of the total. To make the matter worse, now the city corporation is revoking many of the very licences it once issued. \nHence, the burden of this failure cannot fall solely on business owners, especially when it was the DSCC itself that granted the trade licences to these restaurants in the first place. This also indicates that either due diligence was not performed or rules were knowingly overlooked during licensing process. Ultimately, it is the government's responsibility to ensure that all approvals including trade licences are consistent with safety standards. Granting business licences, only to then penalise them for non-compliance that the authority should have prevented, creates a system that unfairly punishes those who invested heavily and generated employment. Furthermore, these businesses are taxpayers who contribute significantly to public revenue through income taxes and VAT, particularly at a time when the country struggles with budget deficits. Shutting them down without offering a path to compliance thus undermines economic stability as well.\nEnforcement without reform accomplishes little. Rather than sudden closures, the DSCC could implement a phased plan by granting businesses a reasonable window to address safety shortcomings. Most urban buildings worldwide use two basic strategies to ensure fire safety in high-rises: suppression and evacuation. Suppression involves limiting the spread of fires through compartmentalisation, which is dividing buildings into fire-resistant sections. Evacuation means ensuring that all occupants can safely and quickly exit in the event of a fire. Both can be implemented in existing buildings, albeit with effort. The DSCC could, for instance, mandate the installation of fire escapes, require regular inspections or issue conditional licences that are contingent on compliance within a fixed period. These steps would encourage businesses to invest in safety while continuing to operate.\nAdditionally, urban planning authorities like RAJUK must also update its building codes to reflect modern urban commercial needs. Rooftop dining, while risky without proper precautions, is a global trend that contributes to urban vibrancy and aesthetics. Major cities around the world host rooftop venues that adhere to strict safety norms. There is no inherent reason why Dhaka cannot do the same. Achieving this, however, requires forward-thinking policy, long-term vision and coordination among government departments.\nTransparency is another crucial element missing from this initiative. If the DSCC publicly disclosed which establishments failed safety checks and why, it would build trust and reduce perceptions of arbitrary action. Citizens would be more likely to support crackdowns if they saw clear, consistent standards being applied. Such openness would also deter corruption, a persistent issue in city governance, where selective enforcement and under-the-table negotiations are all too common.\nThe decision by the DSCC follows a familiar pattern of erratic policymaking that rarely delivers lasting results. From ineffective mosquito control that fuels recurring dengue outbreaks to botched up efforts to reduce polythene use, past initiatives have often been unsuccessful due to weak planning and poor execution. Unless the DSCC revisits its decision with an eye on economic realities, this latest move risks ending the same way. Some restaurants may be forced to close, while others will reopen quietly through informal arrangements. Underhand dealing may do the trick. Inspections will be performed sporadically, if at all. In the end, public safety will not improve and confidence in governance will decline further. No one disputes the urgency of fire safety. But a blanket ban that ignores institutional failures and fails to give businesses a pathway to address safety shortcomings risks doing more harm than good. \nshoeb434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Dhaka's fire safety fix  risks backfiring",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/dhakas-fire-safety-fix-risks-backfiring-1746802703",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       May 10, 2025 00:00:00  \n\nLast week's grand rally in Dhaka, organised by an extreme right-wing group, gave a wrong message to all. In the rally, several speakers spread hatred against women in the name of religious obligations. Some of them also made misogynist remarks about members of the Women Affairs Reform Commission. One of the main demands of the rally was abolishing the reform commission and ditching its recommendations. The leaders of the organisation alleged that the commission is designed to undermine the Quranic guidance and codes in the name of equal rights of men and women. Some speakers also said that sacrifices of lives during the July-August revolution were not intended to form such a commission. \nIn the rally, the right-wing group, Hefazat-e-Islam Bangladesh to be precise, also placed a series of demands and announced further programmes to realise the demands. The main demands include: justice for the killings at Shapla Chattar on May 5 2013, during the visit of the Indian Prime Minister to Dhaka in March 2021, and the incidents in July-August 2024. The leaders and activists also called for the reinstatement of full trust and faith in Almighty Allah in the preamble of the Constitution of Bangladesh. They also demanded an end to genocide and oppression of the Muslims in Palestine and India.\nWhile the Islamist group has the right to organise protest rallies and make demands, it's crucial to review these demands thoughtfully. The explicit anger and hatred against the Women Affairs Reform Commission and its members are indeed disturbing and dangerous. Some of the commission's recommendations may be controversial and misguiding, such as the suggestion to introduce a uniform family law. However, this doesn't justify subjecting the commission members to verbal abuse. Instead, what's needed is reasonable and constructive criticism, which can lead to rational and open-minded discussions. \nThere is ample scope to examine the commission report and recommendations critically and offer counter suggestions. Some have already pointed out various drawbacks of the recommendations with logical arguments. Moreover, the government is not going to adopt all the recommendations immediately, and there is no way to implement those, either. What's crucial is to foster further debate and discussion to identify the merits and demerits of the suggestions. Every stakeholder, regardless of their views, has the right to join this democratic exercise. \nThe way the Islamist group raised objections and aired the protest is also a matter of concern. A good number of people, mostly the group activists, from different parts of the country came to Dhaka to attend the protest rally. They largely do believe that their leaders are doing the right thing, although many of them have little understanding of the critical aspects of the issue. So, they may be tempted to spread the anger and hatred here and there following their leaders. This will enhance social chaos and may even cause undue offence to women. However, it's crucial to remember that respectful discourse is essential in public debates. Some undesirable incidents have already taken place in the last couple of months, putting the freedom of women at risk. One should also keep in mind that criminals and anti-social elements may try to exploit right-wing groups under the garb of religious sentiment. \nIn Bangladesh, women constitute a significant workforce and actively contribute to various socio-economic activities. The rate of female labour force participation increased from 33.50 per cent in 2013 to 41.50 per cent in 2023, according to Bangladesh Labour Force Survey 2023. The number of female youth labour force (6.93 million) has already crossed the male youth labour force (6.91 million) in 2023. For the last five and a half decades, women have been moving ahead gradually in education and jobs besides their traditional role of maintaining families. They have already proved their diverse capabilities in various areas, and their contributions are not to be overlooked. \nNevertheless, women are still deprived of their legitimate rights and due shares in many areas. Misinterpreting the religious laws and codes is a common tool to marginalise them by different sections of society. The extreme right-wing group is also using the tool to mislead people. They must not be allowed to do so.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Disrespecting women, destabilising society",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/disrespecting-women-destabilising-society-1746802752",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 10, 2025 00:00:00  \n\nMental health remains a neglected and overlooked issue in Bangladesh. In a country of 172 million people, there are fewer than 350 psychiatrists. This means just one psychiatrist serves roughly 500,000 individuals. The situation is difficult to fathom.\nBy comparison, England, with a population of about 69 million, has approximately 6,300 psychiatrists-one for every 11,000 people. This stark contrast underscores the alarming shortage of mental health professionals in Bangladesh.\nThe World Health Organization (WHO) reports that one in eight people globally suffers from mental health conditions. Applying this ratio to Bangladesh suggests that over 20 million individuals are dealing with such issues. Yet the country has only one psychiatrist for every 60,000 patients, whereas in England, the ratio is one per 1,500. These are not just numbers-they reveal a profound humanitarian crisis.\nThe severity of the situation in Bangladesh is driven not only by a shortage of trained professionals but also by persistent societal misconceptions. Many people still equate mental illness with \"madness,\" which fuels shame and fear. As a result, individuals often conceal their conditions to avoid judgment or ridicule.\nThere is also a lack of awareness. Many Bangladeshis do not recognise that mental illnesses are legitimate and treatable. Instead, symptoms are frequently attributed to supernatural causes, leading families to seek help from faith healers rather than medical experts.\nMental healthcare services are extremely limited, particularly in rural areas where they are nonexistent. Even in cities, access is sparse. The national health budget consistently fails to prioritise mental health, keeping resources and services inadequate. Compounding the problem is the lack of understanding and empathy within families and communities. Rather than offering support, those suffering from mental disorders are often blamed or dismissed, pushing them further into isolation.\nTo change this grim reality, Bangladesh must urgently promote awareness and eliminate the stigma surrounding mental illness. It is essential to increase the number of trained psychiatrists and ensure that mental health receives greater attention in medical education. Mental health services must also be integrated into the broader healthcare system, especially at the primary care level, to make them accessible to all.\nAbove all, it must be recognised that mental health is not a luxury-it is a fundamental human right. As the WHO aptly puts it, \"Mental health is not merely the absence of disease. It is fundamental to overall health.\"\nIf Bangladesh is to avoid a deepening humanitarian crisis, the time to act is now.\nDr. Sayed Inam\nAssociate Professor, Psychiatry\ndrsaayedinam@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Mental health matters",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/mental-health-matters-1746802866",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-05-2025"
    }
]