[
    {
        "full_article": "The Leader of the Opposition in the Lok Sabha, Rahul Gandhi, has levelled serious allegations of “criminal fraud” against the Election Commission of India (ECI), by claiming that over 1 lakh fake votes were created in the Mahadevapura Assembly segment of the Bangalore Central Lok Sabha constituency in order to ensure a victory for the Bharatiya Janata Party (BJP) in the 2024 general election. His detailed presentation outlining five categories of alleged electoral malpractices demands careful examination, not wholesale dismissal. The Congress leader’s documentation reveals troubling patterns: voters registered multiple times within the same constituency, identical Electors Photo Identity Card (EPIC) numbers across different States, and improbably large numbers of voters listed at single addresses. While identical EPIC numbers across different States are not a significant issue — the ECI addressed these anomalies earlier this year — his claim that party workers found booth slips showing multiple votes by the “same person” in a single booth represents a serious violation of the “one person, one vote” principle, if verified. Mr. Gandhi claimed that these discrepancies were not limited to Mahadevapura but were part of a calculated modus operandi to help the BJP in marginal constituencies across the country. The Congress party had made similar allegations about massive increases in electoral registrations prior to the Maharashtra Assembly election, claiming that these had contributed to the unexpected victory of the BJP and its allies, though without elaborate proof of erroneous registrations as seen in Mahadevapura. Mr. Gandhi’s analysis stops short of proving that these discrepancies directly enabled the BJP’s victory. The BJP won the Mahadevapura Assembly seat in 2023 with a margin of approximately 44,500 votes. The increased margin, to over 1,14,000 votes, in 2024 happened even though the total accretions in the electoral roll were around 52,600 electors and the actual voter count increased only by around 20,000. Establishing a causal link between electoral roll errors and poll outcomes requires more than circumstantial correlation. The leap from documenting registration flaws to alleging deliberate fraud orchestrated by the ECI in collusion with the BJP remains unsubstantiated.The ECI has adopted an unnecessarily defensive stance by demanding that evidence be submitted ‘under oath’ — a requirement that legal experts suggest may not apply in this situation — and attributing electoral discrepancies to the failure by political parties to raise concerns during registration. More problematic is the ECI’s practice of releasing voter information in bulky image PDFs rather than structured, searchable text formats, which hinders verification efforts by political parties and civil society organisations. The ECI’s approach to voter registration relies heavily on self-declarations and lacks robust verification mechanisms. The Mahadevapura controversy highlights the urgent need for comprehensive electoral roll reform through door-to-door verification, the most reliable method. The ECI’s Special Intensive Revision (SIR) exercise in Bihar appears to respond to critics about electoral roll problems. In theory, this should help maintain more accurate rolls. However, rushed implementation and problematic identity verification requirements risk creating new issues related to legitimate voter deletion. Data already show higher deletions among women electors than men in Bihar. Considering that most out-migrants are males, the higher deletion of women electors could indicate that marginalised electors — particularly those who are illiterate (literacy rate of women aged 15-49 years in Bihar was 55% in 2019-21, according to the National Family Health Survey) — have been erroneously excluded in the enumeration process for the draft SIR roll.The broader challenge extends to multiple aspects of electoral administration: lax implementation of campaign finance regulations and the Model Code of Conduct, tallying VVPATs from only small samples rather than statistically significant proportions, inadequate technical safeguards for symbol loading in VVPATs, and the unwillingness to submit the EVM’s technical safeguards to independent expert verification. The ECI’s resistance to retaining CCTV footage from polling booths, delays in publishing final turnout figures, and evolution into an institution viewing criticism as an attack represent a troubling departure from democratic norms. The fundamental issue underlying current electoral controversies is the erosion of institutional trust. The ECI’s credibility depends not merely on technical soundness but also on public confidence in its impartiality and transparency. The process of appointing Election Commissioners needs to follow the Supreme Court’s recommendation to include the Chief Justice of India in the selection panel, currently side-stepped by the government. Mr. Gandhi’s allegations fall short of establishing deliberate fraud. But his party’s findings perform a valuable democratic function by highlighting systemic flaws. The appropriate response requires comprehensive voter roll auditing, enhanced transparency in data sharing, improved technical safeguards including comprehensive audit trails of EVM commands and security protocols for symbol loading, stronger enforcement of electoral regulations, and consultations with political parties. The ECI must embrace the principle that democratic institutions grow stronger through scrutiny. The alternative — continued erosion of confidence in electoral processes — poses far greater risks to democratic governance than any specific allegation of malpractice. Published - August 09, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        politics\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        Bangalore\n                    \n                            /                      \n                        \n                        Lok Sabha\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Maharashtra Assembly Elections 2024\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        democracy",
        "headline_1": "Fix the flaws: On Rahul Gandhi’s ‘stolen elections’ allegation and the Election Commission of India",
        "headline_2": "Voter registration problems demand systemic solutions by the Election Commission of India",
        "link": "https://www.thehindu.com/opinion/editorial/fix-the-flaws-on-rahul-gandhis-stolen-elections-allegation-and-the-election-commission-of-india/article69910219.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "10-08-2025"
    },
    {
        "full_article": "The Reserve Bank of India’s (RBI) Monetary Policy Committee was sensible to pause its rate cuts, as announced on Wednesday (August 6, 2025). RBI Governor Sanjay Malhotra rightly pointed out that the uncertainties surrounding tariffs are still evolving, and that the 100 bps of rate cuts implemented since February 2025 are still percolating through the system. Mr. Malhotra’s statement was made before U.S. President Donald Trump approved an additional 25% tariff on imports from India, over and above the existing 25% reciprocal tariffs. However, his assessment that the matter is far from over was nevertheless accurate. India is still in the process of negotiating a Bilateral Trade Agreement with the U.S., and the final tariffs are far from decided. In the meantime, Mr. Trump has already indicated that similar additional tariffs — “penalties” for buying oil from Russia — may be imposed on other countries as well, which will impact India’s comparative advantage. Leaving room for another rate cut later in the year when things might be clearer, thus, was the sensible thing to do. The other broad reason why the pause makes sense is that it allows the RBI to see whether such monetary measures are working. A 100 bps cumulative cut in rates over the last six months is significant, and the banking system needs time to pass that on to borrowers. The Governor also pointed out that there is ample liquidity in the system, which means the banks have the money to lend.The question, however, is whether there is enough growth-related borrowing happening. RBI data show that, as of end-June, loans to purchase consumer durables had contracted about 3% compared to the previous year. Growth in housing loans slowed sharply to 9.6% from 36% a year earlier, while vehicle loans too slowed by five percentage points over the last year. In line with this subdued demand outlook, companies too seem to be slowing their borrowing. Loans to industry grew 5.5% in June 2025, down from 8.1% in June last year. Simply reducing rates, therefore, is not enough and that is something the Governor alluded to when he said stronger policy frameworks “across domains, and not just limited to monetary policy”, would be pivotal in achieving India’s growth potential. The government has to intervene in a more focused manner than just increasing capital expenditure across the board. A lot can be done through tax. The Goods and Services Tax rate rationalisation, that was promised several times, is long overdue. A reduction in fuel prices in line with lower oil prices, too, will lift consumer sentiment. The RBI can, for the moment, afford to wait things out. The government does not have this luxury. Published - August 08, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        interest rate\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        imports\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        trade agreements\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        vehicle loans\n                    \n                            /                      \n                        \n                        loans\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        housing loans",
        "headline_1": "​Time for action: On the RBI pausing rate cuts",
        "headline_2": "The Reserve Bank of India did well to pause rate cuts amid the uncertainties",
        "link": "https://www.thehindu.com/opinion/editorial/time-for-action-on-the-rbi-pausing-rate-cuts/article69905834.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "10-08-2025"
    },
    {
        "full_article": "Until early August, the tariff sparring between Washington and New Delhi looked like another familiar round over soybeans. With China halting purchases and harvests approaching, it seemed like the US was looking for a buyer in India, as soybean farmers are a key MAGA base for Trump. Then, over just three days, the story shifted — from agriculture to a high-stakes game of geopolitics.\nUnder the pump: US domestic politics and midterms have a lot to do with this pressure on India to cut purchase of Russian oil\nOn Aug 6, President Trump’s negotiator, Steve Witkoff, met Russian president Vladimir Putin in St Petersburg for over three hours. Though billed as “constructive”, the talks yielded no major breakthrough. That same day, the White House announced an extra 25% tariff on Indian goods — lifting effective duties toward 50% — and framed the decision partly around New Delhi’s continued intake of discounted Russian crude. In India, this was perceived as arm-twisting of its sovereignty, but a larger strategy was at play.\nThe urgency in Washington comes from geopolitics as much as economics. The Ukraine war remains a key focus. In recent months, Russia has made incremental gains in Ukraine, giving it little reason to compromise. Official data showed a year-on-year rise in oil and gas revenues earlier this year, giving the Kremlin fiscal space to sustain the war. On another front, BRICS members are pushing for local-currency energy trade pilots. July’s Rio summit saw Brazil and others call for “economic sovereignty” from the dollar. If those systems take root, US sanctions will have less bite. It appears the White House wants to hit Russian revenues while the leverage window remains open.\nThe domestic political calendar makes this even trickier. The midterms are barely a year away and while inflation has eased, it remains sensitive to fuel prices. Even a small Brent crude spike can quickly translate into higher gasoline costs, eroding consumer sentiment and complicating the Federal Reserve’s path to cutting interest rates — a move the administration sees as vital to sustaining growth into 2025. A direct embargo on Russian oil would risk that spike, so Washington needs other channels.\nSince 2022, India has vaulted from a marginal buyer to Russia’s largest swing customer, taking roughly 1-1.8m barrels of crude a day. Unlike private refiners tied to long-term contracts, India’s state-owned refiners can quickly adjust their spot purchases when prices or risks change. If India reduces its spot purchases by 200,000 to 300,000 barrels a day, Russia may have to offer bigger discounts to other buyers, cutting its revenue by billions over a year. This would pinch Moscow’s earnings and avoid a price surge that hurts American consumers. China, a larger buyer of Russian oil, has so far been spared to avoid disrupting US supply chains and ongoing tariff talks. Early signs suggest the tactic is having a marginal effect in India. One major state refiner recently reported a lower share of Russian crude as discounts narrowed. This is the kind of fine-tuning Washington is aiming for.\nFor New Delhi, the irritation is real. It has watched Washington oscillate between warm words and hard edges — like this tariff move that risks raising Indian fuel costs while shielding US consumers. Yet this is also a moment to read beyond the headlines. Pakistan, despite entering this cycle with less leverage, has found its way into Trump’s good books by using a cryptocurrency gambit and backing his bid for a Nobel Peace Prize. This has helped it carve out a tariff deal. India’s own leverage is far greater: market size, strategic geography, technology and defence partnerships, and a pivotal role in energy flows. The smart play is to deploy that leverage to meet Trump’s immediate need in exchange for wins of India’s choosing. When both sides know they hold valuable cards, the game would be to trade them well, rather than escalate.\nThis standoff is about much more than tariffs or a few oil shipments. For Washington, it is a test of whether it can squeeze Russia’s war chest without spiking global fuel prices, hold China in check, and prevent the BRICS bloc from hardening into a true economic counterweight — all while keeping US inflation low enough for interest rates to fall. For New Delhi, it is about using its position as the swing buyer in the world’s most strategic commodity to protect its autonomy, avoid an unnecessary rupture with America, and still extract tangible gains.\nThe outcome will influence far more than trade flows. It will help decide who has the upper hand in setting oil prices, which currencies dominate energy trade, and whether the next global economic order tilts toward US-led systems or a more multipolar, BRICS-shaped architecture. How India and the US play this hand could echo for years in energy markets, currency systems, and the balance of global power.\n\n",
        "headline_1": "Decoding US moves: Tariffs on India aren’t about India",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/voices/decoding-us-moves-tariffs-on-india-arent-about-india/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-08-2025"
    },
    {
        "full_article": "There is indeed a ‘Bangladeshi’ language. But it’s not what Delhi police were thinking when they put out a notice looking for interpreters “proficient in Bangladeshi national language”.  Nor is it what BJP IT cell convener Amit Malviya was thinking when he defended the letter saying, “the official language of Bangladesh is not only phonologically different but also includes dialects like Sylheti that are nearly incomprehensible to Indian Bengalis”. Neither are TMC politicians quite right when they stoutly lay claim to some uniform Bengali language identity spanning West Bengal and Bangladesh extending into Assam and Tripura.\nThere is a difference. The first time I went to Dhaka, about a decade ago, a young man who was showing me around asked if I wanted to go to the museum. But he used the beautifully evocative Bengali word jadughar, house of magic, a word I had almost forgotten. In Kolkata, people like us just said ‘museum’ even when talking in Bangla.\nWhen I told my mother, she said they still speak in Bangla there, here you speak in Benglish. In Bangladesh, a country whose birth pangs were tied to Bangla, language felt far more potent than it did in Kolkata where Bengali, English, Hindi had all become mishmashed into a Radio Mirchi-style khichdi. At the liberation war museum in Dhaka, I saw an old clipping from the Pakistan Observer which declared that Tagore songs were deemed “against Pakistan’s cultural values”. The report’s tone was matter of fact. But the headline gave away the shock with a punctuation gasp —Broadcast ban on Tagore!\nIn a strange way what the current furore over Bengali has inadvertently done is re-ignite pride in Bangla as a language at a time when more and more of us have gotten used to not reading  a Bengali newspaper, let alone a Bengali book. Memes have flooded social media reminding everyone that Bengali is not a “foreign language”, that it has given us a national anthem and a Nobel laureate; India’s only Oscar winner for lifetime achievement Satyajit Ray made most of his films in Bangla. Even Vande Mataram, when read in its entirety, was written in Bengali script in a mix of Sanskrit and Bangla. I spotted a meme showing Rabindranath Tagore delivering a stinging slap to a Delhi police officer while saying, ‘This slap is in Unicode Bangla’.\nEach side has its own political agenda. BJP wants to root out illegal migrants from Bangladesh from electoral rolls. Some of its supporters think they can use language as a quick and dirty way to mark people as the other. The Trinamool Congress wants to frame this as an attack on Bengali as a language rather than on illegal immigration.\nBut this political slugfest has ended up being a fascinating linguistic education for the rest of us. For example, in the last few weeks I have learned that not only were there language martyrs in Bangladesh, eleven people protesting the erasure of the Bengali language were killed in Assam’s Barak Valley in 1961. They were Sylheti Bengalis, the dialect Malviya called “incomprehensible to Indian Bengalis”.\nThe political problem of illegal migration the govt wants to tackle is real. But language remains an ineffective and blunt instrument to tackle it. For example, we keep hearing stories in the USA of Donald Trump supporters calling immigration enforcement on people they hear speaking Spanish in a public space. As a result, immigration raids have swept up US-born Latinos who have served in the US military just because they looked and sounded Latino. Language is not a citizenship ID.\nBureaucrats draw borders but language seeps through them. The Bangla I spoke in Kolkata was very different from the Bangla the woman from Midnapore who raised me spoke. Kotiya chhua, little mouse, she called me, words my mother never used. Her Bangla was different as was the Bangla of my great aunts whose families hailed from what is now Bangladesh. We sometimes laughed at each other’s peculiar turns of phrase. But there was enough room for all of us under the Bengali umbrella.\nWhile WhatsApp forwards claimed an easy language litmus test was to see who calls father ‘baba’ and who calls him ‘abba’, the linguistic roots of all these words defy ‘otherisation’. Baba comes from Arabic. Abba comes from Aramaic. And while people on this side of the border might call salt ‘noon’ and on the other side they might say ‘lobon’, both ultimately trace back to the same Sanskrit root ‘lavan’. But then I read an essay in The Aerogram by Californian writer Nazia Islam about a grandmother who used both in the same breath. “Arre noon/lobon de (give me more salt),” she would say. What will we do with her?\nBut then, is there any room for the salt of the earth in a world of namak harams?\n\n",
        "headline_1": "Lobon or noon? The trouble with using language to draw borders",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/paper-cut/lobon-or-noon-the-trouble-with-using-language-to-draw-borders/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-08-2025"
    },
    {
        "full_article": "India’s relations with Russia have once again come into the spotlight, not because anything unusual is happening between them, but because of what others are saying or doing.\nNSA Ajit Doval’s visit to Moscow, cancelled at the last minute a few weeks ago, was scheduled long before Trump dropped the tariff bombshell on India. Similarly, an impending visit by foreign minister Jaishankar to Russia is part of the regular meetings of the India-Russia Intergovernmental Commission. A bilateral summit between India and Russia, not held in India since 2021, is expected to take place later this year. Modi and Putin spoke yesterday. All these are par for the course, and not signs of any Indian design to bring down the Western-led world order.\n\nRead full opinion on TOI+\n\n",
        "headline_1": "Swinging four of geopolitics",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/swinging-four-of-geopolitics/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-08-2025"
    },
    {
        "full_article": "Last month, Saina Nehwal and her husband Parupalli Kashyap announced that they are splitting up. As is required of celebrities today, she released a statement. It revealed that after great deliberation they as a couple have decided to part ways and are choosing “peace, growth and healing” as opposed to the usual toxic mud-slinging that I was personally hoping for.\nEvery time a celebrity couple behaves in a dignified fashion by opting to respect each other rather than wash, rinse and spin-dry their filthy laundry in public I am a little irritated because apparently my petty life can only be elevated by bad things happening to other people.\n\nRead full opinion on TOI+\n\n",
        "headline_1": "Marriage isn’t made in heaven, divorce needn’t be hell",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/read-it-and-weep/marriage-isnt-made-in-heaven-divorce-neednt-be-hell/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 10, 2025 00:00:00  \nJust when it seemed the worst of the inflationary storm might be passing, official data confirm that price pressures are rising again. After three consecutive months of moderate decline aided by strong agricultural output, inflation in Bangladesh has reversed course. The Bangladesh Bureau of Statistics reports that the point-to-point inflation rate in July increased to 8.55 per cent, slightly higher than June's 8.48 per cent. This renewed increase is occurring despite the continuation of a contractionary monetary policy aimed at curbing inflation. In an economy where a large informal sector limits the reach of formal policy tools, the impact of such monetary measures may fall short and the recent uptick in inflation is a telling sign of that limitation. The government had set a target of bringing average inflation down to 6.5 percent within this financial year, but with prices rebounding earlier than expected, meeting that goal now looks increasingly doubtful.\nParticularly troubling is the rise in food inflation, which increased to 7.56 per cent in July from 7.39 per cent in June, putting added pressure on household budgets and kitchen markets across the country. Urban residents are struggling more than their rural counterparts, with overall inflation in cities reaching 8.95 per cent compared to 8.55 per cent rural areas. Non-food inflation remained also stubbornly high, standing at 9.55 percent in urban areas and slightly higher at 9.73 percent in rural regions. The previous three-month decline in inflation was largely attributed to abundant agricultural harvests. The fact that food prices are rising despite these harvests suggests that the issue lies more with supply distribution than with supply availability. The persistently high non-food inflation also points to the supply-side constraints and production inefficiencies as significant factors for the current situation.\nFor average Bangladeshis, particularly low-and-middle-income families, higher prices are bad news because they reduce real income and make people poorer. Although the Wage Rate Index (WRI) increased slightly to 8.19 per cent, wages still fail to keep pace with inflation. Without effective intervention, this trend could exacerbate inequality and fuel social discontent. Conventional inflation-control measures like tightening money supply and raising interest rates are proving less effective because when the root causes are supply-side barriers, monetary policy alone is insufficient. These barriers such as disruptions in food distribution, soaring import costs and market inefficiencies require broader interventions. The upcoming national elections present additional inflationary risks, as anticipated increases in campaign spending are likely to expand money supply, potentially pushing inflation even higher.\nTo rein in inflation, the government must prioritise stabilising food prices given their outsized role in this crisis. This requires strengthening agricultural supply chains through targeted investments in storage facilities, transportation infrastructure and improved market linkages to ensure consistent flow of goods across regions. However, even when supplies are sufficient, market intermediaries can exploit consumers by charging excessive margins in the absence of proper oversight. This is why stricter enforcement against market manipulation and hoarding, along with digital price tracking, is crucial to curb unfair practices. There is also a pressing need for a strategic reserve system for essential imports such as food and fuel that can be used as buffer against sudden price shocks. The recent rise in inflation is a clear warning that complacency is not an option. Policymakers must respond with a clear and coordinated plan. Failure to do so will not only allow prices to rise further and undermine inflation control efforts, but also intensify economic hardship for millions.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Inflation comes back to bite",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/inflation-comes-back-to-bite-1754747515",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       August 10, 2025 00:00:00  \nThe announcement of a 20 per cent reciprocal tariff on all imports from Bangladesh by Donald Trump, the president of the United States (US), has brought a palpable sense of relief in Bangladesh. This announcement, made on July 31, set new reciprocal tariffs on 70 countries, including Bangladesh. The tariff rates on these countries range between 10 per cent and 71 per cent and came into effect last Thursday. \nEarlier on July 8, the US president proposed 35 per cent reciprocal tariff on Bangladesh but suspended the same for three weeks to give room for negotiation. During the period, the official trade delegation of Bangladesh rushed to Washington to negotiate with the USTR officials and reach a deal with the Trump administration reducing the reciprocal tariff to a reasonable rate. It is to be noted that Trump first announced a 37.50 per cent reciprocal tariff on Bangladesh on April 2 this year, when he also imposed different rates of tariff on more than 100 countries along with a 10 per cent universal tariff. Soon, responding to requests from different trade partners, he suspended levying of the proposed tariffs for 90 days, literally asking them to make a deal individually with the US to get tariff reduction. Dr Muhammad Yunus, chief adviser of the interim government, in a letter to Trump, also requested him to provide a three-month time before finalising the tariff.\n\nNevertheless, three months is not enough at all for a country like Bangladesh to negotiate a reasonable trade deal or free trade agreement (FTA) with the world's most powerful nation. The structure of the US FTA with any-country goes beyond trade in goods and services. It extensively covers investment, intellectual property rights and standards of labour and environment. The US believes in 'deep integration' and so full liberalisation of goods and services is an inherent component of any bilateral (BFTA) with the US. Moreover, the BFTA goes beyond the obligation of multilateral Intellectual Property Rights (IPRs) or Trade Related Aspects of Intellectual Property Rights (TRIPS) of the World Trade Organization (WTO). The US also stresses investment protection as embodied in the FTA, mainly for the protection of the interests of the US-based Multi-National Entities (MNEs). There are also provisions for environment and labour standards, and any BFTA with the US can't be complete without the inclusion of these two components. Thus, a BFTA with the US is actually a comprehensive agreement that supports economic and even political reforms in the partner countries. This is the reason why very few countries sign any BFTA with the US. So far, only 20 nations have signed BFTA with the US. \nAfter becoming the president of the US in 2016, Trump put stress on reaching BFTA with the trading partners and asked them to negotiate bilaterally instead of multilaterally under the umbrella of the WTO. But during the four years of his first term, no country signed any BFTA mainly due to the complex structure and time-consuming negotiation. In his current term, Trump has virtually abandoned the practice of prolonged negotiation and started to use tariffs as the main tool to compel other countries to sign trade agreements with the US. It seems that tariffs as a weapon are working, as a number of trading partners have agreed to sign bilateral deals to avoid excessive tariffs. \nThe Bangladesh delegation, led by the commerce adviser, demonstrated unwavering determination and hard work in convincing the Trump administration to agree to a lower tariff on Bangladesh. In exchange, they agreed to a set of conditions, offering trade and non-trade benefits to the US, along with almost zero tariffs to almost all the products importable from that country. Though the details of the negotiated deal are yet to be unveiled formally, it is learnt from the media that Bangladesh is likely to purchase 25 aeroplanes from Boeing, the US aviation giant, along with an increase in imports of wheat, edible oil, crude fuel oil, cotton and military equipment. The country is also likely to sign a number of international agreements on IP rights and address the US concern on data protection act. Finding no other alternative within such a short period of time, it appears Bangladesh has mostly aligned with the US FTA structure. One, however, needs to look into the past before making any final comment on the latest development.\nTwelve years ago, the Obama administration suspended the GSP Generalised System of Preference (GSP) facility due to the Rana Plaza tragedy that claimed more than 1,100 lives of garment workers. Thus, the US gave a message to Bangladesh that prompted the country to sign the Trade and Investment Cooperation Forum Agreement (TICFA) in the same year. As GSP covered only one per cent of the total exports to the US, policymakers did not put much effort into restoring the facility. Instead, discussion on signing a BFTA with the US gained momentum. It had also paused for two reasons. First, Bangladesh did not sign any FTA with any country, let alone with a big trade partner. Second, the gradual deterioration of the relationship between the now ousted Hasina regime and the US. If the policymakers put some serious effort into advancing a bilateral trade deal with the US at that time, instead of putting much effort into graduation from the Least Developed Country (LDC) status, Bangladesh might be in a better position today in dealing with Trump's tariffs. \nA big question now is whether Trump will stick to the 20 per cent tariff on Bangladesh. What will happen if he suddenly shifts his position even before signing the bilateral reciprocal trade agreement? Or even after signing the agreement? The answer is unknown as it is not possible to rule out such a possibility. Trump has already proved it by increasing the 25 per cent tariff on India to 50 per cent within 24 hours. He also asked India to stop purchasing oil from Russia or face the higher tariff on certain products, including textiles and clothing, after August 21. This is good news for Bangladesh as the country's clothing exports will face less competition with India in the US market at least for some time in the near future. Indian apparel exporters fear that many US buyers would move to Bangladesh and Vietnam because of higher tariff.\nasjadulk@gmaill.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "How dicey is the Trump tariff deal?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/how-dicey-is-the-trump-tariff-deal-1754747853",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       August 10, 2025 00:00:00  \nDhaka is adjudged one of the most polluted cities in the world in various international rankings. Due to high percentage of carbon compounds, lead and various particulate objects, air pollution in the city have reached such an alarming level that increasing number of people, especially children, are developing asthma and other respiratory diseases. A recent study conducted by icddr,b and Stanford University lends credence to the city's deteriorating level of air pollution its severe cost.\nThe joint study on 500 slum children aged two to four years in the city has found that around 98 per cent of them have concerning levels of this toxic heavy metal in their blood. In Dhaka South, where lead-emitting industries are concentrated, the situation is even worse. Every single child in the study carried lead in their blood in Dhaka South, a shocking indication of how unavoidable this poison has become in our environment.\nLead is a toxic heavy metal that occurs naturally in soil and minerals. But because of human industrial activity, it is now found in food, water, air, toys, cosmetics, cooking utensils and even household dust. Common sources of exposure include battery-related industries, lead-based paints and cosmetics, and contaminated consumer goods. Lead can enter the body through breathing, eating or skin contact.\nThe World Health Organization warns that children are especially vulnerable as their bodies absorb four to five times more lead than adults. Their natural curiosity, hand-to-mouth behaviour, and tendency to put objects in their mouths make them far more likely to ingest lead-contaminated dust, soil and paint. \nAccording to the US Centers for Disease Control and Prevention (CDC), lead exposure can seriously harm a child's growth and development, causing damage to the brain and nervous system, learning and behavioural issues, hearing and speech problems, lower IQ, and decreased attention levels, among other conditions. The CDC considers blood lead levels (BLLs) above 3.5 micrograms per decilitre to be concerning, especially for babies, while WHO maintains that there is no safe level. The study on Dhaka's children found 6.7 micrograms of lead per decilitre of blood, far exceeding tolerable limits.\nLead pollution is getting worse mainly because the number of battery-powered rickshaws is increasing. These rickshaws use lead-acid batteries, which contain large amounts of toxic lead. When these batteries reach the end of their lifespan, they need to be disposed of or recycled. The problem is that in many cases, this disposal process is unsafe and unregulated. People often open the batteries to extract and reuse the lead, or melt it down for other purposes, without proper protective measures. This releases lead particles into the air, soil, and water, contaminating the environment and posing serious health risks - especially to children living nearby. Lead also ends up in the soil, water, and directly in the environment. Experts warn that while carbon emissions from burning oil or gas are dangerous, lead contamination poses a far greater long-term threat.\nThe government must urgently develop a comprehensive plan to eliminate all sources of lead exposure, not only in Dhaka but across the country. This includes relocating lead-polluting industries away from residential areas, strictly regulating informal battery recycling, enforcing safety standards, and phasing out lead in consumer products. Public awareness campaigns must highlight the dangers, and children must be protected from working in high-risk factories.\nLead poisoning is not only robbing children of their health, intelligence, and potential, it's also stealing the future of the entire nation. The authorities, therefore, should take all necessary measures to safeguard our children's well-being and ensure they grow up healthy and empowered to contribute meaningfully to the nation's progress.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Save children from lead poisoning",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/save-children-from-lead-poisoning-1754747940",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 10, 2025 00:00:00  \n\nThe debate between minimum wage and living wage is more than just an economic issue; it's a matter of basic human dignity. While the minimum wage sets a legal floor for earnings, it often falls short of covering the real cost of living, especially in cities where housing, food, and healthcare are becoming increasingly unaffordable.\nAs a result, many full-time workers still struggle to meet their basic needs despite being employed. A living wage, on the other hand, reflects the income necessary for a person or family to live decently without financial hardship.\nIt promotes economic stability, reduces dependence on social welfare programs, and improves employee morale and productivity. Critics argue that raising wages may burden businesses, but evidence from companies that already pay a living wage shows increased retention and better performance.\nTo ensure fair economic growth, policymakers must focus not just on employment, but on the quality of income. No one who works full-time should live in poverty.\nRahim Hossain\nStudent\nBachelor of Business Administration\nNorth South University\nrahim.hossain01@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why the living wage matters?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-the-living-wage-matters-1754747956",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-08-2025"
    }
]