[
    {
        "full_article": "The Supreme Court’s judgment on the conduct of Tamil Nadu Governor R.N. Ravi is set to have a far-reaching impact on Centre-State relations, underscoring as it does India’s federal principles in what are undoubtedly fraught times. The verdict enhances the administrative autonomy of States, and regulates the functioning of constitutional offices, with implications for the entire country. In the case which concerns Mr. Ravi’s handling of 10 Bills passed by the State Assembly, the Court has effectively changed how Governors carry out their constitutional responsibilities. The intervention comes at a time when tensions between Governors and governments in States ruled by parties other than the BJP have peaked — especially over issues such as the appointment of Vice-Chancellors (V-Cs) to State-run universities, where Governors serve as Chancellors. It is no coincidence that the Bills at the heart of the case sought to replace the Governor with the State government as the authority for appointing V-Cs. Mr. Ravi had forwarded these Bills to President Droupadi Murmu after they were re-adopted by the State Assembly. The Court held that the Bills were deemed to have received assent. It described the Governor’s action of referring the Bills to the President as “not bona fide”, and his conduct as “arbitrary, non est, and erroneous in law” — language that resembled a performance appraisal of the gubernatorial office. In normal circumstances, such a severe reprimand would have resulted in the resignation of the person whose conduct was under scrutiny: Mr. Ravi. But these are not normal circumstances, and Mr. Ravi was certainly playing the politically partisan role assigned to him by the government at the Centre, led by the BJP, which is inimically disposed to the DMK that is in power in Tamil Nadu. Hindrance was the strategy.\rThe significance of the judgment goes beyond the censure of a particular Governor. It lays down definite timelines for Governors to act on Bills. It ensures that Governors can no longer indefinitely delay legislation under the pretext of scrutiny or act whimsically or with impunity. The Court has reaffirmed a constitutional principle that has often been undermined: that Raj Bhavans must function with transparency, and accountability. With the legislation now in force, the Tamil Nadu government has the authority to appoint V-Cs and must act swiftly to fill these vacancies in 12 universities, and are made based on merit, integrity, and competence, given past allegations of corruption. This judgment is not merely a legal milestone; it is a call for constitutional morality and cooperative federalism, and restoration of dignity to the office of the Governor, who, as the Court pointed out, is expected to act as friend, philosopher, and guide to the State Cabinet, and not as a blunt instrument of the Centre.\r Published - April 10, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Governor\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        university\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party",
        "headline_1": "​Legal milestone: The Supreme Court and the Tamil Nadu Governor",
        "headline_2": "Cooperative federalism must guide conduct of Governors",
        "link": "https://www.thehindu.com/opinion/editorial/legal-milestone-the-supreme-court-and-the-tamil-nadu-governor/article69431826.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "10-04-2025"
    },
    {
        "full_article": "The ongoing programme of revoking the visas of foreign students in the U.S., ostensibly for opposing the country’s foreign policy, is a direct outcome of the xenophobic tendency in the Trump administration. The danger is that the ‘Make America Great Again’ movement that propelled Donald Trump into the Presidency may soon permeate deep into campus life too. In any case, the number of Indian students enrolling in U.S. universities has been on a downward trend since last year — even before the drumbeats of hostility started. Indian students are already finding other countries such as Germany attractive for lower costs and greater flexibility to self-fund their education through work. Enrolment figures for September this year will demonstrate how attractive the U.S. still is for Indian students despite the looming cancellation of the Optional Practical Training programme that offered a segue for foreign students to working in the U.S. All this, together with the defunding of research and arm-twisting of universities in a country known to value academic freedom, has indeed lowered, if not upended, the regard that people outside had for the U.S.Many countries have sought to leverage the decline of the U.S. as a destination for talent. Reports talk about European institutions welcoming disgruntled U.S.-based researchers, ironically noting that scientists and researchers fleeing persecution greatly contributed to American progress in the past. For a while now, Indian returnees have been driven in-part towards a desire to come back home or even serve their motherland. Professional achievement or the opportunity to do high-end research has not always been a big driver towards India attracting back its people. While, outwardly, new vistas have opened, research opportunities have expanded, and the fight for funds is less intense, in part due to the encouragement given to private institutions, much work remains to be done. Loosening up the government’s purse strings and goading private institutions to invest in research more may only be the starting point. What often puts off returnees is the daily struggle in India. The struggle not only characterises everyday social life but also the workplace. Collaboration between institutions or even across departments is a tough sell. The suffocating social norms and hierarchies are a downer. Lastly, the academic freedom that Indians are used to enjoying elsewhere will need to be recreated. That would require a complete overhaul in the Indian government’s attitude to liberal values and towards foreigners, which often borders on the Trumpian.\r Published - April 10, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        students\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        higher education\n                    \n                            /                      \n                        \n                        research\n                    \n                            /                      \n                        \n                        Germany\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        government",
        "headline_1": "Home and abroad: On India and the Indian student",
        "headline_2": "India must improve research infrastructure to serve its students",
        "link": "https://www.thehindu.com/opinion/editorial/home-and-abroad-on-india-and-the-indian-student/article69432375.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "10-04-2025"
    },
    {
        "full_article": "Mighty America was on an unsustainable path of large fiscal deficits (spending more than earning), high current account deficits (consuming more than producing), and an ever-increasing debt-to-GDP ratio. Considering the immense unfunded medical care and social security liabilities, there was an immediate need for course correction.\nTrump aimed to cut the current account deficit by imposing tariffs, reduce fiscal deficit by curtailing wasteful govt spending through Musk-led DOGE, earn revenue from tariffs, stabilise the debt-to-GDP ratio through a sovereign wealth fund and a revaluation of gold reserves.\n\nRead full opinion on TOI+\n\n",
        "headline_1": "Tariffs: Picture abhi baki hai",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/tariffs-picture-abhi-baki-hai/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-04-2025"
    },
    {
        "full_article": "A Supreme Court bench of Justices JB Pardiwala and R Mahadevan gave a pivotal judgment yesterday in State of Tamil Nadu vs The Governor of Tamil Nadu – a governor cannot have absolute veto or ‘pocket veto’ (to indefinitely sit) on bills sent to him by the state legislature. SC declared 10 pending bills passed by TN legislature as deemed to have been approved by the governor. It importantly set a timeline for action on all future bills, a provision not included under Article 200 of the Constitution.\n\nRead full opinion on TOI+\n\n",
        "headline_1": "Why the guvs were off & how the game got changed",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/why-the-guvs-were-off-how-the-game-got-changed/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-04-2025"
    },
    {
        "full_article": "By Vipul Anekant\nIt is crucial to reflect on how the contemporary socio-economic systems, political ideologies, and scientific theories that dominate our discourse today can be traced back to profound teachings of Mahavir from over 2,600 years ago. Mahavir introduced the principle of anekantvad, which can be translated as ‘non-absolutism’ or relativity of perspectives.\nIn essence, it underscores the idea that truth is multidimensional, and no single viewpoint can claim to be the absolute truth. Anekantvad is a recognition of complexity and relativity of reality, where each individual’s perception is a partial reflection of the whole.\nMetaphysically, anekantvad suggests that reality is multilayered, with countless aspects that cannot be fully comprehended from a singular perspective. Mahavir taught that no single viewpoint could encompass the full spectrum of truth, and that seemingly contradictory views can coexist, each reflecting an aspect of the ultimate reality. This relativist stance led to the concept of ‘Naya’, perspective, a framework through which different viewpoints can coexist harmoniously.\nThe Jain doctrine of Syadvad, sevenfold predication, derives from this very idea, emphasising multiplicity of truth by acknowledging complexity and variability of reality. The core of anekantvad revolves around three fundamental principles:\n\nMultiplicity of truth | Each individual perceives the same event or object from their unique perspective, shaped by personal experiences and context.\n\nNon-absolutism | No single perspective can claim absolute authority over truth; all viewpoints offer partial insights.\n\n\nRelativity of knowledge | Truth is contingent on context and perspective, encouraging tolerance and respect for differing ideologies.\nIn the modern liberal democratic context, anekantvad fosters a culture of pluralism and diversity, advocating for peaceful coexistence and dialogue among various beliefs and ideologies. It aligns closely with the contemporary notion of ‘agree to disagree’, emphasising mutual respect despite differences. People can disagree but still understand each other’s views. Philosophically, it resonates with Einstein’s Theory of Relativity, which stresses the relative nature of time, space, and observation, highlighting the interconnectedness of all perspectives.\nThus, Mahavir’s doctrine of anekantvad embodies the highest form of liberalism, pluralism, and freedom of expression, promoting a harmonious coexistence of diverse thoughts in a democratic society.\nAhimsa, the principle of nonviolence, forms the bedrock of Mahavir’s ethical framework. It extends beyond mere absence of physical harm to encompass compassion, forgiveness, and avoidance of harmful thoughts, harsh words, and ill intentions. For Mahavir, ahimsa was the supreme moral virtue – not just towards humans, but to all forms of sentient life.\nMK Gandhi eloquently said, “No religion has articulated principle of ahimsa as systematically and deeply as Jainism, applying it in every facet of human life.”\n\n",
        "headline_1": "Anekantvad, ahimsa, and roots of modern pluralism",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/anekantvad-ahimsa-and-roots-of-modern-pluralism/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-04-2025"
    },
    {
        "full_article": "SC ruling on TN guv applies to guvs in all oppn-ruled states. It removes a constitutional ambiguity\nGovernors in opposition-run states can’t be a law unto themselves. SC made this abundantly clear with a strongly-worded judgment against Tamil Nadu governor RN Ravi on Tuesday. Ravi, though, has been here before. In March last year, SC had pulled him up for refusing to reinstate a minister on the CM’s recommendation. But this time, a bench of justices JB Pardiwala and R Mahadevan has delivered a landmark verdict that not only clears 10 pending bills – one of them stuck since Jan 2020 – in one stroke, but also limits the power of governors across states to delay inconvenient bills indefinitely. The 10 bills Ravi had stymied, for example, would have loosened Centre’s grip on institutes of higher education in TN, including the power to appoint vice-chancellors.\nGovernors vs states is an old story, and recommending president’s rule used to be the top trick in a governor’s playbook. Now, sitting on bills, refusing to convene assembly sessions, and rejecting VC appointments are more common across opposition-run states – Kerala, Telangana, West Bengal and Punjab, besides TN. In Nov 2023, for instance, SC had agreed with Punjab’s complaint against governor Banwarilal Purohit, who had withheld approval for four bills. That should have been Ravi’s cue to clear the TN bills he had jammed, but he lobbed them into the President’s court instead. On Tuesday, SC ruled that his action was “erroneous and illegal”.\nWithout “undermining” the governor’s office, the court upheld the supremacy of the elected legislature: “The members of the state legislature have been elected by the people of the state as a result of the democratic outcome (and) are better attuned to ensure the well-being of the people.” It said a governor – and this applies not just to Ravi – does not have a “pocket veto” and must be “guided not by considerations of political expediency but by the sanctity of the Constitutional oath he undertook”.\nWhat makes this judgment different from others on the subject is that SC has removed an ambiguity arising from the wording of Article 200 of the Constitution. Where the Article says governors must send bills for reconsideration “as soon as possible”, SC has said governors will have a maximum of three months to return a bill for the state govt’s reconsideration, or send it to the President. That’s a long-overdue blow for federalism. \n\n",
        "headline_1": "Raving no more",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/raving-no-more/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-04-2025"
    },
    {
        "full_article": "It is encouraging to read the latest World Bank Group report on investment prospects in Bangladesh. Prepared by the group's International Finance Corporation (IFC) and unveiled at the ongoing Bangladesh Investment Summit on Tuesday, the report identifies four strategic sectors—green ready-made garments (RMG), middle-class housing, paint and dyes, and digital financial services—as ripe for reform. These sectors, it argues, are mature and politically feasible enough to be restructured in ways that could create millions of jobs, draw both local and foreign investment, and spark a ripple effect of productivity in other interconnected sectors. The question is, can we do what's needed to bring about this change?\nIn recent days, there has been much talk about Bangladesh's investment scenario with the government taking steps to woo global investors. The four-day summit, somewhat overshadowed by concerns surrounding the new US tariff policy, which went into effect on April 9, is meant to provide a boost in this regard. For this, reforms are essential even while new deals and commitments are being made. With proper reforms, the WB report estimates, the construction sector alone could add over two million jobs annually by supporting new housing developments for middle-income families. A further 664,000 formal jobs could be generated by expanding local production of paint and dyes. Targeted interventions in digital financial services could also yield between 96,000 and 400,000 additional jobs.\nHowever, achieving such outcomes requires addressing long-standing barriers to doing business in Bangladesh, such as erratic power supply, high prevalence of informal economy, high borrowing costs, our complex and inefficient tax regime, and other bureaucratic challenges. In its report, the WB also provides a roadmap of actionable reforms for the four sectors it singled out. These findings and recommendations, however, are not new. In the past, experts have often highlighted many barriers to trade and investment such as corruption, anti-competitive procurement practices, customs inefficiencies, etc. Sadly, successive governments have failed to seriously act on such findings and recommendations. Bureaucratic inertia, political instability, and weak institutional coordination frequently came in the way of progress. One statistic that can aptly portray its effect is that, while global foreign direct investment (FDI) fell by less than two percent in 2023, FDI inflow to Bangladesh dropped by nearly 14 percent.\nCan the interim government do things differently? It must. As Chief Adviser Muhammad Yunus has said at the summit, Bangladesh is a country of \"crazy ideas\" that investors can trust in going forward. But ideas alone are not enough. We need meaningful transformation. We need the government to not only listen to experts but also act decisively on their counsel. It is up to the present policymakers to bring about much-needed change in prevailing business and bureaucratic practices so that Bangladesh can fulfil its potential.\n",
        "headline_1": "Reforms vital to spur business growth",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/reforms-vital-spur-business-growth-3867431",
        "news_paper_name": "The Daily Star",
        "publish_date": "10-04-2025"
    },
    {
        "full_article": "NOTE: This article was prepared before further clarification was provided by the Indian Ministry of External Affairs that the transshipment withdrawal measures \"do not impact Bangladesh exports to Nepal or Bhutan transiting through Indian territory\". \nA former lead economist of the World Bank in Dhaka said India's decision to suspend transshipment facilities for Bangladesh was unfortunate and unnecessary. He said this decision did not quite follow the usual protocol or etiquette and points out that contrary to what many had thought, India-Bangladesh relations are appear set to become cooler despite the Yunus-Modi meet.\n\"This is unfortunate. It's going to hurt Bangladesh, Nepal, and Bhutan. I don't understand what benefit India is getting from this or why they are doing this,\" said Zahid Hussain, a former lead economist of the World Bank's Dhaka office.\nStating that air routes are the only alternative to land routes, the veteran economist said, \"But air transport is very expensive compared to land routes. Also, handling the volume is quite difficult. So, this will become a major obstacle.\"\n\"For other types of trade, especially in services, there shouldn't be much impact, since the service trade volume is relatively low. But goods trade will be significantly disrupted, and the loss will mostly affect Nepal and Bhutan because they used to import goods from us and sell them in their markets,\" he said.\nHe added, \"These are much smaller economies compared to ours — if, say, a few million dollars' worth of imports from Bangladesh to Nepal suddenly stops, it will clearly impact their inflation, supply chain, and essential goods. And we will lose our earnings as well.\"\nHe said that in such cases there are protocols, diplomatic etiquette to follow.\n\"But in this case did we see any indication before this announcement that something like this was about to happen? No letter was sent to our foreign ministry from India. Even after Modi's recent meeting, we thought perhaps the ice was beginning to thaw. But now it seems to have frozen again,\" added Hussain.\n\"This move is completely unnecessary, especially at a time when the whole world, including India, is busy dealing with the US tariff war. And now, they're creating another point of tension — it may look small, but it's an unnecessary tension created unilaterally. It's hard to fathom.\"\n",
        "headline_1": "India's transshipment decision 'unfortunate, unnecessary'",
        "headline_2": "",
        "link": "https://www.thedailystar.net/news/bangladesh/news/indias-transshipment-decision-unfortunate-unnecessary-3867406",
        "news_paper_name": "The Daily Star",
        "publish_date": "10-04-2025"
    },
    {
        "full_article": "The renewed official condemnation by the Government of Bangladesh on April 7, 2025, of the \"mass killing and gross violations of human rights in the Gaza Strip,\" has brought to light one of its dormant promises regarding international justice. It relates to Bangladesh's pledge to intervene in the Gaza genocide case between South Africa and Israel before the International Court of Justice (ICJ). It is worth mentioning that the Ministry of Foreign Affairs of Bangladesh expressed its intention to intervene in the case by issuing a press statement on January 14, 2024, just 16 days after South Africa filed the case against Israel under the Genocide Convention. Though 13 countries have already approached the ICJ with their intervention applications, Bangladesh has yet to make any concrete measures reflecting the prior commitment.\nIt is worth mentioning that Bangladesh has a constitutional obligation to support the Palestinian cause as per Article 25 of our constitution. As a long-time supporter of the Palestinian cause, Bangladesh has endorsed it at international forums, both individually and collectively with the Organization of Islamic Cooperation (OIC). Earlier, on November 17, 2023, Bangladesh, along with South Africa, Bolivia, and Djibouti, referred the Palestine situation to the International Criminal Court (ICC). As regards the ICJ, Bangladesh made written and/or oral submissions in the four advisory opinions related to Palestine. Hence, it is incomprehensible why Bangladesh is still silent on its commitment to intervene.\nBangladesh has never intervened in an ICJ contentious case before, even though it had the opportunity to do so in the Rohingya genocide case. This calls for an assessment of its potential intervention within the ICJ's legal framework and relevant practices.\nUnder the ICJ statute, a state may intervene in two ways. First, under Article 62 of the ICJ statute, a state may intervene if it has an interest of a legal nature that may be affected by the court's decision. Second, under Article 63, a state may intervene when the interpretation of a multilateral treaty is in question, and it is a party to the treaty. From the language of the press statement of Ministry of Foreign Affairs, it can be safely presumed that Bangladesh intends to intervene under Article 63. The nature of the Genocide Convention, which is a multilateral treaty, also confirms the nature of Bangladesh's potential intervention. Most of the interventions in the Genocide Convention-related cases are under Article 63.\nAt this stage, Bangladesh's potential intervention is complicated by its reservation on Article IX of the Genocide Convention, which states \"Disputes between the Contracting Parties relating to the interpretation, application or fulfilment of the present Convention, including those relating to the responsibility of a State for genocide or for any of the other acts enumerated in article III, shall be submitted to the International Court of Justice at the request of any of the parties to the dispute.\" The US faced a similar complication when it sought to intervene in the Ukrainian genocide allegation case. Russia objected to the US intervention, and the ICJ, in its Order of June 5, 2023, declared it inadmissible due to the US reservation to Article IX.\nIt is important to note that the US intervention was specifically focused on Article IX and was made at the preliminary objections stage. The court's position was based on two key considerations. First, the US reservation to Article IX meant it had excluded the provision from the Convention as it applied to the US. Therefore, the court ruled that \"the United States may not intervene in relation to the construction of Article IX of the Convention while it is not bound by that provision\" (order of June 5, 2023). Second, at the preliminary objections stage, the ICJ primarily deals with jurisdictional and admissibility issues, so it was logical for the court to limit its ruling to Article IX while leaving open the possibility of a future US intervention at the merits stage (order of June 5, 2023).\nThe ICJ, in its order of April 5, 2024, set October 28, 2024, as the deadline for South Africa's memorial submission, i.e., a brief outlining their case and legal reasoning in the dispute. The deadline was met. Meanwhile, July 28, 2025, is the deadline for Israel's counter-memorial submission. Additionally, Israel had until January 28, 2025, to file its preliminary objections. While there is no publicly available information about Israel's preliminary objections, it has likely done so.\nIf Israel has indeed raised such objections, Bangladesh cannot intervene at this stage due to its reservation to Article IX. In that case, the fate of Bangladesh's intervention will depend on the judgment on preliminary objections. However, the ICJ has already found that it has prima facie jurisdiction over this case in its Provisional Measures Orders. Given its similarity to the Rohingya genocide case, it is unlikely that the court will rule otherwise in the preliminary objections judgment. If the case proceeds beyond this stage, Bangladesh will get at least two additional years to submit its intervention. However, given the political implications of the intervention on the case and the dispute, Bangladesh should consider intervening at its earliest opportunity.\nAt the same time, Bangladesh must carefully determine the scope of its intervention. South Africa's claims in the case are expected to focus on Articles I-VI of the Genocide Convention. Once the memorial and other case documents become available, Bangladesh will gain a clearer understanding of potential areas for intervention. Given that many states are expected to intervene, Bangladesh should strategically determine its scope to maximise the impact of its intervention on the proceedings.\nBangladesh should submit its declaration of intervention at the earliest opportunity, regardless of the preliminary objections issue. Typically, the ICJ scrutinises a state's declaration of intervention, but recent cases indicate that Article 63 interventions are generally permitted. Since 13 states have already submitted their declarations of intervention and/or applications for permission to intervene, Bangladesh should not wait for the preliminary objection's outcome. The interim government of Bangladesh should reaffirm the relevance of the previous government's declaration and set a timeline for submitting its intervention request.\nQuazi Omar Foysal is lecturer at American International University-Bangladesh (AIUB) and advocate at the Supreme Court of Bangladesh. He can be reached at [email protected].\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Bangladesh should intervene fast in the Gaza genocide case",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/bangladesh-should-intervene-fast-the-gaza-genocide-case-3867171",
        "news_paper_name": "The Daily Star",
        "publish_date": "10-04-2025"
    },
    {
        "full_article": "It is unfortunate that a decade after adopting a master plan to address the city's sewage problem, the Dhaka Water Supply and Sewerage Authority (Wasa) has made little progress in its implementation. The plan originally envisioned the establishment of five sewage treatment plants across Dhaka, but only one—the Dasherkandi plant—was set up two years ago. Unfortunately, this facility is still not fully operational, as it has not been connected to Wasa's sewerage network. Moreover, while Wasa is struggling to acquire land for its Mirpur and Rayerbazar treatment facilities, it has yet to complete the feasibility study for the plant in Uttara. In the absence of proper sewage treatment facilities, most of the city's sewage now ends up in rivers and such water bodies.\nOur report in this regard cites a recent study by the River and Delta Research Centre that revealed alarming levels of pollution in rivers surrounding Dhaka—Buriganga, Turag, Shitalakkhya, and Balu. It identified 102 industrial waste outlets, 75 municipal sewer lines, and 216 private outlets discharging untreated waste into these rivers. Additionally, pollutants enter through 38 sluice gates, 62 service canals, and 441 dumping points. Industrial units, dockyards, and markets are exacerbating the problem.\nExperts, however, say the Wasa master plan was unrealistic to begin with, given the challenges of finding suitable land for large-scale projects in a densely populated city like Dhaka. With the plan proving ineffective, authorities should instead prioritise localised solutions, such as mandatory septic tanks, small-scale treatment plants, and strict enforcement of building regulations. Small treatment plants should be established in large housing project areas, while the construction of modular treatment systems should be made mandatory for high-rise buildings. Our current construction rules require septic tanks in buildings outside the sewerage network. Despite past efforts by the two city corporations to block sewage outlets and enforce this rule, their attempts were largely unsuccessful. To ensure compliance, Wasa, city corporations, and Rajuk must intensify their efforts, while building owners must also adhere to the provision during construction. Moreover, the Dasherkandi plant should be brought under Wasa's sewerage network as it could treat up to five lakh tonnes of sewage per day; the Pagla sewage treatment plant must also be urgently repaired.\nDhaka is becoming increasingly unliveable with its air and water becoming severely polluted, endangering the lives of its residents. To protect this city and its residents, the government must come up with a new vision—a new master plan—with a clear strategy to address the city's persistent sewage pollution, save our rivers and water bodies, and ensure a healthier environment.\n",
        "headline_1": "Proper sewage management is vital for a megacity ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/proper-sewage-management-vital-megacity-3864971",
        "news_paper_name": "The Daily Star",
        "publish_date": "10-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 10, 2025 00:00:00  \nThe National Board of Revenue's (NBR's) flat refusal to go by the recipe the International Monetary Fund (IMF) advanced for the Bangladesh tax authority to pursue a revised target for collection of an additional amount of revenue of Tk570 billion for the fiscal year 2025-26 is evidently a departure from its traditional soft stance. Although the NBR hopes that the intent of non-compliance expressed in a meeting between it and a visiting IMF team would not stand in the way of the latter's release of fourth and fifth tranches of $4.7-billion loan package, there is no certainty of this happening. The release of the fourth tranche has been delayed because of non-fulfilment of certain conditions. How the matter would shape is likely to depend on the outcome of the negotiations in second round of meeting between them held yesterday. \nThe NBR reposes its hope on policy changes and implementation of the existing laws for improvement in its performance but in the first meeting with IMF, it could not brief the latter of the transformative programmes for tax collection. Now the important point here is if this can be convincingly presented for the IMF consideration, will it be enough for the multilateral organisation to relax pressure on the NBR to raise the tax collection to its prescribed level? The policy framework has so long remained quaint and ineffective leaving much to be desired. One of the most important aspects is the tax-GDP ratio which is one of the lowest in the world and even in the South Asian region. In 2024, this ratio was a meagre 7.4 per cent and to everyone's concern, it has been declining over the recent years. Not only the IMF but the well-meaning citizens of this country has long been urging for expanding the tax net and raising the tax-GDP ratio. \nSure enough, the NBR cannot defend its performance. No matter under which regimes ---autocrat or pro-people---the tax authority runs the revenue operatives, at the end of the day the state's incomes are indicative of its economic health and source of the country's development finance and overall progress. The IMF's insistence that the NBR raise the tax-GDP ratio from the current 7.4 to 7.9 per cent is not at all misplaced. In the next fiscal year, this ratio should be pushed to 9.0 per cent, according to the IMF. Does it prove to be a herculean job for the NBR? If the unearned money accumulated by the likes of ACC's Motiur Rahman, former IGP Benazir Ahmed and other corrupt elements ---both in civil, judicial and military services---not excluding the NBR, are taken into account, it exposes the huge revenue those staggering figures would generate had the money been in regular circulation.\nNow that the misappropriation of that outrageous scale cannot be expected, closer monitoring of business transaction, government procurement, various public expenditures etc., should help identify tax dodgers and undervalued income sources, undue tax exemptions and other such irregularities and malpractices to expand the tax bases of both individual and corporate taxpayers. When digitisation has made information available, even the cash receipts and cashless transactions can be tracked down with the help of electronic weighing scale, barcode scanner and label scale etc. A concerted campaign for everyone to keep the record straight can certainly improve the regime of revenue income.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "NBR's reluctance to comply with IMF",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/nbrs-reluctance-to-comply-with-imf-1744211198",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       April 10, 2025 00:00:00  \nBangladesh has a history of sacrificing the growth of both foreign and local investment at the altar of bureaucratic red tape and corruption at various stages of the investment process, political rent-seeking, infrastructural weakness, and inefficiency. On the first day of the four-day Bangladesh Investment Summit on April 07, while debriefing journalists, BIDA Executive Chairman Chowdhury Ashik Mahmud Bin Harun cited the case of how complexities over the land right issue of Korean Export Processing Zone (KEPZ) in Chattogram have led to the withdrawal of substantial amount of foreign investment over the decades. Korean entrepreneur Kihak Sung, Chairman of Youngone Corporation, bought 2,500 acres of land in Anwara, Chattogram and established the KEPZ in 1999. In spite of setting up the country's single largest private export processing zone, Sung has been facing persistent delays in securing mutation documents. \nThe BIDA Chairman revealed that in 2012 Samsung proposed to invest $22 billion and required land documents as part of their due diligence, which KEPZ was unable to provide, leading Samsung to shift the investment to Vietnam. Sung himself had also moved some of his ventures out of Bangladesh due to the lack of these mutation documents.\nHowever, the good news is, that the land rights issue of the KEPZ which had been unresolved for over two decades has been resolved within the past two months following the intervention of Chief Advisor Dr. Muhammad Yunus. The government has already provided Sung with the mutation documents, which has encouraged him to bring in 31 Korean investors to participate in the four-day Bangladesh Investment Summit, which was attended by over 500 foreign investors from some fifty countries and around 2,500 local investors. Not only Sung brought some of his foreign investor friends along with him to the investor summit, but also he reportedly accompanied them to EPZ visits and highlighted the progress Bangladesh made under the current government in ease of doing business.\nThe resolution of the KEPZ land rights issue demonstrates that with strong political will and inter-agency cooperation-where government agencies and ministries prioritise national interest over bureaucratic rivalries-significant positive outcomes are achievable for businesses and service delivery alike. This is the kind of decisive action Bangladesh must replicate across various sectors to remove investment hurdles and build the confidence of foreign investors. Bangladesh has been an attractive destination to foreign investors for its cheap and trainable labour, comparatively cheaper utility services such as land and water, a vibrant consumer market and a thriving middle class. Over the years, great strides have also been made in developing infrastructure. The mega investment summit is a significant initiative to showcase the country's investment prospects and the progress it has made in making business easier.\nThe interim government, since assuming power nearly eight months back, has been working painstakingly to clean the Augean stables left behind by the corrupt and autocratic rule of the Hasina administration. Over the past decade and a half, the country's economy created a boom-and-bust cycle and remained trapped in stagnation, weak financial institutions due to ballooning non-performing loans, and debt. In the first quarter (Jul-Sep) of current FY 25, according to the latest BBS report, the GDP growth had plummeted to 1.96 per cent. Now, it is forecasted to grow to 4.48 per cent in the Q2 (Oct-Dec). To absorb the 2.4 million young people entering its labour market every year, Bangladesh needs a consistent economic growth rate exceeding 7 per cent. This higher growth rate is crucial not only for job creation but also for maintaining social stability and capitalising on the country's demographic dividend. \nThe median age in Bangladesh is only 27. That means Bangladeshis on average are a decade younger than the Thai people and two decades younger than Germans. Equipping this burgeoning youth demographic with relevant skills and generating meaningful employment opportunities represents one of Bangladesh's most pressing challenges at this critical juncture.\nThe much-touted economic growth during the Hasina regime's so-called development boom failed to generate sufficient employment, largely because it was driven by large-scale public sector development projects-many of which were wasteful, politically motivated, and served as avenues for siphoning off state resources through inflated costs. This infrastructure-heavy approach contributed to widening budget deficits and a rising public debt burden. Furthermore, the government's overwhelming focus on physical infrastructure came at the expense of human capital investment, resulting in a sharp decline in the quality of education and labour productivity. It has already been evident that the construction of mega-bridges, flyovers, expressways, and other large infrastructure alone cannot drive long-term economic growth. Rather, as global experience shows, sustainable economic development hinges on investment in human capital, innovation, and robust institutional reform. \nSo, there must be a paradigm shift from public sector mega infrastructural development to investment focused on human capital, technology, and institutional reforms. This requires a substantial investment in expanding cutting-edge technical and vocational training programmes, in partnership with esteemed international institutions. Also, there is a need to update the curricula of existing science and technology universities, establish more IT institutes in strategic cities if necessary, offer seed funding or low-interest loans to graduates, and provide comprehensive support for youth in project design and implementation. To attract a diverse talent pool, these initiatives must be implemented on a significant scale. Ideally, the private sector has to invest more motivated by the zeal for entrepreneurship and innovation. The government, for its part, must take determined steps to clear investment hurdles and reduce businesses' cost of operation to make them more competitive.\nThat said, earning investors' confidence in the country's political stability and law and order remains a major challenge for the government. The deplorable incident of vandalism targeting several outlets of Bata, KFC and Pizza Hut by unruly mobs during a pro-Palestine rally in several parts of the country, which coincided with the investment summit, has dealt an embarrassing blow. This recurring issue of lawlessness must be resolved to instill the confidence necessary to encourage domestic and foreign investment.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "A paradigm shift in  investing",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/a-paradigm-shift-in-investing-1744211293",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 10, 2025 00:00:00  \n\nThe recent removal of the 5 per cent VAT on packaged goods in supermarkets has significantly shifted Bangladesh's retail landscape. This has enabled major chains like Agora, Meena Bazar, and Shwapno to expand rapidly and attract middle-class consumers who previously shopped at traditional grocery shops. With cleaner shopping spaces, more varied product offerings, and reward programmes, supermarkets are now more appealing due to the new tax law, which has leveled the playing field. Supermarkets can also use the benefits of bulk buying to offer competitive prices, drawing customers away from small merchants. \nWith supermarkets gaining traction, Fast-Moving Consumer Goods (FMCG) companies must adapt their placement and promotion strategies to sustain market dominance. Strengthening ties with supermarket chains will help brands secure exclusive in-store promotions and strategic aisle displays. Brands can work together to develop alluring discounts, package deals, and seasonal promotions that promote repeat business thanks to the growing popularity of loyalty programmes. FMCG firms can also aggressively negotiate premium shelf positions in the organised setting of supermarkets, giving visibility top priority by strategically placing it next to checkout stations and at eye level. This strategy greatly increases the possibility for sales and improves product visibility. As modern retail continues to grow, brands proactively aligning with this shift will be best positioned for long-term success in Bangladesh's evolving retail market. \nSupermarkets make up only 2.5 per cent of Bangladesh's retail market, but they are expected to grow quickly. For instance, as supermarkets like Walmart and Kroger grew and offered greater variety and cheaper pricing, independent grocery stores in the United States started to decline in the 1950s and 1960s. By the 2000s, conventional grocers were all but extinct due to the dominance of big-box stores and online sellers like Amazon. \nLong-term success will be ensured for FMCG firms that proactively adjust to this retail transition, as chains seek statewide expansions and consumer preferences change. \nIn order to keep their products competitive, visible, and accessible in this era of rising supermarkets, FMCG companies should now reconsider their route-to-market strategy. \nTanvir Mahmud\nStudent, North South University\ntanvirmahmud5567@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "VAT removal fuels supermarket growth",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/vat-removal-fuels-supermarket-growth-1744211360",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 10, 2025 00:00:00  \n\nThe underground water crisis in Austagram Upazila has taken a grave turn. With the water table constantly declining, the situation is worsening day by day. As an agriculture-based area, most of Austagram's residents depend on farming. This ongoing water scarcity is not only hampering agriculture but also affecting the daily lives of the local population.\nAlthough deep tube wells are widely used for irrigation, extracting water from them has become extremely difficult. In some areas, there's a minimal presence of water, but regular pumps are no longer effective. Farming activities are severely disrupted. Additionally, shallow tube wells and hand pumps have dried up in many places. Currently, about 80 per cent of tube wells are failing to supply water, causing a severe shortage of drinking water and increasing the sufferings of ordinary people.\nThis crisis now affects all sections of society, not just farmers. To tackle the issue, rainwater harvesting systems and modern water management technologies must be introduced. Public awareness campaigns, administrative support to monitor water levels, and initiatives for groundwater recharge are crucial steps.\nWe urge the authorities to take immediate and sustainable measures so that the people of Austagram can live healthier and safer lives.\nNusrat Jahan Arpita\nAustagram, Kishoreganj\narpitanusrat7@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Water crisis in Austagram",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/water-crisis-in-austagram-1744211369",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-04-2025"
    }
]