[
    {
        "full_article": "The 17th Summit of BRICS emerging economies, which ended on Monday (July 7, 2025) came at a time when the organisation was in the global spotlight. This was the first such meeting that included all the newly inducted members (Egypt, Ethiopia, the UAE, Iran and Indonesia; Saudi Arabia has not joined so far). It also followed the U.S.-Israel attacks on Iran’s nuclear programme, and the escalation in Israel’s bombardment of Gaza. This was the first summit since the four-day India-Pakistan conflict in May. and also after the G-7 summit in Canada. The BRICS grouping, seen as the next challenger to the global financial order, is in U.S. President Donald Trump’s cross-hairs, as he sees it mounting an alternative to the dollar in international trade. In addition, the group has several internal rivalries that have brought its sustainability into question. In April, the BRICS Foreign Ministers’ meeting ended without a joint statement, as the African members held up the wording on the expansion of the UN Security Council. Meanwhile, despite India’s clarification in March that it is not considering de-dollarisation of trade in any form, and that there is no “unified BRICS position” on the issue, Brazil’s President Lula da Silva doubled down on rhetoric against the U.S., saying that BRICS proves the world “doesn’t need an emperor”. Mr. Trump has since repeated threats that BRICS countries would face an extra 10% tariffs due to the grouping’s “anti-American stance” — an awkward moment for New Delhi as it attempts to conclude a trade agreement with Washington.Despite all the challenges, the Rio declaration underlined the basic cohesion and consensus within BRICS members on a range of issues. In the joint statement, there was strong language against the attacks on Gaza and condemnation of the strikes on Iran, given the risks to nuclear safety. India was able to ensure a paragraph with tough language condemning the Pahalgam terror attack and references to terror financing and “cross-border movement of terrorists”. India and Brazil won endorsements of the whole grouping on playing a larger role at the UN, “including the Security Council”. The absence of the Chinese and Russian Presidents allowed more space for the non-P5 countries to promote a common vision for the Global South, adding several important resolutions on energy security, climate change and re-ordering the WTO. The Rio declaration also took a stern view of the U.S.’s moves on tariffs. As India prepares for its leadership of the BRICS grouping next year, that now represents about half the global population, around 40% of the global GDP and a quarter of global trade, it can move forward with this consensus, fulfilling the vision for the grouping’s acronym that Mr. Modi recast as “Building Resilience and Innovation for Cooperation and Sustainability”. Published - July 10, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Brazil\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        South Africa\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        G7 summit\n                    \n                            /                      \n                        \n                        Canada\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        United Nations\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        energy resources\n                    \n                            /                      \n                        \n                        climate change\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi",
        "headline_1": "Building resilience: On the 17th Summit of BRICS emerging economies",
        "headline_2": "The Rio declaration underlined the cohesion within BRICS",
        "link": "https://www.thehindu.com/opinion/editorial/building-resilience-on-the-17th-summit-of-brics-emerging-economies/article69792690.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "10-07-2025"
    },
    {
        "full_article": "Tragedy struck without warning recently when a van carrying children on their daily school commute collided with a train on the tracks. Three schoolchildren were killed on Tuesday (July 8, 2025) when the Villupuram-Mayiladuthurai Passenger train, hurtling at 95 kmph, rammed into their school van at a manned railway gate at Semmankuppam in Tamil Nadu’s Cuddalore district, dragging it for 50 metres. Despite conflicting claims about how the gate at the non-interlocked level crossing remained open as the train approached, preliminary evidence points to human error. Southern Railway has suspended the gatekeeper — now arrested for criminal negligence — alleging that he yielded to pressure from the van driver and opened the gate in violation of established protocols. However, accounts from a surviving student and eyewitnesses contradict this version. The survivor has stated that the gate was already wide open and the sound of the oncoming train was not heard. There are also claims that the gatekeeper had fallen asleep. Yet, some reports suggest that just minutes before the collision, he had exchanged the secret private number with the station master, indicating the train’s approach to Alappakkam — a detail that may not go unverified in the inquiry. Even if this is true, this would only show partial adherence to protocol. He failed in the essential duty of keeping the gate closed until the train had passed — as clearly laid out in the Indian Railways Permanent Way Manual.At the heart of this accident is the continued use of non-interlocked manned level crossings. Unlike interlocked gates — where train signals turn green only when gates are securely locked — non-interlocked systems rely solely on the alertness and judgment of the gatekeeper. As of October last year, 11,053 manned level crossing gates in India are interlocked. In the Southern Railway zone, over 300 gates remain non-interlocked. Railway unions have long flagged the pressure gatekeepers face from impatient motorists. The only foolproof solution to prevent such fatal incidents is the construction of road overbridges or underpasses. However, these projects are often delayed due to administrative hurdles and land acquisition issues. In this case, Southern Railway has accused the Cuddalore Collector of not having cleared a railway-funded underpass for over a year — a serious charge that demands scrutiny. Until permanent solutions are in place, the Indian Railways must urgently prioritise the conversion of non-interlocked crossings to interlocked ones. Human lives depend on it.\r Published - July 10, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        indian railways\n                    \n                            /                      \n                        \n                        safety of citizens\n                    \n                            /                      \n                        \n                        railway accident\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        transport accident\n                    \n                            /                      \n                        \n                        school\n                    \n                            /                      \n                        \n                        children",
        "headline_1": "​Death by negligence: On the railway gate accident in Cuddalore",
        "headline_2": "The Railways must ensure interlocked gates at all manned level crossings",
        "link": "https://www.thehindu.com/opinion/editorial/death-by-negligence-on-the-railway-gate-accident-in-cuddalore/article69792259.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "10-07-2025"
    },
    {
        "full_article": "An exhibition to Thirst after \nOur 2018 TOI litfest and my recent volume for the tricentenary of Mumbai’s mystical Parsi well were both titled Waternamah. This week I again immersed myself in  the ‘story of water’. ‘Thirst’ is the Wellcome Collection’s latest London exhibition. Spread over Aridity, Rain, Glaciers, Surface Water and Ground Water, its historical artefacts, present-day videos and future scenarios  show that freshwater is at the centre of  a  crisis that goes way beyond climate –  indeed way back into antiquity.\nIf WWIII was predicted to be over water, the oldest exhibit features the first recorded such war  – a tablet on Sumerian epic, ‘Gilgamesh and Aga’  (composed around 2000 BC). King Aga enslaves the subjects of King Gilgamesh of Uruk to dig wells for his own city and, if refused, threatens to cut off Uruk’s supply upstream on the Euphrates. Rivers have continued to be politicised by those who have the ‘upper’ hand. Unsurprisingly. Over 70 per cent of the earth’s surface may be water but only three percent is fresh; two-thirds of it is locked in ice caps; and our cavalier disregard is perilously depleting what’s available. \nThirst isn’t just physical. The text accompanying the first exhibit, Jeebesh Bagchi, Monica Narula and Shuddhabrata Sengupta/ Raqs Media Collective,  tells us ‘Across South Asian philosophy, the word is associated with craving, aspiration, longing and desire.’ The exhibition keeps presenting their darker manifestation, shared loss, but also human resilience. All three coalesce in Gideon Mendel’s wall-wide, ominously silent video, Deluge 2007-2024, looping images of people from five countries across continents struggling through waist-high waters. \nWe see how nature strikes back, punishing human hubris in assuming divine rights to all Earth’s resources. But nature sometimes benignly also gives back. We read how ‘The Sinai peninsula saw unusual sustained rainfall during the pandemic after decades-long drought. Local wormwood, Artemisia Judaica flourished, and was found to treat the symptoms of the Covid variant, Omicron.’ The same space showed how artist and wildcrafter Lofa Aziz introduced biomimicry, ethnobotany and citizen science to Bedouin youth who already had deep generational knowledge of their land, giving them new agency  in preserving natural heritage. \nOur own efforts to save the Ganga could take heart from the ‘sacred activism’ ritual at the source of Beirut River last year. Individual fragile threads were braided into a strong ‘prayer belt’, symbolising the power-infused connection between  individuals, communities and nature. Dare one hope that our own fragile Ganga-Jamuna culture could be thus revived?  \nIndeed, ‘Thirst’ resonated with me in so many ways. The Raqs trio presenting third-century stepwells of Rajasthan and Delhi, ‘their watermarks inscribing a history of thirst …carrying a memory of each step taken in search of freshwater’. Didn’t it also etch the feminization of poverty? Like rivers flowing into a common ocean, we are bound in the  global commonality of urban discord over water. In my first years in Bombay, in TOI’s evening paper, ‘Fight at Common Tap’ vied only with ‘Pydhonie Panwalla Stabs Paramour’. It’s not very different today, even in parts where exorbitant tankers replace  fractious faucet. Why, only India? The very day I visited ‘Thirst’, a London tabloid  Phew!ed over the city being spared prolonged water shut-offs in 2027 thanks to last-minute funds for a reservoir.\nNot just with omnipresent monsoon waterlogging. Every coastal city can connect with the Malaysian fisherfolk despairing over catch-rich mangroves dying from the pollutants spewed by a nearby Chinese factory. \nMove over, mosquitoes. Humans are the vectors of water-related killers jeopardising not only our own existence but all life on the planet. ‘Thirst’ advises a strong gulp of restraint.  \n                                        ***\nAlec Smart said: “Preamble says ‘sovereign, socialist, secular’. How about ‘sacrosanct’?”\n\n",
        "headline_1": "Water ways",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/water-ways/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-07-2025"
    },
    {
        "full_article": "Migrants must be made aware of the perils of employment in risky destinations \nNew Delhi is racing against time to halt the execution of Indian nurse Nimisha Priya in Yemen. But it’s a tough job. First, the execution, ordered under Sharia  law, is scheduled for July 16. Second, all legal appeals have been exhausted. Third, even the option of paying blood money to halt the death sentence isn’t working. Adding to complication is the fact that India does not have official diplomatic relations with Yemen’s Houthis who control the capital Sanaa where Nimisha is being detained. \nNimisha has been sentenced for killing a Yemeni man who was her business partner but was abusing and exploiting her. Her case is a cautionary tale for Indian migrants seeking jobs in countries where rule of law and security systems are far from modern, fair or stable. This applies as much to today’s Yemen wracked by civil war as it does to Russia engaged in the Ukraine war, and lawless parts of Myanmar and Cambodia. Indian nationals have been victims of unscrupulous middlemen and human traffickers who promised lucrative jobs. Instead, they were forced to fight in the Russian army on the frontlines of the Ukraine war or operate cyber-fraud schemes from compounds in Southeast Asia. \nWhat makes things even more tricky is that recruiters are getting sophisticated. They are using social media to lure their victims. A 2020 UN Office on Drugs and Crime report details how traffickers are recruiting using standard webpages, online advertisements, and video streaming services to trap and blackmail their victims. The share of social media usage in confirmed trafficking recruitment cases has jumped from 32% in 2009-2011 to 52% in 2015-2018. Of course, people in search of better employment will travel abroad. In fact, this is the strength of the Indian diaspora. But better checks and govt counselling of migrants are needed before they head for risky destinations. GOI must redouble its efforts in this direction.     \n\n",
        "headline_1": "Yemens of the world",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/yemens-of-the-world/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-07-2025"
    },
    {
        "full_article": "After copper, Trump looks set to tariff pharma. India must protect its turf with a deal \nCopper entering America will be taxed at 50%. Will the tariff apply to all exporting nations, will it apply from Aug 1, or immediately? Details are fuzzy in standard Trump fashion, but the rate is fixed, and jitters have spread, even though the tariff wasn’t entirely unexpected. Trump showed intent when he ordered an investigation in Feb to find out whether “unfair trade practices” or dumping were stunting the growth of America’s copper industry. He also set precedent by imposing 50% tariff on steel and aluminium imports. If copper producers and exporters still feel blindsided, it’s because of all the noise the Trump admin generates day after day.\nThat said, a 50% tariff on copper is no small matter. Every electrical appliance needs tonnes – sometimes literally – of the first metal known to humans. Gasoline cars use about 20kg each, some EVs more than 80kg. And if China continues stalling the supply of rare earth magnets, the demand for copper to make powerful induction motors will only rise. US customers may therefore foot higher prices for all things copper. It’s a hefty tax premised on the need to increase US production of copper, which has reduced by a fifth in just a decade. America imports roughly half of the copper it uses every year, worth a modest $8bn, but the fear – confirmed by the rare earths squeeze – is that this might be a vulnerability. While China does not sell much copper directly to US, its humongous refining capacity lets it manipulate global prices. It stands eighth globally in terms of copper ore reserves, but refines more than the next 10 countries together, which includes India in ninth place.\nIndia is a minor player in America’s copper market, with exports worth only $311mn, but most of these are in the form of value-added goods like pipes and wires, and may hurt producers, unless India swings an exemption under its gestating trade deal. Of greater concern is Trump’s off-the-cuff warning about 200% pharma tariffs – again on grounds of national security. He hasn’t imposed this tariff yet, but an investigation has been on since April, and the tariff may materialise soon. If it does, India’s $8bn pharma exports to US could be in jeopardy. Alternative markets would likely be less profitable, so pushing for tariff concessions as part of the trade deal is our best option.\n\n",
        "headline_1": "Smelt this",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/smelt-this/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-07-2025"
    },
    {
        "full_article": "Trump has called Musk’s effort to launch a party in competition to Republicans & Democrats ridiculous. But the reason third parties fail in US is that rules & legislators are stacked against them\nOver the weekend, the richest man in the world, Elon Musk, announced that he would start a new political party, the “America Party,” to challenge both Democrats and Republicans. Musk spent hundreds of millions of dollars to help Republicans in the 2024 elections.\n\nSo, Democrats are gleeful at the prospect of that money being spent against Republicans in the future. Meanwhile, Trump has dismissed the effort, calling it “ridiculous”.\nRead the full story on TOI+.\n\n",
        "headline_1": "America’s two-party trick",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/americas-two-party-trick/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-07-2025"
    },
    {
        "full_article": "The news of the government's failure to provide gas connections to over 1,000 industrial units and factories—despite more than 400 applicants having completed all formalities, including the payment of required fees—is indeed concerning. Among them is a factory established by Lantabur Group at the cost of Tk 700 crore. The company received its demand note for the connection as early as November 2022. Once operational, the facility was expected to employ around 1,500 people. Yet, despite construction being completed six months ago, it remains non-operational due to the lack of gas supply. In the meantime, the company has already begun repaying bank loans despite not having generated any revenue from it.\nUnfortunately, this is not an isolated case. The 400 applicants currently awaiting connections include both new and expanded factories, as well as those seeking an increase in gas supply. A further 600 factories have applied for connections but have yet to receive any assurance of approval. This clearly demonstrates the extent to which industrial and economic growth is being held back by the ongoing gas connection crisis.\nIndustrialists have been sounding the alarm on this issue for years. However, the Awami League government, during its tenure, was heavily reluctant to invest in domestic gas exploration even though expert assessments indicated considerable potential. Instead, it placed excessive reliance on imports. With global gas prices having fluctuated drastically in recent years, this dependency has, unsurprisingly, proven costly. Consequently, industries have suffered and continue to do so.\nThe Awami League government also burdened the energy sector with massive debt through corruption and poor governance—debt that the interim government is now having to repay. But this has significantly reduced its financial flexibility. Although it has rightly prioritised domestic gas extraction, the benefits of such efforts will take time to materialise. That said, while it may be risky for the government to take on added financial pressure to rapidly boost gas supply, it should seriously consider it simply to stimulate industrial activity and accelerate economic recovery in the short term.\nAt present, the country supplies around 2,800-2,900 million cubic feet (mmcf) of gas per day, against a demand of 3,800 mmcf. And just over 1,200 mmcf is allocated to the industrial sector. To provide all promised connections, an additional 100 mmcf will be required. We urge the authorities to explore all viable options for acquiring this additional supply. Furthermore, the entrenched corruption in the energy sector—including credible allegations that some suppliers demand bribes in exchange for gas connections—must be thoroughly investigated and eradicated.\n",
        "headline_1": "Gas crisis deserves priority attention",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/gas-crisis-deserves-priority-attention-3933351",
        "news_paper_name": "The Daily Star",
        "publish_date": "10-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 10, 2025 00:00:00  \nThere has been heightened concern the world over about Donald Trump's reciprocal tariff ever since the radical policy on import duty was unveiled in April last. The 90-day tariff pause he announced following stock market crashes was precisely meant to secure 90 trade deals in those 90 days but he managed to accomplish only two. A day before the expiry of that period, Trump issued letters to heads of government in 14 countries, mostly South-East Asian, revising the rates of the levies announced in April. This time almost another three weeks' time has been granted for further negotiations for reaching a deal. The failure to do so will lead to enforcement of the revised tariff from August 1 next with no further extension of the deadline. According to the latest list of Trump's tariff rates, Bangladesh will face an additional 35 per cent duty on its commodities exported to the US. This is on top of the existing 15 per cent tariff Bangladesh exporters now have to pay. \nThe government functionaries have tried to assure the people here that the issue is yet to be settled. A delegation headed by Commerce Adviser Sheikh Bashir Uddin, now in America, should have held a meeting with the United States Trade Representative (USTR) in favour of wresting concessions from the US side. But given the outcome of keeping the channel of negotiations with Washington for three months, there is hardly any reason to be optimistic about a drastic cut on US import duty. The rate of levy on export commodities from Bangladesh was lowered by only 2.0 per cent from the original 37 per cent. Exactly at this point, figures the case of Vietnam which could successfully negotiate a 20 per cent tariff on its goods exported to the US. Most importantly, of the two trade deals the Trump administration inked in the 90-day pause period, Vietnam's was one, the other being the US-UK deal.\nThat one of Trump's objectives was to counter China's growing influence in South-East Asia is certainly corroborated by the Vietnam deal which, although not made public, has been touted by Trump on his social media as satisfactory because American goods will enter Vietnamese market duty-free. Notably, despite the 20 per cent levy on Vietnamese commodities, the trans-shipment clause ---goods from third countries shipped via Vietnam or of origin including parts of a different country--- will be levied 40 per cent duty. All South-East Asian nations depend heavily on Chinese stuff made on a scale and at costs no nation can compete with. \nInclusion of Bangladesh in the list of the 14 countries is therefore not intriguing. Geopolitics plays a part here and Bangladesh's increasing leaning towards China as a source country may provide the answer for not considering its case generously. Trump and Vietnamese state media confirmed US-made large-engine cars would have more access to Vietnam. \nYet, according to a leading apparel businessman, Vietnam is not a rival to Bangladesh because the garment items that country exports to America are different from those of Bangladesh. But it is a fact that if 50 per cent tariff is enforced on export of garments to the US, smaller factories here will collapse and even the larger ones will have to incur losses no matter if they have to share half of the duty burden with US brand companies. The problem will be acuter if Bangladesh's competitors like India and Pakistan clinch deals at lower tariff rates with buyers moving away to those countries. Even if the meeting with the USTR yields no positive results, it would be wise to include seasoned leaders of the garment sectors and use their US connections as a lobby in favour of Bangladesh.\nThere is still three week's time.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Looming threat from reciprocal tariff",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/looming-threat-from-reciprocal-tariff-1752078629",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       July 10, 2025 00:00:00  \n\nThere is apparently a broad agreement in the country that some of the most insurmountable obstacles to good governance are corruption, political nepotism and cronyism, and deteriorating law and order. This is what the citizen realise in everyday life and feels terribly frustrated about. A recent survey on youths has echoed many of these concerns, along with their expectations from the government and political parties.\nConducted by the South Asian Network on Economic Modeling (SANEM) and ActionAid Bangladesh in the wake of the July uprising, the survey focused on youth perspectives around employment, education, and the political situation. It gathered opinions from 2,000 young individuals - both male and female - aged between 15 and 35, from all districts across the country.\nIn Bangladesh, where nearly 30 per cent of the population comprises of youth, their perspectives are profoundly significant, embodying not just their individual hopes but the collective aspirations of the nation. Historically, the youth have led the charge during times of political and social upheaval - from the 1969 mass uprising to the 2024 movement that toppled the 15-year autocratic rule of the Hasina regime. In moments of national crisis, it is the youth who rise, challenge the status quo, and lead the way toward change.\nSurveys like this, which seek to understand the socioeconomic and political perspectives of young people, are therefore crucial. Policymakers would do well to take their voices seriously, for the future of the nation depends on how meaningfully they engage with the youth.\nThe interim government has launched a flurry of reform initiatives and is currently engaging with political parties towards building a consensus so those could be implemented. However, one critical area remains conspicuously absent from the national reform agenda: the education sector. Although the government formed as many as 15 reform commissions, none has been dedicated to education, even though the sector suffered significantly under the 15-year misrule and corruption of the Hasina government. This neglect has not gone unnoticed. Findings from the youth survey highlight the urgency of the issue. When asked which sectors require reform on a priority basis, an overwhelming 94 per cent of respondents identified education as the most pressing concern. Nearly 73 per cent expressed a strong desire for a modern, affordable education system. The omission of education from the reform agenda not only ignores a sector in crisis but also overlooks the desire of the nation's youth, even though they have been at the forefront of the change.\nOther key issues on the youth's priority reform list included healthcare (92 per cent), the labour market (90 per cent), human rights - particularly security and freedom of expression (89 per net) - and institutional reform (85 per cent). About 67 per cent of respondents expressed the need for improved and affordable healthcare services. Additional expectations among young people included a strong and independent judiciary, safety in public and digital spaces, a transparent electoral process, representative politics, and a peaceful, conducive environment on university campuses.\nIn response to what kind of reforms they expect from political parties to better serve the country and its youth, 65 per cent of respondents highlighted the need to end patronage, nepotism, and political violence and corruption. About 54 per cent called for regular internal elections and the establishment of democratic structures within parties. Roughly 52.7 per cent preferred policy-based politics over personality- or inheritance-based politics. \nThese findings clearly indicate that a majority of young people want political parties to focus on internal reforms to establish genuine intra-party democracy. Democracy is not merely about holding elections; it requires a democratic political culture rooted in transparency, accountability, and participation. The country is yet to develop such a culture is largely due to the undemocratic nature of its political parties. \nSo, in order to realise the aspiration of July-August uprising of building a democratic and discrimination-free country, political parties must undergo significant internal reforms and practice intra-party democracy. How they elect leaders, nominate candidates, mobilise funds, and the sources of income for party leaders and activists must be transparent and accountable. Politics must not be treated as a profession; it should be viewed as a mission to serve the public. And there should be strict guidelines prohibiting the use of students, religion or the place of worship for political purposes.\nThe message of the youth is clear: things must change. There is no going back. However, if key actors fail to seize this pivotal moment for change, no meaningful transformation will occur, and the profound hopes ignited by the July uprising will ultimately remain unfulfilled. So, it is imperative to utilise this transitional period with utmost wisdom and patriotic zeal, setting aside narrow self-interest, to strengthen the country's democratic future. Should the country, by any chance, revert to its old ways, the new generation stands ready to continue their fight for a better Bangladesh. All the stakeholders would, therefore, do well in taking the aspirations of young people seriously and commit to meaningful reforms, both within their own ranks and at the national level. Rebuilding democratic institutions and steering the nation toward a sustainable, truly democratic future demands nothing less than this concerted effort.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Understanding what youths want",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/understanding-what-youths-want-1752078709",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 10, 2025 00:00:00  \n\nThe growing trade imbalance of Bangladesh has become a serious economic concern. The widening gap between imports and exports poses long-term risks to the stability and sustainability of our national economy.\nA major driver of this imbalance is the country's heavy reliance on imported raw materials, energy, and industrial goods, resulting in escalating import costs. Meanwhile, export earnings remain overly dependent on the readymade garment (RMG) sector, with little progress in diversifying into other industries. This overreliance on a single sector leaves our economy vulnerable to global demand fluctuations and external policy shifts.\nSmall and medium enterprises (SMEs) hold great promise in boosting export potential. However, many face significant challenges, including limited access to financing, inadequate infrastructure, and a lack of exposure to international markets. Without targeted reforms and support, the potential of SMEs will remain largely untapped.\nTo address this imbalance, strategic investments must be made in emerging sectors such as agriculture, pharmaceuticals, and information technology. Strengthening local industries can also reduce import dependency. Additionally, modernizing trade policies to attract foreign investment in diverse, export-oriented industries is essential.\nThis issue demands urgent and coordinated action from both government and business leaders to ensure a more balanced, resilient, and self-sustaining economy for Bangladesh.\nYana Islam Rifa\nBachelor of Business Administration\nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Addressing trade imbalance",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/addressing-trade-imbalance-1752078732",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 10, 2025 00:00:00  \n\nBangladesh has concluded the fiscal year 2024-25 with a record-breaking remittance inflow of $30.33 billion, the highest in the country's history. This remarkable achievement is a testament to the enduring contributions of millions of Bangladeshi migrant workers abroad who strengthen our economy with their hard-earned income.\nAccording to Bangladesh Bank, remittance earnings stood at just $1.22 billion in FY 1995-96. In contrast, the 2024-25 figure highlights how dramatically remittance has grown into a major pillar of our national economy. Migrant workers, particularly from the Middle East-including Saudi Arabia, the UAE, Kuwait, Qatar, and Oman-have consistently contributed significant amounts through formal channels. Notably, migrants from Europe, North America, and other Asian regions now contribute more than half of the total remittances.\nHowever, this financial lifeline raises an important concern: what happens when these workers reach old age and can no longer contribute in the same way? According to the Bangladesh Census 2022, over 65 per cent of the population is of working age (15-64), while about 9.2 per cent are aged 60 and above. Projections show that by 2040, 16.2 per cent of the population will be over 60. This demographic shift will reduce the proportion of working-age citizens and impact future remittance inflows.\nA large share of Bangladeshi migrants are currently unskilled or semi-skilled. Without proper training and planning, the economic productivity of this workforce remains underutilized. According to the Bureau of Manpower, Employment and Training (BMET), approximately 421,000 Bangladeshis went abroad for work up to May 2025. While this is a significant number, many are engaged in low-paying jobs with limited long-term prospects.\nTo ensure the sustainability of remittance as an economic resource, Bangladesh must act now. A national migration strategy should focus on skill development, health preparedness, and aligning labour exports with global market demands. Skilled and healthy workers will not only earn more but also ensure that remittance continues to support our economy in the decades to come.\nRemittance is indeed a blessing today, but without thoughtful planning and investment in human capital, it may turn into a missed opportunity tomorrow.\nMd Idris Ali\nPostgraduate Student\nDepartment of Population Sciences\nUniversity of Dhaka\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Record remittance - what about remitters' interests?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/record-remittance-what-about-remitters-interests-1752078752",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-07-2025"
    }
]