[
    {
        "full_article": "The Leader of Opposition in the Lok Sabha, Rahul Gandhi, has made serious accusations regarding the 2024 Haryana Assembly election, turning the spotlight, yet again, on election integrity in the world’s largest democracy. At the very least, his analysis has proved that India’s electoral rolls are in a mess, which the Election Commission of India (ECI) says can be fixed only by an ongoing Special Intensive Revision (SIR). Mr. Gandhi, who evidently had a professional team of analysts working on it, made a claim that 25 lakh votes in Haryana were “fake” — i.e., either non-existent or duplicate — or one in every eight voters in Haryana, where the Congress had lost the 2024 election. As per Mr. Gandhi’s calculations, there were 5.21 lakh duplicate voters and 93,174 invalid voters in the State, and he claimed there were 1,24,177 voters with blurred or fake photographs on the electoral rolls. To prove this point, among other facts, he cited the example of a woman — a Brazilian model whose picture was available online — whose photograph appeared 22 times across different booths in Haryana. Earlier allegations of election manipulation included bulk deletion and addition of voters, which the Congress leader has said boosted the prospects of the Bharatiya Janata Party (BJP) and undermined the Opposition. In this, the ECI is accused of colluding with the BJP.In its defence, the ECI has marshalled some technical arguments, but they do not clear the air, regardless of the merit of the Congress charges. The argument that complaints regarding electoral rolls should have been raised within stipulated timelines and that other complaints should have been litigated through election petitions may sound procedurally sound. But such a position does not mitigate the severe trust deficit that the ECI is facing. The Congress’s charges are by themselves no conclusive proof of fraud, though they certainly demonstrate systemic failure. The ECI’s defensive response and its overall tendency to raise veils of opaqueness in the electoral process add credence to the Congress’s charges in public perception. The best way to prove that the people who seemingly appear multiple times on the list did not actually vote multiple times is to air the recording which is made at each booth. On the disingenuous ground of voter privacy and secrecy, the ECI has restricted access to the video footage, electoral rolls and other details of the electoral process in the recent past. The only thing secret about voting should be the vote itself. Who the voters are, and who actually voted, must be open public records. The best way to allay fears regarding the electoral process is to make all information publicly available, retaining secrecy only with regard to the choice of the voter. Published - November 10, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        Lok Sabha\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        Haryana Assembly Elections 2024\n                    \n                            /                      \n                        \n                        Brazil\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        fraud\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Indian National Congress",
        "headline_1": "Burden of proof: On India and election integrity",
        "headline_2": "Only the choice of the voters is secret, not whether they voted or not",
        "link": "https://www.thehindu.com/opinion/editorial/burden-of-proof-on-india-and-election-integrity/article70251994.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "10-11-2025"
    },
    {
        "full_article": "In September, a Supreme Court-constituted Special Investigation Team (SIT) reported to the Court that Reliance Foundation’s Vantara project in Jamnagar, Gujarat — India’s largest private zoo — had been above board in the manner in which it had gone about acquiring wild animals from abroad; it had the right permits and the facilities for the upkeep of over 30,000 animals and that any criticism or aspersion of its activities on these grounds were wholly “unjustified”. The Court chose not to make the report public and only appended a summary in its order with the operative observations. What the report contained in its entirety becomes relevant given that a global body has made some concerning observations and “recommended” that India’s wildlife authorities pause the issue of permits that allow endangered animals to be imported by zoos. This came after the CITES committee — the most influential agreement on cross-border wildlife movement — visited Jamnagar. The visit was just after the SIT had submitted its report to the Court and from what is known from its exhaustive, public report, investigated the same issues as the SIT: permits, acquisition of animals, the facilities in Jamnagar. The CITES committee too commended Vantara’s infrastructure and the expertise available for animal care. Its observations on the issue of permits casts aspersions on India’s wildlife management system, not on Vantara.The committee’s reservations stemmed from observations that permit codes accompanying several animal transfers did not always accurately reflect the arrangement between the exporting country and India. For instance, the Czech Republic says that it had “sold” several animals to the procuring arms of Vantara, which denies it was a sale and that the costs incurred were ancillary (insurance and transport). The distinction is important because Indian laws do not allow its zoos to commercially procure animals. The primary objective of CITES, an international convention, is to curb animal trafficking and while lacking enforcement powers, expects countries to execute and incorporate checks into their wildlife laws. CITES does not discourage cross-border commercial transactions and only insists that these are properly recorded, with proper traceability of the animals being moved. In several instances, the committee has observed that India’s authorities ought to be more proactive in engaging with counterparts in other countries to investigate suspect traceability. It is a matter of conjecture whether the Court-appointed committee also had similar observations to make. Translucent disclosure only reduces global trust in India’s wildlife management and as home to some of the most important biospheres, that is a reputation it can ill afford. Published - November 10, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        wildlife\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        investigation\n                    \n                            /                      \n                        \n                        Gujarat\n                    \n                            /                      \n                        \n                        parks\n                    \n                            /                      \n                        \n                        conservation\n                    \n                            /                      \n                        \n                        laws",
        "headline_1": "Greater openness: On India and wildlife management",
        "headline_2": "India must not squander global trust in its management of wildlife",
        "link": "https://www.thehindu.com/opinion/editorial/greater-openness-on-india-and-wildlife-management/article70259438.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "10-11-2025"
    },
    {
        "full_article": "Chairman of Adani Group, writing on the Google-Adani project to build an AI and data centre complex in Visakhapatnam, argues India will benefit at multiple levels & all data will be kept here\nThe $15bn partnership between Google and the Adani Group to develop India’s largest AI and data centre hub in Visakhapatnam represents a fundamental shift in how we think about national infrastructure. This is not simply an investment, it is a strategic move to position India at the centre of the global AI economy.\n\nNew pillars of sovereignty | In the 20th century, nations built their power on ports, railways and electricity grids. These remain essential, but the 21st century demands a new foundation: energy, data, and ‘compute’. Control over these resources is no longer optional, it is fundamental to economic independence and technological self-reliance.\nRead Full Story on TOI+\n\n",
        "headline_1": "‘Making India global AI hub’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/making-india-global-ai-hub/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-11-2025"
    },
    {
        "full_article": "That many women today can pursue men they like, reversing centuries-old dictum that men should chase & women should be chaste, is arguably the most fundamental demonstration of gender equality\nLust is not gender-based. Until recently, however, men and women had to follow different manuals. Both macho brags and mothers’ dire warnings pointed to the same norm: The male had to go out and seduce while the female waited for the kiss of true love.\n\nWith birth control iffy and abortions illegal, only marital sex got a thumbs-up, which was for the grim purpose of filling up the world. Anything else was taboo and came with statutory warnings.\nRead full story on TOI+\n\n",
        "headline_1": "Why so much changes when she makes the move",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/why-so-much-changes-when-she-makes-the-move/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-11-2025"
    },
    {
        "full_article": "By Narayani Ganesh\nThe Gita, Buddhist and other faith teachings say that anger is one among the three poisons, the other two being ignorance and desire, the primary sources of suffering and distress. Why do we get angry? There are many reasons why we fly off the handle. Basically, it all boils down to how well we are able to acknowledge our emotions and keep them in control so that they do not go haywire.\nTo control negative emotions does not mean to suppress or ignore them, but to acknowledge their presence, befriend them and ensure that they do not propel one to destructive thought and action. That is, we need to cultivate the art of mindfulness, which will help us stay calm and avoid rashness that may lead to violence and perhaps, regret. Vietnamese Buddhist monk Thich Nhat Hahn would say that mindfulness recognises anger, is aware of its presence, accepts and allows it to be there – once we recognise our anger, we embrace it…. And things are bound to change (for the better).\nAnger is also perceived as a source of powerful wisdom. “In its pure, awakened form, when it is not driven by ego, anger brings good to the world. It can be, for example, the energy that inspires great movements for freedom and social justice, or the force that helps us simply say, ‘No!’ to actions that cause suffering,” says Lion’s Roar editor-in-chief Melvin McLeod. But the tricky part is to know when to rein in that anger so that it does not turn around and become harmful to us and others. For this, one has to cultivate the art of knowing when to stop; when to cool down and knowing how and when to convert the powerful steam released by anger into a force that can fuel positive action. What was poison can be transformed into becoming an antidote to suffering.\n\nAtherapist once advised a frustrated, angry young woman to vent her anger by smashing dinner plates. Others advise to let it all out by shouting or swearing. But all of these only aggravate the negative feeling; giving expression in acts of aggression that may now seem harmless could later manifest as violence in more serious situations.\nYou cannot overcome negative emotions by indulging in negative acts of aggression. The answer is, to understand why you are so angry and try and work around that. If it is because someone has wronged you or you lost your job, your lover, your finances, your health, then smashing dinner plates is not going to help deal with your situation.\nLearning and practising deep breathing and meditation could help immensely. These will also help clear mind clutter and enhance your capacity to think with clarity and purpose, so that you chalk out a plan, step-by-step, for doing things that could make your situation better. To right a wrong, committing another wrong does not work. One has to make a conscious effort to see life from a wider perspective and come to terms with the fact that what you are going through right now is just a passing phase.\nThere is a lot of truth in the saying, “This too shall pass.” Befriend anger and frustration, and cultivate loving kindness, first towards yourself and then towards others. Anger will then fly out the window.\nganeshnarayani@yahoo.com\n\n",
        "headline_1": "Smashing dinner plates is not a solution",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/smashing-dinner-plates-is-not-a-solution/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-11-2025"
    },
    {
        "full_article": "But bosses running bigger cos don’t demand homage\nElon Musk moved closer to the first trillion-dollar pay package on Thursday. He’s already worth $491bn, as of Friday afternoon, and growing valuations of his major companies – Tesla, SpaceX, xAI – could make him the first trillionaire with his current stakes well before the promised $1tn. The prospect of a man possibly worth $2tn, or even more – larger than the revenue of many big companies – in a few years is mind-boggling.\nHow can one man be worth so much, many have asked. But 75% of Tesla’s stock – of which Musk is the single biggest holder – backed the proposal to give him 424mn new shares, doubling his stake in the company, if he meets certain goals over the next 10 years. These include selling 20mn cars – not difficult, considering current sales of 1.8mn a year – and raising Tesla’s market value to $8.5tn, from $1.4tn currently. That sounds tough, but recall how he won shareholder approval for a controversial $56bn bonus in 2018, contingent upon Tesla’s market value touching $650bn over 10 years. Tesla hit trillion-dollar valuation in Oct 2021.\nMusk may do the impossible again. What’s in question, though, is not the possibility but the desirability of his reward. Nvidia, Apple, Microsoft, Alphabet and Amazon are all significantly bigger than Tesla but their chiefs don’t demand the kind of homage that Musk does. Yes, he’s invested in Tesla like nobody else – 15 years ago he pumped his own $35mn to pull it from the brink of bankruptcy – but Satya Nadella, Sundar Pichai and Tim Cook have done more for their shareholders without Musk’s theatrics. In fact, Musk has been a liability for Tesla of late. Last month, a Yale working paper estimated that his abrasive politics had cost Tesla 1mn car sales. He’s promised cheaper EVs, then robotaxis, and now autonomous robots, without delivering, while Chinese rival BYD has stolen a march. Perhaps, the promise of a trillion dollars will make him pull himself and Tesla together.\n\n",
        "headline_1": "Muskular Pay",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/new-in-toi/muskular-pay/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-11-2025"
    },
    {
        "full_article": "It is deeply troubling that Bangladeshi migrant workers are being exploited abroad in one of the most dangerous ways imaginable. A recent Brac report reveals that many of our workers, who travelled legally to Russia with valid work visas, have been coerced into joining the ongoing Russia-Ukraine war. Promised jobs in construction, oil, or logistics, these men were stripped of their passports and forced into military service near the front lines. According to testimonies gathered from survivors and families, some workers were injured or killed, while some families lost contact with their sons, and returnees still live with traumatic memories.\nBrac's findings suggest that both licensed and unlicensed recruiting agents in Bangladesh are involved in this grim trade. Under the guise of high-paying job offers, they send unsuspecting workers to Russia, only for intermediaries there to hand them over to the military. Such cases reveal not just criminal exploitation but deep flaws in Bangladesh's migration oversight. These workers were victimised despite following all legal procedures, including obtaining work visas, and signing verified contracts.\nOne of these men, Afzal Hossain Meraj, went to Russia in August 2023 for a welding job with a promised monthly salary of Tk 70,000, after paying Tk 6.5 lakh to a recruiting agency in Uttara. Four months later, a broker in Russia offered him what seemed like a better job, with larger bonuses, higher pay, and even the promise of citizenship. But after he agreed, his passport was seized, and he was sent to the battlefield instead of a job site. He secretly called his father and told him that he feared for his life after seeing two other Bangladeshis killed in combat. Such a situation must be stopped urgently.\nWhile the exact number of Bangladeshis caught up in Russia's war remains unknown, the Criminal Investigation Department (CID) estimates that around 2,000 people have travelled to Russia with work visas in recent years, with at least a few dozen Bangladeshis feared dead or missing. Brac suspects that several hundred may currently be stranded in active combat areas.\nClearly, the failure to monitor recruitment, verify foreign job offers, or track Bangladeshi workers abroad has turned our migration system into an exploitative one. Without stronger oversight, even \"legal\" migration routes can be abused by traffickers. Authorities, therefore, must treat this issue as a national emergency. Stronger collaboration between the foreign ministry, CID, and migration agencies is urgently needed to locate those missing, rescue those trapped in war zones, and hold those involved accountable. Public awareness campaigns, especially in rural areas, should warn potential migrants about fraudulent offers. Finally, Bangladesh must use all diplomatic channels to press Russia for the safe return of all coerced nationals and prevent further recruitment of our citizens into the war.\n",
        "headline_1": "Grave failures in migration oversight",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/grave-failures-migration-oversight-4029391",
        "news_paper_name": "The Daily Star",
        "publish_date": "10-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 10, 2025 00:00:00  \nThe latest Bangladesh Bank analysis of inflation may explain why a stable exchange rate has largely failed to translate into lower consumer prices and why a tight monetary policy has so far failed to bring inflation rate down to the desired level. The central bank's analysis reveals that the country's inflation profile is now overwhelmingly driven by domestic factors, with locally produced goods accounting for 75.6 per cent of inflation headlines during the first quarter of the 2025-26 fiscal year, while the share of import-dependent items has declined to 24.4 per cent. This indicates that the economy is no longer suffering from imported shocks; rather, inflationary pressures are now largely home-grown, stemming from supply constraints, rising production costs and market manipulation. This sobering analysis from the Bangladesh Bank serves as both a warning and a call to action for policymakers to recalibrate existing economic policies aimed at controlling inflation.\nAlthough point-to-point inflation eased slightly to 8.17 per cent in October from 8.36 per cent in September, consumer sentiment remains dampened by erratic price patterns. A glaring example is the sudden surge in onion prices, which soared from Tk 80 to Tk 120 per kilogram in less than two weeks. Similarly, prices of almost all varieties of rice are on the rise even after a good harvest. Edible oil offers another example of price manipulation through syndication. Its price has been repeatedly increased under the pretext of exchange rate volatility and rising international prices. However, global edible oil prices have witnessed a significant drop and the dollar rate has remained stable. Despite this, the cartels of local refiners who dominate the market continue to raise prices, highlighting the lack of effective market oversight and the unchecked influence of powerful business groups. When prices fall in the international market but remain stubbornly high in the local market, it raises serious questions about the effectiveness of market surveillance and regulatory enforcement.\nAs things stand, market price in Bangladesh does not follow the laws of supply and demand, the fundamental principles of economics. Here middlemen play a dominant and deceitful role through hoarding and price manipulation. It has been widely discussed that while farmers are not getting a fair price and in some cases failing to recoup the production cost of their produce, middlemen are making an exorbitant profit through market manipulation and price syndication. This vicious cycle of exploitation not only discourages domestic production but also exacerbates the economic vulnerability of low- and middle-income consumers and farmers alike. Economists have, therefore, rightly emphasised the need for strengthening the government's market monitoring mechanisms and curb malpractices at every stage of the supply chain.\nBangladesh Bank data on inflation also underscores that tackling inflation now requires more than monetary restraint. As noted economist Dr. Zahid Hussain argued a coordinated policy approach must address deep-rooted inefficiencies within the domestic supply chain to restore market stability and protect consumers. Strengthening transport and storage infrastructure, ensuring timely market intervention and curbing manipulation by vested interests are essential. Without such urgent and effective measures, inflation will continue to bite ordinary citizens, eroding their purchasing power and exacerbating their financial hardship.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Domestic factors undermining price stability",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/domestic-factors-undermining-price-stability-1762708754",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       November 10, 2025 00:00:00  \nAlready ranked ninth globally for climate disaster risk, according to the World Risk Index 2023, Bangladesh, so far, seems to have resigned itself to its fate. Worse, it has been doing everything to make matters worse often in the name of development work. So, one is not surprised when, according a recent report, the Roads and Highways Department (RHD) flattened some nine hills in Chattogram's Ramgarh-Sitakunda reserved forest area. Why did RHD cleared a section of reserved forest area without taking necessary permission from the authority concerned, the Department of Environment (DoE), to be specific? But who is going to answer this question? In fact, after witnessing rapacious decimation of hills and forestlands over the years in Chattogram and elsewhere in the country, asking such question seems pointless. \nActually, cutting of hills in Chattogram started from 1860s with the British East India Company conquering this part of the world after defeating the provincial governor of Bengal of Mughal India. Initially, some hills were levelled to house offices and residential quarters of the Company officials. During the colonial period and later, some hills were cut for the expansion of the port town. Since the issue of environmental degradation was yet to become a matter of serious concern in the 1950s during the pre-Independence period, some hills like the Parir Pahar (Fairy Hill) was cut down to build the New Market and the State Bank. But within 30 to 35 years since Independence, over 100 hills including Khulshi, Sholoshahar, Chashma hill, Hill View, Raufabad and so on of Chattogram have just vanished from the areas. Other than carrying out development work, hill cutting has its other economic reasons. \nIt starts after a government-owned hilly area is leased out to private parties including realtors. They then start to clear, burn and cut the hills. After a hill is levelled, the value of the land recovered is increased manifold. The earth of the hill is then bought by those who have lowlands to fill and brick fields to make brick. Interestingly, the Bangladesh Survey record misclassifies hills as farmlands (nal land), shankhola (land with grasslike plants), khila (fallow land) or bari (homestead land) and so on. Taking advantage of this wrong classification under Bangladesh Survey which started, according to the Land Ministry website in 1970, private developers have often been taking lease of hills from the government as flat, lowland or areas covered by shrubs as shown in the government record, and carrying out their work of hill-cutting. According to a recently published report, some 150 hills and hillocks across Chattogram city and its neighbouring upazilas of Hathazari and Sitakunda covering an area of about 1,400 acres have been wrongly classified in the Bangladesh Survey (BS) record. On the contrary, the 2010 amendment to the Environmental Conservation Act of Bangladesh defines 'hill' or 'hillock' as naturally elevated landforms and prohibits cutting of hills except after getting clearance from the Department of Environment (DoE). But given the history of lax implementation of laws and misclassifications in government land record of hills as low, bushy or flatlands, who is going to stop land grabbers from flattening hills with official permission? When it comes to a government department itself, in this case, the RHD, doing development work by way of expansion of road, then the helplessness of the DoE is not hard to understand. So, the destruction of the hills began in 2023 and meanwhile, as reported, removal of more than one million cubic feet of soil has been completed. True, the project authority received approval for the Terms of Reference (ToR) to prepare the Environmental Impact Assessment (EIA) report, but not permission to cut down the trees of the reserved forestland and the hills. But who cares? \nThe development work, after all, cannot wait. According to the Forest Department, around 4,600 mature trees would be required to be felled from the Ramgarh-Sitakunda Reserve Forest for the project. For expansion of road, RHD has taken some 90 acres of forestland. Going by the RHD project, a 38-kilometre road from Baraiyarhat to Ramgarh is being widened to 38 feet (which is now 18 feet wide). There is reportedly a rush to complete the road expansion project by December this year. The aim, as could be further learnt, is to facilitate transport of goods to India through the newly inaugurated Khagrachhari land port. \nNow the question is: what makes construction of the RHD project so urgent that a large area of the Ramgarh-Sitakunda reserve forest has to be mercilessly decimated and that, too, in clear violation of law? All the while, the Chattogram DoE would be watching flattening of the hills, elimination of the forest and destruction of habitats of a large number of plant and animal species including mammalians, reptiles, birds, you name it, in utter helplessness? The adviser to the ministry of environment, forest and climate change needs to act to stop this mindless destruction of the Ramgarh-Sitakunda reserve forest in the name of expansion of a road. If road has to be expanded at all, it should avoid a reserve forest on a hilly land to do that. It is also necessary to review, if, in the present circumstances, the RHD's road expansion project is so overriding that it has to be done even by riding roughshod over environmental considerations and law?\nHere it is a government body decimating a reserve forest in the name of road development and there is the private sector bodies levelling hills for housing projects as those are shown in the government land record as flat or low lands! But in either case law of the land is being violated by design or mistake. If someone affected by such damage to nature goes to court for remedy, the accused using the loopholes of laws, especially the ones relating to environment protection files a writ petition to get a stay order prom the court. The depredations of the hills, forests, wetlands and all other protected and protectable segments of our natural heritage continue unabated. Development work in a hilly terrain can still be done with the application of sustainable planning and design without disturbing hill ecosystems. In such cases, small scale development work using low-impact technology that keeps natural topography in due consideration is employed. Modern information technology tools like Geographical Information System (GIS)-based spatial planning can help undertake small-scale projects sustainably avoiding ecologically sensitive areas. The best way to initiate and run such projects in environmentally-sensitive areas is through involvement of local communities. In that case, the government should set examples by initiating such development projects with experiences and knowhow brought from abroad where there are examples of success. \nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Development damaging Nature, defying law",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/development-damaging-nature-defying-law-1762708878",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       November 10, 2025 00:00:00  \nThe planned appointment of music and sports teachers to government primary schools has been cancelled. This decision has invited protests from different cultural organisations, educators, child rights activists and students of a number of universities. Apparently, the interim government has backed out of its earlier decision under pressure from some religion-based political parties. This is not for the first time that a government of Bangladesh has yielded to such pressures. Its predecessor, the fallen government of Sheikh Hasina did so in 2017 when some writings by secular authors were replaced by contents with religious and conservative themes. Again, her authoritarian government made compromise in 2023 by removing from the textbooks for 6th and 7th graders what was dubbed by the Islamists parties, 'Darwin's theory of evolution'. In 2024, just before the fall of her government, Hasina had to scrap a story about transgender titled \"Sharifa's Tale\" from a 7th grade book. \nSo, the latest step does not go to the dubious credit of the interim government alone. But the question is, where such regressive moves will lead the country to. Contrast this with Saudi Arabia's latest decision to train 17,000 women music teachers at the school level. But this is the second such training programme that has focused particularly on music teachers of kindergarten and primary schools. In the first phase in 2022, the first batch of 12,000 music teachers were trained. The stated purpose is to make children familiarised with music and arts at their formative age paving the way for fostering creative talents. \nIf Saudi Arabia, the birth place of Prophet Muhammad (sm) is undergoing a radical transformation opening up opportunities for women to take part in sports, music, drama and other arts, Bangladesh has no reason to opt for regressive policies like this. Any 'holier than the Pope' attitude is unlikely to bring the country any dividend ultimately. Music, poetry, verse and painting induce the creative urge not only from an early age but, according to leading biological scientists, also during a child's embryonic stage in the mother's womb. These also trigger creativity and concentration, helping develop a child's vocabulary and memory. Physical exercise is essential for development of children's bones and muscle as well as tenacity. \nSo, this government decision is a violation of child rights. The incumbent government has demonstrated its enthusiasm in leasing out terminals of the Chittagong Port to foreign companies or operators ignoring protests from businesspeople. Instead, the Chittagong Port Authority (CPA) increased on an average service tariff by 41 per cent effective from October 15 last. Naturally, businesses strongly opposed the move on the ground that it would increase cost of trade and diminish the country's export competitiveness. The terminals scheduled for handover to foreign operators have proved they are profitable. A 41 per cent increase in tariff on 56 services at the port is sure to enhance the profit further even under the management of the present setup. It is exactly for this reason, the rationale behind and compulsion for the government to lease out the terminals to foreign operators is rather suspect. \nQuestion naturally arises if the government can pursue a policy so dicey for an interim government with utmost tenacity ignoring appeals from the country's trade bodies, why can it not show a similar resolve in a matter regressive enough to take the country backward? Any move that deprives today's children of their rights and flourishing of their talents is a gross disservice to the posterity. When the artificial intelligence (AI)-dominated 4th industrial revolution is knocking at the door, such regressive steps at the highest level of administration are likely to be considered a disgrace for the nation. \nThis country earned its liberation from colonial rules on the basis of principles of secularism and socialist democracy. It has long digressed from its avowed goal. Any further digression will prove highly costly. The country can ill afford any such regressive journey.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "No music & sports teachers  for primary schools!",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/no-music-sports-teachers-for-primary-schools-1762708902",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 10, 2025 00:00:00  \n\nBangladesh is witnessing remarkable growth and transformation in the digital sector, with its youth emerging as the stars of startups and online ventures. From e-commerce and freelancing to social commerce, digital entrepreneurship is becoming a powerful force shaping the nation's economy. Millions of young people are now engaged in online work, contributing significantly to income generation and employment.\nThe rapid rise in internet access, mobile banking, and digital payment systems such as Bkash, Nagad, and Rocket has made it easier than ever to engage in online business. Social media platforms like Facebook, Instagram, and TikTok offer ideal spaces to showcase products and facilitate two-way communication with customers. These platforms have become major marketplaces for clothing, food, craft items and more.\nTo fully realise this potential, Bangladesh must ensure affordable and reliable internet access nationwide. Furthermore, initiatives between the government and private sector can equip young entrepreneurs with essential skills, including marketing and engagement with international e-commerce platforms like Amazon.\nWith structured support and clear policy guidelines, Bangladesh can transform its youth into a dynamic digital workforce, boost innovation and creativity and position the country as a competitive player in the global digital economy.\nLameya Anis\nNorth south University \nDepartment of BBA\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Rise in digital economy",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/rise-in-digital-economy-1762709016",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-11-2025"
    }
]