[
    {
        "full_article": "Kerala’s decision to amend the Wildlife (Protection) Act 1972 marks a turning point in the federal discourse on environmental governance. The Wild Life Protection (Kerala Amendment) Bill 2025 seeks to arm the State with powers thus far reserved for the Union government. While the ambition is rooted in a painful lived crisis, the attempt to sidestep Centre-State dissonance exposes tensions between ecological prudence and federal autonomy. The Bill asserts that the State may decide when a Schedule II animal has become ‘vermin’, and thus liable to lose protections under that Schedule for specific areas and periods. It also vests the Chief Wildlife Warden with the power to order any animal that has severely injured a person to be killed, tranquillised, captured or translocated. There have been violent confrontations with wild boars in the State’s dense mosaic of farms, settlements and forests. Assembly resolutions and ministerial trips to New Delhi to have the wild boar declared as ‘vermin’ under the Central Act have proved fruitless. Read against the ongoing expansion of human settlements into erstwhile buffer zones, the change risks normalising lethal outcomes produced by human advance rather than by animal behaviour. This said, the Centre’s power to declare vermin has too often been exercised as a veto without transparent criteria or timely engagement with States that face distinct ecologies and pressures. Kerala’s frustration is thus a federal critique.Shifting the same blunt power to the State does not by itself cure the vice of opacity, however. A jurisprudence that ties need to circumstance must interrogate how the circumstance was produced and whether non-lethal options were credibly exhausted. Section 62 of the Central Act exists to keep indiscriminate culling from eroding conservation baselines. Wildlife lies in the Concurrent List and any State law repugnant to the Central Act requires Presidential assent. If that test can be framed as Centre versus State, it is also about whether Kerala’s recourse recreates the national safeguards in devolved form. A defensible settlement would preserve the floors, i.e., no dilution of baseline protections and international commitments; building State-level ceilings in the form of clearer, faster procedures; devolving non-lethal toolkits and accountable, data-driven thresholds; and tuning incentives to reward coexistence. Until then, declaring the wild boar to be ‘vermin’ or downgrading the bonnet macaque from Schedule I to Schedule II of the Central Act, while buying political time, may risk deepening a cycle in which governance failure begets lethal shortcuts. If the urgency is real, so too is the obligation to ensure that speed does not substitute reason and federal devolution does not become federal abdication.\r Published - October 10, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Kerala\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        wildlife\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        animal\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        forests",
        "headline_1": "Tusks and tensions: On the Wild Life Protection (Kerala Amendment) Bill 2025",
        "headline_2": "Kerala’s changes to Wildlife Act will devolve national safeguards",
        "link": "https://www.thehindu.com/opinion/editorial/tusks-and-tensions-on-the-wild-life-protection-kerala-amendment-bill-2025/article70144084.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "10-10-2025"
    },
    {
        "full_article": "The blast in a firecracker unit at V. Savaram village in Konaseema district in Andhra Pradesh that claimed eight lives is the latest in a series of accidents that have punctuated the weeks leading up to Deepavali, year after year. The unit was among the 18 firecracker manufacturing units in the district that had had a safety audit about a month ago. The units had been issued licences by the District Collector. Such incidents have been reported in the district in earlier years too. A three-day ban on firecracker manufacturing has been imposed and a fresh safety audit has been ordered. It would appear that no anomalies were found in the audit and no red flags were raised. Besides the 18 firecracker manufacturing units, there are 18 other units in the district that procure and sell crackers wholesale during the season. While firecracker manufacture is not a major activity in the district, there are some seasonal units. There were 10 people in the unit that used chemicals to manufacture the crackers when an electrical fire led to an explosion and the collapse of a wall. That the authorities found it difficult to identify the dead would point to poor record keeping. Further, Konaseema is in the Godavari basin which has extensive oil and gas drilling and transport operations including pipelines. Fire accidents can be devastating if they spread to these facilities.Firecracker manufacturing is not a major economic activity across India barring Tamil Nadu. The awareness levels and scrutiny are, therefore, not always high, and Konaseema would seem to be one such case. The nodal agency that licenses these units is the Petroleum & Explosives Safety Organization (PESO) which has various levels of licensing with elaborate safety protocols. Fire needs fuel, air and a source of ignition. Cracker manufacturing units have many combustible materials, which are the fuel, which is why sources of fire must be completely absent. It is for this reason too that electric equipment and switchboards must meet high fire safety standards and should intrinsically protect against the starting of fires. Even if an electric fire were to start, it should not spread to areas where explosive chemicals are used. An added layer of safety typical in PESO protocols is that the electric equipment can only be operated when no human would be present. But it would seem that such elaborate protocols were either absent or poorly implemented at Konaseema. The accident shows that there is a case for all such units across the country to scrupulously apply the high-level safety protocols of PESO.\r Published - October 10, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        accident (general)\n                    \n                            /                      \n                        \n                        fire\n                    \n                            /                      \n                        \n                        Andhra Pradesh\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        safety of citizens\n                    \n                            /                      \n                        \n                        explosion\n                    \n                            /                      \n                        \n                        chemicals\n                    \n                            /                      \n                        \n                        festivals",
        "headline_1": "​Working with fireworks: On the Konaseema firecracker unit blast",
        "headline_2": "India must implement safety protocols for units dealing with explosives",
        "link": "https://www.thehindu.com/opinion/editorial/working-with-fireworks-on-the-konaseema-firecracker-unit-blast/article70144385.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "10-10-2025"
    },
    {
        "full_article": "Investors spooked by Trump’s policies have sought safety in gold, but expecting an endless rally would be a mistake\nGold crossed the $4,000 per ounce milestone this week. That’s over ₹1.2L per 10g in Indian market terms, an all-time record. The world’s 7.2L centenarians will remember a time when an ounce – 28.3g – used to be worth $20.7. In fact, this rate largely held steady for a century from 1834 to 1934, when it was raised to $35 and maintained for the next 34 years. Gold was a stable commodity then, and a stabilising influence on the global economy. Now, it’s a hedge, which explains why its price soars at the first sign of trouble.\nThat sign this year is Trump – born in the $35 era and now going on 80. Gold was at $2,700 on the day he was sworn in eight months ago, so it’s gained about 50% already. It hit $3,000 in March when Trump amped up talk of tariffs and spread uncertainty, and has crossed $4,000 now amid delayed US financial data and a US govt shutdown. Goldman Sachs sees it hitting $4,900 by Dec next year – over ₹1.5L per 10g.\nOf course, predictions are based on assumptions and shouldn’t guide action. When gold went from $38 per ounce in 1972 to $850 in 1980, financial advisers would have egged you on to buy more of it. But by 1999, it had crashed to $251. In 2022, gold tumbled from $2,000 to $1,600. What Trump does next will certainly determine gold’s trajectory, but unexpected events can overtake him and the rest of us. Gold crossed $1,000 amid the 2009 financial crisis, and $2,000 during the pandemic. Both times, fears of inflation from massive govt stimulus spending – over $20tn in the first five months of the pandemic – started the dash for the safety of gold.\nLarry Summers, US treasury secretary under Clinton, said investors rush to gold “when they don’t have confidence in the people who are managing the country”. But Trump’s ad hoc policy-making is affecting confidence beyond US borders. That’s why central banks have been lapping up gold too. As savers and investors, the thing to remember is that the surge in gold’s price isn’t organic. Gold is a haven, yes, but this mad rush could end in a stampede.\n\n",
        "headline_1": "Shine Language",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/shine-language/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-10-2025"
    },
    {
        "full_article": "Indians are racing to the new weight loss drugs like they did to processed foods. Who’s telling them it’s a vicious circle? \nEvidently, it’s not just the celebrities. Past months have seen many of them shed the kilos so dramatically that they just can’t convince peeps that it’s not because of the new weight loss drugs (WLDs), no matter how much they deny it. Yeh jo public hai ye sab janti hai, as the song goes. Now it seems that a lot of this speculation may be informed by first-hand experience. So briskly have Indians taken to Mounjaro that this injectable weight loss therapy has seen 42% and 60% kind of m-o-m growth since its March launch. It’s now looking set to displace our pharma market’s long-standing market leaders (an antibiotic and an anti-diabetic). But this WLD, starting at an average monthly cost of ₹14,000, is a pricey fad. Also a worrying one. \nIndians have acquired mass obesity within a generation. Its core explanation is no different than America’s, although we have shortened their timeline on this just as we seem to be doing with the WLDs. As Johann Hari writes in his sobering Magic Pill, we began to eat foods that didn’t exist before – “designed by the food industry to be maximally addictive, pumped full of just the right proportions of sugar and salt and starch to keep us chomping”. Only, alongside embracing America’s chips and colas, it feels like India’s now eating more samosas and jalebis in a day than previous generations got in a year. Ideally, the magic pills, which are actually weekly injections, should be carefully prescribed to patients who really need them to battle diabetes, heart disease, or other serious cousins of obesity. Instead, reports make it clear that the doctors are shilling these WLDs with little care or caution. \nNext year, when the patent for semaglutide, the active ingredient in major WLDs, expires in India, and their prices accordingly do a generic drop, their uptake may shoot up abnormally. Shouldn’t doctors and regulators be ready for that? Not just all the nausea, vomiting, diarrhea, constipation, loss of muscle mass that we already know about, but also the side-effects that we don’t yet know. In the face of a titanic drug industry plug, public health advice shouldn’t go AWOL. \n\n",
        "headline_1": "Stranger Things",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/stranger-things/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-10-2025"
    },
    {
        "full_article": "Fly to the moon, but the road’s still cratered  \nMumbai got a new airport yesterday at Navi Mumbai. All nice-nice, chakachak.  Delhi too will get a second one at month-end. That hawai adda is not at any Naya NOIDA, but ki farak painda? With both we’ll soar into global aviation’s stratosphere. Provided we don’t miss the flight thanks to down-to-earth jams. Fancy new infra gets jilted by plain old truth: What the big print giveth, the small print taketh away. \nLast week Shri Eknath Shinde was ‘in conversation’ with Shekhar Gupta. Hon Dy CM, Maharashtra, listed the goodies laid on and to be laid on by his Mahayuti govt. He still has clout even though he’s no longer CM, but plays half-second fiddle, along with Ajit Pawar, to his former DCM, now-CM, Devendra Fadnavis. This arrangement looks as convoluted as our daily detours thanks to these projects which will make our rashtra maha again. MMGA.\nSo what if every big-small road looks like it has committed hara-kiri, making it suicidal to get anywhere? Bhau, bund kar re kitkit. Means, it’s because so much infra is in the pipeline. Yes, yes, I know this also means a dash to that new  airport could be a pipe dream.\nShinde-saheb told us it will take just 40 minutes to get from South Bombay to the new airport via the 21.8km Atal Setu. No, our DCM wasn’t spinning a yarn. SoBo-ites can certainly zip to this transharbour bridge via other engineering marvels like Coastal Road, Sea Link and under-construction Worli-Sewri Connector. But, they still swear it out at bottlenecks choking the entry and exit of first two, and godknows when third will be complete. Dilliwalas will suffer same. Last month weren’t they stuck forever on clogged NOIDA expressway? \nSo close I’m living to Atal Setu means I can reach Navi Mumbai in minutes only. Pann bhau, my work is all in purani Mumbai, and that ride takes over an hour because of long-long jams and no buttered zipways! Maybe I should go only where new airport will fly me.                                \n                                  ***\nAlec Smart said: “Has SIR set the Bihar test paper?”\n\n",
        "headline_1": "Infra-Redlight",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/infra-redlight/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-10-2025"
    },
    {
        "full_article": "Prashant Kishor has outsider appeal against the culture of bakaiti (idle talk) shored by complex local networks. But is his idiom of productivity & personal betterment only a sales trick?\nIn this election cycle in Bihar, few have drawn as much curiosity as Prashant Kishor. After a decade crafting electoral wins for others, he now seeks one himself. His padyatra has been a feat, covering 2,697 villages across 235 blocks in 665 days. It has inspired both fascination and fatigue. And overall, his rise reflects a deeper churn in Bihar’s democracy.\nRead full story on TOI +\n\n",
        "headline_1": "PK’s Un-Bihari pitch",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/pks-un-bihari-pitch/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 10, 2025 12:00:00  \nDespite reforms, policy innovations, and impressive macroeconomic performance in recent decades, inequality continues to undercut the promise of inclusive growth. This paradox -- growth without equitable distribution -- has long been observed in developing nations, but it is particularly striking in South Asia, where persistent disparity remains a barrier to sustainable development.\nAt a recent book launch in Dhaka, the issue was once again brought into sharp focus. The book Apostles of Development: Six Economists and the World They Made, authored by Yale University Professor David C. Engerman, explores the intellectual legacies of economists who shaped South Asia's development thinking. In his remarks at the event, Professor Rehman Sobhan, Chairman of the Centre for Policy Dialogue (CPD), underlined a stark truth: South Asian economies, including Bangladesh, may have recorded steady growth for decades, but the widening gap between rich and poor has remained unresolved. Prof. Sobhan's warning is timely. He noted that waves of reform --- whether in trade, financial liberalisation, or welfare expansion --- have failed to reverse inequality. The deeper problem lies in the very structure of economies across the region. Concentrated asset ownership, elite dominance over policymaking, and exclusionary access to opportunities create a system that continuously reproduces inequity. What this means is that while GDP growth rises, the benefits remain locked within privileged circles, leaving the majority struggling to find a foothold on the growth ladder.\nThe Bangladeshi context is telling. Over the past three decades, the country has moved from a low-income to a lower-middle-income economy. Export-led growth, remittance inflows, and social progress indicators have earned Bangladesh global recognition. Yet, income and wealth distribution have remained heavily skewed. Access to land, quality education, healthcare, and financial services is still disproportionately tilted towards urban elites. For rural households and the urban poor, opportunities for social mobility remain severely restricted. The celebrated \"growth miracle\" loses much of its sheen when weighed against the entrenched inequality that limits both human potential and national progress.\nThis pattern is not unique to Bangladesh. The Global South as a whole comprising Asia, Africa, Latin America, and Oceania now commands growing shares of global resources, markets and production. But domestic inequality threatens to hollow out this progress. Rising prosperity in aggregate terms masks the stark internal divides that foster instability and social discontent. When wealth and opportunities are concentrated in the hands of a few, development becomes exclusionary, undermining the very purpose of growth. Inclusive growth requires more than short-term welfare measures or piecemeal policy adjustments. It demands structural reforms that expand access to productive assets, democratise policymaking and remove systemic barriers for marginalised groups. Without addressing the roots of inequality, nations risk perpetuating a system under which growth benefits only the few while leaving the majority behind. The challenge, therefore, is to rethink development beyond GDP numbers. As Professor Sobhan argued, unless policymakers confront inequality at its core, growth will remain fragile, divisive, and unsustainable. True progress lies not merely in expanding national wealth, but in ensuring that its fruits are shared equitably across society.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Growth without inclusion and saga of inequality",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/growth-without-inclusion-and-saga-of-inequality-1760022235",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       October 10, 2025 00:00:00  \nThe observance of the World Teachers' Day on October 5 was mostly a muted affair in this country. There is nothing to be surprised at the event passing so quietly. In a country where teachers, particularly those of the primary and secondary schools, are systematically neglected, why should such a day be given the spotlight it deserves elsewhere? Following the July-August uprising, this country was a witness to a mob culture among students. They subjected the very teachers from whom they learnt lessons to humiliation and forcible resignation and in some cases brutal physical assaults.\nPrimary and secondary school teachers' status has also been undermined by the archaic and rigid government system. An assistant teacher of a government primary school is placed under grade 13 with a basic salary of Tk 11,000 whereas a driver requiring a qualification of class VIII is under grade 12. Teachers of secondary schools enjoying monthly pay order (MPO) start their career with Tk 12,500. An assistant teacher can end up his/ her career without ever getting a promotion. \nWhen primary teachers serving as the architect of nation-building are so underestimated and relegated, the consequences are bound to be self-defeating. It is the primary teachers who are responsible for the foundational education of children. When teachers are ranked below or on a par with drivers, clerks and computer operators and the salary they draw is too meagre to run their families, they are socially undermined and financially deprived. Expectation that they would give their cent per cent to their professional call thus never materialises. \nWhat is particularly galling is that teachers in this country get the lowest remuneration in South Asia. The average salary of a primary teacher here is a little over $170 whereas in Myanmar holding the immediate higher slot, it is $189 a month. Other countries in the region are far ahead. Low pay package obviously fails to attract meritorious candidates. Thus primary education has failed to serve the very purpose of shaping the future of students. The customary education most primary teachers impart fail to match the demanding and inspired learning of modern time. \nThe fact that weakness in reading and numeracy among primary students is persistent has been highlighted by different studies. According to the United Nations Children's Fund (UNICEF), 66 per cent third graders have no foundational skill of their Bangla text book and 82 per cent are found wanting in numeracy skill. Another study concludes that almost half of the students in the primary grades cannot read Bangla at their grade levels and two-thirds cannot do basic arithmetic. \nWeakness in the foundational education at the primary level is carried over to the secondary level. With three streams of education ---general, madrasah and English medium---prevailing, the country has failed to frame a suitable education policy. Then there is the polytechnic education at this level. Its syllabus is a mix of general and technical education. The English medium has nothing to do with the local curricula, it follows the international curricula such as the Cambridge International, Pearson Edexel and International Baccalaureate (IB) programmes. Madrasah education has two categories---Alia madrasah and Qwami madrasah. Alia madrasahs are regulated by the Bangladesh Madrasah Education Board but not the Qwami madrasahs. They follow curricula different from each other. \nThe different types of education offered have made the task of skill development of human resources difficult. It is the mainstream general education that matters most in a situation like this. It has been subjected to various experiments like a shift from the traditional evaluation system of students' performance on the basis of scores. Instead of first, second and third divisions, grading system was introduced. A form of creative education was also introduced without adequately preparing teachers to undertake such a challenging task. The intention was appreciable but there was not adequate preparation for attaining the objectives. \nThen comes the transition of the levels of primary education from the traditional class V to class VIII and the secondary education from class IX to class XII. Again, this academic system was given up in favour of the 2010 system following the fall of Sheikh Hasina government. One batch of students has already completed the class IX syllabus. Secondary School Certificate (SSC) examinations of this batch of students will be held on the syllabus of only class X. \nThe Qudrat e Khuda education commission also suggested for the primary level to cover up to class VIII and the secondary up to class XII. The purpose was to develop skilled manpower. Students not as bright as those pursuing higher education better be allowed to opt for careers on the basis of skills acquired. If they complete the course of education up to class XII, pursuance of a career is likely to be easier. But successive governments failed to implement the suggestions. \nThus education has now been commercialised at its maximum with coaching centres and tutors replacing classroom teaching. Below quality teachers infiltrating the education sector or teachers qualified enough spending their time and energy in coaching centres in order to ensure that they do not have to rely on the meagre salary have vitiated learning environment. The mismatch in the education sector shows no sign of coming to an end. Students of poor families cannot afford coaching fees and it is no surprise that 33 per cent students drop out at the secondary level. As a result, a discriminatory system of education has developed. Without addressing this discrimination, the country's development will remain illusive. The overwhelming need is to increase the budgetary allocation for education and gradually narrow the gap of opportunities for the underprivileged.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The World Teachers' Day and educational imbroglio",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-world-teachers-day-and-educational-imbroglio-1760022289",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       October 10, 2025 00:00:00  \nEvery year, there are reports galore on people in rural areas losing their lives from snakebites. Lack of anti-venom leaves the victims and their families devastated and helpless, as they can do nothing but wait for their inevitable death.\nBlessed with vast wetlands, fertile plains and a tropical climate, Bangladesh is home to many species of snakes. Among these species, monocled cobra, Russell's viper, banded krait, and green pit viper are responsible for most fatal bites. Approximately 6,000 people die annually in Bangladesh from snakebites, though the actual number may be a lot higher as many cases go unreported. According to the World Health Organisation, snakebite is a neglected health issue all over South Asia.\nThe fact that these deaths could have been prevented makes them even more tragic. The only effective treatment for venomous snakebites is anti-venom or anti-venin injection. Yet, almost every upazila-level hospital in Bangladesh suffers from a shortage of antivenom, resulting in deaths that were preventable.\nThe Directorate General of Health Services (DGHS) is responsible for distributing antivenom injection to government hospitals. But the injections are usually supplied mostly to medical college hospitals and some district hospitals, while upazila hospitals are left out. On the rare occasions they get supplies of anti-venom injections, the injections are not in their best of conditions due to a lack of proper storage and handling.\nThe lack of proper treatment in hospitals leaves people from the countryside with only one option for treatment, which is traditional healers. Traditional healers are local ojhas and kabiraj who use chanting, herbal paste, or even cutting the wound to supposedly cure the victim. What they do is just making the situation worse. A study conducted by the Institute of Epidemiology, Disease Control, and Research (IEDCR) in 2020 found that over 60 per cent of snakebite victims initially sought treatment from traditional healers. Many of them did so knowing the local hospitals lacked antivenom injections.\nClimate change has been linked with the increase in snakebite incidents in recent years. Due to changing rainfall patterns, flooding and the destruction of wetlands, snakes are losing their habitats and moving closer to human settlements.\nAccording to public health experts, it is not only about the shortage of antivenom but a systemic neglect. There is no budget allocated for providing antivenom at the district and upazila levels. Medical staff do not receive any training on how to diagnose and treat venomous snakebites. Furthermore, the lack of a national database for snakebites also makes it impossible to plan and allocate resources to address the problem effectively.\nOur neighbouring countries have started addressing these issues and made noticeable progress. India, where snakebite fatalities are the most common, has adopted a national protocol requiring all health centres to be stocked with antivenom and trained medical staff. Sri Lanka also developed a well-organised supply chain of antivenom vials that has drastically decreased their snakebite fatalities. Yet, Bangladesh still lacks a proper national protocol on the matter.\nMost snakebite victims are farmers, fishermen, and day labourers from rural areas and they are often the breadwinners of their families. Their death or disabilities due to amputation often plunge their families into poverty.\nSome urgent steps must be taken to address the issue. Firstly, a reliable supply chain must be established to ensure all upazila and district hospitals receive enough anti-venom. Secondly, medical staff must be trained on the diagnosis and treatment of venomous snakebites. The DGHS should allocate a budget dedicated to ensuring the proper transportation of antivenom injection and training of medical staff. Thirdly, awareness has to be developed in rural communities through nationwide campaigns.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Lives lost for lack of antivenom injection",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/lives-lost-for-lack-of-antivenom-injection-1760022312",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 10, 2025 00:00:00  \n\nIn recent years, the word \"sustainability\" has become one of the most frequently used terms in Bangladesh. It appears in government speeches, university programmes, business meetings, and even social campaigns. Everyone seems to be talking about sustainability but is it really working?\nThe growing popularity of the term began after the United Nations introduced the Sustainable Development Goals (SDGs) in 2015. Bangladesh officially adopted these goals in 2016, aiming to achieve development that protects the environment while improving people's lives. \nSince then, most government offices, NGOs, and businesses have tried to link their work with these global goals. Universities have also included sustainability topics in their courses and research, making it a familiar concept among students and professionals.\nAt the same time, Bangladesh faces severe climate risks such as floods, cyclones and rising sea levels. These threats make environmental sustainability not just a policy priority but a national necessity. Projects promoting renewable energy, sustainable farming, and climate-resilient housing have gained importance, reflecting the urgent need to protect both people and Nature.\nIn recent years, banks and corporations have begun publishing sustainability and ESG reports, while universities such as North South and BRAC have launched research and training initiatives on green development. \nThis shift shows that the idea of sustainability is gradually spreading across sectors.\nHowever, the practical results remain mixed. While some factories have become globally recognised as green leaders and renewable energy use is expanding, many projects are short-term or exist only on paper. Industrial pollution, poor waste management, and weak law enforcement still hold back real progress. In many cases, sustainability has become more of a buzzword than a genuine commitment to long-term change.\nBangladesh now needs stronger policy enforcement, greater public involvement and better education on sustainable living. The focus must shift from slogans to real action.\nSangida Jahan Ripa\nDepartment of Accounting and Finance \nNorth South University \nsangida.ripa@northsouth.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Hype over sustainability: How is it working?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/hype-over-sustainability-how-is-it-working-1760022334",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-10-2025"
    }
]