[
    {
        "full_article": "The case of a 42-year-old woman in Kerala testing positive for Nipah virus on May 8 makes it the third such instance being reported from the State’s Malappuram district in the last two years. The earlier cases were detected last year, in a 14-year-old boy on July 21 and a 24-year-old adult on September 15. With the latest detection of Nipah in the State, Kerala has recorded two outbreaks, in the years 2018 and 2023, involving human-to-human transmission, and four spillovers in the years 2019 and 2021, and two events in 2024. In the May 8 event, even though only one person tested positive for Nipah and seven close contacts tested negative, it is a bit early to call it a spillover. Unlike an outbreak, Nipah spillovers are restricted to a single case with no human-to-human transmission. One reason for the absence of human spread is the timely detection of the case and isolation of the patient. The other reason is the clinical presentation. In the case of Nipah virus spillovers, patients who tested positive for the virus had presented with acute encephalitis syndrome (AES), while in the Nipah outbreaks in 2018 and 2023, the index case and at least a few other infected people had presented with acute respiratory distress syndrome (ARDS). Compared with AES, patients with ARDS present with relatively severe conditions with lung involvement. Besides cough, patients presenting with ARDS have higher viral loads, which serve as a surrogate for disease severity. Immaterial of whether blood, urine or cerebrospinal fluid samples test positive or not, throat swab samples generally test positive if a person is infected by the Nipah virus, which again serve as an indicator of human spread in the case of patients with ARDS. The high viral load, the presence of virus in the throat and the tendency to cough make human spread possible. Greater disease severity in ARDS cases is also the reason for the Nipah deaths in 2018 and 2023. There were 17 deaths from 18 cases in the 2018 outbreak, and two deaths from six cases in the 2023 outbreak. A study by the ICMR-National Institute of Virology (NIV) Pune found that the 2018 Nipah virus had small genetic variations from the Bangladesh strain and was able to cause multisystemic disease in a Syrian hamster model resembling human infection.The Nipah virus is capable of causing different clinical presentations and is endowed with the ability to cause human spread in some cases. This makes a strong case for a quick and thorough genetic study of the virus in humans and bats. With Nipah cases now a very regular occurrence in Kerala, the compulsion to routinely study fruit bats, which are natural hosts for Nipah, cannot be overemphasised. That even the 2018 virus showed small genetic differences from the Bangladesh strain makes it even more important to know whether the virus causing the spillovers without human spread has evolved further. Such studies can be done by more scientists only when the genetic sequences are shared in public databases without any delay.\r Published - May 10, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Nipah Virus\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        viral diseases\n                    \n                            /                      \n                        \n                        Bangladesh\n                    \n                            /                      \n                        \n                        Pune",
        "headline_1": "​Greater regularity: On the Nipah virus",
        "headline_2": "Genetic sequences of Nipah virus must be shared in public databases quickly",
        "link": "https://www.thehindu.com/opinion/editorial/greater-regularity-on-the-nipah-virus/article69557406.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "11-05-2025"
    },
    {
        "full_article": "A storied career is grinding to a halt in phases. Rohit Sharma, as is the trend now among cricketers, is doing the slow fade-out. First up, he retired from T20Is, and now at 38, after a poor run in Tests, the Indian skipper has bowed out of cricket’s longest format. If earlier, players did the reverse of quitting limited-overs cricket and stretching their stint in Tests, as was the case with Sachin Tendulkar, modern heroes prefer the kinetic energy of the abridged versions over the gritty charm of the five-day tussle. As the English sport with an Indian heart grapples with an identity crisis in an era of shorter attention spans, players are perhaps swayed by the magnetism of cash-rich T20 leagues, with the Indian Premier League leading the way. Rohit, though, has other motives in keeping away the shadows from ODIs. Dropped from the 2011 World Cup winning squad, he still hurts over India’s semifinal loss to New Zealand in the 2019 World Cup in England, a championship in which he struck five tons. To make it worse, under his captaincy, India lost the World Cup final to Australia in the 2023 edition at Ahmedabad. That India won the 2024 Twenty20 World Cup and this year’s ICC Champions Trophy, has kept him motivated.Cricket’s beating heart is centred around Tests. A brand that offers second chances, and one that probes the quality in every cricketer. There was a time in the 1980s when Tests were the real deal and ODIs were deemed an after-thought. Much water has flowed in the Thames and Hooghly since then and this is an age in which T20 leagues have more allure. The West Indians led by Chris Gayle were the initial members doing service in diverse T20 leagues across the globe. Rohit and Virat Kohli have donned the India shade from 2007 and 2008, respectively, and their’s have been a long stint. In perhaps forcing Rohit’s exit from Tests, the selectors are doing the slow recasting of Indian batting in Tests. Cheteshwar Pujara, Ajinkya Rahane and now Rohit, had to vacate and much would hinge on Kohli and K.L. Rahul, the senior duo, when India heads to England in June for five Tests. Rohit, the one-day supremo, always outdid his Test avatar. Still, to score 4,301 runs from 67 Tests, in which a significant chunk came as an opener, is remarkable. Published - May 10, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        cricket\n                    \n                            /                      \n                        \n                        Indian Premier League\n                    \n                            /                      \n                        \n                        Test  cricket\n                    \n                            /                      \n                        \n                        Twenty20",
        "headline_1": "Captain’s exit: On Rohit Sharma’s retirement and the Indian cricket team",
        "headline_2": "India’s Test team seems set for a transition phase",
        "link": "https://www.thehindu.com/opinion/editorial/captains-exit-on-the-indian-cricket-team/article69557537.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "11-05-2025"
    },
    {
        "full_article": "How long will a terror sponsor get financial bailouts? \nAmidst the military escalation by Pakistan – which now includes the irresponsible use of civilian passenger jets as human shields – its latest IMF bailout package was reviewed yesterday. But the spectacle of a sponsor of terror getting bailouts from an international lender is truly jarring. IMF bailouts for Pakistan are akin to giving a delinquent teenager additional pocket money despite a history of irresponsible behaviour. It must stop for the sake of global security. \nDespite an astonishing 24 IMF bailouts since 1958, Pakistan has little to show by way of reforms. Even noted Pakistani economist Kaiser Bengali has said that his country has been reduced to a pauper, taking loans to pay off loans. Any sensible country would have made its economy a priority. But Pakistan spends the money on defence, willingly gets into conflict situations, and fritters the rest away through corruption. Consider two points. According to SIPRI, Pakistan spent $10bn or 2.6% of its GDP on defence in 2024. This, despite Islamabad’s external debt being over $130bn, and forex reserves just $15bn, good for only three months of imports. Pakistan’s army is clearly siphoning off most of the country’s money and bailout support. Yet, Islamabad this year proposes to further increase defence spending by 18% \nSecond, for every Pakistani Rs 100 collected in taxes, trading and commercial imports businesses contribute just 60 paise. Unsurprisingly, a plethora of Pakistan’s politicians fall in the latter category. In other words, Pak generals and politicians are looting the state. But if international lenders threaten to withhold financial support, Pakistan’s leaders have perfected the art of negotiating with a gun to their head, effectively engaging in nuclear blackmail. It’s time to call Pakistan’s bluff. The generals at Rawalpindi GHQ and Pakistan’s corrupt politicians have taken the world for a ride for far too long.\n\n",
        "headline_1": "Delinquent Pak",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/delinquent-pak/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-05-2025"
    },
    {
        "full_article": "SC gives a fine & necessary order  \nOverturning a Delhi HC verdict, Supreme Court on Friday held that public scrutiny of court orders is not just kosher, but also necessary “as a check against judicial caprice or vagaries”, in the words of an earlier 9-judge bench. SC reiterated public gaze was “a powerful instrument for creating confidence of the public in the fairness, objectivity and impartiality of the administration of justice.”\nThe case was about Delhi HC’s order to Wikimedia to take down a website page that discussed the court’s order on the legal dispute between ANI and Wikimedia. ANI had accused Wikimedia of defamation; the page in question detailed the case – this, Delhi HC held, was “contempt of court”. Wikimedia moved SC, which on Friday correctly said that “it is not the court’s job to tell the media: delete this, take that down.”\nCourts frequently bristle at even bona fide criticism, using a very broad definition in the Contempt of Courts Act 1971, which criminalises acts that “scandalise” a court. Even Chandrachud’s pan-India initiative to live-stream court proceedings was also centred on enhancing transparency. SC in this case used twin tests of necessity and proportionality to conclude that to improve any system, including the judiciary, introspection was key, and only robust debate could ensure that, “even on issues before the court”. This is not just a blow for free speech but a step towards a maturing of Indian democracy.\n\n",
        "headline_1": "Good for free speech",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/good-for-free-speech/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-05-2025"
    },
    {
        "full_article": "Don’t judge a drone’s lethality by its price \nMilitary drones aren’t new. America used Pioneer RQ-2As in the ’91 Gulf War. As one of them came in to survey Failaka Island, five Iraqi soldiers made history by waving a white flag and surrendering to it. But almost 35 years on, drone use has become common on the battlefield. Op Sindoor, Ukraine, Myanmar, Red Sea, drones have forced militaries everywhere to rethink strategy. If you find drone warfare intriguing, check out the podcast Drone Wars.\nThere’s no denying that Ukraine mainstreamed the small “homemade” drone as a weapon, but as military expert Mike MacKay points out in an episode, Isis was using cheap, store-bought drones to drop grenades on coalition forces in Iraq in 2016. Where the ’91-vintage RQ-2A was 14ft long and had a wingspan of almost 17ft, a top-end military drone like Reaper MQ-9 – India has ordered 31 of them – now measures almost 66ft across and costs over $30mn. Pakistan’s Turkish-origin Bayraktar Akinci drones also cost several million dollars each. But the drones revolutionising warfare are tiny in comparison, and dirt cheap, often costing no more than a few hundred dollars each. So, even a cash-strapped country like Ukraine can make hundreds of thousands of them. It made over 1mn in 2024 and would double output, funds permitting. \nCan any military hope to acquire 2mn fighter planes? A B2 strategic bomber costs well over $1bn. But the Ukrainian drones – Magura V5 – that knocked out 40% of Russia’s naval fleet in Black Sea cost only about $250,000 apiece. In Red Sea, Houthis have sunk ships with over $100mn worth of cargo, using drones that cost only about $100,000 each. Experts on the podcast say the low cost of drone warfare makes this a cavalry-vs-machine gun moment for militaries all over again. Where tanks and field guns intimidated opponents at one time, now they are sitting ducks for drones.\nChristopher Miller, another drone expert, says militaries will need to adapt rapidly to drone warfare because old front line techniques, like firing mortars, are too slow. Where aiming at and hitting a target with a mortar takes at least five minutes, a drone with AI does the job in 90 seconds. And while a mortar can hit only up to a couple of kilometres, even small drones can fly 15-20km. That’s why S Korea, learning from Ukraine, has decided to phase out its smaller mortars and train troops to become drone pilots. Experts on the podcast say Ukraine has 20 schools to train drone pilots. Its expert pilots can manoeuvre a drone by reckoning or counting rather than using the inbuilt camera. One of them was awarded Ukraine’s Hero of the Republic medal for killing 400 Russian troops in six months. \nYou can shoot down drones, of course. Coalition forces in Iraq did so with guns, but when hundreds of drones – a whole swarm – come at you, countermeasures are harder. You could use sophisticated missiles like the Patriot Interceptor – or the S400 that India used to shoot down Pakistan’s missiles – for bigger drones, but supplies and costs are a hurdle. For now, nobody has a foolproof counter to attacking drones, and as the bigger militaries – US, China, India – start inducting them in bigger numbers, questions about AI capabilities will also have to be dealt with. Autonomous drones could dodge hacking, jamming and GPS-spoofing, but will they hit targets their human masters want them to? That’s the next drone frontier.\n\n",
        "headline_1": "Cheaper than a car, deadlier than a plane",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/cheaper-than-a-car-deadlier-than-a-plane/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-05-2025"
    },
    {
        "full_article": "On arty-crafty terms replacing good old-fashioned words\nAn Australian friend has sent me an article from a local newspaper which says that the Down Under continent is being ‘uplifted’. Is the land of Oz levitating to the top of the world? Not quite. \n‘Uplifted’ doesn’t have anything to do with geology. Or with such gravity-defying, cosmetic surgery procedures like tummy tucks and double chin eliminations, but is the latest addition to the argot of the hospitality industry. \nIf a hotel offers to change the standard room you booked for a superior room, you are being uplifted. What’s wrong with an old-fashioned upgrade? Upgrade has been downgraded and replaced by the presumably more uplifting ‘uplifted’. Want an extra dollop of cheese on your pizza? By all means. Get uplifted. \nOral snobbery, or snobspeak, which is reinventing language seeks to poshify everyday vocabulary. In the mid-50s, British novelist Nancy Mitford distinguished between U and non-U language, in which U stood for upper class and non-U for non-upper. For example, U-speakers would say scent, whereas non-U speakers would say perfume; a U-speaker would use the loo, while a non-U speaker would go to the toilet. \nIn today’s snobspeak, a restaurant menu or an art gallery exhibition is invariably curated. This does not mean getting hold of a cleric called a curate to preside over the proceedings. Curated merely means ‘put together’, but put together is verbal vanilla, oral plain Jane, while curated sounds glam and arty-crafty. \nLike ‘artisanal’. Artisanal should evoke the image of a workman, an artisan, sweat beading the brow, sleeves rolled up on brawny arms, wielding an implement of arcane use. \nBut artisanal now refers to small-batch food items that aren’t mass-produced, like ice cream, or cheese, or cupcakes, or ‘hand-cut’ sandwiches, as distinct, presumably, from ‘foot-cut’ sandwiches, with or without benefit of boots. \n‘Bespoke’ is the artisanal word for custom-made, or made to order. Being more hoity, not to mention toity, bespoke is snobspeak for customised.  \nBut even as snobspeak invents new buzzwords for its lexicon, it runs the risk of being told to shove a bespoke uplifted into your artisanal. \n\n",
        "headline_1": "Snobspeak doubletalk",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/snobspeak-doubletalk/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-05-2025"
    },
    {
        "full_article": "History has been made. For the first time in the history of the Vatican, an American Cardinal has been elected to lead as the head of the global Catholic Church. His given name is Robert Prevost. As for a papal name, Cardinal Prevost has chosen Pope Leo XIV. The new Pope delivered his message first in Italian and then switched to Spanish. Some spectators who were at Saint Peter's Square, listening to the Pope, said they detected Pope Leo's American accent. It's a given. Addressing the roaring crowd, the first thing the new Pope said when introducing himself, as reported by a TV anchor, was that he was an Augustinian priest, but a Christian above all, and a bishop, \"so we can all walk together.\"\nOn May 8, when the midday local news was on, it broke the ongoing news broadcast and flashed on screen \"Breaking News.\" Earlier in the morning, I saw black smoke curling upwards from the chimney of the Vatican's Sistine Chapel. This, as we know, signifies that the 133 cardinals who were sequestered inside the chapel did not reach a consensus. They started the new Pope selection process on May 7. Hundreds and thousands of Catholics and non-Catholics were waiting in anticipation at Saint Peter's Square and were somewhat disappointed after seeing the black smoke. The news agencies predicted that it would be at least another 24 hours before the next round of vote count results were announced. By then, it was almost dinner time in Rome. Suddenly, there was white smoke coming out of the chimney, indicating that a decision had been made by the papal conclave and that a candidate had gained the two-thirds majority to announce a winner.\nAbout an hour passed after people around the world saw the white smoke billowing in a live telecast. We still did not know the name of the new Pope. But that did not matter. The mood changed to one of euphoria. People were hugging one another and shedding happy tears. After a while, the wait became unbearable for some, as they were impatient to see the new Pope emerge onto the balcony to greet everyone. They had been standing there for hours for news. One television reporter said, \"The keys of the kingdom are passed on to the new successor of Saint Peter!\" There were lots of guesses as to the name of the new pontiff. People were pondering which papal name the new Pope was going to pick. Meanwhile, the new Pope was getting dressed in three cassocks.\nFinally, the doors of the Vatican balcony flung open. Everyone was stunned to see the new Pope coming out with other cardinals. People who had gathered there firsthand experienced how history was made. Seeing the American Cardinal in the Pope's attire, everyone roared in unison. It was a moment unlike any other that people had seen in the Vatican's history. It was indeed a pleasant surprise for many, though his name had been tossed around right after Pope Francis passed away. Pope Leo was Pope Francis' favourite.\nThe marching bands and Swiss Guards parading across Saint Peter's Square kept the booming crowd entertained. It was a jubilant and colourful scene to witness. Amid the crowd, there was a pregnant American woman who told a reporter that she was in Rome only for a day. She seemed delirious with happiness that she could witness such a monumental event.\nAs soon as I texted the message that a new Pope had been selected to someone close to me, the reply came in two seconds: \"I had a hunch, but that was fast. Part of the impetus may be to soften the impact of Trump, to lessen the cruelty, just saying.\" At first, I did not quite agree. I thought Pope Leo was chosen because of his own merit. At a time when the world is divided, a Pope will not be chosen just because he is an American.\nAccording to some of the media reports, Pope Leo is very much like the late Pope Francis. He is deeply committed to the betterment of the world's poor. Leo is a native of Chicago. He grew up in Chicago's rough South Side, infamous for crime, poverty, and segregation. Historically, Chicago natives live below the national poverty line. The city is plagued with many problems. One can hope the new Pope will address these historical issues, as he can relate to such social evils, having witnessed them. He also knows how such social and economic problems impact the lives of many people if these issues are not eradicated.\nDuring a time of deep political polarisation in the world, the cardinals had to think carefully when electing the Pope, considering whether the world wanted continuity or change. The new Pope's role is not to bypass the American president and its administration by making major policies that affect the world. His role is, rather, a symbolic one as a spiritual leader of Catholics around the world. The world will be waiting to see how Pope Leo will implement the Vatican policies that concern the global population. The Vatican Church plays a significant role, as the pontiffs usually have influence over world leaders. The new Pope could be a peace broker, as the world is in great crisis right now.\nAs an American and as a Pope, Leo can bring Americans back to the church. He is going to be a \"father\" to all Catholics. For the first time in history, a Pope will speak in English. From the looks of it, he is quite at home when speaking Spanish or Italian.\nPope Leo is hopefully going to be a leader on the world stage, \"a bridge builder\" between countries. As a missionary, Leo spent many years in Peru. He was first a missionary and then an archbishop. In his first speech as Pope, Leo mentioned Peru and his time there.\nIt was reported that, as a person, Leo is humble, quiet, and can be stubborn as well. It is too early to know how he will be as a Pope. We have learned that he loves Italian pizza over the deep-dish American variety. He is a fan of the Chicago Cubs (baseball team). And surely the world will find out more about Pope Leo in the coming weeks and months.\nZeenat Khan is a contributor to South Asia based journals and magazines.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Pope Leo XIV: History made in the Vatican",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/pope-leo-xiv-history-made-the-vatican-3891326",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-05-2025"
    },
    {
        "full_article": "\"In war, truth is the first casualty,\" a timeless adage often attributed to figures ranging from the ancient Greek poet Aeschylus to modern politicians, reflects a grim fact of conflict: honest knowledge and openness are among the first sacrifices. Not by troops, but through misinformation and propaganda, the informational battlespace is usually where the first decisive triumphs are gained, even as the physical battlefield suffers the tragic loss of life and limb. These forces often control the narrative and become the primary, albeit unseen, victors in the early stages of war.\n\nThe search for truth during conflict is often replaced by the need to unify a nation and rally support for the war effort, which may involve the concealment or distortion of facts. War demands a cohesive front and a compelling narrative. Misleading information and propaganda become potent tools to boost morale, justify actions, and foster an \"us vs them\" mentality, even when they compromise the truth. Historically, military leaders and governments have actively used propaganda to influence public opinion across various wars.\nGovernments and military forces use wartime propaganda to shape public sentiment and generate support. This includes emphasising national interests, liberty, and framing the fight as just. They underline the enemy's threat and portray the conflict as necessary for national or allied protection. By depicting troops as heroic and selfless, propaganda promotes pride and patriotism, often by highlighting sacrifices, military strength, and achievements. A key tactic is to demonise the enemy, portraying them as cruel, ignorant, or dangerous—to promote hatred and rationalise war. This may include exaggerating crimes, spreading false objectives, and using derogatory rhetoric.\nToday, these methods span newspapers, radio, TV, and especially social media, through visuals, persuasive language, and slogans. British history offers examples: WWI portrayed as a noble adventure, and WWII propaganda aimed at denigrating the enemy and promoting unity. In modern conflicts, propaganda remains powerful, often spreading misleading content via digital platforms.\nSimilarly, India's recent strikes in Pakistan and Pakistan-administered Kashmir triggered another different kind of conflict: an information war. Competing claims rapidly circulated on social media as the two nuclear-armed neighbours edged towards full-scale war, with each side seeking to shape opinion in its favour.\nThis soon became a mire of conflicting stories, obstructing efforts to verify truth. While international and social media have made information control more difficult, local media in both countries often follow government-favoured narratives, allowing authorities to shape public opinion and rally support.\nIn this context, politicians on both sides benefit. Leveraging state media control and disseminating emotionally charged—and at times false—content online, they can maintain public backing. The vagueness of truth lets them promote preferred versions of the narrative and tighten information control under the guise of national security. Collective narratives, often built on distortions, can override individual critical thinking and moral reasoning, making conflict easier to justify. As such, those who control the story wield immense power.\nClosely tied to propaganda is the military strategy of victory through deception—misleading the public while deceiving the enemy. This includes conflicting claims about military operations, how many planes were downed, who owned them, targets struck, casualties, etc. Each side tries to shape perceptions of victory or failure. Churchill's quote, \"In wartime, truth is so precious that she should always be attended by a bodyguard of lies,\" sums up this mindset; that lying is not only allowed but necessary to protect national security or morale.\nHow should people respond to this deluge of conflicting claims, recycled videos, and blatant falsehoods? First, by recognising that an information war is being waged. Official statements and emotionally charged content on social media should be met with scepticism. The truth is often deliberately obscured, and old or unrelated footage is frequently presented as new. One must think critically about sources and motives. Is it an official body pushing its narrative? Or an anonymous account with a biased agenda?\n\nSupport fact-checking efforts aimed at debunking conflict-related misinformation. When content claims to show current events, pause to verify authenticity. Reverse image searches or reliable fact-checking sites can reveal whether it's outdated or misrepresented. Avoid sharing unverified or emotionally manipulative content, it fuels the information war and empowers those seeking to incite hatred.\nIn a digital world where algorithms reward engagement over accuracy, personal responsibility becomes vital. Upholding a commitment to fact-checking and resisting the temptation to blindly share nationalistic content is essential. Belief in factual accuracy and opposition to manipulation may, even modestly, help de-escalate tension and promote understanding. As the saying goes, \"If everyone fought for their convictions, there would be no war.\"\nIn the India-Pakistan context, the information war worsens already strained ties by entrenching polarised narratives and making de-escalation harder. If reason is to prevail, the public must engage as critical consumers of information. A discerning mind is the most powerful weapon in an information war. We must identify deception, question narratives, seek verification, and remain vigilant. To limit the damage caused by falsehood and keep knowledge and reason at the forefront, truth, or at least the determined search for it among the \"bodyguard of lies,\" must come first.\nDr Rezwan-Ul-Alam is associate professor of Media, Communication, and Journalism at North South University.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "War propaganda and the India-Pakistan conflict",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/war-propaganda-and-the-india-pakistan-conflict-3891226",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-05-2025"
    },
    {
        "full_article": "Natural justice stands as a fundamental principle within the common law system, serving to protect fairness, transparency, and integrity in judicial and administrative processes. Although not formally enshrined in legislation, its core tenets—the right to a fair hearing (audi alteram partem) and the rule against bias (nemo judex in causa sua)—have been shaped and affirmed through judicial pronouncements over time. These principles function as essential safeguards against arbitrary or unjust decision-making, ensuring that individuals are given a meaningful opportunity to present their case before an impartial authority. Regardless of the setting in which they are applied, the enduring importance of procedural fairness underpins public confidence in the justice system and reinforces the rule of law.\nThe notion of natural justice has evolved within Bangladesh's legal system from its British common law roots. Though not explicitly enshrined in our constitution, it is upheld through judicial interpretation and case law, influenced by the UK and post-colonial Indian legal traditions. The Supreme Court of Bangladesh, particularly through Article 102 of the constitution, plays a crucial role in enforcing these principles by issuing writs when the legal rights of people are violated. Courts have consistently ruled that administrative and quasi-judicial bodies must adhere to the principle of natural justice, even in the absence of statutory mandates, especially when decisions affect individual rights, livelihoods, or reputations. Violations, such as denial of a fair hearing or evident bias, often prompt judicial intervention through writs like certiorari, mandamus, or prohibition. The doctrine of legitimate expectation further reinforces the obligation to ensure fair treatment and consultation in public law decisions. While the application of natural justice in administrative matters allows some flexibility, authorities are still expected to act in good faith, ensure fair hearings, and avoid conflicts of interest, with the courts empowered to review and nullify decisions when these principles are breached.\nConstitutional status and enforcement of the notion of natural justice vary across countries. While the core values remain consistent, the US provides explicit constitutional protections, the UK relies on common law traditions, India blends constitutional provisions with active judicial interpretation, and Bangladesh upholds natural justice through judicial enforcement of broader constitutional rights.\nIn Bangladesh, natural justice is not explicitly stated in the constitution but is upheld through Articles 27 and 31, which ensure equality before the law and protection from arbitrary actions. Article 102 empowers the High Court Division to enforce these rights and invalidate decisions violating natural justice. Judicial interpretation plays a vital role in safeguarding fair hearings and impartiality, compensating for the absence of direct constitutional language. Any person, citizen or not, may invoke Article 102 of the constitution to seek a remedy for violation of natural justice in Bangladesh.\nHowever, despite being fundamental to a fair legal system, the principles of natural justice face numerous systemic challenges in Bangladesh that hinder their consistent application. Procedural fairness and judicial impartiality are often compromised due to factors such as legal illiteracy, excessive bureaucratic discretion, judicial delays, political interference, and corruption. Many citizens and administrative officials remain unaware of their rights to fair hearings and available remedies. Arbitrary decision-making by the officials connected with the affairs of the authorities is common, especially in areas like land acquisition, adjudication of statutory power and licensing, due to a lack of clear guidelines. Court backlogs delay justice, while political and corrupt influences and interference weaken impartiality. Institutional accountability in almost all affairs is limited, allowing procedural impropriety. Moreover, inadequate training of judges, government officials, and personnel connected with the administration of justice often leads to flawed, unlawful, arbitrary, or biased decisions. Consequently, the enforcement of the rule of natural justice remains significantly constrained, undermining both the legal system's integrity and the rule of law.\nTo overcome the challenges, several key steps should be taken. Legal institutions must be reformed by enforcing a strict code of conduct, ensuring transparency, and holding officials accountable, followed by strict disciplinary action. Anti-corruption efforts should include digital case management systems, regular audits, and strong penalties and disciplinary action against corrupt practices. Judicial independence must be protected by introducing constitutional safeguards and creating independent and impartial bodies for appointing judges. Compulsory training programmes should be provided to judges, lawyers, and administrative officers regularly to build their understanding of the principles of natural justice, legal and ethical responsibilities. To reduce case backlogs, the judiciary should be strengthened with more manpower, other logistic support, digital tools, and alternative dispute resolution methods. Finally, fair and transparent recruitment and promotion systems must be established in judicial and administrative services to promote meritocracy over favouritism.\nAs Bangladesh transitions into a new political era after August 2024, there is a renewed sense of optimism about restoring natural justice, an ideal that has been significantly weakened in recent years by persistent allegations of political bias, state repression, and manipulation of legal institutions. The interim government has signalled a clear commitment to reform, emphasising the independence of the judiciary, the importance of fairness, impartiality, and the right to a fair hearing, principles that were often disregarded in the past. While legal experts and civil society groups remain cautiously hopeful, they stress the urgent need for concrete, measurable reforms that uphold the rule of law, good governance, and the access to justice for all to safeguard individual freedoms and protect the administration and judiciary from political influence and interference. At this critical juncture, reestablishing the principle of natural justice is not merely an aspirational goal; it is an essential cornerstone for establishing the rule of law, good governance and access to justice to restore public confidence in democratic institutions.\nBarrister Md Anwar Hossen is advocate at the Supreme Court of Bangladesh. He can be reached at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Upholding natural justice: A true dawn or an illusion?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/upholding-natural-justice-true-dawn-or-illusion-3891106",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-05-2025"
    },
    {
        "full_article": "We are extremely concerned by the eruption of fighting between India and Pakistan in a sharp escalation of hostilities between the two nuclear-armed neighbours following the April 22 Pahalgam terrorist attack, in which 26 people were killed. Reportedly, in the early hours of Wednesday, India launched \"precision strikes\" on what it claimed were nine sites of \"terrorist infrastructure\" inside Pakistan. Declaring the attack to be an \"act of war\" and vowing retaliation, Pakistan also claimed to have downed five Indian Air Force jets during the attack. At least 38 people were reported killed in these incidents—Islamabad said 26 civilians were killed by India's missile strikes and firing, while New Delhi said at least 12 died from Pakistani shelling.\n\nWe must say this turn of events—while not exactly shocking given the recent escalations marked by harsh rhetoric and retaliatory measures from both sides—is as tragic as it is dangerous. If India continues its campaign and Pakistan acts on its pledge of \"corresponding actions,\" there is no telling where this will end and at what cost. It could lead to a wider conflict and inflict untold suffering across the region. The two countries have fought three wars in the past, and the current fighting already promises to be the deadliest confrontation in decades. Even though India claims its actions under the so-called Operation Sindoor have been \"non-escalatory in nature,\" and that \"no Pakistani military facilities have been targeted,\" nationalist sentiments festering within the countries could make it difficult to adopt a reconciliatory gesture or turn away from aggression.\n\nThe momentum for the latest flare-up has been building for some time. In the two weeks since the Pahalgam attack—for which India blamed Pakistan, which the latter denied—both sides took various tit-for-tat measures against each other, including expelling diplomats, suspending visas, closing border crossings, etc. Many expected these developments to escalate to some sort of cross-border strike—as seen after the Pulwama attacks which had left 40 Indian paramilitary personnel dead in 2019. While world leaders have urged restraint and de-escalation after Wednesday's attacks, both countries have yet to show any willingness to take the first step toward compromise or even negotiation.\n\nWe don't need to remind them of the dangers of continuing along this path. The longer they delay meaningful dialogue, the closer they risk edging toward a catastrophic conflict. Moreover, this is not just their problem anymore—it affects all of us in the surrounding regions. Already there are fears, and early signs, of disruptions in many shared sectors and services. It is, therefore, imperative that both governments urgently pull back from the brink, heed international calls for restraint, and engage in direct talks to defuse tensions. The international community, headed by the UNSC, also have a responsibility to mediate and convince them to focus on identifying/pursuing the real culprits, instead of fighting among themselves.\n",
        "headline_1": "We don’t want to see another war",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/we-dont-want-see-another-war-3889101",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 11, 2025 00:00:00  \nBangladesh's ready-made garment sector, the backbone of its export economy, faces its most severe challenge in decades. The impending 37 per cent US tariff, set to take effect after June 9, 2025, would be damaging enough on its own. But the greater threat lies in Europe where 79 per cent of Bangladesh's RMG exports currently go. As competitors like China, Vietnam and Cambodia face similar US tariff pressures, they are inevitably turning to the EU market as their alternative destination. This is bad news for Bangladesh. Just as its US market access shrinks, its primary export destination faces a flurry of competitors vying for market share. The EU's importance cannot be overstated as it absorbs nearly four times more Bangladeshi garments than the US market. What was once Bangladesh's safe harbour is about to become its most contested battleground.\nThe warning signs of growing competition have been visible for years. As reported in this daily, between 2012-2023, China increased its EU apparel share from 56 per cent to 68 per cent, Vietnam from 26 per cent to 32 per cent and Cambodia made the most dramatic leap from 40 per cent to 63 per cent. These weren't random fluctuations but strategic shifts by countries preparing for exactly this scenario. Now, with the US effectively closing its doors to affordable garments through punitive tariffs, these countries have no choice but to redouble their efforts to catch European market. Unfortunately for Bangladesh, which relies heavily on EU market access for foreign currency earnings, this surge in competition could be devastating. The real threat now lies not just in losing the US market, but in losing ground in Europe.\nWhat follows is an intense race to the bottom. Greater competition means thinner margins and thinner margins threaten the sustainability of the entire sector. The pressure is already evident in the declining per-kg price of Bangladeshi garments in the EU which reportedly dropped by 4.84 per cent over the past year. This decline indicates that exporters are being forced to sell more at lower prices just to stay in the game, and as the competition becomes more severe, the price will fall further. Experts also warn of competitive currency devaluations where export-dependent economies may artificially devalue their currency in order to stay price-competitive. Meanwhile, Bangladesh's impending graduation from Least Developed Country (LDC) status in 2026 will strip away its duty-free EU access at the worst possible time. The irony is that Cambodia, one of Bangladesh's competitors in the RMG exports, will retain these privileges as it remains an LDC. That gives Cambodia a distinct edge just when Bangladesh's competitiveness is set to weaken.\nSo what can Bangladesh do to navigate this increasingly treacherous trade environment? The first task is to address the US market. No visible progress has been made in reaching a trade understanding with the US in the two months of tariff pause that elapsed. Given that the US rationale for tariffs is the export-import imbalance, Bangladesh needs to urgently identify potential imports from the US to build a more balanced trade relationship. For the EU, Bangladesh must secure a new trade agreement before LDC graduation, following the model of Vietnam's EU FTA. Simultaneously, Bangladesh must actively diversify its export destinations beyond the traditional strongholds of the EU and the US. Countries like Japan, Canada and emerging markets offer potential avenues and should be actively cultivated. Most critically, Bangladesh needs a export strategy on a war footing involving all stakeholders, from government to manufacturers to trade bodies. Without swift, strategic action, Bangladesh risks losing its position it has built in the global apparel trade through decades of effort.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "EU competition major challenge before garment sector",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/eu-competition-major-challenge-before-garment-sector-1746894466",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       May 11, 2025 00:00:00  \n\nClimate change has become a grave concern worldwide as there is no way to prevent or avoid it. The consequences of climate change are the rise in temperature, intense droughts, water scarcity, severe fires, rising sea levels, flooding, melting polar ice, catastrophic storms, and declining biodiversity. The change affects human health, ability to grow food, housing, safety and work. Billions of people are already more vulnerable to climate impacts, and more will be affected in the near future. For instance, conditions like sea-level rise and saltwater intrusion have reached the point where whole communities have had to relocate, and protracted droughts are putting people at risk of famine. Scientists predicted that the number of people displaced by weather-related events will rise soon. \nVarious global and regional initiatives are underway to mitigate and adopt climate change. Scientists and environmentalists have already conducted several research studies on this topic. They are also exploring new viewpoints to study the impact of climate change. Central banks have joined the move by introducing climate stress tests on banks and financial institutions to address climate-related risks to the financial system. \nStress tests are 'assessments of how well banks can cope with financial and economic shocks'. The tests allow supervisors or regulators to identify banks' vulnerabilities and work with those institutions to address them. Stress testing is one of the measures institutionalised by the Basel Accords after the 2008 global financial crisis to reduce economic damage from banks taking too much risk. The second pillar of the Basel Framework reinforces the first pillar by setting minimum capital requirements to determine whether banks require additional capital buffers to withstand stressed situations.\nClimate stress tests are a new tool for assessing banks' resilience to transition risks arising from new policies and technologies and physical risks due to acute and chronic extreme weather events. They are based on 'different predictions of the policies that might be implemented and the ability of those policies to prevent critical temperature thresholds from being breached.' \nThe use of the new tool is still limited. The European Central Bank conducted an economy-wide stress test in 2021, and launched its first climate risk stress test for individual banks in January 2022. Bank of England (BoE), Federal Reserve, People Bank of China and some other leading central banks also conducted one or more climate stress tests in last three years. \nTaking a cue from the global exercise, Bangladesh Bank also conducted the country's first climate stress test last year, assuming that the country's financial system may face significant challenges from climate-induced gross domestic product (GDP) slowdown in the coming years. The central bank also released the outcome of the exercise last month titled 'An Exploratory Report on Climate Stress Testing for the Banking Sector of Bangladesh.'\nBefore looking into the findings, getting a brief idea of the exercise method is necessary. To conduct the study, Bangladesh Bank first selected five commercial banks as a sample, and these chosen banks hold around 30 per cent of the total assets of the country's banking sector. The report is prepared based on data available as of March 31, 2024 when the banking industry's total assets stood at Tk 1,181.76 billion. Thus, the combined assets of the five sample banks were around Tk 354.60 billion during the period under review. The central bank, however, did not disclose the names of the banks, as doing so may be misleading and negatively impact the financial market.\nThe theoretical framework of the climate stress test assumes that climate shock would slow GDP growth through physical and transition risks. The first one is defined as domestic physical hazards from extreme natural events like river and coastal floods and cyclones and gradual changes in climate like decline in agricultural yields or water availability, sea-level rise, etc. Physical risks generally hit real estate and infrastructure, business continuity, people, food systems, international trade channels and supply chains. The last one originated from government policies and technological changes like carbon tax and renewable energy. \nDue to a decline in GDP growth and the slowdown in economic activities, banks are likely to face increased credit risk as businesses and households are exposed to macroeconomic shock. The ultimate result is that banks incur higher loan losses. So, the study first tries to estimate the link between the GDP growth rate and the credit risk of banks. To do so, the researchers applied econometric-based satellite models. Then, they analyse projected GDP under various climate scenarios and the impacts of multiple risks on banks' balance sheets. \nNetwork for Greening the Financial System (NGFS) outlines various climate scenarios, such as Net Zero 2050 and below 2°C. The first one assumes strict climate policies and innovations that limit global warming to 1.5°C, and by 2050, the global net-zero CO2 emissions will be achieved. The second one assumes a gradual increase in the intensity of climate policies, giving a 67 per cent chance of limiting global warming to below 2°C. The central bank study team has to go through a hectic technical exercise to determine how banks would be affected under various climatic situations as outlined in the scenarios. \nThe study's core finding is that higher damage scenarios would consistently lead to greater loan loss, indicating significant vulnerability to climate-induced GDP shocks. The study also underscores the urgent need for immediate climate action to minimise any plausible loss. The study projected the outcomes over ten years, from 2025 to 2035.\nThe study measures the possible loan loss due to negative impact on climate change as a Loan Loss Reserve (LLR). The estimated LLR is calculated by \"aggregating loan loss reserves against each bank's non-performing and performing exposures utilising tailored capital engines.\" LLR is basically an income statement expense set aside as an allowance for uncollected loans and loan payments. It is used to cover various kinds of loan losses such as non-performing loans (NPL), customer bankruptcy, and renegotiated loans that incur lower-than-previously-estimated payments.\nLeaving the technical aspects of the study aside, it can be said that the country's banks are gradually becoming vulnerable to climate change, and the banking sector in its totality may face a significant surge in default loans. Total default loans in the banking sector stood at Tk 3457.65 billion at the end of 2024 from Tk 1,456.33 billion at the end of 2023. In other words, climate-related vulnerability in the banking sector will enhance in the comings days. So, policymakers and different stakeholders need to pay attention in this regard. The central bank should also organise a public dissemination session decoding and explain the findings of the study.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Climate shocks and  banking sector",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/climate-shocks-and-banking-sector-1746894598",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       May 11, 2025 00:00:00  \n\nOver a decade has passed since the devastating inferno at Nimtoli in Old Dhaka, which killed 126 people and injured about 200 others. The fire was triggered by flammable chemicals stored on the ground floor of a residential building. The tragedy carried a clear lesson: chemical factories or warehouses must not be located in residential areas. In fact, the Bangladesh Environment Protection Act does not permit such operations. Yet, the presence of hundreds of chemical factories in various parts of the old town indicates that no lessons have been learned.\nDespite repeated assurances from the authorities, hazardous chemical warehouses and factories have not been relocated from Old Dhaka. This persistent delay has left residents in a constant state of fear, as previous tragedies, including the Nimtoli fire in 2010 and the Churihatta fire in 2019, have demonstrated the devastating consequences of housing such facilities in congested areas. \nFollowing the Nimtoli disaster that claimed 126 lives, the government initiated four projects to shift the chemical, plastic, printing, and electronics industries from Old Dhaka. However, except for one, these projects remain incomplete even after 14 years. Bureaucratic red tape, land acquisition complications, and lack of urgency from the authorities have resulted in this apathy and inaction, allowing hazardous industries to operate in violation of the Bangladesh Environment Conservation Rules-1997, which strictly prohibit such activities in residential areas.\nA 2019 survey by the Dhaka South City Corporation (DSCC) identified 1,924 chemical warehouses in Old Dhaka, with 98 per cent of them classified as \"moderately risky\". However, the authorities have failed to update this list, and in reality, the number is likely much higher. Many residential buildings are illegally rented out as chemical storage facilities due to lax enforcement and oversight. While the DSCC stopped issuing new licences and renewing old ones after the Churihatta fire, this has done little to curb the illegal operations that continue unchecked. In various areas chemical drums are seen stockpiled in open spaces, posing a high risk of fire accidents. Flammable chemicals are stored on the ground floor of many residential buildings. These stores and shops lack even the basic fire safety equipment, like extinguishers, let alone a complete fire fighting system. Moreover, the streets of the old Dhaka are so narrow and inaccessible that firefighting vehicles cannot reach many of the buildings there.\nChemical traders claim they are ready to relocate but insist that the government must facilitate their resettlement, as per a Memorandum of Understanding signed in 2017. Both the Chemical and Perfumery Merchant Association and the Bangladesh Plastic Goods Manufacturers & Exporters Association have expressed frustration at the slow pace of relocation efforts, citing unreasonable land prices and administrative hurdles as major obstacles.\nThe construction of the BSCIC Chemical Industrial Park in Munshiganj's Sirajdikhan, which is supposed to provide a safe alternative for these hazardous businesses, has made 73 per cent progress. However, road and drainage infrastructure remain incomplete, delaying the relocation timeline further to at least 2026. A temporary facility in Shyampur, completed in June 2024 for 54 warehouses, has also failed to gain traction, with only two warehouses rented so far due to traders' reluctance.\nSimilarly, the relocation of plastic factories has faced significant delays. Approved in 2015 with a 2020 completion target, the project in Munshiganj's Sirajdikhan has been repeatedly postponed, with the latest deadline set for 2025. The situation is even worse for the printing industry, where physical work on the BSCIC Printing Industrial Estate Project is yet to begin due to unresolved land acquisition issues. Meanwhile, the electric goods relocation project is the only one that has been completed, demonstrating that progress is possible when there is genuine commitment from all stakeholders.\nThe failure to expedite the relocation of chemical warehouse is not just a matter of administrative inefficiency; it is a gross negligence that endangers lives. The government must prioritise this issue by cutting through bureaucratic hurdles, ensuring fair land pricing, and enforcing strict penalties on illegal chemical storage in residential areas. Every day of delay heightens the risk of another catastrophic fire, and without immediate intervention, Old Dhaka remains a ticking time bomb.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Old Dhaka sitting on  time bomb",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/old-dhaka-sitting-on-time-bomb-1746894668",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 11, 2025 00:00:00  \n\n\"Mother\" - a small word, yet it holds an entire universe for a child. From the first steps of learning to life's defining moments, a mother is always there-guiding, protecting, and loving unconditionally. No riches can repay the debt we owe her. Her selfless sacrifices form the foundation of our lives.\nA mother's love is the purest form of devotion. She builds her world around her child, quietly burying her own dreams to make room for theirs. Her strength lies in a smile, her peace in her child's happiness. She disciplines not out of anger, but love-her scolding, often misunderstood, becomes the shield that shapes us.\nWhether in joy or sorrow, a mother's embrace remains our safest refuge. She is a best friend, an inspiration, a constant presence through life's journey. Without her, life loses its colour.\nOn this International Mother's Day, may we honour all mothers-not just today, but every day.\nSafa Akter Nolock\nsafanolock121214@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Honouring the eternal strength of mothers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/honouring-the-eternal-strength-of-mothers-1746894705",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-05-2025"
    }
]