[
    {
        "full_article": "After months of trying to wade through an ethnic crisis by maintaining the status quo, the Union government finally got its act together and removed the N. Biren Singh-led government in Manipur from power and imposed President’s Rule, hoping that the change would be the harbinger of good tidings. The fact that the ruling Bharatiya Janata Party could not manage to find a replacement for its outgoing leader reflected not just on the internal divisions within the party but also on the preponderance of the ethnic divide in the State. Considering this, the imposition of President’s Rule seemed to be a viable way of bringing back normalcy in a State suffering badly from ethnic strife. After the imposition of President’s Rule, the government has sought to gradually seize control over instruments of violence that seemed to reign with impunity in the last two years. It did so by giving a deadline to non-State groups to give up weapons that they had acquired from constabularies. It has tried to ensure free movement between the hill and valley districts by removing the blockades set up by these groups on highways in the State. These steps have not gone down smoothly. Only a portion — nearly a third — of the 3,000-odd weapons that are still missing have been returned, with the bulk of the missing weapons being those that were stolen in and around the Imphal Valley. The attempts made by the central armed police forces to enforce the free movement of all vehicles in the hill district of Kangpokpi resulted in violence with one killed and more than 40 people injured.A civil society organisation claiming to represent the Kuki-Zo community has warned against the moves for the free movement of people by demanding Union Territory status or a separate arrangement for the Kuki-Zo areas as a precondition. This is a dangerous ploy as any such move will only deepen the ethnic strife and will also be resisted by the Naga communities, living in the hill districts of the State. The government must continue to seek talks with representatives of both communities while sternly rejecting any threat of violence and isolating those making impossible demands in order for peace to be restored. Steps need to be intensified to recover the remaining missing weapons and to thwart any entity seeking to take the law into its own hands. The government must put out the compelling message that only the State has the legitimate claim over arms, which must resonate across the hills and the valley. But this cannot be a step that is limited to the Governor. The Centre, more specifically, the Union Home Ministry and Prime Minister Narendra Modi, must appeal directly to the communities for a restoration of peace, and for dialogue to help the displaced return to their homes. Data show that Manipur has suffered more than any State due to the recent inflation and economic woes in the country and it would take yeoman steps by the senior leadership of the Union Government to bring back normalcy. Published - March 11, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Manipur\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        national or ethnic minority\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        police\n                    \n                            /                      \n                        \n                        tribals\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        inflation and deflation",
        "headline_1": "​Miles to go: On change in Manipur, the road to normalcy",
        "headline_2": "The Union Government finally attempts change in Manipur, but faces hurdles",
        "link": "https://www.thehindu.com/opinion/editorial/miles-to-go-on-change-in-manipur-the-road-to-normalcy/article69314350.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "11-03-2025"
    },
    {
        "full_article": "India’s latest triumph in the ICC Champions Trophy carried an air of inevitability. In Sunday’s (March 9, 2025) final, they overcame a gritty New Zealand side by four wickets with an over to spare. As fireworks lit up the Dubai sky and the 252-run target was chased down, the victory reaffirmed India’s dominance in white ball cricket. Across 24 ICC tournament matches — including the 2023 ODI World Cup, the 2024 T20 World Cup, and the Champions Trophy — Rohit Sharma’s men have secured 23 wins, an astounding 95.83% success rate. Stationed in Dubai for three weeks due to the Indian government’s refusal to allow play in Pakistan, the official host, India benefited from a fixed venue and minimal travel fatigue. However, their success was not merely circumstantial — they executed their plans with precision. Group stage wins against Bangladesh, Pakistan, and New Zealand, followed by a semifinal triumph over Australia, set the stage for the final against the Black Caps. Despite concerns about New Zealand’s history of upsetting India — most notably in the 2019 World Cup semifinal — the Men in Blue handled the challenge adeptly.On a sluggish pitch, India’s strategy of fielding four spinners proved decisive. Varun Chakaravarthy, Ravindra Jadeja, Axar Patel, and Kuldeep Yadav stifled New Zealand’s scoring, though Mitchell Santner’s team still managed a competitive 251 for seven. In a high-stakes final, scoreboard pressure is always a factor, but Rohit’s composed 76 set the tone, and India’s deep batting line-up ensured a comfortable finish. While India has faced setbacks in Test cricket, including losses to New Zealand at home and Australia away, their limited-overs form remains formidable. The squad’s depth is evident — Rishabh Pant was left out of the playing XI, while talents such as Suryakumar Yadav and Ishan Kishan did not even make the squad. Contributions from Shreyas Iyer, K.L. Rahul, and Hardik Pandya underscored the collective effort, while Mohammed Shami’s return offset the absence of the injured Jasprit Bumrah. Virat Kohli’s consistency and Rohit’s leadership suggest that retirement is not imminent for either stalwart, but selectors must look ahead to the 2027 ODI World Cup. Honest assessments and strategic planning will be crucial to ensuring India’s sustained dominance in the years to come. Published - March 11, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        cricket\n                    \n                            /                      \n                        \n                        champions-trophy\n                    \n                            /                      \n                        \n                        United Arab Emirates\n                    \n                            /                      \n                        \n                        T20 World Cup 2024\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Bangladesh\n                    \n                            /                      \n                        \n                        New Zealand\n                    \n                            /                      \n                        \n                        Australia",
        "headline_1": "​Limited-overs form: On cricket and the Indian team",
        "headline_2": "India’s performance in the shorter formats of cricket is outstanding",
        "link": "https://www.thehindu.com/opinion/editorial/limited-overs-form-on-cricket-and-the-indian-team/article69313879.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "11-03-2025"
    },
    {
        "full_article": "India can’t put off land reform any longer. A tragedy in Maharashtra was a sharp reminder\nLast week, Bombay HC cancelled land acquisition for an international airport in a Navi Mumbai village. Farmers whose land was acquired in 2017 had complained they weren’t adequately compensated. HC agreed the state shouldn’t have used an urgency clause that denied them a say in the matter. Just two weeks before this, Punjab & Haryana HC had settled a 64-year-old matter by ordering a Haryana discom to compensate farmers whose land it had acquired in 1961. Not every land dispute culminates in a courtroom, though. Santosh Deshmukh, sarpanch of Maasajog village in Beed, Maharashtra, was brutally murdered last Dec for resisting a politically connected person trying to control land leases for wind farms. That case led to the sacking of a state minister. But nothing’s changed on the ground.\nAs a growing economy, India needs land for building cities, highways, airports, factories, mining, and much more. But land holdings are typically so small, and land titles so mixed up, that land acquisition has become one of the chief hurdles for growth. Data research group Land Conflict Watch says 10.5mn Indians are currently affected by land conflicts – up from 6.5mn in 2020 – and investments worth $396bn are stuck as a result. Overall, some 50,000 sq km – roughly the area of Punjab – is tied up in these disputes, most of which won’t be resolved anytime soon. In 2019, think tank Centre for Policy Research said the average pendency of land cases in India is 20 years.\nIn the Navi Mumbai airport case, eight precious years were wasted because the state chose to disenfranchise landowners. In roughly the same time, UP built a new international airport at Jewar through negotiation. The Deshmukh case, meanwhile, shows the perils of the state taking a hands-off approach where small, vulnerable farmers and big money are involved. It leaves the door open for bullying and exploitation by goons and politicians. For India to grow at over 8% annually – which it needs to – land reforms that remove hurdles to growth without trampling landowners are a must.\n\n",
        "headline_1": "Write a new plot",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/write-a-new-plot/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-03-2025"
    },
    {
        "full_article": "Why Indians go from First World to Third World\nThe Indian abroad is a strange phenomenon. Sallying forth with a thaila full of thepla and a string of desi degrees, stale and useless, respectively, upon arrival. Aghast at the absence of invitations from distant relatives to move in with them and surprised by the ‘pardon?’ that comes their way whenever they speak. They lament the racism of goras: how much ever kesar-infused and milk-dipped they may have been from birth, all desis are brown in the West. A PIO wherever they go, suddenly conscious of their melanin. All eyes on them when washroom etiquette is mentioned. Moaning about the lack of veg options is the only revenge.\nEuropeans do not stand out like us. Their complexions look Caucasian and even though their English sounds funny, it’s an exotic kind of funny. A new varna establishes itself. As a baby did you say goo goo ga ga in Brit tones or your mother tongue? We worship all Englishes as superior to ours, imitating, but not sustaining, anything from a Texan drawl to an Irish brogue. Quivering at gatherings, nodding and shaking head, forever in fear of being hunted down by the accent police. Communication is further gobbledygookised by the fact that no two Indians speak the same English – not back home, not on foreign soil. Whenever immigration officials look suicidal there is usually an Indian before them.\nFor a spot of reverse racism – and to redress the balance – Indians travel to lands occupied by same-skinned brethren. Places where our rupee is a Superman punching down weaker rupees most of the time, among crowds where we seem to be looking into mirrors. Here the names of roads and people sound Indian, albeit with minor typos. Bangladesh, Sri Lanka, Singapore, Vietnam, Myanmar, Nepal, Indonesia, UAE…we are comforted by resemblances, an absence of visa hassles and the ubiquitous presence of other Indians. In Trinidad it is only the dreadlocks that separate us from them. We have the same ancestors, if not hairdressers.\nNow is the chance for us to act all superior. To purposely stage whisper in the flight to make others appear too loud. To mock the toy money of others and rejoice in the pleasures of haggling. To blink at the local angrezi. ‘Pardon?’ we shall ask, just like we have been asked before. No more pretending to laugh along with those who mockingly copy our yes/no head movements.\n\n",
        "headline_1": "Desi abroad",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/desi-abroad/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-03-2025"
    },
    {
        "full_article": "Musk may or may not be an ace for Trump. But he is certainly complicating diplomacy for Washington\nFollowing the recent Trump-Zelenskyy blow-up in Oval Office, US got itself into another spat over the weekend, this time with Poland. Elon Musk, Trump’s ‘first friend’ and DOGE chief, sparred with Polish foreign minister Radoslaw Sikorski on X over Musk’s satellite internet service Starlink for Ukraine. Poland pays for it. Sikorski took exception to Musk saying that Ukraine’s entire frontline would collapse if he turned off Starlink, to which the billionaire responded, “Be quiet, small man.” This forced US secretary of state Marco Rubio to back up Musk, while Polish PM Donald Tusk defended his foreign minister.\nAll of this was avoidable. Diplomacy means careful handling. Musk, who works within the Trump administration in an unofficial capacity, talking down to the foreign minister of an allied European nation complicates matters for Washington officials. There are two issues here. First, Trump himself is mercurial, a trait that has been cultivated as a strength of his administration. By shaking up narratives, Trump is supposed to be able to get people out of their comfort zone and make deals. All those who work with Trump know this and play their respective roles. But if there is a Trump clone in Musk, who’s also shooting off at foreign officials, the strategy doesn’t work. Trust in the American leadership gets eroded.\nSecond, Musk is a private businessman. But if he is allowed to command crucial US govt projects, get important contracts and leverage his closeness to the president, there’s a danger of those services being run according to his whims and fancies. Dangling the prospect of turning off Starlink for Ukraine – Musk, though, has clarified that is not on the cards – is an ominous example of what can happen if Trump’s billionaire, unaccountable friends are allowed a free hand to represent US interests. Will Musk become a liability for Trump? We can’t say for sure as we don’t know the inside deal between Trump and his biggest individual political donor. But Trump’s unique policymaking needs a safety net. And Musk is unlikely to be the answer. \n\n",
        "headline_1": "Wild card?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/wild-card/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-03-2025"
    },
    {
        "full_article": "Of India’s opportunities from Trumpian disruption, none holds more promise than textiles, which can create 10mn jobs. But the crucial first step must be zero-duty imports of raw material for manmade textiles\n\nWith Trump’s return to White House, we are undergoing geopolitical reconfiguration. Trade-wise, his administration is doubling down on tariffs and economic nationalism. While this poses challenges, it is also a massive opportunity for India – if we get our policies right. If we deliver a manufacturing liftoff by implementing bold policy reforms in sectors such as textiles & apparel, food processing, and cleantech.\nRead full story on TOI+\n\n",
        "headline_1": "After apple, apparel",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/after-apple-apparel/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-03-2025"
    },
    {
        "full_article": "We are alarmed by the findings of a government probe on extortion in Dhaka's transport terminals and stands. The investigation, conducted by an intelligence agency after the ouster of the Awami League government, found the involvement of influential figures including some linked to the Bangladesh Nationalist Party (BNP) in this exploitative practice. Not only is this unacceptable, but the fact that even the fall of an autocratic regime through a violent mass uprising could do nothing to reverse this trend in the transport sector is deeply concerning.\nAccording to the probe report, a staggering Tk 2.21 crore is extorted daily from 53 transport terminals and stands in the capital city. Over a month, this amounts to Tk 66.3 crore to even Tk 80 crore. The system established by Awami League leaders and allies during the party's 15-and-a-half-year rule has simply been taken over by leaders and activists of BNP and its affiliated organisations. Of the daily extortion earnings, Tk 1.17 crore is collected under the name of Bangladesh Road Transport Owners' Association, currently headed by Saiful Islam, convener of BNP's Cumilla (north) unit. All this money is reportedly being extorted as \"fees\" for city corporations, terminal authorities, \"expenditure\" of counters and terminals, and payments for workers, linemen, cleaners, and security guards, the intelligence agency has found. Long- and medium-haul buses, trucks, pickups, covered vans, microbuses, private cars, human hauliers, CNG-run autorickshaws, and even rickshaws are being charged these \"fees.\"\nIt is no secret that extortion has plagued our transport sector for decades. Its extent and sphere of influence can be understood from a study—unveiled by the Transparency International Bangladesh (TIB) in March last year—that revealed that private buses and minibuses pay at least Tk 1,059 crore in illegal tolls and bribes every year. Unfortunately, following the Awami League government's fall, we saw how BNP-affiliated transport leaders took over the sector, seemingly to get their hands on the extortion money, thus perpetuating this unscrupulous practice.\nThis status quo must be broken. As Bangladesh moves forward with key reform initiatives to establish discipline and accountability in various sectors, the transport sector cannot be left to rot under this age-old cycle of extortion and corruption. The BNP leadership must take into cognisance the allegations against its leaders and take punitive action, as it did against more than 1,000 members and 12 committees when allegations of rent-seeking and illegal occupation were proven. The government should also consider the probe report's recommendation: privatising bus terminals and stands, allowing them to officially charge fees, and using that revenue to run these establishments. Whatever the solution, it must be implemented immediately to rid the sector of this illegal practice.\n",
        "headline_1": "Will transport extortion ever end?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/will-transport-extortion-ever-end-3844291",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-03-2025"
    },
    {
        "full_article": "Dr Stephen D Biggs, who has recently died, first arrived in Bangladesh in 1973. This obituary is compiled from various tributes which his daughter, Korina, received after his death. He was among a group of scholars and volunteers who had previously been in Bihar, North India, and came on to Bangladesh soon after its Liberation to support its early years of rebuilding, including Edward Clay who was with the Agricultural Development Council (A/D/C) in Dhaka and myself at Bangladesh Academy for Rural Development (BARD), Cumilla, both enabled by Stephen.\nHe graduated in agricultural economics from Wye College, University of London, followed by MSc studies at Illinois and PhD coursework at UC Berkeley. He completed his dissertation by developing an input-output model to understand green revolution transformations in agriculture in the Kosi River Area, North East Bihar, India, while at the Institute of Development Studies at Sussex University (1969-73). This was the foundation for pioneering contributions to rural development and wider development policy and action. He listened well to farming communities. From the outset, he was focussed on understanding a system, not just individuals, thus a departure from household and farm focussed methods of investigation.\nThese studies defined Stephen as an agricultural economist, but he was so much more. He was determined that his research should inform policy. He was a mentor to a network of younger colleagues around him: broadening their perspectives, connecting detailed research with the desire to improve people's lives, and the value of inductive approaches applied to immediate farming solutions as the initial phases of the Green Revolution got underway in South Asia. As a colleague, mentor and teacher, then and throughout his career, he embodied such a modest demeanour. He exemplified knowledge as common property not private. That is how he lived his professional career.\nThus, equipped with his qualifications and applied research experience from Bihar, in 1973, Stephen joined the Ford Foundation in Dhaka, as a programme officer in a small team led by George Zeidenstein, with Lincoln Chen as a colleague. The three of them enabled the Ford Foundation to punch above its weight in terms of policy influence, supported by analysis. They supported both government and emerging NGOs. With government, they funded and advised agricultural research through Bangladesh Agricultural Research Council (BARC) and Bangladesh Agricultural Research Institute (BARI), as well as directly with ministries of agriculture and rural development, including the continuation of the Foundation's pre-Liberation support for BARD at Cumilla—the action-research centre for linking institutional and technological innovations. There, they funded research on cooperatives (the KSS) and the dangers of their elite capture, as well as the dangers of new forms of exploitation as capitalism entered farming. They partnered with the A/D/C. They also provided scholarships for studies abroad, including, for example, the former vice-chancellor of Bangladesh Agricultural University at Mymensingh, Prof Sattar Mandal, who recalls Stephen facilitating his PhD studies at Wye College. Mandal praises Stephen as having a continuously \"inquisitive mind to understand why some technologies work while others don't.\" Also, during this period, the Foundation provided significant seed funding to emerging NGOs, such as BRAC and the Grameen Bank initiative. The significance of Stephen's four years in Bangladesh is perhaps best summed up this way:\n\"'One international organisation always came up with unhesitating support whenever I asked for help, ever since my days at Chittagong University. This was the Ford Foundation: Lincoln Chen and Stephen Biggs … had each come up with flexible ways of assisting our work.\"\nThis recollection comes from the autobiography of Muhammad Yunus, founder of the Grameen Bank, Nobel Prize laureate and presently chief adviser of the interim government in Bangladesh. Not many bideshi in Bangladesh have acquired that kind of accolade! Stephen's support for social as well as technical innovation was continued soon after he left Bangladesh with the Foundation's support for PROSHIKA's landless irrigation programme.\nIn 1977, Stephen and his family went on to CIMMYT (the CGIAR wheat and maize centre) in New Delhi for three years. During this period, Stephen was also learning about Nepal (see below). The family moved to Norwich in 1980, where Stephen joined the School of Development Studies at the University of East Anglia, continuing after retirement in 2003 as Research Fellow until 2013. There, he had a strong teaching and writing collaboration with Prof Frank Ellis, who remembers Stephen as an energetic and highly motivating teacher, taking students into rural Norfolk to see real farming, a revelation especially to overseas students. During this period at the University of East Anglia, Stephen visited Bangladesh on assignments several times, thus keeping in touch with its steady agricultural transformation, topping up his empirical knowledge for his various publications.\nIn the late 1990s, Stephen began his close involvement of over 20 years with Nepal, being in Kathmandu for lengthy stays and travelling widely in both the hills and across the Terai region. There, he combined personal contentment among new friends with his ongoing professional gratification: small machines! He was too sensible to see hand-held power tillers and mobile pump sets as the magic bullet, but he did become almost evangelical. As he carried on writing from this era of applied research, notably with Scott Justice and also with Sattar Mandal, the small machine mission became stronger. Barbara Harriss-White from Oxford, recalling SOAS Agrarian Change seminars, notes \"his steadfastness in showing how small machinery can transform agriculture. He was awakening South Asian policymakers to how small-scale farming and informal economies worked.\" He thus connected to the strategic debates about whether the small family farm had a future, which continues to be a focus of research for Mandal and Wood. Scott Justice sums up this part of Stephen's life with: \"small engines always put a smile on his face.\"\nStephen was more than a university teacher and researcher. He was a wonderful gardener, a regular and great jive dancer, passionate about a capella singing and would play his flute without inhibition in cafes and other venues, including for extremely ill friends in nursing homes. Many at his funeral recalled such moments.\nTo conclude, Stephen's continuing strength was being inductive rather than narrowly deductive. He was inter-disciplinary almost before the term existed. He has been a fine academic, the best sort. Open and generous with his ideas and insights, keen to apply knowledge to the real world of struggling, insecure, farmers on the relentless edge of disaster, and keen to see the social benefits of productivity-enhancing technology for the little guy. He had no time for the wiles and dark arts of the institutionalised academy. He just wanted to help poor people. His presence will be sadly missed.\nDr Geof Wood is a development anthropologist and author of several books and numerous journal articles, with a regional focus on South Asia. He is also emeritus professor of international development at the University of Bath, UK.\nEdward Clay is former fellow of the Institute of Development Studies at the University of Sussex, and Relief and Development Institute in London, UK. \nViews expressed in this article are the authors' own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our submission guidelines.\n",
        "headline_1": "Stephen D Biggs’s pioneering work in helping small farmers",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/stephen-d-biggss-pioneering-work-helping-small-farmers-3844181",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-03-2025"
    },
    {
        "full_article": "Envision a world where equality is not a hope but a reality, where every individual, regardless of gender, has the freedom and opportunity to shape their future. A world where leadership is defined by vision, not bias, and where inclusivity is the foundation for progress. Imagine!\nLeadership is not a privilege bestowed upon a select few; it is a responsibility, a force that shapes the course of history. And yet, for centuries, half of humanity—women—have been systematically denied their rightful place at decision-making tables. If we are to build a future that is sustainable, where prosperity is shared, and development is a right and not a luxury, we must confront this imbalance with urgency.\nThe Sustainable Development Goals (SDGs) speak of equality, justice, and a world where no one is left behind. But how can we claim progress when women remain underrepresented in leadership across sectors—political, corporate, and social? The percentage of women in legislatures globally was just over 27 percent in 2024, while just 6.6 percent of CEO positions in Fortune 500 companies are occupied by women. Even in countries that pride themselves on progressiveness, representation remains dismal. The United States, despite its global influence, has never had a female president.\nIt is not a question of whether women are capable. They are. Yet, systems are not designed to include them. Women receive much less mentorship than men in professional settings. Women have been told, generation after generation, to wait, to prove themselves, to work harder. And even when they do, the doors remain closed. The issue is not the lack of talent; it is the lack of access.\nHistory has repeatedly demonstrated that women are not just participants in change—they are its drivers. In Bangladesh, during the July uprising, women fought alongside men. In times of crisis, in movements for justice, and in community-building, women lead. But when the dust settles, they are pushed back to the margins. The same world that benefits from their strength refuses to acknowledge their leadership.\nThis contradiction is global. We are told to be patient, to celebrate token inclusions, to be satisfied with incremental progress. But progress is not real until leadership by women is expected instead of being considered an anomaly.\nOur understanding of leadership, strength, and power itself needs to evolve. For too long have these concepts been framed through a predominantly male lens, rooted in dominance, control, and hierarchical authority. True leadership, however, must be redefined beyond these narrow constructs. Strength is not about exerting power over others; it is about resilience, collaboration, and the ability to nurture and uplift. As Vandana Shiva and other thinkers have argued, the dominant global paradigms often impose external values on women, rather than recognising and amplifying the strength inherent in their own cultures, traditions, and ways of knowing. We need to move away from seeing leadership as a contest of supremacy, and instead embrace a more holistic, inclusive, and humane vision of power.\nGirls from the most unaddressed communities, from the chars of the Brahmaputra, once lacking even basic services, are now leading and representing their people on global platforms. This transformation—from survival to ambition—has taken over two decades of our role in nurturing their leadership within communities. Their success proves that true empowerment lies in confidence, dignity, and the ability to change mindsets. Friendship has supported young women in accessing higher education, amplifying their voices in global climate forums and policymaking. These women are not just beneficiaries of change; they are its architects, shaping policies and proving that leadership flourishes when women are given the chance to rise.\nHowever, empowerment must also be about enabling women to lead on their own terms, not forcing them into predefined roles dictated by external perspectives. Real empowerment means allowing women to build leadership based on their own belief systems, cultural identities, and lived experiences. It is not about making them fit into an existing mould, but about giving them the tools and space to create their own.\nSome argue that leadership should be about competence, not gender. And I agree. But the reality is, women are not given the same opportunities to become competent in the first place. Leadership is not just about raw talent; it is also about training, mentorship, networks, and experience. And for generations, women have been systematically excluded from these channels of growth. We do not seek special treatment; we seek the same opportunities that men have always had.\nTo balance eons of imbalance, we still need quotas, reserved seats, and deliberate interventions. The goal is not to keep these interventions forever, as we see that companies with at least 30 percent women in leadership roles are on average 15 percent more profitable. The goal is to create a world where they are no longer needed. When we fail to include women in leadership, the world loses more than just numbers. It loses vision, perspective, and a different way of thinking. Studies have shown that women in leadership prioritise long-term stability over short-term wins, and that they are more collaborative, more inclusive in decision-making.\nThis is not about replacing men; it is about completing the circle of requirements, especially in leadership. We cannot continue with a world where decisions are made by only one half of humanity. Structural change is needed, with more investment in women's leadership, mentorship, and access to power. Young girls must grow up seeing women in leadership as a norm, not as an exception. Because leadership does not happen by accident; it happens by preparation.\nRuna Khan is founder and executive director of Friendship.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our submission guidelines.\n",
        "headline_1": "Let’s aim for a future built on equality, inclusion",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/lets-aim-future-built-equality-inclusion-3844061",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Standard feasibility study for development projects",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/standard-feasibility-study-for-development-projects-1741624487",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Challenges in advancing China-Bangladesh ties",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/challenges-in-advancing-china-bangladesh-ties-1741624530",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Growing number, power  of the rich",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/growing-number-power-of-the-rich-1741624620",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Extremism and violence against women must stop",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/extremism-and-violence-against-women-must-stop-1741624647",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-03-2025"
    }
]