[
    {
        "full_article": "Seventeen years after the Mumbai 26/11 terror attacks, India is preparing for the trial of Tahawwur Hussain Rana, who was extradited by the United States this week. The extradition of a co-conspirator in the planning of the attacks that left 166 people dead is proof of the success of India’s counter-terror diplomacy with the U.S., and the tenacity of Indian investigators. Rana was first arrested by the U.S. in 2009, as an accomplice of David Headley, the Lashkar-e-Taiba (LeT) operative tasked by Pakistan to carry out the reconnaissance for targets in Mumbai by LeT terrorists, as well as for being a part of a plan to attack a newspaper office in Copenhagen. As Headley’s childhood friend and colleague, Rana, a Canadian-American citizen and a former Pakistan military doctor, helped plan the attacks and facilitate his multiple entries to India, including once after the attacks, according to U.S. prosecutors. While Rana was not convicted for the Mumbai attacks in the U.S. trial, he was convicted for his LeT terror links and involvement in the Copenhagen conspiracy, and spent some part of a 14-year sentence in U.S. prisons. His extradition will allow Indian prosecutors to put on trial one of the men charge-sheeted in absentia for the 26/11 attacks; to extract more information on his Pakistan links; and to further the cause of justice after the dastardly attacks that brought the nation to a standstill. Ajmal Kasab, the only one of the 10 LeT gunmen caught alive, was convicted and hanged in 2012.The prosecutors of the National Investigation Agency, who have followed the 26/11 trail since 2009, will now need to conduct a similar and unimpeachable time-bound trial. The government would also need to investigate certain unanswered questions: including whether Rana continued to have provable links with the Pakistani military; whether there is more evidence on the extent of Pakistan’s official complicity, and why the U.S. chose to enter into a plea bargain with Headley, giving him immunity from extradition despite a treaty with India. When compared to Rana, he was clearly the more provably diabolical and culpable agent for the conspiracy. It is also curious that the U.S., that had been tracking Headley even before the 26/11 attacks, did not alert Indian authorities of his return to India for another reconnaissance operation in early 2009. It is hoped that Rana’s trial will turn the spotlight back on Pakistan, and generate enough pressure on it to cooperate in the prosecution of seven LeT terror commanders, including Hafiz Saeed who planned, trained and equipped the terrorists for the attacks. To that end, Rana’s extradition is a significant step in the quest for justice and closure for the victims of the 26/11 attacks and their families. Published - April 11, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Mumbai terror attacks\n                    \n                            /                      \n                        \n                        extradition\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        prison\n                    \n                            /                      \n                        \n                        arrest\n                    \n                            /                      \n                        \n                        investigation",
        "headline_1": "​Justice after extradition: On Tahawwur Hussain Rana",
        "headline_2": "Rana’s extradition allows Indian prosecutors to probe his links with Pakistan",
        "link": "https://www.thehindu.com/opinion/editorial/justice-after-extradition-on-tahawwur-hussain-rana-a-trial/article69435694.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "11-04-2025"
    },
    {
        "full_article": "The Reserve Bank of India (RBI)’s Monetary Policy Committee’s unanimous decision to cut the repo rate by 25 basis points, to 6%, is a timely reprieve for India’s business community. For weeks now, exporting sectors have been imploring the government to hasten bilateral trade negotiations with the U.S. to attempt to shield themselves from President Donald Trump’s “reciprocal” tariffs. The tariffs have been paused for 90 days, except for the 10% universal tariff, which is still applicable. The pause, even while raising tariffs against China to 125% in a trade stand-off with Beijing, suggests a strategy pivot to stem the massive sell-off of U.S. treasury bonds and the gutting of trillions of dollars in American stock valuations. Worried about an economic slowdown as investor sentiment turns negative, the RBI has changed its stance from “neutral” to “accommodative” that could indicate further rate cuts are likely. A decrease in the repo rate will most likely be reflected in loan service reductions for businesses, homeowners and retail borrowers, as banks pass on the rate cut. This began happening hours after the rate cut announcement. The central bank hopes this rate reduction ensures liquidity for businesses in a time of uncertainty, so that they can continue investing in the real economy even as they attempt to diversify their exports.More ominous, however, is the RBI’s lowered GDP growth estimates for the current fiscal, from 6.7% to 6.5%. This indicates that despite the RBI’s growth stimulus, steadily declining retail inflation — down to 3.61% in February — and steep falls in food staple prices, the central bank expects a growth contraction due to the uncertain economic climate. It is a universally accepted economic principle that stable governance, along with a predictable policy framework, is a necessary condition to foster growth. It would be no exaggeration to say that this principle has been turned on its head since Mr. Trump’s return as President. China’s move to impose retaliatory tariffs, totalling 84%, signals the beginning of a full-blown trade war, the likes of which the world has not witnessed since the Smoot-Hawley Act of 1930. Those tariffs, with objectives similar to the current ones — to protect American farming and manufacturing — ushered in an era of economic nationalism in the inter-war years, hitting global trade and contributing significantly to the Great Depression. Perhaps a lesson for nations must be that protecting one’s own economy can be achieved without hurting others, so long as countries recognise their competitive advantages and build on them. In America’s case, it is doubling down on research, education and innovation. Published - April 11, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        banking\n                    \n                            /                      \n                        \n                        inflation and deflation\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        manufacturing and engineering\n                    \n                            /                      \n                        \n                        research\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        exports",
        "headline_1": "​A cut in time: On RBI and repo rate cut",
        "headline_2": "Countries must build on their economic strengths, not create trade barriers",
        "link": "https://www.thehindu.com/opinion/editorial/a-cut-in-time-on-rbi-and-repo-rate-cut/article69435761.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "11-04-2025"
    },
    {
        "full_article": "Technology frees us from boring chores, so that we can do what we really want to\nThanks to a tip from a neighbour, I’ve made an amazing discovery that’s a game-changer for Bunny and me.\nIt’s a free app on my phone that transcribes my spoken words into printed text, ready for publication.\nBeing not just digitally challenged but digitally defeated, I’ve always handwritten my columns and articles, which Bunny would key in on her laptop for me. A boring job for her.\nBut now, thanks to my new found app, my handwritten pieces can be dictated directly into my phone, which turns them into text, saving time and trouble for Bunny who no longer has to perform the task of keying them in.\nThis app has led to an even greater discovery. Namely, of how technology has helped to liberate us from dull, humdrum chores, and leave us free to get on with work we really want to do.\nThere’s a world of difference between mindless drudgery – like typing up handwritten script or spending hours totting up long columns of numbers when the calculator on your cell phone can do it for you in half a jiffy – and work, real work, which fully enlivens us and which we love.\nWhen we say we look forward to weekends or holidays because then we don’t have to ‘work’, what we really mean is that we don’t have to go to a job, which we might find unexciting but which gives us a livelihood, or do daily repetitive chores.\nDays off allow us to do work that we truly enjoy. In the case of an enthusiastic cook, such work could be trying out new recipes for friends and families to savour. To someone with a green thumb, it would be tending flowering pots and plants. To a bird watcher, it would be spotting a rare species. To a philatelist, the study of stamps. To a dancer, the perfection of mudras. To an athlete, the raising of the bar a notch higher.\nWork is what engages us, body and soul. It is the prayer we make in thanksgiving for the boon of life.\n\n",
        "headline_1": "The write to work",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/the-write-to-work/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-04-2025"
    },
    {
        "full_article": "What was the point of Trump’s tariffs? US got a financial scare & economic gains, if any, will be small \nAnyone expecting the Don to flow quietly for the next 90 days is plain tired. In 80-something days of his presidency, Trump’s already imposed, raised, discounted and paused tariffs more times than you care to remember. Now that everyone, barring China, is tariffed at the 10% baseline, and markets have expressed hysterical relief – but US futures are showing signs of a sugar crash – we may ask, what was the point?\nTrump’s always been Tariff Man. In his 2011 book Time to Get Tough, he advocated a flat 20% tariff on all countries – “No more free admission into the biggest show in town.” Last year’s US poll was all about the economy, and tariffs were Trump’s top prescription. So the surprise is not that he imposed them, but that he backed off so fast. It begins to make sense, though, if you consider tariffs as an interesting experiment.\nTrump sold tariffs to voters as a fix for American manufacturing’s decline. Surprisingly, even Wall Street types – you, Bill Ackman – backed him because he was seen, in the words of a Wharton School professor, as “the most pro-stock market president we have had in our history”. Markets took Trump’s first tariff announcement on Jan 31 – 25% on Canadian and Mexican imports, 10% on China – rather well. S&P 500 lost just 0.5%. But the incessant hammering, uncertainty, and the indiscriminate tariffing of all countries, eventually proved too much – for markets, voters and billionaires.\nThe Economist’s ‘Trump approval tracker’ shows he’s never been less popular in the past six months. During April 2-8, S&P 500 lost about 12%. For ordinary Americans, that kind of stock market mayhem means reduced wealth and pensions. Fears of a recession coupled with tariff-induced inflation also weighed on them. Meanwhile, Trump’s billionaire friends were spooked by the prospect of a “self-induced nuclear winter”. As for Trump, bonds – treasury bonds – bent him. That investors were dumping US bonds meant more than ordinary instability. The experiment had to end.\nWhen, or rather if, the tariff dust settles, the best case scenario is that US may have a smaller trade deficit, but with its strong currency it can’t expect low-value manufacturing – textiles, garments, toys, laptop assembly – to return like it’s the 1950s. As the world’s reserve currency, the dollar is always in demand, hence valuable. So, US goods can’t compete on price alone. But Trump’s stirred a hornet’s nest with tariffs and everyone will pay a price for it. \n\n",
        "headline_1": "Don was dusted",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/don-was-dusted/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-04-2025"
    },
    {
        "full_article": "Summer 2025 is expected to be as severe if not more than last year. Have heat action plans kicked in? \nIn 2024, the first heatwave hit east and south India on April 5. This year’s first heatwave hit Mumbai in Feb. Last year was the hottest year on record; 2025 is expected to set a new record for longer, more frequent and more intense heatwaves. It’s estimated that extreme heat could impact over 70% of India’s land area in a few decades. April-June is peak heat, but it’s the wet bulb phenomenon that ensures high power demand till Sept. Add to that poorly designed cityscapes that create urban heat islands. Heatwaves majorly drive the spike in demand for cooling – 70% of which is met via fossil fuel generation to run the 10mn-15mn new ACs India adds annually. A World Bank wonk noted India is set to become world’s largest market for ACs – that by 2037, “every 15 seconds, an air conditioner will be sold in India.” Yet, a telling data point: AC penetration in India is just 8%. This fact demands pause.\nAre we prepared? On the one hand, there’s the power demand – April-Sept 2024 was 6.1% higher than 2023; April to June 2024 demand rose by 10.4% – a third of the rise from increased use of air conditioning. Parliament was told domestic coal stock stood at 53.2MT (as of March 18), sufficient for 20 days for a power plant to run. Per GOI, India’s prepared to meet summer 2025 peak power demand of 270GW, up from 250GW met in 2024.\nOn the other hand, what about the remaining 90% of households, their livestock and pets? It is hoped heat action plans in 23 states have rolled out – from regular clean-water supply, to providing roadside shade & shelter, tweaking work hours, ensuring no loss of livelihood, providing protection from heat strokes to quick attention to myriad heat-related conditions. This is especially needed for those who work outdoors: from gig workers to airport ground staff and traffic cops, vendors and street dwellers. Summer’s a bruising battle.\n\n",
        "headline_1": "To weather the weather",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/to-weather-the-weather/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-04-2025"
    },
    {
        "full_article": "You can bark, but don’t bite\nThere are two kinds of people. Those who love dogs and those who don’t. That’s why Mumbai’s housing societies are currently snarling/wagging their tails over BMC’s plans to revise its pet policy. The reasons for an undoubtedly tighter leash are a spate of dog attacks, and hospital statistics revealing that 75% are pets, not much-maligned strays. Mumbai Mirror’s lead story which reported this has led to very loud barks on our gated community’s common WhatsApp group – foolproof barometer of social dynamics, political leanings, consumption patterns, and the nuisance neuroses of 2308B. It’s become poop-littered battleground of dog-haves and have-nots.\nHumancentric world view is normally myopic over rights of any other species. At risk of being booked, or excised from BookMyShow, I’ll even say that dogs are a little like women in India: pedestalised as ‘man’s best friend’, but unempowered strays are kicked around. Most pet dogs, however, are pampered with coiffures and pedicures, designer coats and cute boots – with which they walk all over their so-called masters.\nHere’s a dispatch from what’s literally a turf war. Have-nots vehemently demand that these messy, dangerous beasts be kept off the grass. All other general areas too. The haves as unyieldingly pit themselves against such bull. They insist that bye-laws and maintenance charges entitle all occupants of a flat to all common facilities regardless of number or number of legs. Their slogan: ‘Running free is my non-violent hound’s right, and he shall have it.’\nNegotiations, if that be the word, rival Ukraine/Gaza impasse. Dober-man lot bares fangs; pet-peeved lobby gives no pause. Once-bitten lady is twice as vociferous. Muzzle my anger? Mad or wot? Neither party blinks, let alone bark down. Peace-brokers have begun feeling like bone of contention itself: that they’ve bitten off more than they can chew. It’s impossible to remain as neutral as a Swiss mastiff.\nOur Chinese Chow alone maintains its inscrutable mein while quietly plotting how to benefit from these two-legged poodles refusing to use their noodles.\nCompromise is easy, but who says rights and rules can coexist?\n***\nAlec Smart said: “Bloodbath everywhere; suicide bombing at home. Oh what a crazy war!”\n\n",
        "headline_1": "Pet grievances",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/pet-grievances/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-04-2025"
    },
    {
        "full_article": "It is heartening to learn that US President Donald Trump has paused the imposition of sweeping \"reciprocal\" tariffs on imports from nearly all its trading partners, including Bangladesh—a dramatic reversal that stunned the world almost as much as the initial announcement of the new tariff regime. Less surprising, perhaps, is the exclusion of China from this reprieve, as it continues to face even harsher levies. For other countries, only a flat 10 percent tariff which took effect on Saturday will now remain. However one interprets the 90-day pause—a tactical move to reduce trade deficits, a hawkish strategy to isolate China, or a reluctant step to calm volatile markets—there is no denying that it is a welcome relief for countries like Bangladesh.\nThe US is Bangladesh's second-largest export destination, accounting for nearly $10 billion in export earnings in 2023, more than 80 percent of which came from the RMG sector. For an economy so dependent on a single sector and a few core markets, any disruption in trade poses grave risks. For example, if the US reciprocal tariffs stand as originally outlined after the end of 90 days, RMG exporters may face a major challenge with up to 53.5 percent levies, industry insiders say. Thus, the tariff reversal should be seen not only as a breathing space but also an opportunity to negotiate better terms while taking steps to remove all non-tariff barriers in our bilateral trade.\n\nFor an economy so dependent on a single sector and a few core markets, any disruption in trade poses grave risks. For example, if the US reciprocal tariffs stand as originally outlined after the end of 90 days, RMG exporters may face a major challenge with up to 53.5 percent levies, industry insiders say. Thus, the tariff reversal should be seen not only as a breathing space but also an opportunity to negotiate better terms while taking steps to remove all non-tariff barriers in our bilateral trade.\nAt the same time, we must think about building a more resilient future for our export-based economy. It is crucial to diversify our export base beyond RMG, which, despite being a success story, makes us dangerously vulnerable to external shocks. Simultaneously, our focus must extend much beyond the US. True, Bangladesh may benefit from the stiff US levies on Chinese products, the European Union, another key destination for our products, may soon be inundated with Chinese garments diverted from the US, undermining our competitiveness in that market. Keeping in mind the reality of Bangladesh losing some trade privileges after its LDC graduation, it is also crucial that we critically rethink our export-import strategy and prepare for a more competitive post-LDC landscape.\nTo spur growth through greater market integration as well as infusion of international investments, it is equally important that the government seriously acts on prevailing concerns about obstacles to doing business in Bangladesh. Many of these concerns were raised at the just-held Bangladesh Investment Summit. A new report by the World Bank, unveiled at the summit, highlighted five key obstacles including corruption, erratic power supply, high prevalence of informal economy, high borrowing costs, and complex tax structure. These need to be addressed. Importantly, the WB also identified four key sectors, including RMG, as ripe for reform. We must address all these interconnected issues if we want to progress in today's rapidly shifting global trade landscape.\n",
        "headline_1": "Tariff reversal should prompt a rethink of our trade strategies",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/tariff-reversal-should-prompt-rethink-our-trade-strategies-3868366",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-04-2025"
    },
    {
        "full_article": "Whenever Bata shoes come to mind, we are reminded not only of how footwear became woven into the fabric of everyday life—evolving with shifting lifestyles and consumer needs—but also of an extraordinary figure linked to its history in Bangladesh: William A.S. Ouderland. A Dutch national and then Production Manager of the Bata Shoe Company in Dhaka, Ouderland remains the only foreigner to be awarded the state honour of 'Bir Pratik' for his brave and active role in the 1971 Liberation War.\nBata was instrumental in transforming footwear from a luxury into a necessity, making shoes both affordable and widely available without compromising on quality—a critical contribution during decades when much of the population lived with limited means, particularly before the turn of the century. From its beginnings as a global enterprise to its deep-rooted presence in colonial Bengal and present-day Bangladesh, Bata steadily became a familiar and trusted name, almost indistinguishable from local brands. At the heart of this transformation was the vision of its founder, Thomas Bata (1876–1932), who visited Bengal shortly before his death.\nAlthough Bata Shoe began formal operations in East Pakistan in 1962—nearly a decade before the independence of Bangladesh—Thomas Bata's visit to Bengal marked an early turning point for the region's shoe industry, which was still in its infancy. Before his visit, Bata's presence in the region began with shoe imports managed by local dealers around 1925. Over time, the brand transitioned to local production, establishing an exclusive industrial township in Konnagar, in the Howrah district of West Bengal in 1933, which later became known as Batanagar.\nInterestingly, Thomas Bata's autobiographical book How I Began found a remarkable afterlife in Bengal when it was translated into Bengali by the acclaimed novelist Bibhutibhushan Bandyopadhyay and published in 1943. The original text, written in Czech, had been translated into English a year earlier by Jab Baros and brought out in 1942 by the Club for Graduates of the Bata School in Batanagar, Calcutta.\nThe Bengali edition included an introduction by the eminent scientist P.C. Ray, further reinforcing Bata's legacy within Bengal's cultural and intellectual milieu. The book presents a rich compilation of Bata's reflections, manifestoes, and speeches, offering valuable insights into his vision and philosophy.\nP.C. Ray was not only an eminent chemist and scientist but also a pioneering entrepreneur who played a vital role in encouraging the people of Bengal—long accustomed to salaried employment—to pursue business and industrial ventures. Under colonial rule, the scope for such salaried jobs had further diminished due to limited industrialisation. Ray was not merely a vocal advocate for industrial development; the founding of The Bengal Chemical and Pharmaceutical Works stands as a testament to his practical commitment to this vision. It is therefore not surprising that he took a keen interest in Thomas Bata's autobiography. In his introduction, Ray remarked that it was essential for people in Bengal to learn about Bata, as the region had long been stifled by a lack of industrial effort.\nHe interestingly noted that although Thomas Bata might have been relatively unknown in Bengal, his products were already well recognised—highlighting how deeply Bata had penetrated the shoe market during the final decade of colonial rule. P.C. Ray deeply admired Bata's vision. Though Bata was a prominent industrialist, he rejected a lavish lifestyle and was not driven solely by profit. Ray appreciated Bata's emphasis on making each production unit self-reliant, a model he believed was essential for Bengal as well. Given that much of Bengal's industry was based on small-scale home crafts, Ray recognised that without such structural changes, it would struggle to compete with large-scale mechanised production.\nThomas Bata was born into a devout Christian family in what was then Czechoslovakia. His father was also a shoemaker, and Thomas inherited both the trade and a strong entrepreneurial spirit. However, it was Thomas Bata himself who transformed the family's modest handmade shoemaking business into a global enterprise. Despite facing challenges such as wars, economic depressions, and global instability, he expanded the company into a multinational brand—driven by his own vision, strategy, and worldview.\nAs a child, Thomas aspired to be well-educated and to join the ranks of the established middle class, but the path was far from easy. Limited access to education and his family's modest economic condition made upward mobility particularly difficult—especially in a Europe where such advancement was traditionally hard-won. In 1894, he broke away from his father's enterprise to start an independent shoe business of his own, a venture that was equally challenging in its early days.\nEven in his early years, Thomas became acutely aware of the harsh realities of the capitalist system, which drained the life out of workers. He first encountered a shoe-making machine in Frankfurt but was unable to implement it in his own business due to a lack of capital at the time. His socialist views began to take shape early on, influenced by the works of Tolstoy and by witnessing a society ruled by a few lazy individuals while workers toiled relentlessly, living in poverty. He was deeply moved by Tolstoy's portrayal of ordinary life, which profoundly shaped his worldview and remained a core influence throughout his life. Thus, he never wanted to be a greedy capitalist.\nIn 1904, Thomas Bata was finally able to introduce machinery into his shoe factory. His visit to the United States further impressed him, as he observed that people there were not concerned with their past origins or family prestige. Instead, they focused on working hard in the present to make money and build relationships based on current achievements. During World War I, he secured substantial orders to supply shoes for the military, which helped sustain his business and support his workforce. Due to his sharp insights, keen observations, and strategic decisions, Bata's company not only survived the economic depression that followed the war but also expanded significantly worldwide. His autobiography reflects the experiences and lessons he gained over the years, offering valuable insight into his journey and the growth of his business.\nIn Bangladesh, Bata has become a trusted name in footwear, operating two major factories and enjoying a presence akin to a local brand. Alongside it, several foreign and emerging domestic brands contribute to a growing industry. As the country looks to diversify beyond its garment exports, experts see strong potential in footwear. Like in the RMG sector, global brands such as Nike and Adidas outsource production to countries like Bangladesh. With proper support and direction, Bangladesh could become a key player in global shoe exports—carrying forward the legacy of accessible, quality footwear that Thomas Bata once championed.\nPriyam Paul is a researcher and journalist.\n\n",
        "headline_1": "The Legacy of Thomas Bata in Bengal",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/focus/news/the-legacy-thomas-bata-bengal-3868136",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-04-2025"
    },
    {
        "full_article": "Why so many issues in just 40 minutes? Did they truly listen to each other—or merely exchange a list of disputes? Surely both sides came having done their homework. Or perhaps Dhaka and Delhi arrived armed with their own agendas, with little intention to prioritise. When the relationship is fragile and a rare opportunity emerges, wouldn't warmth and confidence-building have made more sense?\nIt's clear Dhaka was eager to set up this meeting between Prime Minister Modi and Chief Adviser Yunus. Delhi, on the other hand, appeared to have kept it pending until the last minute. Interestingly, just a week earlier, the CA had engaged with Chinese leaders. Was this a message to Delhi: \"If you don't talk, we'll take the match to a third party's playground?\"\nJapan's infrastructure push, connecting Bangladesh to India's Seven Sisters, is a decade-old trilateral effort between Tokyo, Dhaka, and Delhi. It's a win-win measure—and it speaks volumes: trust us. Japan—more so than many—has stood by us consistently. Yunus's subtle reference to this alignment while speaking with China may well have applied quiet pressure on Delhi.\nWhen Delhi didn't confirm the next-day sideline meeting, the CA's press team publicised several photos of Modi and Yunus sitting side by side at the BIMSTEC dinner. Alongside this, continued social media releases featuring high-level interactions with Indian representatives helped build anticipation. It created a buzz—a sense of proximity between the two leaders. And it's true: if not the entire region, at least Bangladesh was closely observing the body language and attitude of the two men.\nIn fact, the public perhaps longed to see that closeness—what we might describe as a moment of emotional diplomacy or a symbolic chemistry.\nModi, as quoted in Indian media, advised Yunus that \"rhetoric that vitiates the environment is best avoided.\" A line not casually dropped—unless the tone was already set.\nIn a region already teeming with distrust, misinformation, and emotional narratives, what was truly achieved in this so-called \"sideline\" meeting?\nRead Modi's post again on X:\n\"Met with Mr Muhammad Yunus, Chief Adviser of the interim government of Bangladesh.\nIndia remains committed to a constructive and people-centric relationship with Bangladesh.\nI reiterated India's support for peace, stability, inclusivity, and democracy in Bangladesh.\"\n\nWhile the CA's press wing followed up with detailed statements, India left post-meeting messaging to its seasoned diplomats—a clear signal that Delhi preferred containment over escalation. Yet, the way the CA's team framed the meeting, it was not just a diplomatic exchange—it was a performance for a broader audience. A message that said: We said everything that needed to be said—openly and directly. It was diplomacy shaped by political communication.\nAnother layer: PM Modi was accompanied by India's National Security Adviser Ajit Doval, who also held a quiet sideline meeting with the High Representative of the CA. The details of that interaction haven't been made public, but its significance hasn't gone unnoticed.\nMeanwhile, the CA expressed gratitude for India's historic role in Bangladesh's 1971 Liberation War, stressed the importance of sustaining the bilateral relationship, and sought Delhi's support for Bangladesh's leadership of BIMSTEC. Modi responded warmly, extending Eid greetings and acknowledging Dhaka's growing regional responsibilities.\nStill, both sides' messaging leaves a curious gap. Yunus raised concerns about border killings, cited the UN Human Rights Council's findings on abuses under Sheikh Hasina's final weeks, and pressed for her extradition, accusing her of inciting unrest from Indian soil—a misuse, he said, of Delhi's hospitality. Reports confirm that eight major issues were packed into the short session—from the Teesta water treaty and BIMSTEC cooperation to security tensions and the Hasina question. A lot of weight for 40 minutes.\nModi's public statement avoided all of that. Still, officials indicated that India countered on the border narrative, labelling the actions of Indian forces as self-defence. On the matter of minorities in Bangladesh, Modi reportedly raised concerns—to which the CA responded that many such incidents were exaggerated and \"mostly fake news.\" So, was this meeting truly \"candid, constructive, and productive\"—as the press wing of CA claimed—or just a polite exchange of long-standing grievances with no resolution in sight?\nIf Modi's advice is overlooked, and Yunus's concerns were left without concrete response, was this really a dialogue—or two parallel monologues? In a region shaped by complex histories, the brief Yunus–Modi meeting was a chance to set a more hopeful tone. While many issues surfaced, the deeper need was trust. India seems to be misreading the pulse of ordinary Bangladeshis — who seek dignity, fairness, and respect. For both Dhaka and Delhi, the way forward lies not just in strategy, but in sincerity — and gestures that build lasting understanding.\nNazbul H Khan is an independent analyst and op-ed contributor on South Asian geopolitics. He is also co-founder of the platform PART II.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "A closer look at the Modi-Yunus meeting",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/closer-look-the-modi-yunus-meeting-3868061",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-04-2025"
    },
    {
        "full_article": "We welcome the government's initiative to send two letters to the US administration—one to President Donald Trump and another to the US government's lead trade negotiation office—in response to its new \"reciprocal\" tariff regime imposed on all its trading partners. According to a report by this daily, the letters will outline policy measures to reduce bilateral trade imbalances that triggered the levying of a 37 percent tariff on imports from Bangladesh. This comes amid fears that the new policy, effective from April 9, may strike a blow to our export-based economy, particularly the garments sector, for which the US is the single largest market. As the world rushes to the negotiating table to deal with this latest setback, we must do the same to protect our industries and retain our competitiveness.\n\nWhile talking to The Daily Star following a high-level meeting at the finance ministry, government officials and industry leaders appeared optimistic that if proper measures are taken, Bangladesh may not only weather this storm but also turn the challenge into an opportunity to diversify exports, streamline trade practices, and strengthen its position in the US market. This confidence comes partly from the fact that most regional trade rivals of Bangladesh face a heavier blow. In 2024, Bangladesh shipped $7.4 billion worth of garments to the US, making it the third-largest apparel supplier after China and Vietnam. Now, under the new US policy, China's total apparel tariff could reach 65.5 percent, while Vietnam's may rise to 57.5 percent. However, there remains doubt about whether the 37 percent tariff imposed on Bangladesh will replace existing duties or be added on top of them. If it is an additional tariff, the total duty on our garments could rise to 48.56 percent—up from the current average of 11.56 percent. We, therefore, must prepare for the worst-case scenario, although we will not know for sure until April 9.\n\nOur response must be swift, strategic, and with the broader interests of the nation, including workers, in mind. One strategy that could prove effective is requesting a delay in the implementation of the new tariffs. Vietnam has already sought at least 45 days of relief from the US to allow room for negotiation and adjustment, even offering to reduce all tariffs on US imports to zero. Bangladesh should not shy away from making similar moves to adjust trade balances. While the commerce adviser has said that a deferral is unlikely at this stage, persistence may lead to rewards. Even a limited extension could give our exporters time to reorganise and adjust pricing strategies.\n\nIn this regard, we may also consider engaging experienced US-based lobbyists to support our case. Experts have also stressed the importance of expanding US imports of goods and services, broadening our export base beyond RMG, expanding exports to other markets beyond the US, and removing all tariff and non-tariff barriers to encourage greater bilateral trade.\n",
        "headline_1": "Proper steps needed to address the US tariff crisis ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/proper-steps-needed-address-the-us-tariff-crisis-3866106",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 11, 2025 00:00:00  \nThe shocking wave of vandalism and looting that swept through various parts of the country on April 7, during pro-Gaza protest rallies, has laid bare the fragility of law and order situation in the country. What were initially intended to be peaceful demonstrations in solidarity with the people of Gaza quickly spiraled into violence, with mobs targeting well-known business outlets such as Bata, KFC, and Domino's Pizza in cities including Sylhet, Chattogram, Khulna, Barishal, and Cumilla. These attacks were allegedly triggered by claims of the companies' associations with Israel --claims that, even if true, cannot justify such brazen acts of destruction and looting.\n The coordinated nature of the assaults suggests that they were not spontaneous reactions but rather pre-planned and orchestrated by opportunistic criminal groups with the clear intent to loot. This was not mere protest -- it was an outright assault on law, order, and commerce, carried out with impunity. In response, law enforcement agencies have conducted a series of raids and are analysing surveillance footage to identify those responsible. The government has appealed to the public for assistance in identifying the perpetrators. The Home Adviser has warned of stern actions, claiming that law enforcers will remain vigilant to prevent future occurrences. Such pronouncements feel all too familiar. They echo the same formulaic responses issued after previous incidents of violence and disorder. This time, the assurances ring particularly hollow. Vandalism has become disturbingly common in recent months. While some unrest following the July student uprising may have been anticipated, the persistence of violence long after that movement signals a deeper systemic failure.\n What happened on April 7 can only be described as a grave failure of governance-most notably, a failure of intelligence. The inability to foresee or preempt such organised acts of aggression is deeply troubling. Law enforcers were either caught off guard or they were negligent to duties. The incidents also came at a particularly sensitive time -- just a day before a major investment summit intended to position Bangladesh as a promising destination for international investors. Hundreds of foreign delegates were in attendance, and the chaos unfolding across the country could not have sent a worse message. Instead of assuring potential investors of a stable and secure environment, the events offered a stark contrast -- instability, insecurity, and apparent law enforcement inertia.\n It is deeply concerning that, despite knowing the heightened tensions surrounding the protests, the authorities failed to take adequate preventive measures. Post-event promises of vigilance ring hollow when the damage has already been done. Empty reassurances will not restore the confidence of businesses or the public. If shop owners and entrepreneurs remain in fear of losing their property to mob violence, verbal commitments will mean little. The government must recognise that the maintenance of law and order is not just a reactive duty but a proactive obligation. It is time to demonstrate with action -- not just words -- that security, stability, and justice are top priorities in every corner of the country.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Of vandalism, looting and languid law enforcement",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/of-vandalism-looting-and-languid-law-enforcement-1744298085",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       April 11, 2025 00:00:00  \nModern civilisation is slipping fast into a humanitarian crisis. With the Western powers led first by the United Kingdom and then the United States of America demonstrably since the World War II, sowing the seeds of discords in Asia, Africa and Latin America for exploitation when those would germinate to become full-blown bloody confrontations, the world cannot but struggle to be at peace with itself. Their overt and covert attempts and operations to destabilise governments and society on foreign soils have only allowed them to maintain a strong hold on the resources they used to plunder during the colonial time. \nWhile Western governments have for long maintained a veil of diplomacy and sophistication to advance their interests, this time Donald Trump has resorted to an unpretentious blatant aggression in promoting self-interests. Well, his predecessors did so like smiling assailants, this crazy man in the White House has the honesty to call spade a spade. The only difference is that apart from some select allies like Israel, both friends and foes are finding themselves at the receiving end. On that count, at least people across the world know what they are expecting from America, the most dominant global player. First, the US president imposed a freeze on US aid and of late has gone ahead with the termination of supports including emergency food aid.\n\nThe World Food Programme (WFP) which has so long relied heavily on American aid has admitted that the latest move to cut emergency food aid to 14 countries is like pronouncement of 'death sentence' for millions of hungry and starving people in those countries. Already struggling with a 40 per cent drop in its overall funding for this year, the WFP has been forced to slash per capita food allowance for refugees across the globe. Now if the Trump administration's latest directive is put into effect, not only displaced people and refugees on account of wars and strife but also people falling victim to natural disasters cannot count on the UN agency's support like before. \nHistory, though, suggests that the Western powers are responsible for wars, genocides, internecine strife and political destabilisation of not just countries but of entire regions. Sudan, Yemen and Syria in the Middle East and Angola, Somalia, Ethiopia in Africa have been bearing the brunt of the vicious political agenda the Western world led by its big brother America have been pursuing. Trump may have followed a reverse course of isolationism but not quite. In case of Palestine, Trump is more hawkish than his predecessor. But here is a place where an artificial state, Israel was carved out of the Palestinians' homeland in the middle of the past century, only 56 years ago, and now the impostor state, with the backing of America, has been killing the native inhabitants like vermin. Trump's aggressive policy has not only evaporated any hope of a permanent ceasefire for acceding Palestine's independence but also threatens wiping out the Palestinians from Gaza strips and some parts of the West Bank.\nThe crime of the Palestinians is that they did not leave their homeland to become refugees like the Rohingya, the Angolans, the Sudanese, the Yemenis, the Syrians and the Lebanese. As a freedom-loving people, they are paying a heavy price---heavier than other peoples. Now they are refugees on their own soil because of a lack of food, clean drinking water, sanitation and hygiene. The sinister programme is being carried out by Netanyahu with the US providing the killing machines on the one hand, and stopping food aid to the starving population there, on the other. Shame to the civilisation that can allow this barbarity to happen and persist! \nNear home, the theatre of civil war in Myanmar too is a legacy of toxic international politics that has indirectly made Bangladesh a victim of social, economic and environmental depredation. This country itself had its fiery baptism in 1971 and also suffered the dismemberment in 1947. It has a surfeit of its problems ranging from political destabilisation to economic haemorrhage to social instability and decline. Its achievements on the economic front against all odds have been appreciable but for the unequal distribution of wealth with the privileged, corrupt and crafty having their cakes and eating those too. \nRight at the moment the country is trying its best to come out of its economic morass, Trump's tariff war threatens to further deteriorate the situation. The political future largely depends on its economic stability. But the area that defies any cure is the recent decline in people's mental poise and the simmering rage that flares up with the slightest provocation or just made to do so with ulterior motives. Intolerance and mob mentality have crossed all limits to mark a general trend beyond cure. \nSome segments are trying to assume the role of moral guardians by spreading canards. Encouraged, the anti-social elements are now on the prowl for all kinds of unearned and immoral exploits with girls, including babies, and women becoming the prime victims. Making economic recovery possible may be challenging but it is attainable. But when society falls into chaos and lawlessness undermines mainstream and peaceful politics, a country unwittingly hands its sovereignty over to alien powers under the garb of commercial exploitation and bilateral or multilateral treaty on resource exploration and development undertakings. The vandalism resorted to by some protesters from the processions held to demonstrate solidarity with Palestine and protest continued aggression on the Palestinians smacks of sinister attempts to further destabilise society. This is how subversive agents are used to expedite neo-colonial economic agenda as against the direct invasion of countries like Iraq and Afghanistan.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "War on the freedom-loving peoples and neo-colonial exploitation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/war-on-the-freedom-loving-peoples-and-neo-colonial-exploitation-1744298181",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       April 11, 2025 00:00:00  \nDhaka has earned, along with a few cities of the world, the notoriety for the worst air pollution. The bustling metropolis of around 20 million people often makes headlines for ranking as the most polluted city in the global Air Quality Index (AQI). The air quality of the city remains in the \"very unhealthy\" and \"hazardous\" categories around the year with the pollution level reaching catastrophic levels during the winter. We know several culprits which contribute to Dhaka's air pollution the most --- vehicle exhaust, industrial and brick kiln emissions, dust release, etc. However, we often overlook a silent yet pervasive menace deteriorating air quality --- the rampant burning of garbage at numerous dumpsites scattered throughout the city. According to the World Bank report titled \"Clearing the Air: Addressing Bangladesh's Air Pollution Crisis\" published in November, open air rubbish incineration, which releases multiple toxic pollutants, contributes 11 per cent to the city's air pollution. This practice worsens the already dire air quality situation and leaves profound impact on the well-being of its inhabitants.\nAccording to the official version, Dhaka generates approximately 6,500 tonnes of waste every day with the figure projected to rise to 8,500 tonnes by 2032. The city's insufficient waste management infrastructure struggles to cope with this huge amount of rubbish, leading to the growth of informal dumpsites in different neighbourhoods and frequent burning of the waste. Such mindless incineration releases several pollutants including dioxins and furans into the atmosphere, which cause severe health problems. It also emits microscopic particles, which are capable of penetrating deep into the respiratory system and worsening diseases like asthma and chronic obstructive pulmonary disease. Long-term exposure to such air may lead to lung cancer, impaired cognitive development in children, and increased risk of cardiovascular diseases in older populations. The impact of waste burning does not remain limited to air pollution; it contaminates soil and groundwater, posing additional health risks through water supply and food chain.\n\nThe unscientific and unhealthy waste disposal in Dhaka has reached such a point that it will not be easy to reverse the practice. Any positive change in the practice will require multi-pronged approach from stakeholders. Members of society certainly have an important role, but the main responsibility lies with the authorities. The city authorities should invest more to enhance waste collection capacity and establish more garbage dumps to reduce the need for open burning. They should also adopt waste-to-energy technologies to provide sustainable alternatives to waste disposal.\nIntroduction of a carrot-and-stick policy to discourage people from indiscriminate garbage burning may work. Through regulations, the authorities can provide for punitive action against open waste burning on the one hand and offer incentives for recycling and composting on the other. The authorities can also promote zero-waste initiatives by encouraging industries and households to adopt related practices which will minimise waste generation at the source, alleviating the burden on waste management systems. Creation of public awareness is another important area that can greatly contribute to minimising waste generation and its unhealthy disposal. The authorities, environmental organisations, civil society and the media should play a role in educating citizens about the health and environmental hazards of waste burning. Proper awareness can foster community-driven initiatives to curb the practice.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Waste burning adds to air pollution",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/waste-burning-adds-to-air-pollution-1744298290",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 11, 2025 00:00:00  \n\nPassengers travelling on the Kishoreganj-Dhaka train route are facing severe hardships on a daily basis. Despite purchasing valid tickets, many find themselves unable to travel in comfort due to an overwhelming number of ticketless passengers. These individuals often occupy reserved seats or crowd around them, turning the journey into an ordeal for those who have paid their fare.\nThe level of overcrowding inside the carriages is alarming-hardly any space to move, and in some cases, passengers are forced to board or disembark through the windows. Even more concerning is the rooftop travel which poses a constant risk of fatal accidents.\nEqually troubling are reports that some train ticket inspectors (TTIs) are allegedly accepting bribes of up to Tk 300 in exchange for allowing ticketless passengers to stand throughout the journey. This reflects a disturbing culture of corruption that further undermines the integrity of the railway service. The railway authorities must take immediate action to address these issues.\nNusrat Jahan Arpita\nAustagram, \nKishoreganj\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Kishoreganj-Dhaka train’s travail",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/kishoreganj-dhaka-trains-travail-1744298306",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-04-2025"
    }
]