[
    {
        "full_article": "The railways have proposed automatic sliding doors with ventilation louvres in all Mumbai suburban trains by next year in response to the Mumbra train tragedy on Monday (June 9, 2025) — four people died and nearly a dozen others were injured. Sliding doors could potentially force people inside and prevent footboard travel, a factor in the accident. They could ensure that passengers do not get down at unscheduled stops and put themselves in danger of being mowed down by passing trains. The proposed vestibules connecting the coaches may also help to evenly distribute the crowds. As in Japan, each station may then need a few enforcers who could shove the crowds in so that the doors could shut and the trains move. While footboard travel is indeed a dangerous safety issue, it is only an outcome of the dangerous overcrowding in Mumbai trains. For vast numbers of people, the trains offer the least expensive travel option. Not too long ago, the dangers of overcrowding resulted in the infamous stampede at the Elphinstone Road station bridge in 2017. Multiple deaths are common along the three arteries that are the lifelines of Mumbai – the Central, Harbour and Western railway lines. Many are hit by trains while crossing tracks instead of using roads or bridges. While rail safety is an immediate issue that needs to be addressed, it is also time city leaders engineer inexpensive, alternative travel options to the trains.Mumbai’s trains have been seen as an inevitable part of the extreme urbanisation that the city represents and romanticised by literature. But they are simply not humane modes of transport. The suburban train system has undergone little change over the decades though the city has boosted its roads and enabled more vehicular traffic. Two-wheelers that were a rarity a few decades ago are now common. While the Metro promises to decongest the city to an extent, these services price out the lower classes. Bus services could be enhanced for routes connecting shorter distances. Along with doubling efforts to change the structuring of the city from a north-south network with commuter movements dictated by times, planners should consider expanding ferry transport — a cheaper and possibly more eco-friendly mode of transport to a city bound by the sea. Broadly speaking though, stampedes such as the one in Bengaluru, fire accidents in congested areas, and train tragedies such as the Mumbai one only highlight how unprepared India is to handle the consequences of urbanisation and the thrust to overturn the engagement of the vast majority of the people with agriculture.\r Published - June 11, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Mumbai\n                    \n                            /                      \n                        \n                        railway accident\n                    \n                            /                      \n                        \n                        public transport\n                    \n                            /                      \n                        \n                        indian railways\n                    \n                            /                      \n                        \n                        urban planning\n                    \n                            /                      \n                        \n                        bengaluru\n                    \n                            /                      \n                        \n                        fire\n                    \n                            /                      \n                        \n                        road transport\n                    \n                            /                      \n                        \n                        safety of citizens\n                    \n                            /                      \n                        \n                        agriculture",
        "headline_1": "​Maximum Mumbai: On the city, its transportation needs",
        "headline_2": "The city needs long term solutions to its transportation needs",
        "link": "https://www.thehindu.com/opinion/editorial/maximum-mumbai-the-city-its-transportation-needs/article69679209.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "11-06-2025"
    },
    {
        "full_article": "When Donald Tusk’s diverse coalition came to power in Poland in 2023, ending the eight-year rule of the right-wing Law and Justice Party (PiS), the veteran centrist promised “to chase away the darkness”. Two years on, with the Tusk government still struggling to deliver on key reforms, Polish voters have elected a conservative backed by PiS as the country’s next President. Karol Nawrocki, a 42-year-old historian and former boxer with little political experience, won the June 1 presidential run-off with 50.89% votes, narrowly defeating the liberal Mayor of Warsaw, Rafal Trzaskowski, who secured 49.11%. Mr. Nawrocki, endorsed by Donald Trump and his MAGA movement, presented himself as an outsider populist, and promised a ‘Poland first’ approach that echoed Trumpian rhetoric. During its rule (2015–23), the PiS had implemented sweeping reforms that were aimed at tightening its control over state institutions and media, and recasting the Polish society along its ideological lines. It curbed abortion rights, overhauled education and filled the judiciary with party loyalists, often clashing with the European Union. Mr. Tusk attempted to roll back some of these measures, but met with strong opposition from the outgoing President, Andrzej Duda, also a PiS ally. As legislative logjam derailed Mr. Tusk’s reform agenda, Mr. Nawrocki capitalised on public resentment, attacking the Polish establishment and Brussels.While Poland’s presidency is largely ceremonial, Mr. Nawrocki’s victory could significantly impact its politics. First, the President can veto laws passed by Parliament or send them to the constitutional court, now packed with judges appointed by the PiS government. In a post-election rally, Mr. Nawrocki said the Tusk government was trying to achieve a “monopoly” of power and vowed to prevent it, in a sign of what is to come. As the government does not have the three-fifths majority in Parliament to override presidential vetoes, Mr. Tusk could face further gridlock. Second, Mr. Nawrocki’s victory is a morale boost for Poland’s Eurosceptic right and may strengthen the alliance between the populist movements across the Atlantic. Despite his campaign rhetoric to oppose Ukraine joining NATO, he is unlikely to change Poland’s foreign policy core — be it its political and security alliance with the West or its opposition to Russia. But on social and economic policies, he is likely to follow the PiS’s right-wing conservatism. Third, the election result could exacerbate internal tensions within Mr. Tusk’s ideologically broad coalition which threaten to reduce Mr. Tusk to being a lame duck Prime Minister. All this points to a turbulent phase for Poland, where a politically polarised and socially divided nation braces for a prolonged tug of war between the pro-European centrists and ascendant populist conservatives.\r Published - June 11, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Poland\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Ukraine\n                    \n                            /                      \n                        \n                        NATO",
        "headline_1": "​Polarised Poland: On politics, the Presidential election results",
        "headline_2": "Pro-Europe liberals and populist conservatives are at war",
        "link": "https://www.thehindu.com/opinion/editorial/polarised-poland-on-politics-the-presidential-election-results/article69679044.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "11-06-2025"
    },
    {
        "full_article": "The weaponisation of a commonly used mark of punctuation, and how best to counter it \nThe minister of Punctuation, Propaganda, and Fake News was addressing his aides and assorted flunkies. There is good news and there is bad news, said the minister. First, the good news. The good news is that our Operation Hyphen worked even better than we anticipated. \nThe terror attack we masterminded triggered an inevitable response from The Adversary who promptly launched multiple strikes against the terrorist training camps we’ve established. \nSo far so good, said the minister, while his aides and assorted flunkies nodded in obsequious agreement. \nWith the escalation of hostilities which we so cunningly had provoked, international attention, not to mention alarm, got focused on the face-off between us and the adversary, as we had planned, said the minister. \nThis was the good news, he continued. Our Operation Hyphen was crowned with success because in the eyes of the international community we and the adversary got re-hyphenated. \nOr, to be more precise, clarified the minister, we and the adversary got re-re-hyphenated, after having been repeatedly de-de-hyphenated. \nThe hyphen, explained the minister, which is not to be confused with the N dash or the M dash, or the minus sign which it resembles, is one heck of a juju of a punctuation mark. Its name derives from the Greek ‘Huphen’, which in late Latin became ‘hyphen’ and means ‘together’. \nThe first recorded use of the hyphen to join two words, and by implication, give them equal value or status was by Dionysus Thrax, the great Greek grammarian (170-90BC), pronounced the minister. \nThanks to the hyphen we got equated with The Adversary, even though we are a bankrupt military dictatorship and The Adversary is the world’s most populous democracy and the fifth-largest economy to boot, he gloated. \nThat’s good news, he said. Unfortunately, he continued, the bad news is that The Adversary has made it abundantly clear to all concerned that to counter our hyphen, if necessary it is ready to come up with an even bigger juju of a punctuation mark: the Full Stop… \n\n",
        "headline_1": "Hyphen-hype",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/hyphen-hype/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-06-2025"
    },
    {
        "full_article": "Trump can’t Make America Great Again without immigrants powering the country\nTrump’s crackdown against anti-ICE (Immigration and Customs Enforcement) protesters in Los Angeles, California, appears to be inflaming an already polarised America, split down the middle over immigration. National Guard and marines have been called up for what is essentially a domestic law and order problem. ICE raids have become tougher since Trump came to office. And while it is perfectly within the remit of any govt to take action to stop illegal immigration, Trump admin’s approach appears to be allergic to immigration overall. Case in point, admin officials have been accused of gutting specific programmes tied to helping lawful, permanent US residents obtain citizenship. Never mind that all this is counterproductive, given the hugely productive role immigrants have played in US. \nThe saying that “immigrants have built America” may sound like cliché, but it’s an undeniable fact. That US remains the world’s largest and most dynamic economy is in large part due to immigrants. According to a study by the Immigration Research Initiative, immigrants account for 17% of US GDP. A key reason for this is immigrants are mostly concentrated in the working-age population, comprising around 18% of the American labour force. On top of this, immigrants – including undocumented migrants – pay around $525bn annually in federal, state and local US taxes.\nBesides, there’s a strategic argument for US to adhere to a liberal approach to immigration. US simply can’t grow its workforce without immigrants who help fill gaps in certain critical sectors. Healthcare being a clear example. But also, at a time US is locked in an economic-security tussle with China, the one advantage America has is its ability to attract immigrants. China’s non-existent immigration and shrinking local working-age demographic are creating all sorts of problems for Beijing. Xi Jinping will be relishing the polarisation over immigration in US. Trump is committed to ‘Make America Great Again’. But that just can’t happen without immigrants.\n\n",
        "headline_1": "Without MalICE",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/without-malice/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-06-2025"
    },
    {
        "full_article": "Mumbai train network won’t improve with patchwork solutions. Commuters need more trains\nJune 26, 2019 was an unusual day for Mumbai’s trainspotters. Nobody died on the city’s suburban railway network that day. In a transport system that has claimed over 51,000 lives over 20 years – averaging seven a day – death does not shock easily. But it did on Monday, when four passengers died after falling off two passing trains. Details are still emerging, but it seems both trains were bursting at the seams with passengers, which is not unusual at 9.10am, Mumbai’s rush hour. People were hanging out of doors with barely a toehold. As the trains passed 6.5ft apart at Mumbra, the backpacks of some passengers probably collided, throwing eight on the ballast-covered ground. Even railway officials have termed it an “unheard of incident in the history of Mumbai’s suburban system”, and promised change. \nThe plan is to have automatic doors on all new non-AC coaches, and retrofit old coaches with such doors. However, a prototype won’t be ready until Nov. After that, around 3,400 coaches will need retrofitting. Railways’ Jan 2026 timeline seems ambitious, but say they do it, that still leaves eight months. Last year, 570 passengers died after falling off Mumbai locals – at that rate, there could be 380 more such deaths. There’s a bigger issue. Over 350 passengers are packed in each coach during rush hour – what about risks of suffocation when doors are shut? \nClosing coaches, or reducing seats – which railways did in 2015 – does not address the root of the problem, which is that Mumbai does not have enough trains and buses to move its people. Its costly metro is underperforming – as late as Feb this year the fully operational metro lines were running at 33% capacity. The newest one was averaging 100 passengers per trip in trains with a capacity of 2,500.  Besides, closed trains won’t save the roughly 1,150 pedestrians who are killed every year while crossing Mumbai’s suburban tracks. A 2015 railway report blamed this on the shortage of overbridges. So, when it comes to suburban transport, Mumbai, and also other metropolises, need a lot more than patchwork. While netas love to talk up pod taxis, monorail and metro, there’s no substitute for commuter trains and buses. The real solution is to invest more in basic urban infra.\n\n",
        "headline_1": "Of doors & deaths",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/of-doors-deaths/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-06-2025"
    },
    {
        "full_article": "Written by: Rohit Saran\nVaranasi is a city that never dies – it’s one of world’s longest continually inhabited city. But it is also the city where thousands choose to die every year. This seemingly paradoxical pull has a deeper meaning. To choose a place to die is also, in some sense, to choose how to die – and that is as rare as it is profound. Most people spend their lives avoiding the thought of death. But in Varanasi, they walk toward it.\nHere, death isn’t feared – it is folded gently into the rhythm of daily life. At the riverbank, near the burning ghats, time itself seems to slow, even dissolve. And in the heart of the city stands a quiet building that turns this surrender into a ritual: Mukti Bhawan . It offers something both simple and extraordinary – a room for the dying. For those in the last days of life, it provides a place to rest, reflect, and await the end in dignity. No religion, caste, or age bar. Most stay no longer than two weeks. The lodging is free, or ₹20 a night for those who can pay. A caretaker is mandatory and stays without charge.\nSince 1999, Kalikant Dubey has been one of the people helping run the place. By his count, over 15,000 people have passed through Mukti Bhawan and found what he calls ‘mukti’. Of these, about 1,500 departures have happened in the past 12 years that he has been continually associated with the place.\n\nWhat distinguishes those last moments? What separates a peaceful passing from a restless one? Dubey’s answer is simple: “Those who have lived without regrets, leave without regrets.” Of course, a life entirely without regrets isn’t possible. But a regret-lite life is – it is possible to reduce the weight of regret by speaking fewer harsh words, taking fewer thoughtless actions, and acknowledging the harm we have done before it’s too late. It is not an easy task. “The human mind is like a mafia,” Dubey says. “It’s difficult to tame.” His advice: just 10 quiet minutes a day spent looking inward can help begin that taming. A life led with reflection is a life led with fewer regrets – and perhaps, in the end, to a more peaceful farewell.\nThe city that never dies might just be showing us how to die well – and in doing so, how to live better.\n\n",
        "headline_1": "City that never dies shows us how to die well",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/city-that-never-dies-shows-us-how-to-die-well/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-06-2025"
    },
    {
        "full_article": "Amid a rise in infections caused by new sub-variants of the coronavirus in some neighbouring countries, Bangladesh's health ministry has advised citizens to refrain from travelling to India and other affected nations unless absolutely necessary. According to Indian media, the country recently reported over 6,000 Covid cases within a 24-hour period. So far in 2025, India has reported 65 Covid-related deaths. Similarly, in the last week of May, Thailand recorded 65,880 new Covid cases and three fatalities. The number of cases in other Asian countries, including Indonesia, Singapore, and Malaysia, has also risen significantly.\nIn Bangladesh, although no significant surge in hospital admissions has been reported, health authorities have noted a slight uptick in flu-like symptoms and respiratory illnesses in urban areas. Experts have cautioned that low testing rates may be masking the true extent of community transmission, calling for enhanced monitoring.\nWith the World Health Organization announcing on May 28 that global SARS-CoV-2 activity has been increasing since February—reaching a test positivity rate of 11 percent, a level not seen since July 2024—and with cases rising in neighbouring regions, the time for caution has once again arrived. Although the world has somewhat adjusted to living with the virus, if the previous pandemic years have taught us anything, it is that overcoming Covid becomes easier with better preparedness.\nRaising awareness, therefore, is key, but it must be matched by swift and coordinated action from the authorities. The government must ensure an adequate supply of test kits, medical equipment, and vaccines. Reportedly, Covid test kits are currently unavailable in government hospitals. According to sources at the Expanded Programme on Immunisation (EPI) under the Directorate General of Health Services (DGHS), there are currently 3.1 million vaccine doses in stock, of which 1.7 million will expire by August. All this suggests that our Covid preparedness is once again at a poor level.\nNow that we know so much about the virus, there is really no excuse for failing to prevent another surge in Covid cases and fatalities. The government must ensure that adequate supplies are available at all public hospitals and health facilities. In addition, surveillance and risk communication activities must be strengthened at the International Health Regulations (IHR) desks in all land, sea, and airports for incoming travellers. The use of thermal scanners or digital handheld thermometers with non-contact techniques to measure body temperature must be ensured at all entry points, along with sufficient provision of masks, gloves, and personal protective equipment (PPE) for healthcare workers.\nThe DGHS has issued a set of guidelines to reduce the risk of contracting and transmitting the disease. Meanwhile, Dhaka metro rail authorities and the railway ministry have urged travellers to wear masks and abide by health guidelines. These infection prevention guidelines should continue to be disseminated to raise public awareness and help prevent the spread of the virus.\n",
        "headline_1": "Rising COVID cases in Asia should serve as a warning for us ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/rising-covid-cases-asia-should-serve-warning-us-3913996",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-06-2025"
    },
    {
        "full_article": "Some people get back together with their ex. Others get back on the medicinal health crisis bandwagon. Bangladesh, shockingly, chose the latter (the ex has been more than blocked—it's been banned, to be fair).\nBut yes, COVID is rising again—slowly, stealthily. Hospital admissions are creeping up, whispers of \"complications\" are floating around, and somewhere deep inside the health ministry, someone has just re-Googled, \"What is the difference between coronavirus and flu virus?\"\nThis, of course, is not our first viral rodeo. We've done this dance before—complete with mask mandates, panic-induced grocery shortages, and that unforgettable cameo by our former health minister, who somehow managed to combine the calm of a stampede with the clarity of expired cough syrup (read sarcasm, please). He may not have cured COVID, but he did cure the nation of taking him seriously.\nNow, here we are again. One foot in flu season, the other in full-blown déjà flu.\nTo be fair, the virus isn't back with the same drama. No lockdowns (yet), no sirens, no daily death tolls scrolling across your TV like the credits of a horror film. It's more of a soft launch, the dinner table story featuring only your hands, not the face. Like an indie sequel to a blockbuster we all hated but secretly watched out for, given morbid curiosity.\nAnd what are we doing to prepare? Mostly, recycling habits. Masks are back—on chins, only \"maskne.\" Sanitiser is back—in theory. And of course, we're back to hoping that this time, the government's response won't involve mysterious medical procurement deals and YouTube doctors suggesting turmeric as an immune booster.\nBut there is one noticeable change. This time, people are… tired. Bone-deep, eye-roll-heavy, can-we-just-not tired. We've seen the plot twists. We know how this goes. The rising numbers, the vague press briefings, the dramatic declaration of \"urgent precautions\" that somehow translates into a fogging machine and a photo-op.\nFor every Millennial reader, I see you, I hear you. It's just exhausting, I know. Half our 20s was eaten whole by pandemic, panic, lockdowns, recession, blackouts, protests, politics and the incredible doomscrolling of war memes (you know which). We just low-key want a fair shot at life without this dystopian world getting in the way.\nAnd yet, bizarrely, no one seems to be steering the ship. You know that moment at a wedding when the power goes out, the mic squeals, and everyone looks around pretending it's part of the programme because they're still not done with their firni? That's where we are now. Except instead of power failure, it's health preparedness. And instead of a mic, it's a nation-sized throat-clearing.\nBut here's the thing: we've been gifted a second chance. A re-run with spoilers. We already know what not to do—like announcing that infections are under control when we haven't tested anyone, or putting a committee together with the same efficiency one might use to assemble IKEA furniture without the manual.\nWe don't need miracle cures or motivational slogans this time. We need basic things: hospitals that are equipped, doctors that are protected, information that is accurate, and possibly a health minister who doesn't accidentally become a meme.\nLet's try something totally out of the box and totally novel. Let's learn from our mistakes. Let's assume that a virus does not, in fact, care about election timelines, district boundaries, floods, or whether we have an opening ceremony planned for a new overpass. Let's assume that health—drumroll, please!—matters.\nAnd while we're at it, maybe we, the public, can do better too. No more licking ice cream in air-conditioned malls and announcing, \"I don't believe in viruses,\" like it's a zodiac sign. No more WhatsApp forwards claiming ginger can cure variants. Just sensible decisions, a little less bravado, and a bit more brain.\nCOVID was never gone. It just went offline for updates. And if we've learnt anything at all in the last few years, it's that viruses don't wait for permission. They arrive uninvited and leave behind invoices.\nSo, this time, let's send them straight to voicemail. Let's not be the nation that fails twice in the same exam. Let's not look back in six months and say, \"We should have seen this coming.\" Because we did. We've already watched this movie. We know how it ends.\nLet's just hope, for once, we don't trip over the same plot hole.\nBarrister Noshin Nawal is an activist, feminist, and a columnist for The Daily Star. She can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The curious case of the déjà flu",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-curious-case-the-deja-flu-3911131",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-06-2025"
    },
    {
        "full_article": "I used to host a show for The Daily Star titled \"Straight From Star Newsroom.\" In it, our reporters elaborated and analysed the reports already printed in the newspaper, we broke down every detail for our readers. Reporters and I would work hard to make it engaging and informative. \nHowever, after each episode was posted on Facebook, almost every comment used to be regarding my appearance. Whether or not I was wearing an orna (scarf), what my or the female reporters' body measurement was, how we looked—these were the topics of discussion instead of the content itself.\nAs the digital age advances, cybercrimes, along with the myriad forms of violence against women, have become a serious issue globally, and Bangladesh is no exception. \nAmong the most vulnerable groups to online threats are women, who are often targeted in specific ways reflecting societal gender disparities. Access to the internet has increased steadily across the country, making women more exposed to online threats. This has sparked concern, not only for the safety of women but also for their mental and emotional well-being.\nEarlier this year, well-known actor Shabnam Faria was subjected to such online harassment as a worker of an NGO made inappropriate remarks on her Facebook post. The commenter, named Rakib, used the word \"beshya,\" meaning sex worker, as she stood next to cricketers for a photo op. \nThe NGO rightly launched an investigation when the actor complained on social media and eventually sacked the employee, setting an example.\nHowever, does the country's law protect women this way? And would other organisations follow suit? Would it happen if the victim were not a celebrity? \nA study by NETZ Bangladesh conducted last year reveals that 78 percent of women in Bangladesh have experienced technology-facilitated violence against women (TF-VAW). These attacks range from offensive comments on social media to explicit content being shared without consent, often leading to severe consequences for the victims.\nSuch harassment range from sexist or derogatory comments to unsolicited messages, and even threats of physical violence as well as sexual assault. Social media platforms such as Facebook, X, and Instagram have become breeding grounds for such abuse. Women, particularly those in the public eye, are often targeted with their privacy violated constantly. Harassment is often a tool of manipulation and control in an attempt to silence women, especially those involved in activism or public discourse. \nNowadays, the trend is to call a woman Shahbagi for protesting violence against women. Like a content creator recently said, it is akin to the historic \"burn the witches\" practice of persecuting and executing individuals, particularly women, because they spoke against patriarchy.\nCyberstalking, also a form of harassment, is another major issue. In many cases, women are followed and monitored by perpetrators who use technology to track their activities. This can lead to real-world consequences, including emotional distress and even physical harm. For the victims of such stalking, the sense of safety is eroded as their personal information is compromised and used against them.\nOne of the most harmful forms of cyber violence is the non-consensual sharing of intimate images or videos, commonly referred to as \"revenge porn.\" In Bangladesh, this form of abuse has been increasingly reported, often as a tactic of revenge or humiliation. Victims may face social ostracism, reputational damage, and severe emotional trauma. \nDespite the legal provisions in place to punish such actions, many victims find themselves powerless to pursue justice due to stigma and a lack of technological know-how within the law enforcement.\nChallenges\n\nA key issue is the lack of awareness about cybersecurity measures. Many women do not fully understand how to protect their personal information or recognise the signs of cyber threats. This knowledge gap is compounded by limited access to technology, especially in rural areas where digital literacy is still low.\nAdditionally, there is a prevailing reluctance to report cybercrimes. Many women fear the social consequences of coming forward. The cultural norms surrounding gender in Bangladesh often discourage women from speaking out about abuse, particularly if it involves sexual harassment or assault. As a result, a large percentage of cyberattacks on women go unreported, allowing perpetrators to continue their harmful behaviour without facing consequences.\nAnother major hurdle is the lack of robust legal frameworks to combat such crimes. Although Bangladesh passed the Digital Security Act in 2018, which aimed to regulate online content and protect individuals from cybercrimes, critics argue that the law was flawed and inadequate. The same can be said about the Cyber Security Act, 2023, and perhaps even the Cyber Security Ordinance, 2024. More often than not, the laws have been used to muzzle dissent and criminalise online expression rather than protect women from abuse. Moreover, law enforcement agencies often lack the necessary training to handle digital evidence and track cybercriminals effectively.\nInadequate effort \n\nThere have been efforts from both the government and organisations to combat cyberattacks on women in Bangladesh. Institutions such as the Bangladesh Association of Software and Information Services (BASIS) have been working to raise awareness about online safety and provide women with tools to protect themselves. These organisations offer workshops and online resources aimed at educating women on cybersecurity, digital rights, and how to report online abuse.\nAdditionally, social media platforms and tech companies have been under increasing pressure to take responsibility for online harassment. \nIn 2020, the government introduced a series of measures that required social media platforms to comply with local regulations regarding the removal of harmful content. While these measures have faced criticism for potential censorship, they also highlight the growing recognition of the need for stronger protections against cyberviolence.\nThe role of law enforcement is also evolving. In recent years, the Bangladesh Police have set up a dedicated cybercrime unit to address online crimes, including those targeting women. This unit works closely with digital forensics experts to investigate cybercrimes and bring perpetrators to justice. \nDespite these efforts, however, not much progress has been made in effectively combating cyber abuse against women in Bangladesh, as there is still a long way to go in terms of building public awareness and social responsibility.\nMany women remain unaware of their digital rights, and access to resources and support systems is still limited outside major urban areas. Awareness campaigns and workshops, while valuable, do not always reach those most vulnerable. Moreover, the social stigma surrounding online harassment discourages many victims from reporting incidents or seeking help.\nTech companies, despite pressure, have been slow to implement meaningful changes. Harmful content often remains online for extended periods before being removed, and reporting mechanisms on social media platforms are frequently ineffective. Many victims find themselves caught in bureaucratic loops with little resolution.\nLegal measures have also fallen short. While the government has introduced regulations, enforcement remains weak. Victims often face hurdles in filing complaints, and law enforcement responses are inconsistent. The dedicated cybercrime unit, though a step forward, struggles with underfunding, a lack of training, and a backlog of cases. \nOverall, cyberattacks on women in Bangladesh are a significant and growing issue that needs urgent attention. While there have been strides in improving awareness and legal frameworks, much more needs to be done to protect women from online abuse—or any abuse for that matter. \nNaziba Basher is a journalist at The Daily Star.\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "For how long must women endure cyberattacks?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/how-long-must-women-endure-cyberattacks-3913556",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-06-2025"
    },
    {
        "full_article": "As planned, the finance adviser to the interim government presented the national budget for FY2025-26 on Monday afternoon. And as anticipated, from the outset he highlighted the significant challenges his government has faced in stabilising the economy post-uprising, following widespread corruption and mismanagement under the now-ousted Awami League government.\nAlthough it is impractical to expect too much from a budget proposed by an interim government that may not be in place to see it through to the end, a few aspects of it are quite notable. For starters, the proposed outlay is nearly 1 percent lower than the Tk 797,000 crore allocated in the outgoing fiscal year—a clear departure from the trend of previous years. While the decrease in budget size is not particularly large, it signals the government's intent to tighten its belt in an effort to curb inflation.\n\nThe finance adviser has expressed the government's intention to shift from a growth-centric approach to a concept of holistic development. Accordingly, instead of focusing solely on traditional physical infrastructure, the budget prioritises the well-being of the people. This includes placing special emphasis on education, health, good governance, civic facilities, and employment.\nIn line with this approach, the government has proposed expanding import duty exemptions on pharmaceutical raw materials and medical equipment in the upcoming national budget. The allocation for the Ministry of Health and Family Welfare has also been slightly increased, from Tk 41,407 crore in the outgoing budget to Tk 41,902 crore in the proposed one.\n\nHowever, the allocation for the education sector remains below 1.6 percent of GDP, similar to what the outgoing budget formed under the Awami League government had provided, while being significantly short of the 4-6 percent of GDP recommended by the UNESCO. The interim government, being a non-political administration, had a rare opportunity to reset national priorities, but health and education—the two cornerstones of human development—have once again received inadequate attention.\nThe government has proposed an increase in both the number of beneficiaries and the per capita allocations under social safety net programmes in the proposed budget. However, when viewed in terms of GDP, spending on safety nets has actually decreased. What is positive, though, is the government's expressed intention to streamline social safety net spending—an encouraging development, as this could help reduce much of the wastage that occurred under various such schemes in the past.\n\nIt has been evident for some time that the government's fiscal space is shrinking, primarily due to low revenue collection. Acknowledging this, the government has outlined various revenue reforms that, if successfully implemented, could make a significant difference. Similarly, it has recognised the need for banking sector reforms and the recovery of a large portion of the stolen wealth. However, it has yet to provide details on how it plans to achieve such a monumental task.\nThe government has also allocated a Tk 405 crore fund for the rehabilitation of July warriors and the families of July victims, along with various other benefits for them. It goes without saying that the July uprising was at least partly driven by economic hardships, particularly those faced by the youth. With this in mind, the government has placed significant emphasis on young people and on generating employment opportunities. For example, the finance adviser has proposed a Tk 100 crore start-up fund in the budget to support emerging entrepreneurs. In addition, a substantial allocation has been set aside for women entrepreneurs, who will have easier access to loans without any collateral.\n\nMoreover, the government is set to launch a new initiative titled \"Tarunner Utshob,\" aiming to harness the power and potential of the country's young population by involving them more deeply in national development. Tk 100 crore has been allocated to celebrate this festival across the country. It is important to mention, however, that the government has not yet specified how this fund will be utilised, and we hope it will be transparent in this regard.\nThe agricultural sector has also been a focus of the budget, which is encouraging. To promote farming and meet the growing demand for food, the government has exempted up to Tk 5 lakh of annual income from agricultural activities from tax. In an effort to ease the burden on marginal farmers and suppliers, the government has proposed reducing the source tax on income from the supply of essential commodities—including paddy, rice, wheat, potato, jute, and tea leaves—to 0.5 percent from the next fiscal year. While this may not provide massive relief, it signals that the government is placing increased importance on the sector.\n\nAside from these, there have been three other notable proposals, including changes for the stock market such as widening the gap in corporate tax paid by listed and non-listed firms from 5 percentage points to 7.5 percentage points in order to encourage companies with good performance records to go public. The other proposals include raising the corporate tax rate for non-listed companies to 27.5 percent for the next two fiscal years, FY27 and FY28, thereby eliminating the existing concessionary rate of 25 percent; and incorporating homemakers' contribution in GDP calculations.\nWhile the budget may not be regarded as particularly radical, it contains several encouraging indicators. Nevertheless, the government must remain cognisant that achieving its revenue collection target could be challenging without significant reforms. And failure to meet this target may render the ambitiously low deficit goal of 3.6 percent unattainable.\n",
        "headline_1": "A transitional budget for troubled times",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/transitional-budget-troubled-times-3910011",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 11, 2025 00:00:00  \nThe provision of submitting Proof of Submission of (Tax) Return (PSR) as a prerequisite for accessing various services from the government departments and financial institutions incorporated by the National Board of Revenue (NBR) during the pre-interim government period still remains intact. Evidently, the idea behind this arrangement was to broaden tax coverage and ensure compliance from eligible taxpayers. In November last, the NBR made submission of PSR mandatory for accessing 43 services so that, as the head of the tax authority then told reporters at a briefing, the move would help increase the number of Taxpayer Identification Number (TIN) holders as well as income tax return submissions. So far 45 services have been brought under the mandatory PSR rule.\nHowever, in the proposed budget for the next fiscal year (FY 2025-26), the government has made some relaxations. At least 12 services would hence be exempted from the mandatory PSR-related formalities. Accordingly, submission of TIN certificate, not the entire tax return documentation, will be enough for anyone to avail of 12 services. The reason given for this change in the existing requirements for the said services is that the provision of submitting PSR proved to be unnecessary hurdles to delivering certain services. So, the 'illogical' requirements have been removed from delivery of those services. Notably, the services under consideration include, among others, renewal or issuance of a credit card, obtaining a trade licence under the city corporations and municipalities, getting an e-commerce business licence, gaining membership of various professional bodies, opening a post office savings account exceeding Tk500,000 and so on. \nClearly, the specific services exempted from mandatory PSR submission points to the fact that the argument of PSR-compliance to widen tax net and hence revenue collection was not essentially factual. In fact, compulsion in an overwhelming number of cases has proved ineffective simply because the NBR machinery is not up to the task. Evasion of tax by wealthy taxpayers is mostly facilitated by corrupt elements in the tax administration. Also, tougher rules and the attendant hassles and harassments have discouraged many potential taxpayers to obtain a TIN certificate in the first place. Unsurprisingly, Bangladesh's current tax-to-GDP ratio is 7.4 per cent---the lowest in South Asia with 12.5 per cent in India, 17.5 per cent in Nepal and 12.3 per cent in Bhutan.\nHowever, a 9.0 per cent (total projected revenue collection at Tk 4.99 trillion) rise in revenue collection has been projected in the FY26 budget, marking a 7.6 per cent increase over the revised target of the current fiscal year. Arguably, the NBR's departure from the PSR requirement for listed services implies that the philosophy of compliance to ensure better tax collection has undergone a qualitative shift. This is undoubtedly a move in the right direction. More than relieving the burden of supplying a pile of documents for securing a government service, the easing of PSR-related preconditions would go a long way in simplifying the revenue collection procedure. In that case, such streamlining of service delivery will not only be of help to recipients of services, but will also make the tax collection procedure more efficient and taxpayer-friendly. Hopefully, the government or for that matter the tax authority would rethink the entire strategy of service delivery in favour of a simpler and hassle-free procedure in the interest of taxpayers.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Simplifying NBR service delivery",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/simplifying-nbr-service-delivery-1749569966",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       June 11, 2025 00:00:00  \n\nWind power, with its immense capacity to generate clean, renewable energy, remains underutilised in Bangladesh's energy strategy. However, recent developments signal a shift in direction. A major offshore wind project, still in its early stages, was announced at COP28 as a collaborative initiative involving fashion brands Bestseller and H&M Group, Copenhagen Infrastructure Partners (CIP), and a local partner. This ambitious project seeks to advance sustainable energy solutions and reduce greenhouse gas emissions along the fashion industry's value chain.\nAccording to statements from the partners, the project aims not only to stabilise the supply of renewable energy to local apparel manufacturers linked to these global fashion giants but also to significantly cut emissions-by an estimated 725,000 tonnes annually. The fashion industry is a major contributor to global emissions, with more than 70 per cent arising from upstream power generation, which is still heavily reliant on non-renewable sources like coal, oil, and gas. This initiative envisions feeding energy generated from near-shore wind turbines to the national grid. With a projected capacity of 500 MW, the project aligns with Bangladesh's goal of reducing fossil fuel dependence, fostering job creation, and enhancing energy security.\nMore broadly, renewable energy sources such as wind and solar require greater attention. In the case of wind power, although initial installation costs are relatively higher, operational and maintenance expenses are much lower compared to traditional energy sources. Wind energy is harnessed from the natural movement of air caused by atmospheric pressure differences-an ancient concept that has been used for centuries. Wind results from uneven heating of the Earth's surface by the sun, influenced by rotation and geographical features. Warm air rises to form low-pressure zones, while cooler air creates high-pressure areas; air flows between these zones, producing what we experience as wind.\nHumans have long used wind as a resource-from traditional windmills grinding grain and pumping water to today's sophisticated wind turbines. Unlike fossil fuels, wind is inexhaustible and does not pollute the environment. Wind turbines generate electricity without releasing carbon dioxide or other harmful pollutants, making wind power one of the cleanest and most sustainable energy sources available. This positions it as a key component in global efforts to combat climate change and reduce carbon footprints.\nGlobally, wind power has already proven its viability. Denmark leads by example, with wind turbines providing nearly half of its electricity needs. Germany, the United States, and China have also made significant investments in wind energy. China, in particular, has the highest installed wind power capacity, while the U.S. continues to expand its offshore and onshore wind infrastructure. These countries demonstrate the practical and economic feasibility of wind energy and offer models for nations like Bangladesh to follow.\nHowever, wind power is not without challenges. A major concern is its intermittency-wind speeds can be unpredictable and vary by region and season. To counter this, countries are investing in advanced energy storage systems and smart grid technologies to ensure consistent electricity supply regardless of wind fluctuations.\nOffshore wind farms present several advantages over land-based installations. Wind speeds over water are typically stronger and more consistent, yielding higher energy outputs. Offshore projects also alleviate land-use pressures, as they do not compete with agricultural or residential land. Additionally, placing turbines near coastal urban centres reduces the need for extensive transmission infrastructure. For nations with long coastlines and growing energy needs, offshore wind represents a particularly attractive solution.\nInvesting in wind power also brings significant economic benefits. The sector creates employment opportunities across multiple fields, including manufacturing, construction, maintenance, and research and development. As global demand for renewable energy rises, the wind industry can become a powerful engine for job creation and economic growth. Moreover, increased reliance on domestically generated renewable energy reduces exposure to volatile global fossil fuel markets, enhancing national energy independence.\nThe integration of wind with other renewable sources-such as solar and hydro-can further strengthen energy systems. Hybrid setups that combine different sources ensure a more stable electricity supply. For example, during times of low wind, solar power can help bridge the gap. Such hybrid approaches are crucial for building resilient and flexible energy infrastructures, especially in regions facing climate-related uncertainties.\nIn light of the climate crisis, the urgency of transitioning to renewable energy has never been clearer. Wind power offers a viable, scalable, and environmentally sound alternative to fossil fuels. For Bangladesh, which is vulnerable to the impacts of climate change, prioritising wind energy could have far-reaching benefits not just in reducing emissions but also in securing long-term energy sustainability.\nTo fully realise this potential, policymakers must act decisively. This includes facilitating investments in wind infrastructure, streamlining regulatory approvals, supporting research and development, and creating incentives for private sector participation. The success of wind energy depends on a collaborative effort between government, industry, and civil society to embrace innovation and sustainable growth.\nHowever, for wind power to truly take root in the country's energy landscape, it must move beyond pilot projects and into the core of national energy planning. Only then can Bangladesh harness the full power of wind to build a cleaner, greener future.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The untapped potential  of wind power",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-untapped-potential-of-wind-power-1749570020",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 11, 2025 00:00:00  \n\n Navigating the tangled web of bureaucracy has become a recurring challenge for businesses across Bangladesh. Entrepreneurs often face lengthy delays in securing essential approvals such as business registrations, permits, and concessions. These administrative bottlenecks can result in missed contracts, lost investments and critical market opportunities slipping away.\nFor example, an export-oriented firm may lose a vital international order simply because customs clearance or certification processes fail to keep pace with the demands of global trade. Such inefficiencies not only hinder business growth but also damage Bangladesh's competitiveness on the international stage.\nMoreover, these regulatory hurdles discourage both local and foreign investors, who view procedural uncertainty and time loss as major risks. In a world where speed, innovation, and responsiveness determine success, Bangladesh cannot afford to fall behind due to bureaucratic inertia.\nMd. Zubaer Sarker\nDepartment of Marketing\nNorth South University\nDhaka, Bangladesh\nzubaer.sarker@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Regulatory roadblocks and bureaucratic delays",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/regulatory-roadblocks-and-bureaucratic-delays-1749570040",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 11, 2025 00:00:00  \n\nOn the eve of the Eid-ul-Adha, street child Fatema said, \"We don't even get to eat rice and lentils, how would we eat beef on Eid?\" Her words are not just a reflection of her own life, but echo the reality of millions of street children and hungry people in Bangladesh. While Eid is meant to be a celebration of joy and togetherness, for those living on the streets, it often brings only sorrow, hunger, and anxiety.\nAccording to the Street Situation in Bangladesh (2024), over 3.4 million children live on the streets across the country. In Dhaka alone, 350,000 street children grow up without parental care, affection, or protection (Human Appeal USA). Do the authorities or the privileged classes of our society ever pause to consider the Eid of these children?\nEid is not only about celebration-it is about sacrifice. Sacrificing in the name of Allah includes sharing with the less fortunate. On Eid-ul-Adha, instead of stocking our fridges with meat, we can bring joy to street children and the hungry by giving them a share of that very meat.\nThe issue goes beyond children. Hunger remains widespread in our country. A joint study by the government and the UN Food and Agriculture Organization reported that nearly 40 million people in Bangladesh faced hunger in 2016. More recently, according to the Bangladesh Bureau of Statistics Food Security Survey (2024), around 3.4 million people-about 2% of the population-still do not get even one full meal a day. These people, too, long to feel the joy of Eid. But where will that joy come from, when every day is a battle for survival?\nIt is our responsibility-whether as citizens, as members of the privileged class, or as national leaders-to extend the spirit of Eid to those in need. Let us each do what we can, from wherever we are, to bring smiles to the faces of the hungry, the poor, and the forgotten. Let us embrace street children--- just as we would our own--- not with pity but with warmth, offering food, kindness, and love.\nThe joy of Eid is not complete until it is shared. These people are our own-our brothers, sisters, and children. Let us ensure this holy Eid is a celebration for everyone.\nMofazzal Hossain (Shanto)\nStudent, European University of Bangladesh\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "May the joy of Eid fill every soul!",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/may-the-joy-of-eid-fill-every-soul-1749570059",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-06-2025"
    }
]