[
    {
        "full_article": "Ten years after he last visited Canada, Prime Minister Narendra Modi will travel to Kananaskis, Alberta, as a special invitee to the G-7 summit outreach (June 15-17), with some hopes that the invitation from Prime Minister Mark Carney will give the two countries a chance to reset bilateral ties. Mr. Carney’s call to Mr. Modi last Friday took many by surprise, as it appeared to come at the last-minute, and possibly after some back-channel calls to ensure neither side would be embarrassed by the outcome. Under fire for the invitation despite a pending trial against Indian government agents in Canada, Mr. Carney said, quite rightly, that India, as a major world economic force, deserves to be part of the G-7 outreach deliberations. Regardless of the reasoning, both the invitation and its acceptance indicate a desire on both sides to take India-Canada ties out of the present lows. In the past two years, after former Canadian Prime Minister Justin Trudeau went public with thus far unsubstantiated allegations that India was behind the assassination of Khalistani activist Hardeep Singh Nijjar, and was targeting other Canadian nationals, and RCMP officials even named Home Minister Amit Shah in the conspiracy, both countries have cut mission strengths down to a third. Canada suspended talks for a free trade agreement, while India temporarily stopped issuing visas to Canadians, citing persistent threats to Indian diplomats. Apart from considerable trade and investment, India and Canada are inextricably bound by their people — over 1.86 million are settled in Canada, but remain connected to India.Given the tough task ahead, teams preparing for the Carney-Modi meeting must work with the utmost sensitivity. While ties have nosedived since 2023, they have had a history of bad blood dating back to the 1970s, primarily over the Khalistan issue. It would be naive to imagine that these issues can be resolved in a summit, but a considered decision by both leaders to publicly show respect for each other’s positions is necessary. Returning the high commissioners and other diplomats to their posts is an imperative, along with a possible timeline for the restoration of trade talks. Speaking in Parliament, Mr. Carney said that Mr. Modi has agreed to a “law enforcement dialogue” where, no doubt, the Nijjar case and issues over Khalistani threats to Indian diplomats and community centres will come up, and the public messaging from the meeting will be the most important part of ensuring a path to improved relations. “Summit-level meetings” such as the one planned in Kananaskis can only open a door toward bettering ties; it is the necessarily tedious and painstaking talks behind the scenes that will actually allow the two countries to step through those doors and essay a different way of engaging each other. Published - June 12, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Canada\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        G7 summit\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        murder\n                    \n                            /                      \n                        \n                        trade policy",
        "headline_1": "​Bad blood: On India-Canada ties",
        "headline_2": "India and Canada must use every opportunity to reset ties",
        "link": "https://www.thehindu.com/opinion/editorial/bad-blood-on-india-canada-ties/article69683197.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "12-06-2025"
    },
    {
        "full_article": "‘Kashmir to Kanniyakumari’ is a figurative expression to denote the geographical expanse of India, from its northernmost point to its southern tip, and for the first time in history these are connected by rail. With the inauguration of the 272-kilometre Udhampur-Srinagar-Baramulla Rail Link (USBRL) project which has been 28 years in the making, the Kashmir Valley has been connected to the national rail network. The tough, unsurmountable topography of the Himalayas challenged the engineering capabilities of the Indian Railways, but it has come out with flying colours. The engineering marvel, the Chenab Rail Bridge, that stands 35 metres higher than the Eiffel Tower, is the world’s highest railway arch bridge at 359 metres above the riverbed. Spanning 1,315 m, it will endure wind speeds of up to 260 km per hour and has been built to last 120 years. Nearby, the Anji Khad Bridge, rises boldly across the rugged terrain as India’s first cable-stayed railway bridge. Towering 331 m above the riverbed and stretching 725 m across, it is anchored by 96 high-tensile cables; 8,200 metric tonnes of structural steel went into its construction. Built at a cost of ₹43,780 crore, the USBRL link witnessed drilling of mountains to set up 36 tunnels that span 119 kilometres and 943 bridges through ridges and mountain passes.Kashmir’s decades of geographical isolation have finally come to an end. The Vande Bharat Express between Srinagar in the Kashmir region and Katra in the Jammu region, which was also flagged off by Prime Minister Narendra Modi, cuts the surface journey to three hours between the two points. Later this year, a scheduled direct train service between the national capital New Delhi and Srinagar will allow commuters to touch base in just 13 hours compared to over 24 hours in the past. The Vande Bharat Express, a long-distance high-speed service, is bound to end the psychological barriers, multiply the development dividend and act as a game changer for the economy of Jammu and Kashmir (J&K). The train service has brought renewed hope to the region not long after the Pahalgam terror attack in April 2025 pushed India and Pakistan to a short conflict. India’s ‘Operation Sindoor’, against terror infrastructure across the border, saw Pakistan ending the ceasefire agreement and targeting civilians, leaving 18 dead and over 1,500 houses damaged. While inaugurating the train service in Katra, Mr. Modi rightly described the rail link as “a symbol of a new, empowered J&K”. The bridge will go a long way to bring the people of Kashmir closer to the rest of India.\r Published - June 12, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Jammu and Kashmir\n                    \n                            /                      \n                        \n                        indian railways\n                    \n                            /                      \n                        \n                        railway\n                    \n                            /                      \n                        \n                        mountains\n                    \n                            /                      \n                        \n                        engineering\n                    \n                            /                      \n                        \n                        geography\n                    \n                            /                      \n                        \n                        rivers\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        France\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        India-Pakistan",
        "headline_1": "​Connecting bridge: On the Chenab Rail Bridge",
        "headline_2": "The rail link will bring Kashmir closer to the rest of India",
        "link": "https://www.thehindu.com/opinion/editorial/connecting-bridge-on-kashmir-india-and-the-chenab-rail-bridge/article69683163.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "12-06-2025"
    },
    {
        "full_article": "Dependence in critical areas makes the nation vulnerable. Strategic interest must prevail over economic sense\nGermany’s crude reserves are so small, they won’t last three months in an emergency. So how did Hitler wage war for five years? By turning coal into petrol. Over 92% of the Luftwaffe’s aviation fuel was synthetic. As the world grapples with China’s rare earth curbs, there’s a useful lesson here. \nWhile the rare earths crisis that started with China’s export curbs on April 4 may be blowing over – Trump announced on Truth Social yesterday, “Full magnets, and any necessary rare earths, will be supplied, up front, by China” – it will have a once-bitten-twice-shy effect. Over the past few weeks, Western carmakers have considered producing cars minus some components that use rare earths. At home, Maruti’s had to scale back production plans for its first EV due to a global shortage of rare earth magnets. As our second Op-Ed explains, these magnets contain about 25% of a rare earth element called neodymium. It’s one of the so-called ‘light’ rare earths that are available in India, but we don’t produce enough of it because cheap Chinese supplies made investment in this area unattractive. \nWhile you can make motors without rare earths, other devices like TV screens, computers and MRI machines can’t do without them. That’s why India needs to build a large rare earths industry. And with the world’s fifth largest rare earth reserves, it’s well-placed to do so. Likewise, it needs to end its dependence on China for 70% of active pharmaceutical ingredients or APIs, because while buying from the cheapest supplier makes economic sense, it’s a strategic risk.\nThe aim must be to reduce dependence because dependence, especially in critical products, is vulnerability. About 90% of our crude is imported. An electric future will take care of that, but not if it means 100% dependence on China for lithium batteries. To find alternatives – like Germany’s WW-II ‘synfuels’ – we need big investments in R&D, which is not our strong suit. As a nation, we invest only 0.6% of our $4tn GDP in research. China invests 2.4% of $18tn, US 3.5% of $29tn. And our private sector is even stingier, accounting for only a third of the national R&D spend, as against 70% in US and S Korea. The rare earth crisis is a brief distraction, the real issue is India’s rare investment problem, and it needs national attention now.\n\n",
        "headline_1": "R&D? Rarely",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/rd-rarely/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-06-2025"
    },
    {
        "full_article": "The kids are CUETing, the parents are sweating\n“Room hi room. Wifi free. Only 300.” As sweat dripped down my brow, one bead at a time, I weighed the offer. The ‘room hi room’ guy had competition, and the price tanked as I walked on…Rs150, Rs100. Village Sawda in north-west Delhi’s Ghewra may not have resort-like rooms or a view to rival Greece’s Santorini but it certainly had entrepreneurs to match Silicon Valley’s. Someone had built a building and stuffed it with computers in the middle of wheat fields. NTA had anointed it as a test centre and set the money-making juices flowing.\nAs parents from across the city landed – Rohtak Road was dotted with moon craters – with CUET aspirants in tow, all manner of services were on offer. Along a narrow road, someone had set up a rickety table with a computer-printer combo offering instant printouts and an ink pad to stamp your left thumb on the card – who said angootha chaap’s dead? Another, on a PA system, warned students not to be misled, advising them to leave their belongings at the authorised – obviously meaning his – set of lockers. Open spaces meant for grazing cattle had been converted into parking for Rs 50 a pop with one guy offering car wash services including “rubbing greece”.\nTo beat the heat, there was a cold drink stand that had emerged out of nowhere (displaying better humint than our RAW guys in China), chole-kulche and a Madhur Dairy ice cream cart, which having lived in the shadow of its more famous cousin, was enjoying its moment in the blazing sun.\n‘Room hi room’ guy looked at me like a shark eyes its prey. It had been an hour and he could tell I’d gulped down a lot of water in my anxiety. I eyed the “REST ROOM wifi free” sign, centering my thoughts around washroom & wifi. Shark in water wasn’t the best metaphor at that moment. Sharks typically do not eat humans but more significantly, thinking of water was perilous in my pressing condition. I peeked inside the room and spotted a cooler and four thin mattresses. Seven people had already plonked themselves down, having struck a deal for Rs 50 each. I paid up too. Later I found the cooler didn’t work. Hopes dashed, I decided to abandon all expectation and wait out the miserable afternoon in the hot, humid room praying the exam taker – my child – was displaying better common sense than I had.\n\n",
        "headline_1": "Very, very testing",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/very-very-testing/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-06-2025"
    },
    {
        "full_article": "A big part of fertility decline is rising cost of raising a child. Govts’ baby bonuses hardly suffice\nYes, Indians are having fewer kids. Yes, this trend has enormous social and economic implications. No, it isn’t women’s fault! So many Unclejis and Auntyjis take all their grump out on today’s women wallowing in more self-indulgence than yesterday’s. If by this they mean that a woman now has more reproductive agency, instead of helplessly bearing as many children as her husband or in-laws tell her to, yeah, that’s welcome progress towards equality and freedom of choice. Further, as UN’s The Real Fertility Crisis report highlights, parenthood aspirations have been changing for both men and women. When asked what factors have led or are likely to lead them to have fewer children than they initially desired, a high 38% Indian respondents named financial limitations. \nGovts across the world like to scold their citizens for not having more children. There is a deep irrationality to this. Surely if blame’s to be thrown, it should be at govts themselves, for failing to create the economic security that’s a precondition for citizens realising their family formation goals. In US, the annual cost of raising a child goes from $16K in Mississippi to $36K in Massachusetts. China, crazily, can be even more expensive. In India, a Logic Stick study has ranged the cost of raising a child to 18 years between ₹30L and ₹1.2cr. Some of the cost increases can be put to cultural change, an intensification of parenting. But there are also broader inflationary pressures across education, healthcare and housing. Plus, there is job insecurity or unemployment. As many as 21% Indians said this is a barrier to having children, compared to 5% Swedes. \nApart from chastising citizens, the other thing govts like to do is bribe them, or try to. Financial incentives to boost fertility end up failing everywhere everytime. Baby bonuses can’t make up for the deficits in parents’ earning potential, family-friendly work policies, schools & childcare. Choosing to have a child, however, is hardly just a utilitarian, economic decision. It’s also about love, joy, hope of a better tomorrow. Fertility rises when hope does.\n\n",
        "headline_1": "Baby, Baby",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/baby-baby-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-06-2025"
    },
    {
        "full_article": "The weaponisation of a commonly used mark of punctuation, and how best to counter it \nThe minister of Punctuation, Propaganda, and Fake News was addressing his aides and assorted flunkies. There is good news and there is bad news, said the minister. First, the good news. The good news is that our Operation Hyphen worked even better than we anticipated. \nThe terror attack we masterminded triggered an inevitable response from The Adversary who promptly launched multiple strikes against the terrorist training camps we’ve established. \nSo far so good, said the minister, while his aides and assorted flunkies nodded in obsequious agreement. \nWith the escalation of hostilities which we so cunningly had provoked, international attention, not to mention alarm, got focused on the face-off between us and the adversary, as we had planned, said the minister. \nThis was the good news, he continued. Our Operation Hyphen was crowned with success because in the eyes of the international community we and the adversary got re-hyphenated. \nOr, to be more precise, clarified the minister, we and the adversary got re-re-hyphenated, after having been repeatedly de-de-hyphenated. \nThe hyphen, explained the minister, which is not to be confused with the N dash or the M dash, or the minus sign which it resembles, is one heck of a juju of a punctuation mark. Its name derives from the Greek ‘Huphen’, which in late Latin became ‘hyphen’ and means ‘together’. \nThe first recorded use of the hyphen to join two words, and by implication, give them equal value or status was by Dionysus Thrax, the great Greek grammarian (170-90BC), pronounced the minister. \nThanks to the hyphen we got equated with The Adversary, even though we are a bankrupt military dictatorship and The Adversary is the world’s most populous democracy and the fifth-largest economy to boot, he gloated. \nThat’s good news, he said. Unfortunately, he continued, the bad news is that The Adversary has made it abundantly clear to all concerned that to counter our hyphen, if necessary it is ready to come up with an even bigger juju of a punctuation mark: the Full Stop… \n\n",
        "headline_1": "Hyphen-hype",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/hyphen-hype/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-06-2025"
    },
    {
        "full_article": "It is troubling to learn of some recent incidents of harassment and obstruction faced by tourists in Sylhet. While such incidents in tourist spots are nothing new, the latest development brought two issues to the fore: growing tension surrounding unregulated mass tourism, and the disturbing role played by religious actors in it. According to our report, people visiting the Utmachhara tourist spot in Companiganj on Sunday (the first day of Eid) were asked to leave by members of the Companiganj unit of Jubo Jamiat, the youth wing of Jamiat Ulema-e-Islam Bangladesh. In a video that has since gone viral, the group members are heard telling visitors of a local decision to bar tourism due to alleged \"immoral activities\" like drinking and indecent behaviour. The following day, a scuffle broke out between some locals and tourists near the Jaflong BGB camp, although no injuries were reported.\n\nThese issues demand critical reflection as mass tourism continues to boom in Bangladesh. There is clearly a fine line to walk here. First of all, tourism is vital for the local economy as it creates employment and supports small businesses. But with too many people rushing to the beauty spots accessible in a small country like Bangladesh, unregulated tourism can be hugely disruptive. We, therefore, must find a way to make this sustainable.\nThese incidents illustrate how mass tourism can sometimes overwhelm local communities. Complaints about environmental degradation, littering, and disruptive behaviour by visitors are natural in areas where tourist footfall has surged without adequate infrastructure or enforcement of behavioural norms. This creates resentment among locals, who may feel their culture and environment are being disrespected or exploited. But imposing restrictions on tourism—instead of seeking constructive solutions through regulation, education, or improved civic oversight—sets a dangerous precedent. What makes this especially alarming is the involvement of religious groups. While their concerns are shared by many in local communities, their actions—policing public behaviour and dictating who can access shared natural resources—undermine both the rule of law and the inclusive spirit of tourism.\nThese issues demand critical reflection as mass tourism continues to boom in Bangladesh. There is clearly a fine line to walk here. First of all, tourism is vital for the local economy as it creates employment and supports small businesses. But with too many people rushing to the beauty spots accessible in a small country like Bangladesh, unregulated tourism can be hugely disruptive. We, therefore, must find a way to make this sustainable. Part of the reason for the unregulated mass tourism in Bangladesh is its unregulated development—we cannot address one without addressing the other. Other issues underscored by recent trends involve safety both on the roads and while at the tourist spots. There have been reports of road crashes, criminal activities, and drowning as holidaymakers move to different locations, including Cox's Bazar, which has seen a huge footfall this holiday.\nClearly, to make tourism safe and sustainable, we need to address the persistent lack of safety infrastructure, enforcement of rules, and coordination among all stakeholders. Ensuring community voices are heard while also defending the right to safe and responsible tourism must be the priority. This calls for a comprehensive tourism policy that not only fosters economic opportunities but also protects local culture, the environment, and the safety of tourists. The government may also consider decentralising tourism by investing in new destinations to reduce pressure on existing hotspots. The rise in tourist numbers during holidays is welcome, but without proactive planning and inclusive governance, such growth will only bring more chaos. On their part, Sylhet local administrations must also prevent a repeat of what happened recently and hold to account anyone obstructing tourists.\n",
        "headline_1": "Make tourism safe and sustainable",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/make-tourism-safe-and-sustainable-3915091",
        "news_paper_name": "The Daily Star",
        "publish_date": "12-06-2025"
    },
    {
        "full_article": "Sumon runs a small tea stall. Every morning, he wades through ankle-deep plastic waste—a growing pile of discarded bottles, wrappers, and bags that clog the drains around his shop. \"When it rains, the market floods because the drains are blocked with plastic,\" he says. \"Business drops, and so does our hope for a cleaner place.\"\nWhile cities like Dhaka and Chattogram often dominate discussions on plastic pollution, the rural and peri-urban areas of Bangladesh bear a silent but severe brunt. In rural Bangladesh, plastic waste infiltrates rivers, irrigation channels, and croplands, disrupting daily life and livelihoods. Yet, this reality rarely garners attention.\nIt is believed that Bangladesh produces approximately 87,000 tonnes of single-use plastic waste each year, and nearly 22 percent of this originates from rural areas. There is a notable lack of awareness regarding the environmental and health risks associated with plastic waste in rural areas. For instance, only 5.5 percent of rural consumers are aware of the health risks posed by single-use plastics, compared to 18.4 percent in urban areas. These facts highlight that plastic pollution is not solely an urban issue.\nOf the plastic waste generated in Bangladesh, only 36 percent is recycled, leaving the rest to accumulate in open dumps, water bodies, and agricultural lands, exacerbating waterlogging and soil degradation. In rural areas, plastic waste mixed with crop residues blocks irrigation channels, starving crops of vital water flow. Additionally, plastic debris gathers around sluice gates, worsening persistent waterlogging.\nFor local farmers and traders, these seemingly small disruptions add up, impacting both their income and the local ecosystem. The impacts are further compounded by the surge in single-use plastics. Despite a ban on plastic bags in 2002, single-use plastic consumption has increased by 200 percent over the last decade, with rural areas increasingly bearing the consequences.\nThe government's National 3R Strategy was a step towards tackling the plastic menace through reducing, reusing, and recycling waste. However, its implementation at the grassroots level remains largely on paper. Local government institutions, particularly union parishads and municipalities, are supposed to lead the charge in managing plastic waste. But resource constraints, limited technical capacity, and a lack of structured waste management plans hinder their effectiveness.\nDespite these challenges, small-scale initiatives in Bangladesh are emerging as potential game changers. The informal sector collects around 1,000 tonnes of plastic waste daily, significantly contributing to recycling efforts. However, the lack of formal recognition and support limits their impact. We are seeing the private sector also stepping into this domain. In Dhaka, for instance, Standard Chartered Bank launched a plastic exchange programme, allowing community members to trade plastic waste for cash or essentials. Replicating this initiative in rural areas could motivate grassroots communities to engage in waste collection while creating local income opportunities. Encouragingly, a number of development platforms are working with the private sector. They are collaborating to establish and institutionalise market-centric collection hubs for plastic waste, incentivising traders to segregate and deposit waste for recycling. Such initiatives show how grassroots engagement can foster a culture of environmental responsibility, even in areas with limited waste management infrastructure.\nBut to effectively tackle the long-standing plastic pollution situation in rural and peri-urban areas, a few good examples are not enough; we need collective efforts and mutually benefitting strategies. First, local governments need targeted support to incorporate plastic waste management into local development plans. Waste segregation at the source, coupled with community-based recycling hubs, can lay the groundwork for more structured waste management systems.\nSecond, engaging local entrepreneurs in waste recycling can transform plastic from a pollutant into a resource. With technical training and seed funding, they could establish small recycling units that create useful products like eco-bricks or compost bins. In Indonesia, fishing villages have turned to innovative solutions like eco-bricks—plastic bottles filled with non-biodegradable waste used as building materials to manage plastic waste effectively. These initiatives highlight the potential of local actions in combating plastic pollution.\nThird, educational programmes in schools and community centres can instil sustainable habits from an early age, reinforcing the principles of Reduce, Reuse, and Recycle. In Cox's Bazar, school collection systems have already been set up to teach children about waste segregation and composting, showing how early intervention can cultivate lasting environmental responsibility. Covering two climate hotspots—Naogaon and Satkhira—the WaterAid–Swisscontact consortium has engaged school-level students in clean-up campaigns, waste segregation activities, and educational programmes to instil sustainable waste practices.\nLastly, public-private partnerships must be leveraged to provide the necessary infrastructure and incentives for waste management. One example is Practical Action's initiative in Faridpur, where a circular economy approach is employed to transform previously unprofitable waste into valuable commodities. In this initiative, low-grade plastics collected from the Padma River and local communities are processed using pyrolysis technology, converting them into high-grade oil and black carbon, thus creating employment opportunities and improving waste workers' livelihoods.\nWe must keep in mind that the fight against plastic pollution extends far beyond urban centres. The crowded markets of a remote union in the south and the irrigation fields of the north are not just bearing the brunt of plastic pollution; they are also fertile grounds for solutions. With the right support, rural communities can transform from passive victims to active change-makers, driving localised recycling initiatives, championing waste reduction, and adopting sustainable practices.\nSaief Manzoor-Al-Islam and Sabbir Rahman Khan are development practitioners.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The silent plastic crisis in rural Bangladesh",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-silent-plastic-crisis-rural-bangladesh-3914546",
        "news_paper_name": "The Daily Star",
        "publish_date": "12-06-2025"
    },
    {
        "full_article": "With the Rohingya crisis in Myanmar showing no signs of ending and the repatriation process in Bangladesh at a standstill, it is concerning that only 19 percent of the fund required for Rohingya refugees this year has been secured even after the passing of five months. Reportedly, a total of $934 million is needed to support 1.5 million people—1.2 million Rohingya and 300,000 members of the host community—but only $180 million has been received.\n\nThis gap, largely due to the suspension of US funding, will further strain conditions in the camps, making it harder for the refugees to access essential services such as education and healthcare. Dozens of projects, including those related to health, family planning, nutrition, and education, have already been affected by the cuts. Humanitarian organisations warn that the situation will further deteriorate unless funds are urgently released.\n\nAn example of the refugees' shrinking access to healthcare is that the number of general patients seeking treatment in camps dropped from 372,000 in February to 205,000 in April. Many are having to pay for doctors themselves in serious cases, which is not possible for everyone. The funding cut has also severely impacted education, putting the future of 230,000 Rohingya children in Cox's Bazar—and the livelihoods of hundreds of terminated teachers from the host community—at risk. Since these learning centres also serve as protection spaces for the children, their closure poses serious safety risks.\n\nMoreover, the scarcity of shelter has worsened with the onset of the monsoon rains, which have already damaged many homes. It has become extremely difficult to provide shelter and basic services to the 150,000 Rohingya people who have fled to Bangladesh in recent months. According to a WFP update, 50,000 more may arrive by the end of the year, raising further concerns. Without access to basic services, refugees may flee the camps and embark on risky journeys to foreign lands in desperation. Criminal activities in and around the camps may also increase, and gender-based violence could rise, leaving victims without support or psychological counselling.\n\nAccording to a UN official, there is only enough food to support the Rohingya until October, which is deeply alarming. Access to food, education, and healthcare is a fundamental human right and must not be denied. We urge the international community not to forget the plight of the Rohingya and to come forward with aid. The interim government, led by Professor Yunus, must leverage its capacity to secure necessary assistance from global sources. Additionally, the authorities must ensure that all aid received is utilised efficiently and without waste.\n",
        "headline_1": "A humanitarian crisis worsened by fund crunch",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/humanitarian-crisis-worsened-fund-crunch-3914326",
        "news_paper_name": "The Daily Star",
        "publish_date": "12-06-2025"
    },
    {
        "full_article": "It is disheartening that at a time when the nation is supposedly enjoying press freedom and freedom of speech, journalists continue to face violence, intimidation, and legal harassment. The latest figures provided by the Human Rights Support Society (HRSS) paint a grim picture, revealing that at least 91 journalists were harassed, assaulted, or intimidated in May—more than double the number documented by HRSS in April. Among the victims, 33 were physically assaulted, seven received threats, and three were arrested. Moreover, 48 journalists were implicated in various cases. While no one is above the law, these cases and arrests seem to mask retaliation and exploitation as legal action, sharing similarities with past instances of journalists being targeted through dubious charges over the July atrocities.\nIn recent weeks, we have repeatedly commented on this disturbing legal trend. Victims of such dubious and exploitative cases include not just journalists but also individuals from all other professions, such as businessmen, lawyers, teachers, media personalities, etc. The stories of a grocer falsely declared dead in a murder case and a 69-year-old former professor sent to jail in connection with an attempted murder case highlighted how far the rot has reached. Another example reported in mid-May saw 26 journalists, along with others, being implicated in an attempted murder case filed by a pro-BNP lawyer in Chattogram. This case had ill intent written all over it, with little evidence or corroboration from either police or the accused, many of whom denied the charges or even being present at the scene of the alleged crime. Unfortunately, such cases continue to be filed or acted upon with frightening regularity.\nAccording to an investigative report published by this daily on May 3, at least 266 journalists had been implicated in various criminal cases related to the July uprising as of that time. Such legal assaults not only endanger journalists and undermine press freedom, but also violate the public's constitutional right to access information. Their continuation, we must add, casts a dark shadow over the interim government's commitment to uphold press freedom.\nSo we again urge the authorities to take all necessary steps to ensure that journalists are protected from retaliatory cases as well as from physical violence and intimidation. The same applies to other victims of rights violations, such as those who have suffered from mob violence, rape and sexual abuse, political violence, and labour exploitation—all of which, according to HRSS data, reached worrying levels in May. These too are serious rights violations that demand urgent redress.\nThat said, the government alone cannot fix this state of affairs. Political parties, too, must do their part by strictly disciplining their members who engage in violence or inflammatory rhetoric that increases risks for the vulnerable segments of society. The BNP, in particular, must show greater leadership in controlling its errant activists and leaders. This is especially crucial as the country moves towards a long-awaited democratic transition through elections.\n",
        "headline_1": "Protect journalists from retaliatory abuse",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/protect-journalists-retaliatory-abuse-3910956",
        "news_paper_name": "The Daily Star",
        "publish_date": "12-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 12, 2025 00:00:00  \nFestival time is cherished because of escape from the drudgery or monotonous routine life. But it is also a time when mass movement of holidaymakers takes place. When the rush of people is overwhelming, there is always some apprehension of road accidents, given the systemic weakness in traffic management in this country. But the long holidays during the two Eid festivals this year have substantially eased the passengers' pressure off. Although no single major accident involving death of many people was reported, the number of road fatalities during the past six days starting from June 5 was reportedly no fewer than 40. Apart from turning the joyous occasion into a tragic one for the families of road-accident victims, there were similar disasters for families where their members opted for suicide because of extreme poverty. Two fathers also died while trying to save their drowning son and daughter in separate incidents -- one in Moulvibazar and another at Cox's Bazar sea beach. To add to the tragedy, a pilot of Biman Bangladesh Airlines and the managing director of TEAM Group, a leading apparel manufacturer, died by drowning following capsize of the canoe they were riding. However, the accident took place in a distant land -- Canada. \nWhat follows from all these tragic deaths is that some of those are avoidable and others are not. Even a few of the tragic occurrences that apparently look like unavoidable can provide a new insight if they are given a closer scrutiny. For example, the death of the Biman pilot and his friend, an apparel businessman, could be avoided if they did not ignore the basic rule of wearing life jacket before boarding the canoe. In case of road accidents in Bangladesh, investigation does not pinpoint the avoidability. Right now, the reports carried in the print media and aired by the electronic media have pointed accusing fingers at rash driving for the head-on collisions between vehicles or one going off-track to hit a roadside tree or fall into a ditch.\nIndeed, rash driving may be a cause of a few of the accidents. But a closer look may identify some other causes ingrained in a flawed system. In time of festival, the number of drivers does not increase suddenly, but the number of buses does. Many of these are old and unfit but those are readied by applying a fresh coat of paint to give them a new look. They are potentially hazardous and when inexperienced drivers are saddled to the steering wheel, chances of accidents are sure to be higher. Even seasoned drivers are not immune to accidents if they are not allowed to take enough rest before they are compelled to carry on their long haul duty. \nIt is not just in rush time during festivals, drivers of most of the long route bus services do not get enough rest but also in normal time they are overworked and get tired and drowsy. Mechanical failure at times cannot be avoided even if maintenance is up to date. But when buses are more than 20 years old and should be dumped into the junk yard and yet no action is taken or the authorities succumb to organised pressure against any such corrective action, the inevitable happens. When people get killed in accidents involving such vehicles, this is plain murder. That life is precious is forgotten here and this is why such irregularities can prevail. The interim government has evidently missed the chance of streamlining the transportation system.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Death in time of festival",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/death-in-time-of-festival-1749655794",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       June 12, 2025 00:00:00  \n\nAfter three gruelling years of the COVID-19 pandemic, which claimed over seven million lives globally and caused unprecedented disruption to international trade, it was widely believed that the pandemic had gone, thanks to mass vaccination campaigns and growing natural immunity. However, far from disappearing, SARS-CoV-2 has once again mutated, this time into a new variant known as NB.1.8.1. This strain is driving a rise in infections across China, the United States, India, and several other countries, sparking renewed public concern. While the current level of infections and severity is not yet a cause for widespread alarm, the resurgence serves as a stark reminder that the virus continues to evolve and spread. It warrants continued vigilance and proactive public health measures to prevent a resurgence of the deadly virus.\nThe symptoms associated with NB.1.8.1 closely mirror those of earlier variants, presenting a range of common manifestations such as fever, cough, chills, nausea, shortness of breath, congestion, diarrhea, headache, fatigue, and loss of taste or smell. While initial observations from countries where cases have been reported suggest that this variant does not appear to cause more severe disease, its genetic makeup is a cause for concern. Specifically, NB.1.8.1 is equipped with changes that allow it to infect cells more efficiently, implying a higher potential for easier and wider transmission among people.\nThe World Health Organization (WHO) has classified NB.1.8.1 as a \"variant under monitoring\" due to its mutations and international spread. Although it has been identified in 22 countries, no travel restrictions have been imposed by any country. On June 4, the Institute of Epidemiology, Disease Control And Research (IEDCR) of the Ministry of Health warned of a potential risk of COVID-19 spreading to Bangladesh, as cases continue to rise in neighbouring countries. Health Ministry has advised citizens to avoid travelling to India and other affected countries unless absolutely essential. Indian media reports that India recently recorded over 6,000 new COVID-19 cases within a 24-hour period, with a total of 65 COVID-related deaths reported so far in 2025. In a similar trend, Thailand confirmed 65,880 new cases and three fatalities in the last week of May. Other Asian countries-such as Indonesia, Singapore, and Malaysia-have also seen a significant surge in COVID-19 cases.\nThe outbreak has been on the rise in Bangladesh since May. Of late, researchers at the ICDDR,B have also identified two new SARS-CoV-2 Omicron subvariants, XFG and XFC, in Bangladesh, with health authorities noting a gradual rise in COVID-19 positivity in recent months. These subvariants are descendants of the JN.1 lineage and were first identified at Chattogram Medical College Hospital in April 2025. Although the overall number of infections remains low, the ICDDR,B considers the recent increase significant, given the near-zero infection rate earlier this year. In recent months, urban areas have seen a sharp increase in flu-like symptoms and respiratory illnesses. Experts warn that low testing rates may be obscuring the true extent of community transmission and have called for strengthened surveillance and monitoring.\nThe world has largely adapted to living with the virus, but past experience with the pandemic has shown that complacency can be costly. Effective preparedness, including, mask-wearing, timely testing, isolation, robust healthcare systems, vaccination and public cooperation, are essential to mitigating the impact of the potential surge due to the new variants. The government is ratcheting up public awareness campaigns aimed at curbing the spread of the virus. Eid-returnee passengers as well as metro rail passengers have been asked to wear masks. Sick and elderly people have been advised to avoid crowded areas. And the Education Ministry has issued directives to educational institutions, emphasising the need for students, teachers, and guardians to adhere strictly to health guidelines. \nWhile these efforts are necessary, experience has repeatedly shown that awareness campaigns alone are often insufficient once the infection has begun to spread widely within the community. A more comprehensive and proactive approach like a renewed vaccination campaign may be necessary to contain the resurgence of the virus effectively. The WHO says that existing COVID-19 vaccines are expected to remain effective in preventing both symptomatic and severe illness caused by this variant as NB.1.8.1 is a part of the Omicron family. Therefore, individuals who have received initial doses are advised to complete their vaccination series with second, third, and even fourth doses as recommended. Specifically, vaccination is recommended for individuals over 60, those over 18 with weak immune systems, pregnant women, healthcare workers, and people suffering from various pre-existing conditions. Medical experts underscore the critical importance of vaccination for the elderly and those with chronic diseases as the outbreak intensifies.\nHowever, due to the currently low perceived risk of COVID-19, public interest in vaccination remains alarmingly low. Between January 1 and March 8, only 43 individuals received a COVID-19 vaccine-most of them travellers who required it for international trips. While raising public awareness about the importance of vaccination is critical, the government must also ensure the availability of test kits, medical equipment, and vaccines. Reports indicate that COVID-19 test kits are currently unavailable in government hospitals. Meanwhile, according to the Expanded Programme on Immunisation (EPI) under the Directorate General of Health Services (DGHS), 3.1 million vaccine doses are in stock, with 1.7 million set to expire by August. There is also a shortage of test kits. Taken together these issues point to a concerning lack of preparedness.\nThe emergence of NB.1.8.1 and other Omicron subvariants serves as a reminder that COVID-19 has not vanished; it has just evolved. While the world may be better prepared today than it was in 2020, the fight against the virus is far from over. Without a proactive public health response, including stronger vaccination efforts and improved healthcare readiness, the country risks repeating past mistakes.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Is Bangladesh prepared for another COVID wave?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/is-bangladesh-prepared-for-another-covid-wave-1749655874",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 12, 2025 00:00:00  \n\nAs Artificial Intelligence (AI) increasingly integrates into public infrastructure, especially surveillance systems, a critical tension arises: How do we balance public safety with personal privacy and civil liberties? \nThe government and law enforcement use AI for crime prevention, crowd monitoring, and facial recognition systems to enhance security and emergency response, all the while raising serious ethical, legal, and social concerns. China's Social Credit System, which rewards or penalises citizens based on their behaviour, utilises AI surveillance to prevent crime and terrorism. However, constant monitoring can erode individual privacy.\nIn other contexts, AI expedites police investigations and improves response time. This approach, especially the facial recognition technology in London's CCTV cameras, has provoked a public outcry over privacy violations and due process. In response to similar concerns, using facial recognition by law enforcement is banned in cities like San Fransisco-- citing its potential to infringe on civil liberties. AI can reduce bias by using data instead of human judgment, but it often inherits biases from its training data, resulting in unfair targeting. AI surveillance also protects vulnerable environments like schools and hospitals yet normalises a \"surveillance state,\" making citizens feel constantly observed.\nThe surveillance versus safety dilemma highlights a fundamental challenge of AI: using technology to protect society without undermining freedoms and rights. The answer isn't a complete rejection of AI surveillance; it's ensuring that technology is transparent, fair, accountable, and centered on human values.\nTanjim Bin Noor\nBachelor of Business Administration\nNorth South University\ntanjim.noor@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Surveillance vs. safety dilemma of AI",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/surveillance-vs-safety-dilemma-of-ai-1749655903",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 12, 2025 00:00:00  \n\nNowadays, video games have sparked a new revolution in global entertainment. They are not only gaining popularity, but their significance is also becoming increasingly evident. Video game companies such as Electronic Arts, Activision Blizzard, Bandai Namco, and Sega Sammy have successfully expanded the industry across European countries and are competing globally. This growth has contributed to the creation of job opportunities, increased foreign exchange earnings, rising global demand, and the overall popularity of gaming.\nFrom this perspective, Bangladesh has made initial strides into the gaming industry but has not yet achieved significant growth. This lack of progress presents a major challenge. Several factors contribute to this, including a shortage of skilled professionals, inadequate access to high-speed internet and high-quality PC hardware, limited demand in the local market, language and localisation issues, negative societal perceptions, and insufficient government recognition and support.\nHowever, if these challenges are properly addressed, the video game industry in Bangladesh has the potential to drive transformative change. Strategic actions must be taken, such as developing talent through vocational training, securing sufficient funding for local and international game development, increasing production based on market trends, acquiring advanced hardware and technology, and encouraging participation in industry events and global showcases. Furthermore, fostering international collaboration, providing hands-on experience through internships, promoting e-sports among students, nurturing a positive gaming culture, organising national game development competitions, and introducing government-backed initiatives such as National Game Awards can greatly support the industry. It is also essential to ensure that regulations, legal protections, and intellectual property rights are properly monitored and enforced.\nBy taking these steps, Bangladesh can not only gain global recognition in the gaming sector but also secure its place in the international job market. This will contribute to a brighter and more dynamic future for the country.\nAnindya Saha\nStudent\nDepartment of Accounting and Finance\nBachelor of Business Administration\nNorth South University\nanindya.saha02@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Video game industry: Hope or hype?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/video-game-industry-hope-or-hype-1749655931",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-06-2025"
    }
]