[
    {
        "full_article": "The downsides to ethanol use when compared to petrol are well known, including in the U.S. and Brazil, that have led in ethanol blending. But the engineering behind the safe and efficient use of ethanol-blended petrol, from 5% to 100%, is established too. Ethanol blending began as a response to the oil shock of the 1970s. Ethanol has also been pushed as carbon neutral. For India, however, the clinching argument is import substitution and lower price. The government’s case is that ethanol blending up to 20% can ensure $10 billion being put in Indian pockets every year. But, the benefits will be uneven for farmers, traders and distillers. India’s case hinges on increasing use of C-heavy molasses that are not used for sugar making, using broken rice that otherwise rots in godowns, and on ramping up acreage and productivity of maize that is agriculturally less demanding. These are supposed to set off food security concerns. Once the ethanol economy is fully established, however, it may be tough to prioritise food stocks over the interests of stakeholders in case of shortages and imbalances. Import substitution figures can be dented by import of farm inputs such as fertilizers that have a forex outgo of $10 billion.Ethanol has an efficiency penalty — it can affect material durability and corrode fuel handling systems. But, global studies have shown that vehicles manufactured as per Euro 2, U.S. Tier 1 and India’s BS 2 norms (in force since 2001) are compatible for ethanol use up to E15. The closed loop fuel control systems mandated to control fuel burning and keeping emissions down in BS 2 can help to mitigate efficiency and durability penalties of ethanol and the upgraded materials in BS 2 can help to reduce corrosion. In addition, as per norms, India’s vehicles sold since 2023 are committed to handle up to E20 although questions arise over the impact on the mass of older vehicles. And what is not helping is that in India there is no choice for consumers. Also, any reduction in price claimed earlier does not seem to be reflected in the bunk. Meanwhile, India has adopted two ethanol-specific norms and is expected to come up with E27, taking a cue from Brazil. While the government insists that its research indicates no harm, what would really help is full disclosure by automakers on their past brands even as they are announcing models that can accept any level of ethanol. For instance, some models sold some five years ago accepted only E5. Manufacturers should indicate possible mitigation routes for such models. And the government must back insurance claims. Transparency should support policy moves. Published - August 12, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        petrol\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Brazil\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        food security\n                    \n                            /                      \n                        \n                        fertiliser\n                    \n                            /                      \n                        \n                        automobile\n                    \n                            /                      \n                        \n                        automobile engineering\n                    \n                            /                      \n                        \n                        insurance",
        "headline_1": "​Assuaging concerns: On India and ethanol-blended fuel",
        "headline_2": "Vehicle owners deserve support on use of ethanol-blended fuel",
        "link": "https://www.thehindu.com/opinion/editorial/assuaging-concerns-on-india-and-ethanol-blended-fuel/article69920420.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "12-08-2025"
    },
    {
        "full_article": "The recent repatriation of the Piprahwa relics, which were excavated in 1898 from a stupa in Uttar Pradesh, marked an important episode in India’s cultural diplomacy efforts. Considered to be physical remnants associated with Lord Buddha’s mortal remains and his early followers, they were taken away in the colonial era and resurfaced for auction by Sotheby’s in Hong Kong in May. At this point, the Indian government intervened to halt the auction and repatriate the relics. These artifacts now reside in the National Museum, providing people the opportunity to engage directly with an irreplaceable piece of India’s and Buddhism’s heritage. Notably, India’s coordinated diplomatic effort, involving multiple ministries and its missions abroad, could persuade Sotheby’s to postpone and eventually cancel the auction. The Godrej Industries Group’s ability to acquire the relics through a negotiated arrangement with Sotheby’s also reflects an innovative public-private partnership. Thus, the collaboration enabled the repatriation as well as the setting of a good precedent for future recoveries, combining private sector resources with state authority. The episode also raised awareness worldwide about India’s role as a steward of Buddhist heritage.However, the case has also revealed certain structural deficiencies in the framework within which India operates to recover and safeguard its cultural assets. The relics, excavated during British administration, originally had a fragmented ownership, resulting in a complex legal status that vexed repatriation claims a century later. India’s reactive posture in the episode also reflected gaps in the existing legal, administrative, and preventive infrastructure to manage heritage. That the auction was publicly announced and scheduled before India intervened is revealing. The case also exposed the absence of robust international legal frameworks designed to prevent the sale of culturally sensitive objects. While India used existing national laws and international negotiations effectively in this instance, it also banked on diplomatic pressure, which is not a scalable solution. To address these gaps, the country needs a centralised, digitised registry of cultural assets (domestic and overseas) integrated with international customs and auction houses for real-time monitoring, proactive tracking, and to receive early alerts of potential sales. The government could also spearhead or actively participate in international efforts to develop binding norms to keep sacred relics from being commercialised. Scaling up public-private partnerships is equally imperative, together with encouraging the involvement of diverse stakeholders, including philanthropic foundations and heritage trusts, to mobilise additional resources and expertise for recovery and conservation.\r Published - August 12, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        history\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Uttar Pradesh\n                    \n                            /                      \n                        \n                        buddhism\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        heritage\n                    \n                            /                      \n                        \n                        culture (general)\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        Hong Kong",
        "headline_1": "Bringing them home: On the repatriation of the Piprahwa relics",
        "headline_2": "India must have norms to keep sacred relics from being sold",
        "link": "https://www.thehindu.com/opinion/editorial/bringing-them-home-on-the-repatriation-of-the-piprahwa-relics/article69920447.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "12-08-2025"
    },
    {
        "full_article": "Trump-Putin’s summit could be a turning point for Ukraine and global commerce. If talks succeed, sanctions could be adjusted & India might face fewer tariff troubles. If talks fail, expect a tougher Trump\nIf there is one tool Trump wields with as much relish as tariffs, it is sanctions. These are the blunt instruments of choice for America’s chief peacemaker and dealmaker, used both to halt wars and remake global trade in Washington’s image. India today finds itself at the receiving end of both weapons: Locked in a trade war with US and staring at the possibility of 50% tariffs by Aug 27.\nRead full story on TOI+\n\n",
        "headline_1": "Sprinkle trade on baked Alaska?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/sprinkle-trade-on-baked-alaska/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-08-2025"
    },
    {
        "full_article": "Shooting down six enemy planes and swarms of drones, and gutting more on the ground, is no mean feat. GOI must ensure IAF doesn’t go into battle again with a depleted fleet\n\nAfter three months of silence that Pakistan exploited to the hilt, India has revealed the extent of damage it inflicted on Pakistan Air Force during Op Sindoor. On Saturday, IAF chief AP Singh said in Bengaluru that at least five Pakistani fighter jets and a large special mission plane were brought down, and “a few” F-16s and other planes damaged or destroyed on the ground.\nRead full story on TOI+\n\n",
        "headline_1": "IAF rattled Pak this time, but it needs a leg-up",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/iaf-rattled-pak-this-time-but-it-needs-a-leg-up/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-08-2025"
    },
    {
        "full_article": "By Partha Sinha\nThere was a time when silence was rare because it was sacred. Today, it is rare because it is extinct. In an age where every room echoes with the low hum of dopamine-dealing devices and opinion-choked soliloquies, the most radical act is not to speak – it is to listen.\nNot hearing. Not waiting to speak. Not rehearsing clever responses while someone else’s lips are moving. But truly listening. The kind that involves ego disarmament and inner stillness. The kind that makes your inner voice shut up and take notes. That kind.\nI sometimes think if there were a karmic scoreboard in the sky, it wouldn’t measure how many hours you sat cross-legged on a yoga mat staring at your breath. It would measure how many times you made someone feel heard. Because listening, when done with intent, is the purest form of meditation. It demands presence. It trains the mind to stay still while another soul unfolds. It replaces ‘i’ with ‘you’ – a temporary dismantling of the self, not unlike the best of spiritual practices. Only, it requires no app, no mantra, no incense sticks. Just humility.\n\nBut it’s also alarmingly endangered. There are more TED Talks than listeners. More podcasts than attention spans. Even in meetings, on dinner tables, inside therapy rooms and WhatsApp groups – there’s a famine of attention in a feast of expression. Modern life has turned conversation into a competitive sport. We don’t engage. We intercept. We don’t listen. We load, aim, and fire – opinions, rebuttals, quips, quotes, memes. Silence is just a buffering zone between what we want to say and how soon we can say it.\nSomewhere between mindfulness and mindless noise, we forgot that listening is the deepest form of respect.\nIt tells the speaker: you matter enough for me to be quiet. And that is no small gift in a world screaming for attention.\nThe spiritual traditions knew this long before Instagram discovered mental health. The Upanishads are quite literally ‘heard wisdom’ – sruti, not likhi. In Zen, the master speaks little, but listens with the weight of a mountain. In Sufism, the listener is as holy as the whirler. Even in the Gita , Krishn says much – but only after Arjun asks and listens.\nThe irony? Meditation is now prescribed as a remedy for burnout caused by too much noise – but the simplest form of meditation is learning to shut up and really hear someone. Not solve. Not agree. Not paraphrase. Just absorb. Like a still pond absorbs a falling leaf.\nIf you’ve ever truly been listened to – without agenda, without interruption, without someone reaching for their phone halfway – you know it feels almost divine. It doesn’t change what you say. It changes who you are while saying it.\nWe live in a time where we are data-rich and meaning-poor. In such a world, a good listener is not just a good human. They are a spiritual insurgent. A soft rebel against the tyranny of noise. Maybe we don’t need more speakers. Maybe we need more monks with earphones unplugged.\nBecause sometimes, salvation sounds like someone finally, finally, listening.\n\n",
        "headline_1": "Art of listening: A better meditation for a noisy age",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/art-of-listening-a-better-meditation-for-a-noisy-age/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-08-2025"
    },
    {
        "full_article": "A lesson in blinging Trump, from Tim Cook\nWe all expected Trump’s second term as president to be theatrical and whimsical. But none of us expected American companies to be in competition with him. Enter Apple, whose pocket-sized cleaning cloths cost nearly ₹2K, and real products set you back by half your net worth. The posh iPhone maker subtly reminded us that very little is made in America – except Trump’s tantrums. \nIn a move that was definitely the trigger for the recent US back and forth on the tariff on gold bars, Apple presented the US prez with a slab of Gorilla Glass on a gold stand, etched with his name and Tim Cook’s signature. The highlight? The glass was made in America. So was the gold rump holding it. \nNot a single cheesy part of this artistic masterpiece, to celebrate American manufacturing, was from China, India, or any other country on Trump’s vengeance list. \nThis minimalist memorabilia, dazzling to no one except Apple, was peak Apple. It was true to their product philosophy – refinements so marginal that unless your eyes watered from reading the fine print, you would miss that you upgraded to a pricier iPhone, for a change of colour and one millimetre more of display. I know this from constantly comparing models to keep my FOMO in check. \nI was so excited by the choice of ‘Gorilla’ glass that I went over the Apple press release, hoping they would have subtly hinted that the gift was a touching nod to the big boy in the room. But alas, Apple does subtle only for its products. Their press release was plain as day. They announced an extra $100bn in US investments, and said they would “directly hire 20,000 people in US – the vast majority focused on R&D, silicon engineering, software development, and AI and machine learning”. They will nudge their vendors to hasten US manufacturing, but nope the iPhone will still not be made in US. \nThe good news for Apple – and for everyone else – is that nobody reads the fine print. So, for heaven’s sake India, give Trump a golden chappal (our internationally renowned Kolhapuri will do) stamped MAGA, and negotiate zero tariffs. Nothing says charm offensive like a bit of flattery dressed as a lot of business intent.\n\n",
        "headline_1": "Golden chappal diplomacy?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/golden-chappal-diplomacy/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 12, 2025 00:00:00  \nThe students' protest now being waged in Barishal Metropolitan city against the poor state of Sher-e-Bangla Medical College Hospital (SBMCH), one of the oldest public health facilities of the country, points to a serious health sector malaise. A section of the media, rightly or wrongly, has paid increased attention to the blockade put up by students on the Barishal-Kuakata highway and consequent disruption caused to vehicular movement. There is no denying that the protesters should have avoided an important transportation hub since the blockade programme has been causing sufferings to long-distance travellers. The protesting students, however, have raised a point in support of their ongoing agitation. They argued that their disruptive programme has paid off, as the health authorities in Dhaka are trying to reach them with assurances that they would try to improve the situation at the SBMCH. \nOne has reasons to be scepitcal about the assurances given by the health authorities. For, coming under pressure, many state agencies at times make promises, but only to forget the same as soon as agitations or protests subside. Truth is, the Barishal episode of protests speaks for the state of the public health service delivery in most part of Bangladesh. The public medical college hospitals and general hospitals, mostly located in district headquarters and upazila health complexes, are not able to cope with rush of patients. They have myriad problems that include shortage of beds, medicines, diagnostic equipment, ambulances and, above all, the lack of specialist doctors, which is a perennial issue. Inadequate budgetary allocation coupled with the lack of proper attention from the health sector honchos is primarily responsible for the crisis. Patients are forced to occupy corridors after not finding beds in hospitals. Worse yet, they have to buy almost everything, including medicines. They are required to do most diagnostic tests outside. Specialist doctors remain absent from the workplaces, as they consider posting outside Dhaka as punishment. \nObviously, being the capital city, Dhaka offers better and improved healthcare facilities. Of course, those are expensive and beyond the reach of the poor patients. The state health facilities in Dhaka, though finding it hard to cope with the onrush of patients, are still better equipped and somewhat more efficient than their counterparts in districts. This is primarily due to the fact that these are nearer to the centres of control, including the health services directorate and exposed to media scrutiny. Still, the state of affairs in government hospitals remains far from satisfactory. They too have management problems and shortage of necessary medical equipment. Patients very often make complaints about service delivery. \nThat the quality of health and education facilities available in districts is far from satisfactory is hardly disputed. The number of health and educational facilities in both private and public sectors has gone up in mufassil areas in recent years. But people are not happy with their service delivery. A section of dissatisfied people, who can afford, choose to come to Dhaka either to seek medical help primarily from modern private hospitals or get their children admitted to highly reputed schools and colleges. One of the reasons for Dhaka being increasingly crowded is the unending influx of this type of people. What pains most is the relevant authorities prefer to be oblivious of what is happening around them. They have never felt the need for putting in place better and improved health and educational facilities in the districts. Even the incumbent interim government headed by Dr. Muhammad Yunus formed nearly a dozen reform commissions for different sectors but not for health and education. Still this void can be addressed by the government to some extent, by ensuring quality service delivery and encouraging the private sector to set up modern hospitals and educational institutions in districts.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "A protest that highlights a deeper malaise",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/a-protest-that-highlights-a-deeper-malaise-1754923721",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       August 12, 2025 00:00:00  \n\nBangladesh's relationship with Malaysia is one of the most vital partnerships in our labour migration and economic cooperation framework. Over the years, Malaysia has become a major destination for Bangladeshi workers, hosting over one million of our citizens who send home substantial amount of remittances. These workers form an essential part of Malaysia's workforce in sectors such as construction, agriculture, manufacturing, and services. However, the long-standing relationship has been punctuated by recurring crises -- the most recent being Malaysia's suspension of manpower recruitment from Bangladesh last year.\nThis is not the first time such recruitment has been halted. History tells us that Malaysia has, on multiple occasions, stopped hiring Bangladeshi workers due to irregularities in recruitment processes, high recruitment costs, and allegations of human trafficking. One of the most pressing reasons behind these suspensions is the influx of illegal workers, a problem perpetuated by a strong and well-connected syndicate. This syndicate, composed of both Malaysian and Bangladeshi actors, thrives on exploiting desperate job-seekers for hefty profits. The result is harassment, financial ruin, and even the loss of life for thousands of our migrant workers.\nAgainst this troubled backdrop, Chief Adviser Dr Muhammad Yunus's ongoing visit to Kuala Lumpur carries high expectations. His trip, beginning Monday on the invitation of Malaysian Prime Minister Anwar Ibrahim, offers an opportunity to address these entrenched issues head-on, restore trust, and pave the way for reopening Malaysia's job market to Bangladeshi workers.\nAccording to officials, the primary focus of Dr Yunus's visit is on labour migration and investment. He will hold a bilateral meeting with Prime Minister Anwar Ibrahim of Malaysia at his Office in Putrajaya. This will be followed by delegation-level talks and the signing of several memorandums of understanding (MoUs). The agenda covers a broad spectrum: recruitment of new workers in various Malaysian sectors, increased hiring of skilled professionals, and improving the benefits and facilities available to Bangladeshi workers.\nForeign Ministry officials described this visit as \"very important,\" noting Malaysia's central role in Bangladesh's manpower sector. The hope is to \"take our migration sector to a stage where Malaysia takes the maximum number of manpower from us.\" This requires not only an agreement to lift the current suspension but also reforms that would prevent the same issues from resurfacing.\nA significant part of the talks will also focus on securing Malaysian investment in emerging sectors in Bangladesh, such as deep-sea fishing and electronic vehicle (EV) manufacturing. Malaysia's Proton already has a presence in Bangladesh, and with global demand for EVs growing, this could become an important area of cooperation. Beyond jobs for low- and semi-skilled labour, this opens up pathways for technology transfer, skilled employment, and industrial growth back home.\nOne least discussed aspect of the Bangladesh-Malaysia migration equation is the potential for skilled employment. Hundreds of Bangladeshi students are currently studying at Malaysian institutions, many of them in technical, engineering, and IT-related fields. Yet after graduation, many return home or seek work in other countries due to limited opportunities to work in Malaysia. If the two governments can agree on frameworks that allow these graduates to be absorbed into Malaysia's high-tech industries, the benefits would be twofold: Bangladesh would gain valuable remittance from skilled jobs, and Malaysia would address its own shortage of qualified professionals.\nThis would also help diversify the profile of Bangladeshi workers abroad. Currently, the bulk of our overseas workers are in low-paid, physically demanding jobs. Increasing the proportion of skilled professionals in the migration mix would not only raise overall remittance volumes but also improve the image of Bangladeshi workers globally.\nDr Yunus's itinerary includes more than just political meetings. There is a major business conference bringing together Malaysian corporate leaders and Bangladeshi entrepreneurs. This is followed by a series of high-level meetings with chief executives of Malaysia's major companies. These engagements are designed to encourage investment partnerships, facilitate joint ventures, and strengthen trade links.\nThe visit is also set to feature ceremonial and symbolic elements. On August 13, Universiti Kebangsaan Malaysia (UKM) will confer an honorary degree on Dr Yunus. Prime Minister Anwar Ibrahim is expected to attend the ceremony. These events will contribute to the public diplomacy aspect of the trip, showcasing mutual respect and goodwill between the two nations.\nThree notes of exchange are also expected, covering the halal ecosystem, higher education, and cooperation between the diplomatic training academies of both countries. The breadth of these agreements signals a desire to deepen the bilateral relationship beyond just migration and building a more diversified and resilient partnership.\nFor all the promise of these agreements, the heart of the matter remains the suspension of manpower recruitment. Any breakthrough in this area will require frank discussions about the governance of migration. Both countries must confront the issues of the role that syndicates play and the political protection they enjoy. A transparent, accountable, and affordable recruitment process is essential. This includes digitalisation of recruitment systems, rigorous background checks for recruiters, and direct government-to-government hiring arrangements to bypass exploitative middlemen.\nBangladesh also needs to strengthen its pre-departure training and worker protection measures. This is to ensure that workers are fully informed about their contracts, rights, and the cost of migration before leaving the country. On the Malaysian side, stricter enforcement against illegal recruitment channels and better monitoring of employers' compliance with labour laws are necessary.\nThe timing of this visit is critical. The suspension has left tens of thousands of prospective workers in limbo, many of whom have already paid significant sums to recruiters. The frustration among these workers and their families is growing. For the interim government in Dhaka, securing a reopening of Malaysia's job market would be a major political and economic achievement, boosting remittance inflows and easing domestic unemployment pressures.\nMoreover, the global labour market is becoming increasingly competitive. Countries such as Nepal, Indonesia, and Vietnam are aggressively expanding their labour export to Malaysia and other destinations. If Bangladesh does not move quickly to resolve its issues, it risks losing market share permanently.\nWhile the immediate priority is resolving the suspension, the longer-term vision should be about building a sustainable migration framework with Malaysia. This means moving from a cycle of crisis and reopening to a stable, predictable flow of workers. It also means aligning migration policies with the changing needs of Malaysia's economy - for example, by increasing the supply of skilled technicians for its growing EV sector, or IT specialists for its expanding digital economy.\nEqually important is expanding cooperation in education and vocational training, so that Bangladeshi workers are better prepared for higher-paying jobs. Joint training centres, mutual recognition of qualifications, and targeted scholarship programmes could be part of this approach.\nIf the visit can deliver concrete agreements on transparent recruitment, stronger labour protections, and expanded economic cooperation, it will go a long way towards resolving the existing problems and preventing future ones. With over a million Bangladeshis already contributing to Malaysia's economy, and countless more hoping to do so, this is a relationship that deserves careful nurturing. The stakes are high, but so is the potential for a win-win outcome.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Promoting labour migration, wooing investment",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/promoting-labour-migration-wooing-investment-1754923796",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       August 12, 2025 00:00:00  \n\nTwo persons were beaten to death by villagers in Taraganj upazila of Rangpur on the night of Saturday (August 9).The reason for their fatal end, as reported, was that the victims lost their way and entered the Burirhatbottola area under Soyar union of Taraganj upazila of Rangpur. The villagers suspected the victims as rickshaw van thieves, as they were riding a rickshaw van at that time. So, just a suspicion was enough for the people of Burirhatbottolarea who turned into a bloodthirsty mob and killed Rupalal Das (45), a cobbler by profession and Prodip Das (50), a rickshaw van driver. Pradip Das was also learnt to be the husband of Ruplal Das' niece. The mob at Burirhatbottolarea in Taraganj upazila not only mindlessly murdered two people but it also destroyed two families at the same time. And it all happened purely out of suspicion. It's an intolerant and brutalised society we are living in. Someone's life can be taken here purely on flimsy grounds. \nIn another incident in the same (Saturday) evening, a journalist and his mother were badly beaten up by members of a criminal racket at Mokra Dhodhogach village in Lalmonirhat Sadar Upazila. The victims were learnt to be undergoing treatment at the Lalmonirhat Sadar Hospital at the time of reporting. The journalist, Helal Hossain Kabir (32), reportedly runs a weekly newspaper, Alormoni, as its executive editor. His mother was injured when she tried to protect her son from the attacker, Sohrab Hossain (48) and his cohorts who allegedly run a gambling racket. Before the attack, the journalist was reportedly issued death threat over phone as some months back he filed a general diary against Abdul Aziz, a local criminal associated with the gambling racket. By issuing death threats and physically assaulting the journalist, the members of the criminal gang were trying to intimidate him into submission so he may not dare expose them through his reports. \nIn another tragic incident that took place at the Chandana Chowrasta area of Gazipur town on Thursday (August 7) evening when Asaduzzaman Tuhin, 38, a staff reporter of the local daily, Protidiner Kagoj, went live on his Facebook page reporting a crime in action where five to six criminals brandishing sharp weapons were, according to the Gazipur Metropolitan Police (GMP) commissioner, in hot pursuit of their prey, Badsha Mia, who withdrew substantial sum of money that day from an ATM booth in that area of Gazipur. The assailants hacked journalist Tuhin to death in a shop at the local Eidgah market where he took refuge. The perpetrators murdered the journalist in the full glare of the public in a busy marketplace. The bloody incident committed at a public place was to convey the message that no one including journalists would be spared, if they try to report their crimes or challenge them.\nThe first incident shows how even rural communities otherwise known for their tradition of understanding and respect for strangers have lost their old values and turned insensitive, lawless and violent. In the past, the culture in the village communities was to inquire about the identity of a stranger whenever confronted by one in their area before taking any action against him or her. And that was never done in a violent manner. But the Taraganj mob violence leading to the gratuitous murder of two people of the same upazila shows how our rural societies have been losing their past mores and values and have changed for the worse out of all recognition \nThe second and the third incidents point to how bold criminals are getting by the day and the members of the public losing their courage to resist any violent crime in their presence even though they far outnumber the criminals perpetrating atrocities against an innocent victim. In the mentioned two cases, the victims happened to be journalists. \nThese are nothing but signs of a society where lawlessness is taking hold in absence of a well-functioning government.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "A society losing its ethical moorings",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/a-society-losing-its-ethical-moorings-1754923843",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 12, 2025 00:00:00  \n\nThe United States of America increased its hegemony in global politics and the economy after the early 1990s, following the collapse of the Soviet Union and the transition of many countries to open market economies. This theory of open market economies led to the US emerging as the lone superpower of the world. In one way or another, many countries have gradually become dependent on decisions made by the US. So far, no alternative international market theory has been developed to counter the US doctrine.\nBy virtue of its advanced technology and developed economy, the US has been influencing the Middle East and other parts of the world. Palestine has been the worst sufferer of US geopolitical strategy in the Middle East. Hundreds of thousands of people have died every year since 1947, when the UN proposed a two-state solution to the persistent Middle East crisis. However, this resolution has yet to see the light of day due to strong US opposition and its explicit backing of Israel.\nAs a result, Israel has occupied Palestinian territories, torturing and brutally killing Palestinian people. No one has dared to stand against these atrocities. Since October 7, 2023, Israel has been committing genocide in Gaza, the West Bank, and Jerusalem, flagrantly violating international laws and regulations of war. It seems no one can stop Israel from carrying out these heinous crimes and brutalities. \nOn the other hand, the US is assisting Israel by supplying large quantities of bombs, artillery, ammunition, and weapons to accelerate the invasion of Gaza under the guise of Israel's so-called right to self-defense. In reality, these weapons are being used to kill unarmed civilians in Gaza. Meanwhile, the US openly states that Israel is doing its best to defend itself. On one side, the US laments the starving people of Gaza, but on the other, it unconditionally supports Israel's genocide and the blockade of food and medicine supplies to Gaza. Because of such double standard on the part of the US, ethnic cleansing is being committed in Gaza. However, no one dares to say that the US shares responsibility for the mass killings and is complicit in Israel's genocide.\nAbu Taher\nKawran Bazar, Dhaka\nabutaher011@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "US's complicity in Israel's genocidal campaign in Gaza",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/uss-complicity-in-israels-genocidal-campaign-in-gaza-1754923867",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-08-2025"
    }
]