[
    {
        "full_article": "The All India Congress Committee (AICC)/Congress Working Committee session in Ahmedabad, on April 8-9, aimed to convey the Congress’s intent to usher in organisational reforms at the grass-roots level and bring ideological clarity. The capital city of Gujarat with a rich history in India’s freedom struggle was a symbolic setting to reflect the crisis that the party is grappling with. The Congress has been out of power for 30 years in Gujarat, which is now closely associated with Prime Minister Narendra Modi’s model of politics and governance. The conclave reaffirmed the party’s commitment to constitutional values such as secularism, pluralism, federalism, and inclusive growth — principles that once defined the Congress and which, it alleges, are now under threat. Party leader Rahul Gandhi reiterated the focus on social justice, including the demand for a nationwide caste census and the removal of the 50% ceiling on quotas. These would form the basis for future policy initiatives of Congress governments in the States, as well as any government it may lead at the Centre. Another key aspect of the Congress’s revival strategy hinges on its ability to build an effective party organisation at the grass roots. Signalling a shift away from its high-command culture, the party announced that district committees and district-level leadership would form the bedrock of decision-making and accountability.While the deliberations signalled the party’s seriousness about bouncing back, critical questions remain beyond idealism and symbolism. Almost all its State units are plagued by power struggles and factionalism, often damaging the party’s electoral prospects. Whether district-level decision-making will intensify or contain factionalism is a question only the implementation of the revamp plan can answer. The attempt might be to squeeze the domineering regional chieftains between grass-roots leaders and the high command. It is also unclear how, when politics is increasingly centralised in terms of resources, messaging and planning, the Congress can achieve results by shifting authority to districts. In the absence of a clear road map — especially one that addresses the aspirations of India’s youth and emerging middle class — the party risks retreating into nostalgia rather than crafting a forward-looking vision. Building on its legacy, the Congress now needs political imagination, strategic clarity and organisational discipline. The Ahmedabad session, for all its symbolism and sincerity, must be seen as a beginning. It is a work in progress, and the months ahead will test whether the session on the banks of the Sabarmati marks a true turning point or just another event in the party’s ongoing quest for renewal. Published - April 12, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        Ahmedabad\n                    \n                            /                      \n                        \n                        Gujarat\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        population and census\n                    \n                            /                      \n                        \n                        Reservation\n                    \n                            /                      \n                        \n                        government",
        "headline_1": "Work in progress: On the Congress and its Ahmedabad session",
        "headline_2": "The Congress high command culture does not suit district-level decision-making",
        "link": "https://www.thehindu.com/opinion/editorial/work-in-progress-on-the-congress-party-the-ahmedabad-session/article69438893.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "12-04-2025"
    },
    {
        "full_article": "Colossal Biosciences is an American company with an unusual marketing line: combining genomics with conservation — not in its traditional form, but through de-extinction, which is resurrecting species extinct for thousands of years. Leading this project is Harvard geneticist George Church, a prominent promoter of the company, who aims to bring back the woolly mammoth, a distant ancestor of the elephant. The stated logic is to combat global warming. During the Pleistocene Ice Ages, the mammoth roamed lush grasslands across the tundra. Until its extinction around 5,000 years ago, the Arctic tundra also supported large populations of bison, wolves, cave lions, and giant deer. As the climate warmed, these species disappeared, and the grasslands gave way to shrubbery and sheets of snow. As temperatures rise, permafrost begins to disappear, resulting in high emissions of methane, a more potent greenhouse gas than carbon dioxide. To prevent this, some scientists at a Siberian park have been transporting large animals that are resistant to cold to see if their foraging can restore the grasslands. Grass absorbs less heat than the tall trees in a shrub forest — the dominant species — and therefore decelerates warming, but it cannot stop warming.The woolly mammoth, though extinct, is seen as a potent weapon in this climate plan. Scientists at Colossal have extracted fragments of its DNA from fossils and reconstructed its genome. By comparing it to that of the modern elephant, they have edited specific genes to recreate mammoth-like traits, with the goal of eventually incubating a hybrid embryo in an elephant’s womb. Scientists have also experimented with the dire wolf, an extinct relative of the gray wolf, and birthed three snow-white wolves. However, this claim has yet to pass rigorous peer review. Critics point out that only 20 genes were edited, and what has been created is, in essence, a “strange-looking gray wolf”. Despite such criticisms, the technological achievement is a testament to the ability to engineer precision edits to the genome. The work of Chinese scientist He Jiankui, who claimed to have produced gene-edited human babies, remains controversial. Colossal may be credited for its genomics work, but the claim that it is reviving species for conservation is not credible. Thousands of living species are vanishing due to habitat loss and human encroachment. Spending millions of dollars on speculative projects, whose benefits, if there are any, will fructify only over centuries, takes away resources from immediate conservation efforts. The scientific community must lay down strict guidelines on the use of gene-editing technology in applications other than health. Published - April 12, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        conservation\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        genetics\n                    \n                            /                      \n                        \n                        animal\n                    \n                            /                      \n                        \n                        climate change\n                    \n                            /                      \n                        \n                        science (general)\n                    \n                            /                      \n                        \n                        animal science\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        carbon emissions\n                    \n                            /                      \n                        \n                        global warming\n                    \n                            /                      \n                        \n                        China",
        "headline_1": "​Dire efforts: On de-extinction and conservation",
        "headline_2": "The conservation argument for resurrecting dire wolves is not credible",
        "link": "https://www.thehindu.com/opinion/editorial/dire-efforts-on-de-extinction-and-conservation/article69440044.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "12-04-2025"
    },
    {
        "full_article": "**Sending money is not the same as giving real help**\nSome people in the government in Uttar Pradesh (a state in India) did something very wrong. They used the names of three women to steal money from a health program called *Janani Suraksha Yojana* (JSY). This program gives money to help women who are pregnant or have just had babies. But the scammers pretended the same three women gave birth 52 times and had 9 operations in just three years! That’s clearly not true.\nThe women said a local person told them to open bank accounts to get government help. But they never used those accounts. So who did? The scammers!\nThis shows a big problem:\nEven though the government moved everything online to stop cheating, it’s still happening. Why? Because many people don’t understand how to use technology well. So they ask others to help them—and sometimes those helpers cheat them.\nAlso, there are too many programs giving money for health, and it’s hard to keep track. While some programs have helped reduce the number of women dying during childbirth, places like UP still have a lot of problems. Even with all these programs, women are still being promised more money during elections.\nSo, here’s the big question:\nIs it better to give money, or to make sure hospitals and health workers are actually helping people where they live?\n \n\n",
        "headline_1": "**Watch Out for This Scam!**",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/watch-out-for-this-scam/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-04-2025"
    },
    {
        "full_article": "People & moments that led to Ukraine, Gaza, Trump 2.0\nTwo-time Pulitzer Prize winner Bob Woodword’s War is a riveting inside-the-room account of three crucial wars that have roiled the world in the last three years – the wars in Ukraine and Gaza and the fight for the American presidency. Woodword’s in-depth journalism paints a vivid picture of the history-defining moments, key actors and their decision-making processes, and the challenges they were confronted with. The narrative style makes readers of the book feel they are sitting right next to world leaders when they are having epoch-defining conversations.\nLike when Kamala Harris as Biden’s VP speaks to Zelenskyy on the sidelines of the Munich Security Conference just days before Russia’s full-scale invasion of Ukraine in 2022. Harris is trying to convince Zelenskyy that Putin is about to invade based on gold-standard US intelligence. But Zelenskyy and his team are sceptical. Zelenskyy believes openly acknowledging the threat would lead to a self-fulfilling prophecy about Ukraine’s destruction and create panic. Harris leaves that conversation saying, “That might be the last time we see him.” Three years on, Zelenskyy continues to defiantly fight the Russian invasion.\nTrump, meanwhile, is always lurking in the background throughout the book. Refusing to accept the results of the 2020 elections, sulking, growling in the shadows. At one point he toys with the idea of forming his own party and dumping the Republicans – they had both had enough of each other after the Jan 6, 2021 insurrection. But Trump and the Republicans slowly came around to the view that they needed each other, especially if he was going to have another shot at the presidency.\nSenator Lindsey Graham plays a big part in helping make up Trump’s mind. He tells Trump to forget about 2020 and focus on his legacy. Trump compares himself to legendary American golfer Jack Nicklaus and decides to “hang around” in the hope that the Biden administration collapses.\nBiden, meanwhile, appears to have the opposite character. Long years of public life appear to weigh heavily on him. He is very cautious, always pressure-testing ideas before taking a call. His secretary of state Antony Blinken appears to slow-walk him into making decisions, like on the F-16s for Ukraine. Biden’s interaction with Netanyahu after Hamas’s Oct 7, 2023 surprise attack on Israel is telling. Biden is almost imploring Bibi not to open up another front with Hezbollah in the north. He fears this will lead to a regional war. But Bibi doesn’t seem to be listening, saying “I hear you…But I also want to be clear that we are going to make our own decision”.\nBibi is a tough customer. The Americans want him to open up humanitarian aid into Gaza. He is adamant he won’t. A Biden trip to Israel has to be used as leverage. The Israeli military operation worsens the situation in Gaza. The Houthis start attacking ships in the Red Sea. Biden is always thoughtful, consulting, debating, almost to a fault.\nBut age was getting to him. And after the first presidential debate debacle in 2024, Biden was pressure-testing the idea of continuing to run for a second term. Trump, however, stuck to his cage-fighter persona. The failed assassination attempt against him doesn’t side-track him one bit. Nor does Harris entering the presidential race faze him. He would do anything to be back in the White House. And he was looking for…payback. We now know how he’s going about getting it.\n\n",
        "headline_1": "The Wars Of Our Times",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-wars-of-our-times/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-04-2025"
    },
    {
        "full_article": "This week, the U.S. government sold a lot of its bonds (kind of like IOUs where people lend money to the government and get paid back later). At first, it seemed like people still wanted to buy them, which was good news for President Trump. But on Friday, things got worse again. Investors started selling U.S. bonds fast, especially in Asia. That’s a sign people are worried, and it made interest rates on these bonds rise faster than they have in nearly 25 years!\nThis isn’t just about the stock market going up or down. U.S. government bonds are super important for the whole world’s economy. Countries like China buy them because they’re usually safe. People buy them when they’re nervous about the stock market. And the U.S. government uses them—along with taxes—to pay its bills.\nUsually, when the stock market is doing badly, people buy more bonds. But now, with Trump putting big taxes (called tariffs) on stuff from other countries, things are getting weird. Other countries are also putting tariffs on U.S. stuff. That makes everything more expensive and makes people nervous about the future.\nBecause of the tariffs, investors are worried that prices will go up (that’s called inflation). And when that happens, bonds become less valuable. So, people want to sell their bonds now, while they still can. Some are doing it because they need cash, others to protect their own money systems, and some might even be trying to pressure Trump during trade talks.\nAlso, if countries sell less to the U.S. because of the tariffs, they’ll earn fewer U.S. dollars—and that means they might not be able to buy as many U.S. bonds later. That’s bad news.\nSo even though Trump may think everything is under control, there’s real trouble here. The smart thing for him to do would be to stop acting like he knows everything and be more careful with trade and money decisions.\n\n",
        "headline_1": "**Die Another Day: For Trump, the Money Trouble Isn’t Over Yet**",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/die-another-day-for-trump-the-money-trouble-isnt-over-yet/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-04-2025"
    },
    {
        "full_article": "Cash transfer no substitute for last-mile public health  \nA gang of UP govt insiders is believed to have used identities of at least three women, as a probe has revealed so far, to claim cash benefits of Centre’s maternal health scheme Janani Suraksha Yojana (JSY). The scamsters’ reportedly claimed benefits for 52 deliveries and nine sterilisations in three years in the names of just three women. It’s possibly the tip of the iceberg.\nAll three told investigators that their village’s do-gooder had them open accounts, promising govt benefits. The women never operated these accounts. First the old question: how robust are annual audits of such schemes? Who’s checking where the money’s going? Digital transformation of India’s social welfare was meant to remove the middle-man. But abysmal tech literacy among those targetted has meant tech shops of data entry have become the new mediators. Digitisation shifted the welfare process from in-person to online application, removing a direct link between govt and beneficiary – easy hunting for scammers.\nSecond, the rash of schemes. Centre runs 12 schemes for maternal health as of 2024. Interventions, like JSY since 2005, have reduced India’s maternal mortality rate (number of maternal deaths per lakh live births) from 384 (2000) to 97 (2020) – but UP still bears 35% of India’s MMR burden. Clearly, ‘leakages’ abound. Despite so many schemes, pregnant women in pre-poll Delhi were promised more cash transfers. The UP case begs the question: what’s more effective – public health last-mile delivery or cash transfers?\n\n",
        "headline_1": "Scan The Scam",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/scan-the-scam/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-04-2025"
    },
    {
        "full_article": "We're heartened by the successful conclusion of Bangladesh Investment Summit 2025 that reportedly drew in some 450 foreign investors and representatives from 40 countries. During the four-day event, two investment deals were signed, while many pledged future investments. The government has rightly expressed its intent to capitalise on the momentum. As per the organisers, a \"pipeline\" of potential investments will be created based on the companies and individuals who have shown interest, and a roadmap with a timeframe of 18-24 months will be drawn up to ensure the summit's promises translate into real, long-term gains. It goes without saying that the success of this much-hyped event will be determined by how well the authorities can follow through. The challenge is not just to concretise the investment commitments, but also to uphold the post-July economic reform agenda to create an enabling environment for sustainable growth.\nIn this connection, we want to reiterate the importance of addressing long-standing barriers to doing business that have been repeatedly flagged by experts. While there are sector-specific concerns and vulnerabilities—such as those affecting the RMG industry, which just survived (temporarily) a tariff scare triggered by the US—barriers cutting across all sectors must be addressed with priority. Participants at the summit, for instance, raised concerns about policy inconsistency, political instability, corruption, bureaucratic red tape, lack of coordination, crises of gas and electricity, and complex approval procedures. Some of these were also reflected in a recently unveiled World Bank report that highlighted Bangladesh's top five business obstacles, including its inefficient tax structure and informal economy. Many of these problems require political commitment, so political parties, too, must step up in creating the kind of environment investors need.\nThe fact is, Bangladesh has significant investment potential but it cannot be fully realised without addressing these underlying challenges. While the interim government's efforts in this regard have borne some fruit, much more needs to be done. At the same time, we must acknowledge the promise shown of late by some sectors. For instance, in its report, the World Bank identified four sectors—green RMG, housing for middle-class families, paint and dyes, and digital financial services—as ripe for reform. These sectors, it argues, are mature and politically feasible enough to be restructured in ways that could create millions of jobs, draw investments, and spark a ripple effect of productivity in interconnected sectors. Among them, the RMG industry deserves particular mention. As the founder of the Korean EPZ said at the summit, if overhauled and properly supported, it could become the top global apparel exporter even as we try to diversify our export basket.\nTo capitalise on all such promises, we need sustained efforts from the Bangladesh Investment Development Authority (BIDA) as well as targeted interventions and broad reforms from higher authorities. The recent summit was an attempt to dispel the negative perceptions many foreign investors still hold about our investment climate because of past experiences. We can project a new, reformed image through our actions going forward.\n",
        "headline_1": "A turning point for investment—if we can seize it",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/turning-point-investment-if-we-can-seize-it-3868956",
        "news_paper_name": "The Daily Star",
        "publish_date": "12-04-2025"
    },
    {
        "full_article": "It is that time of year again when part of my garden in Bath wakes up—the ponds. My wife, Angela, annually expects this event to occur on February 17, but it was late this year by a few days. We don't know how to account for this, but we suspect global turmoil. Climate is the most likely candidate, though it could be because compared to this time last year, the ponds have received some attention from the evil human, me: they needed a bit of cleaning up. Here, we encounter the amphibian-human interface. Are the ponds mine or theirs? But fortunately, the frogs are back and performing their reproductive duty in the usual wanton way.\nThese seasonal dilemmas remind me of the frogs in a saucepan of water metaphor: perhaps THE major challenge for us humans in 2025 and for the coming years. The \"theory\" is that if frogs are swimming around in a saucepan, which is slowly being heated up, they stay as the water gets warmer, adapting to the incremental change in their circumstances. And they keep adapting until suddenly it is too late to escape, and the water has boiled! This is a powerful metaphor for us humans dealing not just with slower, incremental change like the climate where we adapt through intermediate tactics until, perhaps, it is too late, but instead dealing with deliberate processes of disruption to a longstanding global order.\nThis prospect of sudden transformation is arising from the Trump regime in the US. In the past few decades, we have had to endure previous right-wing disruptors such as Reagan, Thatcher, the Bushes, the recent decade of UK Tories and the threat of fascist tendencies re-emerging among many political parties in Europe as well as further afield across Asia and Latin America, with some of them gaining power or at least significant influence. And we have adjusted to the curtailment of our liberties and discrimination in various forms—social, racial, ethnic, immigrant and so on. Indeed, we have been deliberately trading liberty for security. This pattern of incremental adjustment occurred in the early days of Nazism in 1930s Germany. It occurred under McCarthyism in the USA. It occurred in South Africa under apartheid. The list goes on. But if we return to the rise of antisemitic Nazism in middle Europe, the Jews could observe the steady encroachment on their freedoms and citizenship and the expansion of discrimination against them, thinking that the full suppression of others (communists, the Slavs, the disabled, homosexuals) could never be applied to themselves—until it was, the Holocaust.\nSo what now? The post-WWII \"protections\" erected in Europe, especially NATO entailing a defensive North Atlantic alliance between the USA and Western Europe, have been in place for nearly 80 years. And the Cold War with the Soviet Union \"ended\" in 1989. We dared to breathe more freely. The European Union expanded East. The USA had our backs. We were comfortable in the saucepan. Even left-wing radicals, critical of neo-liberalism, and other advocates of nuclear disarmament and pacifism could operate within this post-war umbrella. But this apparent paradise of security had flaws, which we in the saucepan chose to ignore until someone turned up the heat. We have relied upon a notion of \"shared values\" with our big, wealthy transatlantic neighbour, values which would remain strong enough to underwrite their protection of us against more dictatorial regimes in many of the ex-Soviet states, including Russia itself. But in Europe, we are now witnessing a steady erosion of shared socially inclusive sentiment to the point of imitating the US's re-introduction of discrimination, based upon race and origin. Our right-wing parties in Europe are leading the way in this imitation—adjusting to this redefinition of values, of being happy to sell off our economic assets (38 percent of annual non-financial turnover in the UK is owned in the US), and to close our borders to immigration despite our ageing demographic profile. We face the danger of our own isolation unless we share in these illiberal tropes which have been stirred up by the incumbent of the White House and his cronies in their pursuit of oligarchical power. This is our collective Faustian dilemma.\nAs always with populist perspectives, there can be grains of truth upon which distortions and exaggerations can be based. Europe has been behaving like those slowly warming frogs in the saucepan, swimming in a false sense of security. We have underfunded our defence since the end of the Cold War, free-riding to a degree on the US; we (especially Germany under Merkel) have relied heavily and conveniently upon Russian sources of fossil fuel-based energy; and we have expanded eastwards (EU and NATO), contrary to previous undertakings given to Russia. This represents complacency while giving Russia at least one moral alibi to re-Ukraine (eastwards expansion) and a weapon in terms of energy dependency (now switched to the US, i.e. imported liquified natural gas). We have been fools in an imaginary paradise, never believing that on the one hand Russia would push back in Europe beyond its post-Soviet frontiers, and always believing that the US and Western Europe, certainly the UK, could never fall out with each other. The latter prospect is now as real as the former one, at least for the next few years and who knows how the new republicans will try to cling to power in November 2028!\nLike those frogs, we are crammed into that saucepan without much room to manoeuvre! The frogs in my pond will climb out soon and hide elsewhere in the garden, returning for occasional summer recreation. What options do we Europeans have to enable the equivalent? To meet defence needs, rising taxes will again hit the poor in our unequal societies; more borrowing will spook the money markets, and interest rates will rise, again hitting the poor the hardest. Meanwhile, already, shares in weapons production are already rising. These ingredients for stagflation have historically been a breeding ground for reactionary populism roused by demagogues with no sustainable or inclusive answers. Unrestrained capitalism alongside closed borders for humans is certainly not the answer. There is a collective way through this via progressive taxation and greening economic growth to share the well and our common wealth better. But first, as in Bangladesh last August, we have to keep democracy alive to prevent the capture of the state. We have to push back before it is too late, as happens in the frog metaphor.\nDr Geof Wood is a development anthropologist and author of several books and numerous journal articles, with a regional focus on South Asia. He is also emeritus professor of international development at the University of Bath, UK.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Frogs in the saucepan: A metaphor for our times",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/letters-the-uk/news/frogs-the-saucepan-metaphor-our-times-3868961",
        "news_paper_name": "The Daily Star",
        "publish_date": "12-04-2025"
    },
    {
        "full_article": "\"The best way to predict the future is to create it.\"\n— Peter Drucker, management consultant and author\nIn an era of rapid technological evolution, Generation Z (born between the mid-1990s and early 2010s) is emerging as a disruptive force in entrepreneurship. Unlike previous generations, Gen Z has never known a world without digital connectivity, and artificial intelligence (AI) is not a distant concept to them—it's an integral part of how they think, create, and solve problems. From AI-powered personal assistants to machine learning algorithms influencing daily decisions, Gen Z is not just embracing AI—they are using it to rewrite the rules of business.\nThe AI-native generation\nFor Gen Z, AI is not just a tool; it's a collaborator. While older generations often viewed AI with scepticism, fearing job displacement and automation, Gen Z sees AI as an enabler of creativity, efficiency, and accessibility. A recent Deloitte study found that 67 percent of Gen Z believe AI will significantly impact their careers, while over half are already integrating AI-driven platforms into their entrepreneurial pursuits (Deloitte, 2024). This deep integration signals a future where AI is not just supporting business strategies but reshaping them entirely.\nMore than ever, AI is democratising entrepreneurship (Shepherd and Majchrzak, 2022). Traditional barriers such as capital, staffing, and physical infrastructure are being dismantled. With AI-powered platforms like OpenAI, MidJourney, and Notion AI, a single entrepreneur can now handle what once required an entire team—from content creation and marketing to customer service and strategic planning. The rise of AI-assisted solopreneurs exemplifies how digital tools are levelling the playing field, allowing young entrepreneurs to challenge established companies with minimal resources.\nPurpose-driven entrepreneurship\n\nUnlike past generations, where profit maximisation often took precedence, Gen Z prioritises purpose alongside profitability. The intersection of AI and sustainability is particularly notable, as AI-driven solutions are being developed to tackle issues such as climate change, food waste, and ethical consumption. Companies like \"Too Good To Go\", which leverages AI to connect consumers with surplus food from restaurants and grocery stores, illustrate how Gen Z entrepreneurs are aligning business with impact.\nAn IBM (2022) study revealed that 62 percent of Gen Z consumers prefer brands that align with their values, reinforcing the notion that this generational shift is not just a passing trend—it's the new norm. Entrepreneurs who fail to integrate sustainability and ethics into their AI-driven ventures risk alienating a generation that expects businesses to stand for more than just profits.\nThe future of AI-driven entrepreneurship\nAI-powered business ecosystems: The future of entrepreneurship will be built on AI-human collaboration. Research from MIT Sloan suggests that hybrid AI-human teams are more efficient and innovative than human-only teams. AI-powered analytics can help start-ups predict market trends, mitigate risks, and optimise decision-making. Companies leveraging AI as co-founders, advisers, and virtual employees will gain a competitive edge in a data-driven economy.\nThe rise of digital business models: AI is fuelling the expansion of digital-first and metaverse-driven business models. As virtual economies grow, AI-generated content, digital products, and virtual assistants will empower entrepreneurs to build and scale businesses without physical infrastructure. A 2023 Stanford study predicts that AI-driven virtual economies could contribute up to 15 percent to 20 percent of global GDP by 2035 (Gofman and Jin, 2024). Major brands have already begun selling AI-designed virtual fashion, catering to a new wave of digital consumers.\nHyper-personalisation and micro-markets: AI-driven hyper-personalisation is transforming the customer experience. Instead of one-size-fits-all offerings, AI allows businesses to cater to individual preferences through real-time data analysis. AI-powered recommendation engines, similar to those used by Netflix and Spotify, are now extending into e-commerce, offering curated product suggestions for each customer. However, this shift also raises critical policy concerns, including data privacy, algorithmic bias, and consumer manipulation.\nPolicy and ethical considerations\n\nWhile AI-driven entrepreneurship presents boundless opportunities, it also introduces significant ethical and regulatory challenges.\nData privacy: With AI-powered hyper-personalisation, businesses are collecting unprecedented amounts of consumer data. Policymakers must enforce stricter data protection laws to prevent misuse and ensure transparency.\nAlgorithmic bias: AI systems are only as unbiased as the data they are trained on. Regulators must address fairness in AI decision-making to prevent systemic discrimination in hiring, lending, and customer engagement.\nJob displacement: AI automation is transforming industries, creating both opportunities and risks. Governments and educational institutions must rethink workforce development strategies to equip future entrepreneurs with AI-related skills.\nAI taxation and regulation: As AI takes on more roles traditionally held by human employees, policymakers are debating the taxation of AI-driven businesses to ensure fair economic contributions.\nThe leadership shift\nBeyond business strategy, AI is reshaping leadership itself. With automation handling routine tasks, Gen Z entrepreneurs are focusing on creativity, emotional intelligence, and adaptability. Traditional hierarchical leadership models are giving way to agile, collaborative structures where AI and human intelligence work in tandem. The leaders of tomorrow will not be those who resist AI but those who harness its potential ethically and responsibly.\nFinal thoughts\nGen Z's deep integration with AI is not just shaping the future of entrepreneurship—it is rewriting what it means to build, innovate, and lead in an AI-driven world. Yet, this transformation comes with risks. A 2023 MIT Sloan study highlights that AI-human hybrid teams boost innovation, but concerns over job displacement, algorithmic bias, and data privacy persist. Meanwhile, Stanford research forecasts that AI-driven virtual economies will redefine global markets, necessitating regulatory frameworks around taxation, cyber security, and fair competition.\nAs AI and human intelligence continue to intertwine, the key question remains: will AI-driven entrepreneurship empower a new generation or widen inequalities? The answer depends on how well Gen Z balances innovation with ethical responsibility. To ensure AI remains an inclusive force, policymakers, educators, and business leaders must work together to foster responsible AI development. The next chapter of entrepreneurship is being written now, and Gen Z is at the helm—steering us into uncharted territory, where the only constant is change.\nDr Ariful Islam is an academic and entrepreneurship researcher specialising in mixed methods.\nDr Mohammad Imtiaz Hossain is a faculty member in Sunway Business School, Sunway University, Malaysia.\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Gen Z is writing the next chapter of entrepreneurship with AI ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/gen-z-writing-the-next-chapter-entrepreneurship-ai-3868871",
        "news_paper_name": "The Daily Star",
        "publish_date": "12-04-2025"
    },
    {
        "full_article": "We are concerned about the situation at upazila health complexes where a severe shortage of doctors and essential staff is disrupting healthcare services. According to the Directorate General of Health Services (DGHS), around 59 percent of doctor positions in these health complexes remain vacant, while absenteeism is another major barrier to providing treatment to rural patients. Many of these facilities also lack specialist doctors, forcing patients to seek treatment at district or medical college hospitals. With such inadequacies, what is the point of having these facilities?\nStaff and doctor shortages have been a persistent issue for the upazila health complexes but little action has been taken to address it. Recently, this daily published a report on the Kulaura Upazila Health Complex in Moulvibazar suffering from a similar shortage. The facility, serving a population of five lakh, has only two doctors. Similarly, the 50-bed Phulbari Upazila Health Complex in Dinajpur has only three regular doctors to serve an average of 80-90 patients daily. Patients unable to access services at these health centres are often forced to turn to private clinics, increasing their healthcare expenses.\n\nAt the Phulbari Health Complex, there are 182 positions for doctors, nurses, and fourth-class employees, but nearly half have remained unfilled for years. In Khulna division, 896 of the 1,327 doctor positions in upazila health complexes remain vacant. Meanwhile, Bandarban district is grappling with a shortage of over 300 staff, including doctors. Clearly, the crisis prevails across the country.\nAt the Phulbari Health Complex, there are 182 positions for doctors, nurses, and fourth-class employees, but nearly half have remained unfilled for years. In Khulna division, 896 of the 1,327 doctor positions in upazila health complexes remain vacant. Meanwhile, Bandarban district is grappling with a shortage of over 300 staff, including doctors. Clearly, the crisis prevails across the country. The reasons for this are well-known. Since the recruitment of doctors is conducted through the BCS exams, the lengthy recruitment process often delays appointment. Also, doctors posted at the upazila level often prefer living in Dhaka rather than staying in remote areas, disregarding the rules. Furthermore, many doctors, nurses, and other staff members frequently remain absent or on leave due to a lack of discipline and proper oversight. This must change.\nThe government must develop a comprehensive plan to address the manpower shortage in local-level health complexes. As these facilities play a crucial role in delivering critical services at the grassroots level, they should be adequately staffed. The Public Administration Reform Commission has proposed the establishment of a dedicated Public Service Commission (Health) to manage recruitment, promotions, and other related activities in the health sector—which should be seriously considered to streamline healthcare operations and improve efficiency. Reform is crucial to ensuring healthcare for all.\n",
        "headline_1": "Make upazila health complexes effective",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/make-upazila-health-complexes-effective-3867126",
        "news_paper_name": "The Daily Star",
        "publish_date": "12-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 12, 2025 00:00:00  \nIt is indeed an occasion to celebrate as Bangladesh has become the 54th nation to commit to safe and responsible exploration of space for the greater good of humanity through inking the 'Artemis Accords' with 'National Aeronautics and Space\nAdministration (NASA)' of the USA on the sidelines of the investment summit on April 8 in Dhaka. While signing the deal, the official representing Bangladesh did not fail to mention that the country had been following the international norms for peaceful use of space since long. After becoming part of the prestigious international space alliances, Bangladesh can now truly claim its due share of the wealth of space research and its products through collaborative ventures as well as technology transfer. \nNotably, the Artemis Accords established by the NASA in 2020 are a set of non-binding agreements aimed at promoting peaceful, cooperative, and transparent exploration of outer space, particularly focusing on activities related to the Moon, Mars, and other celestial bodies. Now, the question may arise if Bangladesh can afford the luxury of rubbing shoulders with nations far advanced in science, especially space technology. Moreover, if Bangladesh, as a member of the Least Developed Countries (LDCs) and still struggling with its limited resources and a large population to feed, meets the basic requirements to enter the high-tech arena of space exploration! Interestingly, Janet Petro, acting administrator of the NASA, in her virtual message to the signing ceremony of the Artemis Accords, has herself answered the question on our behalf as to why Bangladesh should join space programme forthwith. It would be worthwhile to quote here in her own words in what high esteem she holds the youths of Bangladesh when it comes to their potential as worthy partners from Bangladesh in space exploration with other advanced nations. In fact, she was rather effusive when she said, \"The young minds of Bangladesh have shown the world their passion for space exploration\", as, \"In four of the last six years, Bangladeshi innovators have been global champions in NASA's space apps challenge… I have no doubt we will continue to see extraordinary scientists, engineers and even future astronauts emerge from Bangladesh.\" \nClearly, it is again the Bangladeshi youths who wrested their country free from the clutches of autocracy through July revolution are also playing a leading role in space science. So, from the older generation's perspective, Bangladesh may still look unprepared to join the space age if not the race. Driven by such globally acclaimed potential and talent of the country's young space scientists, Bangladesh can even benefit from the latest advancements in space technology both in terms of research and its products. \nIn this connection, it may be recalled how Bangladesh first stepped into the arena of space science through establishing the 'Space Research and Remote Sensing Organization (SPARSO)' in 1990. Though the country is still far behind many other nations including our neighbouring India, it would be sobering to remember that all space research had a modest beginning through sending rockets in near space to study changes in the atmospheric conditions as part of the meteorological research. From that point of view, Bangladesh might still be in its infancy in space research. But once the young scientists of the new generation get the opportunity to engage themselves in space research at home in collaboration with their international partners, the day is not far off when Bangladeshi scientists including even local astronauts would be taking part in international space programmes.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bangladesh joins global space research",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bangladesh-joins-global-space-research-1744377166",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       April 12, 2025 00:00:00  \nThe public uproar following the horrifying rape of an eight-year-old girl in Magura has once again propelled the government to make changes to the Women and Children Repression Prevention Act. This renewed initiative came amid a surge in sexual violence against girls and women, leaving many feeling unsafe in their homes, on public transport and in outdoor spaces. The government's move to modify the existing legislation seemingly acknowledges the perceived inadequacies within the justice system that may be fuelling this rise in violence. It also raises the crucial question of how much the amended law will contribute to building a safer environment for women in the country now that it is in effect. \nIn modern political systems, citizens expect their governments to maintain law and order and ensure a baseline level of security and stability. Consequently, an increase in severe crimes such as rape often leads to public scrutiny and demands governmental action. While complete elimination of crime may be an unattainable goal, governments are nonetheless expected to employ their resources to effectively deter criminal activity and guarantee that perpetrators of such crimes face swift punishment.\nHowever, in Bangladesh, there is a recurring pattern that legislative changes are pursued in response to public outrage rather than as part of long-term strategic reforms. This reactive approach can lead to a cycle of repeated amendments, each seemingly making the law stricter without necessarily resulting in a tangible decrease in the targeted crime. The Women and Children Repression Prevention Act itself has undergone several such revisions.\n\nPast experience shows that even well-meaning legal provisions often falter due to poor implementation. Previously, rape trials were supposed to be completed within 180 days of a tribunal receiving the case. Failure to meet this deadline meant that the tribunal, prosecutor, and police had to submit written explanations to their respective authorities. Despite frequent breaches of this 180-day limit, the recent amendment reduces the trial period to just 90 days. Given that cases are already languishing beyond the 180-day deadline, how realistic is it to expect their resolution in half that time without a corresponding increase in operational capacity? Reportedly, over 0.15 million cases related to violence against women and children are currently under trial at the existing 101 tribunals. With each tribunal burdened with around 1,500 cases, the implications of imposing a stricter trial deadline are readily apparent. Hoping to achieve a marginal reduction in the tribunals' workload, the amendment provides for the transfer of \"simple hurt\" cases of dowry disputes to first-class magistrate courts. However, this limited shift is unlikely to substantially alleviate the existing burden enough for the tribunals to realistically ensure timely trial completion. \nA significant factor contributing to delays in rape trials in Bangladesh is often the procedural procrastination by lawyers, who face no accountability for unwarranted delays. Regrettably, the amendment appears to have overlooked this critical aspect. Meaningful reform aimed at expediting trials requires provisions that hold legal professionals to account for delaying tactics that obstruct due process.\nThat said, the latest amendment does introduce a significant correction which is the removal of bail eligibility for rape accused if trials exceed stipulated timeframe. Given that delays are the norm, many accused individuals were often released on bail that caused victims to go into hiding for fear of reprisal. The amendment's combination of eliminating this bail provision with the aim of shorter trial durations (90 days) is a positive step. By significantly reducing the waiting period for trial, the rationale behind granting bail to the accused is diminished, thereby potentially enhancing the security and sense of justice for victims.\nAnother promising aspect of the amended law is the introduction of a \"Zero FIR\" provision, which mandates that all police stations must accept rape complaints regardless of jurisdiction. Victims have frequently reported being turned away by police on the grounds that the crime occurred outside the station's area. This issue is particularly prevalent in cases with significant implications, possibly due to a desire to avoid media attention or the pressure of a swift investigation. This jurisdictional rigidity has been a major impediment to timely justice, especially for victims who experience sexual assault while travelling. The new provision would remove this barrier, potentially saving crucial time and preserving vital evidence. India, which implemented a similar Zero FIR provision last year, has seen it lauded for enabling quicker police intervention.\nHowever, one aspect of the amended ordinance has become a notable point of contention and is already being challenged in court through a writ petition. It is the provision that allows for prosecution of individuals for engaging in sexual intercourse under a false promise of marriage, an action that, if aimed at obtaining other valuables, would likely to be classified as fraud. Treating this as an offence under the act blurs the lines between criminal deception and sexual violence, and also creates a risk of misuse. Even under Sharia law, consensual intercourse between adults is typically regarded as fornication, for which both parties are held accountable. Framing it solely as a crime by the male participant, as the amendment does, is oversimplifying a complex issue. \nPervasive sexual violence in Bangladesh is tragically enabled by the silence of many victims, which often allows perpetrators to escape punishment. Sexual predators continue to exploit opportunities in homes, educational institutions, workplaces and public areas. Past successes such as drastic reduction in acid attacks following targeted legal and administrative reforms demonstrate that change is possible with governmental commitment. However, legislative amendments alone are insufficient. The government must prioritise making it safe and easy for all victims, especially children, to report these offences. A dedicated helpline, widely promoted through social and online platforms, is an essential step in that direction. As long as reporting sexual offences remains cumbersome and intimidating, only the most resilient and resourceful individuals will likely to come forward, leaving countless others deterred by the daunting prospect of engaging with the police.\nshoeb434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Rape law has changed, will justice follow?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/rape-law-has-changed-will-justice-follow-1744377405",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       April 12, 2025 00:00:00  \nAfter celebrating Eid-ul-Fitr, the nation is gearing up for another national festival, Pahela Boishakh to be precise, on Monday next. It is the first day of the Bangla New Year and marks the start of summer. Over the decades, welcoming the Bangla New Year through a series of socio-cultural activities has become a tradition in the country. More than six decades ago, the Chhayanaut initiated the move to formally welcome the first day of Boishakh, the first month on the Bangla calendar, with songs and music. The move was driven by the zeal to uphold the cultural heritage of Bengal. It also served as a powerful tool to protest against the Pakistani oppression and cultural hegemony. \nOf course, this year's Chhayanaut event at Raman will greatly miss Sanjida Khatun, one of the key founders of the organisation, who passed only three weeks ago. Until her death, she was the core driving force of the organisation. Those who used to attend the annual Ramna Batamul event will feel the vacuum due to her absence. The musicologist, cultural activist, freedom fighter, teacher and researcher will no longer read, recite, sing and talk at the celebration. Her memories will definitely be cherished during the Pahela Boishakh celebration. Her courage and dedication will continue to illuminate those who believe in Bengal's cultural heritage and Rabindranath's philosophy. \nAfter the independence of Bangladesh, the cultural movement gained traction, and people across the country gradually started to organise various events to celebrate the first day of Boishakh. Besides the socio-cultural dimension, the economic facet emerged as a key part of the celebration since the late '90s. Today, Boishakh is the third largest annual business event after two Eids. Colourful attires and various foods and sweets are now essential for the celebration. The day also provides an opportunity for socialisation among neighbours and friends. \nThis year, Pahela Boishakh will be observed in a different tone due to a political changeover in the country through a mass uprising nine months ago. Now, the interim government has decided to celebrate the Pahela Boishakh differently. The day will not be celebrated only as a festival of the Bangalees but also nationally by ensuring the participation of all other ethnic groups in the country, including Chakma, Marma, Tripura, Manipuri, Garo etc. These ethnic groups also have their own New Year festivals known together as Vaisabi. It is a common festival for hilly-ethnic people residing in Chittagong Hill Tracts. The Chakmas call the festival Biju, the Tripuris call it Baishu, and the Marmas call it Shangrai. It is good that the Vaisabi coincides with the Pahela Boishakh. Inclusion of these ethnic groups makes the Boishakhi celebration pluralistic and a unique Bangladeshi national festival. In this process, others can learn more about these ethnic communities. \nEducational institutions are also asked to celebrate the day under their own management, which is good. In this connection, schools and colleges may arrange a 'book as a gift of Boishakh' programme, encouraging students to exchange books with one another. This educational initiative, around four decades ago, was a brainchild of Fazle Rabbi, the then director of the National Book Centre, who floated the idea under a slogan: 'Give books to your dear ones on Bangla New Year's Day.' He also formally gifted a set of books to the then-president of Bangladesh, making it a part of Pahela Boishakh celebration. The formal initiative, however, continued for a few years only and later vanished. Nevertheless, it is not difficult to revive the good initiative. This can add a unique and enriching dimension to the celebration. \nSadly, some extremist groups find it wrong to celebrate the day on account of their misunderstanding and misinterpretation. However, it is important to reiterate that rejection of extremism on the occasion of Pahela Boishakh is a shared value among the majority people. The groups must learn to respect others' views they do not subscribe to. A secular, inclusive and pluralistic celebration brings communities closer to each other.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Pluralistic dimension of Pahela Boishakh",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/pluralistic-dimension-of-pahela-boishakh-1744377469",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 12, 2025 00:00:00  \n\nThe Sundarbans-the world's largest mangrove forest-is a natural marvel teeming with biodiversity and the aesthetic brilliance of life. Among its many wonders is the Golpata, a plant whose golden hue and multifaceted utility have earned it a cherished place in the hearts of local communities and nature enthusiasts alike.\nThriving in the waterlogged soil and humid climate of the Sundarbans, the Golpata (Nypa fruticans) displays soft, salty folds in its leaves, resembling nature's own intricate carvings. The leaves' thickness and flexibility make them ideal for constructing natural shelters for locals, while also playing a crucial role in retaining soil moisture. By enhancing the soil's resilience, Golpata helps prevent erosion-a vital function in a fragile mangrove ecosystem. Its golden and soft green tones create an ornamental beauty within the forest, drawing the attention of tourists and biodiversity lovers alike.\nGolpata tree also holds cultural and historical significance for the Sundarbans and its people. Its versatile applications in daily life reflect a deep connection between the environment and the community. Locals commonly use Golpata leaves to construct simple yet effective thatched roofs. These natural materials allow for better air circulation and temperature regulation, perfectly suited to the climate. Additionally, the leaves serve as a raw material for crafts that combine local artistry with the colours of the forest, forming a unique expression of cultural heritage. Golpata is frequently referenced in local anecdotes, folklore, and community stories, symbolising the enduring trust and harmony between humans and nature.\nIn essence, Golpata of the Sundarbans is more than a plant; it is a living emblem of cultural tradition, economic resilience, and environmental harmony. Its golden touch weaves a tale of creativity and sustainability, echoing through every corner of the forest. For generations to come, Golpata will remain an enduring chapter in the story of Bangladesh's natural and cultural heritage.\nSadia Sultana Rimi\nStudent, Mathematics Department\nJagannath University, Dhaka\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Golden touch of the Sundarbans",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/golden-touch-of-the-sundarbans-1744377485",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-04-2025"
    }
]