[
    {
        "full_article": "The e-ticketing system of the Indian Railway Catering and Tourism Corporation Ltd. (IRCTC) is one of India’s most widely used e-commerce platforms. Crores of Indian rail commuters and passengers use it to book their tickets, which makes it imperative that the system is run robustly. The scale of the operation is revealing — on May 22, 2025, the IRCTC processed a staggering 31,814 tickets in 60 seconds to set a new record. Yet, the popular e-ticketing system, especially the Tatkal booking part, is plagued by issues. Extremely high demand during peak hours, particularly during the designated Tatkal booking window period, often leads to crashes and slow performance. A major concern is that the system is exploited by ticketing agents who use unfair automated tools (or bots), leading to rapidly dwindling ticket availability for passengers. These issues are what prompted the IRCTC to announce two major steps. The first was a major digital overhaul of the ticketing infrastructure using anti-bot systems to prevent unauthorised automated bookings — a measure that led to the de-activation of a whopping 2.5 crore suspect user IDs. Implementation of a content delivery network also helped improve website performance. In addition, Aadhaar verification is necessary immediately after a ticket is booked. The IRCTC has also mandated Aadhaar authentication for all Tatkal bookings, from July 1, along with OTP-based authentication. Authorised agents have been restricted from booking Tatkal tickets during the first 30 minutes of the booking window period.The idea behind an e-ticketing platform and the provision of Tatkal booking of tickets are to provide equitable chances for passengers to travel. Despite more train services having been introduced over the years by the Indian Railways, which is a state monopoly, demand far outstrips supply, and passengers have to rely on advanced booking and Tatkal tickets for their travel. When agents use bots to game the system, it kills the purpose of equity. Therefore, the IRCTC’s steps will bring relief to passengers. That said, the Indian Railways must focus not only on easing the process of ticketing but also on elevating the passenger experience in terms of increasing its train and track capacity to fulfil travel demand, ensuring safety and enhancing its facilities. Seen in this context, while these ticketing fixes are important, the true test for the Indian Railways will be its ability to move beyond just technical and administrative solutions and undertake a fundamental expansion of its services to serve India’s large passenger clientele. In a way, meaningful expansion to meet the demand will also obviate the need for reworking technological solutions yet again in the future.\r Published - June 13, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        indian railways\n                    \n                            /                      \n                        \n                        electronic commerce\n                    \n                            /                      \n                        \n                        technology (general)",
        "headline_1": "A good fix: On the IRCTC and ticket booking",
        "headline_2": "The measures to curb agent and bot booking on IRCTC will benefit passengers",
        "link": "https://www.thehindu.com/opinion/editorial/a-good-fix-on-the-irctc-and-ticket-booking/article69687880.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "13-06-2025"
    },
    {
        "full_article": "When the then South Korean President Yoon Suk Yeol declared martial law in December 2024, his objective was to bypass the opposition-controlled National Assembly and rule with the support of the military. He had also planned to arrest opposition politicians, including Lee Jae-myung, the head of the Democratic Party, his bête noire. But the move backfired dramatically, leading to his abrupt downfall and paving the way for Mr. Lee’s ascent to the presidency. In the June 3 election, which was necessitated by the impeachment of Mr. Yoon, Mr. Lee, a progressive liberal, won 49.4% votes, defeating Kim Moon-soo of Mr. Yoon’s conservative People Power Party, who secured 41.2% votes. The peaceful and democratic transition, following a period of chaos and turmoil, is a testament to the strong fundamentals of South Korea’s young democracy. For a nation that endured decades of brutal military dictatorship, the imposition of martial law was tantamount to cutting open the old wounds. South Koreans, both the political class and civilians, offered resistance. Mr. Yoon’s political collapse unfolded so fast that future leaders would think twice before undermining the country’s democratic institutions. Still, the election of Mr. Lee is only the first step in restoring order and stability.Mr. Lee, who survived legal challenges and an assassination attempt last year, enters the Blue House with a strong mandate. His party is in a majority in the National Assembly, giving him legislative leeway. However, while those responsible for the martial law fiasco must be held accountable, he must resist the temptation to turn this into a political witch-hunt. On the economy front, Mr. Lee should take swift measures, including the implementation of a promised stimulus package to jump start growth. Just last month, the central bank cut the country’s full-year economic forecast by half to 0.8% amid trade and tariff concerns. In foreign policy, Mr. Lee faces a complex balancing act. During the campaign, he had said that the U.S. was “the basis axis of our diplomacy”, but expressed a desire to improve commercial ties with China, the largest trading partner. Under Mr. Yoon, relations with China took a hit, and tensions with North Korea escalated. In a first step to improve inter-Korean relations, Mr. Lee decided to turn off loudspeakers on the border that had been broadcasting K-pop songs and propaganda. He has said he does not want South Korea to be reliant only on the U.S. To that end, what he must do is to invest in peace on the Korean Peninsula and expand Seoul’s relationship with major powers, while preserving its strategic partnership with the U.S. Published - June 13, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        South Korea\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        armed Forces\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        North Korea",
        "headline_1": "​Out of the abyss: On South Korea, its new President",
        "headline_2": "South Korea needs to expand trade ties with major countries",
        "link": "https://www.thehindu.com/opinion/editorial/out-of-the-abyss-on-south-korea-its-new-president/article69687751.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "13-06-2025"
    },
    {
        "full_article": "Wherever in the world we go, it feels like home only\nOn a street in Turin, a young man walked past me talking on his cell phone, and I suddenly felt a sense of spatial displacement, of not knowing where I was. Because the young man was speaking in Punjabi, making me think for a moment that I was back in India instead of in Italy.\nIt happens to us all the time. Wherever we Indians travel, we come across other Indians who are residents of the place we’re visiting.\nI’ve never had the opportunity of travelling to Tierra del Fuego, the archipelago at South America’s southernmost tip which is shared by Chile and Argentina and translates as ‘the end of the world’, but were I ever to do so, I wouldn’t be at all surprised to be greeted with a ‘Namaste, Bhaisaab’ by a domiciled Tierra del Fuegan.\nThere are some 35.4mn people of Indian origin, PIOs, scattered across the globe. Which is 8.7mn more than the residents of the Australian continent, and is the biggest migratory population in the world.\nThere are many reasons for this mass migration, economic compulsions and seeking greener pastures abroad being the most common and the most obvious.\nAn ancillary factor might be what could be called the toothpaste tube effect: when the tube is squeezed, the toothpaste gets extruded from it. With its population of 1.438bn having overtaken that of China, making it the most populous country on the planet, India is like a squeezed tube of toothpaste.\nWe think of India as a big country and it is. It’s five times larger than France and nine times larger than Germany, but US is three times the size of India with a population merely a quarter that of India’s.\nCanada is also about three times the size of India and has a population of only 40mn, just seven million less than that of the city of Delhi. Russia is four times bigger than India and its population is one-tenth of India’s.\nSqueezed out India might well represent an international toothpaste brand called Akhand Bharat.\n\n",
        "headline_1": "Toothpaste India",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/toothpaste-india/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-06-2025"
    },
    {
        "full_article": "World’s third-largest aviation market needs to address several structural issues quickly\nThe terrible aviation tragedy in Ahmedabad is a grimly appropriate occasion for reviewing the current status of Indian civil aviation. India has emerged as the third-largest aviation market in the world in terms of passenger traffic. It’s also the sixth largest market for air cargo. And with infra growth over the last few years and regional connectivity scheme UDAN, the sector is primed for further expansion. However, several structural problems are flashing red.\nFirst, the aviation sector has practically transformed into a duopoly with IndiGo and Tata Group’s airlines accounting for nearly 90% of the market. This is incongruent with rapidly growing passenger traffic. True, running airlines is tough business, especially in a high-cost environment such as ours. But a larger pool of airlines will help solve issues downstream, including pricing. Second, financially stressed airlines are cutting corners on safety and engineering. Just last year, Bureau of Civil Aviation Security fined IndiGo for violation of aviation security protocols; DGCA fined Akasa Air for multiple regulatory violations; and Air India was penalised for violating safety rules on certain long-range routes. Third, by March this year 133 aircraft across airlines – 16% of the industry’s overall fleet – were grounded due to supply chain issues, particularly with Pratt & Whitney engines. Switching over to reliable engines must be expedited.\nFourth, as the sector expands, there’s an acute shortage of pilots and ATCOs. India needs an additional 10,900 pilots by 2030 on top of the current roughly 11,745. Similarly, by the end of 2024 there was a requirement of 5,428 ATCOs, a 70% increase from current levels. Finally, there are few specialists at the helm of aviation regulatory agencies. This again is out of sync with a fast-expanding aviation market. The sector’s growth story can’t be put on autopilot. It has to be carefully nurtured, and gaps addressed quickly.\n\n",
        "headline_1": "Some plane truths",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/some-plane-truths/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-06-2025"
    },
    {
        "full_article": "What caused the crash? A thorough probe and corrective action are necessary to reassure fliers\nYesterday’s plane crash will count among the worst aviation disasters in history. It certainly is the deadliest in India this century. By late evening, police had found only one survivor among the 242 passengers and crew, and confirmed deaths of at least five students at the medical college hostel the plane flew into. There’s shock, because plane crashes are extremely rare – the last one in India occurred in Aug 2020. And there’s anxiety, which can only be quelled by honestly investigating what went wrong – malfunction, human error, or something else. The preliminary probe report, which must be submitted to International Civil Aviation Organisation within 30 days, should be made public.\nFor perspective, the Air India Boeing 787 named ‘VT-ANB’ was only 11 years old – Qatar’s 747-8 gift for Trump is 13, so age was not an issue. How it lost power seconds after take-off, reportedly at a height of around 700ft, is, therefore, a mystery. There’s speculation about a bird hit – which played a role in last year’s Jeju Air disaster in S Korea, and 2009’s “miracle on the Hudson” that made Capt CB “Sully” Sullenberger famous. There are also theories about the “odd” positions of the lost plane’s landing gear and wing flaps. But armchair expertise goes only so far. What the fastest growing major aviation market needs is definite answers.\nAnd Boeing, which has been mired in controversies, ranging from 737 Max crashes to last year’s Starliner fiasco that stranded Sunita Williams and Butch Wilmore at the ISS, would want to clear the air fast as well. To be fair, the 787 Dreamliner had a clean safety record until yesterday. In the 14 years since its introduction – 1,175 planes, 2,100 daily flights, 1bn passengers flown – no Dreamliner had crashed. But it’s also true that the plane’s had its share of scares over the years, from fuel leaks to smoking lithium batteries, and warnings about a computer chip that could be hacked. In 2019, Boeing workers complained about shoddy production, and last year a whistleblower claimed the Dreamliner had structural flaws that could make it disintegrate mid-flight.\nAir India, which came under Tata Group’s control three years ago, has faced many embarrassments on the service front – choked loos, sagging seats – but this crash raises the critical issue of safety. So, all sides – AAIB, Boeing, Air India – need to work together. US Federal Aviation Administration has also volunteered help. A thorough probe, followed by corrective action, can reinforce the point that flying remains the safest mode of transportation. Until yesterday afternoon, 230 fliers had been killed in crashes within India this century – on our roads, 474 people die every day.\n\n",
        "headline_1": "Clear the air",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/clear-the-air/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-06-2025"
    },
    {
        "full_article": "Over 10 days, across seven cities in four countries, I was part of a multiparty Indian delegation engaging the Global South – not only to explain Operation Sindoor, but to understand how India’s actions are seen in a changing world. Read full story on TOI+\n\n",
        "headline_1": "What our MPs said, and heard",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/what-our-mps-said-and-heard/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-06-2025"
    },
    {
        "full_article": "The prolonged closure of the National Institute of Ophthalmology and Hospital (NIOH)—the country's largest public facility for eye care—is something that should never have happened, given how it not only affects ordinary patients seeking eye treatment but also worsens an already battered image of the state's handling of those injured during the July uprising. At this point, it is immaterial to debate who was or is more at fault for the paralysis—hospital staff or the protesting July Joddhas. What's important is that ordinary patients are suffering because of it.\nOn Thursday, outpatient (outdoor) services resumed after a suspension that began on May 28, about two weeks ago, while emergency services resumed on a limited scale on June 4. But other essential services remain halted. Worryingly, the prospect of full operations being restored on Saturday is clouded by fears that tensions may again flare up with the likely return and re-mobilisation of injured protesters following the end of the Eid holiday. The protracted stalemate has already caused immense hardship for low-income patients who rely on this facility for affordable care, with thousands turned away. Any further disruption will only deepen their suffering and further erode trust in the authorities' ability to mediate convincingly in this meaningless standoff.\nThis latest episode in the short history of public outbursts by injured July Joddhas started on May 28. That day, a group of protesters long admitted to NIOH allegedly attacked the staff as well as residential quarters, sparking a three-way clash that also involved other patients and their attendants. A number of individuals were injured, including doctors and nurses. All this led hospital staff to suspend services over safety concerns. Despite sporadic negotiations and partial service resumption afterwards, things remain tense. Fuelling concerns is the refusal of July protesters to accept discharge letters despite many among them being cleared by a medical board on June 4.\nAgainst this backdrop, the hospital authorities, as one of the involved parties, may find it difficult to broker a solution alone. The onus, therefore, lies with the higher authorities to mediate a solution that ensures uninterrupted treatment for both the July injured and the general public. This will require clear communication of discharge procedures and addressing the protesters' grievances about neglect or malpractice. The July Joddhas deserve proper care. But so do the ordinary patients who come to this hospital for treatment.\n",
        "headline_1": "Fix the mess at NIOH immediately ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/fix-the-mess-nioh-immediately-3915836",
        "news_paper_name": "The Daily Star",
        "publish_date": "13-06-2025"
    },
    {
        "full_article": "Even if the much-anticipated meeting between Chief Adviser Prof Muhammad Yunus and Tarique Rahman, acting chairman of the BNP, the leading political party in Bangladesh, fails to fulfil the high expectations of bridging differences over the recently unveiled election roadmap, London has nonetheless emerged as the place where the interim government's strategy gained much-needed clarity. This was largely due to the Royal Institute of International Affairs, commonly known as Chatham House, hosting Prof Yunus for a discussion and Q&A session focused on Bangladesh's future trajectory. The conversation addressed both domestic issues, such as elections, democracy, and institutional reforms, and foreign policy concerns, particularly relations with India and the Rohingya refugee crisis.\nThis context underscores a glaring issue: the Chief Adviser's Office still lacks an effective communication strategy. Had similar interactive press sessions been held in Dhaka over the past 10 months, many unanswered questions might have been addressed. Of course, no one desires a return to the fawning praise and suppression of dissent that characterised Sheikh Hasina's rule over 15 and a half years. However, meaningful engagement with the press—beyond selective interviews or statements by a frequently seen spokesperson—is long overdue.\nAt Chatham House, while most questions came from the moderator and sympathetic expatriates, the chief adviser's responses were clear and direct. His categorical rejection of any future political role and dismissal of the idea of a referendum are especially significant. Critics and conspiracy theorists have long speculated that the delay in holding elections beyond December 2025 is driven by his personal political ambitions. A referendum, they argued, could be used as a means to extend his mandate under the guise of enacting reforms. His unequivocal stance helps dispel those suspicions.\nYunus reiterated that the interim government has three core mandates: a) reforming institutions that enabled the rise of authoritarianism; b) ensuring accountability for those involved in killing protesters and committing grave human rights violations; and c) holding a free and fair election. While these goals are widely supported, the question of a timeline remains contentious. The consultation process involving stakeholders and the complexities of judicial procedure make it nearly impossible to fix definitive deadlines for the first two objectives.\nHis declaration—\"None of our cabinet members (of the interim government) would like to do that (stay in power)… Our job is to manage a smooth transition and ensure the people are happy when we hand over power to an elected government\"—was reassuring. It addresses concerns raised by senior BNP figures who question the interim government's neutrality, particularly due to the continued presence of two former student leaders in ministerial positions.\nAllegations have surfaced that these two figures are preparing to contest in the next general election and intend to join the newly formed National Citizen Party (NCP) once the election schedule is announced. Yunus's remarks suggest he has confronted them directly and secured assurances that they will not exploit their current roles for electoral gain.\nAnother pivotal issue raised was the future of Awami League following the ban on its activities. According to Yunus, the party, as it existed prior to August 5, has effectively sealed its fate as a criminal entity and cannot be considered a legitimate political organisation until it is held accountable for crimes against humanity. His observation that \"none of that party has ever expressed remorse\" leaves a narrow window for a reformed entity to seek national forgiveness—though such a transformation would demand genuine contrition and structural overhaul.\nThis puts pressure on international observers and allies of the Awami League, particularly India, who continue to call for the party's inclusion in future elections. They now face a stark choice: either persuade the Awami League to acknowledge and rectify its past, or accept the reality that the Bangladeshi public has decisively turned away from it. Even The New Indian Express, a publication close to India's ruling establishment, acknowledged in a June 2 editorial titled \"Bangladesh history closes a dark loop with case on Hasina\" that any push for inclusion without accountability is untenable, \"If Hasina must be held to account, let the law take its course.\"\nMeanwhile, Awami League's refusal to accept this new reality remains astonishing. Protests in London against Prof Yunus and the interim government—organised by some of the former Awami League ministers and MPs, who fled Bangladesh with dubious documents last year—only highlight their disdain for the law and public sentiment. Recorded interviews with the party's General Secretary Obaidul Quader and former minister Rezaul Karim openly acknowledging their illegal border crossings further expose their disregard for legal norms.\nWhile it would be speculative to draw a direct connection between the Chatham House event and the Yunus-Rahman meeting, the former served as a timely opportunity to clear the air and possibly mend perceived rifts between the interim government and BNP. As BNP Secretary General Mirza Fakhrul Islam Alamgir hinted, this meeting could well mark a turning point in Bangladesh's political trajectory—if all goes as intended.\nKamal Ahmed is head of the Media Reform Commission in Bangladesh and an independent journalist. His X handle is @ahmedka1.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Clarity from one London dialogue: Will the other follow suit?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/clarity-one-london-dialogue-will-the-other-follow-suit-3915346",
        "news_paper_name": "The Daily Star",
        "publish_date": "13-06-2025"
    },
    {
        "full_article": "I've been trying to follow the Global March to Gaza for over a month now. The only glimpses I've found come from Al Jazeera, Turkey's Anadolu Ajansı, and a handful of Palestinian news portals.\nBut the march is happening -- right now -- and most of the Western world either doesn't seem to notice or is blatantly choosing not to. It's most likely the latter.\nAcross every inhabited continent, thousands are mobilising: marching, chanting, risking arrest, demanding justice for Gaza. Among them are doctors and teachers, imams and priests, students and elders -- united in historic solidarity.\nAnd yet, if you turned on your television this morning, scrolled through your feed, or flipped through a newspaper, you'd barely know it was happening.\nThis silence is not accidental. It is carefully engineered.\nPicture this: a convoy of nine buses carrying nearly a thousand activists, backed by unions, bar associations and rights groups, departing Tunis and crossing into Libya -- en route to Egypt's Rafah crossing. They're supported by Tunisian labour leaders and legal defenders, standing in defiance of a siege in what the UN calls \"the hungriest place on Earth\". Even yesterday, Swiss activists set out for Egypt.\nTheir goal is symbolic and profound: to break the blockade, deliver aid, bear witness to genocide, and pressure world leaders into action -- much like the Madleen crew, whose mission was intercepted just days ago.\nThe convoy is expected to arrive in Cairo today. From there, they plan to march through Sinai, traverse El Arish, and reach Rafah -- even while knowing Egypt may deny them entry and Israeli forces await at the border.\nThis is a truly global movement. Activists from 50 countries are converging in Cairo under banners like the Palestinian Youth Movement, Codepink, and Jewish Voice for Labour -- with support from 150 organisations across 31 nations. Hundreds more are joining from Algeria, Libya, Morocco and Mauritania. Some will come by land, others by sea.\nOn the Mediterranean, the aid ship Madleen, bound for Gaza with humanitarian supplies and carrying Greta Thunberg, a French MEP, a journalist and many more, was intercepted by Israeli forces in international waters. All passengers were detained -- some later deported, others imprisoned in Israel. The act drew international condemnation -- from France, Spain and Turkey.\nThe stakes could not be higher. Gaza has been under siege for more than 20 months. A genocidal war has killed over 54,900 Palestinians and injured more than 126,000. Aid distribution sites have become death zones -- Israeli forces have killed over 224 Palestinians gathering food since May 27 alone, wounding nearly 2,000. Schools lie in ruins, hospitals are bombed out, water is scarce. Hunger is weaponised. Gaza is collapsing.\nAnd still, the Western media says almost nothing.\nThis diverse, global act of civilian resistance doesn't fit the dominant narrative where Palestine is framed as fringe insurgency, Israel as self-defence. To acknowledge thousands marching peacefully against genocide would dismantle that fiction. So, the silence holds -- no live feeds, no front pages, no analysis. Just vacuum. A sickening and deliberate vacuum.\nIn fact, over 100 BBC employees have allegedly accused the British broadcaster of pro-Israel bias in its coverage of the Gaza war. The claim was made in an open letter sent to BBC director Tim Davie and signed by more than 230 figures in the UK's media industry and other sectors, who said the public broadcaster has failed to provide \"fair and accurate\" coverage of the conflict.\nThe letter, first seen by The Independent, said the BBC must \"recommit to fairness, accuracy and impartiality\".\nBehind that vacuum stands the United States -- the world's most powerful enabler of this violence. Washington sends $3.8 billion in unconditioned military aid to Israel each year. Its vetoes at the UN Security Council block ceasefires and investigations. Its diplomatic shield allows siege, bombing, displacement and starvation to continue with impunity.\nEvery bomb dropped, every sniper's bullet, every bulldozed home carries the imprint of American complicity.\nAnd because the US sits at the centre of global media power, it shapes narratives at will. Palestinian suffering is erased. Israeli violence is sanitised. Headlines mimic government talking points, not witness testimony. What you see is not journalism; it's narrative warfare.\nBut silence cannot contain solidarity.\nThe people are marching -- they are acting how they can. And you can too, in your own way. Share livestreams; amplify images; write to political leaders and demand an end to arms transfers, call for ceasefire and UN investigations, insist on open humanitarian corridors; organise vigils, teach-ins, divestment campaigns, legal actions; support grassroots Palestinian media and aid organisations.\nDon't ask, \"How do I go to Gaza?\" or \"Can I adopt a Palestinian child?\" Recognise your abilities, your logistics -- and direct your emotions through logic. We all have roles to play -- and every single act matters.\nBecause the choice is clear: in the face of genocide and silence, neutrality is not peace. It is violence. Standing by means siding with power. But going over your own head will also be of no help. Extend help within your means -- but extend it anyhow.\nMake no mistake: this march, and every other act in support of the Palestinian people at this point in time, is not just mere protest.\nAll of this combined has now become a moral reckoning. This defines history.\nWhen people touch the cables of silence, they spark cracks. When voices break through the cover-up, truth begins to seep.\nIf the world's media won't show the march, we must. If the powerful won't act, we must. If neutrality is not an option, then action becomes an obligation.\nThe march is underway. So is history.\nWe can walk with it or stay silent and be left behind. But history remembers voices, not voids.\nLet them blackout the outlets. Let them scrub the headlines.\nThey cannot erase the footsteps. They cannot mute the movement.\nThe world is walking. And they -- nay, none of us -- will stop.\n",
        "headline_1": "While the world marches for Gaza, the West remains silent",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/while-the-world-marches-gaza-the-west-remains-silent-3915316",
        "news_paper_name": "The Daily Star",
        "publish_date": "13-06-2025"
    },
    {
        "full_article": "As Muslims around the world prepare to celebrate Eid-ul-Azha, it is a time to reflect on the values of sacrifice and gratitude that this festival embodies. These principles resonate deeply especially when millions in Gaza are facing hunger and death under Israeli attacks, and hundreds of Rohingya children are being denied their right to education. Closer to home, some workers are returning to their villages without receiving salaries or bonuses. Then there are the road accidents that have become a tragic routine during every Eid, as tens of thousands of people travel from cities to spend the holidays with loved ones.\n\nAlthough, like during Eid-ul-Fitr earlier in the year, bus, train, and launch journeys have so far been relatively smooth, several road accidents and at least one robbery on the highway have already occurred, despite increased patrols by law enforcement. However, the responsibility of ensuring safety on highways and river routes does not rest solely with the authorities—it is shared by passengers, transport owners, and drivers alike. Passengers, too, must avoid overcrowded or unfit vehicles, while owners and drivers must prioritise safety over profit, avoiding reckless driving. Law enforcement officials must also remain vigilant.\n\nAnother critical aspect that calls for both responsible behaviour and proper planning is the sacrifice of animals. As we celebrate this act of devotion, we must not lose sight of our duty to show kindness to all living beings. Sacrificial animals should not be subjected to unnecessary cruelty. In cities and municipalities, we must ensure that animal waste and other refuse from our households and neighbourhoods are properly disposed of, and that streets, footpaths, and house premises where animals are kept or sacrificed are thoroughly cleaned.\n\nThis Eid-ul-Azha marks the first in which municipal and city corporations are being overseen by administrators rather than elected representatives. Many of these administrators are also juggling responsibilities in other government departments. However, this must not be used as an excuse for delays in post-Eid cleanliness drives. On the contrary, swift waste disposal should be treated as a top priority, especially as monsoon rains could worsen the stench and spread of blood, creating ideal conditions for the breeding of dengue mosquitoes. We also hope that the efforts of Dhaka South City Corporation will not be disrupted, as they were for 21 days when supporters of BNP leader Ishraque Hossain staged protests at Nagar Bhaban.\nWe wish everyone a safe and joyful Eid.\n",
        "headline_1": "We must uphold the spirit of Eid-ul-Azha",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/we-must-uphold-the-spirit-eid-ul-azha-3911846",
        "news_paper_name": "The Daily Star",
        "publish_date": "13-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 13, 2025 00:00:00  \nRaw hide trade, following the Eid-ul-Azha, is facing serious disruptions, sending distress signals not only to those directly engaged in the business but also to the leather industry as a whole. Seasonal traders, who collect raw hides from across the country during the Eid season, are finding it increasingly difficult to sell their stocks. The core issue lies in the disconnect among the collectors, wholesale buyers (aratdars), and tannery owners. While seasonal traders accuse aratdars of offering prices far below expectations, the latter complain that tannery owners are unwilling to pay the government-fixed rates. Allegations abound that tanners have, for several years now, maintained a syndicate to artificially suppress prices in order to maximise profits.\n This year, prices of cowhides reportedly dropped 30-40 per cent below the government-fixed minimum retail price (MRP). The government had set cowhide prices at Tk 1,350 in the capital and Tk 1,150 outside, or Tk 60-65 per square foot, up from Tk 55-60 the previous year. Tannery owners have set a target of collecting 8.0 to 8.5 million pieces of hides during the current season. However, as regards their reluctance to buy at government-set prices, they argue that in the wake of the continuing slump in international prices and stocks already available with them from last year's collection, they are not prepared to risk purchases at uncompetitive prices. Reports say, so far, collection of raw hides and skins has been far below the expected level. As a result, many seasonal traders, especially in the northern districts, are reportedly stockpiling unsold hides, anticipating better prices. In the case of goatskins, the situation is even worse. Many collectors, unaware of the prevailing market rates, purchased goatskins in bulk only to find that aratdars were offering throwaway prices, rendering their collections almost worthless.\n Observers view this scenario as a troubling sign for the country's leather sector, which is already grappling with various challenges. They fear that in the absence of proper preservation, the raw stuff now lying with the traders unsold may get wasted. At the same time, there is the looming threat of large-scale smuggling to neighbouring countries. If the hides are not disposed of locally well within time, then smuggling becomes the only probable outlet. Informed sources say every year business people from across the border pay substantial amounts in advance to local collectors prior to Eid-ul-Azha to make sure that the illicit cross-border operation succeeds, despite 'watchful eyes' of the border forces on both sides.\n To prevent such outcomes, the government must act promptly. Law enforcement and relevant agencies should intensify vigilance along border areas. A coordinated effort involving local administration, industry stakeholders, and security forces is essential to stabilise the raw hide market and protect the interests of both traders and the leather industry. Without timely intervention, the fallout could be severe-economically and reputationally-for a sector that holds significant export potential and employment prospects for the country.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Raw hide procurement in disarray",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/raw-hide-procurement-in-disarray-1749742358",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Makhan Lal Dutta   |  \n       June 13, 2025 00:00:00  \n\nIncreasingly frequent cyclones, saline water intrusion, prolonged waterlogging, erratic rainfall, and rising sea levels are drastically altering the agricultural landscape in southern Bangladesh. Smarting under the adverse impact of climate change, the vulnerable coastal regions of southern Bangladesh comprising Khulna, Barishal, Satkhira, Bagerhat, Patuakhali, and parts of Chattogram are likely to be the worst sufferers of a possible sea-level rise. The climatic stresses, compounded by poverty and meagre infrastructure, threaten the livelihoods of millions dependent on smallholder farming. Evidently, the adoption of Climate-Smart Agriculture (CSA) has emerged as both a necessity and a promising strategy for ensuring food security, protecting natural resources, and enabling climate resilience in this fragile ecosystem.\nOne of the key pillars of CSA in the south is the widespread adoption of stress-tolerant crop varieties. The Bangladesh Rice Research Institute (BRRI) and the Bangladesh Institute of Nuclear Agriculture (BINA) have developed several salt-tolerant rice varieties such as BRRI dhan 47, 53, 54 and BINA dhan 8, 10, and 11. These have shown notable success in saline-prone regions of Satkhira, Khulna, and Bagerhat, where traditional rice cultivation is no longer viable. Farmers have reported improved yields and lower crop failure rates notwithstanding increasing salinity levels. Similarly, flood-tolerant varieties like BRRI dhan 51 and 52 have proved useful in areas vulnerable to flash floods and prolonged inundation.\nReviving traditional knowledge, floating agriculture is re-emerging in southern districts such as Gopalganj and Bagerhat. This centuries-old method, which involves growing crops on floating beds made of water hyacinth and bamboo, is being adapted and scaled up during monsoons when fields are submerged. Vegetables like okra, cucumbers, and leafy greens are now being produced on these beds, ensuring year-round food production and dietary diversity. The innovation lies in its low cost and its potential to convert waterlogged land into productive zones, especially for landless farmers.\nAn innovative CSA solution gaining traction is the Integrated Floating Cage Aquageoponics System (IFCAS), developed by Bangladesh scientists. This approach combines fish farming and vegetable cultivation in floating structures, making optimal use of vertical space and enabling resource-efficient farming in submerged or shaded ponds. IFCAS has been successfully piloted in districts like Satkhira and Pirojpur, generating both nutritional and income benefits for participating households.\nWater-smart technologies are also at the core of CSA. Alternate Wetting and Drying (AWD) is being increasingly adopted by rice farmers in regions where water is scarce or expensive. By allowing the soil to dry between irrigation cycles, AWD not only reduces irrigation water use by up to 38 per cent but also cuts methane emissions making it both economically and environmentally sound. Extension workers from BRRI and the Department of Agricultural Extension (DAE) have reported yield improvements of up to 15 per cent and notable reductions in fertiliser input among AWD users.\nAgroforestry, another climate-smart practice, is expanding steadily in southern Bangladesh. By integrating fast-growing trees such as mango, guava, and mahogany with traditional crops like rice and vegetables, farmers benefit from improved microclimates, enhanced biodiversity, and long-term soil health. Agroforestry plots have demonstrated superior economic returns over monoculture in multiple cost-benefit analyses conducted by the Bangladesh Forest Department and FAO-supported projects. Farmers also value the added income diversification and protection from wind and salinity these trees offer.\nWomen, often underrepresented in formal agriculture programmes, are emerging as key agents of climate-smart transformation in southern Bangladesh. Following cyclone Aila in 2009, several rehabilitation initiatives trained women in salinity-resilient agriculture, aquaculture, and homestead gardening. Women's groups in coastal Satkhira and Barguna have since taken lead in managing fish farms and growing salt-tolerant crops like mung bean and sunflower. Their increased participation is not only improving household food security but also strengthening social cohesion and gender equity.\nSeveral large-scale projects are currently accelerating the adoption of CSA across southern Bangladesh. One such initiative is the USAID-funded \"Feed the Future Bangladesh Climate Smart Agriculture Activity,\" which runs from 2023 to 2028. With the goal of reaching over 900,000 farmers, the project supports the dissemination of CSA practices across 680,000 hectares of rice, 100,000 hectares of pulses, and 50,000 hectares of oilseeds. Initial monitoring reports show a 5-10 per cent yield increase across key crops and a marked reduction in greenhouse gas emissions and input use. The project also trains local agri-entrepreneurs and service providers, fostering private sector involvement in climate-resilient input and technology markets.\nOther notable initiatives include the World Bank-supported Climate-Smart Agriculture and Water Management (CSAWM) programme, and the Climate Resilient Agriculture Advancement in Barind (CRAAB) project, which have together introduced climate-resilient techniques to over 35,000 farmers across Rajshahi, Patuakhali, and Barguna. These efforts focus not only on crop resilience but also on smart irrigation infrastructure, solar-powered water pumps, and localised weather forecasting services.\nDespite the clear benefits, the scale-up of CSA practices faces several bottlenecks. The initial cost of installing technologies like solar irrigation, IFCAS, or improved irrigation systems can be prohibitive for smallholders without access to credit. Land fragmentation and tenure insecurity further discourage long-term investment in CSA. Additionally, gaps in extension services and the availability of quality inputs-such as certified seeds or organic fertilisers-continue to limit uptake. Market access and value chain inefficiencies also mean that farmers cannot always realise higher returns on climate-resilient crops.\nTo overcome these challenges, policy and institutional support must continue to evolve. The government has shown a strong commitment to CSA through strategies like the Bangladesh Delta Plan 2100 and the Climate Prosperity Plan (CPP). These long-term frameworks recognise agriculture as a frontline sector in building climate resilience. Expanding subsidies for climate-resilient inputs, providing smart financing for agri-innovation, and investing in digital advisory services are critical steps to create an enabling environment for CSA expansion.\nMoreover, extensive collaboration between research institutions, NGOs, and the private sector will be vital. Digital solutions such as mobile apps offering real-time weather alerts, pest warnings, and crop advisory services could enhance farmers' decision-making and efficiency. Encouraging youth involvement through agritech startups and green entrepreneurship also offers a pathway to modernise agriculture while creating rural employment.\nThe southern Bangladesh, considered one of the most climate-vulnerable regions on the planet, is also becoming a testing ground for transformative agricultural innovation. Climate-Smart Agriculture offers a pragmatic, locally adapted, and inclusive solution to the multiple challenges facing the farming sector. As the country navigates the dual imperatives of economic growth and climate resilience, investing in CSA is not just a necessity, it is also a strategic opportunity to secure the future of food, water and livelihoods for the nation.\nDr. Makhan Lal Dutta is a development professional and serves as the Chairman and Chief Executive Officer of Harvesting Knowledge Consultancy. \nHe can be reached at Makhan_Dutta@hk-bd.org\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Potential of climate-smart agriculture in southern Bangladesh",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/potential-of-climate-smart-agriculture-in-southern-bangladesh-1749742413",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       June 13, 2025 00:00:00  \n\nVideos on army personnel conducting drives against errant bike riders and drivers in capital Dhaka have been a popular item on YouTube. The videos have exposed a bitter truth about law abidance in Bangladesh society. If anyone minutely watches the videos, they will understand the extent of Bangladeshi people's lack of respect for law. Almost none caught violating traffic rules seemed ready to admit their wrongdoing, let alone accepting punishment for that. Everyone had their logic and excuse to justify their breach of law. The excuse of bikers for not wearing helmets, which has been a regular phenomenon in the capital, is almost identical -- they were not going far, just moving around their residences. And almost all drivers who were caught running their vehicles against the usual flow of traffic argued that they were compelled to take the wrong path to avoid congestion.\n\nTraffic law breaking has been so frequent in Bangladesh that most of the citizens now consider it the norm. Citizens have certainly played a big role in creating such a situation, but the role of the authorities is even bigger. Ground situation suggests the authorities enact many laws only to see them violated. For example, anyone can breach the law regarding smoking at public places anytime without any risk of being punished because of the lack of any effective enforcement mechanism. The non-existence of these sorts of laws is far better than their existence. When Bangladesh lacked any law on smoking, citizens could at least expect some day there would be a law and they would be saved from the impact of passive smoking. Now not only their hope has been shattered due to the non-enforcement, it has contributed to the culture of law breaking. And the results are obvious. Bangladesh's position in the global Rule of Law Index is at the bottom. The country remained in the 127th position in the index among 142 countries for the third year in a row since 2022. The latest index, released by the World Justice Project (WJP) in October last year shows that Bangladesh ranked 4th out of six South Asian countries, only ahead of Pakistan and Afghanistan.\nThe impact of breach of law is far-reaching on our society, economy and respect as a nation. It is not just a legal issue but a societal one that touches on governance, human rights, and development. The respect for law, which is a must to establish ourselves as a civilised nation among the global community, is not developing among our children as they grow seeing us not willing to abide by law.\nBangladesh authorities are making a lot of efforts and spending huge resources to attract foreign investment for the development of the country. Unfortunately, the response is not as expected. The poor rule of law is a great contributor here. How will potential investors come up with a positive decision when they see Bangladesh's position in the rule of law index is far below the expected level?\nThe breach of law in Bangladesh is a systemic issue that requires an urgent and holistic approach to end. The first thing we need is political will to bring about meaningful change. Strengthening the independence of the judiciary, ensuring transparent recruitment and accountability in law enforcement, streamlining judicial processes, and change in citizens' attitude towards law are also necessary for that. A just and fair society cannot flourish in an environment where high respect for law does not exist. It is high time Bangladesh reaffirms its constitutional promise and takes steps towards establishing the rule of law.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Where is the end to breach of law?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/where-is-the-end-to-breach-of-law-1749742498",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 13, 2025 00:00:00  \n\nArtificial intelligence is rapidly transforming the global economy-redefining industries, reshaping labour markets, and creating new opportunities at an unprecedented scale. Yet, as we race toward an AI-driven future, it is vital that we do not lose sight of the human connections that underpin economic prosperity.\nAround the world, millions of workers face uncertainty as automation alters traditional roles. The benefits of AI often flow unevenly, risking deeper inequalities between those with access to education and technology and those without. In many regions, digital divides threaten to fracture societies already strained by economic and social disparities.\nThe challenge before us is clear: how do we harness AI's potential while ensuring it uplifts every individual, regardless of geography or background? This requires coordinated global efforts-investing in inclusive education, fostering lifelong learning, and establishing fair labor policies that protect workers while encouraging innovation.\nGovernments, businesses, and civil society must collaborate to build frameworks that keep people connected-to each other, to opportunity, and to a shared vision of progress. AI should be a tool that bridges gaps, not widens them.\nAs we navigate this economic revolution, let us commit to shaping AI as a force for inclusive growth, one that strengthens global solidarity rather than threatens it.\nYana Islam Rifa \nBachelor of business administration\nNorth South University\nyanaislamrifa@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "AI's revolution, keep humanity connected",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ais-revolution-keep-humanity-connected-1749742521",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-06-2025"
    }
]