[
    {
        "full_article": "The All India Congress Committee (AICC)/Congress Working Committee session in Ahmedabad, on April 8-9, aimed to convey the Congress’s intent to usher in organisational reforms at the grass-roots level and bring ideological clarity. The capital city of Gujarat with a rich history in India’s freedom struggle was a symbolic setting to reflect the crisis that the party is grappling with. The Congress has been out of power for 30 years in Gujarat, which is now closely associated with Prime Minister Narendra Modi’s model of politics and governance. The conclave reaffirmed the party’s commitment to constitutional values such as secularism, pluralism, federalism, and inclusive growth — principles that once defined the Congress and which, it alleges, are now under threat. Party leader Rahul Gandhi reiterated the focus on social justice, including the demand for a nationwide caste census and the removal of the 50% ceiling on quotas. These would form the basis for future policy initiatives of Congress governments in the States, as well as any government it may lead at the Centre. Another key aspect of the Congress’s revival strategy hinges on its ability to build an effective party organisation at the grass roots. Signalling a shift away from its high-command culture, the party announced that district committees and district-level leadership would form the bedrock of decision-making and accountability.While the deliberations signalled the party’s seriousness about bouncing back, critical questions remain beyond idealism and symbolism. Almost all its State units are plagued by power struggles and factionalism, often damaging the party’s electoral prospects. Whether district-level decision-making will intensify or contain factionalism is a question only the implementation of the revamp plan can answer. The attempt might be to squeeze the domineering regional chieftains between grass-roots leaders and the high command. It is also unclear how, when politics is increasingly centralised in terms of resources, messaging and planning, the Congress can achieve results by shifting authority to districts. In the absence of a clear road map — especially one that addresses the aspirations of India’s youth and emerging middle class — the party risks retreating into nostalgia rather than crafting a forward-looking vision. Building on its legacy, the Congress now needs political imagination, strategic clarity and organisational discipline. The Ahmedabad session, for all its symbolism and sincerity, must be seen as a beginning. It is a work in progress, and the months ahead will test whether the session on the banks of the Sabarmati marks a true turning point or just another event in the party’s ongoing quest for renewal. Published - April 12, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        Ahmedabad\n                    \n                            /                      \n                        \n                        Gujarat\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        population and census\n                    \n                            /                      \n                        \n                        Reservation\n                    \n                            /                      \n                        \n                        government",
        "headline_1": "Work in progress: On the Congress and its Ahmedabad session",
        "headline_2": "The Congress high command culture does not suit district-level decision-making",
        "link": "https://www.thehindu.com/opinion/editorial/work-in-progress-on-the-congress-party-the-ahmedabad-session/article69438893.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "13-04-2025"
    },
    {
        "full_article": "Colossal Biosciences is an American company with an unusual marketing line: combining genomics with conservation — not in its traditional form, but through de-extinction, which is resurrecting species extinct for thousands of years. Leading this project is Harvard geneticist George Church, a prominent promoter of the company, who aims to bring back the woolly mammoth, a distant ancestor of the elephant. The stated logic is to combat global warming. During the Pleistocene Ice Ages, the mammoth roamed lush grasslands across the tundra. Until its extinction around 5,000 years ago, the Arctic tundra also supported large populations of bison, wolves, cave lions, and giant deer. As the climate warmed, these species disappeared, and the grasslands gave way to shrubbery and sheets of snow. As temperatures rise, permafrost begins to disappear, resulting in high emissions of methane, a more potent greenhouse gas than carbon dioxide. To prevent this, some scientists at a Siberian park have been transporting large animals that are resistant to cold to see if their foraging can restore the grasslands. Grass absorbs less heat than the tall trees in a shrub forest — the dominant species — and therefore decelerates warming, but it cannot stop warming.The woolly mammoth, though extinct, is seen as a potent weapon in this climate plan. Scientists at Colossal have extracted fragments of its DNA from fossils and reconstructed its genome. By comparing it to that of the modern elephant, they have edited specific genes to recreate mammoth-like traits, with the goal of eventually incubating a hybrid embryo in an elephant’s womb. Scientists have also experimented with the dire wolf, an extinct relative of the gray wolf, and birthed three snow-white wolves. However, this claim has yet to pass rigorous peer review. Critics point out that only 20 genes were edited, and what has been created is, in essence, a “strange-looking gray wolf”. Despite such criticisms, the technological achievement is a testament to the ability to engineer precision edits to the genome. The work of Chinese scientist He Jiankui, who claimed to have produced gene-edited human babies, remains controversial. Colossal may be credited for its genomics work, but the claim that it is reviving species for conservation is not credible. Thousands of living species are vanishing due to habitat loss and human encroachment. Spending millions of dollars on speculative projects, whose benefits, if there are any, will fructify only over centuries, takes away resources from immediate conservation efforts. The scientific community must lay down strict guidelines on the use of gene-editing technology in applications other than health. Published - April 12, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        conservation\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        genetics\n                    \n                            /                      \n                        \n                        animal\n                    \n                            /                      \n                        \n                        climate change\n                    \n                            /                      \n                        \n                        science (general)\n                    \n                            /                      \n                        \n                        animal science\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        carbon emissions\n                    \n                            /                      \n                        \n                        global warming\n                    \n                            /                      \n                        \n                        China",
        "headline_1": "​Dire efforts: On de-extinction and conservation",
        "headline_2": "The conservation argument for resurrecting dire wolves is not credible",
        "link": "https://www.thehindu.com/opinion/editorial/dire-efforts-on-de-extinction-and-conservation/article69440044.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "13-04-2025"
    },
    {
        "full_article": "The current tariff war would warm the cold dead remains of Adam Smith and David Ricardo. The basic assumption that Trump and his team seem bound to is the old notion that factors of production are immobile and geographically rooted. Not true today. Practically everything can be made everywhere because enterprise and science have this incurable wanderlust. They travel globally bringing good ideas to distant lands.\n\nFor this very simple reason what we have on hand is really a thinly veiled brand war and not just a tariff war.\nRead full story on TOI+\n\n",
        "headline_1": "War of brands, not tariffs",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/war-of-brands-not-tariffs/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-04-2025"
    },
    {
        "full_article": "At a recent conference, commerce minister Piyush Goel told India’s tech startups to aim for higher innovation, and this has sparked a big debate. He said: “What are India’s startups of today? We are focused on food delivery apps, turning unemployed youths into cheap labour so the rich can get their meals without moving out of their house.”\n\nHe has a point. In a vast and unequal country like India, a unique dynamic has enabled the rise of a particular kind of tech company. Call these PSR companies – Poor Serving Rich.\nRead full story on TOI+\n\n",
        "headline_1": "The different things the minister & startups got right",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/The-underage-optimist/the-different-things-the-minister-startups-got-right/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-04-2025"
    },
    {
        "full_article": "By Swami Swaroopananda\nPuranas venerate Hanumanji as Vayu Putra, son of wind god. According to Vedas, space gives rise to vayu, air, from which agni, fire, is born. If vayu is the cause and agni, effect, then vayu is the father, and agni the son. Hence, in Vedic thought, Hanumanji embodies fire.\nTo say someone is ‘on fire’ implies that they are working with great inspiration. Fire is the source of heat, energy, dynamism, and brilliance – all qualities Hanumanji exemplifies. Moved by Sitaji’s sorrow, Hanumanji set Lanka ablaze. Known for his deep empathy, he is unable to witness the suffering of others. This is why, in Sankat Mochan, devotees pray: “O Hanumanji! You have performed great deeds for gods. You hold the key to all solutions. Please remove my troubles at once. Who does not know that you are Sankat Mochan – remover of all obstacles?”\nEven Meghanada’s Brahmastra could not harm Hanumanji, for Brahma had blessed him with immunity. Yet, to uphold the weapon’s sanctity, Hanumanji pretended to fall unconscious, allowing himself to be captured. This was a strategic ploy – as he was dragged through Lanka’s streets, he carefully mapped the entire city. In a sense, Hanumanji was the original creator of GPS.\nRavan was livid at this audacious monkey who had destroyed his beloved Ashok Vatika. He demanded the monkey’s identity. With calm resolve, Hanumanji replied: “By an iota of whose mighty power you were able to overcome the entire creation, and whose beloved spouse you have stolen, I am his messenger.”\nHe urged Ravan to abandon his arrogance, surrender to Ram, and return Mother Sita. Ravan, mocking him, sneered, “So, we have found a wise guru in this monkey.” Enraged, he wished to execute Hanumanji, but Vibhishan intervened, reminding him that executing an emissary violated statecraft. Instead, Ravan ordered that Hanumanji’s tail be set on fire – a punishment meant to humiliate and destroy him. However, excluding Vibhishan’s house, all of Lanka was set ablaze. It is, therefore, incorrect to say that Hanumanji burnt Lanka. It was the aggressive act of igniting his tail that caused the fire.\nThe lesson is profound: Those who set another’s home ablaze will one day see their own engulfed in flames. Hanumanji merely gave Ravan and people of Lanka a glimpse of Ram’s might, urging them to reflect on consequences before it was too late.\nLanka symbolises materialism, a world where pleasure, wealth, and power reign supreme, crushing spirituality in their wake. Just as rakshasas sought to annihilate any thing that threatened their indulgence, our selfish ego seeks to suppress our spiritual inclinations. Today, people hoard wealth yet contribute nothing to the very land that nurtured them. The burning of Lanka represents destruction of material attachments, which the ego clings to – at dharm’s cost.\nSitaji is Goddess Lakshmi – essential for our sustenance. But Ravan’s mistake was that he wanted to possess her solely for himself rather than share her abundance. Unhappy at being bound, Lakshmiji burnt Lanka completely. In contrast, Hanumanji sought her as a mother, earning her blessings of immeasurable strength and ability to generate wealth – for the service and sustenance of others.\nHanumanji’s worship destroys undesirable tendencies and burns away our negativities and attachments to the world of matter, within and without. This is his eternal glory.\nThe writer is global head, Chinmaya Mission\nHanuman Jayanti is on April 12\n\n",
        "headline_1": "Hanuman burns our negativities away",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/hanuman-burns-our-negativities-away/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-04-2025"
    },
    {
        "full_article": "**Sending money is not the same as giving real help**\nSome people in the government in Uttar Pradesh (a state in India) did something very wrong. They used the names of three women to steal money from a health program called *Janani Suraksha Yojana* (JSY). This program gives money to help women who are pregnant or have just had babies. But the scammers pretended the same three women gave birth 52 times and had 9 operations in just three years! That’s clearly not true.\nThe women said a local person told them to open bank accounts to get government help. But they never used those accounts. So who did? The scammers!\nThis shows a big problem:\nEven though the government moved everything online to stop cheating, it’s still happening. Why? Because many people don’t understand how to use technology well. So they ask others to help them—and sometimes those helpers cheat them.\nAlso, there are too many programs giving money for health, and it’s hard to keep track. While some programs have helped reduce the number of women dying during childbirth, places like UP still have a lot of problems. Even with all these programs, women are still being promised more money during elections.\nSo, here’s the big question:\nIs it better to give money, or to make sure hospitals and health workers are actually helping people where they live?\n \n\n",
        "headline_1": "**Watch Out for This Scam!**",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/watch-out-for-this-scam/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-04-2025"
    },
    {
        "full_article": "We are alarmed by the extent of pollution spreading from the Amin Bazar landfill to its surrounding areas. Since the landfill's establishment in Baliarpur, Savar, in 2007, pollutants have been infiltrating the soil, air, and groundwater of the area, severely affecting the villages around Amin Bazar. These villages, once known for their fertile farmlands and fresh air, are now grappling with widespread environmental degradation. Experts warn that untreated leachate from the landfill may be spreading toxic substances across a radius of up to five kilometres, polluting nearby ecosystems and water sources. The Turag River, already polluted by untreated industrial waste, has suffered further contamination from the landfill's runoff.\nAccording to a 2022 study, leachate, a hazardous liquid produced by decomposing waste, is infiltrating the soil and groundwater within a 1.5 km radius of the landfill, carrying heavy metals such as arsenic, nickel, chromium, and lead. High levels of arsenic and nickel were detected in both surface water and groundwater near the landfill, while the presence of cadmium and nickel in surface water indicates high levels of toxicity. In groundwater, the highest concentration of heavy metals was found in areas near the landfill, indicating that these toxic metals are emanating from it. Additionally, the soil in the vicinity has also been contaminated, with chromium levels measured at 108.5 milligrammes per kilogramme—exceeding the permissible limit of 100 milligrammes per kilogramme—indicating alarming levels of pollution.\nThe long-term consumption of crops grown in the polluted soil poses a significant risk of cancer and other life-threatening diseases. In fact, residents of the area have already been affected, with many suffering from asthma, skin diseases, and other respiratory illnesses. This raises critical questions: what actions has the Dhaka North City Corporation (DNCC) taken over the years to prevent the landfill from becoming such an environmental hazard? Why is the leachate treatment pond at the landfill not functioning properly? The authorities' inaction in addressing environmental degradation in the area is totally unacceptable.\nWe urge the government to take immediate action to address the health and environmental risks posed by the Amin Bazar landfill. While it is reassuring that a waste-to-energy plant is under construction in Amin Bazar, which is expected to help reduce pollution in the area once completed next year, urgent short-term measures are also needed. The landfill authorities must ensure that the leachate management pond functions effectively and implement mechanisms to prevent leakage. Additionally, they must stop burning waste to curb air pollution. The government must recognise that waste management is a critical issue for the country and should, therefore, prioritise the establishment of environmentally friendly and sustainable waste management systems.\n",
        "headline_1": "Amin Bazar landfill’s toxic impact",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/amin-bazar-landfills-toxic-impact-3869706",
        "news_paper_name": "The Daily Star",
        "publish_date": "13-04-2025"
    },
    {
        "full_article": "The majority of Bangladeshis want improvements in the state's management structure, a reduction in corruption, and the correction of existing problems. Many have proposed their own suggestions on how to address these issues.\nConstitutional reform seems to have occupied the concerns of many. Some reformers are suggesting dissolving the constitution without paying attention to the consequences of such action—that all constitutional posts, including the posts of the president, the chief justice, the chiefs of the armed forces, the IGP, the election commissioners, the attorney general, etc., will be dissolved with the constitution, resulting in further anarchy. One of their arguments is that the 1972 constitution was formulated without the people's mandate, which is not true.\nThe Legal Framework Order promulgated by General Yahya Khan clearly stated that the December 1970 election in Pakistan was for the sole purpose of forming a constituent assembly which would frame a constitution for the then Pakistan. As the country broke down into two for various reasons, the PPP in Pakistan framed and adopted a constitution and held an election afterwards under the new constitution, and so did the Awami League by framing and adopting the constitution and holding an election under the new constitution. The Proclamation of Independence issued on April 10, 1971 (DLR, Vol. XXIV, Bangladesh Statutes 1971-72) further testifies to such events. If a new party comes to power with a mandate to frame a constitution, then it will have to hold another election under the newly adopted constitution.\nFor reforms to be effective, it is necessary to consider identifying the defects in the state management structure which contributed to the mismanagement of state administration and ever-increasing corruption. Recent history shows that the prime minister, while holding the position of party chief, was not only in control of the executive branch but also in control of the other two branches of the state, i.e. the judiciary and the legislature. This must have helped precipitate a cloud of authoritarianism in the country. The judiciary lost its independent soul, and the legislature became a rubber stamp. Banks and financial institutions were captured by authoritarian cronies who looted and laundered money deposited by people in good faith. Some banks are even unable to let their clients withdraw money from their lifetime savings accounts. The state management was supposed to ensure their financial security, but it failed miserably. Media reports revealed that the former chiefs of police and other security forces were also involved in the lotting. They used their positions to accumulate outrageously high amounts of money. Officials responsible for state governance were almost oblivious to the rights of citizens guaranteed under the constitution. They arrested and detained people arbitrarily. A kind of oligarchy was gradually taking over the country.\nTo resist the repetition of such mismanagement and ill-governance, reforms of various sorts are proposed by many. To start working with a reform proposal, one must first decide and articulate what he or she wants to get rid of and what change is to be brought. Those who want to change everything are susceptible to bringing back the old system in its worst form. Therefore, the purpose of reform cannot be to destroy everything, but to bring in changes where it is necessary. Say, for example, if we do not want to see the prime minister or his/her cabinet members engage in executive functions other than their ministerial responsibility, then we can propose an amendment to Article 56(3) of the constitution by adding a sub-paragraph where it can be mentioned that: \"Upon taking oath, the Prime Minister and the Cabinet Minister(s) will lose their executive post as the chairperson or the president or the general secretary or any other executive post of the party which nominated him/her for participating in the election, and also will lose all executive post(s) in any other organisation.\"\nThe advantage of such an amendment is that the prime minister will not become all-powerful to lead an authoritarian regime. There will be a scope for resistance from the party position. Party approval will be required to bring in any fundamental change. Moreover, the prime minister and the cabinet members will have more time to spend on the governance of the country.\nIf we do not want to see a political party run by an unelected authoritarian leader, and if we do not want to see such a leader become the prime minister, we can create a provision in the constitution to nip in the bud such possibilities by adding an amendment in Article 66(2) in the form of sub-paragraph (h) where it can be mentioned that: \"A person shall be disqualified for election as Member of Parliament who is nominated by a political party which has an unelected (and/or elected uncontested) president or chairperson or general secretary.\"\nAnother sub-paragraph could be added where it can be mentioned that: \"A person shall be disqualified for election as a Member of Parliament whose nomination to participate in the election is not approved by the local party committee from where he or she is contesting; And an elected Parliament member shall, upon taking the oath, lose his/her executive position as the chairperson or managing director of a bank or organisation.\"\nA series of events, which unfolded in the past, made it clear that our judiciary is not independent. Judgements and approaches to the discharge of judicial functions are changing with the change of political regime. Therefore, appointments of judges need scrutiny in a public forum. Once appointed, the judges should feel secure about their job and no one should force them to resign without a constitutional procedure. For this, Article 96(2) can be amended by substituting it with: \"A judge shall not be removed from his office except by order of the President passed pursuant to a resolution, taken in an open forum hearing, of a Supreme Judicial Council formed of two elected members of the Bar Council, two elected members of Parliament, two elected members of the Press Council, and two members of the Judiciary.\"\nOne may wonder why members of the press council should be included in the supreme judicial council. This is to bring out closed-door proceedings for public information. In the past, it remained confidential, and we got unsatisfactory judicial performance.\nThere are many more things that warrant discussion. Input is required from all strata of citizens. One person should not dictate how a population of 170 million people should frame their management structure.\nA state is considered an organised political community under one government. At the time of a transition or reform, one should not just dismantle everything in the current form. Dismantling the power structure of the country may look brave but could be dangerously chaotic. Currently, there is no local government and no parliamentary structure which can help security forces to communicate with people and calm them down in cases of eruption of any kind of civil disobedience or anarchy. Security personnel or people from the state bureaucracy can hardly reach a few people to seek cooperation.\nWith the dismantling of the local government, almost all formerly elected representatives are made outlaws. Many of them are now fugitives from justice for allegedly committing crimes not clear to either the accused or the accuser. Together with their close supporters, the number could easily reach over a million. Moreover, the security forces are implementing a government initiative known as \"Operation Devil Hunt\" without fair proceeding. It is the responsibility of the government to ensure the safety of all the citizens, irrespective of their social, religious, political, etc., position or criminal record, while paying attention to the desire for justice among the formerly oppressed. No one knows what the definition of \"devil\" is. This term is not included in the Penal Code, nor is it a known common legal cliché. I presume the term \"hunt\" stands for \"arresting,\" as is mentioned in the Criminal Procedure Code, and \"devil\" stands for \"thug,\" as is defined in Section 310 of the Penal Code.\nAs \"devil\" is not a legal term, arresting and confining them as devil may turn out to be illegal. The future may see many cases against the members of the security forces and their supervisors for illegal confinement. And if the term \"devil\" is used for targeting people for political opinion, someone may in the future bring serious allegations against the security forces, triggering international concern. Holding a new election, either local government or parliament, without a power structure placed in the field could be disastrous. Partially reviving the old local government structure, in a selective way, may help ameliorate the escalating disarray.\nMuhammad Mohi-us Sunnah is a former UN official, lawyer and a member of Paris based international lawyers' association, Union Internationale des Avocats (UIA).\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Reform without chaos: A pragmatic approach to national change",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/reform-without-chaos-pragmatic-approach-national-change-3869526",
        "news_paper_name": "The Daily Star",
        "publish_date": "13-04-2025"
    },
    {
        "full_article": "You can't see air. But if you breathe into a balloon, your air takes shape. The inflated balloon is no longer the shape it used to be. You look at it with pride, as if you have poured your spirit into it. It can either join other balloons to be part of a party or be a stand-alone object with trepid bounces.\nThe July uprising caused different invisible shapes to emerge that visibly changed the political landscape of the country forever. The spirit of the uprising emanated from the hearts of Bangladeshis, both domestically and internationally. At a time when freedom of expression was muffled at home, the call for change by our compatriots abroad kept the hope alive. Some of them even signed up for a reverse brain drain scheme, pledging their commitment to national recovery.\nThe country is still in the process of redefining itself. The spirited balloons are far from homogeneous. That's how it should be in a democracy. Unfortunately, the lack of democracy for such a long time has made us forget many of its basic tenets. It's easy to be dispirited by the change, or the lack of it.\nOne beacon of hope is available in the tiny streak of reverse brain drain that we are witnessing today. Dr Yunus's transitional government has been successful in crafting this inflow. The chief adviser has brought in policy experts such as Ali Riaz and Prof Mostak Hossain, economist Lutfey Siddiqi, and investment banker Dr Ashik Chowdhury (Bangladesh Investment Development Authority), among others, to invigorate the administrative system. These returnees bring home more than their resumes. They bring a touch of international standards that were not always accepted at the national level. Their inclusion is as talismanic as footballer Hamza Choudhury, who, in his first appearance in national colours, gave the opponent a lot to think about in Bangladesh's new outfit.\n\nI watched BIDA Executive Chairman Ashik Chowdhury's presentation at the Bangladesh Investment Summit 2025, which has gained considerable attention. Even an adviser on my friend list was amazed by the presentation, saying no civil servant could pitch Bangladesh so smoothly. Maybe he is right. Then again, I see many of our students present in classrooms or at international debate meets, making equally impressive presentations. The problem is speakers with native accents or international exposure do not normally hold the posts reserved for civil servants recruited through typical exams that rely on rote learning. So, I would have been much more impressed if our homegrown products were making the much-hyped pitch. To achieve that, we need to reform our classrooms and our educational institutes. Short-term visits by our expatriates can never yield a sustainable outcome. It's time for us to create our cohort of academics, entrepreneurs, and policymakers who can join hands with our expatriates to participate in the global knowledge economy.\nWhen a transformed Ashik Chowdhury makes his return from Singapore, many of us share the pride of knowing him at Dhaka University's IBA, Sylhet Cadet College, or the local organisations he worked for. But in most cases, the real change in our expatriate scholars occurs in an overseas system that is not didactic like ours but dialogic—that is not siloed like us but collaborative. To keep producing more local idols, we need to redesign our institutions and system. To begin with, we need to introduce TNE (Transnational Education) models to our local system. We can work with foreign partner institutions to create hybrid curricula aligned with global standards. For instance, a Ford Foundation Financial Assistance Program led to the founding of IBA in 1966 in collaboration with Indiana University, Bloomington, US. The graduates of IBA are now making their marks in almost every imaginable sector, both at home and abroad.\nTo increase international collaboration, we need to mentor faculty and students in grant writing, peer-reviewed publishing, and research ethics. Those who previously pledged to return but have not yet made themselves available can help us initiate the networks to secure funding, mobility, and visibility. With less than 2 percent of GDP assigned to education, against the UNESCO-prescribed 6 percent, higher education is a resource-constrained sector. With the help of our overseas friends, we can prepare ourselves to make our mark on the international stage.\nHaving said that, as a nation that prides itself on being \"porosrikator\" (getting ill by seeing good in others), we also need to be wary of the possible backlash. The underpaid and overburdened local academic system often lacks the heart to welcome \"foreigners.\" It responds by erecting walls against what seems foreign or threatening.\nOur public universities, for instance, implement a gatekeeping system for hiring and promotion. They prefer recruiting their own (and foreign nationals are not allowed to apply). There is scepticism towards new teaching methods. Ideological opposition often masks professional insecurity. The bureaucracy excels at manipulating red tape to create administrative obstacles for foreign ideas or individuals.\nMany returnees return with a lot of passion. But during their early stages of reintegration, they feel that their passion is met with passivity, innovation with indifference, and idealism with bureaucracy. As a consequence, many returnees feel emotional burnout and cynicism, resulting in their quiet withdrawal and return to their adopted homes.\n\nSo the challenge for us is to retain quality in a system with resistance. The returnees may have an idealistic view of achieving excellence. But they must work in a system where most may lack training, resources, or the will to change. Their desire to introduce high standards might end up alienating them from their colleagues. Any top-down approach should be avoided. If the imported leaders behave in a know-it-all manner, they are likely to alienate their colleagues. Instead, they need to work horizontally, not hierarchically. We need to collaborate with our visiting mentors to initiate micro-reforms in course design, assessment, or research, for instance. Through mentorship, shared aspirations can be practised, aimed at merging local and global voices.\nWe must acknowledge the returnees' sacrifice and emotional labour, knowing we can't repay them in cash. To build a bridge between locals and returnees, networks of solidarity are essential. The terms of reference for engaging the returnees need to be more than a phone call from the top. We need to guarantee their academic freedom and meaningful roles as well as their public recognition.\nThe returnees will be our role models not because they are foreign-trained but because they care enough to come back and stay. They can rewrite the myth of exodus and ignite belief in possibility among the young generation. Their very presence will reaffirm that you don't have to leave to succeed. You can return and make a difference.\nWhile the return of Bangladesh's global citizens to the country is a welcome trend, we need to be strategic in making their integration meaningful. Not doing so will kill their passion and ruin the system they came back to fix. We need to make room for them not just institutionally but imaginatively. Universities can be redesigned to accommodate their ideas and translate them into the creation of a new Bangladesh that is confident, curious, and connected to the world.\nThe big question isn't whether the returnees will stay. It's whether we will give them the required space worth staying for.\nDr Shamsad Mortuza is professor of English at Dhaka University.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Homecoming with a purpose",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/homecoming-purpose-3869366",
        "news_paper_name": "The Daily Star",
        "publish_date": "13-04-2025"
    },
    {
        "full_article": "We are concerned about the ongoing and potential funding cuts by our key development partners that could seriously undermine the quality of maternal care in the country. According to a new UN report, reduced funding may weaken the healthcare system by making facilities less effective, reducing the number of healthcare professionals, and disrupting critical supply chains. These setbacks would inevitably compromise both the availability and quality of maternal care. At a time when Bangladesh is striving to lower its maternal mortality rate in line with the relevant SDG target, funding cuts threaten to reverse hard-won gains.\n\nOver the past decades, Bangladesh has made significant strides in reducing maternal and child mortality despite longstanding challenges in the health sector. Much progress has been made in addressing key causes of maternal deaths such as obstetric haemorrhage, hypertensive disorders, unsafe abortions, and other indirect complications. According to the UN, while global maternal deaths fell by 40 percent between 2000 and 2023, Bangladesh achieved an impressive 79 percent reduction—from 523 to 115 deaths per 100,000 live births. This success would not have been possible without improved access to essential healthcare services and the critical support of international donors. With funding now at risk, it will be difficult not only to sustain this progress but also to move forward. Women in remote, rural, and low-income communities stand to suffer the most.\n\nAccording to the UN, while global maternal deaths fell by 40 percent between 2000 and 2023, Bangladesh achieved an impressive 79 percent reduction—from 523 to 115 deaths per 100,000 live births. This success would not have been possible without improved access to essential healthcare services and the critical support of international donors.\nThe government, therefore, must act swiftly to mitigate the impact of these funding shortfalls. Developing a self-reliant healthcare model is crucial to safeguarding our achievements in maternal care. Increasing national budget allocations for the health sector—especially for maternal, newborn, and child health projects—must be a top priority. At the same time, collaboration with NGOs is essential to keep key initiatives alive. Securing new investments from alternative sources is equally important.\n\nWe must remember that strengthening the healthcare system overall—by ensuring well-equipped facilities, a skilled workforce, and reliable access to life-saving medicines, diagnostic tools, and essential supplies—is central to improving maternal care and preventing deaths. Parallel efforts are also needed to enhance women's economic and educational opportunities, expand access to emergency obstetric care and family planning services, increase skilled birth attendance, and strengthen the network of community health workers. With proper planning and critical reforms, we can ensure that even the most vulnerable women have access to the care they need.\n",
        "headline_1": "Don't let progress in maternal care be reversed by funding cuts",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/dont-let-progress-maternal-care-be-reversed-funding-cuts-3867896",
        "news_paper_name": "The Daily Star",
        "publish_date": "13-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 13, 2025 00:00:00  \nBeyond being a mere geographical feature, Bangladesh's network of rivers has historically shaped its identity and sustained its survival. Their slow death now signals an ecological disaster that is threatening the very bases of the country's ecosystem and economy. A recent study titled \"Dried-up Rivers of Bangladesh\" by the River and Delta Research Centre (RDRC) lays bare how severe the situation is. It found that a total of 81 rivers that are crucial for agriculture, biodiversity and rural livelihoods are now running dry during the lean season. The crisis is particularly acute in regions such as Khulna, Satkhira, Rajshahi and Kushtia where these rivers once formed the backbone of local life. River-based livelihoods, particularly fishing, are disappearing fast there. Agriculture is struggling, biodiversity is collapsing, and areas that were once green and thriving are now in danger. As these once-mighty rivers dry up, so does the country's hope for a stable and sustainable future. \nThere are many factors that led to the rivers running empty. Locally, as the RDRC study pointed out, pollution, sedimentation, and rapid urbanisation stemming from negligence and lack of planning have interrupted natural flow of water. Unregulated development reduces the rivers' capacity to carry water, as riverbanks are increasingly encroached upon for housing and commercial infrastructure. But the problem extends beyond Bangladesh's borders. A significant share of the blame lies upstream, where dams and barrages built by India divert, withhold or disrupt the natural flow of transboundary rivers to deprive Bangladesh of essential water during dry seasons. For a country whose whole existence is dependent on these shared rivers, this is particularly concerning. This diminished water flow has wide and terrible consequences. Fishing communities are losing their livelihoods, forcing many to migrate to overcrowded cities. As rivers dry up, silt builds up that makes navigation more difficult. In coastal areas, saltwater is creeping inland, which ruins farmland and contaminates drinking water. \nOver the years, various efforts have been made to save the rivers, but their effectiveness has consistently fallen short. While pledges to protect rivers are frequently made by different levels of government and even the courts have ordered action, illegal encroachment and pollution have remained unchecked under the influence of political power and vested interests. As a result, despite good intentions, most efforts have remained confined to promises. In the past, some projects were undertaken to increase water flow through dredging, but those were often irregular and poorly managed. One recurring flaw is dumping dredged soil along riverbanks, only for it to be washed back into the river during the monsoon. This not only wasted effort but sometimes actually made siltation worse. Other small-scale efforts like tree planting or occasional clean-up drives are too limited and insufficient to meet the scale of the crisis.\nImmediate and coordinated action is now essential to stem the tide of this escalating ecological crisis. The RDRC study outlines some necessary measures to address the domestic issues such as pollution control, erosion prevention and ecosystem restoration. However, the most pressing challenge involves transboundary cooperation, as most of Bangladesh's rivers originate upstream, particularly in India. Existing dams and diversions on shared rivers have already placed Bangladesh in a vulnerable position. This necessitates bilateral agreements with India to ensure equitable water-sharing, protect downstream flows and ecological balance. Meanwhile, China's longstanding interest in constructing barrages on the Padma and Teesta rivers presents a potential alternative should bilateral talks with India prove unsuccessful. With rivers continuing to disappear day by day, the stakes for Bangladesh are too high for inaction. The country must pursue every available solution to secure its rivers before it is too late.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The clock is ticking on Bangladesh's rivers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-clock-is-ticking-on-bangladeshs-rivers-1744468279",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       April 13, 2025 00:00:00  \nThere is no doubt that artificial intelligence (AI) will significantly change the global economy in the near future due to the fast-growing competition among nations that tap its benefits. Advanced countries are well ahead in the competition thanks to their cutting-edge knowledge and technology, whereas developing nations are struggling to catch up. The net result is that there exist a wide gap between the two in regards to AI, which will leave a far-reaching impact on millions of people in the coming days. It is also likely that millions of jobs will vanish, creating severe social tension and chaos in the world. However, there is a big potential to explore diversified opportunities due to the proliferation of AI.\nUN Trade and Development (UNCTAD) made these observations in its Technology and Innovation Report 2025, released in the first week of this month. The theme of the latest report is Inclusive Artificial Intelligence for Development, which stresses strategic investments, inclusive governance, and global cooperation to ensure that the benefits of AI are shared equally by all rather than reinforcing current discriminations.\n\nIt is to be noted that AI is one of the key frontier technologies and is generally defined as the capability of a machine to engage in cognitive activities typically performed by the human brain. AI implementations focusing on narrow tasks are widely available and used, for example, in recommending online purchases, for virtual assistants in smartphones and for detecting spam or credit card fraud. New implementations of AI are based on machine learning and harness big data. \nAgain, frontier technologies are defined as new and rapidly developing technologies that take advantage of digitalisation and connectivity. These are emerging at the intersection of radical scientific breakthroughs and real-world implementation. UNCTAD report mentioned 16 more frontier technologies besides AI. These are the Internet of Things (IoT), Big data, Blockchain, 5G, Metaverse, 3D printing, Robotics, Drone technology, Solar photovoltaics (Solar PV), Concentrated solar power, Biofuels, Biogas and biomass, wind energy, Green hydrogen, electric vehicles, Nanotechnology, and Gene editing. These technologies are changing our lives, communication, innovation, creation, and business. Moreover, these are helping to address some of the most pressing global issues we face.\nUNCTAD report mentioned that AI is expected to reach US$4.8 trillion in market value within a decade, by 2033, to be precise. At present, the share of AI in the leading frontier technologies market is only seven per cent, while the Internet of Things grabs 36 per cent. Due to rapid growth, by 2033 the share of AI may reach 29 per cent. The UN agency report, however, pointed out that access to AI infrastructure and expertise remains concentrated in a few economies. For instance, only 100 firms, mainly in the United States (US) and China, account for 40 per cent of global corporate research and development (R&D) spending. \"Leading tech giants, such as Apple, Nvidia and Microsoft, each have a market value of around $3 trillion, rivalling the gross domestic product (GDP) of the whole African continent,\" it added. Thus, the report cautioned that market dominance, at both national and corporate levels, is likely to widen technological divides, leaving many developing nations at risk of missing out on the benefits of AI.\nAnother big risk the fast-growing AI market poses is the loss of jobs. UNCTAD report estimated that AI could impact 40 per cent of jobs worldwide as the 'benefits of AI-driven automation often favour capital over labour.' This may widen inequality and reduce the competitive advantage of low-cost labour in developing economies, cautioned the report. At the same time, the report expressed optimism that AI is not just about replacing jobs; it can create new industries and empower workers. To use AI to enhance employment opportunities rather than eliminate those, the UN agency stressed investing in reskilling, upskilling and workforce adaptation. In this connection, it is critical to formulate effective AI policies in the countries, so they can focus on infrastructure, data and skills.\nSo far, most AI policies have been formulated by developed countries. The UNCTAD report showed that at the end of 2023, around two-thirds of developed countries had a national AI strategy, and only six of the 89 national AI strategies were from LDCs. Bangladesh and Sierra Leone took the lead in 2019 to formulate AI policies and were joined by four other LDCs in 2023. \nAnother critical aspect is global AI governance, which will play a significant role in determining the status of different nations in the world of AI. As AI regulation and ethical frameworks take shape, UNCTAD strongly recommends that developing nations join the initiative. This is crucial to ensure that AI serves global progress, not just the interests of a few. The report argues that stronger international cooperation is necessary to create a global AI framework prioritising equity, transparency, and shared benefits. \nThe analyses of the pros and cons of AI globally in the near future by UNCTAD will definitely serve as a valuable guideline for developing nations like Bangladesh. Though the country has taken a number of steps in digital transformation and is also trying to move ahead in terms of AI, a lot of work is needed in this connection. The Digital Bangladesh initiative, launched one and half decades ago, successfully pushed digital transformation in various sectors. The country's potential is also reflected in the frontier technologies readiness index, as revealed in the UNCTAD report. \nIn 2024, Bangladesh ranked 112th among 170 nations in the frontier technologies readiness index overall, jumping from 121st in the previous index. The index has five key components, and ranking in those areas can provide more details of readiness. \nThe country's position is significantly low in ICT and skills rankings, 140th and 132, respectively, reflecting the bad governance, flawed planning and wrong investments that drove the Digital Bangladesh initiative from its optimal paths to a large extent. The country's position is slightly better in industry and finance rankings, 108th and 90th, respectively. In the research and development (R&D) ranking, Bangladesh stood 61st, showing that the country has developed a research repository, although it is still unable to translate the research outcomes into action significantly. To put it another way, Bangladesh has developed a good research base to tap into the future AI market and contribute to the global AI policy-making discourse and governance. Now, a long-term realistic plan is required to continue the advancement in research and draw adequate investment from home and abroad. Securing jobs is also critical for the country, as AI-driven displacement is unavoidable.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Growing AI market to stir global economy",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/growing-ai-market-to-stir-global-economy-1744468414",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       April 13, 2025 00:00:00  \nEvery afternoon, children from Old Dhaka's Lakshmibazar neighbourhood would gather in the area's only playground-a small open space amid a concrete jungle-to play and get a breath of fresh air. But on March 20, a local resident named Habibur Rahman was surprised when his son returned home early from the field. When he asked his son why he had come back so soon, the boy replied with frustration, \"Baba, we can't play there anymore. Some uncle told us to play somewhere else.\"\nLater, Habibur Rahman went to the field and, to his utter surprise and dismay, discovered a banner hanging at the entrance of the playground that reads \"Dhaka Vinodon Express.\" Inside, several rides had been set up, and an entry fee of Tk 50 was being charged.\nIllegal occupation of Lakshmibazar playground in the name of arranging Eid and Baishakhai fair is not an isolated incident. Similar fairs-some stretching for over a month-are being organised by politically influential people in other areas as well. Reportedly, four other playgrounds under Dhaka South City have been encroached upon that include Dhupkhola Playground, Sadek Hossain Khoka Playground and Malitola Park along English Road. Meanwhile, in Dhaka North City, an Eid fair is being held at the playground along Paris Road in Mirpur 11.\nFinding a playground in Dhaka is already daunting challenge. As many as 41 wards out of 129 don't have a single playground. Meanwhile, the wards that have a few playgrounds left are perpetually under the threat of being occupied. According to a study by the Bangladesh Institute of Planners (BIP), 84 per cent of Dhaka's residents live outside of playground facility access.\nThe loss of these vital recreational spaces underscores a growing crisis for Dhaka's children. In a city where playground is already a rarity, parents face a daunting challenge. Every child yearns for the simple joy of running and playing in a park or playground, essential for their refreshment, mental well-being, and overall development. Ironically, the city is ill-equipped to fulfill this basic right of the children. As a result, most of the city children are being deprived of the joy and benefits of outdoor sports such as football and cricket. Pitifully, in many areas children can be seen playing cricket on narrow streets or dangerously on rooftops. In most cases, lack of playground holds kids confined to their home, playing video games or cartons. This lack of healthy recreational facility contributed to a surge in mobile phone and digital gaming addiction.\nThe problem extends to educational institutions as well. Most schools in Dhaka lack playgrounds altogether. Even those with existing playgrounds often restrict their use for sports activities, a baffling decision that disregards children's fundamental right to play. This neglect is a departure from the past, when a school without a playground was unthinkable.\nAgainst this backdrop, the encroachment of playgrounds in the name of holding fairs represents a devastating blow to the city's already dwindling recreational spaces. The question begs: who sanctions these encroachments? Organisers claim to have obtained leases from the city corporation; a claim the city authorities denies. The lack of accountability and the apparent inaction of the authorities to prevent such illegal activities are deeply concerning.\nThe responsibility for ensuring adequate playgrounds in every ward of the city rests squarely on the shoulders of the city authorities. By denying children access to playgrounds and opportunities to engage in healthy recreational activities, we are not only hampering their development but also affecting their emotional well-being and mental and physical growth. The urgent need for action, therefore, cannot be overstated.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Stop encroachment of playgrounds",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/stop-encroachment-of-playgrounds-1744468473",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 13, 2025 00:00:00  \n\nFor over a decade, flyovers have been promoted as a key solution to Dhaka's traffic congestion. However, the current scenario tells a different story. Merely constructing flyovers without proper planning and supporting infrastructure has not only failed to ease congestion but, in many cases, has worsened it.\nMost of Dhaka's flyovers lack appropriate connecting roads, leading to a situation where vehicles descend directly onto already congested main roads. This creates fresh bottlenecks and gridlocks, paralysing not only the flyovers themselves but also the surrounding areas. As a result, city dwellers face long hours stuck in traffic, leading to delays in reaching workplaces, disruption of social and family life, and difficulties in transporting patients to hospitals.\nBeyond the obvious physical and mental strain, the city is also suffering economically-from wasted fuel, productivity losses, and increased pollution. The intended benefits of these flyovers remain largely out of reach due to poor planning and lack of coordination.\nTo address this, it is imperative that the Roads and Highways Department and other relevant authorities ensure every flyover project is backed by a comprehensive design and implementation plan. This must include adequate connecting roads, ramps, strategically placed entrance and exit points, and alternative routes both during and after construction. Only through such integrated planning can the city hope to escape the persistent trap of traffic congestion.\nPragga Das\nStudent, Department of Economics\nEden Women's College\nproggadas2005@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Flyovers traps in Dhaka",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/flyovers-traps-in-dhaka-1744468485",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-04-2025"
    }
]