[
    {
        "full_article": "After two years of relentless Israeli bombardment, Palestinians in Gaza are finally getting a reprieve. The ceasefire agreement, signed by Hamas and Israel as part of U.S. President Donald Trump’s 20-point peace plan, brought a pause in Israel’s attacks. Hamas is expected to release all living hostages on Monday (October 13, 2025) and the bodies of the rest on the days after. Israeli troops have already started retreating to the initial withdrawal line, from Rafah in the south to Gaza City in the north along the border, and some 2,000 Palestinian prisoners will be released. Mr. Trump deserves credit for the ceasefire. Until recently, Israeli Prime Minister Benjamin Netanyahu, who always vowed to fight until “total victory”, resisted all calls for a ceasefire. When Israel started the Gaza war, after Hamas’s October 7, 2023 attack, it pledged to “dismantle” the Islamist militant outfit. In two years, Israel has turned Gaza into rubble and displaced most of its 2.3 million people. Its brutal genocidal assault and starvation of Palestinians led to its international isolation. Yet, Hamas remained an unresolved problem. Mr. Netanyahu wanted to continue to fight irrespective of international public opinion. But the U.S., which continues to back Israel militarily and diplomatically, finally strong-armed Mr. Netanyahu into accepting the ceasefire in return for the release of hostages.While the ceasefire is a major reprieve for the Palestinians, the hostages and their families, it may not necessarily lead to lasting peace in Gaza. The ceasefire is only the initial phase of the Trump plan, which also calls for demilitarising Hamas, placing Gaza under an international governance body, and the deployment of an International Stabilisation Force for security. In its response to the Trump plan, Hamas agreed to release the hostages but remained non-committal on other terms. Another contentious issue is the continuing presence of the Israel Defense Forces (IDF) in Gaza – after the initial withdrawal, the IDF will still control some 53% of Gaza. Mr. Trump is expected to travel to Egypt on Monday to attend a summit on Gaza — French President Emmanuel Macron and British Prime Minister Keir Starmer will be present. The renewed international attention on the Palestine question is a positive development. But the question is whether these deliberations can bridge the gaps in the Israeli and Palestinian positions, leading to lasting peace. Hamas is unlikely to accept demands to dismantle itself, certainly not after fighting Israeli forces for two years. But it could be pressured to relinquish power in Gaza for a Palestinian authority, backed by international actors, while Israel should be persuaded to leave. For Mr. Trump’s hopes for lasting peace, he should act as an independent broker, not as a partisan patron of one country, and recognise Israel’s security and the Palestinian quest for self-determination. Published - October 13, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        Palestine\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        peace negotiations\n                    \n                            /                      \n                        \n                        Egypt\n                    \n                            /                      \n                        \n                        France\n                    \n                            /                      \n                        \n                        United Kingdom",
        "headline_1": "Pause, not peace: On the Hamas-Israel ceasefire agreement",
        "headline_2": "Donald Trump should play the honest broker, not a partisan patron",
        "link": "https://www.thehindu.com/opinion/editorial/pause-not-peace-on-the-hamas-israel-ceasefire-agreement/article70155277.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "13-10-2025"
    },
    {
        "full_article": "At a time when social media threats, reciprocal actions, and shrill rhetoric are becoming the global norm, the manner in which the India-U.K. economic relationship is unfolding is a refreshing change. U.K. Prime Minister Keir Starmer’s two-day visit to India last week reinforced the existing solidity in economic relations and deepened them. India’s negotiations with the U.S. have been fraught, erratic, and dramatic. U.S. President Donald Trump has also shown that he is more than willing to change the contours of deals already struck. Negotiations with the European Union have been less fraught and dramatic, but there certainly seems to be a gap between the positive assurances made by the leaders and what the negotiators say in private about the deal’s progress. Against this backdrop, Sir Starmer chose to bring a delegation of more than 100 entrepreneurs, cultural representatives, and university vice-chancellors and left India with defence, investment and movie deals, further cementing the trade deal signed in July. The keenness to deepen trade relations makes eminent sense. India, despite being the fourth-largest economy in the world and one of the largest markets, accounts for less than 2% of the U.K.’s total merchandise exports. The U.K. accounts for about 3% of India’s exports. There is ample scope for trade to grow. Growing India-U.K. trade could also mitigate some of the impact of the U.S.’s punitive 50% tariffs, if they remain.One of the unsaid reasons why India is slowing its capital expenditure is because it needs to fund its defence acquisitions. Sir Starmer’s visit made sure that some of these acquisitions — in the form of a £350 million missile supply deal — came the U.K.’s way. The U.K. government also revealed that 64 Indian companies have so far committed to invest £1.3 billion in the U.K. It goes without saying that U.K. companies would have made similar investment commitments in India, but the Indian government has inexplicably not made these public yet. Yet, statements by companies such as Rolls-Royce show that there is enthusiasm there. The Indian population in the U.K. is the largest ethnic minority, and this is not lost on the political leadership either. One of the first things Sir Starmer did on arriving in Mumbai was to visit Yash Raj Films (YRF) and meet Indian producers. The result was that YRF has committed to shoot three films in the U.K. Two U.K. universities have also committed to opening campuses in India. This cross-sector cooperation is how mature democracies should work together — without fuss and ego, just business. Published - October 13, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        European Union\n                    \n                            /                      \n                        \n                        culture (general)\n                    \n                            /                      \n                        \n                        business (general)\n                    \n                            /                      \n                        \n                        university\n                    \n                            /                      \n                        \n                        film making\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        missile systems\n                    \n                            /                      \n                        \n                        population\n                    \n                            /                      \n                        \n                        democracy",
        "headline_1": "Mature relationship: On the India-United Kingdom economic relationship",
        "headline_2": "India and the United Kingdom have deepened business ties without fuss",
        "link": "https://www.thehindu.com/opinion/editorial/mature-relationship-on-the-india-united-kingdom-economic-relationship/article70155344.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "13-10-2025"
    },
    {
        "full_article": "Trump appears to be open to fixing ties with New Delhi. GOI did well by holding strong\nIt’s still early days, but US ambassador-designate Gor’s meeting with Modi over the weekend signalled the possibility of a thaw in bilateral ties. It’s rare for PM to meet an ambassador before the person has actually assumed office. Gor also came bearing the message of strengthening India-US partnership, particularly in critical minerals, the supply of which China is again looking to squeeze. Modi had also praised Trump’s Gaza Peace Plan last week. All of this may suggest that a trade deal between the two countries – the main bone of contention – is close. \nTrue, given Trump’s mercurial nature, he is capable of changing his mind any time. However, there are also reasons to believe that Washington now realises that New Delhi is not going to buckle under the pressure of tariffs. After all, India is in the right here. It was willing to negotiate on all trade matters, including working towards a consensus on import of Russian oil – which the previous Biden administration had asked to buy. The additional 25% tariff for importing Russian oil was totally just Trumpian pique. India also played it smart by messaging a show of force with other Brics members. Hence, if all of this was meant to be Trump-style pressure negotiations, it possibly did not work much. \nSecond, now that the award of the Nobel Peace Prize has passed, Trump might start listening to some of his more rational advisers. It’s because he was so obsessed with the prize, pushing claims about stopping seven wars, including, ridiculously, the India-Pakistan conflict in May, that Trump took umbrage at New Delhi’s vehement denial of his involvement in the summer ceasefire. This made him inclined to listen to tariff hawks like Peter Navarro and Howard Lutnick. But now that things have settled down on the Nobel front, Trump may be more open to listening to steadier voices like Marco Rubio. \nAt the end of the day, India and US both benefit from a productive relationship. Our long-term strategic visions for a stable, rules-based international order align. That can’t really be said of the India-China relationship where the Chinese Communist Party wants to dominate Asia in the long run. India did well to hold its ground vis-à-vis US. It showed it can’t be bullied. Trump White House would do well to get its India policy back on track and pick up things from where they were left off in Feb during Modi’s visit to Washington. Gor seems to have taken tentative steps in that direction. \n\n",
        "headline_1": "Loosening Gordian Knot",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/loosening-gordian-knot/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-10-2025"
    },
    {
        "full_article": "Trends change. Quiet quitting gives way to job hugging. AI will wreak more change. Then what?\nHR trends have this in common with diet trends, that just when you learn one, another pushes it to the backburner. Just when the Great Resignation, quiet quitting, acting your wage, bare minimum Mondays, generally behaviours of employees with ennui, have entered everyday vocabulary, the spotlight is shifting to their radical opposite, which is job hugging. Yeah, this is new. Hugging trees, loved ones, hugging to send social messages like Princess Di, or to send geopolitical ones, to support a grieving person, to cheer a victorious athlete, all these and more we know well. But hugging a job? Who loves it that way? \nTurns out this has both economic and philosophical explanations. The job market cooling in many places explains why people with a job are holding on to it for dear life. Experts say this clinginess is not one-sided. In different measures, it can also be seen on the employers’ part. What’s interesting is that though it’s being driven by external uncertainties, and in that sense it’s being forced upon workers, and it’s accompanied by loss of bargaining power, it need not mean a bad attitude to the work itself. One can end up appreciating one’s work more and therefore doing it more impressively, in a job-hugging market. Even constantly being told that AI is close to snatching one’s job away need not spur one to just give up, but to try harder, smarter.\nBeyond the immediate market conditions though, which change with the seasons, there is also by now a solid, analytical resistance to hustle culture, and to the idea that an entrepreneurial life is the only meaningful one. Let’s appreciate the 9-to-5 jobs till we have these, the showing up, doing sincere work, and then spending the rest of the time building a rich, personal life.\n\n",
        "headline_1": "Autumn Of Work",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/autumn-of-work/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-10-2025"
    },
    {
        "full_article": "The IT sector isn’t vanishing. In fact, companies are still signing multi-billion-dollar deals related to AI. But the opportunity pool is shifting\nAsk anyone who entered India’s IT sector in the late 1990s or early 2000s, and they’ll tell you the same story. Getting into a big IT services company was like securing a lifetime guarantee. You joined as a coder or analyst, climbed the rungs patiently, and, more often than not, stayed put for decades. It was predictable. It was comfortable. And for a whole generation, it was aspirational.\nBut the ground beneath that pyramid is cracking. Artificial intelligence, automation, and global market churn are dismantling the very foundation of the model that once powered India’s $280 billion IT industry. Today, companies don’t want armies of engineers filling cubicles. They want a handful of highly skilled professionals — sharp, adaptive, and capable of hitting the mark with precision. It’s not about the biggest army anymore. It’s about who has the most snipers.\n\nThat’s the real story behind the TCS layoffs of thousands of people. On the surface, it looked like a standard case of over-hiring. But scratch deeper, and the picture changes. These weren’t entry-level coders being shown the door. They were mid-level and senior managers — the people who for years oversaw transactions, tracked project progress, and intervened when something went wrong. Why? Because those functions are now being done by AI-powered project management tools — more cheaply, more consistently, and with fewer errors. As Krishnakumar Natarajan, co-founder of Mindtree, put it bluntly: “Organisations will get much flatter because AI-driven development tools are delivering more productivity than we ever imagined.”\nBenching the bench\nThe ‘bench’ was once considered the secret weapon of Indian IT. Companies could keep staff unassigned and then quickly deploy them when new projects came in. But in today’s environment of tighter budgets and razor-sharp margins, the bench feels less like a safety net and more like a waiting room before the exit door. For many, being on the bench now is no longer neutral; it’s a risk signal.\nTime is the ultimate KPI\nTalk to IT professionals today and you’ll hear the same refrain: productivity has been redefined. A senior programme manager shared how his team was tasked with cutting bugs by 75% and shipping 25% more features this year — without any new hires. A mid-career engineer told me he was juggling faster delivery expectations alongside mandatory upskilling in AI/ML, often outside regular hours. The message is loud and clear: output, accuracy, and speed matter more than ever. Your ability to adapt AI into your daily work is not optional anymore. It’s the baseline.\nReloading with blanks\nIf the industry is evolving this fast, then upskilling sounds like the logical answer. And indeed, almost 80% of IT professionals surveyed said they’re investing in certifications. Employers are offering subscriptions and training access. On paper, it looks like the ecosystem is doing the right thing. But here’s the catch. A mid-career engineer told me: “Upskilling programmes have been around forever. But personally, I’ve found them kind of useless. You can find much higher-quality content on YouTube.” The problem isn’t lack of training — it’s the lack of relevance. Teaching thousands of employees the basics of Python or a new cloud tool isn’t enough. Reskilling must be contextual, hands-on, and directly tied to solving real business problems. Otherwise, it’s a check-box exercise that does little to future-proof careers.\nHard skills alone don’t cut it\nThe sharpest IT professionals of tomorrow won’t just be coders or consultants. They will be multidimensional. Some will be AI-augmented builders, using automation to achieve speed and accuracy at scale. Others will be business translators able to bridge the complexity of technology with client expectations. Still others will be specialist generalists — deep in one domain, but agile enough to work across adjacent ones like cloud, security, or UX. But technical skills alone won’t cut it. As one product manager who lost his job after 15 years said, “Hard skills land you the job; soft skills help you keep it.” Communication, empathy, and the ability to lead through uncertainty are increasingly the differentiators in a shrinking pyramid.\nNot shrinking but shifting\nThis is perhaps the most misunderstood part of the story. The IT sector isn’t vanishing. In fact, companies like TCS, Infosys, and Wipro are still signing multi-billion-dollar deals in AI implementation and digital transformation. But the opportunity pool is shifting in character. Industry-wide growth has been stuck in low single digits for the past two years. Global capability centres are competing aggressively. Clients are tightening budgets. And yet, for those who can adapt, the demand for AI fluency, domain knowledge, and consulting skills has never been higher. The future is not smaller — it’s sharper.\nStability to survival\nThis is the hardest truth for IT professionals to accept. The model that gave so many a stable life — mass hiring, career-long promotions, and corporate protection — is breaking down. In this new era, waiting for an employer to reskill you or to shelter you through downturns is not a viable plan. The winners in this new landscape will be those who reinvent themselves; the losers will be those who cling to the old pyramid, hoping it will hold. Remember what Microsoft CEO Satya Nadella said: “The hardest part of AI isn’t the tech. It’s getting people to change how they work.” That’s the challenge ahead for India’s IT professionals. The question is, are you ready to change how you work?\n\n",
        "headline_1": "Not armies but snipers! Why IT professionals must rethink careers",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/voices/not-armies-but-snipers-why-it-professionals-must-rethink-careers/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-10-2025"
    },
    {
        "full_article": "Paaltu Chuha’ is considered an offensive term. The Chhattisgarh high court recently ruled that calling your husband this phrase — loosely translated as pet rat — amounts to cruelty. Had the wife simply realigned a few letters and called him ‘patla chuha’ or skinny rat instead, she may have sailed through. After all, in a world where people are injecting themselves with Ozempic and Mounjaro in the quest for slenderness, the phrase would read less like an insult and more like a compliment. Fit these days is just a euphemism for thin.\nSize does matter. If you are a tampon, a key, a battery or a chappal. But we have extended this parameter to human beings. Especially women. I am not immune to the cult of shrinking waistlines. In fact, I’ve spent a lifetime trying to be a patla chuha, even when I was what could be considered an ‘ideal weight’. Partly because there is a plump 10-year-old constantly living inside my head who was once serenaded with ‘Twinkle, twinkle little star, how I wonder what you are, up above the world so high, like a teapot in the sky.’\nThen came professional pressures. As a young actress, a director asked if I could lose five kilos before his shoot. Considering it was a mere two weeks away, I was tempted to reply, ‘Yes, I can, I just have to cut my left leg off.’ Instead, I decided to push my sluggish metabolism by giving up carbs and taking up running. I measured every parameter: kilos, inches, and ratios like I was an architectural marvel that had to withstand tectonic shifts, not a woman made of soft flesh and strong ideas.\nA woman’s body seems to be a barometer of cultural transitions. During the Renaissance, art celebrated undulating bellies and wide hips. These were signs of prosperity. Victorian corsets shrank waists and freedom. The flapper girls rebelled with their straight lines to match their cigarettes. Marilyn Monroe’s curves and the emaciated models of the ’90s reflected the shifting values of their times. Each generation redraws the outlines of beauty. Ours worships the toned and slender. For women with the time and the means to count macronutrients, hire trainers and procure expensive injectables, thin is now the ultimate status symbol.\n\nILLU CREDIT: CHAD CROWE\nIn the manner of every trend, this will change again. Wait long enough and your body type —whether it’s banana or laddoo-shaped — will become fashionable. Like the pair of slim-fit Levis I have been hoarding for the last 25 years which I try on and use as perhaps a measure of my worth as much as my size after each transition — marriage, childbirth, perimenopause. That no-stretch pair even led to an epiphany and, the title of a book, when unable to zip it up after a bout of Diwali indulgences, I realised that pyjamas are forgiving in nature but it’s jeans that really hold a grudge.\nSo does fat. If my fat stores could speak instead of showing off more dimples than Shah Rukh Khan, they’d insist that they are not villains but a means of evolutionary insurance. Survival of the fittest was never about looking good in a photograph; it was about surviving droughts and famines.\nFor decades, we have been told that being slim is about self-control and discipline. Recent research shows that each body has a range it gravitates towards, influenced by factors like genes and hormones. There was a time I blamed my half-Gujarati genes for storing excess calories on my thighs in almost the same spongy form as our favourite snack-dhokla.\nA slow metabolism, though, isn’t laziness, it’s efficiency. I can eat and move as much as my slim friend and while she burns through every calorie in a flash, I have some left over to tuck away for future use. If I were a car, I would be a shining example of fuel-to-mileage efficiency. Auto magazines would write odes about my engine endurance. Tesla would bid for patent rights, calling me the epitome of engineering.\nThese days, though, weight issues are no longer just a woman’s burden. Men, too, are using injectables and liposuction to get to their six-pack ideal. A twisted step toward equality, where both genders endure torment in pursuit of nebulous perfection.\nWhile a part of my self-esteem may always be tied up with a number on the scale, I can no longer facilitate it through the currency of pain. Strong has replaced slim in my lexicon. Instead of starving, I lunge and squat through my fifties to maintain bone and muscle mass.\nThe tug of war between vanity and genetics will perhaps continue for a lifetime, with each side winning small skirmishes. But survival of the fittest isn’t about fitting in — into jeans, norms or stereotypes. It’s about standing out. While the patla chuhas perfect angles for Instagram reels, it’s the sturdy, dhokla-powered, mota bhais and bens who are running the show — in boardrooms, stock markets, and politics.\n\n",
        "headline_1": "In the age of patla chuhas, long live the mota bhais and bens",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/mrsfunnybones/in-the-age-of-patla-chuhas-long-live-the-mota-bhais-and-bens/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 13, 2025 00:00:00  \nIt is heartening that a food supplement for undernourished children, developed by the International Centre for Diarrhoeal Disease Research, Bangladesh (icddr,b) in collaboration with Washington University in St. Louis, has been recognised by the Time magazine in its prestigious \"Best Inventions of 2025\" list under the Social Impact category. Severe childhood malnutrition often causes long-term chronic health conditions, partly due to impaired development of the gut microbiome. To address this, researchers from icddr,b and Washington University formulated a therapeutic food named microbiota-directed complementary food No. 2 (MDCF-2). The supplement, containing a precise mix of chickpea flour, soybean flour, peanut flour, and green banana, stimulates the growth of specific intestinal bacteria that break down food into molecules essential for bone growth and brain development. Clinical trials have already shown that malnourished children consuming MDCF-2 experience significant improvements in weight and height. Moreover, an October 2024 study identified a key growth-inducing enzyme activated by the therapy. Major studies are now underway in India, Pakistan, Mali, and Tanzania.\nDr Tahmeed Ahmed, Executive Director of icddr,b, rightly observed that this achievement illustrates how science and compassion can come together to tackle one of the world's most persistent health challenges. MDCF-2 offers renewed hope that locally developed, affordable innovations can help millions of undernourished children not only survive but also thrive. Just as the oral rehydration solution (ORS) developed by the icddr,b revolutionised the fight against diarrhoea worldwide, this breakthrough has the potential to make a lasting impact on malnutrition. \nThis achievement is particularly encouraging for Bangladesh, where, even five decades after its independence, nearly one in four children is stunted, meaning their height falls far below the standard for their age. In addition, 22 per cent of children are underweight, while 11 per cent suffer from wasting, a severe form of malnutrition. According to the UNICEF, children deprived of proper nutrition in their early years perform poorly in school, experience impaired development, earn less as adults and remain trapped in a cycle of poverty and deprivation. Good nutrition, therefore, is the key to children's survival, health, growth and development. Families are expected to play a crucial role in providing nutritious food, but impoverished households often cannot shoulder this responsibility alone. Against this backdrop, the government should consider including MDCF-2 in its list of food items distributed under social safety net programmes. \nChildhood malnutrition, however, is not always caused by a lack of food. The consumption of junk food is another significant contributor. Schools across the country are surrounded by shops selling unhealthy food items and their aggressive marketing tactics such as colourful packaging and free gifts which draw children like a magnet. It lures them to consume highly processed, nutrient-poor foods instead of wholesome meals. In fact, finding nutritious items for children's school tiffin at local shops is often an arduous task. Therefore, if MDCF-2 can be made widely accessible and affordable, it could make a substantial dent in childhood malnutrition. The next crucial step, therefore, will be to ensure that this supplement reaches all children in areas where acute malnutrition is rampant. Achieving this will require strong policy support, investment in commercial production with strict quality control, efficient distribution and close collaboration among governments, global health agencies and local communities. If effectively scaled, MDCF-2 could become another landmark contribution from Bangladesh to global public health.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "MDCF-2: A breakthrough in fight against child malnutrition",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/mdcf-2-a-breakthrough-in-fight-against-child-malnutrition-1760282947",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       October 13, 2025 00:00:00  \nPoverty has occupied the central stage of development thinking. In fact, development is about improvement in the income level and basic living standards of the common people. It should focus first and foremost on addressing poverty among the masses. It is because of this, the World Bank (WB), the main function of which is to provide financial and technical assistance to low and middle-income countries to help reduce poverty and promote development, in its October 2025's Bangladesh Development Update stated that the poverty rate in Bangladesh climbed to 21.2 per cent in FY2024-25. This marked a rise in poverty by 0.7 percentage points from the poverty rate of the previous fiscal year (FY24) at 20.5 per cent. Notably, the WB update attributed the rise in poverty to factors including slowed down growth, persistently high inflation and worsening labour market conditions. \nAs it happens under every type of government without exception including the incumbent interim one, such reports from the international development agencies would often draw a reaction that is at variance, if not an outright denial. So, one is not surprised when the Finance Adviser of the interim government, Dr Salehuddin Ahmed, could not see eye to eye with the global development lender when it came to its (WB's) report on Bangladesh's poverty situation. Dr Ahmed questioned the reliability of the WB's report. In particular, in his reaction to the media, he subjected the WB's method of determining poverty rate to scrutiny. In the present case, what he was referring to in particular was the method of interviewing 5,000 people. Also, the WB's updating the definition of the extreme poor with a new international poverty line, increasing it from the previous US$2.15 to US$3.00 per day, using the purchasing power parity (PPP) of 2021, has also come under scrutiny. In fact, such updating is a standard practice since the higher threshold is actually driven by the need to update the poverty lines and PPs in line with the currently available data. It has to be acknowledged that the purchasing power of the US dollar is declining and with that all calculations based on the price of dollar are also changing. At the same time, with digitalization, the quality of data is also improving. \nNow, the question is, short of a time-consuming and costly household census as is conducted by the country's central statistical agency, Bangladesh Bureau of Statistics (BBS), from time to time, local as well as foreign research organisations, including the multilateral development partners, usually conduct their surveys on different issues on the basis of such interviews of a limited segment of the population. They select their sample population, that is, a smaller representative group selected from a larger population for the purpose of the study in question. This is the standard methodology followed by socio-economic research organizations. In that case, critiquing this very method that interviews a sample population to reach certain conclusions about different aspects of the interviewees' lives has to be taken with a grain of salt. Then, all such research findings that different research bodies come up with including the watchdog bodies on different occasions have to be questioned. In that case, one has to produce a still better way of conducting socio-economic researches. But until a better methodology of measuring poverty is being invented, one has to make do with whatever (methodology) is at hand. \nThis does not mean that the very idea of poverty or the researches on poverty conducted by the Western development thinkers or their think tanks is sacrosanct and cannot be questioned. Of course, the basis of their perception of poverty is faulty. For poverty is the fallout from the exploitation through which transfer of people's land, other forms of their assets and earnings change hands. Also, state-owned properties are stolen in the same way resulting in the rise in level of poverty of a nation and its population. On this score, the previous autocratic regime is the perfect example of how that happens. Obviously, the root of the sudden rise in poverty under the present interim government to a great extent lay in the wholesale plundering and pillaging of the state as well as the public properties in general by those in power and their henchmen in the previous government. The multilateral lender, WB, would have done well also to have taken into consideration this unavoidable part of the truth when measuring poverty. \nWhatever the case, the fact remains that poverty level in the country has worsened. Two months back, based on similar methodologies, a local economic think tank and advocacy body, Power and Participation Research Centre (PPRC) also reached an identical conclusion that the rate of poverty in the country jumped to 27.93 per cent in May 2025 from 18.7 per cent in 2022. The majority of the households surveyed by the research body found that the issues affecting the lives of their members included indebtedness, chronic diseases, food insecurity, disguised unemployment and other vulnerabilities. Add to those the prevailing economic and political uncertainties during the previous year. What is of especial note, in this connection, is the observation of Mustafa K. Mujeri, executive director of the Institute for Inclusive Finance and Development that, amid high inflation, it is indeed difficult to see a positive economic outlook over the past three years. Poverty researchers have to take into special consideration the variation in prices of the staple diet of the population, rice. It accounts for the highest 11 per cent weighted average in the overall food basket of the country. Since December 2024, the medium and coarse varieties of rice, which dominate the daily dietary menu of the low income people, experienced double-digit inflation. \nThe food inflation was 14.1 per cent in July 2024, a 13-year high, when the past autocratic regime was toppled, and so, the interim government inherited it as a legacy. Obviously, the previous figures of food inflation have to some extent reduced the impact of the performance of the interim government. \nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "How reliable are methods  of measuring poverty?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/how-reliable-are-methods-of-measuring-poverty-1760282974",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       October 13, 2025 00:00:00  \nMuch as the nation strives to bring an end to child marriage, the unlawful matrimony continues in this country. The consequences of such premature marriage for underage girls with adult youths or men are devastating. It is the brides who pay the heaviest price. The girls given off to such marriage are not even asked for their consent. In that sense, their marriage is used as a societal sanction for premature sex and even sexual violence. Thus they lose their right to their bodies and minds.\nIn this context, a global report prepared by the Plan International has shed light on yet another highly disturbing aspect of child marriage. According to it, one in three such girls wedded prematurely is now divorced. Their life is that of social outcasts. The State of the World's Girls Report 2025 titled \"Let me be a child not a wife: Girls' experience of living through child marriage\" prepared by the Plan International paints a bleak global picture of girls. It had gathered information from 15 countries including Bangladesh. Divorced girls face social isolation and financial hardship. Even their poor parents who thought that marriage would be of help to offload a burden are now doubly burdened. \nHere the gender discrimination could not be more vivid. Unwanted by the family of their marriage and also by the parental family, the girls run the risk of falling victim to impulsive acts. Their social security compromised and life and livelihoods devastated, the girls find their existence inconsequential. This is where girls are pushed to although they never were a party to the whole deplorable episode.\nThere is no doubt that it is a hostile world in which girls from poor family background find themselves. How hostile it can be is best illustrated by the sexual violence underage girls are subjected to. When girls below six or 12 years old suffer the sexual aggression, the traumatic experience lasts for their entire life. \n The International Day of the Girl Child observed on October 11 against the backdrop of rise in sexual violence against girls in Bangladesh this year should give the nation enough cause for confronting this sickening reality. An 83 per cent rise in rape of girl children in the first nine months of this year---367 cases as against 195 in 2024---is indeed a chilling development. Cases of attempted rape increased by 163 per cent or nearly 2.6 times. Both numbers are likely to be higher because many such cases go unreported. \nEven the reported cases are enough to set the alarm bell ringing. Higher incidence of sexual aberration has its snowballing impacts on a people. Women and girls are soft targets with the underage among them being more vulnerable to sex predators. Evidently, girls are neither safe in their parents' home nor in the new family of their husbands. They have not the freedom of deciding when to marry or when to have babies. There should have been forces strong enough to ensure that the sex predators have no space in society. \nDecline in law and order has much to do with the rise in sex crime. When elements with doubtful characters see that laws are violated with impunity, they feel encouraged to explore limits of their aggressive conducts including sexual violence. The offenders hope they can as well go scot-free after committing the crime. Then, there is the easy access to prurient social sites which can incite sex drive of young people. \nUnless the discriminatory social structure is dismantled and poor families are helped to avoid marrying their daughters off early, it is impossible to fight sex offences on both fronts. Child marriage and sexual violence are in fact two sides of the same coin. Both demand awakening of minds through a consistent social campaign. Allocation of fund like the one girls from poor families receive for their education can help contain child marriage. Local communities need to be organised and stand as sentinels against sexual aberration.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Child marriage and sexual violence against girls",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/child-marriage-and-sexual-violence-against-girls-1760283000",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 13, 2025 00:00:00  \n\nThe working environment is more dynamic than ever, and the main focus of that change is Artificial Intelligence (AI). Automated recruitment tools, performance analytics powered by AI and many other sophisticated technologies are slowly replacing manual HRM processes in organisations. However, does this imply that AI will become an all-encompassing substitution for the HR professionals or is it just that it will transform the role of the HR professional?\nAI has already penetrated HR. Artificial intelligence-based tools will be able to screen resumes, set up interviews, analyse employee data, and even forecast risk of turnover. AI helps HR teams to pursue more strategic initiatives by automating some of the more mundane administrative roles. To explain, AI can promptly detect trends on employee engagement surveys so that managers can take early measures before minor issues turn into major challenges. \nRegardless of these developments, AI is incapable of replacing some important parts of HR. The emotional intelligence, empathy, moral judgment and cultural sensitivity are uniquely human traits. It takes subtle insights to resolve a workplace dispute, mentor, or even to motivate an employee which AI is incapable of replicating. This fact was revealed in interviews of the HR professionals, who confirmed that AI can assist in HR performances, but it cannot substitute the human element of people management.\nA collaborative strategy is thus likely to become the future of HR, with AI doing most of the repetitive work and human beings doing the strategy, relationship-building and creativity. This move is a challenge as well as an opportunity to HR students and young professionals. The introduction of AI tools, the ability to perceive the information presented in data and the development of soft skills will become a necessity to remain relevant in a changing workplace.\nIn addition, one should not disregard ethical considerations of AI implementation. The HR teams should make certain that the decisions made by AI are objective, impartial, and open. Although AI is able to indicate trends in hiring or performance, a person should make sure that those systems do not propagate discrimination or inequality. So, AI is not a threat to HR, it is an extremely efficient tool that may help people to improve their abilities. Through adopting technology without losing the human qualities that are unique to HR, organisations will be in a position to create work environments that are more effective, equitable, and conducive. \nFarhanah Mohammed Sofi Uddin\nUndergrad student\nfarhanah.uddin@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "HR management in the age of AI",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/hr-management-in-the-age-of-ai-1760283022",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-10-2025"
    }
]