[
    {
        "full_article": "Union Home Minister Amit Shah displayed political urgency when he formalised the BJP’s reunion with the AIADMK, a year ahead of the Tamil Nadu Assembly election. A cautious Edappadi K. Palaniswami, the leader of the AIADMK, was also persuaded to endorse a pre-poll agreement to form a coalition government. Coming just days after the AIADMK’s Rajya Sabha MPs voted against the Waqf (Amendment) Bill, the move places the Dravidian party firmly in the NDA camp and severely restricts any leeway for it to take an independent line on issues of public interest. The newly stitched-up alliance could also lead to an electoral polarisation, narrowing the field for fence-sitters and marginal players who now have to choose between the fronts led by the DMK and the AIADMK to make any impact at all in the first-past-the-post system. Besides the electoral arithmetic, the BJP high command must have been conscious that time is needed to revive the chemistry between the two parties and to mount a cohesive campaign to dislodge the DMK. The BJP might also have been uneasy with the DMK’s growing national visibility, especially after its leader and Chief Minister M.K. Stalin launched the Joint Action Committee for Fair Delimitation with support from parties in seven States. Not surprisingly, Mr. Shah accused the DMK of raising the three-language policy, delimitation, and NEET exemption to divert attention from governance failures. But with the AIADMK’s stand on these issues not very different from the DMK’s, how these will be handled in a common minimum programme remains to be seen.To dispel the perception that the BJP is exploiting a weakened AIADMK, Mr. Shah affirmed that the alliance would fight the elections under Mr. Palaniswami’s leadership. He also avoided pushing for any patch-up with splinter groups of the AIADMK saying such matters were internal affairs. The timing of the alliance announcement overshadowed the transition in the BJP’s State leadership — from K. Annamalai to Nainar Nagenthran — and Mr. Shah ensured that this did not appear as a concession to the AIADMK, which had strongly opposed Mr. Annamalai. But surely, the elevation of Mr. Nagenthran, a former AIADMK member, could smoothen relations. The NDA is likely to include the PMK and TMC (Moopanar); whether the AIADMK rebels, who joined hands with the BJP in the 2024 general election, will still find a place in the new alliance is unclear. The 2026 election is poised to be a two-way contest involving the DMK-led alliance and the NDA; the Naam Tamilar Katchi, with an 8% vote share, and actor Vijay’s newly formed Tamilaga Vettri Kazhagam will likely bring up the rear. With Mr. Shah levelling corruption charges against the DMK, there is also the likelihood of central agencies being more active in the State. Although the alliance is sewn up, the NDA could find it challenging to finalise a seat-sharing formula that is acceptable to the many claimants.\r Published - April 14, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        All India Anna Dravida Munnetra Kazhagam\n                    \n                            /                      \n                        \n                        Assembly Elections\n                    \n                            /                      \n                        \n                        Waqf\n                    \n                            /                      \n                        \n                        Rajya Sabha\n                    \n                            /                      \n                        \n                        National Democratic Alliance\n                    \n                            /                      \n                        \n                        Dravida Munnetra Kazhagam\n                    \n                            /                      \n                        \n                        Delimitation\n                    \n                            /                      \n                        \n                        medical education\n                    \n                            /                      \n                        \n                        entrance examination\n                    \n                            /                      \n                        \n                        Pattali Makkal Katchi\n                    \n                            /                      \n                        \n                        Tamil Maanila Congress\n                    \n                            /                      \n                        \n                        Naam Tamilar Katchi\n                    \n                            /                      \n                        \n                        Tamilaga Vettri Kazhagam\n                    \n                            /                      \n                        \n                        corruption & bribery",
        "headline_1": "​Forced get-together: On the AIADMK-BJP alliance",
        "headline_2": "Political expediency dictated the coming together of AIADMK and BJP",
        "link": "https://www.thehindu.com/opinion/editorial/forced-get-together-on-the-aiadmk-bjp-alliance/article69446398.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "14-04-2025"
    },
    {
        "full_article": "The three deaths in Murshidabad district during protests against the Waqf (Amendment) Act have exposed the deep political fault lines and the festering communal divide in West Bengal. Chief Minister Mamata Banerjee’s repeated assurances that she would protect minority interests, and that the Act would not be implemented in the State, have done little to assuage the Muslim community. The violence, which began on April 8, continues unabated despite prohibitory orders and the suspension of Internet services. Mob attacks on public property have been reported from the Jangipur subdivision of Murshidabad and other parts of the State, including Kolkata. West Bengal has been a simmering communal cauldron for quite some time. Both the ruling Trinamool Congress and the Opposition BJP have sought to exploit communal polarisation for political gain. While the TMC tacitly encouraged Muslim protests against the Waqf amendments, the BJP backed communally charged Ram Navami processions across the State. Although the police have now warned of strict action against lawbreakers, their inaction before and during the current flare-up has been evident. The Calcutta High Court has since intervened, ordering the deployment of central armed police forces in Murshidabad.\rThe State remains on edge ahead of every major religious festival, and policing has grown weak and increasingly politicised. Even though Murshidabad witnessed similar violence in 2019 during the protests against the Citizenship (Amendment) Act, the administration has failed to prevent the current unrest. The violence is unfolding in one of the State’s most impoverished regions, where men migrate for work and women earn a living by rolling beedis. As tensions have escalated over the Ram Navami processions and the Waqf amendment, political parties have chosen to fan the flames rather than promote calm. This is part of a larger and troubling trend seen across the country. The Mamata Banerjee government must act swiftly and impartially to restore normalcy. The rule of law must be firmly established, and the police must prevent violence. With Assembly elections due in a year, the BJP and the TMC appear intent on pandering to communal sentiments for political gain. This must change. The focus must shift to governance and development. As the party in power, the TMC cannot absolve itself of responsibility by merely blaming the BJP.\r Published - April 14, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        West Bengal\n                    \n                            /                      \n                        \n                        Waqf\n                    \n                            /                      \n                        \n                        minority group\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        riots\n                    \n                            /                      \n                        \n                        All India Trinamool Congress\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        police\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        religious festival or holiday\n                    \n                            /                      \n                        \n                        poverty\n                    \n                            /                      \n                        \n                        migration\n                    \n                            /                      \n                        \n                        Assembly Elections",
        "headline_1": "​Communal cauldron: On a communal divide in West Bengal",
        "headline_2": "Political parties are fanning riots in West Bengal ahead of polls",
        "link": "https://www.thehindu.com/opinion/editorial/communal-cauldron-on-a-communal-divide-in-west-bengal/article69446421.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "14-04-2025"
    },
    {
        "full_article": "UPI glitches are best avoided given how critical the system is to millions of Indians \nCan Indians afford “intermittent technical issues” in UPI? In March, according to its website, NPCI’s “unscheduled downtime” was 95 minutes over two “incidents”. On April 2 and 13, the payments system again glitched, declining transfers and leaving users high and dry midway through making payments, throwing transactors into confusion. You can’t always blame “network issues”. \nNPCI’s UPI is peerless, a rare achievement for its design, ease of adoption and smooth transactions. A 2023 study by global payments hub Paysecure found it to be the world’s most popular alternative payment method. At the time, UPI was witnessing over 3,700 transactions per second. Way ahead of other payment systems such as Skrill (100+ countries) at 1,554 transactions, Pix (Brazil) 1,332, and China’s Alipay at 1,157 transactions. Its adoption made migration from traditional methods since its 2016 launch so effortless that UPI now dominates retail digital payments with a 75% share by volume that’s expected to be at 90% next fiscal. As of March 2025, UPI hosted 661 banks with month’s transactions of 18,302mn, and ₹24.8L cr by value. The speed and scale of UPI’s adoption hangs on a single metric: simplicity. But as it rapidly expands, so are the number of UPI frauds – in 2024 UPI fraud cases surged by 85% over 2023, from 7.3L cases to 13.4L. It is why ‘collect payments’, where merchants initiate a transaction for a payee to decline or pay, is likely being phased out. This will decidedly alter facets of the ease-of-use metric. \nHere’s the thing. UPI as critical infra deserves every last penny, priority & punditry required to maintain its simplicity and trusted process to be in step with evolving user needs and expansion, even globally. Along with risks associated with higher limits (also in the works), and removal of pull transactions, UPI’s on the verge of taking on a new avatar. Even one technical glitch is one too many, three in a fortnight looks bad for maintaining trust in this Indian ratna. \n\n",
        "headline_1": "Pays to be perfect",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/pays-to-be-perfect/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-04-2025"
    },
    {
        "full_article": "All cats are grey in the dark, the Scandinavians say\nThe intrepid traveller has journeyed to the edge of the world and braved double-digit sub-zero temperatures, endured the perpetual dreary darkness of winter at the North Pole. He hopes to witness the phenomenon of the Northern Lights, or Aurora Borealis, described by travellers and poets as ‘vast curtain of pale greenish-yellow’, ‘a gigantic flame’, ‘a huge rose’ and so on.\nBut what does he see instead? Translucent streaks of white in the sky. He knows they aren’t clouds because he can see twinkling stars through them. The tour guide tries to mollify him with an old Scandinavian saying – all cats are grey in the dark. But this is no consolation for the traveller. Later, he learns that the year of his visit was in the trough of the 11-year solar cycle: weak solar activity, poor display.\nYet, when he returns home, the selfies he so proudly posts show a resplendent riot of colours. His guide had set his high-end camera to slow shutter speeds, long exposure times, and tweaked a bewildering array of other settings to capture the colours he could not see. For him and the others in his group, it was a monochromatic affair – all snow and white sky. But his social media posts proudly showcase a sky awash in dazzling swathes of colour. His friends send a flood of wow emojis and superlatives about how lucky he is and how envious they are of his once-in-a-lifetime experience.\nDeep inside, the traveller wrestles with a philosophical conundrum. If you don’t see something with the naked eye, can you claim to have seen it? He doesn’t confess to his friends that it was his camera that saw the colours. There’s guilt but also an internal defence – it’s the same as looking at wildlife through binoculars or at bacteria through a microscope.\nNow the traveller says that the Sun is at the peak of its cycle, and advises with confidence that this is a prime time for witnessing the Aurora Borealis. Do not delay, he urges. Book your trip to the North Pole (or as far north as your budget permits). Maybe, unlike the traveller, you will return with colourful memories of a kaleidoscopic sky captured by your own two eyes. The Scandinavian cats will appear in vivid greens, reds, blues and purples. This is your chance to prove the old adage wrong.\n\n",
        "headline_1": "Northern Lights illusion",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/northern-lights-illusion/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-04-2025"
    },
    {
        "full_article": "Trump’s done right by freeing IT hardware from tariffs; slapping sectoral tariffs now would be silly\nGood policy, like a good shirt, requires few or no alterations. But Trump is tailor swift, and his policy-making shoddy. His three China tariff revisions between April 2 and April 9 shook not only stocks but also US bonds. Now, after the mayhem and a big pause, he has signalled his first big retreat before China. Starting April 5 – so retrospectively – some 20 product categories, including smartphones, computers, chips, solar cells and memory cards, brought into US won’t face any tariffs other than the 20% ‘fentanyl duty’ on China. For how long? That’s unclear because commerce secretary Howard Lutnick on Sunday promised sectoral tariffs on semiconductors and electronics “soon”, possibly within a month. \nRegardless, one look at America’s imports shows why Trump had to retreat from the tariff front on Saturday. Last year, smartphones and computers were the two biggest US imports from China, amounting to $88bn of the $525bn import bill. Roughly four of every 10 smartphones, and one in three computers, sold in US were made in China. Unlike toys, lights, plastic goods and chairs – yes $8bn worth of Chinese chairs – phones and computers are complex goods that US can’t do without, nor can it find new suppliers for them overnight. Besides, tariffing phones would have hurt homegrown Apple most. With almost 58% US market share, iPhone, which is 80-90% sourced from China, could have become too expensive for most Americans and lost ground to the likes of Samsung, mostly made in Vietnam and India.\nSo, Trump’s latest decision should cheer Big Tech. Reports say Alphabet, Amazon, Apple and Meta intend to invest around $320bn on AI and data centres this year. Stargate, the $500bn AI project announced by OpenAI, SoftBank and Oracle, will also need new data centres. At a time when China’s breathing down America’s neck in the tech race, choking hardware flow with tariffs, or any other means, is a bad idea. India tried doing that with import licensing in Aug 2023, but had to pull back fast. In fact, any kind of hurdle for hardware and software capabilities – reducing migration, for instance – will be counterproductive for US. On the flip side, India has gained immensely from US immigration curbs. Forget BPOs, the $65bn-a-year GCC boom came about only because US wouldn’t let more Indian engineers in. If Trump wants US to stay ahead, he’ll have to stop raising walls and drop the new sectoral tariff idea before it roils stocks and bonds.\n\n",
        "headline_1": "Escape key?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/escape-key/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-04-2025"
    },
    {
        "full_article": "The current tariff war would warm the cold dead remains of Adam Smith and David Ricardo. The basic assumption that Trump and his team seem bound to is the old notion that factors of production are immobile and geographically rooted. Not true today. Practically everything can be made everywhere because enterprise and science have this incurable wanderlust. They travel globally bringing good ideas to distant lands.\n\nFor this very simple reason what we have on hand is really a thinly veiled brand war and not just a tariff war.\nRead full story on TOI+\n\n",
        "headline_1": "War of brands, not tariffs",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/war-of-brands-not-tariffs/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-04-2025"
    },
    {
        "full_article": "Repressive laws have no place in post-uprising Bangladesh. It's unfortunate that such a thing needs to be reiterated even now—after over eight months since the political changeover—following an abuse of the Special Powers Act that led to a model being incarcerated. Both the manner in which she was picked up and her subsequent 30-day detention under this law have brought, for many, painful memories of similar abuses of draconian laws during the rule of now-deposed Sheikh Hasina. For decades, this law has been a symbol of state repression. That it is still being invoked today, under a non-political government no less, raises troubling questions about whether the state machinery has truly turned a corner, or whether it remains addicted to the same old authoritarian tools of control.\nReportedly, former Miss Earth Bangladesh Meghna Alam was forcibly taken from her home by men identifying themselves as police officers on Wednesday. They produced no warrant, and even violated the High Court guideline for warrantless arrests, which says officers must properly identify themselves, explain the reason for arrest, and allow the person to contact a lawyer or meet their relatives. Moreover, Meghna was held incommunicado for over 24 hours, and later sent to jail under vague and sweeping allegations—mostly based on a personal dispute involving a Saudi diplomat—that fail to meet the threshold of a \"prejudicial act\" as defined by the law, according to Supreme Court lawyer Jyotirmoy Barua. We understand the sensitivity of the issue involved, but that is all the more reason why due process should have been followed from the start.\nOn Sunday, the law adviser, Asif Nazrul, has acknowledged that the arrest procedure was not correct. The authorities have already removed Detective Branch chief Rezaul Karim Mallick from his post. This can be indicative of the government taking accountability measures, or maybe it is just damage control amid fierce criticism by rights activists and social media commentators. Whatever the reason may be, the fact is, such statements and initiatives mean little if they are not followed by concrete actions to repeal the very abusive law in question and bring in systemic reforms to ensure that officers never bypass due process under any circumstances.\nThe incident serves as a wake-up call for the interim government. Citizens did not rise against a dictator last year simply to change the faces in power. Their want a complete overhaul of the way power has been abused, whether by police or powerful political actors. So, all repressive laws like the Special Powers Act must go, and overzealous officers still beholden to abusive tendencies must be duly punished. The authorities also must allow for a fresh, impartial investigation into the whole Meghna Alam saga, ensuring her rights and dignity as an accused.\n",
        "headline_1": "A chilling display of residual authoritarianism",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/chilling-display-residual-authoritarianism-3870531",
        "news_paper_name": "The Daily Star",
        "publish_date": "14-04-2025"
    },
    {
        "full_article": "The Dangers of \"Shared History\"\nAgainst my better judgment, I found myself in a rather heated online debate with Indian Bengalis regarding a video made by a popular Indian influencer on the issue of Jamdani. Ishita Mangal, in her series on regional Indian outfits, highlighted the Jamdani saree as a symbol of pride for West Bengal, noting how the British attempted to destroy or erase it but ultimately failed.\nThere are several things happening in the short clip: a quick photo of a Bangladeshi Jamdani, a reference to Charulata, and then her own Rabindric styling of what she presents as a Jamdani but is, in fact, a Dhakai Jamdani. In trying to explain the mistakes in the video—and that the Jamdani is not an Indian product but a Bangladeshi one—I was bombarded with a barrage of unsubstantiated claims and comments, all under the guise of \"shared history.\" Indian sentimentality had been hurt.\nI usually enjoy Mangal's content, which blends good humour with well-researched fashion and styling insights. And yet, just like a Sanjay Leela Bhansali film about Bengalis that prioritises grandeur over depth, Mangal made a rather khichuri—a debacle—out of Jamdani classification in a 30-second reel.\nMore so, the online comments—often ill-informed yet brimming with confidence—fall squarely within the current trend of Indian insistence on their dominance over all things Bangladesh. What is more interesting is the construction of the \"shared history\" narrative by a certain section of Indians who consider themselves critical of their right-wing government and yet live and function quite comfortably within that regime.\nThe \"shared history\" narrative operates under the guise of liberalism, aiming to diffuse any form of tension and co-opt Bangladeshis into accepting Indian narratives. Yet in the face of any critique—let alone criticism—there is immediate defensiveness and often racialised remarks against Bangladeshis.\nThe lack of critical self-reflection and awareness while positioning oneself as \"liberal\", in my view, is far more dangerous and detrimental than bigots who are open about their hatred. At least with the latter, there is no pretence.\nBut before I delve into the problem with \"shared history\", let me revisit Mangal's video and some basic history of the Jamdani to set the stage.\nIn the video, Mangal is wearing what is known as the Dhakai Jamdani, a West Bengali cotton saree with motifs embroidered on the jomin (body) and anchol (end). These sarees have geometric patterns similar to those of the original Jamdani, but neither the quality of the fabric nor the designs meet the established criteria of what constitutes a true Jamdani (see CPD & NCCB Report 2014).\nThat is what Mangal is wearing—a Dhakai Jamdani—which is a misnomer, because why would a West Bengali saree be called Dhakai Jamdani? A simple internet search shows that after the partition of India and Pakistan, many Hindu Bengali tantis (weavers) were forced to migrate to West Bengal, where they formed their own community. It is important to note that Jamdani was the specialisation of Muslim weavers. The weaving community in West Bengal (mainly Hindus) likely created sarees inspired by Bengal's Jamdani tradition. The term Dhakai, therefore, refers more to the origins of the tantis than to the actual fabric or weaving technique.\nAdditionally, the video features a photo of Madhabi Mukherjee as Tagore's protagonist Charulata, made iconic in Satyajit Ray's film, where she is seen wearing a Bengal Jamdani. During Tagorean times, Jamdani was worn by the elites but was also recognised as a saree from Dhaka, not from Kolkata or its surrounding regions. There's also a quick image of a contemporary Jamdani—one that any Bangladeshi woman might have in her wardrobe. Again, this is not a Dhakai Jamdani but a Bangladeshi Jamdani, wrongly labelled as a West Bengal product.\nOne may argue—what is the harm in a little mix-up? This is precisely where the danger of the \"shared history\" framing comes in. Another quick internet search reveals hundreds of Indian websites extensively discussing \"Bengal Jamdani,\" using photos of sarees that are clearly not Bangladeshi Jamdani—or even related to it. Many of these sites also mention that Jamdani is UNESCO GI-protected, but conveniently omit the fact that this recognition belongs to Bangladesh, not India. It is an act of deliberate misinformation by omission. As a result, Jamdani is increasingly portrayed as an Indian fabric and form of craftsmanship.\nLittle lies have big consequences.\nFrom the Indian side, the \"shared history\" framing appears frequently—be it in seemingly trivial cricket banter, difficult trade and diplomatic negotiations, or even the dangerous reduction of Bangladesh's War of Independence to the so-called \"Indo-Pak War.\" This framing becomes a convenient tool to water down political tensions while subtly encroaching on anything uniquely Bangladeshi.\nIn recent years, India has tried to register the GI status of Tangail craftsmanship—a tradition from a Bangladeshi district nowhere near India. Designers like Gaurang Shah have even blatantly lied (and gotten away with it) in interviews, claiming to have \"invented\" the Jamdani, a weaving tradition that dates back centuries.\nThis \"shared history\" narrative offers an easy way out when Indians are caught in an international lie or fact-checked on social media. It is layered with neo-imperialism that manifests as a constant infantilisation of Bangladeshis.\nEven in global academic circles, while I've been fortunate to work with phenomenal mentors and students of Indian origin, there remains a significant number of Indian academics—both seniors and juniors—who routinely undermine Bangladeshi colleagues. They attempt to \"educate\" us in our own areas of expertise.\nSome have even committed gross academic dishonesty by ignoring well-documented Jamdani history and presenting it as their own research at world-renowned universities. The \"shared history\" narrative has been used to play dirty, while expecting us to roll over and take it.\nBut why this fascination—almost obsession—with the Jamdani?\nThe simple answer is that the Jamdani is magnificent. According to the seminal book Traditional Jamdani Designs (2018) by the National Crafts Council of Bangladesh (NCCB), the Jamdani, as it is crafted in Bangladesh, is the last remnant of Bengal's muslin weaving tradition, which was systematically destroyed during British colonial rule. It is cotton weaving at its finest.\nUnlike other sarees, the motifs are not embroidered or printed, but woven directly on the loom. This craftsmanship is a family affair, passed down orally from generation to generation. In the same book, one of the pioneers of Bangladeshi heritage conservation, the late Ruby Ghuznavi, wrote extensively about the indigeneity of cotton in ancient India, the superior Indian cotton looming techniques that captivated the world through Arab traders, the evolution of muslin, and the perfection that was Bengal/Dhaka muslin during the Mughal era.\nImportant for this piece is her discussion of the factors that made Dhaka muslin superior to any other of its time:\n(a) Phuti karpas—a specific cotton that grew around the Dhaka region due to the mineral-rich silt deposits of the River Meghna,\n(b) the fineness of its handspun yarn, and\n(c) the delicate yet extraordinary skills of the weavers—initially Brahmin women.\nBit by bit, design motifs—jaam (flower), dani (vase)—inspired by Persian designs, appeared on the muslin yards, becoming what is now known as Jamdani.\n\"While muslins were woven mainly by Hindu weavers (tantis), Jamdanis were primarily the forte of Muslim weavers (julaha)\" (Ghuznavi 2018: 25).\nDue to various factors, muslin weavers migrated to other textile centres in what is now West Bengal. Interestingly, Jamdani weavers remained in the greater Dacca region—a reality that holds true to this day.\nJamdani is not just the material or the motifs; it encompasses everything—from the river system and flora-fauna of the Dhaka region, to the pit loom, the weaving technique, the oral directives, the family heritage, and the way of life surrounding this art.\nAlong with the story of master craftsmanship, the Jamdani is also one of quiet resilience and resistance—surviving British atrocities against Bengal/Mughal muslin, colonial and World War-induced famines, the partition of India and Pakistan, and later, Bangladesh's War of Independence.\nThe Jamdani, I will argue, is a material expression of Bengal's decolonisation. Its sheer existence is an act of resistance—with the weaving technique serving as the subaltern's way of speaking to power, telling their stories, and expressing the human necessity to create art, even in the face of great adversity.\nThere was a time when the Jamdani community was dying out. Through extensive resurgence efforts by the Bangladesh Small and Cottage Industries Corporation (BSCIC) in the 1980s and 1990s—supported by designers, craft specialists, academics, development organisations, and patrons—the Jamdani Village was established in Sonargaon, Bangladesh (Ghuznavi 2018: 33).\nOn a personal note, growing up in different countries as a child, I was taught by my mother and the Bangladesh Foreign Service aunties the importance of always having at least one Jamdani and one Nakshi Kantha saree in our wardrobes. It was predominantly a women's collective effort to support local craftsmanship and ensure that the younger generation understood the importance of representing our heritage on the world stage. This is a lesson I continue to practise to this day.\nBut we are a long way from that earlier struggle. Today, the Jamdani industry in Bangladesh is booming—with established handicraft stores such as Aarong, Aranya, Kumudini, and others boasting wide collections, hosting fashion shows and fairs dedicated to Jamdani.\nThere are innumerable saree stores across the country selling affordable Jamdanis, as well as niche boutiques specialising in high-end, one-of-a-kind pieces.\nAnd yet, despite this thriving Jamdani industry, it continues to be subsumed under the Indian \"shared history\" narrative.\nMoreover, under this insidious framing, global art exhibitions and conservation projects continue to showcase Bangladeshi Jamdani as Indian heritage, almost never acknowledging that the Jamdani is thriving in this part of Bengal.\nLast year, I was able to visit The Design Museum of London's SARI/STATEMENT exhibition in Amsterdam twice. And while the exhibition was well-curated, the West Bengal Jamdani on display was perhaps one of the worst I have ever seen.\nNo self-respecting Bangladeshi woman or tanti would ever own or claim such a poorly woven saree—nor insult Jamdani by calling it such. And yet, it was one of the main pieces in the exhibition, claiming to be the continuity of Bengal's muslin legacy.\nOur weak diplomatic efforts, our inability to effectively market Bangladesh and showcase our histories, allow for such blatant misrepresentation to go unchecked. When enough layers of falsity are repeated, even well-documented history can be overturned.\nThere are those working across the two Bengals to curate and restore our shared heritage. But the exhibitions, research, and technical expertise largely remain on the Indian side of the border—with only a select few Bangladeshis having access to such spaces.\nSocial media-driven commerce has created immense opportunities for entrepreneurs across the region.\nThere is no doubt that Indian fashion houses play a significant role in globalising regional craftsmanship. Designers like Sabyasachi, Rahul Mishra, and Anita Dongre have become synonymous with luxury, comparable to global icons like Yves Saint Laurent and Christian Dior.\nIndian fashion houses excel in e-commerce, and Bangladeshi counterparts have started adopting similar strategies. To appeal to the Indian market, Bangladeshi Jamdani sellers either directly sell pieces to Indian boutiques—who then rename them as \"Dhakai Jamdani\"—or, worse, Bangladeshi boutiques themselves have begun calling Jamdanis \"Dhakai Jamdani.\"\nWhile it is both difficult and morally unjustifiable to police individual sellers who are simply trying to keep their businesses afloat, this act of compliance—to make Jamdani more digestible for the Indian market—is a manifestation of Bangladesh's perpetual approval-seeking behaviour from India in all matters: from politics to economics to socio-cultural production.\nWhat's in a name? Jamdani by any other name would not be Jamdani!\n\nSome may argue that perhaps I am too sensitive about what gets called \"Jamdani\"—because, to quote the famous bard, \"What's in a name? That which we call a rose / By any other name would smell as sweet.\"\nAnd yet, there is something specifically known as the \"English Rose,\" which is a trademark in and of itself!\nCorrect naming, recognition, and differentiation of Jamdani matter. It is crucial to ensure that the regal Jamdani is not lost in the misnomer of the \"Dhakai Jamdani.\" Our Jamdani is uniquely a Dhaka story, intricately woven into the region and the city. It is a story of resilience through waves of turmoil, of a community's continuity in the face of change, and of resistance to adversaries—both large and small, foreign and local.\nIt would be a tragedy if, after surviving all these challenges, the name and history of Jamdani became blurred with \"Dhakai Jamdani\" for the sake of social media relevance and Indian comfort.\nPerhaps now is the time to hold ourselves and our national agenda to higher standards.\nA big step towards that would be:\nengaging in critical archival research,\nrestoring historical documents and monuments,\nceasing the demolition of buildings and structures simply because we disagree with their politics, and\ninvesting in arts and craftsmanship.\nAnd perhaps, this is also a good time to reflect on how much of this regressive \"shared history\" discourse we are willing to endure in the name of maintaining neighbourly peace.\nMaybe we can learn from the Jamdani itself—how it survived immense adversity and still carries its resplendence.\nMany of the motifs have changed over time, and yet the cotton yarn, weaving techniques, tutelage, and pit loom have remained enduring markers.\nMy personal favourite part of the Jamdani's history is that all the original materials are indigenously Dhaka: the cotton that grew in the region, the mineral-rich silt deposited by the Meghna and Shitalakhya rivers, and the boal fish bone that was initially used for weaving.\nThe topography of Dacca/Dhaka is woven into the Jamdani—nodi, mati, maach.\nTo lose Jamdani is to lose ourselves.\nShahana Siddiqui is an anthropologist and currently a guest researcher at the Universiteit van Amsterdam. She is a saree—especially Jamdani—enthusiast.\n(Special thanks to Maheen Khan, Sheikh Saifur Rahman, and Sharmin Rahman for expert insights. Thank you, Seama Mowri and Muntasir Mamun, for your valuable comments.)\n",
        "headline_1": "Jamdani as the battleground",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/focus/news/jamdani-the-battleground-3870796",
        "news_paper_name": "The Daily Star",
        "publish_date": "14-04-2025"
    },
    {
        "full_article": "The recently concluded Bangladesh Investment Summit 2025, held from April 7 to 10 at the InterContinental Dhaka, sent a strong message: Bangladesh is ready to do business. It was more than just a four-day event—it was a strategic reset for a country navigating new economic realities.\nLed by Chowdhury Ashik Mahmud Bin Harun, the newly appointed executive chairman of the Bangladesh Investment Development Authority (BIDA), the summit signalled a new era for Bangladesh's investment outlook—ambitious, reform-minded, and increasingly global. But while the show of confidence and reformist rhetoric was impressive, real-world challenges remain. To understand the full picture, we need to explore both the progress and the persistent obstacles.\nThere is no denying the scale and ambition of this year's summit. With over 2,300 participants from 50 countries and more than 550 foreign investors in attendance, Bangladesh drew global attention. Delegations from major economies—including China, the US, UK, Japan, Singapore, and India—highlighted growing international interest in the country's economic potential.\nOne of the more symbolic moments was the live demo of Starlink's satellite internet service, a gesture aimed at signalling that Bangladesh is finally embracing cutting-edge digital infrastructure. It was a small but telling sign that the country is ready to address long-standing bottlenecks like unreliable internet and poor connectivity, which have deterred tech and service-sector investors in the past.\nIn addition, the summit featured targeted sessions on high-potential sectors: renewable energy, textiles, digital economy, agro-processing, and healthcare. This move toward sectoral diversification was refreshing and necessary. It shows that Bangladesh is moving beyond its traditional reliance on RMG and seeking new engines of growth.\nChowdhury Ashik Mahmud Bin Harun brought a different tone to this year's summit. With a background in international finance and strategic planning, his leadership focused on transparency, policy stability, and inclusivity. His decision to engage not just investors but also political stakeholders from various camps was a notable step toward rebuilding trust in Bangladesh's governance ecosystem.\nUnder his watch, BIDA has signalled that the government is serious about reform. But he has also inherited a system plagued by bureaucratic inefficiencies, outdated regulatory frameworks, and a history of unkept promises. If he can push through real structural changes—not just event-driven fanfare—he could emerge as a transformative figure.\nCompared to earlier editions, the 2025 summit marked a clear upgrade—not only in optics but in purpose. Previous summits often felt like grand networking events without a follow-up plan. This one felt more grounded. There was a genuine attempt to confront the past—admitting Bangladesh's lag in ease of doing business and addressing key investor concerns, from tax complexity to logistical bottlenecks.\nBut we must ask: will these positive signals translate into action?\nWhile such summits often leave a strong first impression, the on-the-ground reality remains difficult for investors. Foreign investors frequently withdraw or delay their commitments due to bureaucratic complexities, inconsistent regulations, political instability, corruption, law and order concerns, unreliable energy supply, inadequate transportation networks, and significant infrastructure gaps.\nIf Bangladesh is serious about being an FDI hotspot, then the real work begins now. Hosting a summit is the easy part. Reforming entrenched systems? That is where the real challenge lies.\nForeign and domestic investment is not just about GDP figures—it is about job creation, innovation, and long-term growth. With two-thirds of Bangladesh's population in the working-age bracket and about two million people entering the labour force each year, the pressure on the government is immense. Traditional job markets are no longer enough.\nThis is where foreign direct investment (FDI) can play a transformative role—especially in sectors like power, manufacturing, infrastructure, and tech. But FDI will not come in the volume we need unless we fix the core bottlenecks. The country currently ranks poorly on both the World Bank's Ease of Doing Business Index and the World Economic Forum's Global Competitiveness Index. These metrics matter. Investors use them to judge whether Bangladesh is worth the risk.\nAnd while the government has taken some steps—like the establishment of economic zones and single-window services—most reforms are still on paper or in pilot stages. We need bold implementation, not just bold ideas.\nBangladesh's long-term investment success also depends on political continuity and stability. As we edge closer to the next national election, there is a risk that reform momentum could stall. Dr Muhammad Yunus recently emphasised that the current administration should lay the groundwork for the next elected government to carry forward these positive trends.\nThis is essential. Investment confidence is built on predictability. Frequent policy shifts, political upheaval, and inconsistent governance can undo years of progress in a matter of months.\nThe Bangladesh Investment Summit 2025 was a clear signal that the country wants to compete on the global stage. It showcased ambition, reformist zeal, and a willingness to confront past shortcomings.\nBut we have seen summits before. We have seen commitments before. The question is: can we finally deliver on the promises made?\nChowdhury Ashik Mahmud Bin Harun has made an impressive start. The participation of global investors, the focus on digital infrastructure, and the narrative around inclusive economic growth were all steps in the right direction. But unless backed by serious reform implementation and long-term political commitment, the momentum could fade—just like it did before.\nMd Kawsar Uddin is associate professor of Department of English and Modern Languages, International University of Business Agriculture and Technology (IUBAT).\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Let’s sustain the momentum of the summit",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/lets-sustain-the-momentum-the-summit-3870381",
        "news_paper_name": "The Daily Star",
        "publish_date": "14-04-2025"
    },
    {
        "full_article": "We are troubled by India's decision to revoke the transshipment facility for Bangladesh's export cargo to third countries transiting through its land borders to Indian airports and ports. This will disrupt Bangladesh's RMG exports and raise costs for our apparel exporters delivering orders to Western markets—especially those routed through Indian airports, such as the one in New Delhi. Thus, the decision comes as a major surprise, particularly given the recent constructive meeting between Bangladesh interim government's Chief Adviser Muhammad Yunus and Indian Prime Minister Narendra Modi. It was expected that the discussions would lead to further steps to strengthen bilateral relations. Instead, Bangladesh was caught off guard with this sudden move.\n\nOn April 8, India's Central Board of Indirect Taxes and Customs issued a notification stating that the directive issued on June 29, 2020—granting transshipment facilities to Bangladesh—had been withdrawn. (Later, the Indian Ministry of External Affairs clarified that the decision would not affect trade between Dhaka and Nepal or Bhutan via Indian territory, as these landlocked countries are protected under WTO guidelines.) India justified this decision by citing significant congestion at its airports and ports, which it claims has been exacerbated by the transshipment facility granted to Bangladesh. The secretary general of India's Apparel Export Promotion Council also mentioned that the move responded to a \"long-standing demand\" from Indian exporters to halt the transshipment of Bangladeshi cargo through Indian ports. The decision, he noted, would help rationalise freight rates, reduce congestion, and lower transportation costs for Indian exporters.\n\nIndia justified this decision by citing significant congestion at its airports and ports, which it claims has been exacerbated by the transshipment facility granted to Bangladesh. The secretary general of India's Apparel Export Promotion Council also mentioned that the move responded to a \"long-standing demand\" from Indian exporters to halt the transshipment of Bangladeshi cargo through Indian ports. The decision, he noted, would help rationalise freight rates, reduce congestion, and lower transportation costs for Indian exporters.\nNevertheless, this move seems to be driven more by political messaging than by economic considerations. For one, the transshipment facility was a commercial arrangement, with Bangladesh paying India for the service. Typically, when either party seeks to end such an arrangement, a transition period is granted to allow the other side to make alternative arrangements—this was not the case here.\n\nThe transshipment facility appeared to be a mutually beneficial arrangement. Its sudden discontinuation will undoubtedly harm Bangladeshi businesses. In light of this, we request India to provide a provisional period, allowing time for Bangladesh to make alternative arrangements before the facility is completely withdrawn. Alternatively, India could consider renegotiating the terms of the agreement to mitigate the negative impact on Bangladesh. At the same time, we urge the Bangladeshi authorities to explore available alternatives and take immediate steps to ensure that the efficiency of our supply chains is not compromised, and that our trade is not disrupted.\n",
        "headline_1": "A setback for Bangladeshi exporters",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/setback-bangladeshi-exporters-3868811",
        "news_paper_name": "The Daily Star",
        "publish_date": "14-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 14, 2025 00:00:00  \nToday's crimson glow of the eastern sky is special as it marks the dawning of the Bangla New Year 1432. Ingrained in the Bangalee ethos, the Pahela Boishakh is a highly cherished occasion. It is festival time as well as a time for starting afresh after the solemn observance of Chaitra Sangkranti - the day of bidding farewell of the year that was. The nation stands ready to welcome the New Year with renewed spirit. In the capital, the Chhayanaut's early morning musical programme at Ramna Batamul has become synonymous with the Pahela Boishakh celebration. Colourful processions from the Faculty of Fine Arts, University of Dhaka lends the celebration a visual diversity with its roots embedded in the country's traditional folk art and culture with a tinge of political satire. \n Traditionally, though, Baisakhi fairs, poetry recitation and musical soirees made the day special. This year the festivities are set to become even more inclusive and vibrant. To its credit, the government has instructed all educational institutions, including madrashas, to organise programmes marking both Chaitra Sangkranti and Pahela Boishakh. Additionally, elaborate arrangements have been made to celebrate the day at the national level with the inclusion of ethnic communities such as the Chakma, Marma, Tripura, and Garo. These initiatives will showcase the rich cultural diversity of the nation.\nThe customary celebration of Pahela Boishakh dates back to the reign of the great Mughal Emperor Akbar. All the subjects of the emperor were required to pay their taxes by the final day of 'Choitra,' the last month on Bangla calendar. So that fresh calculation could start from the 1st day of the New Year. So, the festival is rooted in the agricultural life of the Bangalees. The common people in villages still reckon dates, months and seasons by the Bengali calendar, which is farmer-friendly and aptly reflects the agricultural cycle. \nWith traders, wholesalers, and jewellers showing greater enthusiasm about observing Haalkhata, the occasion of settling old accounts and opening new ledgers, the Pahela Boishakh marked a new commerce and economic cycle. The fairs arranged on the occasion of Pahela Boishakh turned into a community bonhomie apart from serving as an opportunity for procuring their household tools and other instruments. With improved communication, villages no longer have to wait for the annual fairs for procurement of such tools and instruments. Thus the Boishakhi fairs have lost their appeal to the villagers. Yet Boishakhi economy gets a boost because of certain must-do rituals including purchase of new dress and sweetmeat. The day's traditional fervour can further be enhanced by arranging musical soirees and recitation programmes as part of the celebration in every village. Thus it can help create a bond between and among people of the local community. \nThat said, the country has passed a landmark year in 1431 and is poised to build a reformed, new Bangladesh. But detractors misinterpret the aesthetic beauty and value of musical programmes and colourful processions. Malevolent oppositions cast an ominous shadow on this secular observance. Yet, the nation must remain hopeful that the good is sure to triumph over the evil. In the words of Rabindranath Tagore, it is hoped that \"Boishakh, with its ascetic breath, will dust away that which is dying; the refuse and remnants of the bygone year would be gone, all weariness and infirmity would be wiped away, and the earth would gain purity bathed in fire.\"\n Shuvo Naboborsho to all!\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Welcome Naboborsho",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/welcome-naboborsho-1744556932",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       April 14, 2025 00:00:00  \nIf economic growth and creation of jobs for close to the projected 4.0 million unemployed people in Bangladesh in 2025 are to be the primary concern for the policymakers, then the recently held investors' summit in Dhaka bears special significance. That is not to say that the presence of between 400 and 450 prospective overseas investors at the investment summit organised by the Bangladesh Investment Development Authority (BIDA) would automatically translate into an investment bonanza in the country. Many such investment summits took place in the past, but few overseas business houses finally came forward to risk their money in business ventures here. In fact, holding of investment summits has become a kind of ritual where representatives of foreign companies participate and the events end with big hopes from the government leaders but nothing happens next. Was the just ended business summit like one of such events in the past? Though it is too early to draw any conclusion, there are certain features of the recently-held investment summit that make a difference from the past. It is that the summit took place after a bloody uprising followed by a political change in the country. \nMore importantly, the post-uprising government is being headed by Dr Muhammad Yunus, who, apart from being a Nobel Peace laureate, is well-known globally for his novel ideas of social change including micro-credit and social business. Obviously, he was a pull factor drawing many of the global business leaders to the event. They definitely wanted to see if under his leadership there is any prospect of positive change in the notoriously complicated and corrupt bureaucracy that is the number one hurdle before any foreign business willing to invest in Bangladesh. But bureaucrats cannot also be singled out as the sole agency of corruption, since the politicians who controlled state power were not angels either. To be fair, the responsibility for the original sin lies with the politicians, for it is they who first lure the government officials into committing corruption. However, once the rot sets in over the years, it becomes hard to say who first led the other up the garden path. But that is again the old, proverbial chicken and egg situation. But if one is to go into the political history of the country during the last one and a half decades, it was an era of violent and frenzied plundering of a nation by its politicians who spared none in their sights to become complicit in their crime, let alone the servants of the state. So, well-meaning foreign investors who had been watching the rampant looting of a nation by its own political class from a distance all these years, were obviously more eager to see how the interim government that assumed power following the changeover was faring in bringing the country back from the brink. \n Evidently, the foreign investors were keen to see that some meaningful change was indeed taking place in the system of governance in the country. Definitely, the ongoing reforms in the different sectors of the economy and governance drew their attention. Though some four busy days that they had in hand was hardly enough to reach any conclusion, they could at least get the hang of it. The interim government with its limited mandate, is facing an enormous challenge to get the system back on track, so the country's international development partners as well as the investors both domestic and foreign can first regain their confidence in the system and then take decision about making any investment in the economy. In this connection, one should not be surprised to see that few business houses of global as well as regional repute did instantly commit any major investment. In fact, they would like to see a stable political government in office that is committed to all the reform initiatives undertaken by the incumbent interim government. In that case, one would like to believe that the way the reform measures and other positive initiatives undertaken by the interim government have gained traction in public perception, it would be hard for any future elected government to reverse the trend. Nevertheless, there should be no room for complacency either. \nSince the incumbent interim government did not take office out of the existing political party's generosity, there is no reason why it should dither from taking any hard decision about reforms. Even, the political parties would admit in private that they are often so beholden to the narrow interests of their electorates, let alone the vested quarters, that they cannot take hard decisions, even if they wished so. So, those in charge of the incumbent interim government need to understand the felt-need of the masses including politicians, despite what the latter might from time to time say in public, go ahead with the agenda of reform and other changes of radical nature where necessary without hesitation. Since they are not here for eternity, it is important that they have a list of priority so the urgent tasks are performed first. Those obviously include bringing stability in the macroeconomy which means keeping inflation under control, ensuring economic growth by way of employment generation both through public sector spending as well as creating the enabling conditions for the private sector to invest. To this end, facilities like easy credit for the domestic entrepreneurs and ensuring the businesses' access to the state's services with least bureaucracy are the preconditions. In a similar vein, efforts should be on to gradually make the economic activities in the informal sector visible through helping those gain access to the state's resources while at the same time widening the scope of the revenue authority to include them under its net. These measures are a precondition for constant and sustainable economic growth. The fact that inflation, a constant source of headache for both the policymakers and the public, was in the single digit at 9.32 per cent (point-to-point) in February last marking a significant decline in one month from what it was in January last at 9.94 per cent. Arguably it provides a cause for optimism as well as caution. It is believed, when the policymakers and the government officials stop abusing their power to serve theirs or someone else's personal end, things begin to change for the better. The interim government should continue the good work.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Investors want to see  positive change",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/investors-want-to-see-positive-change-1744557178",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       April 14, 2025 00:00:00  \nThe showdown between two groups of the same political party at Milonghat ferry point of the river Bangshi in Savar exposes the prevalence of the degenerative politics for which the country has paid through its nose. Ever since the ouster of the government that established the monopoly of partisan politics even at the grassroots level by backing its notorious elements, the vacuum created by their departure did not take long to be filled by the counterparts of the now dominant political party. The confrontation at the Bangshi's ferry ghat (point) is not the only such incident of internecine feud within that party. Here the lessee of the ferry point found in an extortionist of his own party an aggressive rival with no qualms about defying the directives of the party high command. \nReportedly, the rival demanded an extortion money of Tk500,000 from the lessee which the latter refused to pay. Without getting the money he demanded, the extortionist was creating obstruction to operation of the ferry service for some days. On Wednesday last, armed with locally made lethal weapons alongside pistols he led his gang to the spot and assaulted the lessee who happens to be the general secretary of the Jubodal of ward number 6 under the Savar municipality. Still the lessee did not yield to the illegal demand. This prompted the extortionist and his gang members to get on board the two trawlers used for ferrying people and assaulted the boatmen before taking away the vessels. \nIt is at one point of the showdown, local people came to the scene and the invading group leader pulled out the firearm to fire shots. No pushover, the Jubodal leader also threw challenge, \"Come and shoot, if you dare\". Most likely the local people's arrival on the scene made the invader flee but not without his booty---two boats used for ferrying people. Otherwise, it could escalate into a bloody confrontation. Mercifully, this did not happen here.\nBut not all internecine clashes end without claiming lives. It is most worrying that hardly a day passes without report on bloody clashes between rival groups of the party with the best prospect of capturing power in the next general election. It is clear that much as the top leaders may have urged the party followers to avoid the thuggery and monopolised extortion that made the immediate past ruling party unpopular and detestable, the tendency in wide areas of the country paints an undesirable picture. Many such elements have started behaving as if their party is already in power! Worse still is the fact that even ouster of a number of such wayward followers from the party has failed to arrest recurrence of similar incidents or acted as a deterrent. Failure to rein in those elements gives rise to a kind of parallel economy for social parasites to feed on and thrive.\nIts implication is likely to be negative for the party. Rival political parties will seize the opportunity to discredit it. Voters will not be pleased with the party that cannot control its devious followers. Apart from this concern for the party, such developments go against the spirit and principle of the July-August uprising. It is not for nothing that the architects of the movement often reiterated that the mass movement was not waged only to install another oppressive ruler in place of the ousted fascist. This sentiment has gained strength by this time and the people hope for a systemic change not just a change of government. It is because of this, so many reform commissions have been constituted to bring about the desired changes in the system of governance. \nPolitical parties are expected to reform themselves in order to fall in step with the reform initiatives. Old wine in a new bottle won't do. The people have long suffered at the hands of unclean and oppressive politics. They deserve better and those willing to woo voters must prove their sincerity, dedication and intellectual integrity---qualities that are in demand for a fresh journey on course of building a new Bangladesh based on democracy, social justice and equal opportunity for all.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Old wine in a new bottle won't do",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/old-wine-in-a-new-bottle-wont-do-1744557572",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 14, 2025 00:00:00  \nPahela Boishakh is more than just a date on the calendar-it's a day that truly reflects who we are as a people. When the first sunrise of the Bengali year shines over the fields, it feels like a fresh beginning, reminding us that even after going through many dark chapters in history, we are still here-celebrating with light, colour, and joy.\nIn 2025, the Faculty of Fine Arts at the University of Dhaka renamed its traditional \"Mangal Shobhajatra\" to \"Ananda Shovajatra\"-a move said to make the event more inclusive for all communities. While this signals a cultural shift, it also raises an important question: in the name of inclusivity, are we drifting away from our roots?\nMangal Shobhajatra was never a religious ritual. It was a creative protest against authoritarian rule, born in the 1990s. To protest repression, students of Fine Arts marched with colour, imagination, and creation-as an expression of defiance. So this was not just a festive parade, but a symbolic statement of Bengali dignity and resistance.\nThe Bengali calendar itself dates back to 1556, during Emperor Akbar's reign. It was designed to simplify tax collection by blending the lunar and solar calendars. Over time, this fiscal event evolved into a social celebration, and eventually into a cultural festival embraced by all.\nYet, whatever the name, Pahela Boishakh remains true to its soul-it is the festival of the Bangalee heart. From tax records to royal courts, from feudal estates to folk traditions, the festival has withstood many changes while preserving its essence. Whether in villages or cities, among the rich or poor, its colours reach everyone.\nStill, the question lingers: what will this year's celebration look like? A change in name-will it change the spirit too? As we walk this path of cultural evolution, we must remember: the beauty of a festival lies both in its freshness and in its loyalty to the roots. Let the joy be universal, let it reach every home-but let the seeds of history remain grounded.\nBecause Boishakh isn't just a new year-it's a reminder of those who came before us, of where we began, and a chance to ask again-who are we, where do we come from, and where are we going?\nFiad Nowshad Yeamin\nStudent \nDepartment of Media Communication and Journalism,\nCanadian University of Bangladesh\nnowshadyeamin415@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "An occasion to celebrate our roots",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/an-occasion-to-celebrate-our-roots-1744557600",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-04-2025"
    }
]