[
    {
        "full_article": "Prime Minister Narendra Modi’s address to the nation on Monday night (May 12, 2025) and his visit to the Adampur base of the Indian Air Force in Punjab on the frontlines with Pakistan on Tuesday were reassuring for the nation that has been in the midst of a volatile conflict. Mr. Modi reiterated India’s revised strategy of responding to terrorism with clarity and resolve. For one, India is no longer willing to concede the fig leaf of an explanation often offered by Pakistan that terrorists were non-state actors acting independently of the state. Operation Sindoor is ongoing, but it is also a continuation of this new strategic approach which earlier manifested, less successfully, in the surgical strikes of 2016 and Balakot airstrikes of 2019. India is willing to engage with Pakistan diplomatically, but only on the central and relevant question of terrorism emanating from that country and the status of Pakistan-occupied Kashmir. Mr. Modi also made it clear that India would stay the course on the decision to suspend the Indus Waters Treaty. Though Mr. Modi did not directly join issue with U.S. President Donald Trump on his claim that his administration brokered the understanding between New Delhi and Islamabad, he was categorical in his assertion that India would be guided entirely by its national interest in deciding its future course of action. Further moves by India will depend on how Pakistan responds to the changed approach of India and the new realities.Mr. Modi’s visit to Adampur, 100 km from the border and also a site of India’s Russian-made S-400 air defence system, disproved Pakistan’s claim that the base was hit during the recent military face off. That said, there is a need to insulate strategy from populist sloganeering and prime-time TRP wars. India’s stakes are high, and they must not be held hostage by the designs of Pakistan’s terrorists, which are of course unacceptable. Quiet diplomacy and covert operations may not be suitable for TRP media wars but can be extremely useful in the pursuit of the country’s strategic interests. While India should not be unsettled by Pakistan’s nuclear sabre-rattling, it is also time India took the lead with other partner countries to start a new global conversation on the risks of nuclear weapons. The dangers of a nuclear conflict are far too serious to be ignored, and discussions within India and the world should be cognisant of that. While India’s position against third-party interference in India-Pakistan relations is a historically established position, it must also build global opinion against Pakistan’s strategy of terrorism and nuclear blackmail. Published - May 14, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        armed Forces\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        Balakot Air Strikes\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        Indus Waters Treaty\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        defence equipment\n                    \n                            /                      \n                        \n                        media\n                    \n                            /                      \n                        \n                        nuclear weapons\n                    \n                            /                      \n                        \n                        Punjab",
        "headline_1": "Prime message: On India’s strong line and Pakistan",
        "headline_2": "India must mobilise global opinion against Pakistan’s nuclear threats",
        "link": "https://www.thehindu.com/opinion/editorial/prime-message-on-indias-strong-line-and-pakistan/article69572327.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "14-05-2025"
    },
    {
        "full_article": "The trade agreement between the U.S. and China, the two biggest economies in the world, serves as a breather in an otherwise tense global trade environment. The U.S. has agreed to temporarily lower, for 90 days, its overall tariffs on Chinese goods from 145% to 30%, while China will cut its tariffs on American imports from 125% to 10%. Markets across the world cheered the announcement, jumping between 2%-3.8% following the news. The thaw comes on the back of tensions and tariffs being ratcheted up by both sides, starting with U.S. President Donald Trump’s February 1 announcement of a varying tariff on imports from China, Mexico and Canada. Notably, he excluded China from the 90-day pause on ‘reciprocal’ tariffs announced in early April. One way to look at this latest development is that it shows Mr. Trump is backing down from his tariff war-footing, acknowledging the importance of China to the U.S. economy. Indeed, the joint statement by both countries begins by mentioning “the importance of their bilateral economic and trade relationship”. However, another view is that his heavy-handed approach has succeeded in convincing China to come to the negotiation table. Tariffs of 145% were unsustainable but served their purpose. The fact also is that Mr. Trump’s main grievance, of a ballooning trade deficit with China, remains unaddressed. The two sides have agreed to continue talks, which will be key in determining whether this seemingly intractable problem can be worked around or result in tensions again.For India, this brings both uncertainties and certainties. If further talks between the U.S. and China are successful, investors who have moved to other countries will likely start viewing China favourably again. The advantages of manufacturing there — scale and costs — are still significant. The China+1 model, which India in any case has not been able to leverage adequately, might start to lose its sheen. The other uncertainty is around India’s own trade talks with the U.S. It has now informed the World Trade Organisation of potential reciprocal measures to the U.S.’s increased duties on steel and aluminium imports. Even though talks on a U.S.-India trade deal are ongoing, this latest statement shows that tensions remain high. The certainties are two-fold. The first is that India’s trade deficit with China remains vast and rising, and the U.S.-China agreement will not reduce this. ‘Make in India’ is currently inextricably linked to ‘Import from China’. The second certainty carries over from the first. The Centre must lean heavily on States to adopt labour and land reforms that can allow scalable manufacturing to become cost-effective here. Without this, India will remain dependent on Chinese imports, regardless of its dealings with the rest of the world. Published - May 14, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        trade policy\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Mexico\n                    \n                            /                      \n                        \n                        Canada\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        manufacturing and engineering\n                    \n                            /                      \n                        \n                        iron and steel\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        land resources",
        "headline_1": "​Big deal: On the U.S.-China trade deal",
        "headline_2": "The U.S.-China trade deal will have implications for India",
        "link": "https://www.thehindu.com/opinion/editorial/big-deal-on-the-us-china-trade-deal/article69571942.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "14-05-2025"
    },
    {
        "full_article": "Oil sheikhs are trying to reform their societies & economies. But top-down approaches have their limitations \nTrump began his tour of Gulf countries yesterday. As a man obsessed with his brand, he may notice his hosts are in the middle of a major rebranding. Oil-rich Gulf Arab states are trying to rewire their society and economy, knowing that a post-oil future awaits them. This means putting locals to work, trying to foster innovation, and changing the social contract between people and govt. Some good things have happened. In Saudi Arabia, Mohammed bin Salman’s reforms have led to new freedoms for Saudi women, created a Saudi entertainment industry, and even attempted to redefine the role of religion in everyday life. \nBut there are also challenges. First, the impetus for this change was the Arab Spring wave of the previous decade and the threat posed by Islamic State terror group. Both represented a direct challenge to the authority of oil sheikhs and brought home the danger of funding and supporting radical Wahhabi groups across the region. Gulf states are now cracking down on such extremist networks and promoting theological moderation. So, the question is – are the reforms driven by a genuine commitment to openness or are they meant to protect the monarchies?\nSecond, a top-down approach to innovation has limitations. It’s all very well to create a futuristic city like Saudis’ Neom. But fostering local innovation requires serious investments in institutions, which again grates against the authority of monarchies. Third, the grand reorientation has opened space for foreign policy realignments. This is best exemplified by the Abraham Accords that normalise relations with Israel. But the latter’s war in Gaza has also exposed divisions between oil sheikhs and the Arab street over the Palestine issue. Fourth, India-Gulf relations are experiencing positive momentum. But this may have triggered Türkiye, a rival to Saudi Arabia, to enhance ties with Pakistan and play the role of keeper of the faith. Finally, Gulf monarchies still have loads of petro-dollars, which can be used to strategically delay change. Gulf investments in renewables being a case in point. Oil sheikhs are trying. But success is not guaranteed.\n\n",
        "headline_1": "Gulf Spring? Not Yet",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/gulf-spring-not-yet/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-05-2025"
    },
    {
        "full_article": "Memo to top bosses: the two are very different. Don’t claim credit. Get the job done\nEvery successful corporation, mission, or nation, is a whodunnit. Who made it a success? The simple, obvious answer – many people working together, making small contributions to the whole – has no takers because most people tend to be heroes at heart. Democratising success pulls us off our imaginary equestrian statues. That’s why credit for collective success is always pinned on an individual – on Steve Jobs at Apple, on Lee Kuan Yew in Singapore, on Newton, despite his full disclosure about seeing further by “standing on the shoulders of giants”. \nBut this approach is too passive for Trump, who appropriates credit actively. Specimen A: his Truth Social claim about brokering the India-Pak ceasefire. Specimen B: his brag about countries “kissing my ass” over tariffs. He’s positively glowing after the UK and China trade deals and might photobomb the Putin-Zelenskyy meet in Istanbul, if it happens. Trump’s behaviour is an example of what Seattle-based blogger Venkatesh Rao termed ‘leadering’ some years ago – “the art of creating a self-serving account of whatever is already happening, and inserting yourself into it in a prominent role”.\nIt’s Rao’s view that even leadership – the good kind – is overrated because a leader’s five minutes of insight, on which a lifetime of fame is founded, is almost entirely a function of chance. Was Napoleon’s defeat at Waterloo proof of English genius, or a result of a giant volcanic eruption in Indonesia two months earlier that made Europe too rainy and muddy, as scientists have recently suggested?\nGood leaders give credit where it’s due, and focus on getting the job done. Consider yourself lucky if your organisation has one at the summit. But if you’re saddled with the leadering kind, good luck, for they are clueless. In times of rapid change – which the third decade of the 21st century is, what with a pandemic, AI, EVs and sundry wars changing the old order – leadering types can run your ship aground. Luckily, Trump, for all his leadering, isn’t a warmonger. The real danger lies in a leader who seeks war – whether in the market or on the border – for personal glory. That type eventually finds the slippery slope of a Waterloo.\n\n",
        "headline_1": "Leading  vs Leadering",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/leading-vs-leadering/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-05-2025"
    },
    {
        "full_article": "A cautionary tale about a destructive destitute and his mystifyingly generous benefactor \nOnce upon a present time there was a streetside beggar, but though penniless, he was quite content with his lot because he had a rich banker who would give him whatever he asked for. \nSuch donations were supposed to be loans, but both beggar and banker knew that there was no way that they could ever be repaid. The beggar couldn’t even afford to keep up with the interest payments he was meant to make on the so-called loans. \nWhat did the beggar do with all the money he got from the banker? Did he spend it on feeding his family, sending his children to school, building a home of his own? \nNo. He spent all the money he got from the banker on buying expensive bricks, stamped ‘Made in China’, which he would give to ragamuffins to hurl at the home his neighbour had built for himself. \nThe neighbour had once been a pavement dweller like the beggar. But by dint of discipline and hard work had earned and saved enough to put a roof over his head, feed many if not all of his family, and send most if not all of his children to school. \nWhen the neighbour complained about the bricks damaging his home, the beggar would deny all knowledge of ragamuffins, of bricks bought with the banker’s money, and all the rest of it, and start hurling the bricks himself, until told to stop by a Godfather called Globocop. \nBut everyone knew the beggar would be up to his old tricks again, as he had done time after time. \nWhy did the beggar spend all the banker’s money on bricks to throw at his neighbour? Some said it was because of something called K, which was an unmentionable word. Others said it was out of envy of his neighbour’s success compared with the beggar’s own failure. It was a big puzzle to everyone, even perhaps to the beggar himself.\nBut an even bigger puzzle was why the banker kept giving the beggar money. What was that Incredibly Mystifying Funda, otherwise called IMF? \n\n",
        "headline_1": "Beggar’s banker",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/beggars-banker/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-05-2025"
    },
    {
        "full_article": "In what must rate as one of the most powerful speeches of his career, PM, in his address to the nation last night, effectively announced a new, emphatic Modi doctrine: no compromise with terrorism, no giving in to Pakistan’s nuclear blackmail, and no distinction to be made between terrorists and their backers in future kinetic actions.\nNew red lines have been drawn, where past strategic restraint is going to morph into strategic action against those who will target India and its people.\n\nRead here full opinion on TOI+\n\n",
        "headline_1": "The Modi mantra",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-modi-mantra/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-05-2025"
    },
    {
        "full_article": "We are alarmed by the findings of an investigation conducted by the Civil Aviation Authority of Bangladesh's (CAAB) internal safety department, which uncovered numerous irregularities in pilot licensing and training programmes. Reportedly, there have been serious violations related to pilot licences issued by CAAB, many within the past two years. Two training institutions—Galaxy Flying Academy and Bangladesh Flying Academy—recommended pilot licences without candidates completing the mandatory solo flight hours. Other violations included a pilot certifying himself, one falsifying flight hours to meet licensing requirements, and the appointment of an unqualified check pilot by a training academy. A recent inspection by the Anti-Corruption Commission (ACC) also discovered that written tests for pilots had been conducted using unauthorised software. These findings raise concerns about our aviation safety, which must be addressed.\nThere are three types of pilot licences: Private Pilot Licence (PPL) for basic certification; Commercial Pilot Licence (CPL) for professional flying; and Airline Transport Pilot Licence (ATPL) for commanding commercial airliners, which is the highest certification and requires extensive training and flight experience. Worryingly, it has been found that the two above-mentioned training institutions recommended pilot licences for their students despite their failure to meet the mandatory flight requirements. Students reportedly skipped required stops on solo flights and did not follow the prescribed routes, raising concerns about whether their flying skills were properly tested. Both academies cited logistical challenges—such as engineer shortages and restricted access to certain airports—to justify these deviations. While experts argue that these issues could have been resolved with better resource allocation, such as placing engineers at transit airports or providing fuel at key locations, the problems remain unresolved.\n\nUnfortunately, CAAB has been aware of many of these issues for a long time but has taken no action. The CAAB chairman has even downplayed concerns over training rule violations, stating that they do not pose a safety risk. Such a statement by the CAAB chief is unacceptable, particularly when their own investigation team found clear violations. We urge the regulatory body to take the investigation findings seriously, and undertake strict measures against those involved in the anomalies reported.\nIrregularities were also found in pilot recruitment tests, with a company named A4Aero Ltd conducting exams since 2017 using software it fully controls. CAAB also failed to follow procurement rules, and the software was never tested for quality—despite CAAB being classified as Critical Information Infrastructure. Additionally, A4Aero was not officially registered when it began administering exams.\nUnfortunately, CAAB has been aware of many of these issues for a long time but has taken no action. The CAAB chairman has even downplayed concerns over training rule violations, stating that they do not pose a safety risk. Such a statement by the CAAB chief is unacceptable, particularly when their own investigation team found clear violations. We urge the regulatory body to take the investigation findings seriously, and undertake strict measures against those involved in the anomalies reported. Action must also be taken against the pilots involved in corrupt practices. Furthermore, the authorities must ensure that the flying academies abide by the standard rules of pilot licensing. All these measures are necessary to ensure an efficient and safe aviation sector.\n",
        "headline_1": "Irregularities in pilot licensing must not be ignored",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/irregularities-pilot-licensing-must-not-be-ignored-3894196",
        "news_paper_name": "The Daily Star",
        "publish_date": "14-05-2025"
    },
    {
        "full_article": "Things change quickly. In November, when Trump won the election, Netanyahu's eyes beamed. He hailed Trump's re-election as the \"greatest comeback in history,\" and was the first foreign leader to visit the White House. The Trump administration's rhetoric, public crackdown on pro-Palestine protests in the US, along with the appointment of staunch pro-Israeli members in his Republican administration, made it seem like the friendship between the two leaders would be emboldened over the next four years. But Trump defines the nature of US interests abroad not through a friendship context, but rather a transactional trade frame. Ukrainian President Zelensky learned the hard way that Trump likes to \"hold the cards.\" Netanyahu, as shrewd as he portrays himself to be, seems poised to learn the same.\nOn Tuesday, Donald Trump arrived in Riyadh, embarking on his first foreign trip as US president to the Gulf nations. During Trump's first term, he recognised Jerusalem as the capital of Israel, unlike any other US president before. The president visited with the aim of normalising Israel's relationships with the powerful Gulf nations by sidelining the heart of the issues in the Middle East: the Palestinian cause—a win for Netanyahu. But for the Israeli government, this trip has an unprecedented atmosphere of panic surrounding it, with high stakes that could work against Netanyahu. On Monday, May 12, the Israeli scene witnessed remarkable media momentum that reflected escalating field tensions, internal political confusion, and clear disarray in the management of prisoners' files and negotiations with Hamas. Developments in the upcoming release of American-Israeli soldier Edan Alexander, as part of an uncoordinated US initiative with Tel Aviv, have dominated Hebrew media headlines, amid warnings of serious strategic repercussions for Israel's regional and international status.\nDue to the strong bond between Israel and the US, we, Palestinians, could not easily believe that there might be any real dispute between Trump and Netanyahu. But it's important to realise that a dispute between Donald Trump and Netanyahu does not mean a dispute between the US and Israel.\nThe relationship between Netanyahu and Trump, the two leaders, was a tactical one, but the relationship between the nations is a strategic one. We are also unaware to what extent the relationship has been affected, so we must understand one integral fact: the US can abandon Netanyahu, but they will never abandon Israel. The latter was deliberately created to serve the West's interests in the Middle East. It is true that Trump has shown patterns of causing disruptions with allies for his own gains, but Israel is home to a key US defence base, and Israel provides strategic US foothold and intelligence and technology partnerships in the Middle East. Previous US Presidents such as Bill Clinton, Barack Obama, and Joe Biden did not share good relations with Netanyahu, but the US has steadfastly supported Zionism and undermined the Palestinian cause.\nBefore Trump was inaugurated, he imposed a deal on Hamas and Israel to stop the war, to agree to a ceasefire, which did happen. But immediately after they exchanged hostages, and Netanyahu was able to salvage some of his reputation within Israeli society, he turned his back on the deal. At first, we would have interpreted the continuation of the war to also be in Trump's interest, and that Netanyahu's betrayal was written on the walls given Trump and Netanyahu's cosy relationship. But today the situation is a bit different.\nAn adviser to Trump told The Washington Post, \"In MAGA, we are not Bibi fans.\" Speaking on condition of anonymity, the adviser added, \"Trump is adamant: He wants people to put the guns down.\" By contrast, Netanyahu has been adamant about war with Iran, which Trump has been vocal against. Last month, it was reported that Israel has not ruled out an attack on Iran's nuclear facilities, despite President Trump telling Netanyahu that the US would be unwilling to support such a move. It is possible that US intelligence has discovered information that Israel is planning to hit an Iranian nuclear power plant—which has led Trump to bypass Israel.\nThree recent moves by Donald Trump indicate signs of tensions with Netanyahu. First, Trump's direct negotiation with Hamas, bypassing Israel, to release American hostage Edan Alexander was embarrassing for Netanyahu. On Sunday, senior Hamas leader Khalil Al-Hayya said they would release Alexander following direct talks with US officials. Netanyahu has long insisted that the war needs to continue to destroy Hamas, bring back the hostages, and secure peace in the Middle East—but now the US is showing a different pathway: they have the power to bring back the hostages; they can negotiate themselves.\nSecondly, Trump has recently negotiated a ceasefire deal, mediated by Oman, with the Yemeni Houthis, to stop attacking US ships in the Red Sea and disrupting trade routes in exchange for which the US would also stop bombing Houthis. The US-Houthi deal did not include Israel, and attacks between Israel and the Houthis continued. The third move, and perhaps the most nerve-wracking one for Netanyahu, has been Trump's direct engagement with Iran. In the Oval Office in April, Trump announced, much to Netanyahu's surprise, that the US would hold direct talks with Iran over its nuclear programme. A Trump adviser also told The Washington Post that influential MAGA voices and neoconservative Republicans have spent all spring working to resist efforts by pro-Israeli lobbying groups, who are overly sympathetic to Netanyahu and have pushed to install Iran hawks in the government. Trump recently sacked Mike Waltz as National Security Adviser, after Waltz mistakenly added the editor-in-chief of The Atlantic magazine, Jeffrey Goldberg, to a Signal chat. Insiders told The Washington Post that Waltz upset Trump by adopting an increasingly hawkish stance regarding Iran and his \"intense coordination\" with the Netanyahu over the possibility of launching military strikes on Iran.\nThe two leaders are no longer on the same page. The mood music has also conspicuously shifted, with US special envoy to the Middle East, Steve Witkoff—unlike the Biden administration's Antony Blinken—criticising Israel for prolonging the war and delaying the hostage deal. Trump has also shown his tendency to revere questionable \"absolute leaders\" whose shields of power cannot be threatened, as evidenced by his meeting with Kim Jong-un of North Korea. Netanyahu is in a deadlock situation—becoming increasingly unpopular in his country for continuing the war. But Netanyahu also cannot hold a ceasefire or end the war—which costs Trump money. Netanyahu's juniors, Smotrich and Gvir, would collapse the coalition if the war ends, which shows Netanyahu's leadership weakness. Trump is not a fan of weakness.\nNow, the other issue is that the leaders in the Middle East, after October 7, with the atrocities taking place, have no trust whatsoever in Netanyahu as a person and especially as a leader. Although many Middle Eastern countries do not outrightly oppose normalisation with Israel, they are unlikely to agree to a deal with Netanyahu, who the Arab states accuse of committing collective genocide. Trump has, therefore, repositioned the historic lens of viewing US relations in the Middle East via Israel by pursuing direct engagements.\nBut we must not forget that Donald Trump is primarily a businessman, and he wants to make America \"great again.\" In other words, he wants to make America rich again. He is now meeting with the richest people in the Middle East, and three energy-rich Gulf Arab nations, and his main purpose is to gain some wins to burnish his image as a negotiator. Trump is seeking at least $1 trillion in investments from Saudi Arabia, including arms purchases which have not yet been agreed upon. But in January, it was announced that plans were in place to expand trade and investment with the US by $600 billion over the next four years, with potential for more.\nThe Gulf nations have similar interests in formalising their positions as indispensable partners for the US. They also want to extract as much benefit as they can. Last year, the US and Saudi Arabia came close to securing a mega-deal which included a package of agreements that would have encompassed security, economic, and technological guarantees to the kingdom, as well as US support for its civilian nuclear programme. The deal also included normalisation of Israeli-Saudi relations and a component for a pathway to a Palestinian state. The deal would have consolidated the US position in the Middle East and given the US an upper hand in its superpower rivalry with China. But the deal was stalled over Saudi insistence that Israel commit to a path towards Palestinian statehood.\nNormalisation of Israeli relations with Saudi Arabia is in Donald Trump's interest right now, as it would open the road for other Muslim countries. For Saudi Arabia, securing an end to the genocide in Gaza and recognition of Palestinian statehood will be high on the list of what they want from Trump. The public in Saudi Arabia supports the Palestinian cause, and continuation of the genocide in Gaza has harmed public support for Saudi Arabia's Crown Prince Muhammad bin Salman (MBS). Saudi Arabia would strengthen its position as a leader in the Middle East if it can bring an end to the genocide and make the US formally recognise Palestinian statehood as part of their negotiations with Trump. If MBS succeeds in achieving this, he would emerge as a hero for the Muslim world.\nFor Palestinians, the hope is that Saudi Arabia will not accept any deal that promises Palestinian statehood and an end to the war until it is delivered. History has never shown any precedent to suggest that the US will support Palestinians' right to self-determination beyond words.\nBut in order to deliver conditions related to Palestinian sovereignty imposed by Saudi Arabia and the Gulf nations, Trump would have to break rank with Netanyahu and find an alternative Israeli leader who would obey the US. So, has the relationship between Trump and Netanyahu run its course? The results of the trip in the next few days will give us more signals. But make no mistake, Netanyahu's murderous career stands on thin ice, and it will crack, one day or another.\nYousef SY Ramadan is Palestinian Ambassador to Bangladesh.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Trump’s Saudi visit: Can it be ‘game over’ for Netanyahu?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/geopolitical-insights/news/trumps-saudi-visit-can-it-be-game-over-netanyahu-3893766",
        "news_paper_name": "The Daily Star",
        "publish_date": "14-05-2025"
    },
    {
        "full_article": "On May 7, India conducted airstrikes on alleged terrorist camps in Pakistan and Pakistan-occupied Kashmir (PoK), targeting nine sites under Operation Sindoor in response to the Pahalgam terror attack. Pakistan acknowledged the strikes, claimed civilian casualties, and retaliated with shelling along the Line of Control (LoC), escalating tensions between the two nations. However, both nations have emphasised restraint, with India claiming its strikes to be \"measured and non-escalatory\" and Pakistan signalling readiness to de-escalate if India steps back.\nEarlier, both nations responded swiftly and aggressively after the Pahalgam attack—India by suspending the Indus Waters Treaty and Pakistan by abandoning the Simla Agreement—raising fears of escalation. Yet, while the logic of nuclear deterrence may prevent all-out war, the attack has already unleashed a dangerous wave of securitisation within India where, there is the danger of Muslims being scapegoated as internal threats. This trend risks deepening communal divisions and empowering majoritarian agendas, which is likely to destabilise regional cohesion.\nThe responses of India and Pakistan reflected their zero-sum approach to bilateral tensions. India accused Pakistan of backing the Kashmir Resistance Front (TRF), a group linked to Lashkar-e-Taiba, and retaliated with non-military measures designed to inflict economic pain. The suspension of the Indus Waters Treaty, a landmark agreement that survived multiple wars, also marks a dramatic escalation. By threatening Pakistan's water security, India signalled its willingness to weaponise shared resources.\nPakistan, in turn, suspended the Simla Agreement, which has long served as a framework for bilateral engagement, and imposed trade restrictions. The tit-for-tat measures illustrate how quickly crises between the two nations spiral. Yet, despite the rhetoric, the risk of full-scale war remains mitigated by nuclear deterrence. Both countries possess second-strike capabilities, and their mutual awareness of catastrophic consequences has historically acted as a brake on escalation. As scholars of international relations argue, the \"stability-instability paradox\" allows for limited conflicts below the nuclear threshold, precisely the space where both nations are now operating.\nHowever, the geopolitical landscape is more complex today. China's involvement via the China-Pakistan Economic Corridor (CPEC) and its extension into Afghanistan introduces new variables. Any Indian military action could inadvertently draw in China, further complicating the crisis. Meanwhile, India's alignment with the US-led Quad adds another layer of great-power tension. While nuclear deterrence may prevent war, the broader regional instability underscores the fragility of South Asia's security architecture.\nBeyond the India-Pakistan standoff, the Kashmir attack has had profound domestic repercussions in India, where the BJP government has leveraged the crisis to justify some repressive measures against Muslims. The attack questioned Prime Minister Narendra Modi's narrative of \"peace and stability\" in Kashmir post-2019, exposing critical security failures. In response, the state has doubled down on securitisation—a process, as defined by the Copenhagen School, where elites frame an issue as an existential threat to justify extraordinary actions.\nThe aftermath of the attack saw alleged raids on Muslim homes, arbitrary arrests, and the demolition of properties under the guise of targeting \"illegal immigrants.\" Some BJP leaders have openly vilified Muslims, labelling them as \"Pakistanis\" or \"terrorists,\" while vigilante violence has surged. In Uttar Pradesh and Karnataka, two Muslims were killed in retaliatory attacks, with one assailant vowing to \"avenge the 26 with 26,000 of them.\" Such rhetoric echoes the long-standing strategy of some influential segments of India—conflating Muslim identity with disloyalty, a tactic that consolidates its Hindu nationalist base.\nThe Gujarat government's demolition of a Muslim slum under the pretext of targeting \"illegal Bangladeshis\" exemplifies this trend. These actions are not merely security measures but politically motivated acts. By framing Muslims as internal enemies, those in power reinforce a majoritarian narrative that justifies repression while diverting attention from governance failures.\nThe securitisation of Muslims in India risks fuelling global jihadist propaganda, which frames Muslims as persecuted minorities in Hindu-majority societies. This narrative could radicalise vulnerable populations, creating a self-fulfilling prophecy of fundamentalism. The international community has largely remained silent, but the repercussions extend beyond India's borders.\nBangladesh, for instance, faces a delicate balancing act. While it condemned the Kashmir attack, the BJP's portrayal of Bangladesh's recent political upheaval as a \"colour revolution\" or extremist rebellion has strained bilateral ties. The demonisation of Bangladeshi Muslims as \"infiltrators\" in India further erodes people-to-people relations, undermining regional trust.\nTaking stock, the Kashmir attack has exposed the fragility of India's security apparatus and the dangers of securitisation. While nuclear deterrence may prevent war between India and Pakistan, the domestic fallout, including the persecution of minorities, poses a grave threat to India's social fabric. The exploitation of the crisis for political gains risks normalising repression and deepening communal divides.\nFor regional stability, both sides must recalibrate their approach. Meanwhile, the international community must scrutinise the human cost of the ongoing securitisation, lest silence be interpreted as complicity.\nTamim Muntasir is researcher at Dacca Institute of Research and Analytics.\n\nShafi Md Mostofa is post-doctoral fellow at the Democracy Institute of Central European University, Hungary, and associate professor of World Religions and Culture at Dhaka University.\nViews expressed in this article are the authors' own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The Kashmir attack and the perils of securitisation",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-kashmir-attack-and-the-perils-securitisation-3893661",
        "news_paper_name": "The Daily Star",
        "publish_date": "14-05-2025"
    },
    {
        "full_article": "Speakers at an award ceremony of Bishwo Shahitto Kendro raised one of the biggest challenges in education—the stark disparities in the quality of education across different streams, resulting in intensified social inequality. We have three major streams of education: Bangla medium, English medium, and the madrasa system, which mostly offers education to the less privileged sections of society. The glaring discrepancies in the quality of education in each stream result in differences in opportunities, creating an elite class (a tiny portion of the population) that enjoys the most opportunities, while the majority of students fall behind in terms of securing the best jobs and achieving financial prosperity.\nThere has been, moreover, no assessment of market realities—whether the number of jobs available coincides with the number of university degree holders. Thus, we see many young people with Master's degrees remaining unemployed or working in low-paid jobs. Vocational education, on the other hand, can provide many young people with skills that are in demand both at home and abroad and can lead to better-paying jobs. But very little thought has been given to improving and expanding vocational education.\nProf Abdullah Abu Sayeed, the founder of Bishwo Shahitto Kendro, has also pointed out the lacklustre curricula followed by most schools in the country. Textbooks currently do not engage students and therefore will not be able to produce the kind of enlightened individuals needed to build a nation. The archaic method of rote learning does not lead to critical thinking or analytical skills.\nWe also agree with one of the speakers that it is disappointing that although an education committee was formed to address reforms in the primary and non-formal education systems, the interim government has yet to form an education commission to holistically address the challenges of the education sector. What could be more important than proposing reforms to this flawed education system, where the quality of education a student receives depends on their family's social and economic status?\nWe know that in the past there have been many commissions that have made recommendations to address the challenges of an unequal education system, but successive governments have done little or nothing to implement any of them. We expect, however, that the next democratically elected government will give education the priority it deserves, as it is a critical factor in Bangladesh's progress. Education must be accessible to all, enlightening, and relevant for today's world. To that end, establishing an education reform commission is a necessary step.\n",
        "headline_1": "Our flawed education system must be fixed",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/our-flawed-education-system-must-be-fixed-3891456",
        "news_paper_name": "The Daily Star",
        "publish_date": "14-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 14, 2025 00:00:00  \nOne of the reasons why the nexus of corrupt politics and its crony oligarchs could get away with plundering the banking sector during the autocracy was the powerlessness of the Bangladesh Bank (BB) to stop it. Obviously, the interim government under the dispensation of post-July uprising realised the urgency of equipping the BB with the necessary legal tools so it could exercise its authority to rescue the fragile banking sector by way of taking actions against non-compliant/sick banks to protect depositors and borrowers. As chronic fragility of the banking sector has caused significant erosion in the public's as well as the investors' trust in the banking system, the financial institutions division under the finance ministry in February this year published the draft law titled the Bank Resolution Ordinance, 2025 granting the BB sweeping powers to do what was necessary to save the banking sector plagued by various malpractices including scams, poor governance, weak compliance, heists and ever-rising volume of the non-performing loans (NPLs). \nThe government through a gazette notification on Friday, May 9 last published the ordinance under which a troubled bank could be restructured or liquidated in a way that the process minimizes the failing bank's impact on the depositors, other banks and the broader economy. Undeniably, it is a landmark step by the government towards restoring discipline in the financial, or for that matter in the banking sector. Thus, the Bank Resolution Ordinance is endowed with broad powers to intervene in case any of the banks or financial institutions, state-owned or private, or foreign, found compromised. The BB would then take steps to dissolve a struggling bank appoint temporary administrator, transfer its assets to another state-owned entity, the so-called bridge bank. The bridge bank, on its part, is a special type of bank authorised to take over and operate a failing bank for a limited period of time. In fact, it acts as a bridge allowing time for a potential buyer to be found or explore other resolution options. Also, another function of the bridge bank is to act as an isolator so as to isolate the distressed bank from the broader banking sector to prevent panic withdrawal by depositors.\nThe whole purpose of a bridge bank, therefore, is that the clients of a struggling bank can continue to access, for instance, their deposits or get other financial services seamlessly. Now, the BB will also be able to raise capital through new or existing shareholders to strengthen financial position of a distressed bank. Evidently, a fund, styled, 'Bank Restructuring and Resolution Fund' will be created through government contributions, international financial institutions, risk-based levies on banks and so on. However, in case, the struggling bank fails to meet capital or liquidity requirements or its owners engage in fraudulent practice, the BB will have the power to take corrective measures as necessary. \nNow, as designed, the BB has its powers to clean up the mess in the banking sector created over the decades, especially during past one and a half decades of autocracy. But it is one thing to have power, quite another to exercise it. The question arises because, the country had never any dearth of laws. But what it was wanting in was their execution. Hopefully, this time the banking sector regulator will show its teeth, if and when needed.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Empowering central bank with sweeping powers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/empowering-central-bank-with-sweeping-powers-1747147628",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       May 14, 2025 00:00:00  \n\nThe recent surge in Bangladesh's potato exports underscores the crop's growing potential in overseas markets. Potato exports have quadrupled in the current fiscal year, reaching 50,000 tonnes between July and April-up from just 12,300 tonnes in FY 2024. While this volume may not appear massive in absolute terms, the achievement is notable given that Bangladesh in the past had been a potato-importing country, and grappled with severe domestic price hikes. The current export growth marks a significant shift in the country's agricultural landscape.\nThe Bangladesh Potato Exporters Association expects exports to exceed 70,000 tonnes by the end of the season. This sharp rise has been largely attributed to robust domestic production and increasing demand in Asian markets. According to the Department of Agricultural Extension (DAE), the country is projected to produce a record-high 11 million tonnes of potatoes this year-approximately 4.0 million tonnes more than the nation's annual requirement.\nThis surplus presents a valuable opportunity. However, challenges remain, particularly in terms of data reliability. Accurate production figures are critical for effective planning and market forecasting. Unfortunately, as has often been the case with other agricultural products, unreliable or inconsistent data have hampered proper assessment and decision-making. Experts believe Bangladesh has consistently produced a surplus of potatoes in recent years, including newer high-yield varieties. But much of this surplus is wasted due to poor storage infrastructure and inadequate steps by the authorities to facilitate export.\nIronically, bumper harvests have often brought distress rather than relief to potato farmers. A lack of storage facilities-especially in the neighborhood of potato-producing areas-combined with an absence of market access and export mechanisms, leaves farmers with limited options. They are frequently forced to sell their produce at unreasonably low prices or suffer losses due to spoilage.\nThis issue is not unique to potatoes. Similar patterns are seen with other horticultural crops like tomatoes, leafy vegetables, and pineapples. However, the potato situation is perhaps more pressing due to the sheer volume of production and losses incurred.\nDespite these challenges, farmers continue to cultivate potatoes, which remain a preferred crop for many due to their relatively low input requirements and adaptability. Bangladesh Bureau of Statistics (BBS) data show that over the years, despite losses incurred by farmers, land area for potato cultivation has been on the rise which goes to explain that farmers still prefer to stick to one of their favourite and relatively easy-to-grow crops. According to the Department of Agriculture Extension (DAE), total land area under potato cultivation has been on the increase since 2012 but for a slight fall in 2017. However, last year the country had to import potato due to domestic shortfall. In between July and November, local prices soared to Tk 70-90 a kg, prompting scrutiny of official production figures. Currently, retail prices of potatoes range between Tk 20 and 30 a kg throughout the country---the lowest in three years, suggesting a bumper crop and potential for even greater exports.\nGiven this context, the country appears poised for a substantial leap in potato exports. A report by The Financial Express, quoting exporters, noted that the current boom is fuelled by a combination of strong domestic yield, falling local prices, increasing international demand, development of new export-quality potato varieties, and slightly reduced cargo fares. Moreover, regional tensions have diverted a portion of export orders from India and Pakistan to Bangladesh, giving local exporters a strategic edge.\nGlobal demand is high, and potatoes are now being exported at $300 per tonne, buoyed by a favourable exchange rate. Exporters are optimistic that another 20,000 tonnes will be shipped this season. Malaysia remains the top destination, with shipments expected to continue for another month, while exports to Nepal may extend up to July.\nAccording to the Export Promotion Bureau (EPB), Bangladeshi potatoes are currently exported to 14 countries. Malaysia alone accounts for about 80 per cent of total shipments. Other significant markets include Singapore, Nepal, Sri Lanka, and several Middle Eastern nations. While Russia was once a key importer, exports there have since declined. EPB data also show that export earnings peaked in FY 2014 at over $33 million (from 106,000 tonnes). However, exports dwindled in subsequent years until the current resurgence.\nExperts argue that sustainable growth in exports could offer the much-needed relief to farmers-provided the country adopts a more strategic approach. This includes aligning cultivation with the specific preferences and standards of importing countries, especially in terms of sanitary and phytosanitary compliance. Establishing proper storage facilities and developing logistics for timely exports are also essential.\nA more organised and market-oriented approach could incentivise quality production, which in turn would be reflected in better prices for farmers. Such a shift would not only enhance rural incomes but also reduce the enormous waste that currently plagues the sector. With coordinated efforts from policymakers, exporters, and agricultural stakeholders, Bangladesh has a real opportunity to transform its potato surplus into a valuable export resource.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Unlocking the potential of potato export",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/unlocking-the-potential-of-potato-export-1747147696",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 14, 2025 00:00:00  \n\nHealthcare is one of the fundamental needs of human life, yet in Bangladesh today, many hospitals and clinics appear to be \"sick\" themselves. Ailing infrastructure, poor treatment standards, exploitative syndicates and deep-rooted corruption have pushed the country's healthcare system to the edge of collapse.\nIn numerous public hospitals, severe shortages of doctors and nurses leave institutions overwhelmed by patient numbers. Long waiting times, limited services, and frequent shortages of essential medicines have become the norm for ordinary citizens. To make matters worse, many facilities are plagued by the influence of middlemen and syndicates, further complicating access to care.\nMeanwhile, some private hospitals and clinics seem to have become profit-driven enterprises. Unnecessary medical tests, inflated bills and lack of transparency dominate patient experiences. In many places, infrastructure is outdated, equipment is inadequate and allegations of poor food quality and medicine shortages are widespread.\nUrgent and comprehensive reforms are required to tackle this crisis. Strict regulation and monitoring mechanisms must be implemented across all districts. Unlicensed and unauthorised clinics must be shut down, with legal action taken against those responsible. Public hospital infrastructure must be upgraded, essential medicines made consistently available, and food quality ensured. Equally important is the transparent and accountable use of healthcare budgets.\nHospitals and clinics should be sanctuaries of healing and trust. When mismanagement, exploitation, and neglect take root in these institutions, public confidence is lost. The healthcare system must not only be reformed-it must be run with responsibility, compassion, and integrity. There is no room for delay. The well-being of a nation depends on the health of its people. Ensuring equitable, affordable, and quality healthcare is not a privilege but a right that must be upheld at all costs.\nRakhi Akter\nStudent, Eden Mohila College\nrakhiaktermim85@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Unwell hospitals, unhealthy system",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/unwell-hospitals-unhealthy-system-1747147725",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 14, 2025 00:00:00  \n\nAs summer sets in with rising temperatures and severe heatwaves sweeping across the country, it is crucial to exercise caution in our food and lifestyle choices to stay healthy during this period.\nOne growing concern is the increased consumption of open street food and drinks, driven by fatigue and thirst in the sweltering heat. \nUnfortunately, the high temperature accelerates food spoilage and attracts flies and insects, raising the risk of contamination. In particular, bottled cold water and iced lemon juice sold by hawkers are now widely available in every corner of the city. \nHowever, questions remain about the hygiene standards maintained in the handling and storage of the ice used in these beverages. Ice is often stored in sacks or on makeshift wooden tables covered with plastic sheets-conditions far from sanitary.\nFurthermore, the increased use of air conditioning during this time, combined with high humidity, fosters the growth of bacteria and viruses, contributing to a rise in waterborne illnesses such as diarrhoea, jaundice and typhoid.\nWith a little awareness and precaution, many of these health risks can be mitigated. It is advisable to carry a bottle of safe drinking water and an umbrella when venturing outside. \nHomemade drinks such as lemon juice, lassi, and yogurt-based beverages are far safer alternatives and help keep the body hydrated. \nChilled water from refrigerators should be avoided, \nand vitamin C-rich foods should be consumed in \nabundance. Most importantly, open street \nfood should be completely avoided during \nthis season.\nA few discreet choices can go a long way in preventing disease and maintaining well-being in the scorching summer months.\nZesia Tabassum Zahin\nDepartment of English language, IML\nJagannath University, Dhaka\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Caution for choice of food and drinks",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/caution-for-choice-of-food-and-drinks-1747147756",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-05-2025"
    }
]