[
    {
        "full_article": "The Union Ministry of Home Affairs’ assertion to the J&K High Court that the Lieutenant-Governor (L-G) can nominate five Assembly members without the “aid and advice” of the elected government overrides democratic accountability. Consequential decisions such as nominating members who have voting rights in an elected assembly must flow from democratic mandate, not administrative discretion. The High Court’s constitutional question could not be more direct: do the 2023 amendments to the J&K Reorganisation Act, allowing the L-G to nominate five Assembly members “which have the potential of converting the minority government into a majority government and vice-versa,” violate the Constitution’s basic structure? Rather than addressing this, the Ministry delves into legal technicalities. Its submission argues that nominations fall outside the elected government’s remit, seemingly invoking the K. Lakshminarayanan vs The Union of India precedent from Puducherry while claiming the “sanctioned strength” includes elected and nominated members. It even references Section 12 of the 1963 Union Territories Act (voting procedures) as justification for bypassing democratic consultation. When five nominated members could determine government stability in a 119-member Assembly, the issue transcends statutory definitions of “sanctioned strength”. The real question is whether any legal framework allowing appointed officials to potentially overturn the people’s electoral verdict violates the democratic essence of the Constitution.The amendments inserted Sections 15A and 15B into the 2019 Act, allowing the L-G to nominate two Kashmiri migrants (including one woman) and one from the Pakistan-occupied J&K community, besides the existing power to nominate two women, if inadequately represented in the elected Assembly. This effectively creates five nominated seats. The High Court’s framing of this issue acknowledges the stakes involved: this could “convert minority government into majority government and vice-versa”, potentially subverting the electoral process. This concern is not unsubstantiated — in 2021, three years after Lakshminarayanan, Puducherry saw nominated members and defecting elected MLAs contributing to the collapse of the Congress-led government. Also, J&K’s trajectory to Union Territory, without consultation with elected representatives, makes democratic accountability even more crucial. The unfulfilled promise of Statehood restoration, acknowledged by the Supreme Court and despite overwhelming support in J&K, reinforces that current arrangements should strengthen democratic governance. The Ministry’s argument that nominations exist “outside the realm of the business of the elected government” also contradicts evolving Supreme Court jurisprudence. In the Delhi services cases of 2018 and 2023, it ruled that the L-G should act on elected governments’ aid and advice, with discretionary powers treated as exceptions. Seen in this light, the Ministry’s arguments do not hold water. Published - August 14, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Jammu and Kashmir\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        Puducherry\n                    \n                            /                      \n                        \n                        Article 370\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        Pakistan",
        "headline_1": "Aid and advice: On Jammu and Kashmir and the Lieutenant-Governor’s Assembly member nominations",
        "headline_2": "L-G’s nominations without government nod could undermine J&K’s electoral process",
        "link": "https://www.thehindu.com/opinion/editorial/aid-and-advice-on-jammu-and-kashmir-lgs-assembly-member-nominations/article69928865.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "14-08-2025"
    },
    {
        "full_article": "From having to deal with an inflation level higher than the RBI’s comfort band of 2%-6% just two years ago, the government is now in the relatively more comfortable space of inflation coming in lower than that band. July’s retail inflation of 1.55%, the lowest since June 2017, was made possible almost entirely by the contraction in food prices. This is particularly significant because the statistical base effect was low in July. That is, food inflation in July 2024 was itself at a 13-month low. A contraction in prices this July over that figure implies a real reduction in prices rather than a statistical anomaly. The consensus among economists is that this will continue due to improved sowing, a good monsoon, and a favourable base effect as inflation had surged again in the latter half of last year. The other positive was that core inflation, which removes the effect of fuel and food, fell to 4.1%, which is the RBI’s target. On balance, the outlook for inflation looks good, especially due to the monsoon’s progress. There is some risk, especially if India decides to switch away from Russian oil and opts for the somewhat more expensive Gulf oil. But this is unlikely given the government’s assertions that it will prioritise India’s interests. In any case, the Trump-Putin meet could potentially render the latest tariff obstacles inconsequential.The RBI expects inflation to pick up only from January 2026. But there is no time for complacency. While India is far from being in a persistent low-inflation, low-growth stagnation, it is staring at a growth slowdown. The latest growth in the Index of Industrial Production was at a 10-month low, with capital and consumer goods activity anaemic. Growth in GST revenue slowed to single-digits in June and July. The contraction in gross direct tax collections this financial year is also concerning. Car sales to dealers dropped to an 18-month low in June. UPI transactions, touted in the past as a sign of buoyant economic activity, fell as compared to the previous month thrice so far in 2025. The RBI has retained its forecast of 6.5% growth this financial year, which looks optimistic. Even if the U.S.’s additional 25% tariffs are removed, the initial 25% will themselves likely reduce India’s growth by 0.2 percentage points. India’s growth is not robust enough for it to be blasé about such a loss. Structural problems remain, demand is still weak, and a temporary dip in inflation is in itself not going to help much. Published - August 14, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        inflation and deflation\n                    \n                            /                      \n                        \n                        food\n                    \n                            /                      \n                        \n                        Monsoon\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        Saudi Arabia\n                    \n                            /                      \n                        \n                        United Arab Emirates\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        cars\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "​Limited gains: On the inflation space",
        "headline_2": "A temporary blip in inflation will help, but not by much",
        "link": "https://www.thehindu.com/opinion/editorial/limited-gains-on-the-inflation-space/article69928821.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "14-08-2025"
    },
    {
        "full_article": "Trump delaying tariffs on China while targeting India shows our lack of strategic tech and manufacturing     \nThe chip war between US and China is back on the table with Washington reportedly working out a deal to take 15% from the sale of Nvidia’s and AMD’s AI chips to China. This effectively makes US govt a business partner to Nvidia and AMD, and comes after Washington allowed resumption of chip sales to China. The latter had been halted by Trump in April as part of his trade tussle with Beijing. However, he was forced to lift the ban after China retaliated with its own ban on rare earth exports to US.  \nBeijing has now sent notices to Chinese companies discouraging the use of Nvidia chips citing security concerns. Parallelly, however, US and China have decided to extend their tariff truce till Nov. This is in stark contrast to Trump’s approach to India, which is now facing the prospect of 50% tariff on its exports to US.   \nThe entire episode holds out two key lessons. First, the tech war is here to stay. Whether it’s US chip sales to China or China trying to undermine tech manufacturing in India as highlighted by its recent pullout of Chinese engineers from Foxconn’s India plants, this is a strategic sector that every country will try to leverage or weaponise. And with the advent of AI, India’s expertise in software and coding is no longer that attractive. Therefore, India must not waver in its determination to master bedrock tech like semiconductor manufacturing and design, as well as AI. Countries like Estonia are integrating AI in their education systems. Plus, the recent spat between Elon Musk and OpenAI boss Sam Altman over listing in Apple’s App Store shows how fiercely companies are competing over AI tech. India must not lag behind. \nSecond, Trump’s targeting India with big tariffs because he feels it doesn’t have anything strategic to offer. That’s not the case with China given its manufacturing muscle. Similarly, Taiwan’s cutting-edge semiconductor industry makes it vital to tech supply chains, and therefore, a prime candidate for tariff exemptions. India too needs to cement a crucial spot in global manufacturing by investing heavily in domestic R&D, technical education and AI. It’s work that can’t be delayed.\n\n",
        "headline_1": "Chip in now",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/chip-in-now/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-08-2025"
    },
    {
        "full_article": "‘Mind without…’ poem recast for mindless times\nWhere the sundry targeted are without fear\nAnd can walk with head held high\nWhere expression is free\nWhere society is not broken up into fragments\nBy narrow bigotry\nWhere media words come out of the depths of truth\nWhere ‘development’ does not stretch its greedy arm towards urban destruction\nWhere clear Himalayan streams have not lost their way/Into ugly housing and hotels\nWhere patriotism isn’t bound by narrow sectarian agendas/And parking lots are free\nWhere Manipur is not a foreign country\nAnd Delhi isn’t duty-free of it\nWhere Kashmir is still a kali\nAnd not trapped in terror’s Kaliyug\nWhere the power hungry aren’t blind\nTo starving children\nWhere ‘every move you make’\nIs not for a selfie, and\nWhere ‘woke’ is not a yawn\nWhere ‘parivar’ is open-hearted Indian family\nAnd not closed, chauvinistic brotherhood\nWhere mothers and sisters aren’t belongings\nBut women in their own right\nWhere ‘ask’ is still a verb and\nMarriage is not a sentence.\nInto that heaven of freedom, my mata,\nLet my Bharat awake.\n                                                ***\nAlec Smart said: “Trump-Putin to meet on Aug 15. Will Zelenskyy gain freedom?\n\n",
        "headline_1": "Tagging Tagore",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/tagging-tagore/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-08-2025"
    },
    {
        "full_article": "A doc-to-be is killed by her father & uncle. Punishment should be a deterrent for such regressive, violent families\nIf the 23-year-old partner of an 18-year-old woman in Gujarat had not filed a habeas corpus petition, the murder of medical aspirant Chandrika would not have come to light – her family had explained her death in June as a heart attack/ suicide. Her father and uncle killed her because in the perversity of patriarchy, they feared her achievement of qualifying the very tough medical entrance exam NEET would bring the family ‘dishonour’. Studying in a co-ed medical college was a no-no, having a partner sacrilege. They cut her off from the outside world, tasked her with household chores – because, of course, that’s her ‘duty’ as a woman, and becoming a doctor was unthinkable. Then they killed her.\nChandrika qualified to study in a govt medical college – no mean feat. That she also fell in love just shows that youth will find a way no matter how strict the home-front. But what daughter can imagine that a parent would not be proud of such an achievement and that her father and uncle could plot to kill her? Every such story highlights the predatory nature of patriarchal families on their young. What is most chilling and scary here is the silence of the rest of the family, of the neighbourhood, of the community, and doubtless, in Banaskantha, the tribe or caste. It is this silence that allows parents and relatives to get away with murdering their children. How many crimes slip past? \nIt has taken decades for girls’ education to be finally acceptable even in the most backward of societies. But even today, for lakhs of school-leaving girls, their dreams of higher education are shackled by ultra-conservative chains. Education opens the mind, allows imagination free rein. But for the likes of Chandrika’s father, such freedom is scary – beyond ‘control’. We would send girls to school but cannot tolerate their asserting their likes and dislikes, let alone freedom to choose a future. One can only be grateful for the power of love that took a worried 23-year-old to court – and a murder was discovered. Chandrika’s killers must be punished severely as a warning to all such fathers who would murder their daughters.\n\n",
        "headline_1": "Killer dads",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/killer-dads/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-08-2025"
    },
    {
        "full_article": "As an officer of the court, I should not be allowed more than a mild lament at the incredibly extraordinary developments on Aug 11 in the court of Justice Pardiwala and his puisne judge – directions on banishing all community dogs in Delhi-NCR to “shelters”.\nAs a participant in future proceedings, I will scrupulously steer clear of the merits of the matter. But it’s necessary to record and analyse some details of the hearing.\nJustice Pardiwala pooh-poohed a Central legislation and dictated an order that many would say is in contravention of the law, while, at the same time mentioning he will not be stopped by the law – perhaps the most extraordinary statement from a lordship adorning the august bench of the Supreme Court. Read full story on TOI+\n\n",
        "headline_1": "Key legal questions on SC’s stray dogs order",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/key-legal-questions-on-scs-stray-dogs-order/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 14, 2025 00:00:00  \nThough the agriculture sector contributes around 12 per cent of the country's gross domestic product (GDP), it is a misleading indicator to assess the importance of the sector. For instance, around 45 per cent of the nation's workforce is directly involved in the sector, which underscores the impact of agriculture on the job market and the economy. Again, ensuring food security remains highly dependent on substantial farm output. Against the backdrop, the latest push by the central bank to enhance disbursement of farm credit from commercial banks is a move in the right direction.\nOn Tuesday, Bangladesh Bank formally unveiled the Agricultural and Rural Credit Policies and Programmes for the current fiscal year (FY26), setting a target of Tk 390 billion for agricultural and rural credit distribution. The new target is 2.63 per cent more than last fiscal year's (FY25) target of Tk 380 billion, when the actual amount of disbursed loans stood at 373.26 billion. Central bank statistics also showed that the farm loan disbursement fell below the target after three years of overshooting the annual targets. So, it is a matter of concern, especially when the agro-based rural economy needs sufficient support to help boost economic activities. The latest farm credit policy emphasised easing the loan application procedures, disbursing credit through agent banking activities, and using the MFI/NGO linkage by banks that do not have adequate number of branches or sub-branches in rural areas. \nThe central bank governor has rightly pointed out that farm and rural credit is still a low priority area for the commercial banks in the country, as less than 3 per cent of total bank financing goes to agriculture. In this connection, two specialised banks (BKB and RAKUB) and six state-owned commercial banks (SCBs) play a critical role in disbursing farm credit. These eight banks disburse around 36 per cent of the total credit, whereas the share of 42 private commercial banks (PCBs) is 62 per cent. So, there is a scope to increase the share of PCBs to boost farm credit. \nAt present, 60 per cent of the total farm credit goes to the crop sub-sector, followed by 15 per cent to livestock and 13 per cent to fisheries. To meet the growing demand for staple food, such as rice, along with vegetables and fruits for nutrition, and cattle and fish for animal proteins, efficient farm production is necessary. Without having climate-resilient seeds and advanced technologies, it is challenging to enhance the farm output, especially when farm land is slowly vanishing in the country and putting food security under threat. Though import from the international market is a key source to meet the country's food demand, there is no alternative to enhance the local output. Moreover, the agriculture sector is now more diversified than before, and many young entrepreneurs in agriculture sector are emerging with small-scale operations. They need bank financing to move ahead with their farm projects. Farm-centric cottage, small and medium enterprises (CSMEs) are also growing in different parts of the country, reflecting the diversification. All these require easy and efficient financing, and PCBs can also tap into these opportunities. \nFinally, as also mentioned by the governor, refinancing for farm credit is not the responsibility of the central bank alone, and the government should also to come up with the budget support. This will help increase the volume of farm credit.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Distributing farm credit efficiently",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/distributing-farm-credit-efficiently-1755100412",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       August 14, 2025 00:00:00  \n\nIn the face of mounting debt of the state-owned enterprises (SoEs), the government has recently launched an online platform known as the SABRE+ system. Developed by the Finance Division, SABRE+ stands for State-owned Enterprises and Autonomous Bodies Budget, Reporting, and Evaluation System. The platform is designed to streamline budget preparation, financial reporting, and performance evaluation for SoEs and autonomous bodies. Its implementation is expected to strengthen transparency and accountability in their management. \nThe need for a data-driven, transparent, and accountable governance framework for the effective operation of SoEs cannot be overstated as they have long been plagued by irregularities, inefficiency and debt. According to a Finance Division report, the total liabilities of 101 state-owned enterprises (SoEs) and autonomous bodies stand at over Tk 6.39 trillion, with 26 per cent of the amount tied to subsidiary loan agreements. Based on their balance sheets, the Finance Division's Monitoring Cell has placed these entities into five categories. Of the 101 entities reviewed, only two are classified as \"very low risk\", 20 as \"low risk\", and 37 as \"moderate risk\". The remaining 42 entities are in critical condition - 28 designated as \"high risk\" and 14 as \"extremely high risk\". Together, these 42 entities hold Tk 3.13 trillion in government loans and guarantees.\nNotably, the 14 entities categorised as \"very high risk\" hold liabilities of Tk 1.72 trillion against liquid assets of only Tk 28.37 billion. Many of these entities, such as sugar mills, are so financially distressed that they continue to accumulate debt each year while struggling to service existing obligations. Some have even lost the capacity to meet interest payments against their debt, signalling a deepening financial crisis. This imbalance poses serious fiscal risks and demands immediate policy intervention.\nSo, even after the implementation of SABRE+ system to streamlines their budget framework, the pressing question remains: what should be done with these loss-making ventures that have been draining the public exchequer? Should they be privatised, brought under public-private partnerships, or revitalised through improved management and governance?\nNotably, SoEs with monopolistic businesses such as energy import and distribution, submarine cables and utility service providers are generally profitable. However, SoEs that have to compete in the market alongside the private sector are in dire straits. For example, Bangladesh Railway, Biman, BTCL, BRTC, sugar mills, jute mills, and many more have been incurrimg massive losses year after year. Even the Teletalk, which entered the market with much fanfare, has been reduced to a damp squib, while foreign mobile operators continue to generate hefty profits. \nSoEs in these sectors were expected to serve as a counterbalance to private-sector monopolies, ensuring that essential services remain accessible and affordable for all citizens. For without robust government oversight and effective price-control mechanisms, the private sector could prioritise profit maximisation over public welfare, leading to unchecked price gouging and service degradation. Unfortunately, the deplorable trend of profit maximisation has become a common phenomenon, largely due to the weak performance of the SoEs. The question is, if private companies can operate profitably in these sectors, why can't public enterprises do the same, despite holding significant assets and market advantages?\nThere is a plethora of factors behind the poor performance of SoEs. Historically, policy decisions in Bangladesh have often favoured private businesses at the expense of the broader public interest. For example, there are allegations that ministries or officials responsible for maintaining certain sectors, such as the railway, have deliberately undermined public operations to benefit private competitors like bus operators. Unfortunately, this pattern is not limited to transport; similar instances of policy manipulation have been observed in healthcare, education, and other sectors, where public interest has been sacrificed for private gain. Thus, one of the greatest obstacles to the effective performance of SoEs is the entrenched self-interest of certain ruling party leaders and government officials. Whether this will change in the future remains to be seen.\nAnother major reason behind the lackluster performance of public enterprises is the lack of good governance. This encompasses a glaring lack of efficiency, accountability, and the pervasive issue of corruption. Despite incurring persistent losses that burden taxpayers and the nation, senior management and officials maintain their secure government jobs. To date, there is hardly any instance of a top executive of these SoEs being removed from their posts or held accountable for the financial losses incurred under their leadership. This absence of consequences perpetuates a cycle of inefficiency and financial drain.\nMoreover, the attitude of employees in these enterprises is a significant problem. The experience of seeking services at most state-run institutions, whether in the service or commercial sectors, is often disappointing. Service seekers are frequently met with indifference, if not outright disrespect, and subjected to unnecessary delays. Many government employees tend to treat public offices as their personal domains. There is a lack of discipline and punctuality, with officials often arriving late, leaving early, or being absent during their office hours. Apparently, the permanent nature of government jobs, along with promotions and pay raises regardless of individual performance or the organisation's profitability, fosters a lackadaisical attitude among employees. True, a chronic lack of investment and outdated equipment have been major drawbacks in their performance, but without comprehensive reforms in the system of governance, increased investment is unlikely to bear fruit.\nIt is, therefore, imperative for the government to conduct a comprehensive evaluation of the SoEs to strengthen governance and enhance efficiency. For those with little prospect of recovery, alternative options such as divestment, merger, or dissolution should be on the table. Maintaining white elephants that drain the state's limited resources is both unsustainable and unproductive. However, such reform would require strong political will, as vested interests, labour unions, and political patronage networks often resist change. Experts also argue for enacting a law to establish a clear process for privatisation, merger, or dissolution of loss-making entities. At present, state-owned enterprises are established under separate laws and lack a unified legal framework, meaning any move to privatise, merge, or close them requires cumbersome, time-consuming parliamentary approval. Without addressing these institutional, legal and political barriers, propping up loss-making SoEs will continue to drain limited public resources.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "What to do with the loss-making SoEs?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/what-to-do-with-the-loss-making-soes-1755100511",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 14, 2025 00:00:00  \n\nArtificial Intelligence (AI) is rapidly transforming the global economy, and Bangladesh is no exception. From agriculture to finance, AI is creating new opportunities to increase productivity, create jobs, and boost economic growth.\nAgriculture is a critical sector in Bangladesh, essential to the country's economy and employment. AI tools can help farmers predict weather patterns, detect crop diseases early, and optimise irrigation. By using AI, farmers will be able to anticipate weather in advance, which will reduce economic losses. Every year, crop diseases cause significant economic damage, negatively impacting a large part of the economy. Early warnings through AI will directly benefit rural communities.\nIn the garment industry, Bangladesh is the world's second largest exporter of ready-made garments. If AI can improve efficiency through automated quality control, supply chain optimisation, and predictive demand analysis, it will not only reduce costs but also help meet the rapidly changing demands of the global market, resulting in higher profits.\nFinancial services are also benefiting from AI-powered systems that enable mobile banking, fraud detection, product personalisation, risk management, and automation, thereby reducing costs.\nHowever, challenges remain. AI adoption requires skilled workers, strong infrastructure, and investment in research and innovation. Without proper training, automation may displace some jobs, especially in labour-intensive sectors. A balanced approach is essential-one that focuses on upskilling the workforce, improving internet access, and supporting local AI startups.\nIf strategically applied, AI has the potential to become a key driver of Bangladesh's economic transformation. The economy of the future can rely not only on low-cost labour but also on the smart integration of technology across all sectors. AI can increase exports, improve service quality, and create high-value employment opportunities, playing a significant role in reducing unemployment in our country. Proper use of AI in agriculture can further develop our economic sector and contribute to sustained growth.\nFarjana Nilufar Mim\nUndergraduate Student\nNorth south University\nfarjana.mim@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "How will AI affect the economy?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/how-will-ai-affect-the-economy-1755100533",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 14, 2025 00:00:00  \n\nThe physical and mental development of children depends fundamentally on a toxin-free and safe food system. Yet, a frightening reality prevails in Bangladesh's food market today-many products made specifically for children are contaminated with harmful chemicals and artificial colours. Those responsible are not merely dishonest businessmen; they are criminals, lack humanity and are direct enemies of our country's future.\nA 2023 World Health Organization (WHO) report highlights that foodborne diseases affect nearly 600 million people worldwide every year, causing 420,000 deaths, a large proportion of whom are children under five years old. According to the 2025 IPC Acute Malnutrition (AMN) analysis, 1.6 million children in Bangladesh are currently at risk of acute malnutrition, including 143,850 who are severely malnourished.\nThis alarming situation demands urgent and decisive action. We must implement a zero-tolerance policy against manufacturers producing adulterated baby food and expand the powers and reach of special food courts and mobile courts to ensure swift justice. The Consumer Affairs Department should be equipped with modern laboratories and adequate manpower to enhance market surveillance. Additionally, stricter licensing requirements and mandatory quality testing for all baby food manufacturers must be imposed. Public awareness is critical, and a nationwide campaign involving media, social organisations, and educational institutions should be launched to highlight the critical issue of children's food safety.\nOur fight against adulterated food is not just a health concern; it is a matter of national security. Protecting our children means protecting the future of Bangladesh.\nAshikujaman Syed\nBusiness Development Manager\nTianjin Pharmacn Medical Technology Co., Ltd.\nTianjin, China\nsyedashikujaman@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Adulteration of baby food",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/adulteration-of-baby-food-1755100563",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-08-2025"
    }
]