[
    {
        "full_article": "The retail inflation data for October once again underscore the fact that the update of the Consumer Price Index (CPI) cannot happen fast enough. The data show that the rate of overall inflation fell to just 0.25%, the lowest it has been since at least January 2012. On the face of it, this would be cause for celebration, but a deeper look reveals this drastic fall to be a statistical anomaly rather than an actual fall in price levels. The food and beverages category saw prices falling 3.7% in October, the largest in the history of the CPI’s current series. However, the main reason for this contraction was not so much that food prices have fallen, but because food inflation in October last year was a blistering 9.7%. This high base ensured that food inflation in October 2025 was negative, even though vegetable prices in markets have been on the rise recently. With the food and beverages category enjoying a weightage of nearly 46% in the overall CPI basket, this statistical anomaly in food inflation was responsible for pulling the entire index down. Indeed, inflation in nearly every other major sub-group — fuel and light, housing, tobacco, and the miscellaneous category — was higher this October than last. The impact of the GST rate cuts has, so far, been seen only in the clothing and footwear category — the only one apart from food to see inflation lower than last year. All of this shows just how skewed the inflation measure is. Not only is it outdated, with the base year set as 2012, but the weightages are no longer accurate and more often obscure rather than clarify. The disconnect between the CPI and reality can perhaps best be shown by the fact that people the Reserve Bank of India (RBI) had surveyed in September had said that their perceived inflation rate was 7.4% — a far cry from what the CPI reported.The urgency behind the update is not just because of the vast gap between measured and perceived inflation. It is also because the RBI’s Monetary Policy Committee uses the CPI as its benchmark when deciding what to do with interest rates. Its next meeting is in December and it will have to decide whether to keep rates unchanged or to cut them. It will have to contend with growth data clouded by the temporary impact of the GST rate cut-related demand boost. Having to also parse through inflation data beset by statistical anomalies will only make accurate policymaking that much harder. The Ministry of Statistics and Programme Implementation has said that the new series of the CPI will be ready by the first quarter of the next financial year. The sooner it happens, the better. Published - November 14, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        inflation and deflation\n                    \n                            /                      \n                        \n                        food\n                    \n                            /                      \n                        \n                        beverages\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        housing and urban planning\n                    \n                            /                      \n                        \n                        tobacco\n                    \n                            /                      \n                        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "Urgent update: On the India’s Consumer Price Index",
        "headline_2": "India needs to revise its Consumer Price Index urgently",
        "link": "https://www.thehindu.com/opinion/editorial/urgent-update-on-the-indias-consumer-price-index/article70275572.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "14-11-2025"
    },
    {
        "full_article": "For Ahmed al-Sharaa, the founder of al-Qaeda’s Syria branch, and now the President of Syria, his recent visit to the White House has marked a remarkable turnaround in his career. From commanding an outfit responsible for suicide bombings and targeted killings, and carrying a $10 million bounty on his head, Mr. Sharaa, who until recently was known as Abu Mohammed al-Golani, is now a very close partner of Washington. After their meeting, U.S. President Donald Trump said that he “gets along with him”. In December, only weeks after Mr. Sharaa’s Hayat Tahrir al-Sham (HTS) toppled the secular Ba’athist regime of President Bashar al-Assad and seized Damascus, the U.S. lifted the bounty on the former jihadist commander. Earlier this week, Mr. Trump granted Syria wide exemptions on sanctions, and pressed Congress to repeal a 2019 law that imposed harsh penalties on the country, while Syria promised to join the war against the Islamic State. Mr. Sharaa has also signalled his desire to improve ties with Israel, America’s closest ally in West Asia, even as Israel grabbed more Syrian territories in the Golan region after Mr. Assad’s fall. Reports suggest the U.S. is preparing its presence at an airbase in Damascus as it brokers a Syria-Israel security pact. The message is clear: Syria, under Mr. Sharaa, seeks entry into the U.S.-led regional order, and Washington is reciprocating enthusiastically.While allowing a country of 25 million people battered by western sanctions, foreign interventions and civil war, to join the regional economic mainstream is welcome, what troubles many is Mr. Sharaa’s not-so-distant past. He was Abu Bakr al-Baghdadi’s choice to open al-Qaeda’s Syria branch. He split with Baghdadi when the latter founded the Islamic State in the early 2010s, and remained loyal to Ayman al-Zawahiri’s al-Qaeda. Mr. Sharaa began to distance himself from al-Qaeda only after his forces captured Idlib, which became the hub of anti-Assad factions. As the ruler of Idlib, he maintained close ties with Türkiye. In November 2024, his HTS launched a rapid offensive against the Syrian army, which was badly hurt by Israeli bombings, and captured Damascus. Soon after, he was embraced by regional and western governments alike. While Mr. Sharaa has promised to build an inclusive Syria, the country has witnessed at least two massacres against minorities — against Alawites and the Druze. His attempts to centralise power through sham elections have deepened sectarian divides. Transnational jihadists within the HTS continue to operate freely. But the U.S., once vocally concerned about the human rights situation in Syria under Mr. Assad, appears to have given a free pass to Mr. Sharaa. If he is rehabilitated without accountability for his past and scrutiny of his present rule, Syria’s wounds will remain unhealed, keeping it on the brink for years to come. Published - November 14, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Syria\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        economic sanction\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        human rights",
        "headline_1": "Amoral embrace: On the U.S. and the Syrian President",
        "headline_2": "The U.S. appears to have given a free pass to Sharaa in Syria",
        "link": "https://www.thehindu.com/opinion/editorial/amoral-embrace-on-the-us-and-the-syrian-president/article70275607.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "14-11-2025"
    },
    {
        "full_article": "Islamabad blaming India and Afghanistan for terrorism on its own soil is laughable\nPakistan continues to live in a state of delusion. After a suicide bombing outside an Islamabad court claimed the lives of 12 people, Shehbaz Sharif quickly pointed fingers at India and Afghanistan. Needless to say, this is laughable and a poorly disguised attempt at defecting blame from Pakistan’s own failings. For a country that practically wrote the playbook on maintaining double standards on terrorism – nurturing terror purveyors while claiming to be victims of terrorism – it’s rich that it now tries to implicate others for its own sins. \nThere was time in the 1950s and 60s that Pakistan was being studied by foreign experts as a possible South Asian success story. But the disastrous measures of its leadership in 1971 in response to the liberation movement in what was then East Pakistan – now Bangladesh – served a body-blow to the very idea of Pakistan. Today, it continues similar colonial policies in Balochistan, provoking a powerful movement against Islamabad’s exploitation. During the Soviet-Afghan war, Pakistan hosted tens of thousands of mujahideen fighters to curry favour with US. Pakistani Taliban is their progeny. Recall also, it was merely a 100km from Islamabad in Abbottabad that bin Laden was found holed up.\nPakistan thinks it can play all sides and be friends with both US and China, turning to each whenever it needs to be bailed out. But it forgets that national strength stems from skilled people, institutions and economy. All three failed to develop because its military had other priorities. Today, Pakistan is a military dictatorship masquerading as a civilian regime. And with the 27th constitutional amendment – which gives lifetime immunity to Asim Munir – about to be passed, even the fig leaf of a hybrid regime is coming off. The question is how long Pakistan’s delusions can last in the face of its polycrises.    \n\n",
        "headline_1": "Joke’s On Pak",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/jokes-on-pak/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-11-2025"
    },
    {
        "full_article": "He sounds keen on a trade deal now, but it’s in India’s interest to wait for US Supreme Court order on his tariffs \nAfter delays, disappointments and a brief falling out, the India-US trade deal seems around the corner. Trump’s said it’s “pretty close”. Commerce minister Piyush Goyal sees it happening “any day” now, even “tomorrow”. For India, it won’t be a day too soon because $40bn worth of labour-intensive exports have been at stake ever since Trump imposed a punitive tariff on India in late Aug. US equally needs a deal to access Indian markets, and ensure the India-China thaw – forced by its own rigid stand on Russian energy – does not hurt its strategic interests. \nThe deal has to happen. Not because Trump considers India an “amazing country”, but because it is a nation of “actually, 1.5bn people”, where he expects his new ambassador, Sergio Gor, to “promote investments in key industries and technologies, increase American energy exports and expand our security cooperation”. Clearly, US needs India as much as India needs it. After his petulant “dead economy” jibe in July, Trump got real about India. By early Sept, he was looking forward to “speaking with my very good friend, Prime Minister Modi”. Birthday wishes, Diwali greetings, and thanks for “support on ending the War between Russia and Ukraine” followed.\nThere have been five rounds of trade negotiations meanwhile, and it looks like there’s nothing left to iron out now. For India, this resolution is commendable because not once – unlike UK, Japan, Korea, etc – did it rush to plead its case, and pump up Trump. It refused to bend under the burden of his 50% tariff, and as Goyal said, has refused to “compromise the interests of farmers, dairy and workers”. Likewise, Trump is satisfied that India has “very substantially” cut back its purchase of Russian energy. Bloomberg recently reported that five big Indian refiners have not ordered any Russian oil for Dec. That gives Trump his off ramp to slash tariff on India.\nThe stage is set then, but India shouldn’t sign the deal before Trump waives the penal tariff. When it goes, the balance 25% tariff would still be disadvantageous for India, vis-à-vis Vietnam, Malaysia, Cambodia and China, which enjoys unmatched economies of scale. Having been so patient for so long, India should aim for a 15% rate. There’s no need to rush because if US Supreme Court strikes down Trump’s tariffs in the coming weeks, the pre-Trump average US tariff of 3.3% would be far more advantageous than any deal.\n\n",
        "headline_1": "Trump’s Dealemma",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/trumps-dealemma/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-11-2025"
    },
    {
        "full_article": "New weapons of ‘mass’ destruction\nThere was much buzz last week over weight-reducing drug Mounjaro becoming No. 1 pharma brand, outselling infection-reducing Augmentin. This not only knocks inches off its exultant users but now made its manufacturer Eli Lilly inch past GSK. Its India partner for this is legendary KA Hamied’s Cipla, which till now was best known for knocking the bottom off Big Pharma. In fact, the multinationals lobby was rumoured to have deprived Cipla’s scientists of the Nobel it could well have won for its pathbreaking anti-retroviral HIV-AIDS therapies. Ah well, good to know it’s gone viral by now coming to the aid of those immuno-deficient against other appetites.\nWhat’s getting eyes popping and jaws dropping is the speed at which this WRD is mopping off competition. Its Sept sales jumped 42% higher than Aug’s. That’s when it gave a severe gastric attack to antacid Pan to become No. 2 in India. Should we call it Mounting KiliMounjaro?  Unlike Africa’s long-dormant highest peak, it has def created a volcanic disruption. \nOk, regardless of the belching lava (and not just from antacidwallas), isn’t the news about a WRD ousting an antibiotic something to celebrate? It suggests that more people are worried about the effect of burgers than of bacteria. C’mon, what’s not to hurrah about that?  \nLet’s take our Insta divas – and who isn’t, since everyone is on non-candid camera? If they’re swagging about with the give-away shriveled, hollow-cheeked look once reserved for those seriously afflicted, I’d say weight-reduction drugs are a great leveller. A social one especially, since going to bed hungry has leapt from dire necessity to lifestyle choice.\nAugmentin sales were augmented by its combinations which helped combat several multidrug-resistant (MDR) bacteria. Now along comes this aura-exuding WRD offering multicuisine resistance. ‘Gimme more!’ say the hip and hyped, ‘so I can eat less of more.’ And get a flat tummy without big-bucks tuck. Wow!\nThe icing on the chocolate cake is that it reduces blood sugar as well. Diet and diabetes tackled in one swallow. \nBtw, a major side-effect is heartburn/acid reflux. Revenge of the ousted antacids?\n                                                *** \nAlec Smart said: “The Hippocrates oath has been doctored – cynically.”\n\n",
        "headline_1": "Fat-checking",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/fat-checking/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-11-2025"
    },
    {
        "full_article": "One, security forces have busted many Islamist terror networks, arresting 80-plus this year. Two, no counterintelligence is foolproof. Three, Pakistan’s jihad puppeteers may again look to create mayhem in India outside Kashmir. Four, this tactic gets a boost from Pak-Bangla cosying up. Five, India’s agencies will know that risk of Islamist terrorism will likely grow\nWhile there is a storm of speculation, particularly on social media, very little has been authoritatively disclosed with regard to the explosion in the Red Fort Metro Station parking lot on November 10, which killed at least 13, and injured another 30.\nA case under sections of the Unlawful Activities Prevention Act and the Arms Act, as well as the Bharatiya Nyaya Sanhita, has been registered.\n\nIt is clear that the Red Fort blast is being treated as an act of terrorism and the PM has described it as a “conspiracy”, declaring, “Theconspirators behind this will not be spared. All those responsible will be brought to justice.”\nSimilar sentiments have been echoed by ministers for defence and home.\nRead the full story on TOI+.\n\n",
        "headline_1": "Warnings from Red Fort",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/warnings-from-red-fort/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 14, 2025 00:00:00  \nThat Bangladesh's agro-processing industry remains mired in layers of regulatory hurdles is no secret. The sector, despite its immense potential to drive export growth, rural employment, and value addition to agricultural produce, continues to struggle with a host of compliance challenges. Exporters must navigate a maze of stringent and often inconsistent standards that vary not only across products but also from one destination market to another. Yet, as a recent FE report reveals, the challenges at home-those involving domestic regulatory compliance-are no less daunting.\nAt a press meet earlier this week, industry leaders voiced strong frustration over what they described as a \"web of regulatory tangles,\" high testing costs, and poor coordination among government agencies. They argued that the cumbersome procedures and overlapping jurisdictions have slowed the sector's progress and deterred potential investors. At the core of the problem lies the need to deal with multiple regulatory bodies-each with its own mandates, paperwork, and approval requirements. The Bangladesh Standards and Testing Institution (BSTI), the Directorate of National Consumer Rights Protection, the Bangladesh Competition Commission and the Bangladesh Food Safety Authority are all involved with regulation of various aspects of the industry. However, the coordination among them remains weak, resulting in duplication of work, contradictory instructions and unnecessary delays. Industry insiders contend that such inefficiency not only inflates production costs but also undermines competitiveness in both domestic and international markets.\nAmong the regulators, BSTI has come under particular criticism. As the country's sole standards authority, it plays a vital role in certifying quality and ensuring product compliance. Yet, businesses complain that its inspection and certification charges are excessively high and that separate approvals are required for products differing only in weight or packaging. Such bureaucratic rigidity has made BSTI certification prohibitively expensive, especially for small and medium enterprises. While BSTI conducts about 160 laboratory tests, many exporters still have to send samples abroad for specialised analyses, leading to additional costs and delays. Industry stakeholders have, therefore, urged the government to consider the establishment of a unified, modern regulatory authority-one that could integrate testing, certification and food safety oversight under a single umbrella, akin to the U.S. Food and Drug Administration (FDA). Such consolidation, they argue, would minimise duplication, enhance efficiency and ensure greater accountability.\nTesting and certification are indeed indispensable for the credibility of Bangladesh's agro-exports, particularly in markets with stringent food safety and quality standards. But without an enabling domestic regulatory environment, the sector's potential cannot be fully realised. The government's role, therefore, should not be limited to regulation alone--- it must also facilitate compliance through streamlined procedures, cost-effective testing and robust institutional coordination. If the long-standing bottlenecks are addressed with sincerity, Bangladesh's agro-processing industry could emerge as a major front of export diversification. Easing regulatory burdens is thus not merely a matter of convenience but also a prerequisite for unlocking one of the country's most promising engines of sustainable growth.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Need for a unified  agro-processing regulatory body",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/need-for-a-unified-agro-processing-regulatory-body-1763044035",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       November 14, 2025 00:00:00  \nBangladesh's graduation from its least developed country (LDC) status to a developing nation has become highly contentious. While the interim government is in favour of maintaining the timeline for the graduation scheduled for November, 2026, the private sector opposes such a move arguing that the country is ill prepared to embrace the proposed transition. Businesses which keep the wheels of the country's economy running have instead sought a deferral of the graduation by five to six years.\nThe government side's argument, as presented by commerce secretary Mahbubur Rahman at a seminar titled \"LDC Graduation: Challenges and Prospects\" organised by the Bangladesh-Malaysia Chamber of Commerce and Industry (BMCCI), is that the administration is working on minimising the trade-related shocks. He explains that the government is 'taking steps to secure trade privileges and ensure a smooth transition after 2026\". This sounds more like customary official jargon. In fact, the challenges facing the country in the post-graduation time are crucial issues to be addressed. \nIt appears that the commerce secretary banks on the generalised system of preferences (GSP) the country's trade partners will grant for three more years after the graduation. He should be aware of the fact that the USA, the single largest destination of the number one exportable from Bangladesh, readymade garment that is, has not granted this trade privilege. But he argues that the European Union, the largest market of apparel from this country, will continue to offer duty-free access until 2029. The EU market accounts for around 45 per cent of export from Bangladesh. Currently, the country enjoys similar trade privileges with 38 countries. But the key trade partners like the UK, Japan, Canada and Australia, besides the EU, have confirmed the three-year LDC preferences for Bangladesh until 2029. South Korea and China also offer different forms of preferential access to Bangladesh's commodities. All these importing nations together account for 90 per cent of this country's exports. \n So the crucial point here is, if Bangladesh can manage to be competitive enough in the three-year grace period on the global market and justify its transition to a developing nation. At a meeting with the three-member top-level United Nations (UN) team in the UN House in Gulshan on Sunday last, business leaders in the country state point blank that the country is far from being ready for the transition. The country's macroeconomic stress, high bank interest rates, inflated or distorted growth data under the deposed government, years of loan scams, fallouts of the pandemic and Russia-Ukraine war do not quite allow it at this stage to qualify for a smooth transition to a sustainable developing nation. An underprepared country runs the risk of falling into the middle-income or vulnerability trap or, worse still, witnessing reversal of progress. Development stagnation that a lack of preparedness leads to is the last thing this nation will find desirable. But any scenario of reversal of progress will be a national disaster and disgrace. Even after the takeover by the interim government, it has failed to sufficiently address the country's endemic problems like the official corruption culture, fiscal mismanagement and promotion of elitism at the cost of common people's right to equity. \nThe country's fractious politics has led to an uncertainty about the underprivileged segment's integration into mainstream society. The current row over the July Declaration has further exposed the rift between the privileged and the underprivileged classes and social stability. The sign is clear now that the July-August uprising is heading for yet another failure to the distress of the depraved and deprived citizens of this country. Once again, it is likely to miss the opportunity for narrowing down the gap between the poor and the rich, the underprivileged and the privileged. \nThe internal socio-economic inequality and disparities will make the graduation to a developing country meaningless. This will continue to undermine any progress because of the accumulation of wealth by a few at the cost of the majority of the people's interests. The business leaders can bargain for their interests and as a result the UN delegation has asked them to prepare a roadmap of a smooth transition strategy (STS) in case of a deferment. It is against this backdrop, the voice of the underprivileged section remains silent and unheard. But had they also been active participants in the development process, the country did not have to hesitate about the scheduled graduation. The free-market economy is more about macroeconomic flourishing rather than collective prosperity of the people. \nNow the ball is in the court of businesspeople who will have to devise a strategy for STS---one that is convincing enough to justify a deferral to another UN delegation to visit Bangladesh in mid-January next year for the final evaluation of the ground reality. Delayed or not, it is immaterial to the poor and the marginal people who are unlikely to benefit from macroeconomic progress. The trickle-down benefits that reach these underprivileged segments are eroded by rising inflation. No political party including the National Citizen Party (NCP) has espoused the agenda of the underclass's fair share of opportunities and wealth. This indifference to their cause is crystal clear. Graduation from the LDC to the status of a developing nation bypassing a significant proportion of the people will thus hardly make sense and bring peace and stability to society.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "LDC graduation no guarantee  for socio-economic justice",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ldc-graduation-no-guarantee-for-socio-economic-justice-1763044068",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       November 14, 2025 00:00:00  \nTens of thousands of Bangladeshis fly abroad every year not for leisure or business, but for treatment. From India to Thailand or Singapore or even the United States, hospitals have become familiar destinations for Bangladeshi patients seeking quality healthcare. For the affluent, a check-up or surgery in Thailand or Singapore is routine while for the middle class, India is the 'go-to' option. According to official data, patients from Bangladesh spend around $400-500 million annually on medical treatment abroad. Unofficial estimates suggest the actual amount may be double the official figure. This unusual outflow of patients occurs despite remarkable progress in Bangladesh's medical education and healthcare. Over the past three decades, the country has seen a boom in medical education. The number of medical and dental colleges is around 150, with the majority of them privately run. These institutions produce a large number of doctors every year and attract thousands of foreign students, particularly from Nepal and India. Alongside these, Bangladesh boasts quite a number of doctors famed globally for their skills as well as some modern health facilities, mostly in the private sector. Despite these, a large number of patients continue to mistrust domestic healthcare. The reasons are not equipment, facilities or treatment success rates. At the heart of this mistrust lies doctors' behaviour with the patients. Complaints are common that doctors spend very short time - in some cases a few seconds - during consultations, barely listening to concerns in detail. According to studies, doctors spend 48 seconds per patient on an average in Bangladesh against 10-20 minutes in Singapore. Many patients also complain about doctors ignoring their issues, scolding them or dismissing them without proper explanation. By doing this, doctors deny the fact that the patient is the most important part of the treatment process. This behaviour leaves patients feeling unheard and dissatisfied even when the prescription is medically correct.\nOn the contrary, a patient visiting a doctor in Thailand, India's Chennai or Singapore often returns with a completely different experience - full of satisfaction. Doctors there spend adequate time with patients, listening to them, discussing the symptoms thoroughly and explaining test results clearly. Our doctors ignore the fact that small gestures like a smile or a bit of patience have great therapeutic value. It is no exaggeration to say that a patient gets half cured by a doctor's kind behaviour.\nThe trust issue in Bangladesh healthcare system begins much earlier - in the classrooms of medical colleges. The medical education system here lacks a focus on communication with patients. Medical curricula are full of clinical and theoretical contents but they keep little room for modules on doctor-patient communication and empathy. What medical students find in their curricula about patient communication is just a brief mention in forensic or community medicine. They spend several years mastering anatomy and pharmacology but receive almost no guidance on how to communicate with patients, how to deliver bad news, or handle emotional patients. Inefficiency and indifference in communication emotionally disconnects doctors with their patients. Thus mistrust grows.\nBangladesh requires reform on multiple fronts - education, regulation and professional culture - to get over this problem. The medical education regulator, Bangladesh Medical and Dental Council and the statutory professional membership body, Bangladesh College of Physicians and Surgeons should introduce mandatory courses on communication, empathy and ethics across all stages of medical training. Hospitals should establish systems to monitor patient experience and provide feedback no matter whether they are public or private. Doctors who demonstrate good communication should be recognised and rewarded. They should be friendly and still command respect. Awareness campaigns should be launched for developing understanding between them. Above all, everyone concerned needs to keep in mind medicine is not only a science, it is an act of humanity too.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Empathy missing  from healthcare",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/empathy-missing-from-healthcare-1763044100",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 14, 2025 00:00:00  \n\nBabies are the future of our nation and their proper care must be a priority. A crucial part of this care is ensuring they consume healthy foods. Today, however, unhealthy baby foods-such as formula with additives, chips, chocolates, juices and other sugary or processed items-are everywhere, attracting children's attention and displacing nutritious options.\nThese products are easily accessible, with multiple shops offering them near homes. When children see these foods, they often insist on having them, and if parents refuse, tantrums and crying usually compel adults to give in. Consequently, children consume items laden with chemicals, artificial colours and harmful ingredients, which can cause sickness and, in severe cases, serious health complications, even death.\nIf we are to ensure the proper growth and development of our children, providing nutritious, safe food is essential. Unhealthy baby foods must be avoided at all costs. The government, non-governmental organisations, and concerned citizens must raise their voices against companies producing such harmful products. Strong legal action and effective measures should be taken to eliminate these items from the market and safeguard our children's health.\nMuhammad Al Amin\nsajalamin589@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Adulteration of baby food",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/adulteration-of-baby-food-1763044189",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-11-2025"
    }
]