[
    {
        "full_article": "Neither the government nor the RBI will likely be alarmed by the rise in retail inflation in August 2025, even though it snapped a nine-month streak of declining inflation rates. At 2.1%, it is just marginally within the RBI’s comfort band of 2%-6%, with no real macroeconomic risk. The government would be glad to see food inflation remaining subdued at the urban and rural levels. Especially heartening would have been the 15.9% and 14.5% contraction in the prices of vegetables and pulses, respectively. When combined with the free foodgrains provision under the National Food Security Act, this downward movement in food prices ensures affordable supplies of these necessities. Other necessities, such as clothing and footwear, housing, and fuel and light, are all seeing inflation remain low, and lower in August than in July. As things stand, India’s macroeconomic outlook looks the exact opposite of what it was last year. From a relatively low growth, high inflation scenario, India is now witnessing high growth and low inflation. In other words, the differential between growth and inflation at this time last year was about 2.1 percentage points. This year, it is about 5.5 percentage points, a welcome and large gap. Of course, there are legitimate questions to be asked about GDP and inflation data, but those questions were valid last year as well, and so do not erode the comparability of the two years.Looking ahead, the overall outlook for inflation continues to appear benign. Even if India decides to accede to the U.S.’s demands and abandon its purchase of Russian oil, the economic impact is likely to be limited. Global crude prices are relatively low, and so the discount Russia is able to provide is not as attractive as it was in 2022. The cost increase of switching to other countries for oil is, therefore, likely to be limited. As a result, the impact on inflation within India is also likely to be limited, if such an eventuality comes to pass. On the other hand, the new GST rates will come into effect from September 22. With most prices set to come down due to their rates being cut, the impact on the inflation rate is also going to be in the same direction. The low inflation rate and high growth in Q1 have raised expectations that the RBI’s Monetary Policy Committee will cut interest rates further in its next meeting at the end of September. However, given the ongoing global uncertainties, this might be premature. Depending on how the renewed bonhomie between India and the U.S. progresses, a rate cut in December is the more likely outcome.\r Published - September 15, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        government\n                    \n                            /                      \n                        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        inflation and deflation\n                    \n                            /                      \n                        \n                        macro economics\n                    \n                            /                      \n                        \n                        food\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        population\n                    \n                            /                      \n                        \n                        prices\n                    \n                            /                      \n                        \n                        footwear\n                    \n                            /                      \n                        \n                        habitat and housing\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        taxes and duties",
        "headline_1": "Improving macros: On the outlook for inflation",
        "headline_2": "India seems set for a period of low inflation and relatively high growth",
        "link": "https://www.thehindu.com/opinion/editorial/improving-macros-on-the-outlook-for-inflation/article70048567.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "15-09-2025"
    },
    {
        "full_article": "The recent survey of saltwater crocodiles in the Sundarban Biosphere Reserve is a notable advance for conservation in India. The census indicates a rise in overall numbers and demographic diversity, implying an ecological success that is also a marker of how wildlife law and conservation policy are gradually moving beyond their fixation on a handful of charismatic species, including the tiger and the elephant. In the early years of the Wildlife (Protection) Act 1972, protection was disproportionately directed at megafauna whose appeal could mobilise public opinion. Saltwater crocodiles do not command the same affection, so their recovery demonstrates how the statutory framework, when coupled with targeted interventions such as the Bhagabatpur Crocodile Project, can yield durable gains even for less prominent species. In many countries, reptiles continue to receive weaker safeguards, often subordinated to fisheries or land-use concerns. The increase in Sundarban crocodiles suggests that India’s model of combining blanket legal protection with site-specific captive breeding and release programmes has been effective. But in absolute terms, the law still has gaps: it does not adequately anticipate emerging threats linked to climate change, rising salinity or habitat fragmentation. Protection has also been reactive.As hypercarnivorous apex predators, crocodiles regulate prey populations and remove carcasses from water channels, contributing to the health of mangroves. Thus, their presence signals that creeks and rivers still sustain a functioning food web despite immense pressures from human settlement, cyclones and sea-level rise. Better juvenile survival also indicates that the breeding habitat retains sufficient quality. This is an important ecological marker for the delta, where rising salinity and erosion are narrowing the niches available to wildlife. If the crocodile population can establish a stable age structure, it may bolster the resilience of the Sundarbans’ mangrove networks. The species’ trajectory also highlights what can be done for other neglected ones. Current Schedules under the Act should be accompanied by proactive, well-funded recovery plans, and public communication strategies need to be recalibrated. The crocodiles did not gain numbers because they became beloved but because conservation agencies invested in their protection. A similar shift in focus can support other species. Climate change integration is also essential. Saltwater crocodiles tolerate wide salinity ranges but many amphibians or freshwater reptiles do not. Anticipatory measures including identifying climate refugia and enabling assisted breeding are thus required. The recovery illustrates that non-charismatic species can benefit from law and policy with sustained attention. For India, the lesson is that a richer, more inclusive, vision of conservation is possible and necessary.\r Published - September 15, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        animal\n                    \n                            /                      \n                        \n                        conservation\n                    \n                            /                      \n                        \n                        West Bengal\n                    \n                            /                      \n                        \n                        rivers\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        climate change\n                    \n                            /                      \n                        \n                        cyclones",
        "headline_1": "Sliver of hope: On survey of saltwater crocodiles, conservation",
        "headline_2": "An inclusive vision of conservation can protect more habitats",
        "link": "https://www.thehindu.com/opinion/editorial/sliver-of-hope-on-survey-of-saltwater-crocodiles-conservation/article70048575.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "15-09-2025"
    },
    {
        "full_article": "Manipur’s many groups and points of view will need long and patient hearing from GOI\nModi’s much-awaited visit to Manipur – in spite of torrential rainfall in the region that grounded his chopper, forcing him to take the road through the heart of territories that had seen massive ethnic strife – certainly lifted spirits in the state. The two-and-a-half-year-long conflict has led to a near-total separation of Manipur’s hills and valley, and President’s Rule since Feb this year. During this period, both communities at the centre of the ethnic conflict have seen armed groups spring up to defend their respective villages and people. There is massive distrust in Manipur police, and calls for a separate administration for the hill areas. \nAll of this is to say that Centre is facing a hugely complicated challenge in Manipur and there are no easy solutions. While many contend that Modi should have visited earlier, it is unclear if that would have changed anything on the ground. With President’s Rule now, at least violence in the state has ebbed. Against this backdrop, Modi’s pitch for development and dialogue as the way forward is well-timed. \nThat said, bridging divisions won’t be easy. The valley’s Meitei community is dead against any division of the state, while the Kuki-Zos in the hills can no longer envisage living under one roof. Then there are myriad civil society and armed groups with different opinions within the two communities. For example, just before Modi’s visit, Centre inked an updated suspension of operations (SoO) agreement with two Kuki-Zo groups. One key takeaway of the deal is maintaining territorial integrity of Manipur. However, other Kuki-Zo groups want a separate administration. And during Modi’s visit, 10 Kuki-Zo MLAs including seven from BJP, appealed for a separate UT with a legislature for the hills. \nMeanwhile, the umbrella Meitei organisation COCOMI slammed the new SoO for legitimising armed Kuki-Zo groups. Plus, there are other Meitei groups that are unhappy that Centre hasn’t reached out to them. Given this scenario, progress in Manipur will be slow. But wider dialogue is the only way forward. All options should be on the table. True, Manipur being a border state complicates matters. And foreign inimical forces will look to fish in troubled waters. Therefore, some high degree of autonomy for the hills within the framework of Manipur state could be a way forward. Modi’s visit should galvanise both the state administration and Centre to redouble their efforts to find a widely acceptable solution. \n\n",
        "headline_1": "Keep talking",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/keep-talking/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-09-2025"
    },
    {
        "full_article": "On preserving the multi-lingua franca of Bengaluru\nCities speak. Some in a single tongue, others in several. Bengaluru has always belonged to the second kind. I’m a thoroughbred Bengalurean. My mother, her parents, and theirs were born here. Kannada is our mother tongue. But growing up here, you’d often hear a sentence begin in Kannada, twist into Tamil, borrow a phrase from Telugu or Marathi, and end in English. \nThe 2011 Census ranked Bengaluru as India’s most linguistically diverse city, with 107 languages spoken. That multilingual rhythm is now fading, the ease with which the city once switched tongues is weakening. Conversations feel narrower, people notice more when the ‘wrong’ language is spoken, and a quiet tension has crept in.\nOne factor driving this change is the growing dominance of Hindi. Migration from the north has brought energy and diversity, but what troubles long-time residents is the assumption that Bengaluru must adapt to one language to make others feel at home. Apps built here now greet customers in Hindi first, as if the city’s older polyphony never existed.\nA second factor is the sharper assertion of exclusivity by some pro-Kannada groups. Their concern is rooted in a real anxiety: Kannada has often been sidelined in its own capital. Protecting the language is vital but Bengaluru was never about uniformity. It was about accommodation. Whether you came from Ballari or Bhubaneswar, Bhopal or Bahrain, you belonged by adding your words to the mix. Kannada anchored the city, English offered a bridge, and other languages found space without permission or apology.\nThis multilingualism came from history – a British cantonment culture, old trade routes, dynasties that crossed linguistic borders, families that lived across them. It created a civic culture of listening – you might not know every tongue, but you learnt to catch tone, rhythm, intent. That gift is now under strain. Schools fine children for speaking ‘wrong’ languages, offices drift toward linguistic silos, neighbourhood groups default to one tongue. If this continues, the city risks losing not just diversity but imagination. \nThe way forward is not to choose sides but to practise plurality. Strengthen Kannada with pride, but also show up for Tamil theatre, Telugu cinema, Urdu poetry, Malayalam literature. Switch languages mid-sentence if the moment allows. Resist imposition and resist exclusion. Because Bengaluru’s strength has never been in speaking one language, it has been in making room for many. If the city forgets this, it forgets itself.\n\n",
        "headline_1": "Don’t Mind Your Language",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/tell-tale/dont-mind-your-language/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-09-2025"
    },
    {
        "full_article": "…Why can’t we? TOI’s Christie-in-India story is a reminder how we do disservice to India’s vernacular crime fiction \nAgatha Christie’s fiction gives one a sense that she travelled lots. And she did. For example, in her girlhood she summered in the south of France, her debutante ‘coming out’ was in Egypt, she learnt surfing in Hawaii, and was a frequent traveller on the fabled Orient Express. And yet, despite her legions of fans in India, until it was revealed in TOI yesterday, we did not know that she had travelled here too, not once but twice. Her correspondence from those 1960 and 1961 journeys, suggests an eagerness to explore our country and an appreciation of its scenic beauty. This in turn brings us to thinking about how widely the crime novel has travelled since – and how much the Indian crime novel hasn’t. \nSharadindu Bandyopadhyay’s Byomkesh Bakshi and Satyajit Ray’s Feluda are rare for having been able to have travelled widely outside their original Bengali. More common is the fate of Surender Mohan Pathak, who has been prolifically authoring Hindi-language detective novels since the 1960s, but has begun to be available to Anglophone audiences only recently. Occasionally vernacular pulp fiction is bunged into anthologies, which have zero mass appeal. \nUpon translation, crime fiction travels remarkably well across cultures. Because of its shared core elements. Readers follow clues, make deductions, sort the puzzle of human motivation, curiosity mixed with fear – the logic of investigation functions as a sort of universal language. But the authors who can be found at airport lounges across the world – such as Keigo Higashino from Japan, Henning Mankell of Sweden, Fred Vargas from France – did not get there on their own tongue. They are easily found across the big city bookshops of India too, sitting alongside Indian authors who write in English. Indian authors who don’t write in English are MIA even in their own airports, despite mass popularity. But the crores of copies they have already sold is a good clue that translating and marketing will hit the target.\n\n",
        "headline_1": "THEYDUNNIT…",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/theydunnit/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-09-2025"
    },
    {
        "full_article": "Unexpected but true: Mumbai’s elite have a new passion, and it’s called mahjong! Living rooms and club lounges from Chembur to Churchgate echo with the clack-clack-clack of 144 tiles shuffling — a sound that has decisively dethroned the genteel clinking of silver tea services and the buzz of kitty parties. Forget idle gossip or the thrill of a Prada bag, the new badge of honour is slamming a tile declaring mahjong with the drama of a Bollywood climax.\nWhat began as a curious pastime, a let’s-try-this diversion brought back from holidays in Singapore or Hong Kong a couple of years ago, has morphed into a full-blown, designer-clad, avocado-toast-fuelled obsession among women. Age and profession don’t matter; an entire gamut of elite, be it the ladies that lunch, Bollywood actors, young mothers and even a multitude of working professionals have been drawn into its orbit. The weapons? Hand-crafted tiles of bone or even jade and gold. The armour? Statement Cartier bangles that risk damage with every aggressive move. The battlefield? An impeccably polished mahogany table where social capital is won and lost.\nThe origins of mahjong are shrouded in mystery. Most historians agree the game was codified during China’s Qing dynasty in the 19th century. But the romantic legends are far more entertaining. Some say Confucius himself developed the game, its three main suits — Bamboos, Characters, and Circles — symbolised the virtues he admired. Others insist it was a clever invention of a bored concubine trying to win an emperor’s favour.\nBy the 1920s, it had become a roaring craze in America. Articles from the time fretted over ‘Mahjong Madness’ as a dangerous addiction, a seductive Oriental diversion that was causing women to ignore other obligations. A headline from a 1923 edition of The New York Times might as well have been written about today’s Mumbai: ‘Society Women Abandon Bridge for Mahjong; Fear New Game Will Cause Neglect of Homes’.\nIn India, it led a quieter life — in Kolkata’s Chinatown where it was played in smoky, neon-lit clubs over steaming bowls of hakka noodles and chilli pork; in army cantonments where wives wielded strategy with the same precision as their officer husbands; and among the well-heeled and internationally travelled Indian upper classes.\nBut like all fads, it faded till its dazzling revival in the last year when the contagion spread through Mumbai’s drawing rooms with a velocity of a viral meme. One season, it was the quirky thing your cousin from Singapore did. The next, it was ‘the’ thing to do. From its South Mumbai epicentre, the tremor is radiating outward. Pune’s leafy clubs have begun hosting mahjong tournaments alongside golf championships. Bengaluru’s tech-world wives are swapping startup talk for tile strategies. And this has even spread to the guarded farmhouses of Delhi.\nIn this new order, your status isn’t your last name. It’s your mahjong set. Starter sets made of lightweight plastic or bamboo tiles are treated with the same disdain as a fake Birkin. The intermediate player graduates to a weighty set of bone, the tiles clicking with a satisfying, authoritative tone. A lucky few have an ivory or a jade set in their collection. But the grand masters of this social game play on a different plane entirely. We are talking bespoke luxury sets crafted from malachite, inlaid with mother-of-pearl, and housed in leather cases that cost more than a family sedan. The latest additions are automatic, self-shuffling tables imported from China that whirr and hum, dealing perfect walls of tiles at the push of a button, effectively eliminating the one bit of manual labour of the afternoon.\nThe refreshments match the sophistication of the game. In Mumbai, it’s a parade of exotic hummus, truffle-infused arancini, sushi rolls crafted to look like miniature works of art, and gluten-free, sugar-free desserts that are photographed intensely before being nibbled. The peak of this foodie one-upmanship was a party where the cheese platter was meticulously carved into the shapes of the green and red dragon tiles. In Delhi, the approach is more robust: mini kebabs served on silver skewers, delicate kathi rolls, and paneer tikka. The conversation that flows around the game is fairly spicy —whose marriage is shaky, which builder is going bankrupt, which art gallery has the next big thing, and which doctor does the best non-surgical facelift.\nClearly, a social sport would not be complete without fashion. Mahjong afternoons are as much about Louis Vuitton bags, Patek Philippe watches, Hermes scarves and chic co-ords (coordinated sets for the uninitiated) as they are about tiles. Food, fashion and fortune now sit comfortably at the same table.\nEven the hallowed, tradition-steeped halls of the Willingdon Club, a bastion of bridge, badminton, and complex membership rules echoing with the sound of clattering tiles. One can almost hear past presidents muttering into their favourite drink, “We survived the British Raj, the permit era, and the new money, but by God, we couldn’t survive the mahjong mania!”\nAs it happens with any obsession, demand rapidly outpaces supply. So, mahjong instructors are more in demand than Bollywood fitness trainers and celebrity chefs, with wait lists stretching for months. These senseis of the tiles impart not just rules of the game but also its secret rhythms and advanced psychological warfare techniques. Their students form WhatsApp hives, buzzing at midnight with scoring queries and images of complex hands. The real bragging rights, however, belong to the circle that pools their resources to fly in a ‘Master’ from Macau or Hong Kong for a weekend retreat.\nFor some, the game itself is secondary. This provides them the oldest currency of all: access. An invitation to the ‘right’ mahjong table is the new-age equivalent of making the cut for a private yacht party in Monaco or an exclusive pre-wedding sangeet in Udaipur. The mahjong table is a sealed universe of four. To be one of those four is a tacit announcement that you are ‘in’. As one Mumbai hostess, a queen bee of the mahjong scene, confided with a wave of her bejewelled hand, “It’s not about the money, dahling. If you’re not at my table on a Thursday, frankly, you don’t exist.” Another Delhi socialite was even blunter: “Mahjong is the new membership committee. It tells you who’s rising, who’s falling, and who’s desperately trying to buy a set to get in.”\nThis has not gone unnoticed by astute brands. The opening of a high-end jewellery store in the city recently featured not a champagne fountain, but four mahjong tables. The lure was simple: “Play a hand, win a discount.”\nCuriously, men remain at the periphery of this revolution, retreating to their golf courses, poker games, and the new fad of padel. Perhaps the potent combination of intense strategy, endless gossip, and the requirement to sit still for three hours is a biological impossibility for the male species.\nSo why has this particular game, above all others, captured the collective imagination so completely?  The answer is simple: it combines skill, luck and endless conversation. It offers the thrill of competition without the brute force of sports. It’s sophisticated enough to feel exclusive, yet social enough to make new friends. Above all, it fits beautifully into the rhythm of modern social life: it takes time, attention, and provides the perfect excuse to meet three times a week without guilt. What’s there not to love?\nAnd in many ways, it mirrors our own journeys — from the ambition to build a winning hand, to the lessons of failures and missed chances, to the wisdom of patience and strategy, the exhilaration of seizing the right moment — and when all else fails, the quiet art of bluffing with confidence.\n \n\n",
        "headline_1": "The tile-high club: How mahjong became the hottest social currency",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-tile-high-club-how-mahjong-became-the-hottest-social-currency/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 15, 2025 00:00:00  \nThere is a pressing need for enhancing the Bangladesh Railway's (BR) capacity for both passenger and freight transport, but its continued poor performance, particularly in project implementation, remains deeply frustrating. According to a recent report in this daily, the BR has shelved numerous important projects for years after undertaking initial project implementation preparations and loan negotiations. The closure of the China-funded 200-metre-gauge coach procurement project after nine years is a glaring example. Another major project has been left in limbo after the BR procrastinated for nearly a decade over its implementation, prompting China to withdraw its funding. The BR is looking for new development partners for the project. Similarly, three India-funded projects intended to enhance track capacity have been on halt since last year's July-August political upheaval. Reportedly, these projects have been hamstrung by the wrong selection of funding agencies, a faulty tender process and inefficiency in project preparation by railway officials. Such dismal performance is not only crippling the much-needed expansion of its services, but also hampering day-to-day operations by delaying the supply of locomotives and carriages, as well as installation of tracks on different routes.\nWhile external factors have played a part in the delays, in most cases, project implementation is running aground mainly because of the railway's internal shortcomings. For instance, its tendering processes often face setbacks due to technical flaws in specifications. Recently, tender documents of many projects were brought under review following detection of technical problems in the initial drafts. But the question is, why cannot the specifications be made foolproof in the first place? Is this the result of internal manoeuvring by vested quarters? The practice of floating faulty specifications and then revising them reflects an elaborate saga of bureaucratic inefficiency and corruption, which further slows down progress. Surprisingly, no one is being held accountable for this faulty and erroneous tendering process. So, in many ways, the railway has created its own misery by failing to ensure good governance and accountability. This has allowed such malpractices to persist without consequence. \nFor a nation striving to modernise its transport infrastructure, such mismanagement of a vital service is totally unacceptable. It is the public who continue to suffer from poor and inadequate services of railway. Moreover, vast sums of taxpayers' money are being squandered by abandoning or shelving projects midway. Earlier, it was reported that BR authorities spent substantial amounts of funds on conducting feasibility studies for projects like bullet trains, electric trains, and circular railways, none of which have been implemented. For instance, Tk 1.0 billion was spent on the feasibility study of a bullet train on the Dhaka-Chittagong route, Tk 250 million on a circular railway around Dhaka, and Tk 3.22 billion on four proposed subways in Dhaka. After spending billions of Taka on those feasibility studies, the projects were shelved. The bungling bureaucracy should be held accountable for this.\nOver the years, numerous attempts have been made to modernise the railway, but poor planning, lack of commitment and the greed of those in charge have largely derailed the momentum. It is high time for the government to overhaul the railway and bring some much-needed discipline, transparency and accountability into it.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Clumsiness of railway in implementing projects",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/clumsiness-of-railway-in-implementing-projects-1757860989",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       September 15, 2025 00:00:00  \nThe Himalayan nation of Nepal is returning to relative normality after days of violent protests spearheaded by the Nepali youth, more particularly the Gen Z generation. It all started with a government's decision to ban 26 popular social media platforms on September 4. This triggered widespread street protests by Nepal's youths who were already irate over rising youth unemployment on the one hand and shameless display of pomp and power by the children of corrupt politicians and government bureaucrats (the so-called Nepo-kids) amid rampant corruption in the government offices. Within hours of the start of the violence on Monday last week it turned bloody as the government forces used every means at their disposal to quell the violent unrest. At a stage, they fired live ammunitions into the crowd of protesters leading to many deaths. So far, (till Saturday, September 13), 51 deaths and over 1,500 injuries have been reported. \nThe outraged protesters set fire to politicians' as well as ministers' residences, the parliament building, the supreme court building, headquarters of Nepal's Congress Party and the home of the former prime minister Sher Bahadur Deuba. Before the situation going beyond control, the Nepali armed forces intervened and called upon the protesters to engage in a dialogue to end the violence. Meanwhile, Nepal's prime minister KP Sharma Oli and his ministers resigned last Tuesday amid criticisms from home and abroad over the deaths of protesters.\nLater, in line with the protesters' demand, former Chief Justice of Nepal, Shushila Karki, has been sworn in as the country's prime minister of the interim government. Immediately after assuming office, Prime Minister Shushila Kaarki recommended dissolution of the House of Representatives. President Ramchandra Paudel approved of the move. He has also appealed to all political parties and citizens of the country for calm so the House of Representatives election could be held on March 5 next year. \nDo not the series of events that culminated in the change in the Nepal's government have a sense of déjà vu? Similar student unrests in July 2024 led to the collapse of the more than one and a half decades of old autocratic rule in Bangladesh, ouster of its prime minister Sheikh Hasina, who fled to India. In Bangladesh's case, too, the armed forces finally took the role of mediator to end the crisis that led to the formation of the interim government with Nobel Laureate Dr Muhammad Yunus at its head as Chief Adviser. In the bloody street protests that preceded the political changeover, more than 1,400 people died and nearly 15,000 were injured. However, the figures of death and injury may be still higher. Obviously, the street protesters of Bangladesh paid a heavier price than Nepal's in terms of the number of lives lost and the thousands of those who lost their vital organs like eyes, legs and hands. \nHow would political analysts describe these recent events involving Gen Z outrage in Bangladesh, Nepal and Indonesia? Clearly, in cases of Bangladesh and Nepal, the youths were disillusioned with the existing political order, and the disconnect between it (the political order) and the common people. In the case of Nepal, political unrests, like in Bangladesh, leading to mass uprisings are not new. The country's first uprising took place in 1990, which was called 'Jana Andolan'. The second such Jana Andolan happened in 2006 with the aim to overhaul the country's political system through reforms. Political stability has been the first casualty of the reform movements. The country meanwhile witnessed 14 governments in the last 15 years. \nBut no significant reforms or changes in the behaviour of the political class and bureaucracy which run the governments are evident. \nHence is this latest outburst of Nepali youths or its Gen Z. \nWhat next?\nIn fact, these youths of digital era can quickly organize themselves through the various social media networks. In the case of Nepal, the protesters used Discord, an online gaming platform to organize and choose their new prime minister Sushila Karki on September 12. The most prominent was a server on Discord termed, 'Youth Against Corruption'. At its peak the server reportedly drew more than 130,000 members. According to another report referring to the South China Morning Post, more than 7,714 ballots were cast in the final round on September 10 with Sushila Karki winning over 50 per cent votes. The next steps of her meeting the President, the Army Chief, General Ashok Raj Sigdel, ahead of her official appointment as the country's first female prime ministers followed. \nOne can see similar developments in Bangladesh following the July 2024 upsurge which started with protests against the discriminatory quota system in government jobs. As the police and members of the security force began to use disproportionate force to crush the movement, the students' movement turned into one of doing away with discrimination in society and finally the resignation of the prime minister.\nIn all the cases, the movements are spontaneous with no definite structure of leadership. As a result, at the end of the successful street struggles, the movement leaders again approach the same old political establishment for reforming the existing political order! Formation of an interim government and holding of a parliamentary election after some months is too familiar a formula for a change after all the blood spilled over the days or weeks in the case of Bangladesh. Obviously, these stop gap measures cannot bring any meaningful change in governance. The deeply entrenched interests still maintain a firm grip on the different organs of the political establishment. These youth or student movements are basically without clear-cut goals. These are unlike the October Revolution of 1917 in Russia that overthrew the centuries old monarchy, or the Chinese revolution of 1949 that said a goodbye to the old China ruled by feudal lords. Small wonder that those revolutions brought about radical changes in governance and society or in short, political order. However, the French Revolution that started in 1789 and continued till 1794 was spontaneous and very bloody. So, lacking well-defined leadership and political agenda to begin with, it is not hard to foresee what awaits in the long run. \nHowever, the Bangladesh case is somewhat different in that the students' street struggles could bring down a very powerful government with suspected foreign backing. \nSo, the people's expectations from the youths that led the struggle is no doubt higher. \nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Youth-led uprisings in Nepal and Bangladesh",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/youth-led-uprisings-in-nepal-and-bangladesh-1757861174",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       September 15, 2025 00:00:00  \nAt a different type of fair hosted by the Bangladesh Animal Welfare Association under the title, \"Animal and Life Fair\" held in the city, speakers waxed eloquent about the need for saving animals including the wildlife. So far as the principle goes, rights activists working for preserving the ecological system and forests in which the majority of animals live, have long been trying to reinforce the motto, \"Live and let live\". But a few nations have followed the principle to translate it into action. There is an indifferent and laid-back attitude on the part of government functionaries in most countries including Bangladesh towards saving the environment and ecological landscape. They are the power-wielders and take decisions contradictory to recommendations put forward by environmentalists and ecologists. \nFrom this point of view, the caged indigenous and exotic animals actually flag a mixed signal. Birds and animals which are beautiful in the lap of Nature ought not to be confined to a limited space because they fail to enjoy their freedom to roam about on their own volition in the deep forests and in the open sky. However, when rapacious human actions bring any species on to the verge of extinction, wildlife lovers and experts delve deep into scientific methods to breed it from near extinction. Notably, mindless destruction of animal habitats and rampant slaughter of some species have brought them to extinction. Yet some dedicated scientists have made a valiant attempt to successfully revive some rare animals from deoxyribonucleic acid (DNA) obtained from bones or skulls. \nSo this process of reviving, preserving and nurturing rare animals has no alternative. However, when people take some of these rare animals or birds as pets simply because they love those or out of fancy, they actually violate the wildlife's right to freedom. From the legal point of view, fulfilment of their desire to take wildlife as pet is egregious, notwithstanding the fact that they do everything possible for meting out the best of care and treatment to the birds and animals born with the spirit of freedom. \nTaking reptiles, tigers, lions or other exotic lives as pet also smacks of a kind of subtle pride as if the keepers consider themselves a distinguished class from the run of the mill in society. Thus the ethical and legal issues are neglected under the nose of law enforcement agencies. Here a criminal practice is also involved. This is smuggling of such animals carried out by a highly dangerous and extended international network. There are also poachers who maintain a close link with the chain of smugglers and take the dubious art to extraordinary levels. Individuals who look for rare animals have to negotiate and procure such animals. The clandestine business has been responsible for giving rise to an underworld empire where killing people or animals alike is the norm. \nSo, all is not well on the exhibition front of rare animals much as the rhetoric may try to suppress the ethical and legal concerns. In fact, animals, birds, reptiles and insects have as much right to live and thrive as human beings do. People tend to forget that they are actually making a disservice to the ones they take as pets and in the process commit a crime. \nThere is no provision for adopting or fostering some pets. It is because of the law of the land that the mobile courts and law enforcement agencies launch drive against the pet shops that are emerging fast at different points of the urban centres. However, such occasional drives are showier than making a target of achieving the stated objectives. Sadly, it is the educated and moneyed class which takes a fancy for procuring exotic birds and animals because they can afford it. Even in Bangladesh, the amount of money spent on such a pet is quite staggering. The feeding costs even for a cat or dog far outpace the total living costs of a lower middle class family. There is no alternative to launching an informed campaign for expressing an emotional attachment with wild animals in their habitats from afar instead of confining them to a cage at home.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The question of keeping exotic animals as pets",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-question-of-keeping-exotic-animals-as-pets-1757861224",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 15, 2025 00:00:00  \n\nBeyond garments and remittances, Bangladesh's economy is transforming, and startups are picking up steam. Young demography -- a population above 60 per cent under 35 years old -- coupled with 130 million mobile internet users is driving fast digital penetration. From fintech to e-commerce, entrepreneurs are solving domestic problems with solutions that are scalable.\nRecent capital raises for companies such as bKash, Pathao, and ShopUp are hopeful signs for increasing investor enthusiasm. But relative to India or Vietnam, capital injections are smaller. Voluminous regulations, payment hassles and unclear exits still repel most international investors.\nThe government has responded through the initiation of programmes like Startup Bangladesh Limited and ICT incubators. Simplification of policy and infrastructure beyond Dhaka are, however, vital for the success of the startups.\nBangladesh possesses a natural resource: a large domestic market and low business costs. Backed up by favorable investor reforms, improved logistics and increased regional integration, the country has the promise to be South Asia's future digital entrepreneurship hub.\nThe components are in place; action will determine if Bangladesh may transition from promise to potency within the regional startup ecosystem.\nMd Kamrul Ahsan Shamim\nStudent\nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Can Bangladesh become a startup hub?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/can-bangladesh-become-a-startup-hub-1757861239",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-09-2025"
    }
]