[
    {
        "full_article": "The introduction of an Automated Permanent Academic Account Registry (APAAR) ID by the Ministry of Education, to digitise the academic transcripts of every student, aims to ensure a “single source of truth” for all their records throughout their life in the academic ecosystem in India. Linked with Aadhaar, APAAR is far from the first such step towards a rapid digitisation of school records in India: since the implementation of the National Education Policy, 2020, education authorities have pushed the Unified District Information System for Education Plus (UDISE+) and the Student Database Management Information System. While these radically novel technocratic overhauls of record-keeping are one thing, the blatantly unlawful ways in which they are being pushed on parents and wielded as weapons at the State level are quite another. The description of APAAR as unlawful is no mere interpretation: the Education Ministry’s website is clear that the programme is not mandatory, with no law mandating its usage. But schools and district education administrators do not seem to be operating within that reality.In Uttar Pradesh and Karnataka, schools have been given an unambiguous target: 100% “saturation,” or complete enrolment of all students. In their fervour to attain this target, schools have warned parents of consequences in the event of non-enrolment, and State education authorities have rattled their sabres at religious minority institutions and even at fellow administrators, alleging a mismatch of enrolment data between APAAR and existing records. In the initial days of what has now been rechristened as Digital Public Infrastructure (DPI), the government had similarly been all too keen to propagate Aadhaar and services such as Digi Yatra to an unsuspecting (and too often non-consenting) public, achieving such broad coverage that a formal mandate later becomes a fait accompli. All-too-familiar issues such as name mismatches, leading to failure of enrolment, have also emerged. It is important for informed consent to be the bedrock of any DPI. Else, it risks being mandated de facto. Collecting and digitising this data — with tall claims of security and convenience — should be alarming when the Digital Personal Data Protection Act, 2023 has yet to take effect. More importantly, the Supreme Court of India has ruled, in its right to privacy judgment, that Aadhaar cannot be mandated for basic education. APAAR is an ill-disguised proxy that steers clear of the text — but not the spirit — of that judgment. If the government wishes to undertake the goal of improving the reliability and accessibility of education records, it should back its administration of that effort with legislation. Published - March 15, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        students\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        Uttar Pradesh\n                    \n                            /                      \n                        \n                        Karnataka\n                    \n                            /                      \n                        \n                        Aadhaar\n                    \n                            /                      \n                        \n                        personal data collection",
        "headline_1": "A voluntary mandate: On the APAAR student ID",
        "headline_2": "The APAAR ID should not be imposed without a law in place",
        "link": "https://www.thehindu.com/opinion/editorial/a-voluntary-mandate-on-the-apaar-id/article69330705.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "15-03-2025"
    },
    {
        "full_article": "Even as the ruling DMK government in Tamil Nadu engages in a political discourse with the BJP-led regime at the Centre over the delimitation of parliamentary and Assembly constituencies and the implementation of the National Education Policy (NEP), its use of the Tamil letter ‘Roo’ (‘ரூ’) instead of the Indian currency symbol ‘₹’ in the promotional logo for the State Budget has drawn nationwide attention. The logo, which was unveiled by Chief Minister M.K. Stalin, has been seen by political opponents as an attempt to place regional identity in opposition to national identity. However, the use of ‘Roo’ is more a symbolic representation of Tamil — one of India’s many languages — than an outright rejection of the currency symbol ‘₹’. The Tamil Nadu government, like many others, continues to be flexible in adopting different symbols — ‘₹’, ‘Rs’, and ‘ரூ’ — in its official documents. In fact, the widespread use of ‘₹’ in the State’s first Economic Survey reinforces the idea that cultural and linguistic diversity, rather than political intent, governs such choices.While Tamil Nadu has taken longer than other southern States to release an Economic Survey, the document is a valuable addition to literature on the State’s economy. Forecasting a growth rate of over 8% in 2024-25, the Survey contextualises the State’s economy within global and national economic trends. As a major exporter of automobiles, textiles, leather and IT services, Tamil Nadu is more sensitive than many other States to global market fluctuations, making its growth trajectory more volatile. The Survey’s observations on demographic trends are particularly relevant, given that Tamil Nadu’s population growth is slowing. The challenge lies in consolidating and building upon industrial gains for long-term sustainable growth. Additionally, the Survey underscores the vulnerability of certain coastal districts in terms of climate change/natural disasters. The Survey also has a strong focus on sustainable water management practices — a subject that has historically received insufficient attention. However, the Survey could have had a more detailed analysis of the State’s finances and the socio-economic challenges faced by Scheduled Castes and Scheduled Tribes, who make up over one-fifth of the population. As more States publish their own Economic Surveys — the Union Territory of Jammu and Kashmir tabled its Survey recently — there is an opportunity now for economists, public policy experts and academics to conduct comparative analyses. Such studies, shared in public forums, could encourage other States that have yet to attempt similar reports to undertake their own economic assessments, contributing to a more comprehensive understanding of India’s diverse economic landscape. Published - March 15, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Dravida Munnetra Kazhagam\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Delimitation\n                    \n                            /                      \n                        \n                        Tamil\n                    \n                            /                      \n                        \n                        culture (general)\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Economic Survey\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        development\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        automobile\n                    \n                            /                      \n                        \n                        textile and clothing\n                    \n                            /                      \n                        \n                        IT/computer sciences\n                    \n                            /                      \n                        \n                        demography\n                    \n                            /                      \n                        \n                        climate change\n                    \n                            /                      \n                        \n                        natural disasters\n                    \n                            /                      \n                        \n                        cyclones\n                    \n                            /                      \n                        \n                        Reservation\n                    \n                            /                      \n                        \n                        Jammu and Kashmir\n                    \n                            /                      \n                        \n                        water",
        "headline_1": "Identities and symbols: On Tamil Nadu and the ரூ",
        "headline_2": "Cultural markers need not be seen as a challenge to nationalism",
        "link": "https://www.thehindu.com/opinion/editorial/identities-and-symbols-on-tamil-nadu-and-the-%E0%AE%B0%E0%AF%82/article69330724.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "15-03-2025"
    },
    {
        "full_article": "Yes, the crowds line up for women’s cricket\nToday, the finale of the Women’s Premier League, season 3, will be played at Brabourne stadium, Mumbai. Where’s the buzz been? At the stadiums, across four cities. In Bengaluru, enthusiastic crowding for entry has led to comparisons with kumbh mela. RCB fandom at WPL has given the IPL one a run for its money. Vadodara has shown avid home support to Ashleigh Gardner led Gujarat Giants. Mumbai’s been a keen cheerleader since season 1, when it played the solo host. Lucknow’s getting into the game. But the question in all this is, how much do we expect how fast?\nThe first match of the football WSL in England in 2011 was played in front of just 2,500 people. Today, it has a $84mn broadcast deal. Glass-half-fullers say this is still a fraction of the Premier League. But besides being played across schools and varsities, women’s football there is now a proper career across playing, coaching and management.\nHarsh quizzing about when WPL will deliver a Champions Trophy is really missing the point – a nine-year-old girl asked by TOI about her cricketing hero, named pacer Renuka Singh. Women’s cricket is now developing a franchise following. A deeper bench of players are becoming idols. Whether the bench is deep enough to expand to more teams and cities next year has to be objectively assessed. But to assess how WPL’s done so far, just listen to the cheers tonight.\n\n",
        "headline_1": "WPL wins",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/wpl-wins/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-03-2025"
    },
    {
        "full_article": "The really notable thing about notable days\nBeware the ides of March, ie, March 15. Although, what could go wrong today? It’s Saturday, long weekend. You’re Caesar of all you survey – knives are sheathed till Monday. But Caesar was done in by those nearest him. Homework, mall run, visiting relatives – any of these could be the unkindest cut of all. It could be a power cut too, with no OTT. The fault, then, would be in your stars. Yet, fear of the ides is futile, for cowards die many times before their deaths. Be brave, go out and splurge. But mind your credit, because lenders carve out defaulters as a dish fit for the gods.\nAt least, it’s not Friday the 13th. Or April 1. Even Trump – to whom diplomacy means ‘cry havoc and let slip the dogs of war’ – deferred his reciprocal tariff plan by a day to April 2, to show the world it wasn’t a joke. Although, almost two months of twists and U-turns later, his policy is Greek to everyone else. Byzantine.\nThere is a tide in the affairs of men, and ‘First Friend’ Musk knows it well. Yet, with all his billions he may never have his day. On the other hand, humbler workers – on whose deaths no comets were seen – still have a fading memory of May Day. Like caesars and sultans, days also gain and lose currency. Among those crying for friends, Romans, countrymen to lend them their ears is Martyrs’ Day. When did you last hear the 11am siren in Jan, and maintain two minutes of standing silence? Only festivals – religious and seasonal – hallowed by tradition, like Holi, may have a claim to eternity. Children’s Day, Teachers’ Day, days for fathers and mothers – contrived festivals – are destined to fall off the calendar. ‘Alien’ Valentine’s Day thrives, though. Not because we love ‘sanskar’ less, but because we love love more.\n\n",
        "headline_1": "Ides of March",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/ides-of-march/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-03-2025"
    },
    {
        "full_article": "Humans are their biggest problem…and students\nOwls have superpowers. They hunt like wolves of the sky. Their ears are Ferraris of sound sensitivity. Their brain does sophisticated math to pinpoint prey. They’re near-silent flyers. Their habitat and habits also make them super hard to study.\nWhat An Owl Knows: The New Science of the World’s Most Enigmatic Birds by Jennifer Ackerman takes us along the ride with naturalists, biologists, ornithologists and others using sophisticated new technologies to understand these elusive creatures. Plus with folklorists who study humanity’s biocultural memory of owls.\nLike all birds, they evolved out of small dinosaurs. After the great extinction 66mn years ago, owls grew into their night niche. Some 260 species exist today, spread from deserts to Arctic tundra, from pine cone sized elf owls and snowy owls like Harry Potter’s Hedwig to the naturally clowning, burrowing owls documented by James Bond, the real Bond.\nIn India, owls are loved as Lakshmi’s ride. Some parts of India also know them as ‘corpse bird’, drawn to cemeteries because of the big trees and lack of human disturbance there. Humans are omen-minded and owls are powerful symbols. If they herald good fortune in some cultures, they’re harbingers of doom in others. Still others view them as messengers from other worlds or times.\nTo the owls, human faces look owl-like, just as their faces look human-like to us, the book says. Yet, when an average person keeps a pet owl, viewing it through our own lens or as a mirror of ourselves, the owl suffers. As the great naturalist Henry Beston said about wild animals, they are not brethren, they are not underlings, they are other nations, caught with ourselves in the net of life and time.\nDuring mating season, the male northern saw-whet owl advertises himself through the night at 112 toots a minute, ratcheting it up to 260 when a female comes into its territory. Some owls mate for life. Other species practise divorce. So some scientists get to observe intense soap opera: Betty left Fred to live with Barney, and then not much later, Fred found himself a Wilma.\nNorthern pygmy owls do ‘asynchronous hatching’ – to optimise the chances of some chicks surviving even if prey become scarce. Raising owl children is so energy-demanding that adults can lose a third of their body weight during the nesting season.\nThey adopt too! Bringing up orphans and other offspring not their own. Scientists say a lot of this parental behaviour may not go beyond being genetically programmed. They have also observed siblicide, as stronger chicks kill weaker ones in times of food scarcity.\nDo owl voices have signatures of individual identity? Yes, to varying degrees this is the case for all owl species. Behavioural ecologists find that where the owl population is denser, calls are more distinguished and distinguishable. As in the main square in Kikinda, near the Romanian border. In the trees here, hundreds of long-eared owls roost together from Nov to March. Look up and so many pairs of black-orange eyes look down. A true Parliament!\nClimate change is taking a toll on nesting sites, the clock ticking on owl extinctions. But some are fighting back, the book underlines. Species like barred owls, screech owls and burrowing owls are successfully colonising urban areas. Look around, they’re there in your city too. \n\n",
        "headline_1": "Owls & us: Seeing in the dark",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/owls-us-seeing-in-the-dark/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-03-2025"
    },
    {
        "full_article": "Holi has always been a rowdy, rule-bending festival that freely receives anticipatory bail on popular demand. One is supposed to accept transgressions on this special day and if everybody were to behave, then a sanctioned and well-established opportunity to be bad has gone waste. Nor is all this rambunctiousness recent, as those born late, or raised in a boarding school, might think.\nRead full story on TOI+\n\n",
        "headline_1": "How free is your Holi",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/how-free-is-your-holi/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-03-2025"
    },
    {
        "full_article": "We are deeply troubled by the tragic death of the eight-year-old girl from Magura, whose six-day struggle for life ended at the Combined Military Hospital (CMH) in Dhaka on Thursday despite the efforts of doctors. Her passing, after being allegedly raped and choked, is a heartbreaking reminder of how unsafe women and girls continue to be in a country grappling with widespread gender-based violence. While the outrage that has followed the news of the cruelty inflicted upon the third-grader by her sister's in-laws shows a broader sense of solidarity, it will mean little unless we channel this grief into meaningful action, challenging the deep-seated sociocultural biases against women and ensuring stronger protection for victims. Without such efforts, tragedies like this will continue to occur.\nWe have written on this issue several times in recent weeks amid disturbing revelations about sexual violence and harassment, domestic violence or abuse by husbands and relatives, child marriage, abuse of street children, and unrestricted circulation of misogynistic content online. These have prompted frequent protests across the country, leading the government to pledge swift justice, including by setting deadlines for rape investigation and trial. Bangladesh's abysmally low conviction rate in sexual violence cases is no secret. While the law adviser's statement that law enforcement agencies will have to complete rape investigation within 15 days, and the trial within 90 days, marks a step in shortening waiting periods for justice, this is neither enough nor a guarantee that justice will be served.\nExperts say that the real challenge in such cases lies in ensuring thorough investigations, preventing interference or intimidation by influential quarters, addressing systemic flaws that allow perpetrators to escape accountability, and also tackling societal attitudes that perpetuate impunity. How can we ensure justice or prevent such crimes without addressing these challenges? Equally importantly, why does it always take a tragedy of this magnitude to pledge, or prompt, government action?\nThe truth is, mere pledges—or reactive policies—are not enough. We need stern, proactive action to tackle such crimes from the outset, not as an afterthought. We need regularly meted out punishment rather than exemplary punishment in the face of public outrage. The interim government, which emerged from a mass movement demanding accountability, has a particular responsibility in this regard. Given the level that gender-based harassment and violence has reached of late, we urge the government to establish a commission to look into such crimes, including rape of children, and suggest comprehensive legal and administrative reforms so that no crime goes unreported and unpunished. Moreover, society, too, must confront the harmful cultural norms condoning or downplaying such violence.\n",
        "headline_1": "Time to form a commission on sexual crimes",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/time-form-commission-sexual-crimes-3848396",
        "news_paper_name": "The Daily Star",
        "publish_date": "15-03-2025"
    },
    {
        "full_article": "Marcus Tullius Cicero said, \"The more laws, the less justice.\" Everyone should understand that the law is not always sufficient to provide justice, and it is not the only method of reaching it. When the law has difficulty providing fairness and equality, step into action to \"fill the gap.\" The balanced method is the alternative dispute resolution (ADR) to provide easy access to the judicial system. But, in modern times, a less expensive and more effective method for digitising and expediting the ADR process has been developed. Pro bono services for the marginalised people in Bangladesh may particularly be transformed by extending access to justice through online dispute resolution (ODR).\nThe legal system in Bangladesh is struggling, case backlogs remain a source of concern, reducing the judicial system's efficacy and leaving millions of people waiting for justice. Over 42 lakh cases are pending in courts across the country, with civil cases comprising approximately 50 percent of the backlog despite regulatory measures and technological advancement. The average case resolution length is 9.5 years, restricting underprivileged populations' access to justice. The high expense of civil suits in court, including court and lawyer costs, has led to financial instability for many families. Additionally, delays and lengthy legal battles have contributed to increased poverty in the country.\nSince it is difficult to efficiently provide legal help at no charge due to overloaded courts and insufficient resources, people from underdeveloped areas and those with low incomes look for local non-governmental organisations or union parishads to seek pro bono legal counsel. These organisations offer informal conflict resolution, making it even more challenging.\nHowever, colonial-era laws, notably the Evidence Act, 1872 and the Code of Civil Procedure, 1908, still serve as the basis of the nation's legal system, which significantly delays the settlement of cases. Even though the amendment of 2012 mandated ADR in civil litigation, the backlog has not been reduced much. Although new amendments in 2015 provided district legal aid officers (DLAOs) the ability to arbitrate disputes, the general efficacy of the system continues to be challenged due to its dependency on traditional in-person proceedings.\nBuilding on these challenges, despite having an Arbitration Act (2001), Bangladesh does not explicitly recognise digital arbitration or online dispute resolution (ODR). The law prioritises traditional, in-person conflict settlement, limiting the use of technology in court. To properly include ODR, the legal framework must be revised to include digital contracts, virtual hearings, and improved data security. Without these necessary improvements, ODR would struggle to achieve recognition and benefit the legal system of Bangladesh.\nThe adoption of electronic arrangements is an important aspect of this development. ADR has to transform its approach to accommodate the rising number of legal transactions conducted online throughout and outside the country. The COVID pandemic got us to shut down the courts in Bangladesh for months and taught a lesson that our country is dependent on outdated in-person methods. The government responded by passing the Usage of Information and Technology in Court Ordinance, 2020, which allowed for emergency virtual court hearings. These initiatives, however, were only temporary and did not result in a long-term ODR platform.\nGiven this precedent, the approach would provide a faster, cheaper, and simpler alternative for underprivileged populations that struggle to traverse the present judicial system. Why not implement a long-term digital dispute resolution system if courts can operate online in an emergency?\nSeveral countries have effectively used ODR to modernise their legal systems and improve access to justice. For example, the Civil Resolution Tribunal (CRT), a government-approved ODR platform in Canada, was established in British Columbia in 2016. This began by addressing condominium (strata) issues, before expanding into minor demands and other civil disputes. The CRT allows anyone, particularly those who cannot afford legal assistance, to settle disputes without physically appearing in court since it provides 24-hour internet access. Self-represented litigants have profited immensely from this system, which offers a more convenient and cost-effective settlement process.\nSimilarly, the US Equal Employment Opportunity Commission (EEOC) employed ODR to resolve employment discrimination claims by incorporating remote options into its mediation programme. Pro bono mediators assisted parties in reaching a significant number of agreements. Because of the initiative's remote nature, more people who would have been unable to get mediation services owing to financial or geographic restrictions were able to do so without incurring additional costs.\nAt the same time, the Rechtwijzer justice platform of the Netherlands aids people resolve divorce and landlord-tenant problems using an easy-to-use digital system. Similarly, the Sama platform in India provides a fully working ODR framework for resolving a wide range of issues.\nGiven these global initiatives, ODR can reduce case backlogs in Bangladesh. Through enhanced access to pro bono services and modernising the legal system, Bangladesh has a unique opportunity to take advantage of it and reform its legal framework after learning from the worldwide initiatives. By using a digital dispute resolution system, marginalised people may settle issues from the comfort of their own homes rather than dealing with challenging legal processes. Women, members of low-income groups, rural and marginalised communities would particularly benefit from this, as they regularly face significant barriers when seeking to access the traditional judicial system.\nNow is the time to take the initiative for the country in the post-uprising era. Will Bangladesh shift to a more effective, equitable, and accessible judicial system?\nTanjina Akter Riya is research fellow at Global Institute of Law, Oxford, UK.\n\nViews expressed in the article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Online dispute resolution: Making justice accessible for marginalised communities ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/online-dispute-resolution-making-justice-accessible-marginalised-communities-3848011",
        "news_paper_name": "The Daily Star",
        "publish_date": "15-03-2025"
    },
    {
        "full_article": "The Egyptian Arab Spring began with demonstrations across the country, participated by working-class youths, including women who voiced out against sexual violence and harassment, connecting the culture of impunity to Hosni Mubarak's dictatorship. Yet, in real time, we witnessed the hijacking of the entire movement by the religious right. Seeing the July-August movement, an Egyptian friend who was part of the Arab Spring, disillusioned but sincere, hoped that the same would not happen in Bangladesh. Even with my own optimism, I had told him that we had been an Iranian Revolution in the making for a long time—but yes, time would tell.\nNot much time was needed for the story to unfold. We are a \"wonderful\" mix of the Iranian Revolution and Arab Spring—where class, religion, and national politics are played out on women's and female children's bodies. The battle for women's basic safety and dignity, fought on the streets, is not a momentary reaction but a litmus test for Bangladesh's national outlook for decades to come.\nFrom the neighbourhood bully \"uncle\" allegedly assaulting a young woman for publicly smoking, to gang rapes across the country; from tawhidi janata demanding the release of a harasser, to the death an eight-year-old girl who succumbed to her injuries after being allegedly gang-raped by her male family members—there seems to be no safe corner left for Bangladesh's women. After a week of convoluted and factually incorrect statements by the home affairs adviser, met with fierce protests, the interim government finally initiated steps to arrest the alleged perpetrators. It is disappointing, to say the least, to witness the sluggish response of a cabinet comprising members who built their careers on \"women's empowerment.\" There is greater fervour in finding \"fascists,\" shifting blame onto the previous government's failures than in addressing today's gendered horrors. The AL government often blamed everything on the BNP and the general \"anti-Ekattor er chetona/razakars.\" The blame-game narrative remains unchanged.\n\nAn excellent body of work has emerged on the culture of misogyny and impunity, in the face of growing religious conservatism. However, an important piece of the puzzle is still missing from these analyses: why, globally, Bangladesh continues to be one of the most unsafe countries for women when its national success was achieved on women's backs. I would, therefore, argue for a critical class analysis of gender and violence, which is often simplified as a rights and development issue or reduced to a general description of shame/honour culture. Critical class analysis is understudied in Bangladesh's academia, yet class struggle lies at the core of gender-politics-violence.\nReturning to Iran and Egypt, we saw how, as a reaction against the morally and financially corrupt autocratic regimes, religious conservatism rose within the middle and lower-middle income groups. Along with financial corruption, autocrats concentrate power through fearmongering and social gatekeeping, preventing socio-economic mobility and leading to class tensions. In such contexts, controlling women's bodies and sexuality becomes pivotal to class struggle, which is usually watered down as a mere progressive vs fundamentalist dichotomy.\nPartha Chatterjee's critique of the \"bhodrolokshomaj\"—the respectability class of Bengal Renaissance—argued for Indian sovereignty on two important points: (a) the scientific prowess of the \"native\" educated elite, at par with their British colonisers; and (b) the Indian moral superiority, embodied in the propriety and spirituality of Indian women (Chatterjee, 1994). The mark of modernity was to pursue scientific knowledge, including the \"allowance\" of women's education, while ensuring their spiritual and physical virtue (e.g. Begum Rokeya Shakhawat Hossain, the women of the Tagore household). When it came to practices of gendered propriety—zenana/purdah, marriage as the sole option for women, Sita-esque purity imposition—Hindu and Muslim men were united (Hoek, 2013; Lal, 2005).\n\nIndian feminists have shown that South Asia's decolonial movement was primarily an exchange of power between colonial and elite native men, leaving the subaltern—mainly women and lower caste-class groups—out of decision-making (Chatterji, 2007). Colonial administrative, legislative, and judicial systems, based on European puritanical and racist beliefs regarding gender and sexuality, form the basis of post-independence state-building (Baxi, 2013; Karim, 2012; Menon, 2000; Siddiqui, 2024). The Penal Code, 1860 and Evidence Act, 1872 systemically established two simultaneous notions: (a) that native women are \"habitual liars\" and not to be trusted, and (b) that to charge a man with rape, it must be proved beyond doubt, making the woman's \"character\" central in sexual assault cases (Baxi, 2013). This is reflected in the infamous two-finger/virginity test, which, despite being repealed (2014) and banned (2018) by the High Court (Hossain, 2016; Huda, 2022), is still practised in medico-legal examinations (Siddiqui, 2024). Although the colonial penal system has been reformed, it lacks a fundamental overhaul to ensure restorative justice. Even the special law Nari O Shishu Nirjatan Daman Ain, 2000, focuses on protecting women's honour to prevent violence. Research shows that this law is often abused, and in authentic cases, the system fails survivors (Ibid).\nHaving conducted ethnographic research on the medico-legal procedures of sexual violence in Bangladesh, I frequently encountered the intersection of class and propriety across the board. Young people, for instance, aspire to achieve class mobility through education, employment and marriage. Across class divisions, marriage still remains significantly important as men attain \"manhood\" status and women uphold familial status through it. In a society where marriage is the only socially acceptable rite of passage for women, virginity or its perception is a powerful social capital to attain class and respectability (hence high child marriage rates) (Siddiqi, 2005; Siddiqui, 2024). From professional women's rights work to supporting divorcees, I can firmly state that it is a common misconception that only economically disenfranchised women stay in violent marriages. In fact, the middle class and above prolong unhealthy marriages (\"biye tikano\") for fear of losing social and economic status, allowing male violence and questionable behaviours to continue.\nIrrespective of gender, I found service providers quite conservative, often letting personal beliefs influence professional duties. These providers—police, doctors, junior-mid-level government officers, lawyers, NGO workers— are usually first-generation urban residents, part of the \"new\" middle class, from across Bangladesh. The majority of this group received public or madrasa education, surrounded by a Middle East remittance-driven socio-cultural environment. Religiosity is both a matter of spirituality and strategic social capital building for them, often feeling justified in morally policing others. For example, similar to female garments workers adopting purdah as survival strategy (Kabeer, 1994), middle-class women adopting hijab practices to access higher education and \"respectable\" jobs (Huq, 2021).\nThe stakeholders, on the other hand, were part of the \"old\" middle class which is more of a social status than an economic marker. The elite minority is usually a complex mix of the upper-middle class with the uber-rich, related by blood or marriage. Religion is also used by many in this category to \"socially whiten\" financial corruption. Given their power-coopted position, they tend to generalise religious others with colonial, racist undertones, showing little understanding of dynamics outside. The elite class frames women's rights as a development problem rather than a crisis of citizenship. The donor-driven development sector—with \"patchwork developmentalism\" —has turned women into apolitical categories— \"poor/vulnerable,\" \"RMG workers,\" \"youth,\" and \"victims\"—marred with paternalistic language and band-aid solutions.\nAs one of the posters from the recent protests rightfully stated, women are citizens/vote banks only during elections. The rest of the time, they are \"cheap\" emotional and industrial labour that keep the home and national economies running. The result of both—the conservative economic middle class and the progressive (classist) elites—is the perpetuation of structural violence through familial and state systems.\nIn the absence of critical discourse on marriage-class-sexuality, patriarchal relations, i.e. kinship, to a man remain the primary option for accessing resources for women. Men have no incentive to question or destabilise their own power hierarchies and women are co-opted into violent structures. This is why known sex offenders and assaulters, without facing any consequences, continue to be celebrated for the respective positions they hold in society. This is why we use passive terms such as \"violence against women\" or \"gender-based violence\" rather than the active voice: \"men assaulting women,\" or \"men raping girls.\" This is why madrasa teachers can hide behind \"but the devil made me do it\" narratives, gaining sympathy from their peers. This is what delays policymakers in taking immediate actions and prioritising the issue as a national crisis. This is also why women across class divide perpetuate violent kinship structures, protect the men in their lives, and morally police one another.\nSocio-cultural and political realms of Bangladesh do not view women as viable, political, active citizens who deserve not just rights, but the dignity to live our lives on our own terms. The male protestors of the anti-discrimination student movement welcomed their female peers when they stood as shields before them. Like all things with women in Bangladesh, once their presence was utilised fully, they were pushed to the sideline.\nUndoubtedly, there has been an unprecedented rise in male violence against women but the patriarchal culture of impunity, and undermining women as anything other than industrial or reproductive labour, is also nothing new. The \"bhodroshomaj\" has been killing us for a long time. As long as we continue to function within Victorian patriarchal political and legal structures that, by design, are to ensure male domination, we will remain as subjects, not citizens, in our own country.\nThe question is: do we keep taking to the street every time a gruesome rape happens and settle with little band-aid solutions, or do we rip it all apart and demand a social upheaval where women are no longer apolitical categories but political citizens with dignity?\nReferences \nBaxi, P. (2013). Public Secrets of Law. Oxford University Press. \nChatterji, J. (2007). The Spoils of Partition. Cambridge University Press. \nHoek, L. (2013). Cut-Pieces. Columbia University Press. \nHossain, S. (2016). Public interest litigation on violence against women in Bangladesh: Possibilities and limits. In A. Barrow & J. L. Chia (Eds.), Gender, Violence and the State in Asia. Routledge.\nHuda, T. (2022). \"No signs of rape\": corroboration, resistance and the science of disbelief in the medico-legal jurisprudence of Bangladesh. Sexual and Reproductive Health Matters, 29(2). \nHuq, S. (2021). Seeking certainty, security and spirituality: religious conditioning and everyday aspirations amongst female university students in Bangladesh. Contemporary South Asia, 29(2), 257–270. \nKabeer, N. (1994). Women's Labor in the Bangladesh Garment Industry: Choice and Constraints. In C. F. El-Solh & J. Mabro (Eds.), Muslim Women's Choices (1st ed.). Routledge.\nKarim, S. (2012). Living Sexualities: Negotiating Heteronormativity in Middle Class Bangladesh. ISS.\nLal, R. (2005). Domesticity and Power in the Early Mughal World (1st ed.). Cambridge University Press.\nMenon, N. (2000). Embodying the Self: Feminism, Sexual Violence and the Law. In P. Chatterjee & P. Jaganathan (Eds.), Community: Gender and Violence, Subaltern Studies XI (pp. 66–105). Ravi Dayal.\nSiddiqi, D. (2005). Of Consent and Contradiction: Forced Marriages in Bangladesh. In L. Welchman & S. Hossain (Eds.), \"Honour\": Crimes, Paradigms, and Violence Against Women (pp. 282–307).\nSiddiqui, S. (2024). \"What's Love Got to Do With It?\" A Hospital Ethnography on Sexual Violence Response and Care in Bangladesh [University van Amsterdam].\n\nShahana Siddiqui, PhD, is medical anthropologist at Universiteit van Amsterdam.\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our submission guidelines.\n \n",
        "headline_1": "The ‘bhodroshomaj’ that is killing women and girls",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-bhodroshomaj-killing-women-and-girls-3847821",
        "news_paper_name": "The Daily Star",
        "publish_date": "15-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Revving up for recovering nation's stolen assets",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/revving-up-for-recovering-nations-stolen-assets-1741959420",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Starlink's pomise for Bangladesh",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/starlinks-pomise-for-bangladesh-1741959559",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Deplorable assaults on girls, women",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/deplorable-assaults-on-girls-women-1741959609",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Economic impacts  of Ramadan",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/economic-impacts-of-ramadan-1741960029",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-03-2025"
    }
]