[
    {
        "full_article": "For the fifth time in as many days the U.S. President has claimed credit for bringing India and Pakistan back from “nuclear conflict” by mediating the May 10 ceasefire agreement, a claim that is puzzling and problematic. The claim of mediation has been rebutted by the Ministry of External Affairs (MEA), unofficially and more formally several times, with officials giving a timeline of how the talks had been held “directly” between the Directors General of Military Operation (DGMO) on a hotline, after the Pakistani DGMO proposed a stop to hostilities three days after Operation Sindoor began, and India acceded to the request. The government has said that Pakistan’s request came after it received a jolt over India’s strikes on Pakistani bases. It has also said that like many countries, the U.S. was engaged with the situation, and officials including Prime Minister Narendra Modi, External Affairs Minister S. Jaishankar and National Security Adviser Ajit Doval had kept them apprised of India’s position. Mr. Trump’s assertions, backed by his administration, have been a cause for obvious outrage in Delhi, as they violate India’s “long-stated” principle of not accepting third-party mediation on bilateral issues. His other comments, including an offer to mediate to resolve the Kashmir dispute and the equivalence he draws between India and Pakistan, also go against India’s previously well-respected policies against the internationalisation of an “internal issue” and the hyphenation with Pakistan. Moreover, the MEA spokesperson has categorically denied that any trade-related issues were discussed between Indian and U.S. interlocutors, even as Mr. Trump has repeated that he had prevailed on India and Pakistan to put aside their “nuclear missiles” by threatening to stop trade with them if they did not, and promising to enhance trade ties if they did. That Mr. Trump has not once referred to India’s core concerns on terrorism, appeared to swallow the Pakistani narrative on a “nuclear war”, and even suggested a “dinner” between Mr. Modi and Pakistan Prime Minister Shehbaz Sharif, trivialises the serious nature of the rupture between Delhi and Islamabad.New Delhi must also analyse what lies behind Mr. Trump’s obvious shift from the camaraderie on display with Mr. Modi just months ago. Are the comments explained as simply “Trump being Trump”, or is he sending a more considered message on U.S. policy for the region? The extent of the China-Pakistan political and military cooperation may also have caused some alarm in the U.S. India must make it clear that its battle against cross-border terrorism from Pakistan cannot be brushed aside by any country, especially if it is one of India’s closest partners, and co-founder of the Quad. The U.S. President’s statements have not just challenged India’s narrative or policy principles but also questioned New Delhi’s credibility, and some tough messaging will be required to clear the air convincingly on the issue. Published - May 15, 2025 12:42 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        government departments\n                    \n                            /                      \n                        \n                        armed Forces\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Jammu and Kashmir\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        terrorism (crime)",
        "headline_1": "Trumpeting claims: On the U.S. President’s claims, India and Pakistan",
        "headline_2": "Donald Trump’s exaggerated claims undermine India’s Kashmir policy",
        "link": "https://www.thehindu.com/opinion/editorial/trumpeting-claims-on-the-us-presidents-claims-india-and-pakistan/article69575970.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "15-05-2025"
    },
    {
        "full_article": "Justice, if not unduly delayed, restores public faith in due process and the criminal justice system. The recent verdict in the Pollachi sexual assault case, where a Coimbatore Mahila Court convicted all nine accused and sentenced them to life imprisonment for the remainder of their natural lives, is a significant step in this regard. More so, because the entire case originated from a single plea for help from a young victim, which helped expose the involvement of multiple tentacles of a body of criminals. In February 2019, a 19-year-old college student reported to the Pollachi East police that four men had sexually assaulted her in a car near Pollachi 12 days earlier. The ensuing investigation revealed this complaint to be just the tip of the iceberg. As in the Prajwal Revanna case in Karnataka, the seizure of digital devices unveiled the full scope of the atrocities. Since 2016, a group of young men had been systematically preying on vulnerable young women, from disadvantaged groups, filming the assaults, and using these videos for further exploitation. The sheer depravity uncovered shocked the State’s collective conscience. Public outrage intensified with the exposure of the accused’s political connections. One was identified as the All India Anna Dravida Munnetra Kazhagam (AIADMK) Pollachi town students’ wing secretary (later expelled), while another, involved in an assault on the survivor’s brother, held a local secretary position in Amma Peravai, an AIADMK-affiliated youth organisation. Faced with mounting public pressure, the State government initially transferred the investigation to the Crime Branch-CID and subsequently to the Central Bureau of Investigation.Mahila Court Judge R. Nandhini Devi also directed the State government to provide a total compensation of ₹85 lakh to the survivors. The judge concurred with the prosecution’s argument that the perpetrators had exploited their financial resources, physical power, political influence, and the incriminating videos to silence the survivors and perpetrate repeated assaults. She emphasised that she was clear that the judgment should “reflect the public abhorrence of the crime”. As elections approach, politicians must resist the temptation to politicise this judgment, which not only delivered satisfactory justice but also challenged the misuse of political and financial clout. To foster a genuine feeling of security, the government must now assure its citizens an environment free from exploitation. Published - May 15, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        crime, law and justice\n                    \n                            /                      \n                        \n                        sexual assault & rape\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        Karnataka\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        All India Anna Dravida Munnetra Kazhagam\n                    \n                            /                      \n                        \n                        investigation\n                    \n                            /                      \n                        \n                        judge\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        safety of citizens",
        "headline_1": "​Restored faith: On the Pollachi verdict",
        "headline_2": "The Pollachi verdict brings closure to the rape victims",
        "link": "https://www.thehindu.com/opinion/editorial/restored-faith-on-the-pollachi-verdict/article69575833.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "15-05-2025"
    },
    {
        "full_article": "India had a diamond monopoly in ancient times, lab-grown diamonds can restore it \nBlue diamonds, which are rarer than blue moons, made headlines twice in the past three weeks. First, when Christie’s cancelled the auction of ‘Golconda Blue’ in April, and again on Tuesday when Sotheby’s sold ‘Mediterranean Blue’ for $21.5mn in 2.5 minutes. Of the two, GB was the real deal. Mined in India, it had belonged to the Maharaja of Indore once, and was expected to fetch up to $50mn. Not because it was a fistful – 23ct is less than 5g; Ranjit Singh’s Kohinoor weighed 191ct – but because it was the biggest blue diamond ever on the market. South Africa-mined MB, on the other hand, weighs a less atypical 10.3ct or 2g.\nAll diamonds are special, but blue ones more so because they are born 600km under your feet, where temperature and pressure are so high it’s like being in the middle of a nuclear explosion. Actually, nuclear explosions have been known to form ‘nanodiamonds’, but they’re not worth the risk. As for the blue colour, it comes from traces of boron – the same chemical that an Egyptian plane was rumoured to have brought to Kirana Hills after the rumoured nuclear leak at its rumoured nuke silo after a rumoured Indian strike last Saturday\nWhat’s not rumoured but certain is that the future of diamonds lies in labs, not underground. Although manmade diamonds have been around since the 1950s, Modi’s gift of a 7.5ct lab-grown green diamond to the Bidens two years ago declared India’s intent of causing a major upset in the market. Nine of every 10 diamonds are polished in India. Eight of every 10 diamond traders in Antwerp, Belgium – global hub of diamond trade – are Gujaratis. What we don’t have anymore – despite a monopoly till the 1830s – is enough diamond mining. But lab-grown diamonds, which are indistinguishable from Kohinoor and Golconda Blue without deep chemical analysis, and far cheaper, can fill that gap. Diamond snobs might still demand the “real” thing, but don’t bet on it because manmade diamonds, with their relatively tiny carbon footprint, may be more flaunt-able. Besides, they’ll be available in any colour you want, even if it’s black.\n\n",
        "headline_1": "Ready To Rock",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/ready-to-rock/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-05-2025"
    },
    {
        "full_article": "To tell us that not only world, nation too is one family\nSeveral weeks ago, I ‘columned’ a diverse family that had lived happily together for ages but splintered when Biggest Brother began ordering everyone on how to love, pray, even eat. All the smaller brothers had to obey, or face his wrath. He pushed around second biggest brother mostly saying, ‘Some relative of yours  had fought with us 70 years ago, and moved to a separate house, so you too should leave this ancestral home and go live there!’ Arre bhai, what logic was that? But, biggest is mightiest, no? \nThen, three weeks ago while some members were enjoying a lovely picnic, a terrible thing happened – but which miraculously restored their past proud unity. A quarrelsome neighbour had eyed the family’s vast property right from the start – and now resented its growing stature in the community. That April morning, he brazenly swooped down, started getting violent, grabbed stuff and generally created mayhem of the most intolerable kind. Well, you can be sure our strong family leader wasn’t going to have any of this nonsense. No, Sir-ji, he was going to protect his home with all his superior might. Not just that, he was going to teach the belligerent marauder such a lesson that it would ‘make him remember his nani’ – as an earlier head of household had so colourfully put it.\nNow here’s the beauty of it. Biggest Brother stopped doubting second biggest brother’s loyalty. Instead, he immediately coopted him to show the land-grabbing lout and world that the entire clan was united in this fight to the finish-off. Second biggest brother did not sulk, ‘You kept isolating me, so why should I join.’ No-ji, not for a nanosecond. He – indeed all smaller brothers – jumped into the fray, declaring, ‘We are one family and we will uphold its honour as one.’ Such a united stand won the day. And they all again lived happily ever after – nobody ever forgetting that ‘Dividing, we fall.’ \nBiggest Brother even coined a motto, ‘Garv se kaho, hum Bharatiya kutumbakam hain!’  \n                                            ***\nAlec Smart said: “New greeting thanks to our  Star Warriors: ‘May the Forces be with you’.”\n\n",
        "headline_1": "It took a conflict…",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/it-took-a-war/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-05-2025"
    },
    {
        "full_article": "SC was gamed by a cheat. Crack down on all bar councils. Verification of advocates can’t be allowed to take this long\nThe issue of fraudulent lawyers in Indian courts has almost made itself a priority for both bar and bench as new CJI BR Gavai assumes office. In the latest instance, a ‘lawyer’ managed to wrest a favourable verdict based on his false submission of a settlement in a land dispute case, in Supreme Court. Top court was told a compromise had been reached. Basis this, SC quashed earlier orders of a trial court and Patna HC. Only to discover, five months on, that the man who had appeared as the ‘lawyer’ had stolen the identity of a retired advocate and gamed the system.\nSC bench was rightly livid when it said, “the court cannot be taken for a ride.” The problem is twofold. Fraudulent lawyers are, in the bulk, those with fake degrees – as BCI noted there are far too many “fake law degrees, forged academic certificates, falsified qualifications, fraudulent enrolments.” The case at hand is of an even more daring league: an imposter lawyer who stole an identity and managed to hoodwink court systems. SC in Jan had voiced its apprehensions about the time – nine years and counting – it has taken to verify lawyers’ credentials. Started in 2015, the Bar Council estimates that upto 20% of India’s lawyers were practising without valid degrees. That’s about 1.5mn lawyers. It gives us pause.\nForged professional degrees and academic credentials are among India’s biggest challenges – from medical institutes to engineering colleges and, now, legal education. The hollowing of professional standards and the unmeasurable risk to those who hire their services is one thing. Erosion of public trust in judiciary is the other – that has grave implications. Even more alarming is the reality that judiciary’s apex regulatory body is struggling to cope with the extent of fraud. Earlier this year, BCI took on state bar councils for laxity in verification protocols. Among the biggest problems is the resistance from educational institutes, unwilling to engage in such checks. As BCI noted, recognised and deemed universities issue law degrees violating BCI norms, turning “legal education into a mere commercial transaction”. That problem isn’t new. But the fear is, it’s becoming the norm.\n\n",
        "headline_1": "Counsel = Con Sale",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/counsel-con-sale/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-05-2025"
    },
    {
        "full_article": "Oil sheikhs are trying to reform their societies & economies. But top-down approaches have their limitations \nTrump began his tour of Gulf countries yesterday. As a man obsessed with his brand, he may notice his hosts are in the middle of a major rebranding. Oil-rich Gulf Arab states are trying to rewire their society and economy, knowing that a post-oil future awaits them. This means putting locals to work, trying to foster innovation, and changing the social contract between people and govt. Some good things have happened. In Saudi Arabia, Mohammed bin Salman’s reforms have led to new freedoms for Saudi women, created a Saudi entertainment industry, and even attempted to redefine the role of religion in everyday life. \nBut there are also challenges. First, the impetus for this change was the Arab Spring wave of the previous decade and the threat posed by Islamic State terror group. Both represented a direct challenge to the authority of oil sheikhs and brought home the danger of funding and supporting radical Wahhabi groups across the region. Gulf states are now cracking down on such extremist networks and promoting theological moderation. So, the question is – are the reforms driven by a genuine commitment to openness or are they meant to protect the monarchies?\nSecond, a top-down approach to innovation has limitations. It’s all very well to create a futuristic city like Saudis’ Neom. But fostering local innovation requires serious investments in institutions, which again grates against the authority of monarchies. Third, the grand reorientation has opened space for foreign policy realignments. This is best exemplified by the Abraham Accords that normalise relations with Israel. But the latter’s war in Gaza has also exposed divisions between oil sheikhs and the Arab street over the Palestine issue. Fourth, India-Gulf relations are experiencing positive momentum. But this may have triggered Türkiye, a rival to Saudi Arabia, to enhance ties with Pakistan and play the role of keeper of the faith. Finally, Gulf monarchies still have loads of petro-dollars, which can be used to strategically delay change. Gulf investments in renewables being a case in point. Oil sheikhs are trying. But success is not guaranteed.\n\n",
        "headline_1": "Gulf Spring? Not Yet",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/gulf-spring-not-yet/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-05-2025"
    },
    {
        "full_article": "On Monday, the government introduced a significant reform measure: dissolving the National Board of Revenue (NBR) to replace it with two new agencies. The goal is to separate the tax policymaking and implementation processes, in line with a key conditionality of the International Monetary Fund (IMF) for the $4.7 billion loan deal. We agree with experts that this is a \"bold\" and \"timely\" move that can help modernise our tax system.\nBy dissolving the NBR along with the Internal Resources Division (IRD) through an ordinance, the government is paving the way for the Revenue Policy Division and Revenue Management Division. The first will be tasked with designing our tax policy framework, formulating tax laws, determining various rates, and overseeing the coordination of international tax treaties and trade-related tariffs. The second, on the other hand, will be responsible for tax administration, compliance, audit, and enforcement of income tax, VAT, customs, and other taxes and duties. The separation of duties is meant to make the tax system more efficient and boost overall revenue earnings. Until now, the NBR has been in charge of all these tasks—both policymaking and policy enforcement—something that has been criticised for creating an overlap of functions leading to poor performance and coordination.\n\nThe separation of duties is meant to make the tax system more efficient and boost overall revenue earnings. Until now, the NBR has been in charge of all these tasks—both policymaking and policy enforcement—something that has been criticised for creating an overlap of functions leading to poor performance and coordination.\nGiven that Bangladesh has one of the lowest tax-GDP ratios in Asia (around 7.4 percent), restructuring the country's tax authority has been long overdue. The NBR has consistently failed to ensure effective resource mobilisation, increase revenue generation through direct taxes, and plug loopholes to prevent tax evasion, among other things. Moreover, in its mission to meet revenue collection targets, it has often ended up enforcing policies that created unjust pressure on taxpayers and businesses. Under the new system, we expect to see a shift away from this state of affairs.\nMerely overhauling the structure, however, will not bear the desired results if the underlying problems are not addressed. As experts have said time and again, the government should reduce its overreliance on indirect taxes and expand the tax base to improve our tax-GDP ratio. Tax exemptions must also be reconsidered and allowed more conservatively, and corrupt practices in tax collection must be stopped. The entire system must be designed in a way that eligible taxpayers feel encouraged and are able to pay taxes without hassle.\n\nMerely overhauling the structure, however, will not bear the desired results if the underlying problems are not addressed. As experts have said time and again, the government should reduce its overreliance on indirect taxes and expand the tax base to improve our tax-GDP ratio. Tax exemptions must also be reconsidered and allowed more conservatively, and corrupt practices in tax collection must be stopped. The entire system must be designed in a way that eligible taxpayers feel encouraged and are able to pay taxes without hassle.\nOf course, the latest decision is not without contention. NBR officers and staff members have been protesting against the move, arguing that the new ordinance sidelines experienced tax professionals. We believe this can be sorted out through dialogue and necessary readjustments. But the ongoing overhaul must be followed through, because it is in line with international best practices and, if done right, will improve tax governance and transparency.\n",
        "headline_1": "Splitting the NBR is a timely step",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/splitting-the-nbr-timely-step-3895076",
        "news_paper_name": "The Daily Star",
        "publish_date": "15-05-2025"
    },
    {
        "full_article": "For much of Bangladesh's history, women have been relegated to domestic roles, where their duties defined their worth as wives and mothers. Crucial to families' survival, household labour has been neither glamorous nor deemed valuable. Despite the long-standing efforts of feminist movements to break these traditional barriers, the narrative around women's work has shifted in a way that capitalises on their labour without truly emancipating them. What began as a quest for equality has morphed into an expectation for women to juggle multiple responsibilities—at home and in the workplace—without sufficient recognition or support.\nIn Bangladesh, like many other parts of the world, women are sold the idea of the \"Superwoman\" by free market structures. Women, particularly those in the workforce, are expected to excel not only in their careers but also in their domestic lives. They are told they can \"have it all,\" but the reality is far from it. From managing corporate jobs to running households, the ideal Bangladeshi woman is tasked with balancing her professional ambitions with familial duties. She is expected to handle everything—earning, cooking, cleaning, child-rearing, and even caring for elderly family members—without asking for help. The pressure is immense, yet society treats women's contributions as \"natural\" and often unrecognised.\nCapitalism, as it has evolved globally, has commodified the image of the working woman in Bangladesh. The very real struggle to meet both professional and familial expectations is framed as a personal failure if women cannot meet the unattainable standards set by society. Women in Bangladesh are bombarded by the idea that they should be able to do it all, from excelling in their careers to creating flawless home environments. This expectation is reflected in media, advertisements, and social media platforms that present the image of the perfect woman: a full-time employee, an ideal homemaker, a loving mother, and an emotionally available partner, all while maintaining physical fitness and emotional stability. The woman who fails to meet this \"Superwoman\" ideal is quickly deemed inadequate or, worse, seen as lazy.\nAccording to the Quarterly Labour Force Survey-2024 by the Bangladesh Bureau of Statistics (BBS), 17.9 lakh men and only 8.7 lakh women are unemployed, suggesting a lower unemployment rate among women. However, the employed workforce statistics tell a different story: 4.524 crore men are employed, compared to just 1.128 crore women. This sharp disparity highlights that a large segment of the potential female workforce remains unutilised. The gap reflects not only the absence of effective national strategies to integrate women into the labour market but also the enduring impact of social prejudices that limit women's participation in formal employment.\nIn our society, discussions of gender equality often focus narrowly on financial equality—splitting bills, earning equal pay, and reducing the wage gap. However, this focus on financial parity ignores the more profound inequalities embedded in the division of labour at home. Even when they earn, women in Bangladesh are still often the primary caregivers and homemakers. Conversely, men continue to enjoy the benefits of a household managed primarily by their wives without contributing equally to domestic responsibilities. This creates an imbalance, where the financial contribution may be equal, but the emotional and physical burden on women remains disproportionately high.\nAt the same time, homemakers in Bangladesh face a particular form of exclusion. Though essential to the functioning of their families and society, their labour is not recognised as \"real work.\" The household duties are still dismissed as a woman's \"natural\" role, not considered a part of the labour force. This has created a dichotomy in which women in the workforce are celebrated as \"working women,\" while those dedicated to unpaid household labour are excluded from the category. The work of homemakers is often rendered invisible, and they are left out of discussions of women's economic empowerment. Despite contributing vastly by managing the household, these women are frequently trapped in a cycle of thankless, unpaid labour—what some have called a \"lifelong internship.\"\nMoreover, when women in Bangladesh face gender-based domestic violence, the response is often one of individualisation. Instead of focusing on the perpetrator and addressing the societal roots of violence, women are usually told that they must become financially independent or \"self-reliant.\" The focus shifts away from the abuser, and the victim is subtly blamed for not meeting the economic ideal. By telling women to become independent without addressing the societal structures that allow abuse to persist, we ignore the real cause of the problem—the abuser—and place the onus of change on the victim.\nAdditionally, societal expectations from Bangladeshi women often begin long before marriage. When married women are denied education by their in-laws, we encourage them to complete their studies before marriage. Later, when these in-laws deny them the opportunity to work, the advice changes to \"build a career first, then marry.\" But no one addresses the underlying issue: no in-laws or family members have the right to dictate a woman's personal choices, whether that involves education, career, or family life. This approach ignores the reality that women's rights to their lives and choices should not be contingent on anyone else's approval.\nIn the quest for gender equality in Bangladesh, financial equality is often considered the end goal. However, true gender equality is not merely about splitting bills or matching salaries. It requires a fundamental shift in how domestic and professional labor is valued and shared. The burden placed on women to succeed in every aspect of life—without adequate support—must be addressed. Women should not be expected to be Superwomen, nor should they be left alone to fight for what is rightfully theirs.\nUltimately, the narrative of women \"having it all\" is a capitalist construct designed to keep women constantly striving and perpetually exhausted. True gender equality in Bangladesh will only be achieved when men and women share work responsibilities at home and in the workplace and when women's labour is acknowledged and compensated, whether in the office or at home. Only then can we begin to break free from the cycle of overwork and unrealistic expectations that have been imposed upon women.\nZarin Tasnim is lecturer of media, communication, and journalism at Department of Political Science and Sociology and assistant director at Public Relations Office (PRO) in North South University.\n\nViews expressed in this article are the authors' own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The repackaged feminism and hidden cost of ‘having it all’",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-repackaged-feminism-and-hidden-cost-having-it-all-3894531",
        "news_paper_name": "The Daily Star",
        "publish_date": "15-05-2025"
    },
    {
        "full_article": "In the heart of Doha, a city where modernity meets tradition, the Earthna Summit 2025 was convened on April 23, in the iconic Msheireb Downtown—a district that has become a global model for fusing energy-efficient design with Qatari heritage. The event was not just a gathering of experts and policymakers. It was a moment of reflection for the Bangladeshi expatriate community, many of whom have carved out lives in the Gulf with both ambition and trepidation. As the world's leaders and innovators gathered to discuss climate change and sustainable development, the eyes of Qatar's Bangladeshi diaspora members were on a singular figure whose voice has long echoed their hopes: Chief Adviser to the Bangladesh interim government Prof Muhammad Yunus.\nChief Adviser Yunus' keynote address urged an end to the systemic barriers that restrict the potential of young people. He reminded the audience that limitations on growth often stem not from an individual's inherent capabilities, but from the structures that confine them. \"A bonsai tree is not small because of its seed,\" he said. \"It is small because of the pot it is placed in.\" His call to rethink these boundaries resonated across the room, but it was particularly poignant for those in attendance who have lived with the constraints of a system that too often limits opportunity.\nWhile the 2022 FIFA World Cup brought a wave of opportunity and infrastructure development to Qatar, many Bangladeshi workers now find themselves navigating an economy that is increasingly prioritising high-skilled service industries. For those who arrived with expertise in construction and manual labour, pathways to career mobility remain limited. The transition towards a more knowledge- and service-based economy has not been matched with inclusive upskilling or retraining efforts, leaving many migrant workers in uncertain and precarious employment conditions.\nTo grasp the layered and often invisible struggles shaping the lives of Bangladeshi migrant workers in Qatar, I sat down with Amin Rasul, secretary of the Bangladesh Community Qatar (BCQ) and a senior engineer at Qatar Electricity and Water Company. Rasul, who has worked closely with Qatar's Ministry of Labor and international organisations such as the International Labour Organization (ILO), provided valuable insights into the complexities of the situation.\n\"The issue of managing such a large workforce is a multifaceted one,\" Rasul explained. \"But at its core, it stems from the way recruitment operates. Many workers fall prey to unethical recruitment practices, where agents promise jobs and charge exorbitant fees. Once they arrive in Qatar, they often find themselves either jobless, in unsuitable roles, or trapped in conditions where employers control their bank cards and access to wages. Legally, systems may appear compliant, but exploitation continues through informal practices.\"\nWhile recent reforms in Qatar, such as the 90-day grace period allowing workers to seek new employment after termination, have shown a commitment to improving labour conditions, the challenge remains one of awareness. \"There is a hotline,\" Rasul noted, \"but most workers are unaware of its existence. They are often victims of exploitation before they even have the opportunity to act.\"\nBeyond legal reforms, there is also a pressing need for better access to education and skills development for the migrant workforce. Many Bangladeshi workers, even those in skilled professions such as engineering or healthcare, arrive in the Gulf with limited proficiency in the region's languages—Arabic and English. The result is a mismatch between the skills of the workers and the demands of the labour market. Opportunities in service sectors like hospitality remain limited for Bangladeshis, especially compared to other Asian diaspora communities such as the Indian, Pakistani, Nepali, and Filipino populations who are more integrated due to stronger language and communication competencies, said Zillur Rahman Biswas, a Bangladeshi educationist examining diaspora education in the Gulf. The reasons why other nations' diaspora schools have more institutional backing stems from many factors, including \"larger and more affluent expatriate populations with longer establishments in the Gulf and a robust investor base,\" said Biswas.\n\"There is overwhelming demand for quality education among Bangladeshi families in Qatar,\" he shared. \"We lack the space, trained staff, and institutional backing that schools of the Indian or Pakistani communities enjoy. This has long-term implications—not just for educational equity, but for the ability of our youth to compete in a global labour market.\"\nDuring a visit to Qatar's Bangladeshi diaspora schools, which now serves around 1,800 students, I spoke with educators who highlighted the challenges they face. Overwhelmed by demand, the school had to introduce a second shift to accommodate the increasing number of students. Tuition fees remain low, ranging from QAR 350 to QAR 550 per month depending on grade level. Yet, despite the affordability, the school struggles with limited facilities, teacher training and resources. In stark contrast, other Asian diaspora communities have schools with greater investment, better infrastructure, and broader institutional recognition.\nBangladeshi community representatives consistently express the need for better schooling options that are both affordable and internationally aligned, to ensure that students are prepared for a changing and competitive job market.\nQatar is one of the top 10 remittance source countries for Bangladesh. According to remittance landscape and trajectory, remittance from Qatar amounted to $1.5 billion in FY2024. The scope for expanding the remittance portfolio in Qatar remains high, but the issue of skills development for Bangladesh's migrant workers continues to pose barriers. But this issue goes beyond the immediate needs of those living in the Gulf—it is tied directly to Bangladesh's larger aspirations on the global stage. As Bangladesh seeks to position itself as a manufacturing powerhouse—what some are calling the \"factory of the world\"—the need for a workforce that is both skilled and adaptable is more urgent than ever. Without a strategic investment in education, training, and language acquisition, Bangladesh risks falling behind in an increasingly competitive global market.\nDr Yunus' visit to Doha also marked a significant step forward in Qatar-Bangladesh relations. During his discussions with the Qatari government, issues such as workforce planning and the repayment of accumulated gas bills were on the table. These high-level engagements demonstrate a mutual commitment to strengthening bilateral ties, not just in economic terms but in ways that respect and invest in the people who form the backbone of both nations' growth.\nUltimately, the success of Bangladesh's diaspora depends on empowering its youth to not merely survive but to excel. The world of work is rapidly evolving, and the opportunities available to young Bangladeshis in the Gulf, or anywhere else, will be shaped by how well they are prepared to engage with a dynamic, complex global economy.\nSarzah Yeasmin is a policy analyst working on the intersections of education and development economics. She is an alumna of Harvard University.\nViews expressed in this article are the authors' own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "REPLANTING THE BONSAI: Empowering Bangladeshi diaspora for a changing Gulf",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/geopolitical-insights/news/replanting-the-bonsai-empowering-bangladeshi-diaspora-changing-gulf-3894496",
        "news_paper_name": "The Daily Star",
        "publish_date": "15-05-2025"
    },
    {
        "full_article": "As the nation prepares for its first budget following the uprising, likely to be unveiled within a month, the latest findings from the International Budget Partnership's Open Budget Survey should serve as a wake-up call for the interim government. Bangladesh continues to languish near the bottom of global lists on budget transparency—ranking 37th among 125 countries in 2023, and trailing behind most of our South Asian peers, according to the survey. This confirms what we have long known: the persistent lack of openness and accountability in fiscal governance under the Awami League and previous governments, particularly in the formulation and implementation of budgets.\nIn fact, the whole process of budgeting, starting from the very onset, has been plagued by a top-down approach, with very limited public participation and almost ceremonial legislative engagement. For instance, while many countries publish pre-budget statements—outlining the broad parameters of fiscal policies, economic forecast, and anticipated revenue, expenditures, and debt levels—to encourage discussion, Bangladesh does not do so. Moreover, recommendations from experts are seldom reflected in the proposed or approved budgets, rendering public consultation and any parliamentary discussion futile.\nEqually alarmingly, important materials that can help guide public debate—such as simplified budget summaries, monthly implementation reports, and audit reviews—are either missing or delayed. This trend is deeply problematic. In the absence of meaningful public participation in the decisions affecting their lives—such as which taxes to levy, which services to provide, or how much debt to take on—the whole process becomes authoritarian. The lack of transparency and accountability inevitably fuels inefficiency, waste, and corruption.\nThe question is, how can we expect people to pay taxes faithfully when they do not properly know where their money is going—having had little engagement or impact in the budgeting process—or worse, when they suspect that it is being misused? We must not let this trend continue. The interim government has a chance to demonstrate a clear break from the past, setting the ground for greater budget transparency from future political governments. It must begin by publishing a pre-budget statement to initiate public discussion, and ensure public opinion is properly reflected in eventual decisions. The authorities should also strive to adhere to global best practices at every stage of this crucial public matter.\n",
        "headline_1": "Let this budget mark a break from the past",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/let-budget-mark-break-the-past-3892676",
        "news_paper_name": "The Daily Star",
        "publish_date": "15-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 15, 2025 00:00:00  \nLabour-management relations have left much to be desired in this industrially least developed country. In a country of an oversize population, supply of labour has always outpaced the generation of employment. Naturally, owners of factories and industrial units have dictated the terms. But the problem with such an arrangement is that violation of labour rights as stipulated in the international charters safeguarding interests of workers is constantly under watch by rights bodies. As the apex body in this regard, the International Labour Organisation (ILO) persuades and guides the United Nations-member countries to improve the labour-management relations. In a global village, no country can pursue a close-door policy because UN-member states depend a lot on each other for trade, market and tariff. The interdependence is a sine qua non for their economic development, socio-cultural progress and prosperity. \nFor the least developed countries, particularly those on the threshold of the status of lower middle-income ones, the imperative of setting labour-management relations in order is greater because of endemic inattention to the basic issues related to such equations. No wonder, Lutfey Siddiqi, special envoy to the chief adviser for international affairs, felt the need to hold a high-level parley with diplomats of key Western nations and the ILO representative at the chief adviser's office to inform them of the progress made in amending the country's labour law. By the middle of next year, the amendment is likely to be completed, Siddiqi informed. During the deliberations, the diplomats present there reminded of the inalienable link between labour reform and market access, trade decisions and tariffs. With the country's graduation, the special preferences Bangladesh now enjoys in exporting its commodities to developed markets, particularly those of the European Union and North America under the World Trade Organisation's special and differential treatment (S&DT) will erode. If the labour law is amended aligning it with the ILO standard ---naturally to the satisfaction of all the parties involved, the country's preferential treatment in trade may be continued for yet another year after the graduation.\nHow Trump's America will respond to the proposed reform to the labour reform is not predictable. The US has sought a detailed proposal from Bangladesh how the later intends to narrow the trade imbalance between the two countries. Notably, in 2024, the US had a trade deficit of $6.2 billion with Bangladesh exporting to US goods worth $8.4 billion and importing from US commodities worth $2.2 billion. Surely, global economy was passing a fragile phase and this has been made still more uncertain and vulnerable with Trump's policy on reciprocal tariffs. \nEvidently, the year 2026 is going to be highly crucial for Bangladesh. Not only is it set to graduate as a lower middle-income country but also embark on a new course of political journey under an elected government after the July-August uprising. By this time, some of the much needed reforms have to be completed as a prior condition for bringing the house in order. The manufacturing sector together with law and order are prime candidates for sustainable streamlining so that industrial unrest can be buried once and for all with law and order creating the right environment for this and investment---both domestic and foreign--- in the productive sector.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Labour reform imperative",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/labour-reform-imperative-1747234040",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       May 15, 2025 00:00:00  \n\nThe Port of Chittagong stands on the brink of a transformative change, driven by the involvement of leading global players in port operations and logistics. Dubai-based DP World, renowned for managing some of the world's most efficient ports and logistics networks, is reportedly in the final stages of negotiations with the government to take over operations of the New Mooring Container Terminal (NCT). Meanwhile, operational activities have already begun at the Patenga Container Terminal (PTC) under the management of Saudi Arabia's Red Sea Gateway Terminal International (RSGTI), marking a significant milestone in foreign participation. In addition, substantial foreign investment is expected in the construction and operation of Bay Terminal and Laldia Terminal projects, signalling a broader trend of international engagement that could further modernise the country's port infrastructure, boost trade capacity, and enhance regional connectivity.\nStrategically located on the Bay of Bengal, Chittagong Port handles approximately 90 per cent of Bangladesh's total trade and 98 per cent of its container traffic. Despite some operational improvements in recent years, the port is still hamstrung by persistent inefficiencies that hamper its performance. The port lags far behind global standards: ships often have to wait several days offshore before berthing; container turnaround times is lengthy; and dwell times in port yards are excessive. The infrastructure upgrade has so far failed to keep pace with the rapid growth in trade volume.\nAccording to the World Bank's Container Port Performance Index 2023, Chittagong Port ranks 337th out of 405 global ports. The report reveals that average ship turnaround time at the port is 3.23 days-significantly longer than Colombo Port's 0.86 days. Import clearance takes an average of 11 days, and export border compliance requires around 36 hours.\nThe World Bank estimates that reducing container dwell time from 11 days to the international benchmark of three days could save the national economy hundreds of millions of dollars annually. Improved port efficiency could enhance export competitiveness by as much as 15 per cent, especially benefiting labour-intensive sectors through job creation and higher wages. Needless to say that port facilities are an important consideration in the investment decisions of foreign investors.\nIn the current context of Bangladesh's economy, deeper integration into global value chains is essential for achieving sustained growth. This requires not only expanding export volumes but also diversifying both export products and export destinations. At present, Bangladesh exports approximately US$ 50 billion worth of goods annually. To realise the government's ambition of turning the country into a global manufacturing hub, this figure must increase severalfold. Meeting this goal will necessitate urgent and substantial upgrades to port infrastructure, aligned with global standards.\nHowever, capacity development alone will not suffice unless logistical bottlenecks are comprehensively addressed. Weak connectivity between ports and inland transportation networks-such as roads, railways, and inland waterways-has been a major contributor to high costs and frequent delivery delays. While initiatives like the recently launched National Single Window (NSW) system aims to streamline regulatory processes, limited port capacity and outdated infrastructure continue to undermine seamless trade facilitation. \nAccording to the World Bank, logistics costs in Bangladesh range between 4.5 per cent and 4.8 per cent of total sector output-significantly higher than those in neighbouring countries and key trading partners. If Bangladesh makes specific improvements-like reducing delays at ports, improving road and rail connectivity, cutting red tape in customs, and streamlining the movement of goods-then total export earnings could rise by as much as 19 per cent. This means making logistics more efficient would make it easier and cheaper for businesses to export, making Bangladeshi products more competitive internationally. Additionally, the World Bank analysis indicates that a 1 per cent reduction in logistics costs alone could boost export demand for Bangladeshi products by around 7.4 per cent.\nDeveloping a multimodal logistics system that links ports seamlessly with industrial zones and economic hubs is thus vital to realising the country's commercial potential. According to UN-ESCAP, better infrastructure alone could generate an additional US$ 35.5 billion in revenue for Bangladesh by 2030.\nMajor upcoming infrastructure projects such as the Matarbari Deep Sea Port and the Chittagong Bay Terminal offer a ray of hope to transform Bangladesh's port management landscape. These initiatives are expected to dramatically increase port capacity, shorten export processing times, and reduce shipping costs by up to 15 per cent. However, the success of such projects will hinge not only on sound initial planning, but also on the timely and efficient implementation of the projects.\nExperts argue that Bangladesh has much to learn from global best practices. Vietnam's FDI-driven logistics strategy, for instance, has played a key role in improving port efficiency and enabling export diversification. Singapore's Port Community System-a digital platform integrating port users, customs, and other authorities-has streamlined processes, enhanced transparency, and accelerated trade flows. Adopting such best practices could help Bangladesh modernise its logistics ecosystem. Digital tools, including artificial intelligence, blockchain, and data analytics, can revolutionise customs clearance, reduce corruption, and improve real-time cargo tracking.\nBangladesh stands on the threshold of an economic transformation. To fully capitalise on this moment, the government must adopt a clear and forward-looking strategy. Encouraging private sector participation-particularly through public-private partnerships with globally reputed operators-offers a viable path to drive innovation, enhance efficiency, and attract critical foreign investment. At the same time, reducing public expenditure in inefficient sectors will help restore fiscal discipline. Streamlining customs procedures, lowering regulatory barriers, and embracing digital technologies are also vital to enhancing competitiveness.\nA modern, efficient, and transparent logistics system is not merely an infrastructure upgrade-it is a prerequisite for economic transformation. With bold reforms, strategic investments, and international cooperation, Bangladesh can position itself as a major player in global trade and build a resilient, competitive, and inclusive economy for the future.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Taking port capacity to next level",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/taking-port-capacity-to-next-level-1747234107",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 15, 2025 00:00:00  \n\nI am writing to draw attention to a crucial yet less discussed issue in our national business discourse-the urgent need for comprehensive policy support for Bangladesh's startup ecosystem. While the government has made strides in promoting digital transformation, the startup landscape, which has immense potential to drive economic growth and job creation, remains constrained by a lack of structural support, regulatory clarity, and investment incentives.\nStartups in Bangladesh, particularly in fintech, health tech, and e-commerce, are creating innovative solutions tailored to local needs. However, these ventures face significant challenges in accessing funding, navigating bureaucratic hurdles, and dealing with outdated regulations not designed for modern, technology-driven enterprises. Most early-stage entrepreneurs lack access to venture capital and must rely on personal savings or informal funding, limiting their scalability and survival.\nFurthermore, Bangladesh does not yet have a \"startup-friendly\" legal framework. Many founders struggle with company registration, foreign investment compliance, and intellectual property protection. Our neighboring countries, such as India and Vietnam, have already implemented dedicated startup policies, tax incentives, and government-backed venture capital funds. Bangladesh risks falling behind in the regional innovation race without similar proactive measures.\nI urge the relevant authorities to consider the introduction of a National Startup Policy that includes tax holidays for early-stage startups, easier access to credit and equity financing, startup incubation centers in public universities, and streamlined regulatory procedures. Encouraging angel investment through tax benefits and creating a startup stock exchange board for easier exits would also be game-changing steps.\nIn an economy where over 2 million youths enter the workforce each year, supporting entrepreneurship is not a luxury-it is an economic necessity. Let us not delay the opportunity to empower our brightest minds to build the future of Bangladesh.\nFatematuj Johora Momota\nStudent \nNorth South University\naminjohoramomota@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Policy support for startups",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/policy-support-for-startups-1747234135",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 15, 2025 00:00:00  \n\nPolice officers are often seen solely as agents of law enforcement, but behind the badge lies a workforce that increasingly includes women who are making significant contributions. Since 1974, when 14 women were first appointed to the Special Branch, female participation in Bangladesh Police has grown steadily. In 1976, the first uniformed female officers were recruited, and later, women began entering through the Bangladesh Civil Service Examination.\nAccording to recent data from Police Headquarters, there are currently 17,276 women serving in various capacities. These include 14,021 constables, 399 Nayeks, 1,344 Assistant Sub-Inspectors (ASI), 980 Sub-Inspectors (SI), 93 sergeants, 130 inspectors, and 309 officers in ASP and investigative roles.\nDespite this progress, many female officers face challenges balancing demanding workloads with family responsibilities, especially when shifts extend beyond 12 hours. Many express a strong desire for equitable treatment, seeking assignments beyond administrative duties and opportunities to handle serious cases. While senior officers are generally supportive, issues of inappropriate behaviour from subordinates and instances of sexual harassment have been reported.\nFemale officers play a vital role in promoting gender equality and public trust in the force. For this reason, there is a pressing need to improve working conditions, ensure fair distribution of duties, and foster a workplace environment that is respectful and free from harassment. Recruiting more women into the force, alongside reforms to support their advancement, will enhance both the effectiveness and the inclusivity of policing in Bangladesh.\n\nMd Tousif Raihan\nStudent, Department of Criminology and Police Science\nUniversity of Chittagong\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Women in policing",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/women-in-policing-1747234161",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-05-2025"
    }
]