[
    {
        "full_article": "The spectacular electoral victory of the National Democratic Alliance (NDA) in Bihar is one built on clever welfarism, astute social engineering, meticulous propaganda and the sustained popularity of Chief Minister Nitish Kumar and Prime Minister Narendra Modi in the State. The Opposition Mahagatbandhan of the Rashtriya Janata Dal (RJD), the Congress and other outfits suffered from the adverse popular memory of their reign, which ended 20 years ago. The NDA nurtured women as a horizontal voting bloc, even brazenly starting a new cash dole scheme on the eve of the election. Its caste alliance covered a larger spectrum, compared to the Mahagatbandhan, which, despite its best efforts, could not overcome the perception of being a narrow platform for Yadavs and Muslims. Mr. Kumar, who entered the campaign as a fading patriarch, turned around his fortunes, reinforced his centrality in Bihar politics, and became the fulcrum of the NDA victory. The BJP is ahead of the Janata Dal (United) in terms of vote and seat shares, but its route to Bihar’s heart is still through Mr. Kumar. The NDA seems to have benefitted from a considerable increase in female voter turnout and from welfare schemes focused on women and Economically Backward Class (EBC) households through cash transfers and self-employment subsidies. Despite being in power since 2005, with only a short break, Mr. Kumar not only deflected anti-incumbency but also enhanced his standing. This worked in combination with the image of Mr. Modi, whose Hindutva-development claims have many takers in Bihar.The Congress-RJD coalition failed to function as an organic platform, and its lack of cohesion and sense of purpose were all too evident. Its campaign was splintered, with its attention shifting between social justice and welfare slogans and a questioning of the integrity of the electoral process itself. India’s electoral process requires serious refurbishment, but does not seem to have much traction as an election issue. Also missing among the opponents of the BJP is an appreciation of the hegemony of Hindutva in the Hindi belt. There are many questions regarding the impartiality of the electoral process, but the conclusion that the BJP and its allies are winning only because of a compromised process is a misplaced one. While the NDA could mitigate the pitfalls of anti-incumbency, the Mahagatbandhan ended up holding the can for the misdeeds and misgovernance of a previous generation of its leaders. That is a sobering message for the Congress and all parties opposed to the BJP. They need to get their house in order, craft an inspiring message, and face up to the popularity of the BJP’s Hindutva politics while framing their opposition to it. Published - November 15, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        National Democratic Alliance\n                    \n                            /                      \n                        \n                        Rashtriya Janata Dal\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        welfare\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        Caste",
        "headline_1": "Double engine: On the Bihar Assembly election 2025 result",
        "headline_2": "Welfare schemes implemented close to the polls in Bihar helped the NDA",
        "link": "https://www.thehindu.com/opinion/editorial/double-engine-on-the-bihar-assembly-election-2025/article70280475.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "15-11-2025"
    },
    {
        "full_article": "President Donald Trump has garnered the dubious honour of presiding over the longest federal government shutdown in U.S. history, a 43-day spiral of economic uncertainty and gloom that was finally terminated this week. Plunging the lives of nearly 1.4 million furloughed and pay-denied federal employees into chaos, Mr. Trump and his Republican colleagues in Congress appeared to prevail over the hopes of Democrats to extend health insurance subsidies for low-income Americans, set to expire at the end of 2025. In return, they conceded precious little — the assurance of holding a vote in the U.S. Senate on the subsidies, but not a vote in the House of Representatives and no promised support by Republicans for the Democrats’ position on the subject. However, Republican lawmakers won by 60 votes against 40 in the Senate, to end the shutdown deadlock on Sunday, only because eight Democrats broke with their party ranks to support the package to fund some federal agencies and policies for the entire fiscal year, and others until January 30, 2026. A triumphant Mr. Trump vowed to press on with his campaign to end the congressional filibuster, the practice envisioned to be a means to check hasty or ham-handed legislative action, deployed by Democrats on this occasion to fight for affordable health care for low-income families.While breaking the logjam in Congress will come as a relief to many, it is hard to understate the impact of the shutdown on the economy, which saw the suspension of a range of public services, including flights, a setback to routine functions in sectors such as food and nutrition benefits including food stamps for the poor, early learning programmes for poorer families, and those relating to the Internal Revenue Service, national parks and social services more broadly. Yet, the sheer muscle power that Republicans enjoy through their control of both houses of Congress helped them put Democrats on the back foot on the shutdown issue, despite the latter’s victory in the recent mayoral, gubernatorial and other State-level elections. However, the acid test in the swing of the power pendulum between Mr. Trump, emboldened by the margin of his win at the ballots in last year’s presidential election, and resurgent Democratic lawmakers, will be next year’s mid-term elections. This will serve as a de facto referendum on the Trump administration’s job performance and will principally include within its purview economic policy issues impacting ordinary Americans, such as jobs, as well as questions on health care, education and immigration. Unless Republicans give some quarter to their liberal and progressive colleagues across the aisle, they face the risk of alienating a sizeable cohort of voters in the months ahead. Published - November 15, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        health insurance\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        family\n                    \n                            /                      \n                        \n                        air transport\n                    \n                            /                      \n                        \n                        food\n                    \n                            /                      \n                        \n                        nutrition and diet\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        US PRESIDENTIAL POLLS\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        immigration\n                    \n                            /                      \n                        \n                        health",
        "headline_1": "​Tepid relief: On the end of the shutdown in the U.S.",
        "headline_2": "The ending of the shutdown does not preclude other crises",
        "link": "https://www.thehindu.com/opinion/editorial/tepid-relief-on-the-end-of-the-shut/article70280503.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "15-11-2025"
    },
    {
        "full_article": "How BJP-JDU can start changing Bihar’s economic trajectory. Plus, lift the ban on booze\nWhat does NDA’s massive win mean for Bihar’s future? One key takeaway from BJP-JDU’s seat haul is that it’s clear the voter is neither expecting nor looking to the state to provide those elusive ‘govt jobs’, no matter promises made. There’s certainly realisation that govts simply cannot generate the jobs required. But there’s much that govt can do. And what is visible to the Bihari at large, both at home and to the migrant, is what’s been put in place over the last decade – building blocks for a state to develop. Govt investment in road infra is evident – even rural roads have expanded from a mere 1,000 km to 1L km. Over 58L dwellings were built in rural Bihar in last 10 years. Piped water coverage is total. Power consumption has increased. Law & order is relatively stable. All of which counts – a long haul from the Bihar at the turn of the century. So, where to from here?\nAfter 20 years of Nitish’s rule, it is critical to wean Bihar away from its ruinous near-total dependency on cash transfers and remittances. No governed entity can have its future determined by welfare payments and migrant income. Payouts, as a TOI columnist recently noted, were roughly 10% of annual revenue expenditure. Welfare spend just before polls was huge – Rs 10k disbursed to 1.5cr women while 1.1cr pensioners (widows, elderly, disabled) saw monthly pensions nearly triple from Rs 400 to Rs 1,100. Notching up a mighty bill of Rs 9,240cr annually. This has serious consequences for any state, but for Bihar, it means a fiscal wreck. Fiscal deficit at 9.2% of state GDP last year, Nitish’s hopes to cut this to 3% are naturally gone with the payout. Even rich Maharashtra struggles to fund its ‘ladki bahin’ scheme, serviced at the cost of other subsidies. Add to that the fact that migrant earnings, as an analyst wrote in TOI, make up 50% of household incomes – where per capita income is Rs 60k. Together, it makes for an unreliable foundation for growth in India’s poorest state. What Bihar needs, then, for meaningful change is what India needs: lots of private investment. Of course, that’s easier said than done. Private investment India-wide has weakened. State and PSUs have stepped in. In 2023-24, private sector share in gross fixed capital formation (GFCF) – a key measure of investment in physical assets – dropped to 33%, a sharp decline from over 40% in 2015-2016.\nSo, what can Bihar do for an immediate boost? Lift prohibition. In 2015-16, the year before Nitish’s poorly thought out ban, Bihar govt earned Rs 3,142cr excise, primarily liquor revenue, 12% of the state’s tax haul. The next fiscal, post-ban, excise earnings were down to Rs 30cr, and crashed to 0, where it’s stayed. Prohibition has had a grievous social cost. A parallel economy flourishes, hooch deaths have destroyed families. Look to brother UP – in 2023-2024, its excise earnings were Rs 45,571cr. Bihar shouldn’t parch itself of this revenue stream and must ditch the ban that’s run its course.\n\n",
        "headline_1": "NDA, Say Cheers",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/nda-say-cheers/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-11-2025"
    },
    {
        "full_article": "Islamabad blaming India and Afghanistan for terrorism on its own soil is laughable\nPakistan continues to live in a state of delusion. After a suicide bombing outside an Islamabad court claimed the lives of 12 people, Shehbaz Sharif quickly pointed fingers at India and Afghanistan. Needless to say, this is laughable and a poorly disguised attempt at defecting blame from Pakistan’s own failings. For a country that practically wrote the playbook on maintaining double standards on terrorism – nurturing terror purveyors while claiming to be victims of terrorism – it’s rich that it now tries to implicate others for its own sins. \nThere was time in the 1950s and 60s that Pakistan was being studied by foreign experts as a possible South Asian success story. But the disastrous measures of its leadership in 1971 in response to the liberation movement in what was then East Pakistan – now Bangladesh – served a body-blow to the very idea of Pakistan. Today, it continues similar colonial policies in Balochistan, provoking a powerful movement against Islamabad’s exploitation. During the Soviet-Afghan war, Pakistan hosted tens of thousands of mujahideen fighters to curry favour with US. Pakistani Taliban is their progeny. Recall also, it was merely a 100km from Islamabad in Abbottabad that bin Laden was found holed up.\nPakistan thinks it can play all sides and be friends with both US and China, turning to each whenever it needs to be bailed out. But it forgets that national strength stems from skilled people, institutions and economy. All three failed to develop because its military had other priorities. Today, Pakistan is a military dictatorship masquerading as a civilian regime. And with the 27th constitutional amendment – which gives lifetime immunity to Asim Munir – about to be passed, even the fig leaf of a hybrid regime is coming off. The question is how long Pakistan’s delusions can last in the face of its polycrises.    \n\n",
        "headline_1": "Joke’s On Pak",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/jokes-on-pak/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-11-2025"
    },
    {
        "full_article": "He sounds keen on a trade deal now, but it’s in India’s interest to wait for US Supreme Court order on his tariffs \nAfter delays, disappointments and a brief falling out, the India-US trade deal seems around the corner. Trump’s said it’s “pretty close”. Commerce minister Piyush Goyal sees it happening “any day” now, even “tomorrow”. For India, it won’t be a day too soon because $40bn worth of labour-intensive exports have been at stake ever since Trump imposed a punitive tariff on India in late Aug. US equally needs a deal to access Indian markets, and ensure the India-China thaw – forced by its own rigid stand on Russian energy – does not hurt its strategic interests. \nThe deal has to happen. Not because Trump considers India an “amazing country”, but because it is a nation of “actually, 1.5bn people”, where he expects his new ambassador, Sergio Gor, to “promote investments in key industries and technologies, increase American energy exports and expand our security cooperation”. Clearly, US needs India as much as India needs it. After his petulant “dead economy” jibe in July, Trump got real about India. By early Sept, he was looking forward to “speaking with my very good friend, Prime Minister Modi”. Birthday wishes, Diwali greetings, and thanks for “support on ending the War between Russia and Ukraine” followed.\nThere have been five rounds of trade negotiations meanwhile, and it looks like there’s nothing left to iron out now. For India, this resolution is commendable because not once – unlike UK, Japan, Korea, etc – did it rush to plead its case, and pump up Trump. It refused to bend under the burden of his 50% tariff, and as Goyal said, has refused to “compromise the interests of farmers, dairy and workers”. Likewise, Trump is satisfied that India has “very substantially” cut back its purchase of Russian energy. Bloomberg recently reported that five big Indian refiners have not ordered any Russian oil for Dec. That gives Trump his off ramp to slash tariff on India.\nThe stage is set then, but India shouldn’t sign the deal before Trump waives the penal tariff. When it goes, the balance 25% tariff would still be disadvantageous for India, vis-à-vis Vietnam, Malaysia, Cambodia and China, which enjoys unmatched economies of scale. Having been so patient for so long, India should aim for a 15% rate. There’s no need to rush because if US Supreme Court strikes down Trump’s tariffs in the coming weeks, the pre-Trump average US tariff of 3.3% would be far more advantageous than any deal.\n\n",
        "headline_1": "Trump’s Dealemma",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/trumps-dealemma/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-11-2025"
    },
    {
        "full_article": "New weapons of ‘mass’ destruction\nThere was much buzz last week over weight-reducing drug Mounjaro becoming No. 1 pharma brand, outselling infection-reducing Augmentin. This not only knocks inches off its exultant users but now made its manufacturer Eli Lilly inch past GSK. Its India partner for this is legendary KA Hamied’s Cipla, which till now was best known for knocking the bottom off Big Pharma. In fact, the multinationals lobby was rumoured to have deprived Cipla’s scientists of the Nobel it could well have won for its pathbreaking anti-retroviral HIV-AIDS therapies. Ah well, good to know it’s gone viral by now coming to the aid of those immuno-deficient against other appetites.\nWhat’s getting eyes popping and jaws dropping is the speed at which this WRD is mopping off competition. Its Sept sales jumped 42% higher than Aug’s. That’s when it gave a severe gastric attack to antacid Pan to become No. 2 in India. Should we call it Mounting KiliMounjaro?  Unlike Africa’s long-dormant highest peak, it has def created a volcanic disruption. \nOk, regardless of the belching lava (and not just from antacidwallas), isn’t the news about a WRD ousting an antibiotic something to celebrate? It suggests that more people are worried about the effect of burgers than of bacteria. C’mon, what’s not to hurrah about that?  \nLet’s take our Insta divas – and who isn’t, since everyone is on non-candid camera? If they’re swagging about with the give-away shriveled, hollow-cheeked look once reserved for those seriously afflicted, I’d say weight-reduction drugs are a great leveller. A social one especially, since going to bed hungry has leapt from dire necessity to lifestyle choice.\nAugmentin sales were augmented by its combinations which helped combat several multidrug-resistant (MDR) bacteria. Now along comes this aura-exuding WRD offering multicuisine resistance. ‘Gimme more!’ say the hip and hyped, ‘so I can eat less of more.’ And get a flat tummy without big-bucks tuck. Wow!\nThe icing on the chocolate cake is that it reduces blood sugar as well. Diet and diabetes tackled in one swallow. \nBtw, a major side-effect is heartburn/acid reflux. Revenge of the ousted antacids?\n                                                *** \nAlec Smart said: “The Hippocrates oath has been doctored – cynically.”\n\n",
        "headline_1": "Fat-checking",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/fat-checking/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 15, 2025 00:00:00  \nThe size of the investment that the formal lending institutions, that is, banks, have already made or are willing to make in a particular sector of the economy is indicative of the particular sector's importance in the economy. From that perspective, the blue economy does not seem to play a substantial role in Bangladesh's economy. According to a report carried by the Monday's, November 12, issue of this paper, the flow of bank credit to exploit the vast marine as well as maritime potential of the country has been both inadequate and inconsistent over the past years. Going by the central bank data, the total outstanding loan in the blue economy projects under green financing till June 2025 stood at Tk 8.48 billion. But looking back on December 24's figure of outstanding loans at Tk13.50 billion, there is reason to be flabbergasted at the behaviour of lean credit flow in the blue economy sector. Whatever are the particular factors at play behind the fall in credit flow during the first six months of the current calendar year, it clearly reflects the reality of the sector despite the rosy picture experts often portray about it at various discussion forums. \nGiven the fact that Bangladesh has a 710-kilometre coastline and extensive 'exclusive economic zone (EEZ)' that extends to 200 nautical miles equivalent to 118,813 square kilometres of maritime territory in the Bay of Bengal, it defies reason why both public and private investments have not poured into Bangladesh's blue economy on a massive scale as yet. Consider the marine resources including fisheries and aquaculture, shipping and maritime trade, tourism, offshore renewable energy and so on that could draw investments to create infrastructures, employments, improve livelihoods and boost trade. Especially, fishery resource of the sea needs to be exploited sustainably by way of preserving the marine ecosystem, which requires use of technology and scientific management of the fisheries and other aquatic resources. Moreover, just catching fish should not be the be-all and end-all of the fishery culture, for it is time, this sector is able to add value to its products for marketing at home and abroad. In addition to fishing, it should also involve farming of crustaceans, mollusks and aquatic plants. \nApart from aquatic life, other resources including the winds, tidal waves and abundant sunshine in the coastal areas can be harvested to provide power to coastal communities as well as the national grid. Since 90 per cent of the country's maritime trade is done through the Chittagong seaport, there is ample scope also for expanding the shipping trade through optimum utlilsation of Matarbari deep sea port once it is fully operational for commercial use. Also, the potential of ship building industry that has already built hundreds of small and medium-sized vessels for domestic as well as international markets should be exploited. But required investments to stimulate the different subsectors of the blue economy are missing? No project proposal involving blue economy has been submitted under the Bangladesh Bank's refinance scheme so far.\nThere is also talk of 'blue bonds', to draw private investment in the blue economy, as it is still in the conceptual stage. Experts are of the view that limited understanding of the financial industry about the blue economy is to a certain degree to blame for this poor investment picture. Banks have few tools to assess investment risks in its various sub-sectors as noted in the foregoing. In that case, the government is required to come up with a dedicated policy framework with provisions for fiscal incentives and capacity development for the sector. Meanwhile, the central bank in collaboration with relevant industries should develop a roadmap to encourage financing for blue economy.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Stimulating investment in blue economy",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/stimulating-investment-in-blue-economy-1763128913",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       November 15, 2025 00:00:00  \nBangladesh stands among the world's most climate-vulnerable nations, not only in statistical rankings but in the lived experience of millions. The country has entered an era in which the scale and frequency of natural disasters can no longer be predicted within familiar seasonal or geographical patterns. In the past year alone, districts such as Feni, Noakhali, Lakshmipur and parts of Cumilla were inundated by severe flooding, a calamity soon repeated in Sylhet regions. For the northern districts, floodwaters have become almost annual occurrences as monsoon flows from upstream regions in India overwhelm local rivers. Floods are not the only effects of climate change. Saline intrusion is happening faster in coastal areas due to rising sea levels which is hurting farming and driving internal displacement.\nThe seasons themselves no longer behave as they once did. Bangladesh was once defined by six distinct seasons that were culturally and environmentally recognisable. Today, these seasonal transitions have blurred. Winters are comparatively warmer and sometimes so mild that cold wave warnings come as a surprise. The shift from late autumn to early winter passes almost unnoticed. High temperatures persist for longer periods and heatwaves are more frequent, affecting public health, labour productivity and water availability. At the same time, river erosion continues to claim vast stretches of land. Homes, croplands, mosques, schools and marketplaces collapse into rivers as currents intensify. Communities relocate inland only to confront the same fate once again. \nThere is no real debate about the gravity of climate impacts confronting Bangladesh. The country ranked seventh in the 2020 Global Climate Risk Index, which evaluated impacts from 1999 to 2019, and ninth in the 2023 World Risk Index for disaster risk. Climate finance is directed to Bangladesh for the simple reason that it stands on the frontlines of global warming and carries burden it did not create. Yet at the very moment when the global community meets in Brazil for COP30 to discuss climate justice and future financing commitments, the Transparency International Bangladesh (TIB) has reported that more than US$248 million of Bangladesh's climate funds have been lost to corruption. As far as timing goes, this report could not have come as a more damaging moment. While world leaders gather in Belem to discuss climate finance, this revelation forces a hard look at how well climate funds are protected and how faithfully they reach those who depend on them. \nBangladesh's delegation arrived at the summit with clear priorities including a new global climate finance goal of $300 billion annually by 2035, operationalisation of the Loss and Damage Fund by 2026 and a doubling of adaptation finance. These are legitimate and urgent demands. However, the TIB report provides potent ammunition for critics in donor capitals who argue that financial commitments are wasted, thereby undermining the political consensus necessary to scale up funding. How can developed nations be persuaded to fulfil their $100 billion pledge and move towards trillions as Bangladesh proposes when evidence suggests that even limited existing funds are so easily misappropriated!\nThe diverted amount represents more than half of the Bangladesh Climate Change Trust Fund. These resources were intended to construct embankments, strengthen coastal livelihoods, improve water systems, build climate resilient infrastructure and support affected communities. Yet, according to the TIB report, project selection often had less to do with climate vulnerability and more with political convenience. Members of the Trustee Board and the Technical Committee exercised discretionary authority in ways that served partisan or personal interests paving the way for corruption within the fund's allocation process. \nThe TIB report further revealed that over 15 per cent of the Climate Trust Fund's money remains stuck in a financially-distressed bank. Recovery of these funds remains uncertain, which indicates a greater institutional deficiency in preserving public resources. International climate finance partners expect transparency, credible monitoring and independent audits as the bare minimum. When fund misuse becomes the headline, trust from those partners inevitably erodes and future allocations become uncertain. Undoubtedly, this has made the already difficult negotiations at COP30 even more fraught. For the people of Bangladesh, the implication is a double victimisation. They are first victimised by the climate impacts they did little to cause and second by the theft of resources meant for their protection. \nIn addition to the corruption scandal, there are concerns about how well the climate fund is being utilised in other areas. In many climate change adaptation projects implemented by NGOs, a significant portion of funding are dedicated to what is described as capacity building. In practice, this often means training sessions and workshops. Many donors and aid agencies view this as an essential project component, and NGOs respond accordingly. However, the outcomes have frequently been limited. Participants attend sessions, listen, take meals and return home only to resume their old practices. The intended behavioural transformation rarely materialises. Ironically, such expenditure is often categorised as successfully utilised, even though the practical impact remains negligible. This situation clearly calls for a more mature and realistic approach, one that focuses not only on capacity development but also on constructing physical infrastructure to help people withstand the effects of climate change.\nThe failure to protect climate funds at home weakens Bangladesh's position in advocating for fair global financing arrangements. The inadequacy of current global commitments is beyond dispute, but the legitimacy of these demands is now eclipsed by domestic governance lapses. To regain credibility, words must give way to action. The Climate Change Trust Fund should be reconstituted with non-partisan and independent expertise. Transparent audit mechanisms must be established, and community level monitoring and civil society oversight must be integrated at the project design stage. \nThe exposure of corruption ahead of COP30 presents a difficult moment, yet it also offers an opportunity to embed strong anti-corruption conditions into future climate finance frameworks. This proactive step is the only way to build the global trust necessary for these funds to be effective and impactful.\nshowaib434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "When climate crisis meets corruption",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/when-climate-crisis-meets-corruption-1763128975",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       November 15, 2025 00:00:00  \nAround two-fifths of the daily commuters in Dhaka walk to reach their destinations, whereas the ratio was one-fifth two decades ago. The data are impressive, no doubt, especially since the city is not particularly conducive to smooth walking. There is a lack of safe, accessible and efficient infrastructure to support walking. That is why walking in the city is somewhat hazardous. It is, thus, misleading to interpret the high ratio of walking in Dhaka as a reflection of a favourable environment for this. The truth is, many city people are forced to take hazardous walks mainly due to unbearable traffic congestion.\nThe barriers to a smooth and efficient walk in the city are well known and the measures to overcome them are clearly inadequate. In Dhaka, most footpaths are not for pedestrians but for makeshift vendors, parking motorcycles and sometimes private cars. They are also open abode for some drug abusers. In some places, footpaths are found broken and unusable. Open urination on footpaths and roadsides is also a common thing nowadays. All these factors force pedestrians to walk on streets and roads knowing that sharing roads with fast moving vehicles is against the law and also dangerous. The need for improving the infrastructure is urgent, so that footpaths remain free for walking. \nThe absence of an efficient public transportation system is a major problem in Dhaka. But it can be overcome. Imagine if there were decent and efficient public buses in the city. Commuters would find it comfortable to travel by bus instead of taking para-transit, such as rickshaws, CNG-run three-wheelers, and motorcycles. This would lead to a gradual decrease in the demand for para-transit, and more commuters would choose to walk to reach bus stops from various distances. Those who live closer to offices might also prefer to walk. Even students could walk to schools and colleges, with the roads and streets largely free from makeshift vendors and various para-transits. \nIt is well known that walking is beneficial for one's health; however, the city does not provide any support in this regard. Some people have the habit of taking a morning walk in nearby parks or open spaces. However, not all city residents are fortunate to make this simple and low-impact exercise. One good option to take a walk is to cover a certain distance on foot to reach offices, which is not often practised due to a lack of required conditions, such as barrier-free footpaths and clean streets. The poor walking conditions not only discourage walking but also pose a significant threat to public health, as the lack of physical activity contributes to various health issues.\nWalking also helps socialisation. When people walk together regularly, they gradually come closer and develop a sense of social bonding. It is most visible among the students as they walk to and from school, a time spent together when they indulge in talking and fooling around. This social aspect of walking is not just a by-product, but a vital element of urban life that residents need to strive to preserve and enhance. \nWalking is a fundamental aspect of mobility, and without sufficient space for smooth walking, mobility cannot be efficient or productive. Every day, millions of people in Dhaka lose valuable working hours due to inefficient mobility, stemming from inadequate public transport and inaccessible walking paths. In other words, walking on foot and movement through transport are complementary. Finally, walking helps to contain the environmental pollution in the long-run by reducing the demand for motorised vehicles to some extent.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ensuring smooth walking for pedestrians",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ensuring-smooth-walking-for-pedestrians-1763129000",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 15, 2025 00:00:00  \n\nAccording to the International Labour Organization (ILO), around 138 million children worldwide are engaged in child labour. Shockingly, 87 million are in Africa, accounting for nearly two-thirds of the global total. Theirs is not just light work-nearly 54 million children are involved in hazardous labour, putting their safety and development at serious risk. Data show that 62 per cent of these children work in agriculture, 27 per cent in domestic or service sectors, and 13 per cent in industrial jobs, including construction, manufacturing, and mining, some of the most dangerous fields. The majority of these cases are concentrated in developing regions of Asia and Africa.\nWhat drives this grim reality? Why does child labour persist despite being punishable by law? What roles do families and society play in this cycle?\nThe root cause is extreme poverty. Child labour rates are negligible in developed nations but rampant in countries where per capita income is low, job security is scarce, and daily survival is the primary concern. When parents' earnings fall short of basic needs, they are often forced to send their children to work-not by choice, but out of necessity.\nLack of education and social awareness also play a significant role. In many underdeveloped countries with low literacy rates, child labour is often normalised and viewed as a routine part of life. When injustice is normalised, it continues unchecked, trapping generation after generation of children in the same cycle.\nFor many poor families, education is an unaffordable luxury. Even with free textbooks, costs such as uniforms, transportation and supplies make schooling financially impossible. For others, immediate income seems more valuable than education, making child labour an inherited condition passed from one generation to the next.\nEradicating child labour requires strong government intervention. The authorities must provide financial support to impoverished families, reduce educational expenses, create stable employment opportunities and offer short-term relief to disaster-affected households.\nLaboni Akter Kobita\nDepartment of Public Administration\nJagannath University\nlaboniakterkobita6@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why child labour cannot be eradicated?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-child-labour-cannot-be-eradicated-1763129026",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-11-2025"
    }
]