[
    {
        "full_article": "Parties and alliances, and variegated caste and interest groups, are repositioning themselves to optimise their strengths in Bihar before the Assembly election which is due later this year. After the BJP’s victory in Haryana for a third time in a row and the NDA recouping its losses in the 2024 general election to return to power in Maharashtra, all eyes are now on Bihar. There are intra-party and inter-party dynamics at play in both poles — the NDA on the one side and the Mahagathbandhan of the RJD, the Congress and the Left on the other. On Tuesday (April 15, 2025), RJD and Congress leaders met in Delhi, with more discussions to follow. Last month, Home Minister Amit Shah paid a two-day visit to the State, and Prime Minister Narendra Modi is expected to visit Madhubani on April 24. The BJP, which has played second fiddle to the Janata Dal (United) for nearly two decades, is restive for the lead role. In a Freudian slip, Haryana Chief Minister Nayab Singh Saini said at an event in Gurgaon, that Bihar Deputy Chief Minister and BJP leader Samrat Choudhary would unfurl the “flag of victory” in the Assembly polls. This led the RJD to gleefully ask whether the BJP had abandoned Bihar Chief Minister Nitish Kumar, which in turn left the BJP scrambling to clarify matters. With his advancing age and frail health, Mr. Kumar is under scrutiny.In the Mahagathbandhan, there is distrust. The Congress and the Left are wary that the RJD will leave seat-sharing arrangements to the last minute, giving them little room to manoeuvre. In addition, the Congress has complained that it is often burdened with weak seats and later criticised for bad strike rate, citing the example of the 2020 elections where it could win only 19 seats out of the 70. The CPI(ML), which registered a stunning performance in 2020, winning 12 of the 19 seats it contested, has lamented that despite strong cadres, it is given the smaller share of the seat pie. The RJD too has its own demons to face. Since 2005 it has not been able to return to power, barring the short interludes when it allied with the JD(U) in 2015 and in 2022. Its vote share remains static and while it has repeatedly come within striking distance of power, the last mile seems far too arduous for it to cover. While the leading parties face challenges within and outside, there is also a wider political churn. On Monday (April 14, 205), Union Minister Chirag Paswan’s estranged uncle, Pashupati Kumar Paras, who leads one of the two factions of the erstwhile Lok Janshakti Party, cut his ties with the NDA. Political strategist-turned politician Prashant Kishor’s Jan Suraaj is struggling to find a foothold despite the bluster. All told, Bihar promises to be an open contest, with many variables still in the mix. Published - April 16, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        politics\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        Assembly Elections\n                    \n                            /                      \n                        \n                        National Democratic Alliance\n                    \n                            /                      \n                        \n                        General Elections 2024\n                    \n                            /                      \n                        \n                        Maharashtra Assembly Elections 2024\n                    \n                            /                      \n                        \n                        Rashtriya Janata Dal\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Haryana\n                    \n                            /                      \n                        \n                        Janata Dal (United)\n                    \n                            /                      \n                        \n                        Lok Janshakti Party",
        "headline_1": "Bihar rumblings: On political parties and the Bihar poll",
        "headline_2": "A political churn makes the coming election an open contest",
        "link": "https://www.thehindu.com/opinion/editorial/bihar-rumblings-on-political-parties-and-the-bihar-poll/article69453214.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "16-04-2025"
    },
    {
        "full_article": "In April 2023, a power struggle between two generals pushed Sudan, which witnessed a revolution and a counter-revolutionary coup in the preceding years, into a devastating cycle of violence. The conflict has displaced nearly 13 million people, transformed cities, including the capital, Khartoum, into war zones, and triggered economic collapse, inducing the world’s first officially declared famine in four years. More than 1,50,000 people have lost their lives. Yet, the generals, army chief Abdel Fattah al-Burhan, and head of the notorious paramilitary Rapid Support Forces (RSF) Mohamed Hamdan Dagalo, are not done fighting. Although the army suffered setbacks early in the conflict, it has regained ground. Late last month, in a blow to the RSF, Gen. Burhan’s forces took control of Khartoum. The military controls much of northern and eastern Sudan, including the Red Sea city of Port Sudan, the de facto wartime capital. However, the RSF, a potent force, maintains control over much of the western Darfur region, where it is currently laying siege to El Fasher, an army stronghold. Recently, the RSF declared a parallel government in the areas under its control, seeking to shore up political support. So, despite the army’s gains, a decisive victory seems far away.While the RSF faces credible allegations of large-scale atrocities against civilians, including the rape of children, both sides bear responsibility for Sudan’s descent into chaos and anarchy. The country hoped for a new dawn when mass protests brought down the brutal three-decade dictatorship of President Omar al-Bashir in 2019. After his fall, the military and civilian leaders shared power in a transitional administration, which was seen as a stepping stone toward full civilian rule. But in 2021, Gen. Burhan, then head of the transitional government, refused to hand over power to the civilian leadership. He joined hands with Mr. Dagalo, to orchestrate a coup. Their alliance soon collapsed, bringing civil war. For two years, the international community largely turned a blind eye, while regional powers supported rival factions. The military accuses the UAE of backing the predominantly Arab RSF, while the army gets support from Russia, Türkiye, Iran and Qatar. But two years of war is a testament to the fact that there can be no military solution. Civilians have endured relentless air strikes by the army, indiscriminate attacks and looting by the RSF and a near-total collapse in health care, education and access to food and water in the war-hit areas. The world must pay attention to Sudan’s humanitarian crisis and push for urgent, meaningful talks between the warring factions. What Sudan needs is an immediate ceasefire, followed by humanitarian aid so that at least some measure of stability could be restored. Published - April 16, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Sudan\n                    \n                            /                      \n                        \n                        armed conflict\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        famine\n                    \n                            /                      \n                        \n                        armed Forces\n                    \n                            /                      \n                        \n                        sexual assault & rape\n                    \n                            /                      \n                        \n                        children\n                    \n                            /                      \n                        \n                        United Arab Emirates\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        Turkey\n                    \n                            /                      \n                        \n                        Qatar",
        "headline_1": "​Self-perpetuating cycle: On the violence and crisis in Sudan",
        "headline_2": "Sudan’s humanitarian crisis needs the world’s attention",
        "link": "https://www.thehindu.com/opinion/editorial/self-perpetuating-cycle-on-the-violence-and-crisis-in-sudan/article69453196.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "16-04-2025"
    },
    {
        "full_article": "A remarkable olive ridley shows why Maharashtra needs to up its turtle conservation\nOlive ridley turtle tagged ‘03233’ made history. The first flipper-tagged turtle on record to cross India’s coasts and two ocean basins has sent an important message to the scientific community and marine conservation ecosystem. 03233 was flipper tagged in 2021 during mass nesting on an Odisha beach. In 2025, she was solo nesting on the Konkan coast, where she laid 120 eggs, higher than the west coast average of 90-95 eggs.\nThe event’s scientific significance cannot be overstated. Hers is the first recorded nesting at two beaches in the same period. This, when there was no apparent reason – like climate stress – for 03233 to turn west and north from turtles’ normal migration route along Sri Lanka. It also shows interconnectedness of marine ecosystems on either coast, calling for a pivot on current theories of movement patterns. Last few years have seen numbers of olive ridleys nesting along the west coast grow – indicating favourable conditions to lay eggs. Of 3,500 nests counted from Gujarat to Kerala, 2,500 were on Maharashtra’s shoreline. The state hosts 20% of India’s olive ridley nests – Guhagar, where 03233 fetched up, has almost 300 nests. Scientists are also studying if the west coast ones are residents (they seem to hang around in Arabian waters) or migrants – like 03233.\n03233’s sea-trek has provided the what & where, now to understand the how & why. As WII’s census of turtles gets underway, it’s essential that both flipper and satellite tagging are scaled up with funds, improved tags and trained conservators, to better track turtle movement. Their paths will inform coastal zoning and turtle-safe fishing areas. Animals travel huge distances in search of correct climate conditions for feeding & breeding grounds. If parts of Maharashtra’s coast – prey to builders and tourists – are the big new hangout for olive ridleys, much conservation effort is needed to make these safe for turtles.\n\n",
        "headline_1": "Turn turtle",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/turn-turtle/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-04-2025"
    },
    {
        "full_article": "The Indian Elephant must learn to dance to gain from Trump’s tariff wars\nCan elephants be taught to dance? Appu, the cute baby elephant mascot of the 1982 Asian Games in Delhi, was depicted as a prancing pachyderm.\nBut can that other Elephant, as India’s lumbering economy is frequently described, learn to rise up on its hind legs and be as nimble as Appu in order to take the advantage likely to accrue to it as a result of Donald Trump’s tariff jihad.\nUS has put a 90-day hold on tariffs for every country except China, on which Trump has imposed a whopping 145% duty, compared with 26% that could be levied on India.\nNew Delhi ought to make the most of this competitive edge of a lower tariff to mop up some of the US market share that China currently enjoys.\nIndia should develop a strategy to benefit from this, and export more to the American consumer, already hard hit by the high cost of living and more avid than ever for inexpensive products, from T-shirts to TVs.\nHowever, in order to seize this Trump card, The Indian Elephant has to be induced to jump through hoops if necessary to get the job done.\nAccording to a 2020 World Bank report on ease of doing business, India’s ranking leapt up from a low 142nd position (2014) out of 189 economies to 63rd place. The Indian Jumbo can jump, but not high enough as yet.\nPM’s Make in India initiative is weighed down by high costs. According to a report, the comparative investment for setting up a small factory in Maharashtra would come to over $971,000 compared with $777,000 in Thailand.\nAs if this financial load wasn’t enough to hamper its agility our Elephant is entangled in bureaucratic red tape. There are 1,536 laws that directly or indirectly affect the doing of business in India. These involve getting 69,233 compliances at the state and central levels, the fine print of which has 26,134 imprisonment clauses.\nWhich for our would-be jiving Jumbo spell Jailhouse Rock, or the jig’s up even before the dance has begun.\n\n",
        "headline_1": "Jumbo’s jig",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/jumbos-jig/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-04-2025"
    },
    {
        "full_article": "Curbing rare earth exports may be China’s way of projecting power, but it could backfire\nFor over 10 days now, China has not exported rare earth metals and powerful magnets made out of them. This is part of its retaliation against Trump’s reciprocal tariffs, but the export pause hurts all countries, not just America. China has been careful not to call it a ‘ban’. It says exports will resume after it creates a new licence system. The fear is that it will use its discretion to hurt unfriendly countries like US. Delays of 45 days or more are likely, NYT reports.\nRare earth metals are key ingredients of electric cars, rockets, computer chips, even vacuum cleaners, so a supply choke will hurt industries downstream. Tesla cars and other EVs, for instance, can’t do without super-strong magnets. Critically, US and everyone else needs them for military applications like drones that have proved their worth in the Ukraine war. But this is China’s moment. It has built a monopoly on rare earth processing – the metals themselves aren’t actually ‘rare’ in soil – and magnet manufacturing. So it can pay back US for tariffs and the AI chip ban.\nIs US rattled? Trump adviser Kevin Hassett has termed China’s decision “concerning”, but there’s no panic at the moment, probably because this isn’t the first time China has weaponised its rare earth monopoly. It stopped exports to Japan in 2010, with the result that Japan maintains a year’s stockpile now. US does not have a large critical reserve of rare earths, but as Bloomberg expert Javier Blas points out, rare earths aren’t such a big deal. US buys just $170mn-worth of them in a year. That’s 0.03% of its trade with China. Makes you wonder why Trump embarrassed Zelenskyy for $500bn-worth of rare earths that would serve US needs for about 3,000 years.\nThe point is, while Trump’s tariffs are bad, China is doing itself no favour with this rare earth blackmail. US, which was world’s biggest rare earth producer once, gave up because extracting these metals is a dirty process. However, countries like Australia are more than happy to step in. A US mine will start operations later this year. India also has huge rare earth potential and could become a big supplier. But to protect their new rare earth industries from Chinese dumping, all countries will resort to hefty tariffs. It will be China’s loss.\n\n",
        "headline_1": "Beijing blunder?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/beijing-blunder/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-04-2025"
    },
    {
        "full_article": "By- Swami Bhoomananda Tirtha\nWith spiritual practice, you must be able to absorb and assimilate any input from the world, and at the same time, generate timely response to deal with whatever difficult situations you face. When you interact with persons, places, and events, you must not get intimidated or affected by them, on the one hand; and on the other, you must have necessary resolve, impetus, inspiration and determination to go ahead with your interactions, despite challenges.\n\nSpirituality facilitates this two-fold accomplishment. Your personality is biological only at bodily level. At intelligence and ego level, your personality is beyond matter and energy. Inside the gross body, mind employs the body. Intelligence and ego are superior; however, we must go beyond the ego and reach the Soul.\nAt the Soul level, a sadhak experiences ‘zero’ nature. There, no action or vibration ever exists. No effect or affectation ever befalls! This state is ‘akartrtva’and‘abhoktrtva’–astate of non-doership and non-enjoyership.\nThis level is within you. You do not have to acquire it. That is why, despite the gravest misfortunes and the greatest calamities and impacts, victims can go to sleep. When you recover from all troubles and anxieties, it is your mind that recovers, and it does so only because of the Soul.\nThe Soul is infinitely potent. All egoistic, intelligential, mental and physical activities are possible only in Its presence. This Soul has a zero factor, and at the same time it is Infinite too! Whenever you want, you must be able to resort to its zero-aspect or tap its infinite dimension.\nAnother phase of your sadhana is about your reliance on the Supreme. Religion advocates that God is always supreme, and you should rely upon Him. But the reliance belongs to you, to your mind. Once you have that reliance, you can look to your own mind and make its reliance stronger. Let every object, incident, development and accident become Godly.\nYour sadhana now becomes three-fold. Seeing God in everything, relying upon Him for everything, and recognising existence of the Soul, which has the zero-factor as well as the infinite potential. If you club these three, then there is nothing more that you require.\n\nSwamiji will be in CIRD Delhi (Vasundhara, Ghaziabad) from April 4 to 20. For details, contact: 98112 03815\n\n",
        "headline_1": "Be a non-doer and non-enjoyer",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/be-a-non-doer-and-non-enjoyer/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-04-2025"
    },
    {
        "full_article": "Music, fairs, and colourful processions—the celebrations welcoming the Bangla New Year 1432 were truly a sight to behold. On Monday, people came out in droves to participate in what is typically the largest festival observed in the country, particularly in Dhaka. This year's festivities carried special significance, being the first after the fall of a dictatorship that had pushed the people to the edge for more than a decade.\nMisgivings abounded ahead of the celebrations though, especially after two motifs created for the Borsho Boron Anondo Shobhajatra were burnt down on the Dhaka University campus just two days prior. There was also controversy surrounding the renaming of the traditional morning procession in the capital. Fortunately, the unease that had been thus stirred did not overshadow or mar the festivities eventually. In the end, a greater sense of unity and togetherness prevailed.\nWhat truly set this Pahela Baishakh festival apart was the scale of public participation: members of about 28 different ethnic minority communities, along with people from all walks of life, joined in the processions and festivities. From eight-year-olds to octogenarians, everyone came out to proudly stake their claim to a shared heritage and cultural identity. The message of peace, inclusivity, and diversity was loud and clear. This, we must acknowledge, was made possible by the government's commendable efforts in ensuring that the celebrations proceeded smoothly and safely.\nThat is not to say the festivities were entirely without blemish. The suspension of celebrations at Chattogram's DC Hill, for example, was quite distressing. It followed an attack by a group of miscreants, identified as members of the BNP-backed Jatiyatabadi Samajik Sangskritik Sangstha (Jasas) and its like-minded organisations, who opposed the programme and vandalised the venue. This is an issue that BNP should address with due seriousness.\nApart from that, beyond the music and joy and food, festivals like this should also prompt reflection. Ours is a heritage built on resilience, communal harmony, and compassion, but we must also confront the uncomfortable truth that intolerance, exclusion, and discrimination have increasingly taken root in our society. Monday's celebrations marked a step towards resisting those influences and reaffirming our collective desire for a truly equal and inclusive society. Moving forward, we must strive to be free from prejudice and inequality in all spheres of life. Our social, political, and economic systems must become truly inclusive and diverse, and the discrimination still faced by marginalised communities must be eradicated. Only then can we build a society that truly reflects the spirit of Pahela Baishakh.\n",
        "headline_1": "A potent display of unity amid diversity",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/potent-display-unity-amid-diversity-3871976",
        "news_paper_name": "The Daily Star",
        "publish_date": "16-04-2025"
    },
    {
        "full_article": "I did not vote for Donald Trump but accepted the election result with the hope that our president will succeed. Like most Americans, I do not take an interest in national politics daily. To most of us, a candidate, once elected, represents all voters and, hopefully, acts in the best interest of the nation. Presidents have also historically served as role models for most Americans. George Washington, Lincoln, Roosevelt, Kennedy, and Obama have been inspirational figures for me.\nPresident Trump has now been president for almost 100 days, and I must admit that no other president in recent memory has dominated the headlines and initiated as many changes in such a brief time. At the time of independence, the American president's job description reflected that of a monarch, albeit with the checks and balances of the judiciary and the Congress. With a compliant judiciary and a Republican majority Congress, President Trump is working as an unchallenged monarch.\nHowever, I am yet to see signs of \"winning\" or becoming rich anytime soon, as he had repeatedly promised during the election. On a micro level, I am still paying almost $7 for a dozen eggs, and the gas prices have not changed much. My friend just bought a used car financed at a 14 percent interest rate! This year's college graduates have the fewest job offers in recent memory.\nUnder Trump's presidency, the influx of illegal workers to the United States, particularly through the southern border, has drastically gone down. However, street crimes in major cities have not. Soon, it will be interesting to see how farmlands from the south to the mid-west are going to be prepared for corn, soybean, and wheat planting, and later harvested without migrant labour. Also, why aren't we focusing on the big businesses which hire undocumented immigrants in the first place? There is already a strong law against the hiring of illegals. Why doesn't the Trump justice department enforce the existing laws?\nThousands of federal workers are being laid off without following any process, and billions are being slashed in the name of fraud and inefficiency. Concurrently, the highest income earners and largest defence contractors are getting away without paying any taxes. The process of awarding defence contracts and how defence dollars are spent need to be scrutinised as well.\nThe issue which has totally confused and bewildered both businesses and consumers is the choice of tariffs as the principal policy instrument to strengthen the American economy. One can make a case for tariffs or quotas for short-term gain, but it has always proven to be ineffective in solving fundamental economic inequities or the competitive position of any country in the long run. Unilateral tariffs always bring about retaliation. Historians blame the tariff war among nations as one of the principal causes of the 1930s depression.\nTariffs and the threat of tariffs have created a sense of uncertainty for businesses. All the industrial indexes, like the Dow Jones and Nasdaq, were down, and consumer confidence had plummeted to a new low. Most Americans, who are at least indirectly connected to the stock market via their retirement plans, have seen their net worth go down. Businesses have gone into a holding pattern to new investment, expansion, and hiring.\nAmerica has been losing its competitive advantage for a while now, and China is not the culprit. It is the American multinational companies which took the jobs to China and made the US dependent on Taiwan for the chips needed for semiconductors. Even the common drugs needed for routine medical care come from China and India. In the multipolar world of 2025, the US economy is far more vulnerable than at any other time in contemporary history.\nMost US voters do not know and have seldom questioned why we have a military presence in 100+ countries and why China has a trade surplus with most of them. China has more leverage over most of those countries than the United States.\nIn the international political arena, the United States is usually considered the \"good guys.\" Sadly, after the disasters in Vietnam, Libya, Iraq, and Afghanistan, the US is perceived as an unreliable friend who has no problem walking away from commitments. Recent pronouncements from the White House have undermined NATO. Concurrently, the US sided with Russia and North Korea in a recent UN General Assembly vote.\nStiff tariffs have been imposed on products from Canada and Mexico. Canada and Mexico are not competitors but trading partners who make complementary and intermediate products for many American companies. Canada, US, and Mexico together can be a competitive unit against the challenges from China or the European Union.\nTrump and his vice president's public pronouncements and behaviour with friends and foes alike have brought back the spectre of the \"Ugly American\" stereotype, depicting Americans as loud, arrogant, self-absorbed, thoughtless, demeaning, and ethnocentric. Most Americans, and certainly the younger generation, no longer fit the stereotype, but President Trump certainly does. No, Mr President, we are not winning!\nFaisal M. Rahman is professor and founding dean of the Graham School of Management, Saint Xavier University, Chicago. He is also the CEO/president of the APAC group of healthcare companies. He can be reached at [email protected] or [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Is the US winning under Donald 'Tariff' Trump?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-us-winning-under-donald-tariff-trump-3871736",
        "news_paper_name": "The Daily Star",
        "publish_date": "16-04-2025"
    },
    {
        "full_article": "It's not every day that you open your morning newsfeed and find a Labour MP from Hampstead and Highgate wanted by the authorities—not in Westminster, but in Dhaka. Tulip Siddiq, niece of ousted Prime Minister Sheikh Hasina, darling of North London's progressive set, and former Economic Secretary to the Treasury, now finds herself tangled in a legal mess that smells suspiciously like a cross-border family drama mixed with post-dictatorship retribution.\nThe Dhaka court has issued an arrest warrant for Siddiq, accusing her—along with over 50 others, including her mother Sheikh Rehana and brother, Radwan Mujib—of illegally acquiring land in the diplomatic zone of the city. Not a bad postcode to inherit, one might think, but the allegations are less about location and more about symbolism. Because if you're wondering whether this is about one 7,200-square-foot plot, let me assure you: this is about political karma being served with a side of national catharsis.\nTo fully understand the implications, one must remember that Tulip Siddiq is not just a British MP. She is the British MP who embodies the soft power of the Bangladeshi ruling dynasty. A Western-educated, well-spoken, multicultural poster child for Labour's diversity credentials, she has long enjoyed the privileges of both proximity to power and distance from the consequences of it. While Sheikh Hasina tightened her grip on Bangladesh's democratic institutions with a precision that would make autocrats weep with envy, Siddiq remained largely unscathed in London, smiling her way through party conferences and ministerial posts. Her loyalty to her aunt was discreet but undeniable. She never bit the hand that buttered her family's legacy.\nBut Bangladesh is no longer playing the same game. Hasina is gone. The July uprising sent her packing, the student protesters did what international observers and decades of diplomatic side-eyes could not. And now, the country's interim regime—led, almost ironically, by Nobel laureate-turned-political-plumber Muhammad Yunus—is sifting through the mess. The Anti-Corruption Commission, armed with more paperwork than subtlety, is rolling out a full-fledged accountability crusade, and the Sheikh family is first on the chopping board.\nThe arrest warrant for Tulip, though legally impotent due to the lack of a UK-Bangladesh extradition treaty, is politically potent. It sends a message: the age of impunity is over. Or at least, that's the tagline. In reality, this is a high-stakes theatre of justice, a performance calibrated for both domestic rage and international headlines. Whether it leads to actual convictions or fizzles out in bureaucratic ambiguity remains to be seen. But what's certain is this: Tulip Siddiq is now a symbol—no longer just of multicultural Britain, but of the entangled mess that is globalised nepotism.\nShe, of course, denies everything, claims she never owned land in Bangladesh and that this is nothing more than a politically motivated smear campaign. And perhaps it is. One doesn't need to be a fan of the Sheikh dynasty to recognise that transitional justice often has the precision of a wrecking ball. But for someone who benefited from the very architecture of dynasty politics, Siddiq's sudden plea for distance and neutrality feels, shall we say, rich.\nIn the UK, the response has been relatively muted. Some murmurs about reputational risk, a resignation from her Treasury role in January to keep the scandal from distracting the government—how very noble. But one wonders if the British establishment will ever truly grapple with the awkward implications of having democratically-elected officials with familial ties to regimes accused of human rights abuses.\nWhat's even more ironic is the timing. Britain, still recovering from its own post-Brexit identity crisis, now finds one of its MPs embroiled in a land-grabbing scandal halfway across the world. It's the kind of storyline that writes itself: former colony issues arrest warrant for the niece of a former dictator, who just so happens to be an MP in the imperial centre. Somewhere, a postcolonial studies professor is having a field day.\nBut let's not get too smug. Because this isn't just about one MP or one dynasty. This is about the consequences of letting familial loyalty trump democratic responsibility. About how diasporic elites often benefit from the best of both worlds—power at home, prestige abroad—and are held accountable in neither. It's about how justice, when delayed or denied for too long, begins to resemble vengeance when it finally arrives.\nTulip Siddiq might survive this scandal. She might stay comfortably nestled in her North London constituency, issuing carefully-worded statements about injustice and dignity. But her political sheen is tarnished. The narrative of the polished, progressive MP coexists now with headlines about shady land deals and family empires.\nAnd as Bangladesh hurdles towards its own reckoning—balancing vengeance and virtue, justice and spectacle—Tulip's story serves as a cautionary tale not just for politicians with powerful bloodlines, but for any democracy that lets power pass through the family tree like heirloom jewellery. Eventually, the tree is shaken. And sometimes, the flowers fall the hardest.\nBarrister Noshin Nawal is an activist, feminist, and a columnist for The Daily Star. She can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Dynasties bloom on foreign soil causing Tulip troubles",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/dynasties-bloom-foreign-soil-causing-tulip-troubles-3871636",
        "news_paper_name": "The Daily Star",
        "publish_date": "16-04-2025"
    },
    {
        "full_article": "We are concerned about the ongoing trend of political violence that has gripped the country in recent months. According to a report by the Human Rights Support Society (HRSS), at least 23 people lost their lives and 733 others were injured in over 97 incidents of political violence in March. Meanwhile, there were at least 40 cases of mob beatings resulting in 12 deaths and 44 injuries—some of which were also reported to have been driven by political motives and personal grudges. As for the parties involved in political violence, we are told that the majority of attacks were confrontations between rival factions of BNP activists. Of the 23 people killed in such violence last month, 18 were reportedly affiliated with BNP.\nWhat has led to this surge in political violence? Why can't political parties control their errant members and establish discipline? The manner in which some of the attacks were carried out shows how out of control many political activists and leaders have become. On March 12, a BNP activist was killed during a clash at an iftar programme. Earlier, a BNP leader was beaten to death by his rivals right in front of his wife. It is clear that criminal elements embedded within some of the parties are feeling emboldened by the normalisation of such violence over time and the lack of legal or political consequences. This is unacceptable.\nThe BNP, in particular, must take responsibility for the surge in intra-party violence. Although it has expelled quite a number of party members for their involvement in violent incidents, these actions have proven insufficient as a deterrent. The BNP, therefore, must take stronger measures and send a clear message to all its members and supporters that any involvement in political violence will have immediate and dire consequences. Equally importantly, law enforcement agencies must act decisively to curb violence and refrain from favouring any party or individual while doing so.\nAll stakeholders of post-uprising Bangladesh should come together to help restore the rule of law. This means the police should act with greater resolve, political parties should take responsibility for the crimes of their members, and community and religious leaders should actively discourage mob violence. A new Bangladesh demands a new political expression that doesn't involve impulsive violence.\n",
        "headline_1": "Political violence has to stop",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/political-violence-has-stop-3869451",
        "news_paper_name": "The Daily Star",
        "publish_date": "16-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 16, 2025 00:00:00  \nJust days after the investment summit was held where investors from home and abroad were welcomed by the interim government with open arms, the country's energy regulator in a paradoxical move reportedly hiked up gas price for new industrial and captive power plant connections by 33 per cent. However, for older industries with existing (gas) connections, unless they are going to increase their consumption exceeding the allocated load, for instance, moving to further expand their business activities, the older rate of tariff will apply. Similarly, existing consumers including power plants, fertilizer factories, CNG filling stations, tea estates, etc., will pay tariff according to the pre-hike rate . Now, one wonders, how can new investments take place, if fuel (gas) price is increased in such an arbitrary fashion? Unsurprisingly, the new arrangement for gas price has drawn flak from both industries and consumer rights bodies alike since the measure is clearly discriminatory for new industries as well as the existing ones planning to expand their business activities. It may be recalled that around two months before this latest round of gas price increase, Bangladesh Energy Regulatory Commission (BERC) had convened a public hearing on a gas price hike proposal that argued in favour of reducing the deficit of government-owned companies like Petrobangla. As expected, representatives of industries, consumer rights activists and others who attended the hearing were at one in criticising the regulators' proposal as it harks back to the bygone era of autocracy when gas and power prices were increased arbitrarily. \nNotably, before this gas price hike by the interim government, the last time it happened was during autocracy in 2023, when the gas price for industries was nearly doubled from Tk16 per unit to Tk30. No doubt, the energy policy of the autocratic government of that time was a flawed one as it was based on LNG import. Now the question is if the incumbent interim government is also following that old policy rejected by the people! Interestingly, the head of the BERC reportedly held the view that the fresh gas tariff hike was tolerable for new industries and captive power units since the state-run gas and energy companies were demanding a 150 per cent increase. It's indeed a strange logic as it defies the general consumers' interest. Protection of that interest is the responsibility of the energy regulator--- a statutory body. The BERC chief's observation that the gas tariff hike would create the opportunity to look for alternative energy sources like Liquefied Petroleum Gas (LPG) and solar power for future industries was, if anything, rather tentative. \nBut whatever decisions policymakers might make on as serious an issue as pricing of fuels for industries, it has to be carefully considered and planned. There is no scope for experiment here. In truth, the energy regulator needs to devise its fuel pricing policy with an eye to serving the interests of its consumers, especially industries more than that of the state-run companies including Petrobangla. In the final analysis, these state-run companies, too, are to serve the interest of the consumers and not make profit. The interim government needs to think out of the box while devising its energy policy. It must avoid falling in the old trap of imported LNG. On the contrary, it should stress developing the existing and proven reserves of gas as well as explore new wells. There is no short-cut to resolving our energy issue.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Gas tariff hike dampener for new investors",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/gas-tariff-hike-dampener-for-new-investors-1744727761",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       April 16, 2025 00:00:00  \nThe United Nations World Food Programme (UN WFP) issued an urgent warning last week, highlighting a rapidly escalating global hunger crisis. According to the agency, approximately 58 million people are currently at risk of extreme hunger or starvation unless immediate and substantial funding is secured for food aid programmes. This alarming situation comes amid a dramatic shortfall in donations in 2025, with significant gaps in contributions from major donor countries, including the United States.\nThe WFP, recognised as the world's largest humanitarian organisation dedicated to combating hunger, reported a staggering 40 per cent drop in funding compared to the previous year. This funding deficit directly threatens the organisation's operations in 28 critical crisis zones, including war-torn and politically unstable regions such as Gaza, Sudan, Syria, and the Democratic Republic of Congo.\n\"WFP is prioritising the worst-affected regions and stretching food rations to maximise impact. But make no mistake, we are approaching a funding cliff with life-threatening consequences,\" said Rania Dagash-Kamara, WFP Assistant Executive Director for Partnerships and Innovation. Her comments underscore the gravity of the crisis and the urgent need for donor nations to renew their commitments.\nGlobally, the WFP estimates that 343 million people are currently experiencing severe food insecurity. This crisis is largely driven by an interplay of factors including armed conflict, economic instability, and the increasingly devastating effects of climate change. These elements often combine to displace populations, disrupt agriculture, and reduce access to food and basic resources.\nDespite these growing needs, the WFP's ability to respond is being severely hampered by a lack of funds. The agency aims to assist 123 million people in 2025-roughly one-third of those in need-but nearly half of those may lose access to vital food aid unless more contributions are secured.\nAs of March 24, the WFP had received just $1.57 billion in funding. By contrast, for the entirety of 2024, the agency received $9.75 billion-well below its target of $21.1 billion. The gap between need and resources has widened significantly in just a few months, setting the stage for a humanitarian disaster if no corrective action is taken.\nWhile the WFP did not explicitly single out any specific countries for cutting contributions, public data on its website paints a telling picture. The United States, historically the largest donor to the organisation, has so far contributed less than 10 per cent of the $4.45 billion it donated in 2024. This marks a significant decline and raises concerns about the future reliability of one of WFP's most crucial supporters.\nThe reduction in U.S. aid is partially tied to policy changes under President Donald Trump's administration, which has initiated a broad review of foreign aid and significantly curtailed the activities of USAID, the primary agency responsible for administering American foreign aid. At one point, donations of food purchased from U.S. farmers were suspended, although they resumed temporarily in February under a waiver authorizing emergency assistance.\nOther traditional donor countries are also falling short of past commitments. The United Kingdom, for instance, has announced plans to reduce foreign aid spending in order to bolster its defense budget. Anti-poverty group Caritas Europa has further reported that several European nations are contemplating or have already implemented cuts to their foreign aid budgets amid shifting domestic priorities.\nThese decisions are having devastating ripple effects on global food security. The WFP has identified $2.49 billion in immediate funding needs to sustain emergency relief efforts in regions plagued by conflict and instability. These include Sudan, South Sudan, the Democratic Republic of the Congo, Palestine, Syria, Yemen, Lebanon, Myanmar, Haiti, and areas across the Sahel and Lake Chad Basin.\nWithout this funding, many of the WFP's core programmess may have to be drastically scaled back or suspended. Earlier this week, the agency warned that initiatives aimed at preventing child malnutrition in Yemen, Afghanistan, and Syria could be halted within months if donors do not step up. In Bangladesh, the WFP has already been forced to reduce rations for Rohingya refugees due to insufficient resources, despite the community's high vulnerability and limited access to alternative food sources.\nThe global hunger crisis is being exacerbated by natural disasters as well. On March 28, a deadly earthquake struck Southeast Asia, killing several people and causing widespread destruction, including the collapse of a skyscraper under construction in Bangkok. Events like these, further strain the humanitarian response system and divert resources from ongoing food aid missions.\nAs the WFP continues to raise the alarm, the message is clear: without urgent and increased support from the international community, millions of lives are in imminent danger. The agency is calling for not just emergency relief, but a recommitment to long-term funding strategies that can build resilience in vulnerable populations and ensure a sustainable path towards food security.\nWith hunger soaring and support dwindling, the WFP's appeal is a stark reminder of the growing gap between humanitarian needs and the global willingness to meet them. Whether donor nations will rise to the occasion remains to be seen but the clock is ticking, and the stakes have never been higher.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Fund shortage to fight global hunger",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/fund-shortage-to-fight-global-hunger-1744727828",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Md. Sayful Islam   |  \n       April 16, 2025 00:00:00  \nThe four-day Bangladesh Investment Summit 2025 concluded recently with a blend of optimism, critical reflections and strong participation from global and local stakeholders. While not every expectation was met, the commitment to delivering a summit of global standards remained at the heart of its execution. Organised on collaborative initiatives by the government, private sector, diplomatic missions, political entities, and development partners, the summit marked an ambitious attempt to project Bangladesh as a credible investment destination --- one that is forward-looking, and ready to engage.\nFrom the outset, the summit sought to showcase the evolving investment climate of Bangladesh. The opening ceremony saw the presence of 710 participants, of which 415 were foreign delegates and members of the Bangladeshi diaspora. These individuals represented an array of stakeholders --- policymakers, business executives, institutional investors, trade bodies and more. The remaining participants included prominent local business leaders, senior government officials and thought leaders, contributing to a vibrant and dynamic atmosphere.\nThe engagement did not stop at the sessions. More than 130 panellists from home and abroad shared their insights into trade, investment, sustainability, infrastructure, fintech, logistics, energy, and other sectors. Crucially, the event facilitated around 150 B2B and B2G meetings -- each designed to bring decision-makers closer to actionable opportunities. This kind of face-to-face dialogue offers the groundwork for future investment. High-profile figures like the Governor of Bangladesh Bank, Chairman of the National Board of Revenue, the Special Envoy for International Affairs to Chief Adviser and the Adviser of the Ministry of Commerce and ICT Special Assistant to Chief Adviser, Executive Chairman of BIDA & BEZA were present, ensuring direct government-investor interaction and reinforcing the seriousness of the summit at the venue for direct engagement with investors and institutions especially four high-level delegations from the USA, South Korea , Germany and the New Development Bank. \nAmong tangible outcomes, six Memoranda of Understanding (MoUs) were signed. Some focused on immediate collaboration --- such as the one with the ILO, while others like Artemis Accords with NASA signalled long-term strategic engagements. Notably, major investment announcements came from Handa Group and Bangladesh's ShopUp, together totalling BDT 31 billion. These early commitments provide a strong signal of market interest and help validate the summit's relevance. \nBeyond statistics, perhaps one of the summit's most important achievements was its role in reshaping global perceptions about Bangladesh. Too often, outdated or incomplete data form the basis of investment decisions, pushing countries like Bangladesh out of consideration before a fair assessment even begins. The summit created a platform for real-time, in-person experiences, helping stakeholders to better understand the country's complex realities, ongoing reforms, and untapped potential. In candid discussions and comprehensive field visits including those to Korea EPZ, National Special Economic Zone in Chattogram, Japanese's Economic Zone in Araihazar, EPZs, and local start-ups, participants were exposed to a nuanced and often hopeful narrative of economic transformation. The event was not only about attracting capital but also about demonstrating that Bangladesh has the energy, talent, and vision needed to turn investment into impact. \nIn the end, this summit was a starting point rather than a conclusion in itself. It marked the beginning of a sustainable process to realign the nation in the international investment arena. It demonstrated that Bangladesh is prepared to engage meaningful discussions about opportunities as well as issues. Beyond the summit's immediate accomplishments what must be recorded are the boldness to hold a meeting, the resolve to proceed and the audacity to hope.\nThe writer is a deputy director at BIDA\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Investment summit ushers in a paradigm shift",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/investment-summit-ushers-in-a-paradigm-shift-1744727886",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 16, 2025 00:00:00  \n\nThe Bangladesh Civil Service (BCS) exam has become a dream for many in Bangladesh. The BCS exam is seen as the primary motivator, especially for those aiming to join the administrative framework. More than just a test, the BCS symbolises the new generation's commitment and optimism. Successful candidates contribute to various sectors of the state-law enforcement, service delivery, and policy-making-and are also at the forefront of the education and health sectors.\nThe BCS is considered the lifeline of the administrative structure. However, stagnation in this sector has shattered the dreams of thousands of students. The 44th to 47th BCS exams are currently in a state of gridlock. The 44th BCS exam remains unfinished after four years. The written exam for the 45th BCS was held 15 months ago, but the results have not been released. The preliminary result of the 46th BCS has sparked controversy, and there are doubts about the 47th BCS as well.\nThe Public Service Commission (PSC) is struggling to manage the exams and is now operating on an erratic schedule. Fixed timelines could not be maintained, largely due to COVID-19 and requests from the National University and the University Grants Commission to delay exams. Final appointments are also being held up by police verification and other administrative obstacles.\nDelays in evaluating written exams, examiner irresponsibility, PSC inefficiencies, question paper leaks, and a lack of coordination have all contributed to the crisis. Though both the government and PSC promised a roadmap for reforms, it has yet to be implemented. Students bear the brunt of this mismanagement. After completing their education, many prepare for the BCS while facing intense mental, economic, and social pressure. When results are delayed, they must prepare for multiple cycles, leading to frustration and national impact.\nThe Public Administration Reform Commission has recommended completing each exam step within a fixed timeline, syllabus modernisation, forming three separate commissions (General, Education, Health), a 60 per cent written pass mark, and greater transparency. A modern, efficient, and accountable BCS system is urgently needed to restore student confidence and strengthen public service.\nMd Tousif Raihan\nDepartment of Criminology and Police Science\nUniversity of Chittagong\ntousif.raihan101@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Clear up BCS gridlock",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/clear-up-bcs-gridlock-1744727911",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-04-2025"
    }
]