[
    {
        "full_article": "Prime Minister Narendra Modi’s 12th consecutive Independence Day address from the Red Fort was notable not only for highlighting national security and self-reliance but also for laying stress on a communally coloured demographic threat to the country. While showering praise on the Rashtriya Swayamsevak Sangh, Mr. Modi repeated its refrain by saying that the seeds of a new crisis were being sown. The launch of a High-Powered Demography Mission, to address what he described as “a deliberate conspiracy” to alter the demography of the country, is little more than a thinly disguised effort to polarise the country on religious lines by pointing to the different rates of growth in population among different communities and to the “infiltration” of undocumented migrants from the neighbouring countries. However, the speech also dwelt on substantive issues with a considerable focus on self-reliance in all fields including the economy, defence and technology, and youth empowerment. Mr. Modi also presented an account of the developments in India’s national security and developmental landscape in the last year, and previewed what to anticipate ahead.Mr. Modi lauded the armed forces for Operation Sindoor, which, he said, showcased the effectiveness of India’s defence capabilities and indigenous weaponry. He also used the occasion to warn India’s adversaries, particularly Pakistan, underscoring the policy of zero tolerance toward terrorism and cross-border attacks. Recent successes in the combat against the Maoist insurgency also found a mention. As in a plan announced by Mr. Modi, Mission Sudarshan Chakra, a fully indigenous defence system, will be developed and deployed by 2035. The details were scarce, but he described it as “a powerful weapon system” which “will not only neutralise the enemy’s attack but will also hit back at the enemy many times more”. Speaking amid rapid changes in global power equations, Mr. Modi’s Independence Day message was also aimed at the United States, which has announced tariffs as high as 50% on many Indian products. While promising to focus on revving up the domestic economy, Mr. Modi showed an awareness of the challenges that the Indian economy is facing. The next generation GST reforms would be rolled out by Deepavali 2025, which would reduce the tax burden on core goods and services and boost business. On the one hand, Mr. Modi is trying to cultivate his ideological ecosystem while on the other, he is trying to tackle the material challenges facing the nation. The success of one, however, can only come at the cost of the other. Published - August 16, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Independence Day\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        demography\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        religion and belief\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        defence\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        national security\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        defence equipment\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        illegal immigrants\n                    \n                            /                      \n                        \n                        armed Forces",
        "headline_1": "Figure of speech: On the Prime Minister’s Independence Day address",
        "headline_2": "The Prime Minister held out assurances even while feeding apprehension",
        "link": "https://www.thehindu.com/opinion/editorial/figure-of-speech-on-the-prime-ministers-independence-day-address/article69937815.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "16-08-2025"
    },
    {
        "full_article": "On August 11, 2025, the central government implored India’s seafood industry, that provides livelihoods to about 28 million people, to “bravely face” the U.S.’s tariffs of 25% that kicked in on August 7, 2025 and which could be raised to 50% on August 27, 2025, contingent upon the outcome of trade negotiations. On August 13, 2025, highly placed sources in the Commerce and Finance Ministries told The Hindu that the government is exploring “tweaking” the Export Promotion Mission (EPM), that was announced in the 2025 Union Budget, with an outlay of ₹2,250 crore for the current fiscal year. The EPM, a multi-Ministry project to drive access to cheaper export credit, overcome non-trade barriers and insure payments from overseas buyers, focuses on India’s micro, small and medium enterprises (MSME). Initially meant to be driven by the Ministries of Commerce, MSME and Finance, discussions are on to include the Textiles and Fisheries Ministries. These two industries, which collectively support about 135 million Indians, form among the largest segment of MSMEs that are likely to face the most impact due to the sanctions. The U.S. typically accounts for roughly a third of India’s apparel and seafood exports annually.The government’s imploration to also diversify into other markets is a tacit admission that the Bilateral Trade Agreement negotiations with the U.S. are deadlocked, and that the personal equations between Prime Minister Narendra Modi and U.S President Donald Trump have not translated into a win for either side. Bilateral relations have arguably hit a level lower than during the Cold War, as the two nations were not as enmeshed as they are now, economically, culturally and militarily. Trade and service routes and supply chains take decades to build and undoing them overnight is not possible. This has been clear from the European Union’s reliance on Russian oil and the global dependence on rare earth elements from China. While consultations have been ongoing between the government and MSME sector stakeholders ever since Mr. Trump announced “reciprocal tariffs” in April, there is a chorus now for drastic governmental intervention to safeguard the backbone of the economy — it contributes nearly half (45.79% in FY25) of goods exports and employs over 28 crore people. The fisheries sector has sought a 240-day moratorium on pre- and post-shipment credit repayment, while the textiles, apparel and gem and jewellery sectors want interest subvention. The government has, however, ruled out direct subsidies. But unprecedented challenges require novel responses. The government must include in its arsenal a drastic refashioning of near-term trade ties with neighbours, in particular, China, which it had ignored in the hope that the assiduous cultivation of ties with Washington would pay off.\r Published - August 16, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        seafood\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        Union Budget\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        textile and clothing\n                    \n                            /                      \n                        \n                        fishing industry\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        European Union\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        jewelry\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        rare earths",
        "headline_1": "A paradigm shift: On India and its trade relations",
        "headline_2": "India needs to think anew on its trade relations and strategies",
        "link": "https://www.thehindu.com/opinion/editorial/a-paradigm-shift-on-india-and-its-trade-relations/article69937141.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "16-08-2025"
    },
    {
        "full_article": "PM’s 2 key promises from Red Fort\nTwo themes stood out in Modi’s I-Day address. Mission Sudarshan Chakra, he said, will be a powerful platform that will protect both public places and critical infra, and be operational by 2035. This is evoking comparisons with Israel’s Iron Dome. More relevant is the stellar performance of the Integrated Air Command and Control System (IACCS) and Akashteer during Op Sindoor. But air defence is an evolving tech. India faces two issues. First, versatile and rapidly improving battlefield drones. IACCS and Akashteer need upgrades for this. Second, we are still using diverse platforms – Indian, Russian, Israeli, etc. This is less than ideal. If Sudarshan Chakra can address both these concerns, it will be a massive boost for military self-reliance. \nOn GST, Modi promised Indians will pay a whole lot less for a lot of stuff they buy. Pegging this to Diwali was classic Modi. From what he said and what officials briefed later, the biggest GST reform since its inception will make it basically a 2-rate system – 5% and 18% (a few ’sin’ goods will be taxed at 40%). That will be a huge improvement on the current, complicated 5%, 12%, 18% and 28% structure. Consumers are likely to benefit from a large number of consumer goods moving from the 12% to 5% rate, some from 18% to 5%, and axing of the eye-watering 28% rate. Health insurance premiums may finally get taxed at a lower rate. That there’ll be procedural rationalisation, too, makes this mithai sweeter. And that GOI seems ready to take a revenue hit initially and bet on higher consumption to make this up down the line, is welcome reformist spirit. BJP will hope lower prices will be a vote attractor in poll-bound Bihar, a densely populated poor state. But that takes nothing away from the significance of what Modi promised.\n\n",
        "headline_1": "Chakra & consumption",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/chakra-consumption/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-08-2025"
    },
    {
        "full_article": "Two tragedies within days caused by two extreme weather events. But will govts change anything? \nCloudbursts are no longer freak events – flash floods in Kashmir’s Kishtwar come barely 10 days after a similar extreme weather event in Uttarakhand’s Dharali. Such sudden, intense downpours over a small area have increased in recent years due to climate change – glofs, flash floods and landslides are the terrible new normal. But fact is, the damage and losses suffered on ground are also due to unplanned development in mountainous areas. There is nothing muddy about the impact of climate change, the hydrological system out of whack or mountainsides destabilised with construction activities. One feeds into the other. Dharali yesterday, Kishtwar today, another one awaits. It rains in violent bursts, glaciers are melting faster while aquifers are draining without recharge. \nThe impact is global. Maximum June temperature in Portugal breached 46°C. Almost 2,000 have died in Europe’s heatwaves this year. Wildfires across US through Jan – beyond the fire-season of dry Aug-Sep – burned over 1,000 acres of land, displaced thousands. Meanwhile, it is business as usual of reckless construction, carbon trading, gassing on emissions and drawing sustainability-flavoured pies in the sky in corporate boardrooms with almost the same fervour that marks the inaction on climate, across govts. It is essential to stop activities that result in making the impact of freak weather more severe. The search & rescue in Dharali and Kishtwar is another sobering reminder – if we are not to lurch from one Himalayan crisis to another.\n\n",
        "headline_1": "Dharali to Kishtwar to…",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/dharali-to-kishtwar-to/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-08-2025"
    },
    {
        "full_article": "Diversity still survives Xi, but it’s getting tougher\nAfter reporting from China for seven years, in 2022 American journalist Emily Feng found that her luck had run out. She would not be allowed back in. For years officials had been telling her why she, in particular, should “tell the China story well”. Because she was inherently Chinese. Never mind that she had been born and raised elsewhere. She shouldn’t be hanjian, or race traitor. \nHow this conception of Chineseness tyrannises its subjects both inside the mainland and across the diaspora, is what her book Let Only Red Flowers Bloom: Identity and Belonging in Xi Jinping’s China is about. \nIn the 1950s, a sweeping Soviet-inspired project sorted China’s population into 56 officially recognised ethnic groups. Deng reforms loosened the iron grip of this classification on what job you did and where. Then came Xi, fearful that social splintering would end the Chinese communist project like it ended USSR.  His antidote: Recasting a diverse nation into uniformity. \nFeng tells the stories of 12 very different individuals to drive home how tormenting it can be when your country allows “absolutely no opportunity or outlets for incorrect thinking or viewpoints to spread”.  \nThe Chained Woman | In 2022 a TikTok video went viral showing a woman shivering in an earthen shed, a metal chain tethering her neck to a wall. One official version said she was the mother of eight children, aged 23 to 2. \nA book of photos also came to light. It documented villages outside Guangzhou, where buying and chaining women, while forcing them to bear multiple children, even reselling them, is common. It suggests, there are chained women all over China. \nBoth the initial video and this book were ‘quieted’ by the authorities. But many families still keep searching for the chained woman. She might be the person they themselves lost years ago, to traffickers who make hay out of draconian reproductive policies. \nThe Model Minority | Growing up in Inner Mongolia, Adiya saw few Han Chinese. The sinification of subsequent decades he compares to the feeling of a frog slowly boiled alive. By middle school, all-Mongolian PTMs would be in heavily accented Mandarin. He found it surreal: Who were they all playacting for? When he ditches his Beijing job to return and teach Mongolian language, it was only time before they came after him, finding him to be an agent of “hostile foreign forces”. He had some luck, though, and now lives in Canada. \nThe Diaspora | Chen Weiming got out of China, with a mission to push democracy at home. As he set up his sculpture park in California, a wealthy American patron, Matthew, helped him. Its centrepiece was CCP Virus, about Party culpability in the global pandemic. When this was burned down, FBI revealed that Matthew was actually a former Florida prison guard and part of a bungled, Chinese state scheme to arrest Chen’s work. Matthew had been paid $100,000 and his Long Island based Chinese handler $3mn. \nThe book ends with Chen’s triumphant opening ceremony for CCP Virus 2.0 – in the presence of Feng and motley others. They had all taken different paths to get to that dusty Mojave Desert far from China. Yet each of them that day was thinking of China, the one they had known and the one about which they still dreamed.\n\n",
        "headline_1": "Being The ‘Wrong’ Kind Of Chinese",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/being-the-wrong-kind-of-chinese/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-08-2025"
    },
    {
        "full_article": "Taliban came to power four years ago. As it has consolidated its position in the absence of credible resistance, the international community, India included, has progressively engaged with Kabul’s de facto authorities. Although the Taliban regime is non-inclusive, the law-and-order situation has improved. The logic of engaging with Taliban is that isolating it is unlikely to moderate its actions.\n Read full story on TOI+\n\n",
        "headline_1": "Talibanstan dilemma",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/talibanstan-dilemma/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-08-2025"
    },
    {
        "full_article": "To have to return to the discussion on mob violence every other week feels like a Sisyphean exercise by now—an unlikely fate given the promise of the July uprising to make a break from past authoritarian practices. This is a grim testament to the state's continued failure to enforce the rule of law. Given the rate at which mob incidents are occurring, it is hard to say whether law enforcement has totally lost control of the streets or is simply not enough to contain a multidimensional crime like this.\nThat said, any failure to prevent mob violence is primarily a law enforcement failure. And of late, this failure has been on a frightening display. The first 10 days of August alone reportedly saw at least 13 incidents of mob beating, leaving nine people dead. Since January 2025, the death toll from mob attacks stands at 87, according to the rights platform Manabadhikar Shongskriti Foundation. Ain o Salish Kendra (ASK) puts the number even higher, at 111. Even on August 11, an unidentified man was killed after an attempted mugging in Tongi, Gazipur. But the killings of Rupalal Das (40) and Pradip Das (35) in Rangpur's Taraganj upazila on August 9 stand out as a particularly chilling example.\n\nIncidentally, in the Rangpur case, there were three incidents of theft and robbery as well as a murder in just eight days prior to the August 9 incident—all within a three-kilometre radius of where it occurred. This reportedly caused anger and fear among locals who began to organise night-time patrols. Rupalal and Pradip were simply victims of their paranoia. But had locals seen effective law enforcement before, perhaps their reactions would have been different.\nAccording to a report, around 9pm that day, Rupalal and Pradip were on their way to the former's home in a van when a few locals stopped them on suspicion of van theft and, joined by more people later, beat them to death. Even though police arrived at the scene while both men were still alive, they allegedly fled \"out of fear\" of the mob, only returning an hour later accompanied by army personnel. But it was too late then. The question is, why would the police be afraid or reluctant to deal with mobs head-on?\nIn a recent interview, Law Adviser Asif Nazrul offered a hint: that the force that once opposed the July uprising finds it difficult to confront mobs often instigated by factions claiming to represent that uprising. This may be the case to some extent, but the blame for the failure to take effective measures must be shared by the government. We also must acknowledge the role of political actors behind mob formation. Incidentally, in the Rangpur case, there were three incidents of theft and robbery as well as a murder in just eight days prior to the August 9 incident—all within a three-kilometre radius of where it occurred. This reportedly caused anger and fear among locals who began to organise night-time patrols. Rupalal and Pradip were simply victims of their paranoia. But had locals seen effective law enforcement before, perhaps their reactions would have been different.\nWe must put an end to such desperation. As per a recent survey, 80 percent of the citizens are worried about mob violence. They want to see effective steps both to control unruly mobs and punish everyday crimes that create scopes for desperation or exploitation in the first place. Equally important is overhauling our justice system to restore public trust in it. The truth is, without comprehensive and coordinated measures from all stakeholders, including political parties, this menace cannot be stopped.\n",
        "headline_1": "Will there be no end to mob violence?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/will-there-be-no-end-mob-violence-3961101",
        "news_paper_name": "The Daily Star",
        "publish_date": "16-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 16, 2025 00:00:00  \nThe country's export sector admittedly faced unprecedented challenges posed by difficult domestic as well as external factors in the previous calendar year. Even so, it pulled through these difficulties rather commendably earning USD48.28 billion from exports in the last fiscal year(FY25). Obviously, this has been encouraging enough for the policymakers in the interim government and the businesses concerned to set reportedly higher export targets for both merchandises and services totalling USD63.5 billion marking a 16.5 per cent growth over the past fiscal's performance in the current fiscal year (FY26). This is undeniably a positive development for the country's export trade. And as expected, the knitwear and woven garments grabbed the lion's share of the export targets so envisaged followed by leather and leather goods, especially footwear. The targets for home textiles, agricultural products, jute and jute goods, frozen and live fishes, however, have been set albeit less ambitiously. \nThose at the policy level including the commerce adviser and the commerce secretary who made the announcement of the export targets at a press briefing on Tuesday last, however, held that the targets were rather conservative and that any possibility of setbacks in achieving those targets would be addressed through holding discussions with the stakeholders including the industry leaders concerned. This unquestionably sets a positive example of partnership of the policymakers in the government and businesses doing the actual hard work of production and trading of the commodities at the field level to make export targets more realistic and pragmatic. Having said that it would also be worthwhile to draw the policymakers' attention to the fact that their entire efforts at planning the export targets centred around the comfort zone of mainly the garment and-related commodities. There are also issues of these traditional export goods and markets to be overcome. At this point, it's worth noting with concern how Bangladesh's single-product dependent export sector had come up against a veritable existential threat with one of its export destinations, the USA, raising its imports tariffs at a much higher level than those were in the past. \nThat means Bangladesh's export sector lacking diversity both in terms of number and quality of the commodities it sells abroad gets overly upset at any changes at the policy level or otherwise in overseas markets. But an export-oriented economy need not bend over backwards to settle trade related issues with its international partners. It needs also to have the necessary cards in hand so it can negotiate with its international trading partners from a position of advantage. In that case, there should be wider openings for our products in the global market with a more extensive range of products on offer to strengthen its capacity for negations with regional and international trading partners. However, to maintain the edge over its regional competitors, the labour-intensive garment industry will be required to enhance the productivity of its workforce with improved working conditions, ensuring a living wage as well as upskilling the workers. The government needs to support the backward linkage industries for the sector to reduce its dependence on imported raw materials and thereby add more value to its products.The next potential sector, the leather and leather-based products, needs policy-level interventions to overcome its compliance issues while accessing overseas markets. And those have mostly to do with the certification from Leather Working Group (LWG). To meet LWG requirements, the tanneries must be environmentally sound through proper treatment of its effluents. To this end, the Central Effluent Treatment Plant (CETP) at Savar Tannery Industrial Estate (STIE) has to be functional to make that happen. Once the local leather and leather products industries are able to get around their compliance-related hurdles, they will leapfrog from its currently low-value markets into the high-value Western ones. \nHopefully, the finance ministry committee working to this effect would also take similar steps for ensuring the growth of jute goods, agricultural products, agro-processed goods and pharmaceuticals markets overseas. In fact, there is no room for complacency over the substantive export earnings made or targeted so far. Further widening product-base and markets should be the goal.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Looking beyond the current export goal",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/looking-beyond-the-current-export-goal-1755269665",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       August 16, 2025 00:00:00  \n\nThere is little reason for optimism nowadays when it comes to the banking sector. With declining income, rising expenses and a facade of stability that masks its weaknesses, the industry has been in poor health for quite some time. Most alarming is the sharp rise in non-performing loans over the past year under the interim government. These bad loans ballooned from Tk 2.11 trillion in June last year to Tk 5.30 trillion this June. That's Tk 3.19 trillion in new bad debt piling up in just twelve months. \nTrouble with banks had been brewing on the horizon for a long time. Under the previous administration, while banks were already in poor financial health, a series of mechanisms allowed them to avoid recognising bad debts. Relaxed loan classification rules and concessions for loan rescheduling were common. Ahead of elections, politically connected candidates who would otherwise have been barred for defaulting were allowed to regularise their loans on paper, bypassing disqualification rules. Even during financial crises, overdue loans were allowed to escape non-performing status through special measures that further distorted the true picture. \nBut the most egregious abuses have occurred in Sharia-based banks operating under Islamic principles. The boards of these banks were first taken over by political actors which opened the floodgates for politically motivated lending. Hundreds of billions of taka in loans were disbursed without proper procedures, after which the borrowed funds were laundered abroad through manipulated LC transactions. The LC system was originally designed to prevent money laundering, but sadly it has become a conduit for it. With their wealth safely moved overseas, the perpetrators left the banks to bear the losses. Many bank employees were aware of these misdeeds but had to turn a blind eye to protect their jobs. This was the state of affairs until Awami League's fall on August 5 last year.\nBanks as institutions are inherently unstable. They take deposits that can be withdrawn at any time while holding long-term, illiquid assets such as mortgages and business loans. This mismatch means that even well-managed institutions can be exposed if questionable practices creep into their operations. Following July uprising, when authorities restructured Sharia-based bank boards and stopped pressuring them to hide bad loans, the true NPL figures have surfaced. Adding to the problem, businessmen closely tied to the former regime are struggling under the changed political climate, thus increasing the NPL burden. Estimates suggest these bad loans now account for over 24 per cent of all loans in the system. \nIn these precarious circumstances the central bank is once again offering loan restructuring opportunities to 280 institutions while another thousand applications are awaiting decision. Alarmingly, some recipients of these opportunities are accused of past loan irregularities. Although officials claim these facilities are now granted for legitimate reasons, they evoke memories of the country's history with lenient rescheduling policies that shielded defaulters and concealed the true extent of bad loans. Naturally, banks prefer restructuring over writing off loans as it lets them avoid higher provisions that strain their balance sheets. But the central banks must heed the dangers of overextending support to chronic loan defaulters. It is well remembered that many of the existing bad loans were originally taken with the intent to swindle banks. Once these borrowers have their loans regularised, they can resume dealings with banks and request fresh credit. What assurance exists that those who defaulted repeatedly in the past despite multiple rescheduling will honour new terms? If they receive more loans now, what will prevent them from once again delaying repayment in the expectation of future leniency? \nDuring the tenure of the fallen government, struggling banks were routinely propped up with generous liquidity support. The current interim administration, while acknowledging that the sector was left in \"ICU\" by its predecessor, has followed the same path. Since last September, the total support extended to weak banks through money printing, guarantees and special facilities has reportedly exceeded Tk 530 billion. Notably, five troubled banks that lacked conventional collateral even got loans backed by Demand Promissory (DP) notes which is nothing more than promises to repay, meaning the central bank effectively created money out of thin air. \nCentral banks serve as lenders of last resort, but what purpose does it serve to aid institutions where NPLs comprise 80-90 per cent of their portfolios? Providing abundant liquidity to such terminally ill institutions does not fix the underlying insolvency. It only wastes taxpayers' money. \nNot only that, the government is set to begin merging five of these weak banks which are recipients of liquidity support and providing them with fresh capital. Much like the four state-owned banks that have become de facto government-funded entities with their losses covered by the state, the new bank born from this merger appears destined for the same fate even before it comes into existence. As public money is poured into keeping these failing banks afloat, one must question the rationale behind it. Why persist with this costly lifeline for institutions that clearly can't survive on their own? \nIn a crisis, central banks can lend freely against solid collateral and at high interest rates. But if it goes ahead with backing failing banks through mergers and bailouts without stringent conditions, it risks setting a dangerous precedent. The central bank has admitted many times that political meddling ruined the sector. Attempting to solve the banks' issues without creating mechanisms to block such interference would be like treating the symptoms rather than the disease.\nshowaib434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Banks are reliving  past mistakes",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/banks-are-reliving-past-mistakes-1755269805",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       August 16, 2025 00:00:00  \n\nOne year after the July mass uprising, the issue of student politics at the educational institutions, public universities to be precise, has re-emerged in public discourse. Many argue that political activities by students joining so-called student wings of the mainstream political parties should not be allowed in public universities anymore. Again, some say that if there is a wholesale ban on student politics at universities, covert activities of the various student organisations would surge, making the situation worse.\nThe students of Dhaka University (DU) erupted into protest last week after Jatiatabadi Chhatra Dal (JCD), the student organisation affiliated with the Bangladesh Nationalist Party (BNP), announced its committees in 18 halls of the university on Friday morning. Following the protest, DU vice-chancellor reaffirmed that the decision taken on July 17 last year to keep residential halls free from student politics remains in effect. On July 17, 2024, during the anti-discrimination movement, students forced the hall administration to remove Bangladesh Chhatra League (BCL) leaders and activists from all dormitories and implement a policy to keep halls free from politics. Students of Jahangirnagar University (JU) also staged a similar protest last week.\nThe demand for restricting student politics is a long-standing demand in the country, mainly due to various misdeeds of the student wings of the two main political parties - Bangladesh Awami League (BAL) and BNP. The situation turned into a horrific one during the 15-year rule of the now ousted Hasina regime. Ordinary students in all the public universities and colleges across the country used to get frightened at the very sight of the BCL members. The leaders and activists of the BCL ran a parallel administration in different dormitories of the universities and controlled the campuses by force. They took control of the dormitories, and teachers officially responsible for looking after the halls had little say. Ordinary students had long been subjected to ragging and torture. Those who were staying at the dormitories had to accept all the unethical and undignified activities perpetrated by the BCL cadres. The campuses of the universities were also under their tight grip. They rarely allowed any voice of dissent and did not hesitate to crack down on any gathering or move to protest the wrongdoing on campuses. From torture, intimidation, extortion, to physical assaults of female students and even the killing of ordinary students, there is a long list of misdeeds of the BCL activities.\nThe horrendous murder of Abrar Fahad, a student of BUET, on October 06, 2019 had shocked the whole country. As anger spread across the country, police arrested almost all the killers and their associates. BUET students also strongly protested and compelled the authorities to ban all kinds of political activities in the university. Students of other public universities were, however, not so fortunate, and they had to face ragging and bullying by BCL goons. The most disturbing thing was the shameless support of university teachers who were Hasina loyalists. They endorsedl awful crimes of the BCL goons in the name of curbing the anti-liberation forces.\nDuring the July uprising last year, students for the first time resisted the BCL goons on different campuses and drove them out. After the fall of the Hasina regime on August 5, a ban on the BCL was imposed by the interim government. Now, the students do not want to return to the days of intimidation in the name of student politics. What they want is dormitories and campuses free from all kinds of ragging and bullying forever. It will be possible only when student politics are restricted.\nSome argue that limited political activities are necessary to keep the campuses vibrant and advance the core interests of the students. They further argued that the July uprising is an outcome of constructive and positive student politics. Against the backdrop, it is time to redefine and reset the role and function of student politics. Until then all educational institutions need to be free from that practice.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Student politics, not for now",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/student-politics-not-for-now-1755269856",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 16, 2025 00:00:00  \n\nIn today's fast-changing world, academic knowledge alone is no longer sufficient for success. Many students graduate without essential skills to manage money, which often leads to poor financial decisions and creates significant problems in their daily lives. That is why financial literacy is a vital part of student life. Early financial education equips students with the confidence and knowledge to handle real-world challenges effectively and prepares them for a more secure adulthood.\nOne of the most important skills students need to develop is budgeting. Learning how to plan income and expenses helps them think critically about their spending habits and avoid unnecessary purchases. Equally important is cultivating a habit of saving. Even saving small amounts regularly can build financial discipline and create a safety net for unexpected emergencies. Furthermore, students should be taught to distinguish between needs and wants. This simple awareness helps reduce impulsive buying and encourages thoughtful, wise spending decisions.\nBoth schools and parents have a crucial role in fostering financial literacy. Schools can integrate finance-related topics into their curriculum or provide assignments that encourage practical money management skills. Parents can reinforce this learning at home by involving children in everyday financial decisions, such as budgeting for groceries or saving for family outings, and by maintaining open conversations about money matters.\nFinancially educated students are far better prepared to face life's challenges, whether it is saving for college tuition, managing personal expenses, or planning to start a business. Early exposure to financial knowledge provides them with the essential tools to make informed and responsible decisions, laying the foundation for greater independence and financial stability in the future.\nFarjana Nilufar Mim\nDhaka, farjana.mim@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Starting financial education early",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/starting-financial-education-early-1755269934",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-08-2025"
    }
]