[
    {
        "full_article": "The introduction of an Automated Permanent Academic Account Registry (APAAR) ID by the Ministry of Education, to digitise the academic transcripts of every student, aims to ensure a “single source of truth” for all their records throughout their life in the academic ecosystem in India. Linked with Aadhaar, APAAR is far from the first such step towards a rapid digitisation of school records in India: since the implementation of the National Education Policy, 2020, education authorities have pushed the Unified District Information System for Education Plus (UDISE+) and the Student Database Management Information System. While these radically novel technocratic overhauls of record-keeping are one thing, the blatantly unlawful ways in which they are being pushed on parents and wielded as weapons at the State level are quite another. The description of APAAR as unlawful is no mere interpretation: the Education Ministry’s website is clear that the programme is not mandatory, with no law mandating its usage. But schools and district education administrators do not seem to be operating within that reality.In Uttar Pradesh and Karnataka, schools have been given an unambiguous target: 100% “saturation,” or complete enrolment of all students. In their fervour to attain this target, schools have warned parents of consequences in the event of non-enrolment, and State education authorities have rattled their sabres at religious minority institutions and even at fellow administrators, alleging a mismatch of enrolment data between APAAR and existing records. In the initial days of what has now been rechristened as Digital Public Infrastructure (DPI), the government had similarly been all too keen to propagate Aadhaar and services such as Digi Yatra to an unsuspecting (and too often non-consenting) public, achieving such broad coverage that a formal mandate later becomes a fait accompli. All-too-familiar issues such as name mismatches, leading to failure of enrolment, have also emerged. It is important for informed consent to be the bedrock of any DPI. Else, it risks being mandated de facto. Collecting and digitising this data — with tall claims of security and convenience — should be alarming when the Digital Personal Data Protection Act, 2023 has yet to take effect. More importantly, the Supreme Court of India has ruled, in its right to privacy judgment, that Aadhaar cannot be mandated for basic education. APAAR is an ill-disguised proxy that steers clear of the text — but not the spirit — of that judgment. If the government wishes to undertake the goal of improving the reliability and accessibility of education records, it should back its administration of that effort with legislation. Published - March 15, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        students\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        Uttar Pradesh\n                    \n                            /                      \n                        \n                        Karnataka\n                    \n                            /                      \n                        \n                        Aadhaar\n                    \n                            /                      \n                        \n                        personal data collection",
        "headline_1": "A voluntary mandate: On the APAAR student ID",
        "headline_2": "The APAAR ID should not be imposed without a law in place",
        "link": "https://www.thehindu.com/opinion/editorial/a-voluntary-mandate-on-the-apaar-id/article69330705.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "16-03-2025"
    },
    {
        "full_article": "Even as the ruling DMK government in Tamil Nadu engages in a political discourse with the BJP-led regime at the Centre over the delimitation of parliamentary and Assembly constituencies and the implementation of the National Education Policy (NEP), its use of the Tamil letter ‘Roo’ (‘ரூ’) instead of the Indian currency symbol ‘₹’ in the promotional logo for the State Budget has drawn nationwide attention. The logo, which was unveiled by Chief Minister M.K. Stalin, has been seen by political opponents as an attempt to place regional identity in opposition to national identity. However, the use of ‘Roo’ is more a symbolic representation of Tamil — one of India’s many languages — than an outright rejection of the currency symbol ‘₹’. The Tamil Nadu government, like many others, continues to be flexible in adopting different symbols — ‘₹’, ‘Rs’, and ‘ரூ’ — in its official documents. In fact, the widespread use of ‘₹’ in the State’s first Economic Survey reinforces the idea that cultural and linguistic diversity, rather than political intent, governs such choices.While Tamil Nadu has taken longer than other southern States to release an Economic Survey, the document is a valuable addition to literature on the State’s economy. Forecasting a growth rate of over 8% in 2024-25, the Survey contextualises the State’s economy within global and national economic trends. As a major exporter of automobiles, textiles, leather and IT services, Tamil Nadu is more sensitive than many other States to global market fluctuations, making its growth trajectory more volatile. The Survey’s observations on demographic trends are particularly relevant, given that Tamil Nadu’s population growth is slowing. The challenge lies in consolidating and building upon industrial gains for long-term sustainable growth. Additionally, the Survey underscores the vulnerability of certain coastal districts in terms of climate change/natural disasters. The Survey also has a strong focus on sustainable water management practices — a subject that has historically received insufficient attention. However, the Survey could have had a more detailed analysis of the State’s finances and the socio-economic challenges faced by Scheduled Castes and Scheduled Tribes, who make up over one-fifth of the population. As more States publish their own Economic Surveys — the Union Territory of Jammu and Kashmir tabled its Survey recently — there is an opportunity now for economists, public policy experts and academics to conduct comparative analyses. Such studies, shared in public forums, could encourage other States that have yet to attempt similar reports to undertake their own economic assessments, contributing to a more comprehensive understanding of India’s diverse economic landscape. Published - March 15, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Dravida Munnetra Kazhagam\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Delimitation\n                    \n                            /                      \n                        \n                        Tamil\n                    \n                            /                      \n                        \n                        culture (general)\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Economic Survey\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        development\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        automobile\n                    \n                            /                      \n                        \n                        textile and clothing\n                    \n                            /                      \n                        \n                        IT/computer sciences\n                    \n                            /                      \n                        \n                        demography\n                    \n                            /                      \n                        \n                        climate change\n                    \n                            /                      \n                        \n                        natural disasters\n                    \n                            /                      \n                        \n                        cyclones\n                    \n                            /                      \n                        \n                        Reservation\n                    \n                            /                      \n                        \n                        Jammu and Kashmir\n                    \n                            /                      \n                        \n                        water",
        "headline_1": "Identities and symbols: On Tamil Nadu and the ரூ",
        "headline_2": "Cultural markers need not be seen as a challenge to nationalism",
        "link": "https://www.thehindu.com/opinion/editorial/identities-and-symbols-on-tamil-nadu-and-the-roo/article69330724.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "16-03-2025"
    },
    {
        "full_article": "Yes, the crowds line up for women’s cricket\nToday, the finale of the Women’s Premier League, season 3, will be played at Brabourne stadium, Mumbai. Where’s the buzz been? At the stadiums, across four cities. In Bengaluru, enthusiastic crowding for entry has led to comparisons with kumbh mela. RCB fandom at WPL has given the IPL one a run for its money. Vadodara has shown avid home support to Ashleigh Gardner led Gujarat Giants. Mumbai’s been a keen cheerleader since season 1, when it played the solo host. Lucknow’s getting into the game. But the question in all this is, how much do we expect how fast?\nThe first match of the football WSL in England in 2011 was played in front of just 2,500 people. Today, it has a $84mn broadcast deal. Glass-half-fullers say this is still a fraction of the Premier League. But besides being played across schools and varsities, women’s football there is now a proper career across playing, coaching and management.\nHarsh quizzing about when WPL will deliver a Champions Trophy is really missing the point – a nine-year-old girl asked by TOI about her cricketing hero, named pacer Renuka Singh. Women’s cricket is now developing a franchise following. A deeper bench of players are becoming idols. Whether the bench is deep enough to expand to more teams and cities next year has to be objectively assessed. But to assess how WPL’s done so far, just listen to the cheers tonight.\n\n",
        "headline_1": "WPL wins",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/wpl-wins/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-03-2025"
    },
    {
        "full_article": "The really notable thing about notable days\nBeware the ides of March, ie, March 15. Although, what could go wrong today? It’s Saturday, long weekend. You’re Caesar of all you survey – knives are sheathed till Monday. But Caesar was done in by those nearest him. Homework, mall run, visiting relatives – any of these could be the unkindest cut of all. It could be a power cut too, with no OTT. The fault, then, would be in your stars. Yet, fear of the ides is futile, for cowards die many times before their deaths. Be brave, go out and splurge. But mind your credit, because lenders carve out defaulters as a dish fit for the gods.\nAt least, it’s not Friday the 13th. Or April 1. Even Trump – to whom diplomacy means ‘cry havoc and let slip the dogs of war’ – deferred his reciprocal tariff plan by a day to April 2, to show the world it wasn’t a joke. Although, almost two months of twists and U-turns later, his policy is Greek to everyone else. Byzantine.\nThere is a tide in the affairs of men, and ‘First Friend’ Musk knows it well. Yet, with all his billions he may never have his day. On the other hand, humbler workers – on whose deaths no comets were seen – still have a fading memory of May Day. Like caesars and sultans, days also gain and lose currency. Among those crying for friends, Romans, countrymen to lend them their ears is Martyrs’ Day. When did you last hear the 11am siren in Jan, and maintain two minutes of standing silence? Only festivals – religious and seasonal – hallowed by tradition, like Holi, may have a claim to eternity. Children’s Day, Teachers’ Day, days for fathers and mothers – contrived festivals – are destined to fall off the calendar. ‘Alien’ Valentine’s Day thrives, though. Not because we love ‘sanskar’ less, but because we love love more.\n\n",
        "headline_1": "Ides of March",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/ides-of-march/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-03-2025"
    },
    {
        "full_article": "Humans are their biggest problem…and students\nOwls have superpowers. They hunt like wolves of the sky. Their ears are Ferraris of sound sensitivity. Their brain does sophisticated math to pinpoint prey. They’re near-silent flyers. Their habitat and habits also make them super hard to study.\nWhat An Owl Knows: The New Science of the World’s Most Enigmatic Birds by Jennifer Ackerman takes us along the ride with naturalists, biologists, ornithologists and others using sophisticated new technologies to understand these elusive creatures. Plus with folklorists who study humanity’s biocultural memory of owls.\nLike all birds, they evolved out of small dinosaurs. After the great extinction 66mn years ago, owls grew into their night niche. Some 260 species exist today, spread from deserts to Arctic tundra, from pine cone sized elf owls and snowy owls like Harry Potter’s Hedwig to the naturally clowning, burrowing owls documented by James Bond, the real Bond.\nIn India, owls are loved as Lakshmi’s ride. Some parts of India also know them as ‘corpse bird’, drawn to cemeteries because of the big trees and lack of human disturbance there. Humans are omen-minded and owls are powerful symbols. If they herald good fortune in some cultures, they’re harbingers of doom in others. Still others view them as messengers from other worlds or times.\nTo the owls, human faces look owl-like, just as their faces look human-like to us, the book says. Yet, when an average person keeps a pet owl, viewing it through our own lens or as a mirror of ourselves, the owl suffers. As the great naturalist Henry Beston said about wild animals, they are not brethren, they are not underlings, they are other nations, caught with ourselves in the net of life and time.\nDuring mating season, the male northern saw-whet owl advertises himself through the night at 112 toots a minute, ratcheting it up to 260 when a female comes into its territory. Some owls mate for life. Other species practise divorce. So some scientists get to observe intense soap opera: Betty left Fred to live with Barney, and then not much later, Fred found himself a Wilma.\nNorthern pygmy owls do ‘asynchronous hatching’ – to optimise the chances of some chicks surviving even if prey become scarce. Raising owl children is so energy-demanding that adults can lose a third of their body weight during the nesting season.\nThey adopt too! Bringing up orphans and other offspring not their own. Scientists say a lot of this parental behaviour may not go beyond being genetically programmed. They have also observed siblicide, as stronger chicks kill weaker ones in times of food scarcity.\nDo owl voices have signatures of individual identity? Yes, to varying degrees this is the case for all owl species. Behavioural ecologists find that where the owl population is denser, calls are more distinguished and distinguishable. As in the main square in Kikinda, near the Romanian border. In the trees here, hundreds of long-eared owls roost together from Nov to March. Look up and so many pairs of black-orange eyes look down. A true Parliament!\nClimate change is taking a toll on nesting sites, the clock ticking on owl extinctions. But some are fighting back, the book underlines. Species like barred owls, screech owls and burrowing owls are successfully colonising urban areas. Look around, they’re there in your city too. \n\n",
        "headline_1": "Owls & us: Seeing in the dark",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/owls-us-seeing-in-the-dark/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-03-2025"
    },
    {
        "full_article": "Holi has always been a rowdy, rule-bending festival that freely receives anticipatory bail on popular demand. One is supposed to accept transgressions on this special day and if everybody were to behave, then a sanctioned and well-established opportunity to be bad has gone waste. Nor is all this rambunctiousness recent, as those born late, or raised in a boarding school, might think.\nRead full story on TOI+\n\n",
        "headline_1": "How free is your Holi",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/how-free-is-your-holi/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-03-2025"
    },
    {
        "full_article": "We welcome the UN Secretary-General António Guterres' call to the international community to increase funding for the Rohingya living in refugee camps in Bangladesh. Mentioning that the Rohingya are on the verge of a deep humanitarian crisis caused by global aid cuts, the UN chief rightly emphasised the international community's obligation to support them. As the UN chief and Chief Adviser Prof Muhammad Yunus addressed a large gathering of Rohingya refugees at a camp in Cox's Bazar's Ukhiya on Friday and shared iftar with them, he also expressed hope for the safe and dignified return of over one million Rohingya currently stranded in Bangladesh.\nThe Rohingya refugees living in camps face growing uncertainty as their food rations are being cut due to global funding shortages. The World Food Programme is reportedly reducing its monthly rations from $12.5 to $6 per person starting in April 2025. In 2024, only $554 million—65 percent of the required funds—was provided for these over one million refugees. With the announced cuts in financial assistance, the situation will become even more dire this year. A previous round of ration cuts in 2023, which reduced food rations to $8 per month, led to a sharp increase in hunger and malnutrition. Hence, if monthly food rations are further reduced to $6—approximately Tk 24 per day—it could push the Rohingya refugees to the brink of starvation and even death. Reportedly, nearly 50 percent of the total humanitarian assistance for the Rohingya comes from the US government. Therefore, cuts in US funding will have disastrous consequences for them.\nBangladesh has generously shared its land, forests, limited water, and scarce resources with the refugees. However, it largely depends on humanitarian aid to meet their basic needs, including food, education, and healthcare. If these fundamental rights for the Rohingya population cannot be guaranteed due to funding shortages, tensions within the camps are likely to escalate, potentially leading to increased violence, criminal activity, drug trafficking, and other issues. Therefore, we hope the UN chief's call to increase funding for the Rohingya will awaken the global conscience.\nThe Rohingya refugees cannot remain stuck in limbo forever. Bold and decisive global action is needed to secure a sustainable future for them. To ensure this, the UN and the global community must prioritise the Rohingya issue. They must put pressure on Myanmar to create conditions for the voluntary, safe, and sustainable return of the Rohingya. Until that can be ensured, the international community must step forward with financial assistance. Bangladesh, despite facing many challenges, has done everything in its capacity to support the Rohingyas. It's time for the world to do its part.\n",
        "headline_1": "World must not forget the Rohingya",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/world-must-not-forget-the-rohingya-3848701",
        "news_paper_name": "The Daily Star",
        "publish_date": "16-03-2025"
    },
    {
        "full_article": "Across the world, several rivers have been given legal personhood or recognised as living entities. These rivers are often highly polluted or degraded, yet they remain deeply cherished by the communities that depend on and revere them. Even when a river is sick, we can all take steps to restore it and rebuild a meaningful relationship with it.\nThis prompts a critical question: can law act as a mechanism of repair to restore our broken relationship with rivers, especially under the framework of \"rights of nature?\"\nTraditionally, water law has treated rivers as mere resources—objects over which humans exercise dominion. Recognising rivers as living or legal entities profoundly challenges this notion. It asserts that rivers are far more than resources; they are beings with intrinsic value. Even before practical enforcement, the symbolic significance of acknowledging the \"rights of nature\" forces us to reconsider our fundamental relationship with water. \nThe rights of nature have gained momentum over the past two decades, particularly concerning rivers. However, legal recognition of rivers varies, creating differing scopes of rights, duties, and protections. \nLegal person or subject of rights\n\nThe concept of a legal person treats an entity as capable of bearing rights and duties—similar to a corporation. This allows rivers to sue, be sued, and possess certain legal protections. For instance, Colombia's Atrato River was recognised by the Constitutional Court as a legal subject, endowed with specific rights to protection, conservation, and restoration. Notably, it was not granted the right to own property or water rights—its rights were confined to what the court explicitly outlined.\nLiving person\nIn India, some rivers—such as the Ganga and Yamuna—were recognised as \"living persons.\" This is a legally creative but also complicated concept, as the law typically reserves \"personhood\" for human beings. Recognising a river as a living person raises perplexing questions: if it is now \"dead\" due to pollution, is someone criminally liable? Indeed, in the Yamuna's case, a police report was filed for its \"homicide.\" But such recognition blurs boundaries: can a river commit crimes? Does it enjoy human rights? These ambiguities highlight the tension within the legal system when adapting such novel frameworks.\nLiving entity  \nThe notion of a living entity is more symbolic and carries less legal power. It acknowledges the river as a holistic, living system and challenges exploitative notions of water as a mere resource. However, it does not grant practical rights, such as the ability to litigate or hold property. Despite its legal weakness, this recognition can be transformative in reshaping public and governmental attitudes towards rivers.\nThe problem of missing water rights  \n\nA glaring issue emerges when examining rivers granted legal status: none have been awarded water rights. Even where courts recognise a river's personhood, such as in Colombia, water rights remain absent. Rivers remain disconnected from the legal mechanisms that control access to water, leaving their survival contingent upon human decision-making rather than inherent entitlements.\nThis gap highlights a profound flaw. Without access to their own water flows, rivers cannot be meaningfully protected. Water rights are essential to ensuring that a river's ecological needs are respected.\nIn the era of the climate crisis—what many call the Anthropocene—humanity faces environmental challenges on a scale previously unknown. Countries like Bangladesh and India are already suffering the effects of rising temperatures and water crises. In this context, rights of nature, including river personhood, are emerging as radical tools for environmental protection.\nYet, resistance persists. The entrenched disconnect between traditional water law and the idea of rivers as rights holders reflects a broader hesitation to overhaul outdated legal frameworks.\nWhen a river becomes a legal subject, it can challenge harmful development, pollution, and degradation—forcing humans to respect its interests. But this can inadvertently reinforce an adversarial relationship, positioning humans and rivers as competing claimants in courtrooms.\nConversely, recognising a river as a living entity, though legally weak, encourages an ethic of relationality and care. It invites us to view rivers not as objects of use but as partners in a shared ecosystem. This shift moves beyond transactional, extractive models of water governance and fosters reciprocal relationships, where human and river well-being are intertwined.\nWhat can we give to the river?\nHistorically, society's relationship with rivers has centred on \"what can we take?\"—focusing on the services rivers provide: water, transport, fish, and hydropower. Even now, this extractive narrative dominates.\nHowever, recognising rivers as living entities introduces new narratives: \"what do we want for the river?\" and \"how do we walk with the river to achieve that vision?\" These are profound shifts in perspective. They suggest that rivers should have a voice—represented by guardians, community leaders, or river commissions—and that we must listen to and act on that voice.\nIn this model, rivers become partners rather than adversaries. Communities engage in collective stewardship, imagining futures where rivers thrive alongside human populations. This is a transformative step towards sustainable coexistence, particularly crucial as climate change accelerates ecological crises.\nTo ensure that the new legal status of rivers translates into real protection, two critical gaps must be bridged: First, aligning water law with river rights—so that rivers gain the water flows necessary to sustain their ecosystems. Second, shifting societal narratives—from extractive relationships to reciprocal, caring engagements with rivers.\nUltimately, legal personhood or entity status should not simply be symbolic. It should lead to concrete protections, guaranteed water rights, and restored ecological health—allowing rivers to flourish as living beings with whom we share our world.\nMohammad Azaz is researcher and administrator at Dhaka North City Corporation (DNCC).\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Granting rivers legal status can redefine our relationship with nature",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/granting-rivers-legal-status-can-redefine-our-relationship-nature-3848591",
        "news_paper_name": "The Daily Star",
        "publish_date": "16-03-2025"
    },
    {
        "full_article": "The Gulshan flat, where an unruly mob stormed into on March 5 to search for imaginary guns, crores of cash, and Awami League supporters, belongs to my second eldest brother. His name is Rehman Sharif. We called him \"mejobhai.\" Ten years ago, he had suddenly passed away from respiratory issues. His wife, Rosy Sharif, died in 2019. Subsequently, the flat went to their younger daughter. The mob went there under false pretences that the apartment belongs to ousted prime minister's adviser, late HT Imam's son Tanveer Imam. My brother's younger daughter was married to Tanveer Imam. They have been divorced for over 20 years now.\nI really debated whether I should write this piece. No matter how difficult it is—when my family's good name and honour have been questioned by a lot of TV channels and mainstream newspapers in Dhaka—it falls on me to clear up the misinformation about the true proprietor of this flat. One must stand up to defend her family name.\nSelf-reliant, Rehman Sharif was a decorated business personality. He was well regarded, and highly respected in the business world. He had many honours and accolades given to him by the state and other reputable business organisations. After his passing, one of my former editors, Fazal M Kamal had confided in me that he found Rehman Sharif gracious and charming when he went to meet him at the Dhaka Club to discuss an idea.\nMy benevolent mejobhai was hugely into philanthropy and donated a lot of his money to good causes. Rehman Sharif was one of the original innovators of the RMG sector in Bangladesh. He co-owned Lakhsma Sweaters Ltd. In his RMG factory in Gazipur, over 300 men/women of our village worked in a safe environment.\nOn the night of the mob attack, while reporting live, TV and newspaper outlets reduced my brother to a person with a single name like people in Myanmar, Indonesia, and most of the Afghans. He was simply referred to as \"Rahman\"—as the house owner. Some reporters called him ex-Awami League MP Tanveer Imam's ex-father-in-law, while others called him HT Imam's beai.\nWhen misinformation spreads like wildfire, that is the crucial time to speak up, clarify the rumours, and demand answers. In saying that, I would like to bring into focus once again what had happened in the Concord Towers, a gated apartment building in Gulshan 2. It is a diplomatic zone. I cannot say with 100 percent certainty whether it was a case of mistaken identity or a pre-planned attack, which resulted in ransacking and looting valuable goods from the flat. The crowd had gathered earlier in the evening, and around midnight they broke the building's main gate. The front door had three locks. The mob took turns, and broke two locks. After that the housekeeper Mannan unlocked the third one from the inside. People chanting anti-AL slogans entered the flat. TV reporters with camera persons went in as well.\nThe turmoil inside the flat was telecast live. Police came in later. They did nothing to stop the looters. The flat was savagely ransacked after the mob stormed into the apartment, causing significant damage inside the flat through vandalism and looting.\nWe in the US had no idea that the whole incident was being broadcast live like a horror show as we were going on with our day. Call it the sixth sense—I reached out for my phone before I was heading out to the market to get iftar items. A video caption with HT Imam's name came to my attention. I turned on the video. The whole thing was surreal. On my mobile screen, I saw my brother's house was getting ransacked. I was in shock. In a daze, I just heard some names such as HT Imam, his son, guns, and cores of cash along with AL supporters hiding there. I had to steady myself, put the video on pause, and reached out to my older sister. I forwarded the video, and together we watched it in utter disbelief.\nRehman Sharif had no political affiliations. He had an interest in discussing politics with our cousin, journalist, and politicians like late Ahmadul Kabir. After returning from PAF College, Sargodha, mejobhai lived his life to the fullest. He was the managing director of German operated Hoechst Pharmaceuticals in Dhaka. After a few years, he quit his job to start his own RMG business. He was the only one in our family who went into business.\nOurs has always been a totally nonpolitical family. Yet my brother's name was dragged into it because of some prior connection with the Imam family. His single name reported by the media as one Mr \"Rahman\" will be synonymous with the Gulshan flat attack—simply because his daughter was married to Tanveer Imam, a light-years-ago.\nWhat l found appalling is how the media reports were full of errors, and how minimum effort was given to fact check. When the housekeeper Mannan opened the door, a reporter asked him whose house it was, and who lives there now. He clearly answered by saying my brother's name that this \"house belongs to Rehman Sharif.\" After learning the fact, a simple rebuttal by saying an error has been made in identifying the real owner, and by stating my brother's full name correctly, would have restored his good name instantly.\nNot only was it my brother's flat, but our mother also lived with him in the last years of her life. Seeing one of my mother's framed photos on a pile of rubble on the floor hit me like a thunderbolt. I really broke down and wept. I realised how unpredictable and unsafe life has become in Bangladesh. A good citizen's life and legacy can be desecrated based on false or made-up information.\nHow does a mob even enter a secure diplomatic zone at midnight? Why were the police just standing inside the flat, and letting the looters rob the place? I was told the police took two of my brother's vintage Rolex watches. How can police steal when they come to control the mob? Other valuables, including my niece's fine jewellery, were gone. Things were scattered and strewn in every room—everything was upside down.\nI wonder if the interim government has any plan to stop mobs from spawning havocs in the city. We would like to hear more about the strategies that are in the works. We do not want another family to be victimised the way my brother's family was just because his daughter was once married to a corrupt MP.\nZeenat Khan is a contributor to South Asia based journals. She also writes short stories and nonfiction.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Who is the owner of the Gulshan flat that was vandalised?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/who-the-owner-the-gulshan-flat-was-vandalised-3848576",
        "news_paper_name": "The Daily Star",
        "publish_date": "16-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Rape a symptom of decay",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/rape-a-symptom-of-decay-1742050382",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Trade with China and India: is there any shift?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/trade-with-china-and-india-is-there-any-shift-1742050532",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Messy clinical waste management",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/messy-clinical-waste-management-1742050585",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Zakat as charity",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/zakat-as-charity-1742050612",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-03-2025"
    }
]