[
    {
        "full_article": "The Indian coast needs to be protected against three types of major peacetime maritime accidents involving merchant ships: sinking of merchant ships, causing the loss of cargo, disruption of maritime traffic, and environmental damage; fire onboard merchant vessels that can seriously threaten not just the environment but also life and property on the coast; and oil spills. The recent fire onboard MV Wan Hai 503, that started with explosions when the ship was some 44 nautical miles off the Azhikkal coast in Kannur, Kerala, on June 9, has been successfully controlled now. Photographs of the ship showed a cocktail of smoke of brown, white, grey and black colours billowing out, indicating that many substances were burning. The cargo manifest showed that more than 140 of the 1,754 containers had various types of hazardous cargo. Coast Guard officials report that the raging Wan Hai had started drifting dangerously towards the coast even as firefighting was on and the sea remained rough under monsoon conditions. A tow rope was passed onto the ship but it snapped. An Indian Navy helicopter flew in to airdrop a salvage team and pass a wire rope that was made of steel, which was then used to tow the ship 45 nautical miles away from the coast where the depth is nearly one kilometre. The owner of the vessel pitched in by commandeering tugs through their agents. Wan Hai does not pose an immediate danger to the Indian coast now. Smoke is still seen from the ship and there are hot spots, but it is now up to the ship owner to salvage the vessel after completely putting out the fire.Most of the patrol vessels, the workhorse of the Coast Guard, are now fitted with firefighting equipment since firefighting is a key mandate of the agency. While hazardous cargo on containers are indeed a major fire hazard, a more severe fire hazard is oil. Gas-carrying merchant ships are perhaps the greatest fire and explosion hazards. Nightmare scenarios that can bring the world to its knees involve gas carrier accidents at choke points such as the Suez Canal or the Strait of Malacca off Singapore. In 2020, the Indian Coast Guard and Navy successfully put out a massive fire that broke out off Colombo on the Very Large Crude Carrier (VLCC), New Diamond, chartered by the Indian Oil Corporation. The VLCC was carrying 2,70,000 tonnes of crude oil and bound for Paradip in Odisha. That these ships were structurally intact despite week-long infernos is a testament as much to the maritime firefighting capabilities of India as the advanced design, materials and construction of the ships. Quick salvage of sunk ships and fighting oil spills, which require quick, extensive and close multi-agency coordination, are the other areas where India needs to build and demonstrate more expertise. Published - June 16, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        shipping service\n                    \n                            /                      \n                        \n                        maritime accident\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        fire\n                    \n                            /                      \n                        \n                        oceans\n                    \n                            /                      \n                        \n                        Singapore\n                    \n                            /                      \n                        \n                        Egypt\n                    \n                            /                      \n                        \n                        Orissa\n                    \n                            /                      \n                        \n                        environmental pollution\n                    \n                            /                      \n                        \n                        Monsoon",
        "headline_1": "​Fire on waters: on India and maritime accidents",
        "headline_2": "India’s maritime firefighting capabilities are standing up to the test",
        "link": "https://www.thehindu.com/opinion/editorial/fire-on-waters-on-india-and-maritime-accidents/article69698008.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "16-06-2025"
    },
    {
        "full_article": "India has dropped two points from its position last year in the World Economic Forum’s Global Gender Gap Index report, holding at 131 out of 148 countries. The parity score is just 64.1%, making it among one of the lowest-ranked countries in South Asia, according to the report released last week. The Index measures gender parity in a country across four aspects — economic participation and opportunity; educational attainment; health and survival, and political empowerment. While the performance of India in three of the four dimensions is either stable or has marginally improved, the significant lack of achievement in the fourth weighs down the overall result. The report says, in the economic participation and opportunity category, India has improved by +0.9 percentage points. The parity in estimated earned income rises from 28.6% to 29.9%, positively impacting the subindex score, the report said. Scores in labour force participation rate remained the same (45.9%) as last year — India’s highest achieved to date. In the educational attainment and health and survival categories, the scores have been driven up by positive shifts. It is in the political empowerment category that India records a drop in parity, since the last evaluation. Female representation in Parliament fell from 14.7% to 13.8% in 2025, lowering the indicator score for the second year in a row below 2023 levels. Also evaluated was the share of women in ministerial roles, which fell from 6.5% to 5.6 %, continuing the sinking trend since 2023.The path ahead is obvious — consolidate and improve on the gains and make efforts to set right the lacunae with policies and political will. India has had a long, shameful tussle on this issue as it toyed with the idea of increasing representation for women in polity. The controversial Women’s Reservation Bill was passed in 2023, 27 years after it was first introduced in 1996. The Bill has been visited upon by many charades, was blocked at every turn, and the path to actualisation of the goal was lined with monumental impediments. The present Act reserves one third of the seats for women in Parliament and the State legislatures, but will only be implemented from 2029, after the completion of the Census, and the delimitation exercise. But India climbing up the ranks of a global index should be only secondary to achieving a rounded, applause-worthy, gender parity structure within the country. There is, also, nothing keeping political parties from increasing women’s participation in the electoral process, even before the law necessitates it. Published - June 16, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        health\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        Reservation\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        Census 2027\n                    \n                            /                      \n                        \n                        Delimitation",
        "headline_1": "​Mind the gap: on India and the Global Gender Gap Index report",
        "headline_2": "India needs to ensure women’s participation in policymaking",
        "link": "https://www.thehindu.com/opinion/editorial/mind-the-gap-on-india-and-the-global-gender-gap-index-report/article69697984.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "16-06-2025"
    },
    {
        "full_article": "South Africa became Test champ thanks to grit & patience. Pointers for a young Indian team\nChoker’ is the unkindest of labels in sport. It means you have the talent, but not the temperament to win, especially when it matters most. It means your defeats are caused as much by your opponents as by the demons in your head. It is a terrible cross to bear and post-apartheid South Africa carried it in cricket for nearly three decades. Starting from Allan Donald’s needless run-out against Australia in 1999 ODI World Cup semifinal to their capitulation from a dominant position against India in the 2024 T20 World Cup final – the Proteas frequently settled for failure when success looked eager for an embrace.\nIn the World Test Championship final against Australia at Lord’s, South Africa rewrote the script, buried the tag of ‘choker’ forever. They were up against an opponent which relishes the big stage and seldom concedes an inch. But this time captain Temba Bavuma and his men didn’t need any. In a high pressure encounter, where every delivery was fiercely contested over four days, South Africa played the game, ignored the occasion. Opener Aiden Markram’s 136 will rank among the greatest Test innings of all time. Paceman Kagiso Rabada (5/51 and 4/59) was the knife that cut through Australia. But it was injured captain Bavuma’s 66 that was inspirational, typifying the new determined South Africa which deservedly became champions.\nHopefully, the triumph will also act as a unifier in a country increasingly torn apart by differences within. South Africa’s triumph also carries a lesson or two for a largely inexperienced Team India touring England. Australia were the favourites to win. But S Africa bowled with fire, batted with patience and discipline. They never gave up. They believed. Captain Gill and company would do well to imbibe these traits on a tour that will test them hard.\n\n",
        "headline_1": "Bravo, Bavuma’s boys",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/bravo-bavumas-boys/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-06-2025"
    },
    {
        "full_article": "So much more crashes along with a plane \nA dear friend perished in the Ahmedabad Indian Airlines plane crash of 1988;  our domestic carrier still hadn’t merged with Air India. No remains of his body were found and his wife lived with a hope she could never bring herself to bury. That flight had originated in Bombay so there would have been more whom I could have lost, and thankfully didn’t. But Ahmedabad was my town-in-law, I still have close family there and closer friends. Any of them could have been on board AI 171 last Thursday. To date I know only of one. She missed her flight that morning; her not being on time turning to timeless – and incredulous – gratitude. And perhaps not a little mixed feelings thinking of those who did not get away. What then about Viswashkumar Ramesh? I have often pondered over what it must feel like to be the sole survivor of a tragedy that kills hundreds? Or, worse, the rest of your family? \nI’ve been so haunted by this sudden death because it struck in a place I love for many reasons, most of all for its contradictions. No city can be one-dimensional; but Ahmedabad is defined by its dichotomy. The resident deity is Rokda, cash, mounted on dhandho, business, but it is equally home to the most vaunted of IIMs, schools of architecture, design and dance, to so many litterateurs and artists. \nAspiration is the common factor, the desire to make life better. Yes, it was also on board that Dreamliner which turned into nightmare. An Ahmedabad-London flight represents the vast percentage of Gujaratis who straddle both places. Those who went to Britain to improve their circumstances or their families going to visit. Or, in the case of software engineer Prateek Joshi, bringing his family to live there with him after six years of struggling for clearances.\nThe one image I can’t get out of my head is that of the selfie he posted just before take-off. His own mission-accomplished glow, his beaming wife, his three little kids smiling with yet-not-fully-grasped hope but with definite joy of finally being full-time with Papa. All vapourised in 30 seconds.\nA one-way ticket as Prateek Joshi never intended it to be.\n                                             ***\nAlec Smart said: “Accident compensation is a contradiction in terms.”\n\n",
        "headline_1": "A Thursday",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/a-thursday/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-06-2025"
    },
    {
        "full_article": "Census officially kicks in with notification. Many questions ahead\nFormal census operations are set to kick off any day now. Making March 1, 2027, the reference date for census 2027 – the freeze-frame date, which means a child born after this date will not be counted in this census even if fieldwork continues till after – made the census itself politically loaded. The argument has always been to hold the census speedily, and give delimitation enough time – the last commission needed five years. But it’s the census that’s still two years away, and in all likelihood delimitation will be earlier than expected given the condition that redistribution of Lok Sabha seats would be revisited after Census 2026. And in all likelihood, women’s reservation too will kick in before LS 2029 elections. \nWhat’s known for a long time is that for the delimitation commission, vote vs voice is the key wrangle. Ratio of MP/MLA to population is higher for densely populated northern states. So the value of a vote is lower for these states than for southern ones, where one MP represents fewer people. That, one argument goes, is unfair to the north. Conversely, awarding the north with more Parliament seats basis failed or patchy population control, is injustice to southern states that end up  getting penalised for population stability. They lose seats, thereby losing voice. \nAdd to that women’s reservation that’ll “shrink” opportunity by a third for male candidates. The concern where political parties will find women with ‘winnability’, read crorepatis, is but a myth. The simple answer is they’ll find women in the same places they find ‘winning’ male candidates. Why demand women politicians be polished diamonds when the worst male criminals get to contest? More and more women are rising from grassroots/panchayat politics to state-level positions, no less and no more than their male counterparts across party spectrum. It’s always good to remember that even women from political families are fighting family’s patriarchy – framing their participation in matriarchal terms is creative writing. Reality is, legislation is only the first step to greater women’s participation in electoral contests. \nTaken together, the two will upend India’s political make-up. The first issue has been known for years – so where are the public debates and intellectual discussions on ways to address it? Continue the freeze on seats till north’s population stabilises? Increase LS seats by population and accommodate southern states with increase in RS numbers? Uniformly increase by a third all states’ seats to accommodate women’s quota? What are the possibilities? It’s time to junk all-party political grandstanding and engage with rigour on fair and just solutions to what will decisively and for good change India’s political future.\n\n",
        "headline_1": "Census, consensus",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/census-consensus/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-06-2025"
    },
    {
        "full_article": "Forgotten after every plane crash is the terrifying complexity of pilots’ jobs. Their work involves precision, pressure & unpredictability. Their lives are often defined by fatigue, anxiety, even depression. Then there’s aircraft reliability & airport congestion\n\nEvery air tragedy brings the role of pilots into sharp focus. Never, though,is there enough appreciation of what a pilot’s job entails – it’s a terrifyingly complex interplay between human expertise, technology, and split-second decision-making.\nRead full story on TOI+\n\n",
        "headline_1": "Stories from modern cockpits",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/stories-from-modern-cockpits/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-06-2025"
    },
    {
        "full_article": "Chittagong's neighbour Sandwip is absent from Bay of Bengal history because its nature is hard to define. A pirate port in medieval times, its career was different from other pirate-cum-slaving ports because of its many roles: strategic gateway, commercial depot, offensive launch pad, and defensive site. A maritime outlet and transhipment node under local rulers and Arakan, it became a strategic post for the Mughals and a gateway into southeast Bengal for the Portuguese. Ultimately, it telescoped into a slaving hub.\nSandwip's career highlights the many roles played by small places at a time when the world map was not cast in favour of imperial outlets—when an insignificant part of the coast could challenge the expansion of powerful polities.\nAnother, and more important, reason for Sandwip's absence in history is that it lay outside the national frames through which we view our past. This article will demonstrate how viewing the past through national frames distorts historical understanding.\nThe Physical Environment\nFrom 1509, ships following the Portuguese explorer Vasco da Gama had heard of the wealth of Chittagong, which they would call Porto Grande. Luís Vaz de Camões wrote in Os Lusíadas (1572, 10th Canto, Stanza 1):\n'The City CATHIGAN would not be wav'd,\nThe fairest of BENGALA: who can tell\nThe plenty of this Province? but it's post\n(Thou seest) is Eastern, turning the South-Coast.\nThe Realm of ARRACAN, That of PEGU\nBehold, with Monsters first inhabited!'\nWe tend to equate Chittagong with the delta, but it lies outside it. The delta spans 'Lower Bengal' (samatata) of European records and comprises a terrestrial fringe called bhati that separates the coast from the sea. Emperor Akbar's chronicler Abu'l-Fazl 'Allami claimed that 'the tract of country on the east called Bhati is reckoned a part of this province'. But in another passage, he treated Bangala and Bhati as mutually exclusive; the distinctive feature of the latter was its topography: the word bhāṭi simply means downstream direction. 'Bhati', he said:\n\"is a low country and has received this name because Bengal is higher. It is nearly 400 kos in length from east to west and about 300 kos from north to south. East of this country are the ocean and the country of Habsha (the Habshis ruled Bengal from 1487 [end of the Ilyas Shahis] to 1493, Husain Shahi accession). West is the hill country where are the houses of the Kahin tribe. South is Tanda. North is also the ocean and the terminations of the hill country of Tibet.\"\nAbu'l-Fazl saw Bengal bound by two oceans. This view likely came from haors and rivers as 'wide and deep as the sea' in popular perception, and it is likely that he was referring to the once mighty but now vanished Karatoya River as the northern ocean.\nHowever, Richard Eaton noted that in Mughal usage of the 16th to early 17th centuries, bhati included the entire delta east of the Bhagirathi-Hugli corridor. Since its western boundary extended from Tanda (part of the 16th-century capital complex of Gaur-Tanda-Firuzabad) down to southwestern Khulna district, the frontier between bhati and Bangala approximated the present frontier between India's West Bengal and Bangladesh.\nBhati\n\nBhati is how Persian and Bengali sources saw the coast. It is the liminal zone where the land meets the sea, comprising a small part of the delta—the low-lying lands around Dhaka, Tripura, Mymensingh, and Sylhet, forming a triangle surrounded by the Ganga, Brahmaputra, and Meghna river systems.\nSandwip lies at the Meghna estuary's centre, between 22º16' and 22º43' north latitude and 91º23' and 91º40' east longitude. To its north is Chittagong and mainland Bangladesh; to its south, the Bay of Bengal; to its east, the Sandwip Channel; and to its west, the Hatia Channel. The Meghna network links it to Tibet, northern Burma, and Yunnan through the Brahmaputra. This was once a major communication route, and the medieval port of Samandar of the Arab mariners and Muslim merchants was probably on this route.\nDespite its accessibility, Sandwip's environment is vulnerable. Hydromorphological processes have influenced the formation of this funnel-shaped coastal area, and the Meghna estuary is subject to cyclones and tidal surges from the Sandwip and Hatia Channels. We estimate that the Noakhali–Chittagong coast has a 40% plus frequency of cyclones compared to other parts of the coast (ranging from 16% to 27%). Sandwip lies in this most cyclone-prone area. This factor, and the fact that rivers in Bengal are notorious for changing course almost overnight, meant that few attempted to control this harsh land. The hostile environment also ensured that there are few vestiges left of the Portuguese presence in Sandwip.\nBackstory\n\nLike its environment, Sandwip's borders were hostile and contested by Bengal, Tripura, and Arakan—a powerful state to its east. Environment recognises no frontiers. Stephan van Galen remarks that Arakan–southeast Bengal form an environmental continuum; both have a climate and geography quite different from the Ganga and Irrawaddy plains. Both share a very high level of rainfall (reaching, on average, 500 cm per year), which makes for higher rice yields—contrasting with the much drier Ganga and Irrawaddy plains. Although the steep and rugged Arakan Yoma makes overland travel difficult, intersecting rivers and shallow coastal waters between the two polities provide a good infrastructure for trade and communication.\nIn 1406, Ava (upland Burma) attacked Arakan, and its king fled to Bengal. After staying there for several years during Ghiyas ud-Din Azam Shah's reign (1390–1411), he regained his throne with Sultan Jalal ud-Din's help in 1430. Known as Narameikhla (also Suleiman Shah, 1404–34), he founded the city of Mrauk U and initiated mint reforms using trained personnel and technology sent from Bengal. But relations soured as Arakan claimed dwadas Bangla (the 12 lands of deltaic Bengal ruled by the baro bhuinya) as areas of Arakanese influence. These lands had been alienated to Bengal in return for help in regaining the throne. In pursuit of these claims, Arakan raided Bengal throughout the seventeenth century. These raids can be read as assertions of a past territorial grandeur.\nIn 1538, Sher Shah defeated the Husain Shahis, and then, in 1576, the Mughals defeated the Afghans. But the delta's rulers, the baro bhuinya, governed independently. Two rulers—from Sripur and the 'Island' or 'Kingdom' of Chandecan (a chief called Chand Khan; see images 1 and 2)—claimed Sandwip's revenues. Arakan would contest these claims.\nLocating Sandwip\nSandwip Upazila in Chattogram district was 'Sundiva' in European texts and maps. Located on the Bengal–Pegu route, it is marked in de Barros' Map of Bengal (Quarta Decadas da Asia, Lavanha edition, 1615), shown but not named in Gastaldi's 1561 Map of Asia, and also in Linschoten's 1596 map. Dutch and French cartographers marked it until 1747: Johann and Cornelius Blaeu (1638, image 3); Johannes Jansson (1639 and later editions in the 1640s and 1650s); Nicholas Visscher (1660, 1670); Nicholas Defer (ca. 1685); Nicolas Sanson d'Abbeville (1705/1720); Jacques-Nicolas Bellin (1747).\nSandwip was important, but its hostile physical and political surroundings would prevent it from carving out a prominent place in Bay of Bengal history.\nAdjacent to Arakan but held by outsiders, Sandwip's history is difficult to recover, as it lay in a disputed frontier area. We are not sure which power held the area at the start of the 16th century. It was probably Tripura, for in 1516 Husain Shah seized Chittagong from Tripura. But by 1537, Bengal's politics had become turbulent, the Portuguese controlled the seaboard from Orissa to Chittagong, and in the absence of a central authority, 'trade coins' minted at Chittagong passed as legal tender. In the early 17th century, the Mughals conquered southeast Bengal, the delta's rulers were defeated, and Bengal was made a Mughal province. This anarchic half-century benefitted Arakan.\nTravellers have left behind accounts of the region. Niccolò de' Conti passed this way in 1421–22, but since he does not mention Sandwip, we assume its rise postdates his visit. Clearly a char that appeared later, Sandwip is not mentioned in the 1521 Portuguese account of Bengal either. But this account saw the area as highly urbanised, with market towns succeeding each other at small intervals: Aluia, Jugdia, Gacala, Meamgar, Noamaluco—the last name clearly testifying to a land newly risen from the sea, a char now habitable and taxed (image 4). The same account notes that despite being a fertile land producing rice, sugar cane, and black and white textiles sold in its numerous shops, and a land experiencing great riverine and maritime traffic, it showed startling contrasts—swampy one moment and full of clear lakes the next. The area was heavily infested with pirates. Some islands were empty.\nWas Sandwip one such island? Is this why it has left so few traces?\nSandwip appears on the historical stage in 1569. That year, on his way back from Pegu, a cyclone caused Cesare Federici's ship to be shipwrecked at Sandwip. Staying for 40 days, he found it a pleasant place, well run by a Muslim governor. He states:\n\"I went aboard the ship of Bengala, at which time it was the yeere of oftentimes, there are not stormes as in other Countries; but every ten or twelve yeeres there are such tempests and stormes, that it is a thing incredible, but to those that have seene it, neither doe they know certainly what yeere they will come… In this yeere it was our chance to bee at Sea with the like storme… this Touffon or cruel storme endured three days and three nights: in which time it carried, away our sayles, yards, and rudder… this Touffon being ended, wee discovered an I[s]land not farre from us, and we went from the ship on the sands to see what I[s]land it was: and wee found it a place inhabited, and, to my judgement the fertilest I[s]land in all the world, the which is devided into two parts by a channell which passeth betweene it, and with great trouble wee brought our ship into the same channell, which parteth the I[s]land at flowing water, and there we determined to stay fortie dayes to refresh us. And when the people of the I[s]land saw the ship, and that we were comming a land: presently they made a place of Bazar or Market, with Shops right over against the ship with all manner of provision of victuals to eate, which they brought downe in great abundance, and sold it so good cheape, that wee were amazed at the cheapnesse thereof. I bought many salted Kine there, for the provision of the ship, for halfe a Larine a piece, which Larine may be twelve shillings sixe pence, being very good and fatte; and foure wilde Hogges ready dressed for a Larine; great fat Hennes for a Bizze a piece, which is at the most a Penie: and the people told us that we were deceived the haife of our money, because we bought things so deare. Also a sacke of fine Rice for a thing of nothing, and consequently all other things for humaine sustenance were there in such abundance, that it is a thing incredible but to them that have seene it. This I[s]land is called Sondiva belonging to the Kingdome of Bengala, distant one hundred and twentie miles from Chitigan, to which place we were bound.\"\nWith a diverse economy, Sandwip served as a refitting station for riverine traffic, and produced rice, grain, poultry, and cottons. Alexander Hamilton (ca. 1688–ca. 1733) remarked:\n\"Sundiva is an Island four Leagues distant from the rest, and so far it lies in the Sea… it may serve to shelter small Ships from the raging Seas.\"\nA rupee spent at Sandwip yielded 580 lbs of rice, or eight geese, or 60 poultry. It also exported 200 boatloads of salt each year.\nSandwip's First Phase\nSandwip's turbulent politics began in 1590. In that year, the Chittagong Portuguese under Antonio de Souza Godinho fought Min Nala, Arakan's new governor at Chittagong, captured the fort, and forced Sandwip to come under their Chittagong establishment. But the island was a no-man's-land, with Portuguese authority in force only in some places. Sripur's Kedar Rai asserted overlordship and claimed its revenues. This unclear status would haunt Sandwip. Although a renewed purpose to conquer the southeast is seen in General Man Singh's choice of Dhaka as a base from 1602, Mughal presence was nominal. They were defeated in 1602, and Domingos Carvalho, one of Kedar's officers, re-conquered Sandwip. Kedar claimed he had 'liberated' Sandwip from the Mughals.\nBut the locals now rebelled against the Portuguese. Carvalho asked the Chittagong and Dianga Portuguese for help. Manuel de Matos, leader of the Dianga Portuguese, led 400 men in Carvalho's support. Since both together defeated Sandwip, each took a half to govern, and it seems Kedar still maintained his overlordship.\nMin Razagyi, Arakan's king, fearful of being trapped between the Portuguese strongholds in Chittagong, Dianga, and Sandwip, sent a force of 150 jalias, \"in which were some catures and other great ships, with many falcões and cameletes.\" Surprisingly, Kedar allied with Min Razagyi and sent 100 cosses (light boats suitable for fighting on rivers, not at sea) against Sandwip. The Portuguese won this battle in 1602. In retaliation, Arakan harassed Jesuit and Dominican missionaries. Jesuit Father Francisco Fernandes was stripped, blinded, shackled, and thrown into prison, where he died on 14 November 1602. Four Jesuit fathers, led by Father Brasio Nunes, left their church in Sandwip and moved to Bengal.\nCarvalho offered Sandwip to the King. The Estado da Índia's viceroy at Goa agreed, hoping that Carvalho and Matos would bring the Bengal-based Portuguese back into the Estado's service. As the conquest of Sandwip was now official, and Portugal accepted it as a crown possession, the King presented Matos and Carvalho with the Order of Christ and made them nobles — Fidalgos da Casa Real.\nBut Sandwip's political status was still contested. Arakan attacked it in 1603. Then, Pratapaditya of Chandecan, a powerful ruler who was seeking to expand in the delta, entered the scene. He beheaded Carvalho and sent the head to Mrauk U. This ended the Carvalho phase — the first Portuguese phase of Sandwip's history. Only Manuel de Matos was left to rule over Sandwip.\nMeanwhile, de Brito — whose star was rising under Min Razagyi — planned a takeover of the entire coast from Sandwip to Syriam. This would be the second phase of Sandwip's history, and it would continue to shape Portuguese commercial strategy in the northern Bay of Bengal.\nRila Mukherjee is a historian and the author of India in the Indian Ocean World (Springer, 2022).\n\n",
        "headline_1": "Why is Sandwip missing from the Bay of Bengal’s history?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/focus/news/why-sandwip-missing-the-bay-bengals-history-3917926",
        "news_paper_name": "The Daily Star",
        "publish_date": "16-06-2025"
    },
    {
        "full_article": "The fierce exchange of attacks between Iran and Israel, following Israel's illegal airstrikes on Iran in the early hours of June 13, is pushing the Middle East and the world towards a dangerous precipice. Reportedly, during the early hours of Sunday, both sides launched fresh waves of attacks on key cities, fuelling fears of a full-scale, protracted war, with heavy exchanges now entering a third consecutive day. Iranian missiles struck northern Israel late on Saturday and into Sunday, killing at least three people and wounding 13 others, according to Israeli media. In response, Israel targeted the Iran's defence ministry headquarters in Tehran. According to Iranian officials, the Shahran oil depot, located northwest of Tehran, was also hit by Israeli strikes.\nOn June 13, under the codename Operation Rising Lion, the Israel Defense Forces (IDF) and Mossad damaged key nuclear sites and military installations in Iran, reportedly killing several of the country's top military leaders. Iranian civilians, including women and children, were also killed in the assault—the largest on Iran since the Iran-Iraq War of the 1980s. Worse still, the attacks came just days before the US and Iran were scheduled to begin the sixth round of nuclear talks in Oman on June 15. Clearly, Israel's objective was to sabotage the negotiations. And so far, it appears to have succeeded as Iran has reportedly suspended the talks.\nIsrael's attack on Iran also comes at a time when its European allies were finally beginning to express unease over its food blockade and mass starvation strategy against Palestinians in Gaza. As such, this attack has once again allowed Israel to deflect attention from its most recent war crimes against the Palestinian people.\nSince 2003, Israel has repeatedly attacked Iran in violation of international law, accusing the country of attempting to acquire nuclear weapons. Allegations that Iran is building a nuclear arsenal—frequently raised by the US, the EU, and Israel—have been thoroughly investigated by the International Atomic Energy Agency and found to be unsubstantiated. Despite these findings, Israel has now launched its fiercest attack on Iran to date, one that appears to be on the verge of spiralling out of control.\nSadly, instead of restraining Israel, its Western allies once again appear to be offering it full support. It is precisely this support—despite Israel's grave violations of international law—that has emboldened the country to continue its genocidal campaign against the Palestinians and its repeated violations of the sovereignty of other countries in the Middle East.\nUnder the circumstances, the international community must urgently bring all parties to the negotiation table and ensure an immediate end to the escalation. It is high time the international community also took a serious look at the series of international law violations Israel has committed against its neighbours in the Middle East, particularly Iran and the Palestinians. Unless and until Israel is held to account, it will continue to stoke the flames of conflict in the region—which could, at any moment, escalate into a broader global conflict.\n",
        "headline_1": "Israel-Iran escalation risks global calamity",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/israel-iran-escalation-risks-global-calamity-3917591",
        "news_paper_name": "The Daily Star",
        "publish_date": "16-06-2025"
    },
    {
        "full_article": "The latest escalation between Israel and Iran marks a perilous moment in West Asian geopolitics, where decades of shadow war have slipped into open confrontation. What was once fought through proxies, sabotage operations, cyber warfare, and veiled diplomacy is now turning into direct strikes between two of the region's most formidable powers. The consequences of this transformation are not just regional, they are global.\nOn Friday, Israel launched what it termed \"Operation Rising Lion,\" targeting multiple Iranian military and nuclear infrastructure sites in Isfahan, Natanz, and Shiraz. The strikes were reportedly in response to an attempted Iranian drone and missile attack a week earlier, which Israel's defence forces intercepted with minimal casualties. But this tit-for-tat escalation belies a deeper, long-simmering confrontation: Israel's determination to prevent Iran from achieving nuclear weapons capability, and Iran's equally entrenched resolve to challenge Israeli hegemony in the region.\nThis is not merely a bilateral conflict. The power struggle between Israel and Iran is enmeshed in a web of international interests and ideological divides. The US, while publicly calling for de-escalation, continues to provide advanced defence systems and intelligence support to Israel. Russia, increasingly aligned with Iran following its pivot away from the West, finds itself in a delicate position, caught between opposing partners in its geopolitical balancing act. Meanwhile, China, dependent on Iranian oil and Israeli tech alike, remains diplomatically cautious, urging restraint but offering no decisive mediation.\nFor decades, the uneasy equilibrium was maintained by strategic ambiguity and third-party diplomacy. Iran backed Hezbollah in Lebanon and militias in Syria and Iraq, encircling Israel through non-state actors. Israel, in turn, conducted hundreds of airstrikes in Syria to curb Iranian entrenchment but refrained from overtly targeting Iranian soil—until now. This breach of the unwritten rules is profound. It signals a shift from deterrence through ambiguity to confrontation through clarity, from shadows to fire.\nThe nuclear dimension adds a chilling undertone to this shift. Iran's enrichment of uranium beyond 60 percent purity, while still below weapons-grade, has crossed every red line previously set by the International Atomic Energy Agency (IAEA). Israel's policy of pre-emptive action, rooted in the Begin Doctrine, has now morphed into a strategy of preventive war. But war, unlike doctrine, does not unfold predictably.\nCivilian populations in both countries now live under real threat. In Tehran and Tel Aviv alike, the spectre of missile sirens, shelter drills, and cyber paralysis haunts daily life. And while much of the world remains distracted by other conflicts—Ukraine, Taiwan, Sudan—the potential for a full-scale regional war here is dangerously underestimated.\nThe Arab world, once reflexively aligned with the Palestinian cause, is split. The Abraham Accords brought normalisation between Israel and key Gulf states, including the UAE and Bahrain, who now view Iran as a more imminent threat than Israel. Saudi Arabia walks a tightrope, trying to manage regional leadership without alienating its emerging détente with Tehran. This geopolitical realignment has fragmented what was once a unified Arab front, creating new uncertainties in regional diplomacy.\nFor India, a key strategic partner of both Israel and Iran, the conflict presents an uncomfortable dilemma. While Delhi maintains defence and intelligence ties with Tel Aviv, it is also heavily dependent on Iranian energy routes and connectivity initiatives like Chabahar. More crucially, any escalation in the Strait of Hormuz threatens global oil supply chains—jeopardising the very foundation of India's energy security and inflation management. The conflict also poses risks to India's large diaspora in the region, particularly in the Gulf states, who could face economic fallout or political backlash.\nBut perhaps the most troubling dimension of this unfolding crisis is the failure of diplomacy. The collapse of the Joint Comprehensive Plan of Action (JCPOA), due to American withdrawal under the Trump administration and Iran's subsequent defiance, left a dangerous vacuum. European mediators, once central to keeping dialogue alive, now appear sidelined by their own internal divisions and economic fragility. The UN, hamstrung by veto politics, watches from the margins as bombs fall.\nWhat does the world do when the very frameworks designed to prevent war have failed? When rational actors become prisoners of their own red lines? The Israel-Iran conflict exposes the fragility of international norms in a multipolar era, where power is fragmented and restraint is rare.\nIt is not enough to call for de-escalation. The moment demands a return to diplomacy not as an afterthought but as an urgent priority. It requires courage from leadership—on both sides—to resist domestic hardliners and ideological absolutism. It demands from the international community a shift from perfunctory condemnations to active mediation, from arms deals to disarmament talks.\nAs cities across Israel and Iran brace for more strikes, and as the world teeters on yet another edge, it is worth remembering that history rarely judges nations only by their victories—but always by their choices. The choice now is between escalation and survival, between spectacle and sanity. The world must not look away.\nAshish Singh has finished his PhD coursework in political science from the NRU-HSE, Moscow, Russia. He previously studied at Oslo Metropolitan University, Norway, and TISS, Mumbai.\n\nThis article was first published by Countercurrents.org on June 15, 2025.\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The collapse of deterrence between Iran and Israel",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-collapse-deterrence-between-iran-and-israel-3917406",
        "news_paper_name": "The Daily Star",
        "publish_date": "16-06-2025"
    },
    {
        "full_article": "The prolonged closure of the National Institute of Ophthalmology and Hospital (NIOH)—the country's largest public facility for eye care—is something that should never have happened, given how it not only affects ordinary patients seeking eye treatment but also worsens an already battered image of the state's handling of those injured during the July uprising. At this point, it is immaterial to debate who was or is more at fault for the paralysis—hospital staff or the protesting July Joddhas. What's important is that ordinary patients are suffering because of it.\nOn Thursday, outpatient (outdoor) services resumed after a suspension that began on May 28, about two weeks ago, while emergency services resumed on a limited scale on June 4. But other essential services remain halted. Worryingly, the prospect of full operations being restored on Saturday is clouded by fears that tensions may again flare up with the likely return and re-mobilisation of injured protesters following the end of the Eid holiday. The protracted stalemate has already caused immense hardship for low-income patients who rely on this facility for affordable care, with thousands turned away. Any further disruption will only deepen their suffering and further erode trust in the authorities' ability to mediate convincingly in this meaningless standoff.\nThis latest episode in the short history of public outbursts by injured July Joddhas started on May 28. That day, a group of protesters long admitted to NIOH allegedly attacked the staff as well as residential quarters, sparking a three-way clash that also involved other patients and their attendants. A number of individuals were injured, including doctors and nurses. All this led hospital staff to suspend services over safety concerns. Despite sporadic negotiations and partial service resumption afterwards, things remain tense. Fuelling concerns is the refusal of July protesters to accept discharge letters despite many among them being cleared by a medical board on June 4.\nAgainst this backdrop, the hospital authorities, as one of the involved parties, may find it difficult to broker a solution alone. The onus, therefore, lies with the higher authorities to mediate a solution that ensures uninterrupted treatment for both the July injured and the general public. This will require clear communication of discharge procedures and addressing the protesters' grievances about neglect or malpractice. The July Joddhas deserve proper care. But so do the ordinary patients who come to this hospital for treatment.\n",
        "headline_1": "Fix the mess at NIOH immediately ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/fix-the-mess-nioh-immediately-3915836",
        "news_paper_name": "The Daily Star",
        "publish_date": "16-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 16, 2025 00:00:00  \nThe issue of disparity between the rich and the poor, as well as between urban and rural areas, is a frequent topic of discussion, especially in seminars and academic forums. Today's reliance on the market system has only exacerbated this economic imbalance by disregarding the interest of the non-competitive people. A recent Financial Express report brings to light yet another dimension of this divide. Citing data from Bangladesh Bank, the report reveals a disturbing disparity in bank loan disbursement: while over 68 per cent of the population resides in rural areas, only 8 per cent of total bank credit is directed there. This stark imbalance not only reflects skewed development priorities but also entrenches structural inequalities by depriving rural enterprises of vital financial support. \nIn the absence of bank loans or due to the difficulty in accessing them, microfinance institutions (MFIs), particularly non-governmental organizations (NGOs), have become a primary source of credit in rural areas. Despite the relatively high interest rates charged by NGOs, rural borrowers often turn to them due to the unavailability of credit from traditional banks or the stringent conditions imposed by formal financial institutions. Although MFI interest rates have declined in recent years due to increased competition among microlenders in rural regions, interest rates on microcredit are still considerably higher than those offered by banking channels. These high-cost loans drive up production costs and undermine the competitiveness of rural entrepreneurs.\nMeanwhile, although the prevalence of mahajans or loan sharks has decreased following the expansion of MFIs, moneylenders have not disappeared. In many areas, rural borrowers continue to turn to informal lenders to meet urgent financial needs, largely due to limited access to formal banking services. A recent research report by the Bangladesh Institute of Development Studies (BIDS) reveals that moneylenders charge an average interest rate of 145 per cent. Despite such exorbitant rates, 20-30 per cent of rural borrowers still rely on moneylenders, while around 50 per cent obtain loans from NGOs.\nThis limited access to formal banking channels in rural Bangladesh is not merely a matter of inadequate banking penetration - it poses a serious threat to the very notion of balanced and sustainable development. When rural clients are systematically excluded from access to capital, it stunts their economic potential and limits opportunities for upward mobility. Growth becomes increasingly urban-centric, while poverty and underemployment become deeply entrenched in the countryside. Farmers and rural entrepreneurs, who play a vital role in the national economy, are left to grapple with persistent financial challenges - often worsened by natural disasters such as floods. Strengthening credit availability at reasonable rates is, therefore, essential to easing these constraints and promoting sustainable development in rural areas.\nTo this end, long-term policies must be adopted that prioritise rural financial inclusion and ensure that credit reaches underserved populations effectively. Financial institutions - both banks and NGOs - need to simplify loan procedures by minimising paperwork and tailoring requirements to the realities of rural borrowers. Encouragingly, mobile financial services (MFS) and agent banking have begun to transform the financial landscape in rural Bangladesh. These innovations are bringing banking services closer to the doorstep of rural residents, eliminating the need for physical travel to distant branches. Agent banking, in particular, is gaining traction as a viable banking channel. Expanding credit facilities through agent banking and MFS platforms could significantly transform rural access to finance by providing faster, more accessible, and user-friendly services. Ultimately, bridging the rural-urban banking divide is a must for achieving equitable economic growth.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bridging banking divide  for balanced growth",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bridging-banking-divide-for-balanced-growth-1750002206",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       June 16, 2025 00:00:00  \n\nThe dangerous escalation in the Middle Eastern conflict with Israel's decapitation campaign against Iran's senior military leaders, nuclear scientists and attacks on the country's military and nuclear research facilities in the wee hours of Friday (June 13) followed by Iran's launching a retaliatory missile barrage on Israel have shocked the world. Though the two countries have been on a confrontational course since long, the last Friday's attack and counterattacks have taken an existential turn. And as one fourth of the world's fuel oil and one third of liquefied natural gas (LNG) pass through the Strait of Hormuz that connects Persian Gulf to the open ocean, the consequences of any full-blown conflagration between the two countries has the potential to disrupt the flow of critical fossil energy to the rest of the world. The world market has already reacted nervously to the conflict by hiking up oil prices to as much as 13 per cent to their highest level since January.\n It reminds us the disruptions in global supply chain following the start of Russia's Special Military Operation (SMO) against Ukraine in March 2022. The oil and food prices surged globally. The ongoing attacks and counterattacks between Iran and Israel have already sent the energy market reeling from its impact. So far, neither party in the conflict has caused any severe disruption to the flow of oil and LNG through the Strait of Hormuz. But if Iran chooses to make good on its threat to block the Strait of Hormuz in case Israel continues with its air attacks on Iranian cities including energy infrastructures, then that would be a very bad news for the global oil market. Worse yet, any false flag attack on the oil facilities of the Gulf countries would not only cause the entire Middle East to get embroiled in a wider regional war, it might also finally draw the United States and its European NATO allies into the war both to protect Israel and the oil infrastructures in the region. And one cannot also rule out the ultimate involvement of other world powers including Russia and China in the conflict. For Russia has a long-term defense partnership with Iran, while China depends heavily on the smooth supply of Iranian oil. In that case, unless serious diplomatic efforts are started by the United Nations supported by the major world powers, the ongoing conflict between Iran and Israel may spin out of control. \nHowever, any talk of restraint or de-escalation as being advised by UN or some of the world powers following escalation of the conflict through Israel's unilateral attack on Iran in the morning of Friday (June 13) hardly carry any meaning. For a mutually agreed cessation of hostilities largely depends on the mutual understanding that both parties would respect the conditions of a possible ceasefire. But so far as the history of past conflicts in the region goes, Israel's record of honouring the conditions of any ceasefire is poor. So, the question of trust between the warring parties is crucial at this point. And that is more so when the declared objective of Israel is destruction of Iran's nuclear ambition, if any, and its military capabilities including regime change (in Iran). Clearly, it has become a do-or-die battle for existence for either side in the conflict.\n Most Importantly, who is going to broker any such peace deal between Iran and Israel? The US and the European powers are known for their exceptional bias towards one party, Israel to be specific. So, Iran may not accept their role as a credible peacemaker. The other powers including Russia and China would be looked upon with suspicion by European powers. The UN, on the other hand, has proved to be a toothless organization when it comes to implementation of any peace deal, even if there is no shortage of goodwill on the part of an incumbent UN Secretary-General to broker genuine peace. And the 15-member UN Security Council, which has the power to enforce peace treaties that are binding on the parties in any conflict concerned, often cannot reach a consensus on issues arising in the major flash points of conflict in the world, thanks to the veto power that its five permanent members enjoy. And the Middle East is one special case where the big powers including the US, the UK, France, Russia and China could never see eye to with one another to reach any meaningful settlement. So, it is ultimately the balance of powers in the region that would determine the fate of any settlement if ever reached in the Middle East. \nDespite such portrayal of a bleak prospect of peace in the Middle East, there is urgency to stop an all-out existential war between Iran and Israel. Even if US and its NATO allies weigh in on behalf of Israel in the raging conflict, that, too, won't be able to end the war shortly. The recent wars in Afghanistan and Iraq or the Vietnam war of the 60s and 70s of the last century have proved beyond doubt that even an overwhelming advantage of firepower on one side cannot guarantee its victory. So, any idea of ending the war by tilting the balance of power on one side would be foolhardy. Any nuclear strike on Iran that many fear Israel may resort to if it finds itself in a tight corner in any critical stage of the conflict, that would be the end of everything. In that case, everyone loses as the oil fields of the entire region would be consumed by the conflagration. It is going to be an unwinnable war. And to avoid an endgame that assures mutual annihilation, the big powers will be required to keep their cool, forget about any biases at least for the moment and try earnestly to work out a settlement to cease hostilities between Iran and Israel. Or they can also sincerely empower the UN to do the job promising non-interference in its work (of making peace).\n Otherwise, the fallout will prove to be disastrous for everyone, especially the world economy.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ending hostilities in Middle East",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ending-hostilities-in-middle-east-1750002307",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 16, 2025 00:00:00  \n\nSuccess nowadays is not based on income but more on our material belongings. As status symbols, social media and advertising force us to buy expensive phones, branded clothes, and lavish vacations. However, behind this flashy appearance, materialism is slowly turning us into a debt culture.\nThe \"buy now, pay later\" option, credit card convenience, and simple payment plans all encourage impulsive spending. Beyond individual actions, marketing strategies are progressively causing this organisational and social problem.\nFinancial anxiety, long-term debt, and a lack of savings are the horrible impacts that are undermining not only individuals but the economy as a whole. The question is now: Why are we taught that purchasing is the key to happiness? Why do we believe that success is correlated with purchasing more?\nIn order to believe in \"living smart,\" rather than \"consuming more,\" we require ethical advertising, efficient economic education, and a change in priorities.\nArobi Maria Rozario\nDhaka\narobi.rozario@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Consumerism and the culture of debt",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/consumerism-and-the-culture-of-debt-1750002327",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 16, 2025 00:00:00  \n\nThe country's medical sector is suffering from various problems, including arbitrary drug prices, the provision of drugs from one company while another, and different prices for drugs from different companies. Pharmaceutical companies have been accused of \"arbitrarily\" increasing prices. It is reported that the prices of some drugs have more than doubled in the past year. Buyers and sellers said that the prices of more than two dozen medicines used to treat several diseases, including gastric, antibiotics, and diabetes, have increased in the past year. They also said that the prices of some of these medicines have been increased by up to 110 percent. Sellers say they are also in trouble because companies have increased the prices of medicines. Earlier, early last year, drug prices were seen increasing. At that time, media reports said that the prices of about 50 drugs had been increased by 20 to 140 percent. Then, following a writ petition by the CAB, the High Court ordered that drug prices cannot be increased arbitrarily. People are already in a state of shock due to the abnormal increase in the prices of medicines. Among these, there are also complaints of medicines being sold at prices higher than the prescribed prices. Different medicines are being sold at different prices in different pharmacies.Many have accused pharmacies of selling medicines at higher prices than the prescribed price. In some cases, the allegations have been proven true. \nGovernment surveillance should be increased to keep drug prices at a reasonable level. The cost of producing medicines in Bangladesh is much lower than in the developed world. This is because Bangladesh receives exemptions from the World Trade Organization in many areas, including raw materials for medicines and intellectual property. Therefore, the government should examine how reasonable the increase in the price of medicines is even after receiving those exemptions.\nAccording to the Consumer Rights Protection Act, anyone who sells or offers to sell medicines or services at a price higher than the prescribed price is liable to a maximum imprisonment of one year and a fine of fifty thousand taka.\nBut in the past, in all the raids conducted by the administration, there have been few instances of maximum punishment. In most cases, short jail terms or fines have been imposed, which is not enough.\nAshikujaman Syed,\nBusiness Development Manager,\nTianjin Pharmacn Medical Technology Co., Ltd.\nTianjin,China.\nsyedashikujaman@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Uncontrolled drug prices",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/uncontrolled-drug-prices-1750002350",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-06-2025"
    }
]