[
    {
        "full_article": "The spectacular electoral victory of the National Democratic Alliance (NDA) in Bihar is one built on clever welfarism, astute social engineering, meticulous propaganda and the sustained popularity of Chief Minister Nitish Kumar and Prime Minister Narendra Modi in the State. The Opposition Mahagatbandhan of the Rashtriya Janata Dal (RJD), the Congress and other outfits suffered from the adverse popular memory of their reign, which ended 20 years ago. The NDA nurtured women as a horizontal voting bloc, even brazenly starting a new cash dole scheme on the eve of the election. Its caste alliance covered a larger spectrum, compared to the Mahagatbandhan, which, despite its best efforts, could not overcome the perception of being a narrow platform for Yadavs and Muslims. Mr. Kumar, who entered the campaign as a fading patriarch, turned around his fortunes, reinforced his centrality in Bihar politics, and became the fulcrum of the NDA victory. The BJP is ahead of the Janata Dal (United) in terms of vote and seat shares, but its route to Bihar’s heart is still through Mr. Kumar. The NDA seems to have benefitted from a considerable increase in female voter turnout and from welfare schemes focused on women and Economically Backward Class (EBC) households through cash transfers and self-employment subsidies. Despite being in power since 2005, with only a short break, Mr. Kumar not only deflected anti-incumbency but also enhanced his standing. This worked in combination with the image of Mr. Modi, whose Hindutva-development claims have many takers in Bihar.The Congress-RJD coalition failed to function as an organic platform, and its lack of cohesion and sense of purpose were all too evident. Its campaign was splintered, with its attention shifting between social justice and welfare slogans and a questioning of the integrity of the electoral process itself. India’s electoral process requires serious refurbishment, but does not seem to have much traction as an election issue. Also missing among the opponents of the BJP is an appreciation of the hegemony of Hindutva in the Hindi belt. There are many questions regarding the impartiality of the electoral process, but the conclusion that the BJP and its allies are winning only because of a compromised process is a misplaced one. While the NDA could mitigate the pitfalls of anti-incumbency, the Mahagatbandhan ended up holding the can for the misdeeds and misgovernance of a previous generation of its leaders. That is a sobering message for the Congress and all parties opposed to the BJP. They need to get their house in order, craft an inspiring message, and face up to the popularity of the BJP’s Hindutva politics while framing their opposition to it. Published - November 15, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        National Democratic Alliance\n                    \n                            /                      \n                        \n                        Rashtriya Janata Dal\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        welfare\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        Caste",
        "headline_1": "Double engine: On the Bihar Assembly election 2025 result",
        "headline_2": "Welfare schemes implemented close to the polls in Bihar helped the NDA",
        "link": "https://www.thehindu.com/opinion/editorial/double-engine-on-the-bihar-assembly-election-2025/article70280475.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "16-11-2025"
    },
    {
        "full_article": "President Donald Trump has garnered the dubious honour of presiding over the longest federal government shutdown in U.S. history, a 43-day spiral of economic uncertainty and gloom that was finally terminated this week. Plunging the lives of nearly 1.4 million furloughed and pay-denied federal employees into chaos, Mr. Trump and his Republican colleagues in Congress appeared to prevail over the hopes of Democrats to extend health insurance subsidies for low-income Americans, set to expire at the end of 2025. In return, they conceded precious little — the assurance of holding a vote in the U.S. Senate on the subsidies, but not a vote in the House of Representatives and no promised support by Republicans for the Democrats’ position on the subject. However, Republican lawmakers won by 60 votes against 40 in the Senate, to end the shutdown deadlock on Sunday, only because eight Democrats broke with their party ranks to support the package to fund some federal agencies and policies for the entire fiscal year, and others until January 30, 2026. A triumphant Mr. Trump vowed to press on with his campaign to end the congressional filibuster, the practice envisioned to be a means to check hasty or ham-handed legislative action, deployed by Democrats on this occasion to fight for affordable health care for low-income families.While breaking the logjam in Congress will come as a relief to many, it is hard to understate the impact of the shutdown on the economy, which saw the suspension of a range of public services, including flights, a setback to routine functions in sectors such as food and nutrition benefits including food stamps for the poor, early learning programmes for poorer families, and those relating to the Internal Revenue Service, national parks and social services more broadly. Yet, the sheer muscle power that Republicans enjoy through their control of both houses of Congress helped them put Democrats on the back foot on the shutdown issue, despite the latter’s victory in the recent mayoral, gubernatorial and other State-level elections. However, the acid test in the swing of the power pendulum between Mr. Trump, emboldened by the margin of his win at the ballots in last year’s presidential election, and resurgent Democratic lawmakers, will be next year’s mid-term elections. This will serve as a de facto referendum on the Trump administration’s job performance and will principally include within its purview economic policy issues impacting ordinary Americans, such as jobs, as well as questions on health care, education and immigration. Unless Republicans give some quarter to their liberal and progressive colleagues across the aisle, they face the risk of alienating a sizeable cohort of voters in the months ahead. Published - November 15, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        health insurance\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        family\n                    \n                            /                      \n                        \n                        air transport\n                    \n                            /                      \n                        \n                        food\n                    \n                            /                      \n                        \n                        nutrition and diet\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        US PRESIDENTIAL POLLS\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        immigration\n                    \n                            /                      \n                        \n                        health",
        "headline_1": "​Tepid relief: On the end of the shutdown in the U.S.",
        "headline_2": "The ending of the shutdown does not preclude other crises",
        "link": "https://www.thehindu.com/opinion/editorial/tepid-relief-on-the-end-of-the-shut/article70280503.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "16-11-2025"
    },
    {
        "full_article": "How BJP-JDU can start changing Bihar’s economic trajectory. Plus, lift the ban on booze\nWhat does NDA’s massive win mean for Bihar’s future? One key takeaway from BJP-JDU’s seat haul is that it’s clear the voter is neither expecting nor looking to the state to provide those elusive ‘govt jobs’, no matter promises made. There’s certainly realisation that govts simply cannot generate the jobs required. But there’s much that govt can do. And what is visible to the Bihari at large, both at home and to the migrant, is what’s been put in place over the last decade – building blocks for a state to develop. Govt investment in road infra is evident – even rural roads have expanded from a mere 1,000 km to 1L km. Over 58L dwellings were built in rural Bihar in last 10 years. Piped water coverage is total. Power consumption has increased. Law & order is relatively stable. All of which counts – a long haul from the Bihar at the turn of the century. So, where to from here?\nAfter 20 years of Nitish’s rule, it is critical to wean Bihar away from its ruinous near-total dependency on cash transfers and remittances. No governed entity can have its future determined by welfare payments and migrant income. Payouts, as a TOI columnist recently noted, were roughly 10% of annual revenue expenditure. Welfare spend just before polls was huge – Rs 10k disbursed to 1.5cr women while 1.1cr pensioners (widows, elderly, disabled) saw monthly pensions nearly triple from Rs 400 to Rs 1,100. Notching up a mighty bill of Rs 9,240cr annually. This has serious consequences for any state, but for Bihar, it means a fiscal wreck. Fiscal deficit at 9.2% of state GDP last year, Nitish’s hopes to cut this to 3% are naturally gone with the payout. Even rich Maharashtra struggles to fund its ‘ladki bahin’ scheme, serviced at the cost of other subsidies. Add to that the fact that migrant earnings, as an analyst wrote in TOI, make up 50% of household incomes – where per capita income is Rs 60k. Together, it makes for an unreliable foundation for growth in India’s poorest state. What Bihar needs, then, for meaningful change is what India needs: lots of private investment. Of course, that’s easier said than done. Private investment India-wide has weakened. State and PSUs have stepped in. In 2023-24, private sector share in gross fixed capital formation (GFCF) – a key measure of investment in physical assets – dropped to 33%, a sharp decline from over 40% in 2015-2016.\nSo, what can Bihar do for an immediate boost? Lift prohibition. In 2015-16, the year before Nitish’s poorly thought out ban, Bihar govt earned Rs 3,142cr excise, primarily liquor revenue, 12% of the state’s tax haul. The next fiscal, post-ban, excise earnings were down to Rs 30cr, and crashed to 0, where it’s stayed. Prohibition has had a grievous social cost. A parallel economy flourishes, hooch deaths have destroyed families. Look to brother UP – in 2023-2024, its excise earnings were Rs 45,571cr. Bihar shouldn’t parch itself of this revenue stream and must ditch the ban that’s run its course.\n\n",
        "headline_1": "NDA, Say Cheers",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/nda-say-cheers/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-11-2025"
    },
    {
        "full_article": "Islamabad blaming India and Afghanistan for terrorism on its own soil is laughable\nPakistan continues to live in a state of delusion. After a suicide bombing outside an Islamabad court claimed the lives of 12 people, Shehbaz Sharif quickly pointed fingers at India and Afghanistan. Needless to say, this is laughable and a poorly disguised attempt at defecting blame from Pakistan’s own failings. For a country that practically wrote the playbook on maintaining double standards on terrorism – nurturing terror purveyors while claiming to be victims of terrorism – it’s rich that it now tries to implicate others for its own sins. \nThere was time in the 1950s and 60s that Pakistan was being studied by foreign experts as a possible South Asian success story. But the disastrous measures of its leadership in 1971 in response to the liberation movement in what was then East Pakistan – now Bangladesh – served a body-blow to the very idea of Pakistan. Today, it continues similar colonial policies in Balochistan, provoking a powerful movement against Islamabad’s exploitation. During the Soviet-Afghan war, Pakistan hosted tens of thousands of mujahideen fighters to curry favour with US. Pakistani Taliban is their progeny. Recall also, it was merely a 100km from Islamabad in Abbottabad that bin Laden was found holed up.\nPakistan thinks it can play all sides and be friends with both US and China, turning to each whenever it needs to be bailed out. But it forgets that national strength stems from skilled people, institutions and economy. All three failed to develop because its military had other priorities. Today, Pakistan is a military dictatorship masquerading as a civilian regime. And with the 27th constitutional amendment – which gives lifetime immunity to Asim Munir – about to be passed, even the fig leaf of a hybrid regime is coming off. The question is how long Pakistan’s delusions can last in the face of its polycrises.    \n\n",
        "headline_1": "Joke’s On Pak",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/jokes-on-pak/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-11-2025"
    },
    {
        "full_article": "He sounds keen on a trade deal now, but it’s in India’s interest to wait for US Supreme Court order on his tariffs \nAfter delays, disappointments and a brief falling out, the India-US trade deal seems around the corner. Trump’s said it’s “pretty close”. Commerce minister Piyush Goyal sees it happening “any day” now, even “tomorrow”. For India, it won’t be a day too soon because $40bn worth of labour-intensive exports have been at stake ever since Trump imposed a punitive tariff on India in late Aug. US equally needs a deal to access Indian markets, and ensure the India-China thaw – forced by its own rigid stand on Russian energy – does not hurt its strategic interests. \nThe deal has to happen. Not because Trump considers India an “amazing country”, but because it is a nation of “actually, 1.5bn people”, where he expects his new ambassador, Sergio Gor, to “promote investments in key industries and technologies, increase American energy exports and expand our security cooperation”. Clearly, US needs India as much as India needs it. After his petulant “dead economy” jibe in July, Trump got real about India. By early Sept, he was looking forward to “speaking with my very good friend, Prime Minister Modi”. Birthday wishes, Diwali greetings, and thanks for “support on ending the War between Russia and Ukraine” followed.\nThere have been five rounds of trade negotiations meanwhile, and it looks like there’s nothing left to iron out now. For India, this resolution is commendable because not once – unlike UK, Japan, Korea, etc – did it rush to plead its case, and pump up Trump. It refused to bend under the burden of his 50% tariff, and as Goyal said, has refused to “compromise the interests of farmers, dairy and workers”. Likewise, Trump is satisfied that India has “very substantially” cut back its purchase of Russian energy. Bloomberg recently reported that five big Indian refiners have not ordered any Russian oil for Dec. That gives Trump his off ramp to slash tariff on India.\nThe stage is set then, but India shouldn’t sign the deal before Trump waives the penal tariff. When it goes, the balance 25% tariff would still be disadvantageous for India, vis-à-vis Vietnam, Malaysia, Cambodia and China, which enjoys unmatched economies of scale. Having been so patient for so long, India should aim for a 15% rate. There’s no need to rush because if US Supreme Court strikes down Trump’s tariffs in the coming weeks, the pre-Trump average US tariff of 3.3% would be far more advantageous than any deal.\n\n",
        "headline_1": "Trump’s Dealemma",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/trumps-dealemma/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-11-2025"
    },
    {
        "full_article": "New weapons of ‘mass’ destruction\nThere was much buzz last week over weight-reducing drug Mounjaro becoming No. 1 pharma brand, outselling infection-reducing Augmentin. This not only knocks inches off its exultant users but now made its manufacturer Eli Lilly inch past GSK. Its India partner for this is legendary KA Hamied’s Cipla, which till now was best known for knocking the bottom off Big Pharma. In fact, the multinationals lobby was rumoured to have deprived Cipla’s scientists of the Nobel it could well have won for its pathbreaking anti-retroviral HIV-AIDS therapies. Ah well, good to know it’s gone viral by now coming to the aid of those immuno-deficient against other appetites.\nWhat’s getting eyes popping and jaws dropping is the speed at which this WRD is mopping off competition. Its Sept sales jumped 42% higher than Aug’s. That’s when it gave a severe gastric attack to antacid Pan to become No. 2 in India. Should we call it Mounting KiliMounjaro?  Unlike Africa’s long-dormant highest peak, it has def created a volcanic disruption. \nOk, regardless of the belching lava (and not just from antacidwallas), isn’t the news about a WRD ousting an antibiotic something to celebrate? It suggests that more people are worried about the effect of burgers than of bacteria. C’mon, what’s not to hurrah about that?  \nLet’s take our Insta divas – and who isn’t, since everyone is on non-candid camera? If they’re swagging about with the give-away shriveled, hollow-cheeked look once reserved for those seriously afflicted, I’d say weight-reduction drugs are a great leveller. A social one especially, since going to bed hungry has leapt from dire necessity to lifestyle choice.\nAugmentin sales were augmented by its combinations which helped combat several multidrug-resistant (MDR) bacteria. Now along comes this aura-exuding WRD offering multicuisine resistance. ‘Gimme more!’ say the hip and hyped, ‘so I can eat less of more.’ And get a flat tummy without big-bucks tuck. Wow!\nThe icing on the chocolate cake is that it reduces blood sugar as well. Diet and diabetes tackled in one swallow. \nBtw, a major side-effect is heartburn/acid reflux. Revenge of the ousted antacids?\n                                                *** \nAlec Smart said: “The Hippocrates oath has been doctored – cynically.”\n\n",
        "headline_1": "Fat-checking",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/fat-checking/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-11-2025"
    },
    {
        "full_article": "Within hours of Prof Yunus's address to the nation outlining a way out of the persistent deadlock on July charter, our political parties started expressing their dissent, creating doubts as to whether they have really examined the merits of his assertions. Do they constitute the best possible solution? No. Do they address all underlying issues? No. But they are the most practical and doable ones at the moment. So, political parties shouldn't be so prompt in rejecting the chief adviser's suggestions.\nHis proposal for holding the election and the referendum on the same day is both sensible and practical. Jamaat's demand for the latter to be held on a separate day boggles the mind, given the logistical challenges it would entail. Moreover, no explanation has been provided as to what the problem would be if both were held on the same day. We hope Jamaat accepts this proposal.\nThe suggestion regarding the formation of an Upper House on the basis of proportional representation (PR) of votes received through a free and fair election also seems the best option for Bangladesh. The idea of a second chamber in parliament is to restrain the arbitrariness of the majority party in the lower house. We have had too many instances where the majority party made laws that suited them, and even amended the constitution at will—the abolition of the caretaker system through the 15th Amendment in 2011 being a case in point. Therefore, the upper house should not be a mirror reflection of the lower house if it is to exert any restraint on it. A balance of power between the two chambers is necessary. We hope the BNP sees the merit of this change.\nThe NCP's central demand that a decision must be taken to implement the July charter has now been met. A gazette has been issued addressing all the legal aspects of this issue. But for them to state that they do not accept it because the president signed it is really throwing a spanner in the works of the charter's implementation. Our focus should be to lay the groundwork for its execution.\nNaturally, differences between political parties are bound to exist. In fact, they are a healthy feature that encourages innovation in politics. We want differing ideas to percolate through our political discourse. But the existing habit of issuing ultimatums and threatening sit-ins and street agitations whenever demands are not met will only lead to further confrontation. We must move away from this habit.\nThe nearly nine months of dialogue held by the National Consensus Commission seem to have amounted to very little, as again evidenced by the instant political reactions to Prof Yunus's address. We believe political parties should take a more serious look at it. The election is only a few months away, and we need to focus entirely on holding it in the freest and fairest manner possible. We urge all parties to take a practical view of things and come together in a way that will restore confidence among the people that we are finally set on the path to restoring democracy and rule by an elected government.\n",
        "headline_1": "Yunus’s address merits serious reflection",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/yunuss-address-merits-serious-reflection-4034201",
        "news_paper_name": "The Daily Star",
        "publish_date": "16-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 16, 2025 00:00:00  \nThe persistent challenge of elevating revenue collection remains the central economic puzzle that Bangladesh has attempted to solve for many years. From enacting a new income tax law in 2023 to expanding and reorganising both the Income Tax wing and the Customs and VAT wing, the government has introduced a series of initiatives designed to strengthen the institutional capacity of the National Board of Revenue (NBR) and raise collections. These steps will require time before their impact becomes visible, yet the way the revenue system is currently functioning suggests that such manoeuvres may not be enough to address long-standing weaknesses. The government continues to face increasing expenditure pressures, and without meaningful improvements in revenue performance, it risks relying even more heavily on deficit financing. In this setting, the recent call by the International Monetary Fund (IMF) for Bangladesh to place far greater emphasis on revenue mobilisation serves as a timely reality check. The warning is clear that repeated failures in revenue performance will undermine the quality of public services and delay essential infrastructure building. \nThe revenue shortfall described by the IMF is already a recognised and alarming issue. It is a serious concern that Bangladesh now has one of the lowest tax-to-GDP ratios in the region at about 6.56 per cent, far below the Asia Pacific average of 19.5 per cent. At IMF's counsel, the government has begun separating policy formulation from enforcement within the NBR by splitting it into two divisions, a reform expected by December that aims to change the entrenched practices within the institution. While the principle of separating these functions to avoid conflicts of interest is conceptually sound, it may very well prove inadequate to address the fundamental weaknesses in revenue mobilisation. Without a substantial expansion of the tax base and improved collection efficiency, such incremental adjustments will be insufficient to escape a perilous fiscal trap the country is entangled with. The strain is visible in the government's diminished capacity to make essential investments in infrastructure and to respond decisively to the prolonged spell of high inflation. A government's ability to function well and invest in the future of its people depends entirely on its success in collecting taxes fairly and efficiently. When tax income falls this low, resources for critical spending shrink and borrowing becomes the only viable fallback. \nFurthermore, as the IMF rightly noted, an underfunded treasury makes it nearly impossible to address the deep vulnerabilities within the banking sector. Recapitalising state-owned banks, reducing non-performing loans and improving financial governance are now a priority but they all require significant public money. Without these, the financial system continues to pose a latent threat to macroeconomic stability. The IMF's specific mention of strengthening anti-corruption measures and improving the Anti-Money Laundering framework is particularly telling. Corruption by a section of NBR officials and their willing partners among taxpayers is well known, and their actions have punctured the public purse from within and deprived the state of much needed revenue. Plugging this hole is essential for achieving collection targets and restoring public confidence that taxes are used responsibly.\nThe future of Bangladesh's economy depends on its ability to break free from the low-revenue trap. This is why the enhancement of revenue collection must be treated as a national responsibility rather than an external demand. Key measures must include expanding the tax net to encompass sectors with long-standing privileges and aggressively promoting digital systems for VAT and income tax to improve compliance and fairness. The IMF has warned that the window for meaningful action is narrow. Bangladesh should respond with the urgency this warning deserves and adopt measures that can lift the country out of its revenue constraints with resolute political commitment.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Paying heed to IMF's revenue warning",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/paying-heed-to-imfs-revenue-warning-1763207587",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       November 16, 2025 00:00:00  \nFor more than a decade, the global community has been working towards the goal of doubling the share of global exports from the Least Developed Countries (LDCs) to two per cent by 2020, up from one per cent a decade ago. There has been the United Nations (UN) Sustainable Development Goals (SDGs') call to 'significantly increase the exports of developing countries, in particular with a view to doubling the least developed countries' share of global exports by 2020.' When the UN formally launched the SDGs a decade ago, in 2015, the share of LDCs in global trade was only one per cent in terms of exports. In this connection, two per cent of global exports in 2020 is determined as the indicator.\nNevertheless, a decade after setting the target and five years after the deadline, the LDCs' combined share in global trade remains below two per cent of global exports, reflecting disappointing progress. In 2024, LDCs accounted for just 1.03 per cent of global exports, up only marginally from 0.96 per cent in 2012. \"These figures highlight the persistent structural barriers -- limited diversification, weak infrastructure and small productive bases -- that continue to constrain export growth in LDCs,\" observed the UN Trade and Development (UNCTAD) in a recent note.\nA note prepared by the Secretariat of the World Trade Organisation (WTO) and submitted to the Sub-Committee on LDCs in the last month showed that between 2019 and 2024 LDCs' exports of goods and services grew at an average annual rate of 6.7 per cent. In 2024, the goods exports of LDCs increased by 5.0 per cent year-on-year. Exports of commercial services, however, registered a strong growth of 12.6 per cent. The note also mentioned that in 2024, the share of LDCs in world exports of goods and commercial services increased to 1.03 per cent, up from 1.01 per cent in 2023. LDCs' share in world imports increased to 1.41 per cent in 2024 from 1.37 per cent in 2023. Thus, the share of LDCs in total world trade of goods and commercial services increased from 1.19 per cent in 2023 to 1.22 per cent in 2024.\n\nThe target of doubling the LDCs' share in global exports in five years was ambitious. Earlier, the LDCs' share in global merchandise exports almost doubled in 15 years, from 0.6 per cent in 2000 to one per cent in 2015. The LDCs' share in global exports of commercial services also doubled within a decade, from 0.50 per cent in 2005 to 0.90 per cent in 2015. \nSeveral factors drove the global community to set the ambitious non-binding target of doubling the LDCs' share in exports in five years. Initially, it was a commendable gesture of global cooperation under the UN SDGs framework for the five Ps: people, planet, prosperity, peace, and partnership. Second, it was presumed that the poorest nations of the world could significantly improve their socio-economic conditions by enhancing trade, especially exports. Therefore, supporting the exports of LDCs through multilateral trade benefits under the WTO umbrella will be beneficial in increasing their share in global exports. This increase in share could potentially lead to improved socio-economic conditions and a brighter future for the LDCs. Third, a persistent rise in global trade during the first two decades following the WTO's inception also widened expectations. Despite a significant drop in 2008 due to the global financial crisis, global trade surged by around fourfold between 1995 and 2014. UNCTAD-WTO estimates showed that global trade in goods and commercial services increased to $23.50 trillion in 2014 from $6 trillion in 2005 when the WTO formally came into effect. \nAt present, there are 44 LDCs on the United Nations (UN) list, 37 of which to date have become WTO members and six are in the process of joining the WTO as members. And 15 LDCs, both WTO members and non-members, are at the different stage of graduation.\nOver the decades, developed and developing countries have offered preferential market accesses to the LDCs in various forms like duty-free quota-free access and relaxed rules of origins. The offers are made under bilateral, regional and multilateral arrangements to enhance the LDCs' exports. Australia, New Zealand, Norway and Switzerland offer 100 per cent duty-free market access to LDCs whereas Chile, the European Union (EU) and the United Kingdom (UK) offer over 99 per cent duty-free market access to LDCs. The WTO secretariat note also mentioned that duty-free coverage is 98.5 per cent for Canada and 97.8 per cent for Japan. Some other WTO members grant duty-free access to around 90 per cent or more of their tariff lines, including India, the Republic of Korea and Montenegro. In addition, Hong Kong, Macao, and Singapore grant duty-free market access to all or almost all of their tariff lines under their respective most-favoured-nation (MFN) scheme. \nSo far, the market access benefits have not been optimal for the LDCs mainly due to discriminatory treatment by the preference giving countries to a number of LDCs. For instance, the United States (US) offers Generalised System of Preference (GSP) for least-developed beneficiary developing countries (LDBDC) covering 82.7 per cent of tariff line as duty-free. The preferential benefit excludes apparel and clothing, cotton, fibres, footwear, dairy and other animal products. That means critical and major exportable items of LDCs are subject to higher tariff. The US also scraped the GSP for Bangladesh more than a decade ago.\nThe tariff blitz by the United States (US) President Donald Trump is the latest blow to the LDCs' trade. UNCTAD, in an analytical note released last month, said: \"Tariffs on LDCs' exports to the US market have recently tripled -- and they are twice as high as those faced by developed countries.\" UNCTAD also estimated that the competitiveness of the 44 LDCs would be eroded in the market, which represents nearly 10 per cent of their exports. \nJust before Trump formally took office as the President of the US in January this year, LDCs on average faced less than 10 per cent tariff in the US market. In October, the rate stood at 28.30 per cent. The average rate of applied US tariff on developed countries stood at 14.20 per cent and on developing countries (excluding China), 19.20 per cent.\nIn 2024, Bangladesh was the top merchandise exporter among the LDCs, covering 17 per cent of all LDCs' exports, followed by Angola, the Democratic Republic of the Congo, Cambodia, and Myanmar. Ethiopia was the largest exporter of LDCs' commercial services (17 per cent), followed by Tanzania (15 per cent), and Bangladesh (11 per cent) in the last year.\nWhat is most alarming is that the graduating LDCs, especially in Asia, face steep surges in US tariffs. At present, four Asian countries, namely Bangladesh, Cambodia, Lao PDR, and Nepal, are on the path of graduation from the LDC category by 2030. Of these, Bangladesh, Lao and Nepal are scheduled to strip off the LDC tag in November next year. The high US tariffs have definitely made the smooth graduation difficult for these countries, posing a significant challenge to their development.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Setbacks LDCs are up  against in global trade",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/setbacks-ldcs-are-up-against-in-global-trade-1763207926",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       November 16, 2025 00:00:00  \nSocial media offers a unique platform for independent content creators to express themselves freely, experiment with new ideas, and both enlighten and entertain their audiences. This unprecedented freedom of creating and publishing online content has unleashed countless talents, many of whom are now hailed as social media influencers, while social media sites have become readily accessible sources of both information and entertainment. However, the relentless pursuit of making contents viral is now challenging humanity, decency and responsibility.\nThe obsession with \"going viral\" is driving many online creators to produce bizarre, fabricated and unethical content. The more ridiculous the content, the more likely it is to attract views, and in today's monetised digital economy views translate directly into income. This incentive structure has driven many online content creators to trivialise danger, undermine social norms, and, most worryingly, harm others, both people and nature.\nOne such glaring example has recently come to light from the Sherpur forest area, where hundreds of vloggers reportedly throng every day to provoke wild elephant herds solely to capture sensational footage. Reportedly, they throw stones, make loud noises, or otherwise agitate the elephants, hoping to capture dramatic reactions on camera. When the frightened and furious animals charge, the so-called content creators record it and later upload the footage on social media sites. These videos may generate thousands of views, but the consequences are devastating.\n The forests in Sherpur, Jamalpur, and the Mymensingh belt once embodied a unique ecological balance, where diverse flora and fauna thrived harmoniously for ages. But today, growing human intervention has severely disturbed this natural equilibrium, leading to serious consequences for nature and people. Wild elephants, already vulnerable due to shrinking habitats, interpret harassment by content creators as a direct threat. So, it is quite natural that elephants will attack the nearby villages, their properties and croplands. When this happens, local residents, their homes and their croplands bear the brunt of this madness in the wilderness.\nReportedly, local residents counterattack elephants to protect themselves. Thus, the irresponsible behaviour of the content creators is pitting men and animals against each other. Action must be taken to bring an end to this hostility between nature and people to protect the forest area from the menace of online creators.\nThe forest department is entrusted with the task of protecting forest resources and conserving biodiversity. But, as is reported time and again, it has miserably failed to stop killing of wild animals and plundering of resources. Reportedly, the forest department has too few personnel to take action against the large number of vloggers. \nThis is just one example of the online content creators menace. Recently, some content creators were found forcibly shaving the heads of vagabonds solely to boost their viewership.\nThis trend also reflects a deeper moral decay. Creative freedom is a gift, but it should come with responsibility. If content creators cannot uphold basic ethical standards, strict legal enforcement is essential. In this regard, Bangladesh can draw lessons from China's recent regulation for online influencers, which requires content creators to have recognised qualifications. This ensures accountability and recognises the real-world consequences of unchecked influence.\nA similar framework in Bangladesh could encourage responsible content creation, particularly when public safety, wildlife, or community welfare is at stake. Clear guidelines, stricter oversight, and accountability mechanisms would not stifle creativity but would protect society from the harmful effects of reckless content. As social media continues to shape behaviour and public perception, Bangladesh must balance freedom with responsibility, ensuring digital spaces remain safe, ethical and constructive for all.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Time to regulate online content creators",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/time-to-regulate-online-content-creators-1763207980",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 16, 2025 00:00:00  \n\nIt has been quite a journey for Bangladesh over the past few years as an emerging hub for start-ups. Even though vicissitudes are expected in any business landscape, the overall scenario has been rather downhill, raising notable concerns among stakeholders.\nBack in 2018, Bangladesh-based start-ups managed to raise $119 million, marking the golden start of a new era. However, that era was lost even before it could fully take off when COVID-19 hit in 2020, and investments plummeted to $51 million. Yet, in 2021, Japan's SoftBank single-handedly invested $250 million, bringing the total investment for the year to $435 million.\nNevertheless, investments again took a nosedive, and by 2024, they had dropped to just $35 million. According to many sources, there are several prominent reasons why investors are no longer interested in Bangladeshi start-ups: poor accountability, unclear business models, unbalanced teams, and weak leadership. High tax rates, restrictive business boundaries, and a volatile economy also contribute to the lack of investor confidence.\nCompared to last year (2024), Bangladesh has climbed four places and currently ranks 79th in the Global Startup Ecosystem Index, while India remains in the top 20.\nIndia enjoys a vast consumer base, cheap internet access, and relatively strong digital infrastructure. The city of Bengaluru is now called the second Silicon Valley of the world, hosting all the tech giants. It attracts prominent investors and nurtures a significant number of entrepreneurs. By contrast, Bangladesh lags behind in such infrastructure, which limits its ability to attract foreign investment.\nAlthough the number of start-ups in Bangladesh is nearly 1,500, most are unprofitable or far from securing funding. Operating in a limited market and serving only specific segments, it is challenging for these businesses to scale. Bangladesh's economy presents numerous challenges that make it less attractive to foreign investors. Political instability, inefficient bureaucracy, and frequent policy changes create an unfavourable business environment. Many companies also face hurdles in repatriating profits due to exchange rate issues. These factors collectively make Bangladesh appear as a risky business environment, resulting in investor hesitation to commit to local ventures.\nMd. Saki Redoan Hamid \nsaki.hamid.241@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Start-ups and problems they are facing",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/start-ups-and-problems-they-are-facing-1763207994",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-11-2025"
    }
]