[
    {
        "full_article": "Union Home Minister Amit Shah has rightly stressed the need to make a distinction between refugees and infiltrators. Though valid, the problem lies in the application of objective parameters by those in power to make a distinction. Even where proper policy and a legal framework exist, issues may arise. Also at play is the level of official understanding. In India, which is not a signatory to the 1951 UN Convention on the Status of Refugees and the 1967 Protocol, there is no comprehensive single law defining who a refugee is, leaving scope for arbitrary action. Till the end of March 2025, apart from the Citizenship Act 1955 and the Passports Act 1967, three laws (the Foreigners Act, 1946, the Registration of Foreigners Act, 1939 and the Passport (Entry into India) Act, 1920) were applied to deal with foreign nationals, including refuge seekers. From April, the Immigration and Foreigners Act replaced the three pre-Independence laws and subsumed the Immigration (Carriers’ Liability) Act, 2000. While this streamlined the legal framework, the absence of a refugee policy document has also led to different yardsticks for the refugee community in India. While there was a rehabilitation policy in 2014 for about 63,000 Tibetan refugees, there is no such document for the nearly 90,000 Sri Lankan Tamils. At the end of June 2023, the population of refugees or persons of concern in India was over 2.11 lakh (also counting those from Myanmar, Afghanistan, Bangladesh, Africa and West Asia). Any undocumented or overstaying refugee is regarded as an illegal migrant (Citizenship Act). He can also be called an infiltrator. Thus, genuine and harmless refugees risk facing harassment.Even though the Citizenship (Amendment) Act, 2019 was aimed at providing citizenship to six religious minorities belonging to Bangladesh, Pakistan and Afghanistan, it drew sharp criticism as it discriminated on the lines of religion and left out sections of Muslims, and also Sri Lankan Tamils and the Rohingya, both minorities in their countries. But in a notification last month, undocumented or overstaying Tamil refugees, who have registered themselves with the authorities, were granted exemption from penal provisions of the Immigration and Foreigners Act, provided they took shelter in India on or before January 9, 2015. Other groups too have been covered. Still, there is no change when it comes to the recent trend of religion-based exclusions. There is nothing fundamentally wrong with the approach of discreet humanitarian relief to refugees in general but this has to be backed by consistent, rational and fair treatment for all.  Published - October 16, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        refugee\n                    \n                            /                      \n                        \n                        United Nations\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        immigration\n                    \n                            /                      \n                        \n                        illegal immigrants\n                    \n                            /                      \n                        \n                        Tibet\n                    \n                            /                      \n                        \n                        Sri Lanka\n                    \n                            /                      \n                        \n                        Myanmar\n                    \n                            /                      \n                        \n                        Afghanistan\n                    \n                            /                      \n                        \n                        Bangladesh\n                    \n                            /                      \n                        \n                        Citizenship Amendment Act\n                    \n                            /                      \n                        \n                        religion and belief\n                    \n                            /                      \n                        \n                        minority group\n                    \n                            /                      \n                        \n                        welfare\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Rohingya crisis",
        "headline_1": "Refugees and infiltrators: On different yardsticks for India’s refugee community",
        "headline_2": "India needs a refugee policy document that is non-discriminatory",
        "link": "https://www.thehindu.com/opinion/editorial/refugees-and-infiltrators-on-different-yardsticks-for-indias-refugee-community/article70167639.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "16-10-2025"
    },
    {
        "full_article": "The 2025 Nobel Prize in Economic Sciences has been awarded to Philippe Aghion, Peter Howitt and Joel Mokyr, who have, over decades, attempted to explain humanity’s unprecedented progress over the past two centuries. While Mokyr has provided the long historical and cultural context, Aghion and Howitt have given it a formal mathematical frame or the “creative destruction” model. The idea itself is older. It originates with economist Joseph Schumpeter, who described capitalism as an evolutionary system in which innovation continuously displaces old technologies, firms and industries — a process both creative and destructive. But Schumpeter’s framework rested on certain assumptions: that markets are free, competition is open, and the state acts only as an enabler of private enterprise, not as a driver of innovation. This assumption sits uneasily with the historical record. The long vision of the erstwhile Soviet state, and now the Chinese model of developmental capitalism, reveal how the state itself can shape and direct innovation. The creative destruction model, refined by Aghion and Howitt in the early 1990s, emerged during the twilight years of the Cold War, just as the Washington Consensus and neoliberalism became the dominant global economic paradigm. These models reinterpreted Schumpeter’s idea in mathematical form through the endogenous growth theory — the notion that long-term growth is generated not by external forces but by innovation, education, and research arising within the economy. Crucially, it assumed that competition and private incentives — not central planning — are the engines of technological progress.But the Nobel recognition comes at a time when the very conditions for this model to succeed have been upended by U.S. President Donald Trump. His administration has weaponised global trade, politicised science and technology, and turned markedly protectionist, departing from the open, rent-seeking capitalism of the post-war American economic order. While the creative destruction and endogenous growth models remain powerful tools to understand progress within a specific system — that of neoliberal capitalism — they fail to explain the exponential technological advances of state-led economies such as China. These models also overlook how geopolitics, institutional fragility and widening inequalities can reshape the very structure of innovation. It is thus telling that the Nobel Committee has chosen to honour a framework whose ideal conditions — liberal markets, global openness, and scientific freedom — are under strain. This perhaps must be viewed as a warning that for liberal democracies to thrive, they must not renege on the ideals of institutional freedoms within state-enabled capitalist societies. Published - October 16, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        economics (education)\n                    \n                            /                      \n                        \n                        award and prize\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        USA",
        "headline_1": "​Evolution, revolution: On the Nobel Prize in Economic Sciences 2025",
        "headline_2": "The economics Nobel is a nod to freedom and innovation",
        "link": "https://www.thehindu.com/opinion/editorial/evolution-revolution-on-the-nobel-prize-in-economic-sciences-2025/article70167655.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "16-10-2025"
    },
    {
        "full_article": "A DNA-based census confirms that India is not doing right either by the creature or its own heritage\nThat India is symbolically associated with the elephant (as US is with the eagle and China with the dragon) says something about its place in our civilisation and imagination. As the new Status of Elephants in India report reminds at its start, these majestic creatures are revered in connection with Lakshmi, Ganesha, Buddha…and killing an elephant was punishable with death in the early Mauryan period…and so on. Not every country is blessed with such a rich heritage of coexistence, compassion and worship in relation to animals. But are we living up to it? Not at all.\nThe new 2021-25 estimate of India’s Asian elephant population is 22,446, down 19% since the 2007 estimate. Yes, the use of the DNA-based mark-recapture technology this time means the data are not totally comparable, even as it provides a much more reliable baseline for future monitoring. Also yes, the report is crystal clear and detailed that India is disrespecting and hurting elephants today, across the country. For example, the once-contiguous elephant population in Western Ghats continues to be rapidly disconnected by factors like changing land use and mushrooming developmental projects. Such fragmentation is acute in the Northeast, which holds the second largest elephant population of India.\nAcross the planet, the last century has seen humanity quadruple its number while African elephants have lost nearly 90% of theirs and Asian ones 70%. Even modern notions of compassion are all screwed up. For example, tourists feel good about themselves when they support so-called elephant sanctuaries. Hey, let’s bathe with a baby elephant, they looove the water after all. But when that baby has to stay in the water all day, pulled away from her own family to entertain one set of strangers after another, that’s severe exploitation of a sentient being. This intelligent animal belongs in the wild. Any domestication is the result of a long list of cruelties. And it will remember each of these, given its extraordinary memory. We put the elephant in a lot of our stories. But it is not known with certainty what she thinks of us. Going by our modern track record, she likely finds us disgusting.\n\n",
        "headline_1": "Elephants Are Losing",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/elephants-are-losing/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-10-2025"
    },
    {
        "full_article": "Lit-content, cantonment, contentment  \nCity litfests do plains talking. But those up in the  hills give you a special high. True, Namita Devidayal and I curated the  much-missed TOI Mumbai litfest, and long-ago colleague Amy Fernandes continues Litlive rooted here by her partner, Anil Dharker. Close friends organise the three which genuflect to Kolkata’s eentaalectchual pretensions. But don’t hang me for disloyalty, and bad puns, if I maintain that Himalayan litgigs offer a unique range of views to peak your interest.\nKhushwant Singh Literature Festival set in Himachal’s deodar-speared Kasauli and overseen by Dhauladhar’s snow-capped sweep  is all this. And personally special. It celebrates my first editor whose example taught me to take my work very seriously, but not take myself too seriously. Attending is my annual guru dakshina; I offered it again last weekend..  \nSet up in 2011 by Rahul Singh and Niloufer Bilimoria, it stands apart from the growing legion on two counts. One, its emphasis on Khushwantji’s prime obsession, nature — propitiated here not just in diverse sessions but by recycling every plastic water bottle. Two, its address. Kasauli is clean and green because  it’s a cantonment. Top brass burnish KSLF’s sessions and social conversations, all amidst the spit and polish of  the venue, Kasauli Club. \nBoth USPs of KSLF, nature and Army, made this 14th edition specially relevant: Its backdrops were the manifestly worsened devastation of  Himalayan landscapes and Operation Sindoor. \nClub chairman Brig Sundeep Madan (with bubbly Richa) wore his four hats lightly. And Lt Gen MK Katiyar, GOC-in-C, Western Command, his medals: PVSM, UYSM, AVSM. So did his Central Command counterpart, Anindya Sengupta, who had all these plus YSM. Maj Gen Ajay Misra, GOC, TASA, proudly showed me his and wife Shyamanjali’s lavish, 200-year military history of Secunderabad. ’Twas great catching up with old KSLF pals Lt Gen Kamal Davar, Anantha and Aparna Narayanan, and Deepa and Anand Sethi, who’s created a haunting museum at 170-year-old Dagshai Central Jail across the hills.\nIt’s a rare treat for a civvy cat like me  to prowl amidst the Generals. My pacifist leanings (like Khushwantji’s) too found echo in the presence of  the ex-Army Chief Gen Manoj Naravane, who’d notably warned, ‘War is not a Bollywood movie.’ Wife Veena has just written three, age-centric manuals on handling the unique grief of  a killed soldier’s child.\nHelloh-ji, there’s a third KSLF USP: its largely Punjabi audience. Not just faujis commanded by armoured kaurs, but chamko-ing changi kudiyan and  not-mundane munde ballsy up the  Q& A and balle- balle the evenings. This too propitiates the spiritedness of Khushwant Singh.\n                                               ***\nAlec Smart said: “ I could’ve got the Econ Nobel.  We satirists too propound ‘creative destruction’.”\n\n",
        "headline_1": "Make words, not war",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/make-words-not-war/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-10-2025"
    },
    {
        "full_article": "Silver’s sterling run is not just as a hedge but because it’s used in tech products \nImagine going to the bank to buy a silver bar, only to be told they’re all sold out. This happened in South Korea. As gold and silver scale record prices amid a new wave of expected tariff skirmishes and deals, even as US govt remains shut down, investor demand is unsurprisingly all bullish. But the question about silver is not if there’s a ‘scarcity’ but what drove the demand from investors that saw a historic surge since Thursday last, such that it triggered the most unusual, and rare, phenomenon of spot prices in London, with the market running short on physical silver, beating US futures rates. Demand beats speculation. Though the squeeze in London is easing, it has badly hit India, silver’s largest consumer and importing 80% of demand, bang in the middle of the festive season. London saw a shortage of physical silver because since Trump’s unpredictable tariffing earlier in the year, traders have shipped the metal to US. Silver also made its way into Washington’s draft list of critical minerals, a move to secure its domestic supply chains. This list is under scrutiny, which is what sparked bigger fears of possible tariffs.\nBut why is silver, whose price largely moves in the same direction as gold, ever the safe haven in volatile times and during economic downturns? Traditionally, like gold, investors hold silver, not ‘use’ it so much. But here’s what needs watching because clearly, this is changing. Silver has rapidly acquired an edge over and above its value as investment as ETFs or in jewellery, bars etc. Price of silver is impacted by investor demand, not so much mining surplus or deficit, given it is a byproduct of mining other metals. While gold prices are scaling record highs too, and silver is expectedly tracking gold’s rally, global demand for silver is equally for its pivotal role in tech applications – making EV batteries for one. Cost of production is yet prohibitive – one cutting-edge EV battery might require a kilo of silver, but reportedly delivers far improved energy capacity, charging speed and longevity. Silver’s gone places gold hasn’t been before, a transition that has well begun.\n\n",
        "headline_1": "Not Gold, But Shining",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/not-gold-but-shining/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-10-2025"
    },
    {
        "full_article": "CJI Gavai was right to uphold the bulldozer judgment as a high point for the top court. That unlawful bulldozing of houses continues, is thanks to the executive, which is supposed to implement judicial orders\nIn a recent address in Mauritius, CJI Gavai reflected on what he described as one of his tenure’s defining judgments –the ‘bulldozer case’.\nRead full story on TOI+\n\n",
        "headline_1": "Why blame SC when govts are the guilty party",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/why-blame-sc-when-govts-are-the-guilty-party/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 16, 2025 00:00:00  \nOnce again a devastating fire originating from an unauthorised chemical warehouse has claimed at least 16 lives. This time the tragedy happened not in the infamous areas of old Dhaka but in Mirpur's Shialbari area. All 16 people died in a garment factory housed in a four-storey building next to the chemical godown. Fire and toxic fumes from the chemical warehouse spread to the garment factory and claimed the lives of some of its workers. It is the same old story that the workers could not escape the blaze because the doors leading to the roof of the building was locked. That the building has no emergency exit is clear because a few who could survive had to break window grills of the building on fire and jump on an adjacent tin-roofed house. Whether the building had approval for housing a garment factory is doubtful. \nBangladesh may have the highest number of Leadership in Energy and Design (LEED)-certified RMG factories but there are smaller units operated in buildings unsuitable for the purpose. In this Mirpur case, the fire did not originate from the garment factory but if the unit had a safe emergency exit route, its workers would not have to die so helplessly. The fact that the episode of frequent fire tragedies has been a thing of the past courtesy of Alliance and Accord---a consortium of North American buyers and a platform of European and global buyer-led initiative respectively--- must be acknowledged by all, particularly by the owners of garment factories in Bangladesh. The two buying platforms' intervention involving retrofitting and other improvements in RMG factories has reduced the chances of fire incidents in the industry. But the smaller units often acting as sub-contractors do not comply with the rigorous safety measures enforced in the sector. There is a need for bringing such RMG units under the safety protocol. \nAs for the storing of inflammable chemicals, there are designated areas. These cannot be stored anywhere and everywhere. The Shialbari warehouse did it illegally and has ended up with tragic consequences. Such incidents are a symptom of underdevelopment. People carrying out businesses must as well be aware of the risks involved in their particular types. When they operate illegally and clandestinely, they are unlikely to be guided by the government agencies responsible for guiding operators of risky businesses. There are methods and rules for storing inflammable chemicals and any laxity can cause explosion. \nSo, the message from the Shialbari garment tragedy is that residential areas and business ventures must be separated from each other. There may be hidden dangers in innocuous enterprises operated in a residential area. The risky businesses of chemicals should not be operated from warehouses in areas other than the designated areas. Chemical warehouses are like ticking bombs without supervision and monitoring. This has been proved time and again but yet the initiative to relocate about 500 chemical warehouses from old Dhaka to Shyampur industrial area has failed to materialise. After each of the 2010 Nimtoli and Chawkbazar Churihatta infernos accounting for 124 and 71 lives, the urgency of relocation of chemical warehouses was underscored. But with time the urgency dissipates and may not draw further attention before another such tragedy strikes.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Mirpur fire: Illegal chemical depot, yet again, responsible",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/mirpur-fire-illegal-chemical-depot-yet-again-responsible-1760545168",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       October 16, 2025 00:00:00  \nAt a time when students' final exams are just two months away, classes in non-government secondary educational institutions across the country are being badly hampered as thousands of MPO-listed teachers of these intuitions are protesting in Dhaka demanding a hike in their pay and perks. The poor salary structure of teachers and the sheer disparity in salary and other benefits among those in government and non-government institutions as well as MPO-listed and non-MPO teachers has long been a matter of concern. This has not only caused simmering resentment within the teaching community but also triggered frequent protest movements by privately run schools, colleges and madrasha teachers. More often than not, while some teachers take to the streets demanding inclusion in the government's Monthly Pay Order (MPO) scheme, others call for an increase in the benefits already provided under it. \nThe latest wave of protests began on October 12, following the government's announcement on October 5, marked as Teachers' Day, of an increase in the monthly house rent allowance for MPO teachers from Tk 1,000 to Tk 1,500. The move has enraged teachers, who had been demanding a house rent allowance equivalent to 20 per cent of their basic salary. Many felt that the meagre increase, announced on a day meant to honour their profession, was in fact an insult for their noble procession, rather than dignifying it. \nSince then, thousands of teachers have been protesting in Dhaka, demanding a house rent allowance of 20 per cent of the basic salary, a medical allowance of Tk 1,500 per month, and a festival bonus of 75 per cent of the basic salary. Compared with government teachers, discrimination against MPO-listed teachers is telling. The monthly basic salary of an MPO-listed private assistant teacher is Tk 12,500, while a government teacher earns Tk 16,000. \nMoreover, government teachers receive a house rent allowance of 45-50 per cent of their basic salary, while MPO teachers receive just Tk 1,000. Festival bonuses also differ sharply: government teachers receive 100 per cent of their basic salary as festival bonus, whereas private teachers receive only 25 per cent. Medical allowances for government teachers are three times higher than those for MPO teachers.\nAnd then, government teachers receive both gratuity and a monthly pension upon retirement, while MPO-listed teachers are entitled to a one-time gratuity, which in fact is deducted from their own salaries. The saddest part of the story is that, to claim this benefit, teachers often have to wait four to five years and sometimes even bribe corrupt government officials at the education ministry. Meanwhile, the private institutions where they work throughout their entire career provide little to no retirement support, and often send them home empty-handed.\nAgainst this backdrop, the teachers' demands sound logical. However, the question is, if the government further increases its share in the payroll of privately run institutions, will teachers become more dedicated to classroom teaching, or will education in those institutions become less expensive? Therefore, the issue needs to be examined in all its ramifications.\nMPO-listed teachers are basically employed at private schools, madrasas or colleges but receive their basic salary directly from government through the MPO system. Reportedly, currently there are about four lakh MPO-listed teachers and staff. But as the number of privately-run educational institutions keeps mushrooming, so does the pressure mount on the government to bring more institutions under the MPO scheme. The MPO enlistment is supposed to be done based on merit following certain criteria such as the number of students, examinees and the pass rate, while the Non-Government Teachers' Registration and Certification Authority (NTRCA) oversees their registration and certification. However, allegations are there that enlistment is often done in a questionable manner under political patronage. The whole system created a vicious cycle of corruption, which needs to be fixed.\nNonetheless, one of the primary objectives of the MPO enlistment of educational institutions, as it appears, is to keep the cost of education low and affordable in private institutions, which serve the majority of students. In reality, however, the cost of education has been steadily rising due to the extensive privatisation of the sector.\nIn March 2024, the Campaign for Popular Education (CAMPE) published a research report titled \"School Education in Bangladesh: Sustainable Recovery in the Post-Pandemic Era.\" The report revealed that in the first six months of 2023, household education expenses increased by 25 per cent at the primary level and 51 per cent at the secondary level compared to the previous year (2022). The major factors behind this rise were coaching, private tutoring and guidebook purchases.\nAccording to the Ministry of Education's policy (formulated in 2012), no teacher is allowed to tutor students from their own institution. However, they are permitted to teach up to 10 students from other institutions during the day. In reality, though, this rule is rarely followed; instead, teachers often rent houses near their institutions and run coaching businesses openly. Parents also complain that teachers pay more attention to private tutoring than to proper classroom teaching. Allegations that some teachers give lower marks in exams to students who do not take private tutoring from them are nothing new. Besides, a section of teachers, in collusion with publishers and traders, compel students to buy note and guidebooks of particular publications, apparently in exchange for commission. \nWorse still, in some private institutions, school authorities run coaching businesses under the guise of 'special care' alongside regular classes. In one MPO-listed school in Dhaka, for instance, students are charged a monthly tuition fee of Tk 1,800, while an additional Tk 3,000 per student is collected each month in the name of special care. The private institutions are expected to be backed by some foundation or endowment, but in reality private education has become a big business in Bangladesh. But even after that why the teachers and staff employed there are not given a decent salary? So, while the government seeks to address the grievances of protesting teachers, it must also find solutions to the rampant commercialisation of education, the booming coaching business and corruption in the education sector.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Protesting teachers and some pertinent questions",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/protesting-teachers-and-some-pertinent-questions-1760545195",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 16, 2025 00:00:00  \n\nFood is the most essential requirement for the sustenance of human life. From the earliest cavemen to advanced civilizations, food and agriculture have played an inevitable role in keeping humans alive and healthy. Every year on October 16, the world comes together hand in hand to celebrate World Food Day as a powerful reminder of the critical role that food plays in our lives and to raise global awareness about a sustainable food future, with a focus on achieving zero hunger. The theme for World Food Day 2025 is \"Hand in Hand for Better Foods and a Better Future.\"\nBangladesh also observes the day in a befitting manner, including seminars, rallies, discussions, and the publication of special supplements in newspapers. The UN Food Waste Index Report 2024 revealed that each Bangladeshi household wastes an average of 82 kilograms of food annually, which is significantly higher than in many developed countries. In 2021, the figure was 65 kilograms, indicating a rapidly rising trend. However, the country remains food-deficit in items other than cereal grains, and millions of people continue to struggle with hunger and malnutrition.\nFood waste is a global tragedy, while millions endure hunger every day. Wasted food decomposes, releasing methane-a powerful greenhouse gas that contributes to climate change and pollutes land and water. In Bangladesh, food waste generally occurs due to post-harvest losses from poor storage and transportation management, as well as rising consumer-level waste from urbanization. Despite significant strides in food production, over 211 million tonnes of food (crops, vegetables, fruits) are wasted from production to post-harvest stages.\nThe issue of food waste has now emerged as a significant public concern, and Bangladesh must take proactive measures to address it. One contributing factor is the rising income of individuals, which fosters overspending and the misapplication of food, ultimately resulting in significant wastage. At the consumer level, public awareness can be fostered to highlight the impact of food waste and promote responsible practices, such as using leftovers wisely in new meals. At the farm level, modern cold chain facilities, enhanced storage management, and an upgraded transportation network must be urgently developed. These initiatives could constitute the core commitment of Bangladesh's World Food Day programme.\nMd. Refatul Hossain\nAdditional director (retd)\nDepartment of Agricultural Extension (DAE)\nFaridpur region\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Minimising food wastage-",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/minimising-food-wastage-1760545247",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 16, 2025 00:00:00  \n\nBanks are increasingly using modern technologies to ease customers' hardships. One such technology that has become popular in our country is the Cash Recycling Machine, or CRM. Through this machine, money can be deposited at booths 24/7. It is a very necessary and timely initiative. Customers no longer need to rush to deposit money during banking hours or stand in queues at the cash counter for small deposits.\nHowever, customers face daily and occasional difficulties when depositing money in CRMs. Most notes are often rejected by the machines. Even if these notes are accepted in shops, markets, or at bank counters, the CRM may return them. As a result, the exact amount of money cannot always be deposited. \nIt has also been observed that notes withdrawn from ATMs are sometimes rejected by CRMs, forcing customers to visit the bank branch and stand in line at the cash counter.\nFurthermore, recently issued new notes are often not accepted by CRMs. This increases customer frustration and discourages the use of these machines. Almost every bank's CRM faces similar issues. Therefore, bank authorities should take immediate steps to resolve the problems associated with depositing money in CRMs.\nFahim Habib\nShyamoli, Dhaka.\nfahimhabib227@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Depositors' suffering at CRMs",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/depositors-suffering-at-crms-1760545267",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-10-2025"
    }
]