[
    {
        "full_article": "India’s trade data for the first quarter of this financial year (Q1FY26) and for June 2025 are leading to some room for cheer but there is considerable concern as well. The Commerce Ministry’s monthly export-import data indicate that June’s merchandise trade saw the sharpest uptick in outbound shipments to the U.S. in 14 months, at a growth rate of 23.5% to $8.3 billion. This was likely aided by importers wishing to stock up before the July 9 “pause” in “reciprocal tariffs”, but now extended to August 1. While overall goods exports in June almost stayed flat at $35.14 billion ($35.16 billion, last June), likely on account of softer crude oil prices, Q1FY26 registered a marginal year on year growth of 1.92% at $112.17 billion. Despite the widening year on year merchandise trade deficit to $67.26 billion ($62.1 billion, Q1FY25), it is the impressive growth in services exports, by almost 11% to $98.13 billion ($88.46 billion, Q1FY25) that has aided in shrinking India’s overall trade deficit by 9.4% in Q1FY26. This mirrors years of India’s trade trajectory, where services have outperformed goods exports.It is important to note that refined petroleum products have traditionally constituted the largest chunk of India’s goods export (at about 15%). While many believe U.S. President Trump is unlikely to stay the course on his threat of a 100% “secondary tariffs” on countries buying Russian crude — to pressure Moscow to end its invasion of Ukraine — it hits an underbelly in India’s merchandise trade. India overtook China recently to become the largest importer of Russian crude, forming 36% of its oil imports. This has helped India leverage the cost arbitrage as western European nations maintain a ban on Russian crude imports. But Mr. Trump’s threat makes India’s need to diversify its fuel and energy imports more urgent, as it focuses on electrifying transport and ramping up renewables. It also highlights the need for India to diversify and grow merchandise trade, by further leveraging its sprawling, labour-intensive micro, small and medium enterprises, which constitutes almost half (46%) its goods exports. Exports in electronic goods (46.93%), tea (32.64%), meat, dairy and poultry (19.7%) and marine products (13.33%), saw steady growth this June when compared with last June. But overall goods exports excluding petroleum and gems and jewellery were almost flat in the same period. With a fortnight to go and three rounds of negotiations to scramble a ‘mini deal’ before the autumn deadline to reach a Bilateral Trade Agreement, the government has its task cut out to reach a favourable outcome. The stakes could not be higher as the U.S. has constituted the largest share of India’s overall exports for some years now, at nearly a fifth (17.7%) of total exports in the last fiscal alone. Published - July 17, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        imports\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        electronics\n                    \n                            /                      \n                        \n                        tea\n                    \n                            /                      \n                        \n                        meat\n                    \n                            /                      \n                        \n                        dairy\n                    \n                            /                      \n                        \n                        poultry\n                    \n                            /                      \n                        \n                        jewelry\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi",
        "headline_1": "​Some cheer: On India’s trade data",
        "headline_2": "India needs to diversify its energy sources to keep trade deficit low",
        "link": "https://www.thehindu.com/opinion/editorial/some-cheer-on-indias-trade-data/article69819351.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-07-2025"
    },
    {
        "full_article": "From Odisha to Karnataka, Bengal to Delhi, violence against women has seen an ominous rise over the past few months. What is even more appalling is that crimes are being committed in spaces such as school and college campuses or workplaces which are usually presumed to be safe havens. On July 14, a 20-year-old student of Fakir Mohan Autonomous College, Balasore, passed away after suffering 90% burns in an immolation bid. The B.Ed student had taken the extreme step outside the principal’s office after her repeated complaints of sexual harassment, against a senior teacher, went unheard. The accused teacher, Samir Sahu, and the principal, Dillip Ghosh, have been arrested, but a precious life would not have been lost had her grievances been redressed in time. She ran from pillar to post, taking it right up to the Chief Minister’s office, but no one paid attention to her grave complaint. In Bengal, even before a year has passed since a post-graduate student’s brutal killing at R.G. Kar Medical Hospital in 2024, a law college student was gang-raped on campus this June; in Mangaluru, two lecturers have been arrested for the alleged rape of a student; in Delhi, a nine-year-old girl’s rape and murder led to the Opposition crying foul over the collapse of law and order.Little seems to have changed on the ground after Nirbhaya’s rape and murder in Delhi in 2012. Stringent laws are in place, but to what effect? The Odisha student’s plight has put the spotlight on Internal Complaint Committees, mandatory under the Sexual Harassment of Women at Workplace Act, 2013. The Odisha government asked all colleges to form the committees within 24 hours, after the tragic death. Questions should be raised about the manner in which the system failed the student, and the absolute lack of accountability. The annual ‘Crime in India’ report by the National Crime Records Bureau (NCRB) for the year 2023 is yet to be released. Figures available for 2022 show that a total of 4,45,256 cases of ‘crimes against women’ were registered, showing an increase of 4% over 2021. While the majority of crimes against women were registered under ‘cruelty by husband or his relatives’ (31.4%), ‘assault on women with intent to outrage her modesty’ comprised 18.7% of all crimes, and ‘rape’ was pegged at 7.1%. It must be noted that many crimes go unreported as well. In this backdrop, conversations about sexual violence and gender are imperative, and must start early. The clamour for justice against a crime should not die down after a few days either, especially when protectors turn predators.\r Published - July 17, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        crime, law and justice\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        school\n                    \n                            /                      \n                        \n                        universities and colleges\n                    \n                            /                      \n                        \n                        Orissa\n                    \n                            /                      \n                        \n                        Karnataka\n                    \n                            /                      \n                        \n                        West Bengal\n                    \n                            /                      \n                        \n                        Delhi\n                    \n                            /                      \n                        \n                        Mangalore\n                    \n                            /                      \n                        \n                        sexual assault & rape",
        "headline_1": "Safe havens no more: On growing crime against women",
        "headline_2": "Sexual violence in workplaces and educational institutions is worrying",
        "link": "https://www.thehindu.com/opinion/editorial/safe-havens-no-more-on-growing-crime-against-women/article69819374.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-07-2025"
    },
    {
        "full_article": "London is going nuts over ‘nariyal’\nOxford Street isn’t yet redolent with aromas of simmering aviyal, albeit close enough. Goodbye, Coca-colonialism’s. Hello, coco-colonialism. London is being blitzed by coconut milk, water, oil, fresh/desiccated/compacted kernel. From tabloid, tube and bus, I’m bombarded with ads ordering ‘Convert to Coconut’. It isn’t baptism by fiery kari, but by cool tetrapack. Downing packaged nariyal paani is not a patch on slurping from the real thing, even if easier to wield. It’s already caught on among India’s sipping classes. Here, the little blue and white cartons are drink du jour not only coz Britain – indeed all exited-from Europe – is in the throes of a throat (and grass)-parching Indian summer. It’s a wider conquest.\nThe unrelenting ad’s baseline says, ‘It’s not a cult’. The udder distaste for milk from nature-intended sources led to such substitutes as soya, oat, almond, apple…Coconut conversion, however, goes beyond Veganism & Co. Its messaging cashes in on the greatest, latest massage: ‘gut health’. This is the silver bullet; sure-fire seduction; certain path to nirvana, physical, mental, psychological, yea, even social. As always, We knew it first. Remember the ancient eastern wisdom of a healthy morning evacuation? Here, ‘potty’ is ensured via pot of ‘Coconut Yog’. That’s yoghurt, not Guruji Iyengar. The ad promises ‘ALL YOUR PROBLEMS WILL BE SOLVED. If your problems are exclusively breakfast-based. Or dessert-based. Or curry-dollop-based. Or wanting-a-whole-coconut-in-each-pot-based.’\nChicken tikka masala and king-sized samosa, ok, but no self-respecting desi visitor will cure home-food yearning with ersatz Ernakulam. Better to favour real curry, Mercifully this is no longer the pineapple-riddled atrocity once dished up in icky-sticky Bangladeshi dives. As a mark of my own upgrading, the only Bangladeshi I encountered was expertly shaking signature cocktails in a Portobello tapas bar – and called himself ‘Jose’.\nStill, good to know that ‘coconut’ is now something more desirable than a WOG (Westernised Oriental Gentlemen) who was ‘brown outside, white inside’. Even more satisfying is palms metaphorically swaying amidst oaks, more evidence of East and West mixing, and nixing colonial Mr Kipling.\n***\nAlec Smart said: “Tesla test-drives India.’\n\n",
        "headline_1": "Coco-colonialism",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/coco-colonialism/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-07-2025"
    },
    {
        "full_article": "Pak-origin UAVs must be countered through huge tech investments across the board\nIn what should worry the security establishment, there’s been an uptick in Pakistani smugglers pushing drones laden with drugs, arms and ammunition deeper into India. After a brief lull during Operation Sindoor, drone-borne smuggling has resumed with greater precision, reportedly using Chinese drones that can fly higher to evade detection. This is hardly petty smuggling but part of a well-planned Pakistani ICAD (illegal, coercive, aggressive and deceptive) strategy to undermine India’s security. The goal is to get drugs, guns and money to criminal elements on this side of the border.\nIt’s part of Pakistan’s old doctrine of bleeding India with a thousand cuts. Consider this: last Sept, a police team in Punjab discovered a haul of Nato-grade guns – most likely originating in Afghanistan – from smugglers linked to Pakistani drone drops. With such weapons being also found with terrorists in Kashmir, the modus operandi is clear. Drone drops from Pakistan started after the nullification of Article 370 in 2019. To counter this BSF adopted anti-drone systems like Dronaam that neutralise Pak-origin UAVs using laser. Even specialised anti-drone teams have been set up. But the versatility of drone tech means that it is constantly evolving.\nDrones can be modified and adapted to evade detection, they can change modus operandi and alter application. The Ukraine war exemplifies this. Drone tech is changing every fortnight. This also means counter-drone tech has to constantly innovate in real time. That in turn means creating a large pool of expertise throughout the security establishment and linking this with R&D institutes. Drones are rapidly transforming from FPV to fibre optic to the oncoming AI versions. The only way to stay ahead of the curve is to heavily invest in drone tech in both industry and academia. India must create its own drone shield.\n\n",
        "headline_1": "Indian drone shield",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/indian-drone-shield/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-07-2025"
    },
    {
        "full_article": "Sexual crimes on campus hurt women’s aspirations in singular ways, but politics could be least bothered\nWhy did a woman college student in Balasore, Odisha set herself on fire? We will never know the entirety of the answer. But there’s plenty we do know and it’s all dismaying. She had appraised her college internal complaints committee about a professor who had been asking her for ‘favours’, and there was pressure to withdraw the complaint. She had also gone to police but no FIR had been registered. She had posted on X that if she didn’t get justice she would commit suicide. Finally, it took 4.5 hours after she poured petrol on herself to get her to AIIMS Bhubaneswar, and that proved too late. This seems the most pitiful case of a death foretold. Except such a label belies the culpability of every person and every system that failed to both protect the 20-year-old and give her a rightful hearing.\nThere are mandated POSH committees, strong laws against sexual harassment, polity-wide speechifying for safe campuses. Yet, when women students complain, all too often what they actually meet is institutional stonewalling. Horrifying cases continue to wound in silos. In Kolkata, even as the law student rape case makes its way through court, another one is being reported from a premier B-school. But shouldn’t a single such case anywhere in the country alert every college and university to audit its safety and complaint apparatus? Odisha of course had been served a warning by a woman’s suicide at KIIT just this Feb. Her complaints of harassment and blackmail seemed to have been shrugged off as carelessly as in the Balasore case.\nThe immolated student’s father says he doesn’t want her to be ‘used’ for political gain. His plea is getting as poor a hearing as her complaint did. Fact is that if govts and political parties responded with sincerity to such horrors, they would speak and act unitedly. Tragically, it is other agendas that go on the frontfoot. This explains why BJP won’t be sustainedly outraging the Balasore case like it does the Kolkata ones. Or why TMC doesn’t take issue with sexual crimes in Bengal in its usual decibels. It’s discouraging enough that all-India conviction rate for rape cases that go on trial is only 2.6%. But muddying campus crimes has particular knock-on effects. For women to be attacked and brushed aside in the very space that was supposed to empower them, is a particularly noxious deterrent to their dreams.\n\n",
        "headline_1": "UnSafe Spaces",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/unsafe-spaces/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-07-2025"
    },
    {
        "full_article": "Bugbear of the brain drain has resurfaced, but its causes need questioning \n A social media post has again raised the bogey of the brain drain, the outflow of the highly educated from our state-subsidised IITs and IIMs to foreign shores, there to enrich other countries at the expense of the Indian taxpayer.\nThe post highlights what amounts to asset-stripping of the Indian economy to benefit the adoptive countries of the highly qualified migrants.\nThe reason the writer adduces for this post-Independence ‘Quit India’ movement is monetary gain: The paycheque of an entry-level technocrat in say, US, is some 15 times that of a counterpart in India.\nThe post decries this outward tide as putting pecuniary gain over patriotism, placing personal advancement over the national interest.\nThe writer likens this transfer of value to a form of neo-colonialism in which the colonising powers, the so-called First World, plunder developing countries like India not of material resources, as former colonists did, but of the incalculably more valuable fund of intellectual capital.\nHowever, while former colonists took their loot by force of arms, today’s expropriators do so with the more than willing consent of migrants. Is the keen edge of greed the only, or even the major, motivation that induces the migrant to cut loose the main-stay anchor of home and chance the terra incognita of foreign shores?\nCould there be, apart from the pull factor of financial benefit, also a push impetus that impels those who quit India?\nThe greater part of the Great Indian Diaspora is composed of low-skilled labour drawn by the prospect of monetary gain.  But the highly-educated, who turn their backs on their home country, might have other reasons for doing so.\nCould these include a desperation to forsake a climate in which, increasingly, the innovative and the unconventional are stifled by sectarian ideology, and a once shared inclusive identity is fragmented with exclusionary fissures of creed, caste and language?\nLove for one’s country is laudable, as is the reciprocal love the country must bear for all those who call it home, and not just for those who constitute a brute majority.\n\n",
        "headline_1": "Quit India",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/quit-india/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 17, 2025 00:00:00  \nThe illogical ban on export of jute and jute goods from Bangladesh to India through land ports has dealt a severe blow not only to the jute industry but also to the cultivation of this cash crop. Only one option has been left open for millers and exporters of finished products and raw jute in Bangladesh and that alternative proves highly disincentive to jute trade. As high as $100 additional freight charge on each tonnne of jute or jute products has to be borne by exporters if the alternative sea route to Kolkata via Nhava Sheva Port in Maharashtra is used. The atrociously long detour is likely to hurt not only jute trade between the two neighbours but also make the products costlier in India.\nIt certainly is a political decision by the Narendra Modi government that looks for killing two birds with one stone. The central government of India and the state government of Mamata Bandopadhya are at loggerheads on several issues. Jute trade between West Bengal and Bangladesh thrived because of modernisation of jute mills near Kolkata with demand for raw and semi-processed jute from Bangladesh. This explains the trade dispute that has been deliberately initiated by the receiving country following the fall of Sheikh Hasina's regime. This particular move and the drive against Bangla-speaking nationals, targeting extradition of some, have backfired politically with Mamata's popularity now soaring and negating any possibility of BJP breakthrough in West Bengal. The economic costs will be heavy for both West Bengal and Bangladesh. There is no chance the state government can bypass the central government in striking any trade deal.\nSo, how can Bangladesh overcome the crisis? Jute millers and exporters are clamouring for compensation or restoration of the cash incentives at the 60 per cent rate allowed before 2024 and also waiver of export duties. Well, such concessionary measures can at best be an emergency or short-term solution in a competitive market but the country now needs to have a long view of the issue. Bangladesh cannot save its jute industry or the crop itself as an export good depending permanently on another country. In a way, it is reaping the fruits of the seeds it sowed. Or, the local industry of the once golden fibre would not have come to this moribund state. Jute industry in Kolkata also disintegrated at one point but a political decision to revive it worked wonder.\nBangladesh should also think of developing a sustainable modern industrial base for jute. The industry was systematically destroyed and wavering on the part of successive governments was responsible for a decline of the industry. At a time when the entire world is raising voice against polythene and plastic, this natural fibre stands a sure chance of making a turnaround. But knowing how to use it as a most-sought-after product around the world is of paramount importance. The biodegradable poly bag called 'sonali bag' invented by a Bangladeshi scientist Dr. Mubarak Ahmad Khan could lead the way but for the political indecision. Still time is not out. Government support in developing factories and mills fashioned on the prototype the scientist developed may provide an answer to its limited capacity as well as problems facing export of jute and jute goods. There is a need for developing mills of mass production in order to bring down the price of sonali bags. Thus the golden days of the golden fibre can stage a comeback with no need for crying hoarse over imposition of anti-dumping duty and ban on use of land port by the big neighbour.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Jute: Turning crisis  into opportunity",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/jute-turning-crisis-into-opportunity-1752679516",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul KabirTuhin   |  \n       July 17, 2025 00:00:00  \n\nIn a landmark step toward central bank independence, the interim government has reportedly drafted the 'Bangladesh Bank Order, 2025', aiming to elevate the central bank to the status of a constitutional body. Currently, the central bank operates as a 'body corporate' under the Bangladesh Bank Order, 1972, and is meant to be autonomous. But political interference, as was evident during the Awami League regime, seriously undermined its autonomy, leading to a cascading effect on the broader economy, from hyperinflation to the near collapse of the banking sector. As a result, there have been discussions and recommendations, including from the International Monetary Fund (IMF), to amend the Bangladesh Bank order to grant the central bank more autonomy, particularly concerning monetary policy and governance of the financial sector.\nThe crucial role of an independent central bank in achieving price stability is widely acknowledged. As economist John Maynard Keynes famously remarked, price stability should be the foremost goal of monetary policy, a goal unattainable without central bank independence. Keynes believed that a central bank, free from political influence, is better positioned to focus on maintaining stable prices, which is fundamental for a healthy economy. Empirical studies support this view, showing that countries with more autonomous central banks tend to manage inflation more successfully. Citing the experiences of several emerging markets in recent decades, experts argue that central bank independence is the most effective monetary policy governance model to date.\nUnder such a framework, price stability is achieved by separating monetary policy decisions from the grip of political influence. The separation helps counteract political business cycles. These cycles occur when governments pursue populist and expansionary policies in a bid to ensure their re-elections. While such policies, like increased public spending or easy credit, might initially boost economic activity and garner popular support, it invariably leads to inflationary pressures in the long run. An independent central bank can act as a bulwark against such short-sighted political maneuvering, focusing instead on long-term economic stability.\nIn the context of Bangladesh, it is not difficult to see the benefits of adopting independent central bank model. In fact, the lack of price stability and the soaring of inflation into the double digits domain under the previous Hasina government serve as a stark example of the cost of printing money to manage outsize fiscal spending. Instead of challenging the regime's pernicious policies, the then subservient BB governors did everything to pander to the whims of the government. From artificially managing the exchange rate and enforcing 'nine-six' caps on bank lending rates, to turning a blind eye-if not actively colluding-to the plundering of state-owned and several private commercial banks, and increasing money supply by printing new money, the policy failures of the central bank during the AL regime were beyond acceptable limits. Had the central bank been truly autonomous, much of the inflationary pressure and the banking sector's distress from rising non-performing loans (NPLs) could be avoided.\nAgainst this backdrop, the proposal to grant Bangladesh Bank constitutional status is both timely and essential. However, simply recognising the BB as a constitutional body won't suffice as numerous existing constitutional bodies - such as the Public Service Commission, Election Commission, and even the judiciary - have not been immune to brazen political interference.\nThe draft BB order proposes, among other provisions, the formation of a search committee tasked with preparing a shortlist of candidates for the positions of governor and deputy governors. Based on the committee's recommendations, the Prime Minister would nominate candidates. But the appointment as well as removal of the Governor and Deputy Governors will require parliamentary approval. And the governor will be accountable to parliament.\nHowever, in Bangladesh's political culture, monetary policy issues are rarely debated in Parliament. Even under the existing BB order, the Governor is technically accountable to the parliamentary standing committee. Yet, over the past decades, not a single Governor was seen being questioned by Parliament, not even following the unprecedented cyber heist when hackers stole close to 100 million dollars from the reserves. So, legislation alone is not enough, what matters is strong political will for its genuine enforcement.\nTo shield Bangladesh Bank from political interference, experts underscore the importance of establishing clear and stringent criteria for the appointment of the Governor and Deputy Governors. They argue that the Prime Minister should not have unchecked authority to appoint candidates at will. Instead, the formation of a search committee should be clearly defined and it should be empowered to recommend individuals who are not only technically competent and experienced but also independent-minded and capable of resisting political pressure. Legal provisions are essential, but their effectiveness ultimately depends on the mindset and integrity of those in power. Even if the law guarantees central bank autonomy, no institution can operate independently unless its leadership genuinely upholds that spirit.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why central bank  independence matters",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-central-bank-independence-matters-1752679580",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 17, 2025 00:00:00  \n\nArtificial Intelligence (AI) has quickly evolved from science fiction to a useful tool in our daily life. AI is spearheading a technology transformation that presents both great potential and significant concerns, ranging from smartphones and smart homes to healthcare and transportation.\nEfficiency gains are among AI's most important advantages. With the use of AI-powered technologies, tasks that formerly took hours to perform may now be finished in minutes. While AI in navigation applications optimises travel, virtual assistants like Siri and Alexa simplify daily tasks. AI in healthcare facilitates better patient care, predictive health monitoring, and quicker and more accurate diagnosis. It provides instructors with smart tools and aids in personalising learning in the classroom.\nAI is also essential to business, since it streamlines processes through predictive analytics and improves customer service through chatbots. It supports agriculture, finance, scientific research and other fields. But these developments also carry some significant concerns. Automation is threatening many conventional jobs, particularly in manufacturing and administrative labour. \nBiases in training data can also be reflected in AI systems, which can result in unjust employment and law enforcement judgments. The fact that AI frequently depends on the gathering and analysis of vast volumes of personal data, which is also raising privacy concerns.\nAs AI develops further, humanity must carefully manage these threats. Establishing moral guidelines, open systems, and strong laws will be necessary to guarantee AI benefits humans while reducing any possible risks. In a word, AI has great potential, but it needs to be handled carefully.\nMD Mobarock Hossain Siam\nStudent, Department of Marketing\nNorth South University\nmobarock.siam@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Rise of AI: opportunities and risks",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/rise-of-ai-opportunities-and-risks-1752679607",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 17, 2025 00:00:00  \n\nThe time extension granted for the implementation of the new US tariff on Bangladeshi products expired on 9 July 2025. Immediately after the deadline, President Trump reinstated a revised 35 percent duty on Bangladeshi imports, set to take effect from 1 August 2025.\nThis move has already begun to seriously impact Bangladesh's ready-made garments (RMG) industry. A substantial number of export orders from US companies and their subsidiaries are being cancelled, with buyers stating that they will resume orders only after the matter is resolved and the duty rate finalised. Bangladesh is currently engaged in negotiations with the US administration, but two rounds of talks have so far yielded no tangible results. A third round is expected to be held soon.\nThe consequences of such a steep duty are potentially devastating. The RMG sector, heavily dependent on the US market, stands to lose a significant amount of foreign exchange. Should the situation remain unresolved, many factories may be forced to close down, which would deal a heavy blow to our economy and employment.\nI urge the government to treat this issue with the utmost seriousness and to act prudently. Failure to secure a favourable outcome would expose weaknesses in our foreign trade negotiation capacity. The public has high expectations from the current government, which operates with expert advisers and seasoned professionals. It is essential that we identify the root causes behind the imposition of such a punitive duty and actively consider engaging professional trade lobbyists within the Trump administration to advocate for Bangladesh's interests.\nWithout a well-coordinated, strategic approach, all current efforts may ultimately prove fruitless.\n\nAbu Taher\nSenior Deputy Director (P & P)\nKawran Bazar, Dhaka\nabutaher011@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Need for prudent trade negotiation with US",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/need-for-prudent-trade-negotiation-with-us-1752679646",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-07-2025"
    }
]