[
    {
        "full_article": "Israel’s unprovoked aggression against Iran has not only plunged West Asia into its gravest regional crisis since the 1973 Arab-Israeli war but also pushed the Jewish nation into an unprecedented security calamity. If Prime Minister Benjamin Netanyahu expected the June 13 attack on Iran, hitting its nuclear facilities and assassinating its top generals and nuclear scientists, to cripple Tehran — like how Israel destroyed the Egyptian air force on June 5, 1967 during the Six-Day War — he appears to have made a mistake. Iran, in a swift and forceful response, rained ballistic missiles on Israeli cities. Until Monday morning, it had fired over 370 missiles, hitting an oil refinery in Haifa, a top research institute in Rehovot near Tel Aviv and even residential areas. At least 24 Israelis have been killed and over 500 wounded. While Israel has established air supremacy in Iran, it has not managed to destroy Iran’s nuclear programme, which is dispersed and buried across the country. Israel keeps targeting Iran’s military and intelligence leadership, with the aim of weakening the government. On Sunday, Mr. Netanyahu said regime change in Iran could be one of the outcomes of Israel’s attack. But every time Israel hits Iran, Tehran fires dozens of ballistic missiles back. While Israel is trying to take escalation dominance, Iran is trying to establish deterrence through offence. The result is an escalation spiral.\rMr. Netanyahu should have carefully considered the consequences and avoided launching this reckless, illegal war. The Israeli attack came just days before the United States and Iran were to hold the sixth round of nuclear talks. The war has practically killed the possibility of a diplomatic solution to the nuclear crisis. This also raises questions about Israel’s endgame. If Israel is not able to completely dismantle Iran’s nuclear programme, it may, as Mr. Netanyahu has suggested, push for a state collapse or regime change in Tehran. Nobody knows what comes next. U.S. President Donald Trump has said that he is still open to a deal with Iran. But Mr. Trump wants Tehran to completely abandon its nuclear enrichment programme, which Iranian leaders are not ready to do — not yet. This deadlock only makes the conflict more dangerous. If the war drags on, the risk of U.S. involvement increases. And If Iran retaliates by bombing American bases in the Persian Gulf, shutting down the Strait of Hormuz or targeting tankers in the Gulf of Oman, it could trigger a security and economic catastrophe. This is another reason why a ceasefire between Iran and Israel is urgently needed. Global powers, particularly the U.S., Israel’s chief patron, and Russia, an Iranian ally, must play a more proactive role in mediation and peacemaking. If Mr. Trump is really a man of peace, as he claims to be, this is his moment to take the lead in restoring order in West Asia. Published - June 17, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Israel\n                    \n                            /                      \n                        \n                        Iran\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        Egypt\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        missile systems\n                    \n                            /                      \n                        \n                        nuclear policy\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        peace negotiations",
        "headline_1": "Escalation spiral: on the Israel-Iran conflict",
        "headline_2": "Global powers must persuade Israel to end its reckless war",
        "link": "https://www.thehindu.com/opinion/editorial/escalation-spiral-on-the-israel-iran-conflict/article69701173.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-06-2025"
    },
    {
        "full_article": "It was a long wait that culminated in delight. Until Saturday’s high at Lord’s, South Africa was often resigned to playing second fiddle in the big cricketing contests. The Proteas always had strong units and some great players, but a stumble in the climactic stages of ICC events became the norm. Finally, when Temba Bavuma’s men prevailed over defending champion Australia in the World Test Championship’s summit clash in London, many ghosts were laid to rest. South Africa’s previous ICC silverware was the title in the Wills International Cup at Dhaka in 1998. That tournament became the precursor to the Champions Trophy and even as this particular event grew, South Africa regressed with comical run-outs, dropped catches and miscalculation of rain-rules often becoming steep hurdles. To concede a first innings lead and then to chase 282 in a grim fourth innings pursuit was never easy, but a dogged Bavuma and centurion Aiden Markram ensured that the early strikes of spearhead Kagiso Rabada were never wasted. The trio performed admirably and it was also a reflection of the diverse ethnic groups that constitute South Africa, often called the Rainbow Nation. This fact and the need for unity was reiterated through Bavuma’s impassioned post-match speech. The skipper truly led from the front.Cricket needed this result as whispers of the ‘Big Three’ of India, Australia and England, calling the shots and elbowing out other opposition in the overall scheduling have been doing the rounds. Besides applying salve to a country searching for cricketing glory, the South African triumph also revealed that other teams can acquire the champions’ halo. To get past Pat Cummins and his men is always tough but Bavuma and his troops held firm in an engrossing Test. Australia has a potent attack that never allows batters to settle, and to counter this and emerge on top is a tribute to an outfit that was acutely conscious about past failures. Even last year, Markram’s men slipped in the ICC T20 World Cup final against India. From being tagged as chokers and to then become the number one Test squad is a stupendous achievement. South Africa never had it easy in cricket as its previous apartheid policy rightly left it isolated from sport. The comeback was gradual from the 1990s and then the match-fixing crisis that consumed Hansie Cronje, was a mighty blow. To put all these setbacks and losses behind them needed a special effort and it was this that Bavuma and his men provided at cricket’s spiritual home.\r Published - June 17, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        cricket\n                    \n                            /                      \n                        \n                        South Africa\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        champions-trophy\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Test  cricket\n                    \n                            /                      \n                        \n                        ICC Test Championship",
        "headline_1": "​Deserving winners: on South Africa’s win at Lord’s",
        "headline_2": "South Africa reached the summit in Tests after a history of failures",
        "link": "https://www.thehindu.com/opinion/editorial/deserving-winners-on-south-africas-win-at-lords/article69701033.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-06-2025"
    },
    {
        "full_article": "What gadgets of doomed aircraft never record\nAs the Air India flight taxied on the Ahmedabad runway, the jet would have gargled fuel to clear its throat, reminders to keep the seat belt fastened would have sounded like familiar chants in the pressurised cabin, a few passengers would have whispered their customary travel prayers, some would have argued that Heathrow offers better connectivity to central London than Gatwick, somebody would have recalled their last flight to Heathrow from Delhi and wondered if the Thames would appear on the Gatwick route.\nThe etiquette-conscious would have deliberated on the correct response to ‘how do you do?’ in UK, some would have joked that Brits wouldn’t mind if people said ‘how’re ya doin’?’ to the King as long as they had waited British-ly in a queue to address the monarch, some laughter would have strummed seat belts when those averse to culinary adventures relished with desi glee the prospect of ordering cholay-bhature in the former Raj HQ.\nA first-time visitor to London would have shown explorational savvy and proclaimed that London Bridge has ‘cliché’ splashed all over it like betel-leaf stains and Charles Dickens Museum is the place for sophisticates, their seat neighbour would have commented that Delhi taxiwallahs’ directional acumen is just as legendary as London’s Black Cab drivers’, some passengers would have started a battle of wills with time itself to hug their loved ones sooner than determined by the mundane arrival schedule, a few would have gone back in time to worry about not switching off all their home lights.\nAnd then as the jet engine’s gargling began smoothing into the war cry of human ingenuity against gravity, even some frequent fliers would have looked out of their windows to marvel at the audacity of a toothpaste-tube-shaped machine to rescue hundreds of people at once from the solidity of routines, passengers would likely not have known that the plane was losing altitude, would probably not have realised that the pilots were overriding instinctual fear with professional focus, the pilots would have been using the muscle of their conscience to strengthen their trained hands to do everything they could to save the passengers in their care and save the metrics that make us all human: love, ambition, excitement, and the faith in ourselves to plan for the next day. Black boxes don’t record those metrics.\n\n",
        "headline_1": "Silent Black Box",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/cache-of-cultures/silent-black-box/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-06-2025"
    },
    {
        "full_article": "Self-enumeration may be among the toughest challenges in this huge exercise\nFinally, seven years delayed, census 2027 is notified – India’s first digital census. The registrar general’s work resumes in earnest. About 33cr households and 136cr people will be counted by over 30L enumerators in about 24L enumeration blocks, each comprising around 800 people, per media reports. Household listing – the first of a two-part exercise – can be expected by about Sept 2026, about six months before the population count, if traditional time frames are observed. Much of the discussion on how crucial this exercise is has revolved around political events to follow, delimitation and women’s reservation. But before we reach those destinations, it’s changes in the journey itself, including additional questions on caste, that make this census a whole new ballgame – if all goes as announced so far. Not least among these changes are the amendments to census rules, 1990, notified on March 11, 2022.\nThe amendment said that information would be collected “in paper form or in an electronic form and can be canvassed in the said modes including through self-enumeration.” Electronic form is defined in Information Technology Act, 2000. And “self-enumeration means filling-up, completion and submission of census schedule by respondents themselves.” Both of these can be a huge challenge. While yesterday’s notification has no details, it is expected data collection will be digital, enumerators will use tablets. Self-enumeration will be via apps. It’s all hypothetical now. Some will be junked, some fine-tuned and tweaked. Glitches will be fixed after multiple pilots. What we know is that perhaps the logistics may be under control – 2021 census was to be in hybrid mode. Coding on caste and its enumeration won’t be a problem once political thinking is clear on what to ask.\nIt is self-enumeration, again hypothetical at the moment, that’s causing concern. For one, self-enumeration can be proposed only in metros. But even here populations are barely digitally literate. We hate filling up even physical forms, let alone digital. Household register notified back in 2020 had 30-plus questions. So, response rate can be dodgy. Two, how can it be ensured that everyone house-listed is also enumerated? Three, we can kiss goodbye to anonymity. Four, there will be information missing, incomplete or incorrect filing of data. There’s a reason why trained enumerators do the job. Collection of census information demands a level of integrity that simply cannot be left to a people generally ill at ease with both digital platforms and govt exercises.\n\n",
        "headline_1": "The I in census",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-i-in-census/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-06-2025"
    },
    {
        "full_article": "Most countries today prefer keeping options open rather than locking in ties. That may help stave off WWIII\nModi’s visit to Cyprus – the first by an Indian PM in 23 years – is being read as a deft signal to Türkiye following the latter’s support to Pakistan during Operation Sindoor. New Delhi was clearly not happy with Ankara taking Islamabad’s side. Cyprus, which has a history with Türkiye given the latter’s invasion of the country in 1974 and effective partitioning of northern Cyprus, strongly supports India’s position. So this appears to be a classic case of “my enemy’s enemy is my friend”. Except that ties between India and Türkiye aren’t totally belligerent, and routine relations continue on several fronts.\nIn a similar vein, in the latest round of Iran-Israel conflict several countries, including India, aren’t taking a clear side. They would ideally like to preserve ties with both parties. The same can be said of the Ukraine-Russia war with many countries looking to have balanced relations with both Kyiv and Moscow after the hostilities end. The 21st century foreign policy dictum, therefore, is more closely aligned with the saying “there are no permanent friends and enemies in geopolitics”. Be it US’s approach to Afghanistan after the return of Taliban, Vietnam’s ties with US today that have buried the acrimony of the Vietnam War, or the improving ties between South Korea & Japan, there’s a sense that our increasingly interconnected world provides opportunities that can overcome differences.\nDoes this approach make the world safer? Well, going by the number of conflicts currently raging or threatening to break out (from Ukraine to Taiwan) it may appear not. However, giving primacy to geopolitical flexibility puts a check on Cold War-type bloc scenarios from taking hold and furthers the case of multipolarity. That in turn could at least help stave off World War III, if not prevent regional conflicts. Hence, India’s multialignment strategy appears to be surfing the right wave. \n\n",
        "headline_1": "Friends with benefits",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/friends-with-benefits-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-06-2025"
    },
    {
        "full_article": "AI 171 crash should make airline listen much more to employees’ concerns over operational issues. The group has the ability to restore AI’s reputation\nOct 8, 2021 | ‘Tatas will have the opportunity of regaining the image and reputation it (Air India) enjoyed in earlier years. JRD Tata would have been overjoyed…’ – Ratan Tata’s tweet on winning the bid to acquire AI along with AI Express.\nJune 13, 2025 | ‘In shock and mourning…for so many deaths to occur at once is incomprehensible…one of the darkest days in Tata Group’s history’. Tata Sons chairman N Chandrasekaran said a day after the AI 171 crash.\n\nAir India’s first wide-body crash of AI 171 since Jan 1978, when it lost Boeing 747 ‘Emperor Ashoka’ in Mumbai, is the biggest setback to the airline’s multi-billion-dollar turnaround programme that the Tatas, both founder and new owner, embarked upon after taking over the PSU about three and a half years ago. An AI jumbo jet ‘Emperor Kanishka’ had exploded mid-air in June 1985 over the Atlantic Ocean but that was an act of terror.\nRead full story on TOI+\n\n",
        "headline_1": "The dream’s not buried but Tatas must wake up",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-dreams-not-buried-but-tatas-must-wake-up/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-06-2025"
    },
    {
        "full_article": "We are alarmed by the simultaneous resurgence of COVID and dengue at a time when the healthcare system and the government arms responsible for managing them remain quite unprepared. Of the two health threats, the rise in coronavirus infections—returning after a gap of several years—is particularly concerning, given how far behind public hospitals are in resuming basic testing services. If this situation persists, in an environment proving to be conducive to the spread of these infectious diseases, there could be simultaneous outbreaks, taking things out of control.\nCurrently, as per a report by this daily, over 90 percent of COVID tests are being conducted by private hospitals. In the first 15 days of June, tests were carried out at 20 hospitals, of which only three were government-run. This is because most government hospitals are still unable to conduct testing, with many requiring recalibration of long-unused equipment or facing a shortage of trained technicians in part due to the expiry of a major COVID support project. Although some government hospitals have received test kits and announced plans to resume testing, many have yet to begin. Meanwhile, 11 medical colleges outside Dhaka were instructed to activate their RT-PCR facilities. Given that the extended Eid holiday has only just concluded, some delay in resuming or upgrading services is understandable, but we urge swift progress.\nBetween June 5—when the first COVID death was recorded after the gap—and June 15, there have been four coronavirus-related deaths. As data on infections shows, the virus is quietly regaining ground, and with the Eid holiday now over, and increasing risks of community transmission in public spaces drawing large footfall, there could be a significant uptick if proper measures are not taken. Reports of surging infections caused partly by new coronavirus sub-variants in neighbouring countries, including India, also underscore the risk.\nAgainst this backdrop, the parallel spike in dengue cases comes as a double blow, threatening to overwhelm hospitals and healthcare workers just as they begin to brace for a potential new wave of Covid-19 infections. A per a report by Prothom Alo, from March to May, the number of dengue patients doubled each month. In the first half of June, 1,643 new cases were reported, which is nearly the same as May's total. The dengue risk is particularly grave outside Dhaka where current weather patterns—with excessive rain and humidity—as well as poor mosquito control measures in the absence of elected representatives have created an ideal breeding ground for Aedes mosquitoes. The simultaneous resurgence of coronavirus and dengue, if left unchecked, is bound to have a debilitating effect.\nWe, therefore, urge the health authorities to expedite their preparations. Without proper interventions—such as mass awareness campaigns, improved testing and treatment facilities, and aggressive mosquito control drives—we risk repeating the mistakes that made previous outbreaks so deadly. Raising awareness is also crucial as most people still seem unaware of the health risks and protocols.\n",
        "headline_1": "Brace for a COVID-dengue double blow",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/brace-covid-dengue-double-blow-3918511",
        "news_paper_name": "The Daily Star",
        "publish_date": "17-06-2025"
    },
    {
        "full_article": "Israel's latest strike on Iran had nothing to do with dismantling the Iranian (civilian) nuclear programme. Despite Prime Minister Benjamin Netanyahu's assertion that the timing for this Israel-Iran conflict was \"fixed back in November 2024,\" the real zero hour was designated only to undercut possible diplomatic framework that could have legitimised Iran's nuclear development under international, verifiable supervision.\nThis war is not a pre-emptive blow against Iran —it is a pre-emptive strike against diplomacy itself. The Trump administration made a grave error by keeping Israeli officials closely informed of the sensitive progress in the secret negotiations. This privileged access allowed Israel to strategically time its military strike to sabotage diplomatic efforts at a critical juncture, undermining further progress just as it was beginning to take shape, and before any agreement could fully mature.\nMultiple independent leaks had pointed to progress in the Oman-brokered negotiation between the US and Iran, inclusive of intrusive International Atomic Energy Agency (IAEA) inspections, capped enrichment, and restart of oil exports under strict monitoring. An agreement of that sort would have undercut Israel's decades-long doctrine that only isolation and coercion can keep Iran \"in its box.\"\nRather than accepting a rules-based diplomatic framework that Netanyahu could not control or veto, he chose to hinder the potential agreement—with F-35s and cruise missiles.\nThis war is also part of Israel's long-standing obsession with maintaining its monopoly on nuclear technology in the Middle East. Far from a purely defensive measure, Israel's broader strategy has consistently aimed at preventing any regional power from acquiring not only the infrastructure required to develop nuclear capabilities but even the scientific expertise and human capital necessary to pursue such knowledge.\nHours after the first explosions, US officials solemnly declared, \"America did not take part.\" But the denial was tactical, not principled. By remaining officially aloof, the Trump White House hoped to keep a seat at any revived negotiating table while still wielding the Israeli strike as leverage. Donald Trump's own split-screen rhetoric—calling the raid \"excellent,\" threatening Iran with \"more to come,\" yet urging Tehran to \"make a deal\"—spelled out the gambit: let Israel be the cudgel while the US courts concessions.\nOn the other hand, and in response to US Secretary of State Marco Rubio's claim that the US is \"not involved in strikes against Iran,\" Israel declared that every phase of the attack had been \"closely coordinated\" with the Pentagon and that that the US provided \"exquisite intelligence\" to attack Iran.\n\nUnlike the sporadic and largely asymmetrical conflicts with non-state actors like the Resistance in Lebanon and occupied Gaza, this confrontation introduces a level of state-to-state warfare that challenges Israel's long-held military superiority and assumptions of deterrence. What has unfolded so far with the Iranian retaliation is a harbinger of a more symmetrical and likely prolonged confrontation—one in which Israel's own centres of power may be within range, and where the frontlines are no longer confined to Gaza, the West Bank, or southern Lebanon, but centred into the very core of Tel Aviv.\nThe yawning gap between the two narratives on the ongoing Israel-Iran conflict served both capitals. In Washington, it allowed officials to reassure anxious allies that the US was not actively escalating another Middle East war. In Tel Aviv, Netanyahu exploited the ambiguity to provoke Iran into retaliating against US forces—potentially drawing Washington deeper into Israel's war. At the same time, he sent a calculated message to domestic hawks and regional adversaries: that Israel still enjoys unwavering American backing.\nNetanyahu's sinister calculus was familiar and transparent from Israel's book to drag the US into its endless wars: derail the diplomatic channel, then dare Washington to pick up the pieces while Israel enjoys another round of strategic impunity.\nEven in a region where Israel uses starvation as a weapon of war and genocide in Gaza, its choice to strike residential neighbourhoods—ostensibly targeting senior officers, civilian leaders, and nuclear scientists—crosses a perilous line. The laws of armed conflict draw a bright red distinction between combatants and civilians; by erasing it, Israel has handed Iran moral and legal grounds to retaliate in kind. If Tehran targets the private homes of Israeli leaders and commanders, Tel Aviv cannot plausibly cry victim after setting that precedent.\nThe first wave of Iranian retaliation—targeting the Israeli defence ministry headquarters in Tel Aviv, among other sites—marks the beginning of a new kind of war, one unlike anything Israelis have faced in previous conflicts. For the first time, a state with advanced missile capabilities has shown both the resilience to absorb the initial strike and the capacity to hit back deep inside Israel—an experience unprecedented in Israel's 77 years of existence.\nUnlike the sporadic and largely asymmetrical conflicts with non-state actors like the Resistance in Lebanon and occupied Gaza, the latest Israel-Iran conflict introduces a level of state-to-state warfare that challenges Israel's long-held military superiority and assumptions of deterrence. What has unfolded so far with the Iranian retaliation is a harbinger of a more symmetrical and likely prolonged confrontation—one in which Israel's own centres of power may be within range, and where the frontlines are no longer confined to Gaza, the West Bank, or southern Lebanon, but centred into the very core of Tel Aviv.\nIn the coming days, Washington's true measure will be taken after the smoke clears. If US Aegis destroyers in the Gulf or anti-missile batteries in the region are activated to shoot down Iranian missiles and drones, the US will cease to be an observer and become a co-belligerent.\nSuch presumably \"defensive\" steps quickly metastasise: one intercept invites another, and each exchange digs the US deeper into a conflict created by a foreign country. History offers bleak guidance. Once American troops engage, momentum overrides strategy and the dynamics of war supplant planning. Political leaders feel compelled to \"finish the job,\" costs spiral, US interests go unsecured, and the chief beneficiary is almost always the Israeli security establishment that triggered the crisis.\nAt the end of the day, Netanyahu's success will not be measured by how many centrifuges he cripples or how many Iranian scientists he murders. It will be measured by whether he can lock the US into yet another made-for-Israel Middle East war, paid for—strategically, financially, life, and morally—by Americans.\nIf Washington truly opposes escalation, it must say no—publicly and unequivocally—to any role in shielding Israel from the blowback it just invited. Anything less is complicity disguised as caution, and it will once again confirm that Israeli impunity is underwritten in Washington, even when it torpedoes the  US's own diplomacy and ignites yet another Israeli-engineered war.\nJamal Kanj is the author of Children of Catastrophe: Journey from a Palestinian Refugee Camp to America, and other books. He writes frequently on Arab world issues for various national and international commentaries.\n\nThis article was first published by Counterpunch on June 16, 2025.\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Israel’s attack on Iran and the precipice of a wider American war",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/israels-attack-iran-and-the-precipice-wider-american-war-3918401",
        "news_paper_name": "The Daily Star",
        "publish_date": "17-06-2025"
    },
    {
        "full_article": "The International Day of Family Remittances (IDFR) is observed on June 16, a commemoration initiated in 2015 with support from the United Nations' International Fund for Agricultural Development (IFAD). This year's global theme is \"Remittances Financing Development.\" The day honours the sacrifices of migrant workers worldwide and their vital contributions to family and national economies through remittances.\nThe concept of remittances is not new. Migrant labourers sending money home dates back to colonial times. Today's formal systems are a modern continuation of that.\nFor developing countries like Bangladesh, remittances are a key economic pillar. But a pressing question remains: are the dreams and sacrifices of those behind the remittances truly acknowledged? Or are they simply meeting the needs of others while leaving their own aspirations unfulfilled?\nWorldwide, over 280 million people currently live and work abroad for better job opportunities. The money they send home plays a significant role in global development. According to the World Bank, remittances to developing countries totalled around $650 billion in 2024. More than half of this amount—about $322 billion—was sent to just five countries. India led with $129 billion, followed by Mexico ($68 billion), China ($48 billion), the Philippines ($40 billion), and Pakistan ($33 billion).\nIn smaller economies, remittances form a large share of GDP—45 percent in Tajikistan, 38 percent in Tonga, and over 25 percent in countries like Lebanon, Nicaragua, and Samoa—helping to offset fiscal deficits and economic instability.\nSince its independence, Bangladesh has pursued foreign employment, especially in the Middle East. Formal labour migration began in 1976, and remittances have since been a major source of foreign income. By the 1980s and 1990s, labour markets expanded to Southeast Asia and beyond. As overseas employment grew, remittance channels became more secure, aided by policy support and the Ministry of Expatriates' Welfare and Overseas Employment.\nTechnological advancements in the 2000s, especially mobile banking, made sending money faster and safer. This helped solidify remittances as an economic mainstay.\nAccording to the Bureau of Manpower, Employment and Training (BMET), more than 15 million Bangladeshis have gone abroad on work visas over the last 50 years. Their remittances have boosted the country's foreign currency reserves and revitalised rural areas.\nIn the first five months of 2025 alone, Bangladeshi expatriates sent home over $13 billion, which made the country the sixth highest remittance recipient globally.\nRemittances are Bangladesh's second largest source of foreign currency after exports. But their impact goes far beyond balance sheets: families of remittance senders experience better living standards and reduced poverty, and more spending on schools and medical care boosts human development. Remittance income supports micro-enterprises and job creation. These inflows strengthen national economic resilience. Ultimately, remittances help ensure food security, improve access to services, reduce inequality, and promote women's empowerment.\nEach year, hundreds of thousands of Bangladeshis move to the Middle East, Southeast Asia, Europe and beyond, seeking better lives and livelihood opportunities. Their aim is simple: financial stability and a better future for their families. But the path is often painful. Many take loans or sell land to pay brokers, entering a cycle of debt even before departure. After arrival, they often face contract violations, wage delays, poor living conditions, and isolation. The work is gruelling and hours are long, but they endure for their families.\nSending money home isn't always easy. Despite progress, many still rely on informal channels like hundi, risking their hard-earned money and costing the nation valuable foreign currency. Access to secure digital services remains limited in some areas.\nThese workers dream modestly: a home and education for their children. Yet, many return home empty-handed, without reintegration support, job prospects or recognition.\nTo ensure migrants' dreams are realised, we need effective policies and a humane state response. Key steps include: ensuring safe, accessible remittance channels; providing training, legal aid, and information before departure to reduce exploitation; protecting migrant families; supporting reintegration by offering returnees skill training, microcredit, and employment pathways; strengthening diplomatic support by making embassies more responsive and compassionate towards migrant needs; and expanding incentives.\nRemittances aren't just transactions. They are a child's tuition, a mother's medicine, a family's sustenance. Migrant workers send more than money. They send love, courage, and untold stories of struggle. They deserve more than symbolic recognition. They deserve lasting commitment. Only then will their sacrifices result in fulfilled dreams.\nM M Mahbub Hasan is a banker and development researcher. He can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Will migrant workers’ dreams remain unfulfilled?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/will-migrant-workers-dreams-remain-unfulfilled-3918316",
        "news_paper_name": "The Daily Star",
        "publish_date": "17-06-2025"
    },
    {
        "full_article": "We are shocked and saddened by the devastating crash of an Air India plane that went down moments after taking off from Ahmedabad, Gujarat on Thursday, in what is now the world's worst aviation disaster in a decade. Our deepest condolences go out to the families and loved ones of the victims. Air India confirmed on Friday that all but one of the 230 passengers and 12 crew members on board were killed. Among the dead were also eight local residents, including four medical students, as the aircraft—a Boeing 787-8 Dreamliner—crashed into the residential quarters of a medical college in the area. The death toll may rise further as more details emerge.\nIndia's Aircraft Accident Investigation Bureau (AAIB) is presently probing into what caused the crash, which could take some time, as such investigations involve multiple factors. Preliminary theories suggest that dual engine failure, bird strikes, or mechanical malfunction could be possible factors, with the aircraft failing to gain enough thrust after takeoff. After analysing footage of its crash, aerospace safety experts noted that the plane's landing gear was down at a phase of flight when it would typically be up, an anomaly that may have contributed to the loss of power. However, data from the black box, which was later recovered, can provide definitive answers.\n\nThis tragedy must serve as a wake-up call for those in the aviation industry, including in Bangladesh. The crash has shown what can happen if safety protocols are compromised—a reality that Bangladesh, with its own history of aviation safety concerns and irregularities, can ill-afford to ignore. Major stakeholders, including the Civil Aviation Authority of Bangladesh (CAAB) and Biman Bangladesh Airlines, the national flag carrier, have long faced criticism for repeated incidents of negligence and corruption. Only recently, we were alarmed to learn of an investigation from CAAB itself that uncovered numerous irregularities in pilot licensing and training programmes. These included serious breaches such as flying schools recommending pilot licences without students completing mandatory solo flight hours, falsification of flight records, and the use of unauthorised software in written tests. Shockingly, one pilot even certified himself. Despite being aware of such practices, CAAB has failed to take action.\nUnless these systemic and deep-rooted issues are addressed, Bangladesh's aviation sector will remain vulnerable to the kind of tragedy we mourn today. The lesson here is clear: aviation safety must never be taken lightly. From airworthiness of aircraft to pilot qualifications, from pre-flight inspections to regulatory vigilance—every step must be treated with utmost seriousness. We urge aviation regulators and airline/airport operators in Bangladesh to reassess their standards and practices. If a disaster can happen to a major carrier like Air India, how confident can we be about averting a similar tragedy?\n",
        "headline_1": "Air India tragedy a wake-up call for aviation authorities",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/air-india-tragedy-wake-call-aviation-authorities-3916431",
        "news_paper_name": "The Daily Star",
        "publish_date": "17-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 17, 2025 00:00:00  \nComplicated work procedures at government offices that retard service delivery is a legacy hampering the country's growth since its birth. The call for revamping and streamlining it by all concerned is also not new. But the self-serving, archaic system is so deeply entrenched that it still lives on. As a precondition for extending their development support, the UN bodies and various multilateral lending agencies have been recommending changes including reforms in this rigid civil service procedures. Now criticism against this anti-progress, anti-growth bureaucracy is being raised even by countries and overseas business houses who have been tested partners in Bangladesh's development initiatives since long. Notably, some South Korean business houses first took an active interest in the country's textiles sector when the Readymade garment was a fledgling industry in the 1980s. Naturally, like other development partners, they have a stake in Bangladesh economy's better performance so that overseas investors including their own companies might continue to show interest in doing business with Bangladesh.\nIn this connection, the South Korean ambassador to Bangladesh at a recent seminar styled 'Korea-Bangladesh Economic Cooperation' in Dhaka organized by the 'Foreign Investors' Chamber of Commerce and Industry' pinpointed some areas in the bureaucracy as well as policy that are acting as barriers to foreign direct investments (FDIs) in the country. For instance, the customs clearance procedure and visa rules for foreign investors were the areas that came under close scrutiny. In fact, it is a colonial notion that businesses whether local or foreign should experience the ordeal of a protracted approval procedure involving multiple desks and an inordinate amount of time before a cargo is cleared or a permission is issued. Those were not business-friendly times when such arcane rules and procedures were conceived and practiced. But despite all the calls for change and reforms, the systems thrives to the detriment of business at home as well as others who are willing to invest in Bangladesh. Though many local businesses might have resigned to comply with the existing order of things, why should one expect the same kind of allegiance from an overseas investor? \nGiven the long and tardy bureaucratic procedures to get any business deal done, the usual short-term visa for a stay of, say, 90 days, is definitely not a welcome approach to a prospective overseas investor. It was exactly such barriers to effective partnership with foreign businesses that figured prominently at the discussion event in question. Alongside the procedural aspects, some policies that successive governments adopted from time to time have often amounted to stymieing the economy's overall competitiveness with regional and international peers. The higher tariffs against imports, for instance, have proved to be disincentive for overseas businesses intending to invest in the country. So, it is no surprise that at 0.75 per cent, Bangladesh's FDI-to-GDP ratio is the lowest in the region with India's at 1.7 per cent, while Southeast Asia's Vietnam at an impressive 4.7 per cent. These are the areas that call for urgent addressing from the government. As expected, the Korean diplomat's observations on these existing bottlenecks that slow down the pace of service delivery and thereby impact Bangladesh's business competitiveness could not have come at a better time, particularly when the country's graduation from the LDC category is on the doorstep. Needless to say, once exemptions from various tariff and non-tariff barriers that Bangladesh have been enjoying so far as a member of the LDCs are gone with its graduation, adequate preparedness should be there to face the challenges of a highly competitive global marketplace.\nTo survive and prosper in such conditions, it is the quality of the products and efficiency of a business trying to sell those will count. Now with all such non-business-friendly bureaucratic hangovers from the past still functional, the question arises if the government is really serious about entering that aggressive phase of business post-graduation. In the circumstances, time in hand must be utilized most expeditiously to enact required reforms before the graduation train arrives.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Reforms urgent before graduation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/reforms-urgent-before-graduation-1750085701",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       June 17, 2025 00:00:00  \n\nA sound banking sector is the bedrock of a sound economy. The experience of economies across the world attests to this assertion: without a vibrant, healthy, and functioning banking system, no country can dream of sustainable development, let alone achieve rapid economic growth. In Bangladesh, however, the very pillar that is meant to support the economy stands increasingly weakened by a long-standing and dangerous affliction -- classified loans, also known as non-performing loans (NPLs).\nNon-performing loans are the Achilles heel of the country's banking sector. This is not a new problem; it has plagued Bangladesh for decades. Yet the gravity of the crisis has intensified alarmingly in recent years, especially since the previous Awami League-led government came to power. That regime, often accused of favouring certain oligarchic business groups, oversaw a disturbing trend of ballooning bank credit disbursed to politically connected individuals and firms. As these borrowers defaulted on repayment, with little or no punitive action, the culture of willful default took root and grew like an unchecked weed.\nDespite efforts by the current interim government to restore discipline in the banking sector, the classified loan problem continues to snowball. The new administration had pledged decisive steps to reduce bad loans, and indeed it undertook several measures aimed at stricter classification rules and enforcement. Yet, the latest figures paint a grim picture: the volume of NPLs has risen significantly, threatening not just the stability of the banking sector but also the broader economy.\nAccording to the latest data, classified loans in Bangladesh's banking industry soared by around Tk 750 billion in just three months -- an astronomical jump that pushed total NPLs to a record Tk 4.20 trillion by the end of March 2025. This now accounts for a staggering 24.13 per cent of all loans -- up from just 11.11 per cent a year earlier. In real terms, nearly one out of every four taka lent by the banks has gone bad.\nTo put this into perspective, the total outstanding loans across the 61 commercial banks in the country now stand at Tk 17.42 trillion. The Tk 4.20 trillion in classified loans includes substandard, doubtful, and bad/loss categories. Alarmingly, a massive 81.38 per cent -- over Tk 3.41 trillion -- of this amount falls under the \"bad loan\" category, which means there is little hope of recovery unless extraordinary measures are taken.\nThe implications are serious. When banks are saddled with high NPLs, their ability to disburse fresh loans gets crippled. As more of their funds are locked up in unrecoverable accounts, their liquidity dries up, forcing them to become extremely conservative in extending new credit. This hits private investment hard. Without access to finance, businesses cannot expand, create jobs, or innovate. Economic stagnation follows. And in a country like Bangladesh, where private sector investment is a key growth driver, this can be disastrous.\nFurthermore, banks are legally required to maintain provisioning -- setting aside a portion of their earnings to cover the potential losses from bad loans. As NPLs mount, so does the provisioning requirement, which eats into bank profits and leaves them less capitalised. Weak capitalisation can invite further regulatory scrutiny, damage investor confidence, and eventually force banks into a vicious cycle of distress.\nThe Bangladesh Bank (BB), the country's central bank, acknowledges the worsening trend. In an effort to impose tighter discipline, the central bank revised the overdue loan classification system, reducing the tenure from nine months to six months. Starting from March 31, 2025, the classification period will be further shortened to three months. While these stricter norms are commendable and necessary, they also mean that the banks must brace for more loans turning classified in the coming quarters unless recovery improves dramatically.\nThere are structural and historical reasons behind this surge in NPLs. For the last 15 years, during the previous government's rule, a number of business accounts were opened by individuals and entities favoured by the regime. Many of these accounts were based on inflated projections, non-existent cash flows, or political protection. With the change in regime following the July-August 2024 mass uprising, many such businesses have gone into hibernation. Sales turnover has plummeted, and cash flow has dried up. These accounts are now turning toxic, and banks are left to deal with the fallout.\nMoreover, some banks have been effectively captured by vested interest groups -- a \"vicious circle\" of politically connected borrowers and complicit bank directors. These forces have laundered public money with impunity, leaving behind a hollowed-out financial system. Now, with the regulatory environment tightening, the hidden rot is surfacing.\nThe problem is not just managerial but also philosophical. Many banks in Bangladesh have failed to recognise that banking is a high-risk business -- especially in emerging markets. Lending money is not just a routine function; it requires robust Credit Risk Management (CRM) frameworks, capable loan appraisals, and vigilant monitoring. Unfortunately, in several banks, especially state-owned ones, risk management has been perfunctory or even non-existent. Even the presence of Board Risk Management Committees (BRMCs), a requirement in many jurisdictions, has been symbolic at best.\nThe way forward requires a multi-pronged approach.\nFirst, banks must urgently intensify their cash-recovery efforts. The current recovery rate is abysmally low and reflects a lack of seriousness. Legal processes to recover defaulted loans need to be streamlined, special tribunals empowered, and willful defaulters publicly named and penalised.\nSecond, the regulatory role of the Bangladesh Bank must be strengthened. No more political interference in bank appointments -- especially at the board and managing director levels -- should be tolerated. Independent directors must be made truly independent, and audit committees must be empowered to flag irregularities.\nThird, policymakers must realise that the banking sector does not operate in isolation. Global factors -- such as ongoing conflicts in the Middle East, fluctuating oil prices, and rising U.S. tariffs -- can all affect trade and investment in Bangladesh. Hence, any national strategy to improve bank performance must be built on macroeconomic foresight and external risk assessment.\nFourth, structural reforms are essential. The government must seriously consider merging weaker banks and recapitalising them, but only after ensuring good governance and accountability. No recapitalisation should be done blindly using taxpayer money without resolving the root causes of inefficiency.\nFinally, a broader cultural shift is necessary. The idea that bank loans are grants or political rewards must be shattered. Loan default must carry social stigma and legal consequences. At the same time, good borrowers -- especially SMEs and exporters -- must be incentivised and supported.\nBangladesh's banking sector has reached a critical juncture. The rise in classified loans is not just a financial issue; it is a national crisis. If left unaddressed, it could derail the country's economic ambitions. The interim government must use this window of opportunity to enact meaningful reforms -- reforms that may be difficult but are indispensable. The alternative is continued decay and erosion of public trust in the very institutions that are supposed to safeguard the country's financial health.\nAs the numbers rise, so must our collective resolve. Bangladesh deserves a banking system that fuels growth -- not one that drowns it.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bulging NPLs enough to derail economy",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bulging-npls-enough-to-derail-economy-1750085780",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       June 17, 2025 12:00:00  \n\nSearch for more environment-friendly and sustainable alternatives to many familiar practices is now the trend of the time. And as a country highly vulnerable to environmental hazards, it is an imperative that Bangladesh should opt for such alternatives for as many sectors of the economy as possible. With the woodlands of the country diminishing fast, the country can no more afford the luxury of cutting down its timber trees primarily for construction or woodwork. This refers to both the trees being grown for the purpose of timber and the natural forests where there are standing trees suitable for harvesting as timber. In this connection, the Adviser for Environment, Forest and Climate Change, Syeda Rizwana Hasan, during her first office day after the Eid holidays stressed the use of bamboo to make furniture instead of wood. Though bamboo is not wood, but a kind of fast-growing hollow-stemmed plant, it is nevertheless used in ways similar to wood. It is definitely a green alternative to synthetic materials like plastic. And by popularising bamboo as a major ingredient of furniture, pressure on wood can be reduced. Bamboo, which is a member of the Poaceae, that is, grass family, grows in abundance in the country's tropical climate. Use of bamboo in the rural area is widespread as a building material for thatched houses, i.e. those with their roofs made from dried grass or straw. However, with the expatriate workers from rural families sending remittance from abroad, the dominant trend in the countryside now is to replace thatched houses with tin sheds on cement floors. Such houses are considered a symbol of status. So, one can see fewer main dwellings or primary residences with thatched roofs on bamboo walls in the rural areas nowadays. Of course, sitting rooms, maybe kitchens and cowsheds still have thatched roofs. Be that as it may, bamboo has a hundred and one other uses as handicrafts including bamboo mats (chatai), winnowing fans, flat baskets (dalas), fishing traps, sieve or strainers (chaluni), toys, musical instruments, to name but a few. It has also its industrial use as a raw material (bamboo pulp) for paper mills. Once there were entire rural communities in the past whose main occupation was making various household articles from bamboo. One would come across such bamboo-made articles at the village haats or fairs. The traditional arongs, or large Bengali New Year's day village fairs, are the special events when village communities like the nolos (people whose occupation is making various household items from nol, or reed) would sell their bamboo works. Notably, bamboo is also a kind of reed. Needless to say, the survival of such communities who crafted items from bamboo encompassing a wide range of applications from carpentry, furniture-making, weaving to construction was possible only because the countryside in the past had natural bamboo grooves in large numbers. \nUnfortunately, with the ever-receding forestlands due to urbanisation, the natural bamboo bushes, too, are getting thinner by the day. In that case, replacing wood with bamboo for making furniture, as the Adviser for Environment has suggested, cannot be a feasible option depending wholly on the still existing natural bamboo groves. The government will have to invest generously in this sector, incentivise entrepreneurs to commercially grow bamboo bushes. Of course, that has to be done without seizing or harming croplands.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bamboo as an eco-friendly alternative to wood",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bamboo-as-an-eco-friendly-alternative-to-wood-1750085833",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 17, 2025 00:00:00  \n\nAs a university student eager to start something of my own, I've realised that building a business in Bangladesh takes more than a good idea-it takes navigating a system that often works against you.\nToday, many young people aren't just job seekers; they want to be job creators. From online shops to digital services, we're trying to build something real. But we're stuck before we even begin. Registration costs are high, the process is confusing, and if you don't have money or connections, it's hard to even be taken seriously.\nAccess to funding is another major barrier. Traditional bank loans often require collateral, guarantors, or a long credit history-things most students or first-time entrepreneurs simply don't have. This is where microloans could play a transformative role. If financial institutions or government-backed programmes offered small, low-interest loans designed specifically for youth-led startups-with simplified application processes and mentorship support-it could empower thousands of young people. Even loans of BDT 50,000 to 2,00,000 could be life-changing for a student running an online business or a rural youth offering digital services. These aren't handouts; they're investments in Bangladesh's future economy.\nI know friends who had great ideas but gave up because they couldn't get a small loan or didn't understand where to start. Our schools still teach us how to write CVs, not business plans. Entrepreneurship isn't just a buzzword anymore-it's a survival skill in today's economy.\nIf we want Bangladesh to thrive, we need more than encouragement-we need real policy change. Make it easier and cheaper to register a business. Offer microloans to students and youth with potential. Teach us how to build companies, not just get jobs.\nYoung entrepreneurs are ready. We just need the system to stop holding us back.\nSumaiya Jahan Roshni\nStudent, Bachelor of Business Administration\nNorth South University\nsumaiya.roshni@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Passion isn't the problem, policy is",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/passion-isnt-the-problem-policy-is-1750085895",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-06-2025"
    }
]