[
    {
        "full_article": "The Union government has missed an opportunity to put a lid on the prolonged controversy over the arbitrary and the undemocratic use of power by unelected Governors. A Supreme Court judgment on April 8, 2025 clarified the constitutional position over the powers of the Governor and the President in giving assent to Bills passed by State Assemblies. A Division Bench of Justices J.B. Pardiwala and R. Mahadevan held that Tamil Nadu Governor R.N. Ravi’s act of withholding 10 State Bills was “illegal” and “erroneous”. The well-reasoned judgment had outlined the possible courses of action for the Governor and the President once a Bill is before them for their assent, though the Constitution does not specify timelines. The judgment established long awaited and much required clarity on several questions. Now, the Centre, through a Presidential Reference, has brought up all these questions again to the Court, seeking its ‘opinion’ under Article 143. The power of Governors has been an extremely contentious question. The heightened brazenness of some Governors in recent years has created more bad blood between the Centre and the States, and undermined the mandate of States to govern. The Court’s judgment took into account multiple judgments, reports of committees that examined the working of Indian federalism, and Constituent Assembly debates to arrive at a firm conclusion that Governors or the President do not have arbitrary powers to indefinitely hold up a law made by an elected Assembly from coming into force.Governors are whimsical appointees of the Centre, and the Constitution does not vest them with infinite powers, least of all to undermine the elected Assembly. The Centre could have used the Court’s judgment to bring a closure to the controversy once and for all. It could have, if it felt necessary, brought constitutional amendments in line with the Court’s judgment. Instead, the Centre is raking up questions that are already settled, through a presidential reference. As constitutional scholars have pointed out, an opinion given by the Court does not override the Court’s judgment. If it was only clarity that the Centre wanted, it could have sought it through a review petition and other established procedures. By choosing the unusual path of a Presidential Reference, the Centre is signalling an intent to seek for itself powers to be exercised through Governors, that the makers of the Constitution had not given it. The Court’s judgment provided a sound framework for a consensus on the role of the Governor. The Centre should accept that, and if at all required, convene a meeting of Chief Ministers and political party representatives, to resolve any other residual issues. Published - May 17, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Governor\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        constitution",
        "headline_1": "Closing argument: On the Presidential Reference to the top court",
        "headline_2": "The presidential reference seeks to undermine a settled question",
        "link": "https://www.thehindu.com/opinion/editorial/closing-argument-on-the-presidential-reference-to-the-top-court/article69584260.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-05-2025"
    },
    {
        "full_article": "Often described in media reports as “hooch tragedies” or “spurious liquor cases”, the recurring incidents of illicit alcohol poisoning across India — most recently near Amritsar, Punjab, which claimed at least 23 lives — follow a grimly familiar pattern of poverty, greed, and regulatory failure. Each tragedy is eerily similar to the previous one, be it in terms of the socio-economic profile of the victims or the motivation of the perpetrators. The victims are typically poor, daily wage earners, seeking respite from the harsh realities of everyday drudgery. They are drawn by the lure of cheap alcohol, a vulnerability exploited by bootleggers, who are at the fag end of a long supply chain. These illicit brews often involve dangerous shortcuts, from incorporating toxic substances such as dead scorpions to diluting industrial methanol, a poisonous chemical that is deceptively similar to consumable ethanol. Methanol, easily pilfered and inexpensive, becomes a deadly profit source for bootleggers who may misjudge dilution ratios, leading to fatal consequences. The nexus among bootleggers, the police, and lower-level politicians is often apparent. While police negligence in Punjab has led to suspensions, these events are more about organised methanol theft in which the bootlegger is only the last mile operator. Methanol is not a drink; it is industrial alcohol, an intermediary in the petrochemical industry with extensive downstream use, and is, therefore, not illicit, except as an ingredient in hooch. It is categorised as a Class B poison in many States, but is cheaper than the liquor made biologically, mostly from molasses. After paying for the pilferage from authorised methanol dealers, bootleggers can still make a handsome profit.Legal proceedings in illicit liquor cases often involve murder and attempted murder charges, besides those under prohibition laws. Yet convictions, as seen in the 2015 Malvani case, can be elusive. A court acquitted 10 of the 14 accused after nine years. None was found guilty of violating the Poison Act. Since methanol production and delivery are inter-State affairs, there is a case for a central framework on methanol transport for preventing such pilferage as well as stringent State regulation. The Poison Act may add teeth to the prosecution’s case. But what is more important is to ensure that the lawmaker-enforcer dyad is incorruptible so that illegal methanol distribution is impossible. Eventually though, it is the sorry economic, social and educational situation of victims that creates a market for unscrupulous agents to make money. This can only be eradicated by tackling poverty, social inequality, and the lack of access to education alongside systemic corruption within law enforcement. Published - May 17, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        media\n                    \n                            /                      \n                        \n                        distiller and brewer\n                    \n                            /                      \n                        \n                        Punjab\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        poverty",
        "headline_1": "​Drinking to death: On illicit liquor cases",
        "headline_2": "Illicit liquor tragedies expose systemic corruption and regulatory failure",
        "link": "https://www.thehindu.com/opinion/editorial/drinking-to-death-on-illicit-liquor-cases/article69584143.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-05-2025"
    },
    {
        "full_article": "Comms wars are shaping our reality, but we can fight back \nWe are in the midst of a communication war. From what we consume on TV and internet to our visits to shopping malls and our news consumption patterns, there is a constant battle for our attention. Surprisingly, the same mechanisms that influence our choices offline also nudge our decisions online, providing a powerful tool to communicators. So what is the truth? Do we really have a grip on reality?\nIn The War For Reality: How to Win in the World of Fakes, Truths, And Communities, Dmytro Kuleba, the former foreign minister of Ukraine, approaches the subject from the unique perspective of his country’s war against Russian aggression. While the book provides deep insights into the communication war being waged in Ukraine alongside the physical war, the lessons learnt can be applied universally. \nThe book says that the truth lies somewhere between fakes and real truths because everyone can have a different version of the truth. The internet is the natural battleground for communicators. Particularly because of the innate power of images and videos to evoke responses from our brain. This is also the reason behind the rise of GAFA – Google, Amazon, Facebook and Apple – who have figured out how to hack into our brains. Note that these organisations have no qualms about working with local govts of any kind. And authoritarian countries like Russia have taken advantage of this, says the book. \nBut can blockchain tech rid us of our sin? It certainly narrows the scope for manipulation. But the 51% rule and blockchain oracles present a dilemma. The requirement of approval by 51% participants to change a fixed blockchain fact is a high bar, but not impossible to overcome by corporations, billionaires and govts. Similarly, blockchain oracles have to rely on users and available data to adjudicate a contestation over a fact. For example, Ukraine claims that Russia occupied Donbas, whereas Russia insists on a civil war happening there. Both sides would want to introduce their facts in blockchain. But for blockchain oracles to make a decision it would have to rely on data that itself might be manipulated or incomplete. \nWhat about persuasion? Can critical thinking be incentivised? As Nobel laureate Daniel Kahneman postulated, human thinking can be of two kinds – instinctive and rational. The former is immediate and emotional. The latter needs to be constantly switched on by human effort. Therefore, people often make the easiest, and not the most rational, choices. \nYet, it’s possible to nudge people towards making desired decisions. Supermarkets in Ukraine started to mark Russian goods with the Russian flag after the beginning of the war in 2014. This immediately saw Ukrainians refuse to buy these goods. So, apart from internal effort, rational choices can be facilitated through external nudges, the book says. \nOf course, manipulators also have the same tools at their disposal. This is why it’s important to control our emotions. The book says communicators of aggression and temptation are aware that sex, internet and drugs have just the same impact. The goal is to produce dopamine. In this context, betrayal is also a very powerful emotion, while peace is meaningless to those who have not known war. Therefore, ‘betrayals’ and ‘victories’ are easily controlled by the toggle switch of communications. Politicians know this very well, and now have sophisticated tools to manipulate people more efficiently. \nSo, what should we do? Filter emotionally charged news and conspiracy theories, actively search for positive information, don’t look at the world through the lens of ‘betrayals’ and ‘victories’, and don’t get tired of fighting for real values: tough but doable.\n\n",
        "headline_1": "Of Betrayals, Victories And Blockchains",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/of-betrayals-victories-and-blockchains/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-05-2025"
    },
    {
        "full_article": "Trump’s tax on remittances hurts US and immigrants\nTrump wants non-citizens – H-1Bs and Green Cards included – to pay 5% tax on money they send home. That’s bad news for over 40mn immigrants, a tenth of whom are Indians. While Indians sent $32bn home from US in 2023-24, Mexicans sent twice as much. With a 5% remittance tax in place, their remittances would have reduced by $1.6bn and $3.2bn, respectively. US would have been richer by around $5bn, but even then this tax is bad policy.\nFor one, it’s bad in principle. All immigrants pay some taxes, so Trump shouldn’t touch their post-tax income. Secondly, remittances already have high financial costs. Fees for transfers to India range from 0.8% to 10.8%, and the average is over 4%. Transfer fees for Ethiopia average 5.5%, and for Thailand 9%. Combined with a 5% Trump tax, that’s a loss of 10-15%. Inevitably, many will switch to informal channels like hawala, where, depending on the amount sent, fees can be as little as 0.1%. But as US knows too well, hawala funds terrorists and drugs, which are two sides of the same coin. Bin Laden and fentanyl. Plus, as World Bank has pointed out, the administrative costs of taxing remittances can be higher than the gains.\nTaxing remittances isn’t a new idea. In 1937, Brazil imposed an 8% tax on remittances derived from interest payments. The state of Oklahoma already charges illegal immigrants – anyone without a valid ID – $7.5 on remittances up to $500, but earns just $13mn from it annually. Trump himself toyed with a remittance fee on Guatemalans in 2019. It wasn’t a good idea then, and it isn’t now. \n\n",
        "headline_1": "5% rate, 0% sense",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/5-rate-0-sense/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-05-2025"
    },
    {
        "full_article": "In razing trees, what future are govts & people building?\nIn the many heat islands we are ensconced these days, even air-conditioning is no leveller. Because in neighbourhoods with fewer trees, life is infinitely more unpleasant. And yet, forget govts, trees remain low priorities for even summer-tormented citizens. Whether it is Kancha Gachibowli in Hyderabad or Aarey in Mumbai, only a fraction of the metro populations mobilise to save the urban forests. Still, in their passion and determination, these small groups achieve important wins.\nIn the Kancha Gachibowli case, SC has hauled up the Telangana govt for bulldozing 100 acres during a 3-day holiday, indeed through a Sunday night. Govts rarely work so industriously. But when it comes to clearing forests for various project works, they are aces at manoeuvring the labyrinth of rules and definitions. Sure, various cases also end up in the courts. But even that ends up working to the forests’ disadvantage. For example, SC has cancelled the allotment of 30 acres of reserved forest land in Pune, valued at more than Rs 200cr, for just Rs 2cr to a housing society. This took place soon after SC banned such allotment in 1996. If rescue comes three decades later, what good does it do?\nSC has asked Telangana for a plan to ‘restore’ Kancha Gachibowli’s 100 acres. Sadly, govts approach restoring forests too with brute instrumentalism. They contrive startling ideas such as raze a forest in Nicobar, ‘compensate’ it in Haryana. As if monoculture plantations are reasonable replacements for old-growth forests. People cut trees to extend their living space, govts for projects, worthy or dodgy. Both are ultimate losers.\n\n",
        "headline_1": "Leaves little",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/leaves-little/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-05-2025"
    },
    {
        "full_article": "Indians are cancelling their travel plans to Türkiye in droves. Travel websites are no longer selling holiday packages to picturesque Cappadocia or Antalya. For, it didn’t go unnoticed in India that during Operation Sindoor Pakistan military was using Turkish weapons to escalate the conflict. Initial investigations suggest that the hundreds of Pak drones deployed against India were of Turkish make.\nSo, there’s a growing demand now to boycott everything Turkish, from apples to Turkish delight. Ankara has solidly backed Islamabad in the military hostilities with New Delhi. And while Pak army chief Asim Munir and the military-ISI complex were seen to be the architects of the conflict, the figure who may have been egging on Rawalpindi GHQ is Turkish President Recep Tayyip Erdogan.\n\nRead full opinion on TOI+\n\n",
        "headline_1": "Recep for trouble",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/recep-for-trouble/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-05-2025"
    },
    {
        "full_article": "Nila Roy, a Class 10 student, was making her way to the hospital with her elder brother in the Bank Colony area of Savar on an ordinary September day back in 2020. All of a sudden, she was attacked and brutally stabbed to death by a young boy named Mizanur Rahman. Investigation later revealed that Mizan had been persistently stalking and harassing Nila for a long time. Upon facing rejection, he resorted to fatal violence.\nThen, fast forward to May 2023, Mukti Rani Barman, 15, was similarly attacked when walking home from school in Netrakona. Her stalker, 19-year-old Kawser Mia, had been harassing her for some time. After Mukti rejected his advances, he responded with a brutal, public stabbing that claimed her life.\nNow, if you have binged Netflix's global hit Adolescence, Nila and Mukti's cases might sound eerily familiar, no?\nAlthough this British drama is not based on real events, its unsettling portrayal of online misogyny, toxic masculinity, and the rise of the manosphere might remind you that while Adolescence is fiction, the murders of Nila and Mukti are not.\nTightly shot, masterfully plotted, and emotionally gripping, the four-part miniseries gained massive global attention almost immediately after its release. As the story unfolds, 14-year-old Jamie Miller is arrested on suspicion of murdering his classmate, Katie Leonard.\nAt first, Adolescence toys with us: did he really do it or not? But it doesn't take long for the truth to settle in, as Jamie's crimes were caught on CCTV. So, instead, Adolescence shifts the focus to figuring out why Jamie killed her. As the co-creator Jack Thorne puts it, \"This isn't a whodunnit, but a whydunnit.\"\nBeyond each episode's continuous-shot brilliance, Owen Cooper's gut-wrenching debut, Stephen Graham's masterful writing, and of course the \"not just a cheese sandwich\" metaphor, Adolescence asks us a very uncomfortable question: why are we so unnerved by Jamie Miller? Is it disbelief that a boy so young could commit such an adult crime, or is it that he feels painfully familiar?\nThe show may not be based on real events, but co-creator Stephen Graham, who also stars as Jamie's father, Eddie, mentioned in an interview that the story was inspired by articles he read about young men stabbing young girls to death.\nOne of those cases was likely the murder of 12-year-old Ava White in Liverpool back in 2021. A 14-year-old boy began filming Ava and her friends without consent, and Ava confronted him, demanding that the footage be deleted. As the confrontation escalated, he stabbed Ava in the neck, leading to her death.\nAnother likely inspiration was the murder of 15-year-old Elianne Andam in 2023. She was walking to school when she saw her friend in a confrontation with her former boyfriend, 17-year-old Hassan Sentamu. Elianne intervened. Sentamu, feeling \"disrespected,\" pulled out a kitchen knife and stabbed Elianne fatally in the neck.\nBut unlike typical portrayals of violent offenders, Jamie's background complicates things. A middle-class teenager raised by loving parents in a stable home, with a sister he seems to care for, there are no obvious signs that suggest he is capable of such violence.\nThe show devotes significant attention to Eddie, Jamie's father, and his emotional process of accepting that his son is a murderer.\nJamie looked up to Eddie, because Eddie embodied everything society says a man should be: strong, stoic, sporty, loud. Jamie recalls being put into football, which he wasn't good at. What he remembers is not encouragement, but his father looking away, ashamed, convinced the others were judging them both.\nJamie figured out he wasn't good at the things men are expected to be good at. Maybe that's what drew him to the internet, where, unlike football, he got to decide what he liked and didn't. Where he felt power, control.\nThe show smartly connects schoolyard dynamics with the darker corners of the internet, as it reveals Jamie's victim Katie was allegedly bullying him after turning down his offer.\nJamie wasn't even romantically interested in Katie. But when her nudes were leaked, and Jamie joined the crowd consuming her humiliation, he saw a chance to approach her when she was vulnerable, thinking \"she was gottable at that point.\" But Katie rejected him, backing up with public bullying.\nSome of the slangs she used—like \"incel\" or \"involuntarily celibate\"—refer to online communities of men who blame women for their lack of romantic or sexual success.\nIt's a digital echo chamber of rage, where theories like the \"80/20 rule\" circulate, claiming 80 percent of women only want the top 20 percent of men. Or the red pill/blue pill metaphor, where red-pillers believe women hold all the cards, and men like them are victims.\nChildren learn to regulate emotions slowly. The problem is that emotions have been gendered. Boys are often told to \"man up.\" So, they learn to translate shame, grief, guilt into anger—the only \"acceptable\" male emotion that gives them a sense of power.\nFrom a very young age, many boys are conditioned to believe a real man is dominant, desired, and always in control—especially over women. So, when that doesn't happen—when a woman says no—it feels like a betrayal. Like being exposed as a failure at being a man. Most boys aren't given the emotional tools to deal with that. They reach for what they believe they're allowed to feel: anger, blame, control.\nBecause being angry feels powerful. Blaming someone lifts shame. Revenge feels like reclaiming what they think was stolen from them.\nJamie, Mizan, Kawser, and the killers of Ava and Elianne followed the same emotional trajectory. It doesn't begin with a desire to harm. It begins with the belief that they were denied something they were owed—and that someone must pay.\nSome audiences even blamed Katie for \"pushing\" Jamie over the edge. The narrative, sadly, isn't that unfamiliar.\nTake Jahidul's murder case, just days ago; he and his friends were chatting near their campus when a fight broke out over claims they were laughing at two women nearby. When things turned deadly, rather than the attackers, the women were questioned, ridiculed, even blamed for the murder they had nothing to do with.\nBecause in patriarchy, blaming women is easier.\nIn the most discussed third episode of Adolescence, during Jamie's session with psychoanalyst Briony Ariston, he admits to feeling ugly and rejected by girls. He justifies stabbing Katie by saying he showed \"restraint\"—that he didn't touch her \"like most men would.\"\nBriony doesn't soothe or affirm him. That infuriates Jamie. He screams at her, becomes verbally violent, and tries to humiliate in the same online bullying language he grew up with—trying to dominate the session.\nDeep down, he knows he's going to be held accountable for killing Katie, and no amount of screaming at Briony is going to stop that. But by trying to control the conversation, especially with a woman, he thinks he can reclaim some power.\nBut when Briony signals the guard off, it irks Jamie as he realises she's the one with the real control in that room, not him.\nWhen first dropped on Netflix, Adolescence felt like fiction teetering too close to reality. Jamie Miller is a pattern, a chillingly familiar shape we've seen before, in news headlines, in police reports, courtroom statements, and morgues.\nWhat connects Jamie to Nila, Mukti, Ava and Elianne's murderers is that they are all products of everything we have normalised but should have questioned. They are loud, flashing warnings of a social failure. The tragic result of letting boys grow up without being taught how to lose, how to be vulnerable, and how to take no for an answer, laughing off \"boys will be boys\" while ignoring the very real violence that phrase can cloak.\nAdolescence also sticks to a familiar script, women doing the emotional labour while men unravel. We see it in Briony Ariston, the psychoanalyst tasked with decoding Jamie's mind, absorbing his rage without flinching. The show dwells in Eddie's grief—a father mourning a son who's still alive—while offering far less space to the inner worlds of Manda and Lisa, Jamie's mother and sister. While Eddie breaks down, Manda and Lisa stay composed and calm, coping in silence, holding the family together.\nBut maybe from \"how could he do it,\" the focus should have shifted a bit to the question no one asked: why didn't Lisa turn out like Jamie?\nSame household. Same parents. Same internet access. Same world. Why didn't she turn out to be a murderer as well?\nWe may never fully know why, but boys like Jamie don't become murderers overnight. They're shaped slowly by a culture that mocks male vulnerability and rewards dominance, labelling it as masculinity.\nSo, when many dismiss shows like Adolescence, maybe the real discomfort lies in how accurately it reflects that we have all seen the real Jamie Millers, too closely.\nAyesha Humayra Waresa is a freelance writer and student of mass communication and journalism at University of Dhaka. She can be reached at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Jamie Miller exists in real life, we just don’t want to admit it",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/jamie-miller-exists-real-life-we-just-dont-want-admit-it-3896001",
        "news_paper_name": "The Daily Star",
        "publish_date": "17-05-2025"
    },
    {
        "full_article": "We would like to draw the attention of the relevant authorities to the deepening water crisis across Khulna and its neighbouring districts. Reportedly, 85 percent of the 101,350 hand pumps in the Khulna division are non-functional, including 28,452 in Khulna district alone. The situation is similarly dire in Jashore, where two-thirds of the 24,303 tube wells are unusable.\nWith the vast majority of hand pumps in Khulna not working, people are being forced to travel long distances and queue for hours alongside hundreds of others to collect water. In some areas, the situation is so severe that only a single functioning tube well remains, serving as the sole safe water source for several nearby villages. In recent years, many previously functional hand pumps have dried up—a trend that appears to be accelerating. Experts and officials from the Department of Public Health Engineering (DPHE) attribute this crisis to excessive groundwater extraction, low rainfall, a lack of water retention structures, climate change, and increasing salinity intrusion. According to them, hand-operated tube wells stop functioning when the water table falls below 26 feet. When it drops to between 30 and 35 feet, even motor pumps fail to extract water. At those depths, only submersible pumps can draw water.\nAccording to the DPHE, the groundwater level in the Khulna region ranged from 18 to 22 feet during March and April of 2015-16. But today, it has dropped to between 24 and 32 feet in parts of the southwestern region. Similarly, the water level has reportedly fallen below 30 to 35 feet in areas of Jashore Sadar, Bagharpara, Jhikargacha, and Sharsha. Although submersible pumps are being installed in some of the worst-affected areas, and Tara No. 6 tube wells and centrifugal pumps are being deployed in places where the water level has fallen below 30 feet, the pace of implementation appears wholly inadequate. This indicates that the authorities have failed to grasp the severity of the crisis and the suffering of the people, which is unacceptable. It is high time the authorities addressed this growing crisis with the seriousness it demands, accelerating the installation of more advanced water pumps.\nAt the same time, it is important to recognise that the continued and rapid extraction of groundwater is completely unsustainable. Therefore, the government must not only prevent further damage to the region's water retention structures but also ensure their restoration. In collaboration with experts, it must identify and implement additional measures to address this crisis and guarantee long-term water security for the people in the region.\n",
        "headline_1": "Address Khulna’s deepening water crisis urgently",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/address-khulnas-deepening-water-crisis-urgently-3895991",
        "news_paper_name": "The Daily Star",
        "publish_date": "17-05-2025"
    },
    {
        "full_article": "Given how politicised and unaccountable the institution of vice-chancellorship has become over the years, today's VCs may feel unlucky to inherit an office burdened by a legacy of distrust and poor governance. Without the politico-administrative backing their predecessors enjoyed—which often made them immune to calls for resignation or removal, however justified—the position today is as exposed as it is constrained. We're seeing its effects now at Dhaka University, where the VC is facing pressure to resign following the murder of a student affiliated with the BNP's student wing, amid frustration over the administration's perceived inaction to ensure campus safety.\nNot long ago, it was the turn of KUET and Barishal University, whose VCs and deputies were removed following student protests. Previously, the principal of Dhaka Polytechnic Institute was removed amid protests by polytechnic students. These developments cannot be seen in isolation from the broader trend of unrest seen in public and, to some extent, private universities since the July uprising, which seems to have opened the floodgates to years of suppressed tensions and grievances.\nAt KUET, for instance, where the stalemate still persists, the VC removal saga was actually a side story to a larger crisis that has, since February 18, seen a breathless sequence of violent clashes, demonstrations, campus/dormitory closures, break-ins, student suspensions, and—to cap it all off—a face-off between students and teachers. Similar protests or disruptions have occurred in many colleges and universities over the last nine months, most recently at JnU, where a platform of students and teachers has just declared a shutdown.\nOne reason for such turmoil could be the students' growing demand for fairness and parity, but also their newfound power of mobilisation—making them opt for disruptive protests often as a first rather than last response, thus shrinking the space for negotiation and compromise. It is little wonder that this unsustainable, pressure-cooker atmosphere would also be directed at the VCs and principals. To be clear, no one is above reproach or accountability if there is reason for it. And VCs, as heads of universities, must answer for any administrative failure or irregularity. But it is equally crucial to insulate the process of accountability from manipulative or unjust pressure.\nThe mass resignations of VCs occurring after the uprising could at least be partly justified by their perceived connection with the ousted regime—under which VCs rarely resigned. But should we make up for it by unseating them without following due process? We cannot normalise this tendency of forcing VC removals—like so many other decisions that have been forced following student protests in post-uprising Bangladesh—as it will only further jeopardise the academic and administrative functions of educational institutions.\nStudents are demanding greater accountability from those in power, including at their universities. This should be addressed through reforms aimed at rebuilding trust and establishing robust mechanisms for resolving grievances and ensuring accountability of top officials, if necessary. It is also important that VCs are appointed not based on their connections but their professional and academic integrity. But students—and teachers—too must give due process a chance, and help to resolve, not worsen, any undesirable situation.\n",
        "headline_1": "Let’s not normalise forced VC removals",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/lets-not-normalise-forced-vc-removals-3895961",
        "news_paper_name": "The Daily Star",
        "publish_date": "17-05-2025"
    },
    {
        "full_article": "India's unilateral push-in of around 300 individuals through various border areas of Bangladesh since May 7 is condemnable, as it violates diplomatic norms and established border management rules. Worryingly, it appears that the push-ins may continue. The BGB chief, in a recent briefing, said they learned about another 200 to 300 individuals who had been gathered on the other side of the Khagrachhari border, and that India's Border Security Force (BSF) is trying to push them into Bangladesh. Under the circumstances, the government has rightly demanded an immediate halt to these unilateral exercises by sending a protest letter to Delhi.\nAccording to media reports, between May 7 and May 9, around 300 individuals were pushed in through areas such as Panchhari, Jamini Para, and Khedachhara in Khagrachhari; parts of Moulvibazar; the Roumari char regions of Kurigram; and Mandarbaria island in the Sundarbans. Among them were at least 39 people from the Rohingya community—some had previously been registered in Bangladesh's Forcibly Displaced Myanmar Nationals (FDMN) camps but later crossed into India, while at least five were found holding UNHCR refugee cards issued from India. Three Indian nationals were also found among the pushed-in people. The rest are Bangladeshis who had migrated to India in the last 20–25 years; many have families and children who possess Indian nationality documents. While the BGB has taken steps to send the Bangladeshi nationals to their respective home districts through local administrations, the wider impact of such random push-ins cannot be overlooked.\n\nIt is expected that any return of such individuals would be carried out through proper channels, in line with established norms and regulations. But the way India is pushing people through remote, hard-to-patrol border points into Bangladesh violates the 1975 India-Bangladesh Joint Guidelines for border authorities, the 2011 Coordinated Border Management Plan (CBMP), and decisions made during director general-level talks between the BGB and BSF. India's actions on its eastern border also set a bad precedent for its relations with neighbouring countries, especially in light of the recent conflict on its western border. And with its ties with Bangladesh already strained since the 2024 July uprising, such unilateral push-ins may only worsen the situation. Most importantly, these actions threaten our border security, which is totally unacceptable.\nWe urge the government to strongly raise these issues with the Indian authorities, question why Rohingya people were sent to Bangladesh instead of Myanmar, and, most importantly, why proper procedures were not followed in India's actions. If necessary, the government must involve the international community to put an end to such actions.\n",
        "headline_1": "India must stop border push-ins",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/india-must-stop-border-push-ins-3894346",
        "news_paper_name": "The Daily Star",
        "publish_date": "17-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 17, 2025 00:00:00  \nRising protectionism and tariff wars among the world's leading economies in recent years have put the case for multilateralism at a disadvantage. Encouraging local manufacturing by reducing reliance on imported goods or the so-called policy of import substitution might now gain a stronger ground. Unfortunately, the opposite is true. No doubt, high tariffs on imported items raise relative profitability of industries serving the domestic market in the short run. But in the long run, it hampers production for overseas markets, that is, exports. Obviously, for an economy highly dependent on export, the existing policy of high tariffs on imports has created an uneven playing field for Bangladeshi exporters when competing in global markets.\nThe issue again came to the fore when the ADB chief economist Albert Park was talking to this paper on the sidelines of the multilateral donor agency's recently held annual meeting at an overseas location. In fact, the ADB economist made no bones about the fact that other countries are unwilling to reach both bilateral and multilateral trade arguments with Bangladesh. But the fact that high internal tariff is a number one stumbling block to Bangladesh's expanded trade relations with many international and regional trade blocs is not a realization brought home for the first time. The issue came up on multiple occasions at discussions forums where local experts pointed out that Bangladesh's average nominal tariffs are higher than those in other low-income, middle income and high income countries. The nominal tariff, for instance, is 27.6 per cent in Bangladesh which is higher than many of its neighbouring economies such as India where it is 18.1 per cent and in Sri Lanka 22.4 per cent. But it cannot also be said that those South Asian neighbours have liberal tariff regimes. To tell the truth, their differences, when it comes to liberal tariff policies, are just a matter of degree compared to Bangladesh. So, it is not hard to understand why the South Asian Association for Regional Cooperation (SAARC) could not succeed even four decades after its inception. However, intense political rivalries between two nuclear members, India and Pakistan, are no less to blame for SAARC's stunted growth.\nBy comparison, the South East Asian economies like Thailand, Vietnam, Malaysia and Indonesia with their 9.7 per cent, 9.6 per cent, 5.6 per cent and 8.0 per cent nominal tariffs are indeed better placed than Bangladesh in reaching mutually beneficial deals with their regional competitors. Small wonder that the 10-member ASEAN with a total GDP of US$4.249 trillion and a population of 683.29 million is a mammoth economic bloc sharing some 8.0 per cent of the global export. Bangladesh could have immensely benefited by being a member of such forward looking trade blocs known for less protectionist trade policies.\nThe good news is Bangladesh has shown interest, thanks to Chief Adviser, Dr Muhammad Yunus's overture to Malaysia's diplomatic mission in Bangladesh soon after his assumption of office in late August last year, to join ASEAN. Also, Bangladesh's effort to join the Regional Comprehensive Economic Partnership (RCEP) to retain preferential trade access to major markets like China, Japan, South Korea and the ASEAN countries after its LDC graduation in 2026 is also commendable. However, while making these moves to join less protectionist trade blocs, Bangladesh should also redouble its efforts to widen and diversify its export basket. Out of its some 1,377 non-RMG export items, 174 are highly competitive. What is urgent is to proactively develop and explore the overseas markets for these products.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "BD's move to join trade blocs",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bds-move-to-join-trade-blocs-1747401134",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       May 17, 2025 00:00:00  \n\nThe cost of keeping the lights on in Bangladesh is drawing ever more intense scrutiny, especially over electricity imported under the agreement with Adani Power. In early May, Adani Power's Chief Financial Officer Dilip Jha disclosed that Bangladesh owes approximately $0.9 billion for electricity supplied from the 1,600?MW Godda Plant in India's Jharkhand state. This follows a $1.2 billion payment made to Adani just last November. By June, the outstanding amount is projected to reach $1.3 billion, once again placing considerable pressure on the country's foreign currency reserves and raising serious questions about the wisdom of the deal.\nOne reason why the dues are mounting so quickly is the steep late payment fee, which reportedly stood at $136 million as of May 2025, accruing at an interest rate of 2.0 per cent per month. That's nearly 27 per cent annually, making it a penalty five times higher than typical global borrowing costs. With reserves already depleted to just over $20 billion following recent international payments, it is getting increasingly difficult for Bangladesh to sustain such costly terms. \nThe core issue, however, lies in the inflated cost of electricity itself. In fiscal year 2023-24, Bangladesh Power Development Board (BPDB) paid an average of Tk 14.87 per kilowatt-hour (kWh) to Adani, totalling over Tk 121 billion or around $1.0 billion. In contrast, other Indian suppliers charged significantly lower prices. NVVN Ltd charged around Tk 8.07 per kWh, Sembcorp Energy India Ltd Tk 10.42 and PTC India Ltd Tk 9.28. This puts Adani's tariff at least 30 per cent higher than comparable suppliers. The discrepancy becomes even more pronounced when compared to domestic projects such as the 1,200 MW Matarbari Coal-Fired Power Plant in Cox's Bazar, which has agreed to sell power to BPDB at just Tk 8.45 per kWh.\nIn a country where public subsidies are required to keep retail electricity prices affordable, such inflated import prices are hard to justify. Subsidising overpriced electricity drains public funds and distorts budget priorities, yet the government has little choice if it wants to avoid public backlash over higher retail electricity prices. Amid these concerns, the High Court in November last year ordered the formation of a committee to review the terms and conditions of the power purchase agreement with Adani. A three-member committee was reportedly formed in response, but its findings are yet to be made public. \nThe over-reliance on imported electricity also raises strategic considerations. Energy is a strategic asset, and dependence on a single foreign supplier under restrictive and lopsided conditions leaves Bangladesh exposed to serious geopolitical and economic vulnerabilities. It is not hard to see how Europe paid a heavy price for its dependence on Russian gas after the invasion of Ukraine, for instance. \nBangladesh has relied heavily on energy imports in recent years, often out of necessity. But that necessity is quickly diminishing. A number of domestic energy projects including gas, coal, solar and the Rooppur Nuclear Power Plant is set to transform the country's energy mix. Rooppur alone will add 1,200 MW of nuclear capacity by late 2025. Several existing plants are also operating below capacity due to fuel supply or grid issues, not for a lack of infrastructure. This changing situation makes it both necessary and possible to revisit past deals signed under very different conditions.\nThe Adani agreement is particularly troubling not only because of high cost, but also for its lack of transparency. Under the PPA, Adani Power was required to disclose any tax exemptions granted by the Indian government. However, BPDB officials have reported that Adani failed to inform them about a key regulatory change. In February 2019, India amended its Special Economic Zone (SEZ) policy to grant tax-free status to Adani's Godda plant for electricity exports. This benefit was never passed on to Bangladesh which constituted a breach of contract and a serious lapse in disclosure. Had Bangladesh been informed, it could have pushed for a lower tariff to reflect Adani's reduced operating costs. Instead, the country not only overpaid for electricity but also ended up subsidising a foreign company's tax advantage. \nGiven the scenario, Bangladesh has a strong case for renegotiating its agreement with Adani Power. Although the contract reportedly contains strict conditions for termination, this only makes renegotiation more urgent. An unfavourable deal does not mean it is unchangeable. In international business, new information and changing circumstances, especially failures to disclose key terms, can provide legitimate grounds for reopening agreements. Doing so, however, requires political will and strategic foresight. The BPDB's approach to Adani Power should be that of a sovereign entity protecting its economic future, not merely a passive debtor. The renegotiation efforts should also prioritise all three demands: lowering per-unit cost, softening late payment penalty and adjusting tax-sharing terms in light of exemptions granted to Adani by the Indian government. \nBangladesh need not enter this process from a position of weakness. The Matarbari agreement with the Coal Power Generation Company of Bangladesh Ltd (CPGCBL) provides a clear and relevant benchmark. If a domestic plant using imported coal can offer electricity at Tk 8.45 per kWh, there is little justification for paying nearly twice that amount for similar energy from across the border. Furthermore, Bangladesh's growing domestic capacity means that the country will soon have the option to reduce its reliance on external suppliers. This shift in energy self-sufficiency strengthens its negotiating hand. \nGlobally, many countries are rethinking their energy strategies in the face of fossil fuel depletion. China, the UAE, the United States and even India are expanding their nuclear power infrastructure. Nuclear power offers long-term stability and low running costs, advantages Bangladesh must make the most of through Rooppur and future projects. A forward-looking energy policy should focus on building domestic and sustainable sources, not tie the country to expensive and rigid deals born of short-term need.\nThe deal with Adani Power does not have to remain a long-term burden. With a clear strategy, Bangladesh can push to revise the deal, protect its economy, and make better use of its public funds.\n\nshoeb434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Adani Power and high cost  of its electricity",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/adani-power-and-high-cost-of-its-electricity-1747401189",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       May 17, 2025 00:00:00  \n\nFor the first time after 17 years, the annual national budget will not be placed in national parliament. Instead, the budget for the fiscal year 2025-26 (FY26) will be announced by Dr Salehuddin Ahmed, the finance adviser of the Yunus-led interim government, via television broadcast. The last time such a thing happened was in 2008 when the then finance adviser, Dr Mirza Azizul Islam, under the Fakhruddin-led caretaker government, announced the national budget via televised speech. He unveiled two consecutive national budgets for FY07 and FY08 via television, as there was no elected government and parliament in the country. \nAfter the fall of Sheik Hasina's autocratic regime on August 5 last year, parliament was also dissolved, and the interim government took charge. So, it is an exceptional time, though not unfamiliar to the country's citizens. During the past 54 years after the country's independence in 1971, people witnessed a number of such exceptions. \nPlacing the national budget in parliament is a constitutional obligation. Interestingly, radio and television announced the country's first national budget on June 30, 1972. At the beginning of his budget speech, Tazuddin Ahmed, then finance and planning minister, said: \"I feel happy to place the budget in front of the people's representatives instead of broadcasting via radio and television. However, I hope I will not be compelled to announce the budget in such a way ever.\" He placed the annual budgets for 1971-72 and 1972-73 together. The budget for FY72 was a half-yearly budget (December 16, 1971- June 30, 1972) and was placed as a post-facto one to keep continuity. Again, during the war of independence in 1971, the Mujibnagar Government, the provisional government of Bangladesh under the premiership of Tazuddin Ahmed, made a budget worth Tk 86.28 million for the July-September period.\nBesides television broadcasting, another change will be made while announcing the budget for FY26. Instead of placing it on Thursday, it will be announced on Monday (June 2, 2026), breaking the long tradition of budget placement on the last working day of the week. This is mainly due to the Eid-ul-Adha holidays, which are set to begin in the second week of June. The time of formal announcement of the budget is, however, likely to remain unchanged, which means the finance adviser will start his budget telecast at or after 3 pm. \nThe afternoon placement of the budget is a colonial legacy. Back then, members of the British parliament listened to the Indian budget through radio transmission in London. That's why the British-Indian budget was placed in the afternoon, at 5.00 pm. The federal budget in Pakistan is still placed at 5.00 pm. India, however, has revised the time. Since 2001, the country's annual union budget has been announced at 11.0am in the morning. India also has changed the practice of announcing the budget on the last day of February since 2016. Now, the budget is placed on February 1.\nFor the last couple of years, media people have been demanding a reschedule of the time of national budget placement at 11:00 am or 11:30 am instead of 3:00 pm. If the budget is announced at 11.00 am or 11.30 am on Thursday, the media, especially the newspapers, will get sufficient breathing space to listen, read, comprehend and analyse the budget. Currently, journalists have to come under tremendous stress due to the limited time of five/six hours left to cover budget. So, the scope of errors and omissions is ample now, and it is also not possible to provide all the information on critical budgetary steps. Businesses and experts will also get enough time to review the budget and make better observations and analyses. \nThere is an argument that the budget's prenoon placement will allow an unscrupulous group of market players and traders to manipulate fiscal measures. This is, however, poor logic. A mature economy must be able to absorb the immediate volatility in the financial and commodity markets due to the instant reactions of budgetary measures.\nFinally, the forenoon announcement of the budget is not just a matter of convenience, but a necessity. It will provide the finance adviser and his teams with ample time to explain and clarify many issues to the media after the formal announcement. This process will make the budget more transparent. It's time to break with the colonial legacy of afternoon budget announcements and introduce the forenoon placement.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why not announce budget before noon?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-not-announce-budget-before-noon-1747401255",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 17, 2025 00:00:00  \n\nThe use of courier services across the country has increased significantly in recent years, driven by the rise of online shopping, inter-district product delivery and the exchange of official documents. From e-commerce platforms to remote job applications, countless individuals and businesses now rely on these services for the smooth flow of goods and communication. However, the quality of service offered by many courier companies remains alarmingly poor.\nCustomers regularly face delays, negligence, fraud, and a general lack of accountability. Despite promises of prompt delivery, packages often take over a week to arrive-if they arrive at all. Instances of parcels being lost, delivered to the wrong address, or arriving in damaged condition are far too common. This is especially distressing when important items like job applications, medical reports or exam admit cards are involved.\nFragile and valuable items such as mobile phones, electronics or clothing are often handled without proper care, resulting in damage during transit. Yet, courier services rarely accept responsibility or offer compensation. The situation is further worsened by unprofessional behaviour from staff and poor customer service. Many customers do not receive proper updates or support, even after making advance payments. In some cases, complaints go unanswered altogether, leaving customers frustrated and helpless.\nThis state of disorder is not merely a personal inconvenience but also a barrier to business and commerce. Local entrepreneurs suffer loss of reputation and when deliveries are delayed or mishandled, those hinder the growth of small and medium-sized enterprises. The lack of a dependable delivery infrastructure also discourages new startups from entering the market.\nGiven these pressing issues, the Ministry of Posts and Telecommunications and relevant regulatory authorities need to take immediate steps to streamline the operations of courier services, enforce accountability and ensure that customers receive timely and reliable service.\nProgga Das\nStudent, Department of Economics\nEden Mohila College\nproggadas2005@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Courier services must improve",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/courier-services-must-improve-1747401280",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-05-2025"
    }
]