[
    {
        "full_article": "India’s March retail inflation was down to a near six-year low of 3.34%, making it almost certain that the Reserve Bank of India (RBI) will cut its banks’ lending rate further over the next few Monetary Policy Committee meetings. The repo rate has already been cut twice in a row, by 25 basis points (bps) each, in February and April, bringing it down from 6.5% to 6%, signalling the emphasis on growth, amid global trade uncertainties, as the RBI’s concern over non-core inflation eases. Vegetable prices have plummeted over the past four months from the highs of October 2024, when food inflation peaked at 10.87%, the highest since November 2013. Food inflation in March fell to 2.69% aided by a contraction in the prices of vegetables (-7.04%), eggs (-3.16%) and pulses (-2.73%). The repo rate reduction has already begun translating into lower interest on bank loans. In normal times, this would translate into greater capital flows into businesses, thereby raising jobs, incomes and consumption. But it comes at a time of dampening investor confidence: U.S.-led tariff uncertainty is forcing exporters to scramble for newer markets, amid a concern over near-term demand contraction, as America has been India’s largest buyer of merchandise goods since fiscal year 2022. Easing inflation could raise domestic consumption and India’s sluggish industrial production.What must concern policymakers more should be the steep fall in food prices, as this means lower farmer incomes, directly impacting rural consumption demand. Last December, the government procured eight tonnes of tomatoes in Kurnool, Andhra Pradesh, as prices in the local market plummeted to ₹1 a kilogram. In February this year, in Maharashtra and Madhya Pradesh, an 80% fall in tomato prices forced farmers to dump produce or use them as cattle feed. A 2022 study by the Ministry of Food Processing pegged India’s post-harvest loss at a whopping ₹1.52 trillion annually, ranging between 6% to 15% of produce depending on the crop and region. This is due to widespread shortages in cold storage facilities and temperature-controlled transport for perishables, and market inaccessibility for farmers. A significant 86% of Indian farmers make a living from less than two hectares of land. A 2021-22 NABARD survey pegged average monthly agricultural household income at ₹13,661. A more comprehensive NSSO 2019 survey estimates this to be ₹10,218. These figures are lower than those in other emerging economies such as China, Mexico and Brazil for the corresponding years. While rural consumption has been rising since the COVID-19 pandemic years, monthly per capita consumption expenditure for rural areas in fiscal 2024 was ₹4,122, while in urban areas, it was ₹6,996, indicating the significant gap that must be viewed as an opportunity, at a time when export growth is expected to be sluggish. Published - April 17, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        inflation and deflation\n                    \n                            /                      \n                        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        fruit and vegetable\n                    \n                            /                      \n                        \n                        food\n                    \n                            /                      \n                        \n                        loans\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Mexico\n                    \n                            /                      \n                        \n                        Brazil\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        employment",
        "headline_1": "​Good news, and bad: On the economy",
        "headline_2": "As retail inflation ebbs, Government must focus on improving farmer income",
        "link": "https://www.thehindu.com/opinion/editorial/good-news-and-bad-on-the-economy/article69456873.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-04-2025"
    },
    {
        "full_article": "The India Meteorological Department (IMD) has given a reassuring signal that from June to September, India is likely to receive ‘above normal’ monsoon rainfall, or 5% more than the historical average of 87 cm. Were this to pan out as projected, it would be a second consecutive year of ‘above normal’ rains. Last year, India received 8% more monsoon rain than what is typical from June to September. This is good news for kharif sowing, which will help improve stocks of grain and shore up reserves for exports. This year the government has also committed to procure, at the minimum support prices, pulses in an attempt to reduce the import bill. As pulses are a more land-intensive crop than cereal, good rains are essential for an adequate harvest. The IMD follows a two-stage system of monsoon forecasts: the first in April, followed by an update in mid-May, which has additional information on rainfall distribution. These are regularly updated monthly, alongside a host of short-term forecasts. Thus, what is forecast in April may not exactly unfurl itself given the limitations of meteorological science and the computational tools required. However, this year, there is certainty about the absence of an El Niño. Associated with a warming of the Equatorial Pacific and with six out of 10 years linked to weak monsoon rain, a monsoon without an El Niño augurs well for India. Another encouraging factor is a parameter called the ‘Eurasian snow cover,’ or snow cover areas of northern hemisphere and Eurasia (January-March, 2025). These were ‘below normal,’ and, according to IMD meteorologists, have an ‘inverse relationship’ with that year’s summer monsoon rainfall. An inverse relationship means that less snow corresponds to more rain.For its monsoon forecasts, the IMD uses weather models that simulate the ocean and the atmosphere. This year, except for the El Niño, none of the ‘oceanic parameters’ indicates either way — how the monsoon will pan out. This is not unusual but means that factors closer to the sub-continent – cyclonic activity in the Bay of Bengal and Arabian Sea for instance — will have greater importance to the monsoon. Past years with above normal rainfall have brought flooding and landslides, accentuated by the challenges of global warming. Kerala’s Wayanad disaster in July last year, that killed at least 200 people and displaced several times that number, is just one instance. Therefore, positive news on the monsoon front should not distract the focus of the Centre and States from putting in place adequate infrastructure to minimise damage and the loss of lives.\r Published - April 17, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Monsoon\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        rains\n                    \n                            /                      \n                        \n                        cyclones\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        science (general)",
        "headline_1": "​Monsoon anticipation: On the monsoon in 2025",
        "headline_2": "Despite the prediction of normal rainfall, India must be ready for extremes",
        "link": "https://www.thehindu.com/opinion/editorial/monsoon-anticipation-on-the-monsoon-in-2025/article69456918.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-04-2025"
    },
    {
        "full_article": "Heat Action Plans across cities will fail because they are not backed by money & they don’t factor in local conditions. Heatwaves must be classified as natural disasters, with legally binding solutions\nThe heatwave of 2024 had a devastating impact in most parts of the country. While we will never know the exact number of fatalities, thanks to factors like underreporting and the narrow criteria for recording heat-related deaths, anecdotal evidence suggests they must be in thousands.\nFor example, in just three days, between June 18 and 20, Delhi Police recovered more than 50 bodies, mostly homeless individuals, as extreme heat swept across the city.\n\nThis year’s heatwave is also predicted to be severe.\nRead the full story on TOI+.\n\n",
        "headline_1": "Summer: No happy ending",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/summer-no-happy-ending/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-04-2025"
    },
    {
        "full_article": "The richest American university will be hit by a government funding freeze because its endowments can’t be used for general financing. But a weakened Ivy League will cost US even more, and benefit China\nUniversities are the enemy, said JD Vance in a speech some years ago. And now that’s the key higher education policy of the Trump administration. Wouldn’t it be cool, the president suggested at lunch on April 1, per an NYT report, if the government simply cancelled all of Harvard’s $9bn in federal contracts and grants. Less than two weeks on, the university finds $2.3bn of its funding already frozen.\n\nIt’s out of Harvard that Joseph Nye coined the phrase soft power – the ability to obtain what one wants through attraction rather than coercion or payment.\nRead full story on TOI+.\n\n",
        "headline_1": "Trump vs Harvard: If he wins, America loses",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/trump-vs-harvard-if-he-wins-america-loses/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-04-2025"
    },
    {
        "full_article": "By Homayun Taba\nCamera lenses can shift focus, showing objects in what might be called a tight shot, or go for a wide angle, expanding the scope. It may be worthwhile to compare these modes of visual perception to our ways of perceiving and processing life experiences.\nA tight focus, mentally speaking, because of its restrictedness, often leads to fixation. At times, this would reflect striving towards too much perfection. Perfectionism is a narrow focus, unnatural because it eliminates the imperfection and messiness that is naturally woven into our lives.\nJapanese potters, aware of this, deliberately drop some uneven glaze after completing glazing a pot, seemingly sloppy but in fact intentional to avoid the rigidity of perfection. This renders the piece its signature aliveness.\nA Zen story demonstrates this well. A junior monk was sent to sweep leaves in the garden. The abbot in-charge walking by noticed it was perfectly swept without a single leaf left. The young monk thought he would be pleased.\n\nHowever, the abbot stepped forward and gently shook the tree, which led to some leaves falling. Pleased, he turned to the junior monk and said, “Ah! Good cleaning,” indicating it was unnatural, therefore narrow focus, to assume that a tree should not have some leaves under it.\nThis narrowness in the spiritual sense, reveals itself in the ‘nothing but this’. Replacing the purnam,which is the wide angle, whole, with a restricted approach. This limiting viewing, which also distorts, becomes a fertile ground for fanaticism and fundamentalism, be it in family, tribe or a nation.\nThere is no harm in close or narrow viewing, required in many instances, but the point is to ask, “Am I also capable of shifting my lens?” Narrow focus needs to be balanced by the wide-angle viewing of ideas and belief systems.\nOne of the best cases is that of Jalaluddin Balkhi, known as Rumi. It is reported that whoever attended his talks came away with a deeper understanding of his own spiritual tradition. That happened through unifying effect of ‘ekam sat’, believing truth is one, though sages call it variously. This could not have happened if Rumi only propagated teachings of his own tradition.\nAlthough he was deeply anchored in Islam, his enlightenment or ‘the maturity of his faith’, as Father Orlando often referred to, made it possible to effortlessly make a shift and zoom out to wider realities, from uniqueness to commonality. Rumi’s was a caravan inviting more travellers to come along on the path to universal connectivity. Narrow viewing is too sharply focused, while wide-angle looking, and its inclusive nature enlarge the context.\nThis has a profound effect on one’s way of perceiving life, it ‘immunises’ one against mental viruses of partial and narrow assumptions, convictions and certainties.\nAnother example is the case of a woman going to the Buddha with an aching heart, hoping for some relief from the death of a loved one. The Buddha sends her to collect some mustard seeds from those houses where there had been no experience of loss. Returning emptyhanded, she realises that everyone had a sad tale to tell.\nThis led to what the Buddha had intended – a shift from a narrow focus to a wider angle, and with that, she came to be spared from the ‘Why me?’ syndrome.\nWide-angle viewing avoids fixing others or converting them, it accepts other ways of being and acting.\n\n",
        "headline_1": "Balance narrow focus with wide-angle viewing",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/balance-narrow-focus-with-wide-angle-viewing/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-04-2025"
    },
    {
        "full_article": "A remarkable olive ridley shows why Maharashtra needs to up its turtle conservation\nOlive ridley turtle tagged ‘03233’ made history. The first flipper-tagged turtle on record to cross India’s coasts and two ocean basins has sent an important message to the scientific community and marine conservation ecosystem. 03233 was flipper tagged in 2021 during mass nesting on an Odisha beach. In 2025, she was solo nesting on the Konkan coast, where she laid 120 eggs, higher than the west coast average of 90-95 eggs.\nThe event’s scientific significance cannot be overstated. Hers is the first recorded nesting at two beaches in the same period. This, when there was no apparent reason – like climate stress – for 03233 to turn west and north from turtles’ normal migration route along Sri Lanka. It also shows interconnectedness of marine ecosystems on either coast, calling for a pivot on current theories of movement patterns. Last few years have seen numbers of olive ridleys nesting along the west coast grow – indicating favourable conditions to lay eggs. Of 3,500 nests counted from Gujarat to Kerala, 2,500 were on Maharashtra’s shoreline. The state hosts 20% of India’s olive ridley nests – Guhagar, where 03233 fetched up, has almost 300 nests. Scientists are also studying if the west coast ones are residents (they seem to hang around in Arabian waters) or migrants – like 03233.\n03233’s sea-trek has provided the what & where, now to understand the how & why. As WII’s census of turtles gets underway, it’s essential that both flipper and satellite tagging are scaled up with funds, improved tags and trained conservators, to better track turtle movement. Their paths will inform coastal zoning and turtle-safe fishing areas. Animals travel huge distances in search of correct climate conditions for feeding & breeding grounds. If parts of Maharashtra’s coast – prey to builders and tourists – are the big new hangout for olive ridleys, much conservation effort is needed to make these safe for turtles.\n\n",
        "headline_1": "Turn turtle",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/turn-turtle/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-04-2025"
    },
    {
        "full_article": "It is unfortunate that we celebrate the remittance earnings of our migrant workers but our actions fall drastically short when it comes to ensuring their safety, dignity, and well-being both at home and abroad. In particular, the steady stream of coffins returning home—with migrants' lives cut short by health issues, workplace accidents, etc.—is a stark reminder of our collective failure to protect them.\nAccording to the Wage Earners' Welfare Board, 4,813 bodies of migrant workers were brought back to Bangladesh in 2024 alone. The number of deaths has been rising steadily since 2020, increasing by more than 50 percent. In total, over the past four decades, at least 57,216 migrant workers' bodies have been repatriated. Many more are buried overseas, with families sometimes choosing not to bring the bodies home. When a body is repatriated, the Welfare Board provides Tk 35,000 for burial and transport costs. Besides, under a 2023 insurance scheme, families of insured workers who paid a one-time Tk 1,000 premium can receive up to Tk 10 lakh in the event of a work-related death.\nIronically, the official causes of death in most cases are listed as strokes, brain haemorrhages, or heart attacks—categorised as \"natural causes.\" But experts have questioned this narrative, pointing out that most deceased workers were between 38 and 42 years old and reportedly had no prior health issues. Unfortunately, bodies are not re-autopsied upon return to Bangladesh. As a government official told this daily, rather unconvincingly, it is \"difficult\" to probe these untimely deaths further as autopsies conducted in host countries fall under their legal jurisdiction. But the question remains: Why, after all these years, have we failed to ensure a transparent and credible process for investigating the deaths of our migrant workers?\nGovernment data shows that most of these deaths occur in the Gulf region, where extreme heat and gruelling work conditions—especially at construction sites—have taken a severe toll. A 2023 study highlighted the link between excessive heat and poor health outcomes among workers in the Gulf. Yet, there has been little visible effort to negotiate better terms for Bangladeshi workers abroad.\nGiven these realities, we urge the government to push for safer and more humane recruitment and working conditions in host countries. Employers must be compelled to comply with international labour standards, ensuring not just better wages but also improved living conditions and healthcare access. At the same time, migration costs must be reduced so that workers are not forced to endure dangerous jobs just to recover their investment. The authorities must also ramp up efforts to crack down on fraudulent agents involved in fake recruitment, wage theft, and forced labour. We must remember that migrant workers deserve protection, dignity, and justice. Their lives, health, and the well-being of their families must be as high a priority as the remittances they send home.\n",
        "headline_1": "Migrants' lives matter more than their remittances",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/migrants-lives-matter-more-their-remittances-3872706",
        "news_paper_name": "The Daily Star",
        "publish_date": "17-04-2025"
    },
    {
        "full_article": "In the brittle dawn of 1990, as Peru's economy haemorrhaged and Shining Path guerrillas carved their nihilism into the Andes, Mario Vargas Llosa, a man who had spent decades wrestling dictators and desire onto the page, staged a rebellion not with words, but with a ballot. His presidential campaign was a surrealist subplot ripped from one of his own novels: the writer as Don Quixote, tilting at the windmills of hyperinflation and terror, his lance a manifesto titled Liberty.\nFor Dhaka's readers, where poets once inked revolutions into being, this moment hums with kinship. Think of Rabindranath Tagore, who mistrusted nationalism even as he anthemed it, or the Bangladeshi bards who distilled liberation into verse. Vargas Llosa's crusade, a failure that seeded literary triumph, whispers a question: can stories outlive the frailty of those who write them?\nThe campaign as a novel\nThe streets of Lima in 1989 throbbed with a dissonant energy. At Vargas Llosa's rallies, crowds chanted \"¡El escritor! ¡El escritor!\"—\"The writer!\" as if they were summoning a fictional hero, not a candidate. Here was the author of The Feast of the Goat, a scalding portrait of Dominican dictator Rafael Trujillo, now vowing \"a government without caudillos.\" His platform, a cocktail of Thatcherite economics and Enlightenment ideals, clashed with Peru's left-leaning intelligentsia. Critics jeered at his polished Europhile demeanour: how could this Parisian novelist, with his tailored suits and Cartesian logic, preach austerity to Lima's pueblos jóvenes? Yet, his warnings about opponent Alberto Fujimori—\"Democracy is not a lottery!\"—carried the grim foresight of a tragedian.\nIn Dhaka, this arc echoes. Consider the intellectuals of 1971, whose pens sketched utopias only to watch them warp in the kiln of statehood. Vargas Llosa's campaign was equal parts hope and hubris. Years later, he'd muse, \"I entered politics to prevent Peru from becoming a dystopia. I exited to write about the one that came anyway.\"\nThe alchemy of defeat\nBy April 1990, the plot twisted. Fujimori, the political outsider, trounced Vargas Llosa. The novelist retreated to his study, his manifesto ash. But from that wreckage rose Death in the Andes, a 1993 novel where Peru's mountains swallow soldiers and myths alike. Here, the Shining Path's savagery isn't a backdrop—it's a character, as vivid as any despot he'd skewered before. Defeat had honed his gaze; no longer the pedant of policy, he became a pathologist of power. His prose dissected the rot beneath ideology—how fear curdles into fanaticism, how dogma devours reason.\nWhen Fujimori dissolved Congress in 1992, morphing into the autocrat Vargas Llosa had foretold, life pirouetted into art. The writer's revenge was not in office but in outliving the tyrant with a story. In Bangladesh, where the poetry of '71 sometimes stumbles against the prose of governance, this resonates. Liberation's lyricists know: the pen's power lies not in ruling but in refusing to relent.\nThe democracy of stories\nLong before his presidential gambit, Vargas Llosa wrote The Storyteller, about a man who vanishes into the Amazon to become a tribal narrator. It was a metaphor for his creed: storytelling as democracy's oxygen. \"Fiction doesn't dictate. It questions,\" he insisted. His novels—torn between Lima's grit and Parisian salons—bridged continents, much like Dhaka's diaspora, forever suspended between roots and flight.\nHe Latin-Americanised the European novel, grafting Faulkner's fractures onto Andean soil. In The War of the End of the World, he chronicled a 19th century Brazilian uprising, not as history but as a fever dream of faith and ruin. For a region stalked by caudillos, his work was a vaccine: literature as fire, spreading \"discontent,\" as he put it.\nWhy Dhaka listens\nIn a city where rickshaw pullers hum Nazrul and tea stalls debate Tagore, Vargas Llosa's paradox feels familiar. His failed presidency reminds us that art might lie not in the throne but in the echo. When dictators fall and policies fray, stories endure—the last, truest democracy.\nIn The Feast of the Goat, a dictator's autopsy reveals cancer gnawing his liver. Vargas Llosa, forever the surgeon-novelist, knew: literature dissects the malignancies that politics masks. Dhaka understands. Here, writers have long been haunters, their ghosts lingering in alleyways and assembly halls. The lesson isn't that artists should shun power, but that their rebellion is deeper, quieter—a whisper that outlasts the shout.\nZakir Kibria is a writer and policy analyst. He can be reached at [email protected].\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Lima's ballot, Dhaka's echo: Vargas Llosa's political foray",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/limas-ballot-dhakas-echo-vargas-llosas-political-foray-3872511",
        "news_paper_name": "The Daily Star",
        "publish_date": "17-04-2025"
    },
    {
        "full_article": "Plastic bags, particularly single-use plastics, have become a major cause for environmental pollution in Bangladesh. Additionally, in urban areas, plastic waste accumulates on the roads, in footpaths, and public places. It also clogs drainage systems, leading to waterlogging and flooding during the monsoon. Plastic waste is polluting rivers and canals, too, harming aquatic ecosystems.\nRural areas, often overlooked in discussions about plastic pollution, are also severely affected. Plastic bags and other waste are frequently discarded in fields and open spaces, leading to the degradation of soil quality, which affects agricultural productivity. Moreover, plastic waste can contaminate water sources, posing serious health risks to the rural populations. This underscores the urgent need for sustainable alternatives like jute packaging.\nIn recent times, the interim government of Bangladesh has prioritised the production of environmentally sustainable jute bags to replace plastic bags in transportation and marketing. The feasibility of mandatory jute packaging has been dependent on consumer awareness and economic factors. Despite its eco-friendly nature, jute's practical application and cost-effectiveness in modern packaging solutions are essentially considered.\nThe introduction of mandatory jute packaging is not just an environmental initiative, but also a significant economic opportunity. It will positively impact the economy by creating employment, particularly in rural areas, and potentially reducing poverty. The Export Promotion Bureau (EPB) reported that the export of jute and jute products earned $912 million in FY2022-23. This indicates that a rise in demand for jute sacks will not only promote production, but also safeguard the jute industry, thereby protecting the environment.\nBangladesh enacted the Mandatory Jute Packaging Act, 2010 to address this situation. This law is aimed at reducing the use of single-use plastic bags and protect against environmental pollution. Section 4 of the act states that no product prescribed under this act can be sold, distributed or supplied without being wrapped in jute packaging.\nAs per Section 12 of the act, any product packaged violating the law will be confiscated. And according to Section 14, if any person who violates the law and instead uses artificial wrapping for selling, distributing or supplying products prescribed under the law, they will be subject to imprisonment not exceeding one year or a fine not exceeding Tk 50,000 or both.\nThe Mandatory Jute Packaging Rules, 2013, meanwhile, aims to promote the jute industry and reduce environmental pollution by requiring the use of jute packaging for specific products. This rule stipulates the mandatory use of jute packaging for products like paddy, rice, wheat, corn, fertiliser, sugar, chilli, turmeric, onion, ginger, garlic, pulses, coriander, flour, potatoes, and bran. Legal action can be taken against those who use plastic bags for these products.\nIn 2002, Bangladesh banned the production, use, marketing, and transportation of polythene bags under the Environmental Conservation Act, 1995, due to their harmful environmental impact. Subsequently, initiatives were undertaken to promote eco-friendly jute bags as an alternative.\nHowever, despite all these efforts, the desired results have yet to be achieved due to inadequate enforcement of the rules and law. Due to widespread availability of plastics, many traders resist switching to jute packaging, often perceived as less convenient and more expensive. Unfortunately, harmful polythene remains prevalent, from street vendors to shopping malls. Even small items purchased from the local groceries are frequently given in polythene bags, as are products such as rice, pulses, fish, meat, and vegetables.\nPolythene is non-biodegradable; it damages soil quality. Burning polythene releases harmful carbon monoxide gas into the air. Weak enforcement and a lack of accountability have emboldened violators to continue disregarding the law. According to a World Bank report from December 2021, there was a significant increase in daily plastic waste generation in Dhaka, from 178 tonnes in 2005 to 646 tonnes in 2021. This surge occurred despite the ban on polythene production, which is still carried out by around 1,500 factories, mainly located in Old Dhaka.\nDue to the influence of unscrupulous traders and polythene factory owners, these factories cannot be closed outright. They provide employment to many people, and sudden closure could lead to a spike in unemployment, which would be detrimental to the country's economy. Even if the government decides to close these factories, it must be done gradually and thoughtfully.\nTo ensure compliance, it is crucial that the government amends the existing law to require jute packaging for all mills and imposes stricter penalties, including licence revocation. Furthermore, to enforce the mandatory use of jute packaging, the authorities should increase the number of mobile courts conducting regular inspections. This will send a strong message to violators and deter future non-compliance.\nIt is imperative to revive the lost tradition of jute in our economy and encourage the widespread use of eco-friendly jute products. The Mandatory Jute Packaging Act, 2010 is a significant law, but its implementation needs to be improved. To ensure its success, it is imperative to raise public awareness and encourage active participation of the government, businesses, and citizens. By addressing these issues, Bangladesh can significantly reduce plastic pollution and promote sustainable practices.\nAtiqur Rahaman is apprentice lawyer at the District and Sessions Judge's Court, Dhaka and a human rights activist.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Is jute the answer to our plastic problem?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/jute-the-answer-our-plastic-problem-3872501",
        "news_paper_name": "The Daily Star",
        "publish_date": "17-04-2025"
    },
    {
        "full_article": "We are deeply concerned about the escalating tariff war between the US and China which, according to experts, would not only negatively impact the world's two largest economies but would also likely affect the entire global economy. Our main concern, however, lies with the challenges that Bangladesh's RMG-export-dependent economy could face amid the trade war between these two giants.\nOn April 11, China reportedly imposed a 125 percent tariff on US goods in retaliation for President Trump's increase of duties on Chinese goods to 145 percent. Earlier, on April 2, the US president imposed \"reciprocal tariffs\" ranging from 10 to over 50 percent on almost all countries. Later, he paused the higher tariffs on most countries except China. Between March and April 9, US tariffs on Chinese goods rose from around 20 to 145 percent, while China's tariffs on US goods increased from around 21 percent to 125 percent. Consequently, the Director-General of the World Trade Organization (WTO) Ngozi Okonjo-Iweala warned that \"merchandise trade between these two economies could decrease by as much as 80 percent\"—and since US-China trade together accounts for three percent of global trade, other economies would be negatively affected.\n\nThis is particularly true for countries that depend on these two trade giants. Bangladesh, for instance, relies heavily on the US market for its RMG exports. Although initially, Bangladesh was hit with a 37 percent tariff by the Trump administration, the 90-day pause in tariffs brought some relief. However, if a recession hits the US, demand for clothing will likely decline, thereby hurting our exports. Moreover, the possible collapse of the WTO-led trade order—which has somewhat protected vulnerable economies—adds to the uncertainty facing Bangladesh. If countries are left to fend for themselves, capturing export markets will depend solely on individual countries' negotiating capacities, where more powerful and wealthier nations would have an inherent advantage.\n\nAnother concern for Bangladesh is an impending price war. Bangladesh will not be the only country seeking to diversify its markets if and when a US recession occurs. International competitors are likely to adopt similar strategies. Even local competition to capture a shrinking RMG market is likely to hurt many companies within Bangladesh. It is, therefore, crucial for the government, diplomats, policymakers, and businesses to collaboratively develop innovative strategies to navigate these uncertain times and prepare for global economic turmoil.\nDiversifying products and markets, forging bilateral and regional trade ties, encouraging foreign investments and joint ventures, and enhancing the country's brand value must be explored creatively and with urgency. Proactive measures from all stakeholders are essential to make our economy more resilient to upcoming shocks.\n",
        "headline_1": "We must prepare for all uncertainties",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/we-must-prepare-all-uncertainties-3869726",
        "news_paper_name": "The Daily Star",
        "publish_date": "17-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 17, 2025 00:00:00  \nThe brokers' outfit of the Dhaka Stock Exchange (DSE) known as the DSE Brokers Association (DBA) has rightly complained that with no representation from the secondary market at the last week's investment summit in Dhaka, the step-brotherly attitude of the government towards the country's capital market has once again been underlined. Capital markets the world over serve as a crucial part of an active modern economy because they channel money from those who have it to those who need it for productive purposes. Along with the financial market of a country, its capital market also ensures mobility of money, instead of leaving it idle, to speed up productivity and development. When it comes to the primary market, the news is even direr with no proposal for initial public offering (IPO) in the pipeline. Bangladesh's stock market is the only one to have experienced this ungainly development. \n When small investors shy away from the secondary market with the door of the primary market closed to both this type of investors and large investors including stock brokers, the stock market is sure to wobble and there is no question of bond market generating any interest in investors. The sources of equities and debt securities drying up fast, leaves little scope for a turnaround of the capital market. In fact, the country's largest capital market, the Dhaka Stock Exchange (DSE) and the second largest market, the Chittagong Stock Exchange (CSE) were never allowed to rise up to their potential. The promise they showed in the 90s of the past century was strangulated by manipulation of the capital market first in 1996 and then in 2010-11, leaving both DSE and CSE to limp first and then become totally moribund. Those market crashes eroded investors' confidence in trade in existing securities let alone bond securities. But had the stock market been allowed to gradually develop as a guarantor of savings and investment, as is done all across the world, it could be a viable source of funding for industries, businesses, government's infrastructure development and even individuals' asset procurement such as construction of house and purchase of cars. \nStockbrokers have vented their frustration because as intermediaries in between investors and stock market, they find their business slumping because of the bearish DSE and CSE. Also they have reasons to complain against higher turnover taxes compared to the countries in the region. They are, moreover, required to pay advance income tax (AIT) no matter if they incur losses in business. Had the securities regulator been serious about bringing meaningful changes in the rules and regulations, it should have taken all the stakeholders into confidence to know about their views and opinions. It did not. \nWithout reviving the capital market, no economy can make firm strides. Even the financial market takes the opportunity of investing prudently the funds they receive as savings or products from households or individuals, pensions and retirement benefits from institutions, life insurance companies, charitable foundations and non-financial companies that generate excess cash. Stock market can be a viable option. But unless it is given the proper shape through reform for it to rise up to the challenges of a digital age, it cannot function as a reliable funding source for the businesses and other clients, including the government.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Neglected capital market",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/neglected-capital-market-1744818083",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       April 17, 2025 00:00:00  \nThe government's decision to raise gas prices for new industries by an average of 33 per cent, defying strong opposition from industrialists and business leaders, is being widely criticised for a multitude of reasons. First of all, the industrial gas tariff hike came amid the country's bleak investment scenario and macroeconomic vulnerability, and thereby, may put further damper on new investment. \nCurrently, several key economic indicators that reflect a country's investment scenario are on a downward trend. According to the latest data from Bangladesh Bank, private sector credit growth fell to a decade-low of 6.82 per cent in February, driven by declining loan demand from businesses. Another key indicator reflecting the investment climate is the import of capital machinery, which dropped by 30.10 per cent in the first eight months of fiscal year 2024-25 (July to February), compared to the same period last year. An investment slowdown, weak private credit growth, and reduced imports of capital machinery often go hand in hand.\nForeign direct investment has also experienced a sharp drop in the first half of the current fiscal year. In July-December period of FY2024-25, overseas investment fell by more than 71 per cent compared to the same period in the previous year. \nThese facts and figures make it amply clear that a red light is flashing on the country's investment dashboard. In this context, when investors are already unnerved by high interest rates, prolonged political uncertainty, and persistent high inflation, the increase in utility prices comes as yet another blow. The decision is feared to further dampen the already subdued investment climate, hinder industrial growth, impede job creation, and slow down economic recovery.\nThen again, the new tariff is discriminatory. Introduction of a discriminatory tariff in the industrial sector by none other than a government that came to power riding on the back of an anti-discriminatory movement is the last thing one would have expected. But this is what has just happened.\nAs per the Sunday's announcement of the Bangladesh Energy Regulatory Commission (BERC), new industrial units will have to pay Tk 40 for per cubic metre of gas instead of Tk 30. Similarly, new captive power users will have to pay Tk 42 per cubic metre, which was previously Tk 31.5. The existing consumers will have to pay at the previous rate, but in the case of using gas beyond their sanctioned load, they will have to pay following the new tariff. Moreover, those who have received primary approval for new connections will have to pay new tariff if their usage exceeds 50 per cent of their sanctioned load.\nAs things stand, as per the BERC pricing structure, older factories, along with household, commercial users, and CNG filling stations, will continue to receive gas at previous rates, while new industrial units-as well as existing ones that decide to increase production-will have to pay significantly higher prices for this essential fuel. Business leaders rightly question the rationale behind applying different fuel rates for the production of similar goods within the same sector. Thanks to this discriminatory policy, new businesses will face significant challenges in competing with their established counterparts. Consequently, it will push new investors at the back foot and may even compel them to put their business expansion plan on hold as they will face added cost pressure and uneven competition.\nThe timing of the utility price hike is also being questioned, as it runs counter to the government's recent efforts to boost investment. It came at a time when the government is trying to rope in more foreign investors. Notably, the announcement was made just a few days after the conclusion of a major investment summit in Dhaka attended by over 500 foreign investors from around 50 countries. Many argue that it could potentially send a wrong signal to potential investors about the country's policy unpredictability.\nThe previous Awami League government, with the promise of providing uninterrupted supplies, had raised gas tariffs for small and cottage industries by 178.29 per cent to Tk 30 per cubic meter from Tk 10.78 in February 2024. Rates for captive power plants, small power plants and merchant power plants were raised by 87.50 per cent to Tk 30 per cubic meter from previous Tk 16. Despite this substantial price hike, the government failed to deliver the promised uninterrupted gas supply.\nBangladesh has witnessed a substantial hike in energy prices, apparently due to the policy failures of the previous government. Instead of prioritising the exploration of new gas fields, the government chose to import expensive LNG-allegedly to benefit certain cronies in the energy sector. To make matters worse, when LNG imports began in 2018, global gas prices were still at tolerable levels. However, the Russia-Ukraine war caused prices to surge worldwide. This, combined with exchange rate volatility and a persistent dollar crisis, has further aggravated the situation for Bangladesh.\nNow, the pressing question is whether the current interim government will continue with the same flawed energy policies of its predecessor or chart a new course - one that would incorporate forward-looking strategies and prioritise the optimal utilisation of the country's onshore and offshore gas reserves.\nAnother critical challenge is the excessively high rate of system loss. At present, the technical loss rate of gas in Bangladesh stands at around 3 per cent-far above the international standard of 0.20 to 0.30 percent. Allegations have it that gas stolen through illegal connections is being passed off as technical loss. In just the first six months of the current fiscal year, 1.37 billion (137 crore) cubic meters of gas were lost due to system loss. With Petrobangla spending Tk 79.34 to import and supply each cubic meter of gas, the financial loss from this wastage amounts to Tk 108.7 billion. Reducing this excessive level of system loss could save the country billions. This is where the authorities should focus instead of burdening industries with steep tariff hikes that threatens future growth prospects.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Gas price hike couldn't come at a worse time",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/gas-price-hike-couldnt-come-at-a-worse-time-1744818143",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 17, 2025 00:00:00  \nPahela Baishakh is more than just the Bengali New Year-it's a celebration of culture, identity, and togetherness. Every year, we see millions of people across Bangladesh welcome the day with colourful processions, traditional foods, folk music, and vibrant clothing. Yet, despite all this cultural richness, we've hardly positioned Pahela Baishakh as a tourism product on the global stage.\nWhile countries around the world turn their festivals into global attractions-think of Holi in India or Songkran in Thailand-we've yet to do the same. Foreign tourists are often unaware of the cultural value and community spirit that Boishakh brings. With better planning, promotion, and infrastructure, this single festival could drive thousands of travelers to Dhaka, Pabna, Sylhet, and other culturally active regions.\nThere is real opportunity here-not just for hotels and tour operators, but also for artisans, street vendors, musicians, and local businesses. Pahela Baishakh could serve as a cultural export that strengthens both our economy and national image.\nThe world is curious about authentic experiences. Let's open our doors a little wider and give them a reason to discover Bangladesh.\nMd Habib Ullah\n(BBA in HRM)\nSchool of Business and Economics\nNorth South University\nhabib.ullah@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Baishakh celebration: An untapped tourism opportunity",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/baishakh-celebration-an-untapped-tourism-opportunity-1744818170",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 17, 2025 00:00:00  \nEight months have passed since Professor Dr. Muhammad Yunus took the helm of the country. His extraordinary leadership skills have already started to make an indelible mark. The country has been ravaged by decades of bickering violent politics. In this fragile landscape, every step taken by the current government feels like a battle to restore, reconstruct, and revive the soul of Bangladesh. Years of bad governance have normalised a fragile economy, oppressive policing, a rigid electoral system, and the forced disappearance of citizens, all underpinned by rampant embezzlement.\nThis student-citizen mandated interim government is duty-bound to address these critical issues through careful, transformative reforms before handing over power to an elected political party through a fair and transparent election. Initially, the administration grappled with restoring law and order, curbing surging inflation, and countering misinformation campaigns orchestrated by defeated political forces-all the while working to maintain public trust.\nYet, under the thoughtful leadership of Dr. Muhammad Yunus, the tides have begun to turn. Within this brief period, several decisive actions have garnered widespread admiration. These include vigilant market monitoring by the DNCRP to protect consumers from exploitative profiteering, coordinated joint-force operations to quell unrest, and the mobilisation of traffic courts to enforce order on the streets. These initiatives have not gone unnoticed-especially among the country's netizens, many of whom have passionately voiced their support for extending the government's tenure by at least five more years, hoping to solidify the nation's image both at home and abroad.\nIn fact, some supporters have even threatened to launch a \"March for Yunus\" if the interim government yields to political pressure and rushes into elections in 2026. \nOn the other hand, the Bangladesh Nationalist Party (BNP) has been demanding an expedited election process since August 2024, calling for the restoration of a democracy they claim has long been denied. Other political groups, however, urge Dr. Yunus's government to remain in place longer and lead the way in executing broader reforms before stepping aside.\nThus, the debate continues to intensify. Should we push for a rapid return to electoral politics, or should we first allow for deep, lasting transformations? The country stands at a crossroads, watching intently as this pivotal question shapes the days to come.\nMd Sajidul Islam \nStudent, University of Dhaka \nmdsajidulislam11@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Election or reform?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/election-or-reform-1744818197",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-04-2025"
    }
]