[
    {
        "full_article": "The attack on the Jaffar Express, on March 11, in a mountainous region of Balochistan, is one of the most daring attacks by the Baloch Liberation Army (BLA) in recent times. The BLA’s move, demanding the release of Baloch militants from jails, was met with a swift military response from Pakistan. According to the Pakistani authorities, 354 passengers were rescued after a 36-hour long stand-off in which 26 security personnel and passengers and 33 rebel fighters were killed. Pakistan has accused its “eastern neighbour” (India) and “Afghan handlers” of helping the Baloch separatists. But beneath such allegations lie Pakistan’s growing internal security vulnerabilities. The BLA, now the most powerful separatist group from the restive Balochistan province, has been carrying out a host of attacks. In November 2024, it claimed a suicide bombing at a train station in Quetta, the provincial capital, that killed at least two dozen people. It has also targeted Chinese workers in repeated attacks in the province. And with each attack, the Pakistani military has responded with heavy force. But it seems clueless on how to deter the attacks and bring stability to the region.While visiting Quetta after the Jaffar Express attack, Pakistan Prime Minister Shehbaz Sharif made a rare acknowledgement that the lack of development in Balochistan was an obstacle in eliminating terrorism. Baloch separatists have long argued that the Pakistani state, dominated by Punjabis and Sindhis, has historically ignored the Balochis. The BLA and other Baloch nationalist groups accuse the federal government of plundering Balochistan’s resources, and blame security agencies for the forced disappearances, torture and extra-judicial killings of Baloch civilians and rebels. Pakistan’s reliance on military campaigns in Balochistan has only reinforced the narrative of the separatists — of the province being treated differently by Islamabad-Rawalpindi. Pakistan has blamed India and the Islamic Republic of Afghanistan (before the 2021 Taliban takeover) for helping Baloch rebels. It also welcomed the return of the Taliban to Kabul as a moment of Afghanistan “breaking the shackles of slavery”. But it was a bonhomie that did not last. Today, Pakistan says Baloch separatists and the Tehreek-e-Taliban Pakistan (TTP) are operating from safe havens in Taliban-run Afghanistan. Together, the TTP and Baloch rebels pose grave security challenges to Pakistan at a time when it is battling economic uncertainty and political instability. But Balochistan is a clear example that a military response alone does not bring peace and stability. If Pakistan wants to calm its restive regions, it should address the political and economic problems that fuel instability and insurgency. Published - March 17, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Pakistan\n                    \n                            /                      \n                        \n                        act of terror\n                    \n                            /                      \n                        \n                        railway\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Afghanistan\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        security measures\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        economy (general)",
        "headline_1": "​Terror on the train: on Pakistan and its Balochistan province",
        "headline_2": "Pakistan must solve Balochistan’s problems, not blame outsiders",
        "link": "https://www.thehindu.com/opinion/editorial/terror-on-the-train-on-pakistan-and-its-balochistan-province/article69337069.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-03-2025"
    },
    {
        "full_article": "The arrest of former President of the Philippines Rodrigo Duterte on a warrant issued by the International Criminal Court (ICC) marks a rare success in the ICC’s attempts to make senior political figures, especially those who have held or still hold public office, accountable for their crimes. However, it has to be acknowledged that only a set of favourable circumstances led to Mr. Duterte’s arrest, and his being flown to The Hague: the warrant was executed by the government headed by President Ferdinand Marcos Jr., and the decision may have been the fallout of his differences with Vice-President Sara Duterte, Mr. Duterte’s daughter who is embroiled in impeachment proceedings. ICC warrants invariably remain unexecuted, unless national governments cooperate with the ICC, a feature that often delays and stymies most ICC prosecutions. Mr. Duterte has been accused of “the crime against humanity of murder”. The reference is to his ‘war on drugs’, a campaign of state-backed killing when he was Mayor of Davao City, and later President. The ICC is investigating the situation between 2011 and 2019, as he formally pulled his country out of ICC membership. However, the Pre-Trial Chamber has determined that despite the country not being a state-party now, it has jurisdiction to try crimes committed by individuals during the time the Philippines was a party.The ICC was created by the Rome Statute in response to a need to have a permanent court, instead of ad hoc tribunals, for war crimes and crimes against humanity. It has no power of enforcement and is dependent on the national interests of big powers. It has often been accused of focusing on Africa, moving mainly against warlords and leaders in conflict zones. Warrants against leaders such as Vladimir Putin and Benjamin Netanyahu are seldom executed. In addition, some member-states have also expressed an inability to execute arrest warrants when those individuals visit their countries, while some leaders avoid visiting countries of state-parties. Added to this is the open hostility of the United States that frequently threatens the ICC with punitive measures if it moves against its nationals or allies. Fortunately, the ICC still exists as an international judicial institution mainly because it tries only individuals and not states. It has also rendered some significant verdicts on its own jurisdiction, the most important being the ruling in respect of Palestine that it can order investigations into crimes committed by nationals of both state-parties and non-state-parties on the territory of a state-party. Thus, a mere refusal by a country to ratify the Rome Statute or not being a party to it may not be relevant to any decision by the ICC to investigate and prosecute any individual. Published - March 17, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        arrest\n                    \n                            /                      \n                        \n                        Philippines\n                    \n                            /                      \n                        \n                        international court or tribunal\n                    \n                            /                      \n                        \n                        crime\n                    \n                            /                      \n                        \n                        murder\n                    \n                            /                      \n                        \n                        narcotics & drug trafficking\n                    \n                            /                      \n                        \n                        war\n                    \n                            /                      \n                        \n                        African Union\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        Palestine",
        "headline_1": "​Rare success: on the International Criminal Court and Duterte arrest",
        "headline_2": "The International Criminal Court is still dependent on political interests to pursue its work",
        "link": "https://www.thehindu.com/opinion/editorial/rare-success-on-the-international-criminal-court-and-duterte-arrest/article69337077.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-03-2025"
    },
    {
        "full_article": "Have Maharashtra’s farmer suicides become a blind spot for the state? It’s not as if the crisis is unsolvable\nYet another farmer died by suicide in Maharashtra last week. Kaila­­sh Arjun Nagare (43) was a farmer activist in Vidarbha, fighting for irrigation coverage of 14 villages. He was on a 10-day hunger strike last year. Maharashtra has been the epicentre of India’s farmer crises. But lessons are never learnt, although the scale of the tragedy and reasons for it have been clear for over a quarter of a century. \nBetween Jan 2015 and March 2019, Maharashtra alone witnessed 12,616 farmer suicides. By 2023, it’s estimated, seven farmers daily were taking their own lives in the state. The greater tragedy is that farmers’ protests and policy wonks remain centred on the triad of MSP, loan waivers and dizzying numbers of schemes from which those small/medium farmers who most need the govt infra – irrigation to seed to storage – seem to slip out of coverage. Meanwhile, real threats to farmers’ income have multiplied. \nTake irrigation. Just 20% of Maharashtra has irrigation coverage – that means 80% farming is dependent on rains. Prosperous western Maharashtra (where sugarcane, wheat, grapes are grown) has canal coverage while Vidarbha, Marathwada that grow water-intensive cotton, soybean, pulses, apart from millets – remain neglected with barely 10-12% coverage. For farmers heavily dependent on rainfed farming, droughts play havoc, while areas with borewells steadily deplete groundwater reserves that erratic rainfall cannot replenish. \nClimate change, water scarcity, rising input costs (seeds, fertilisers, irregular supply of even “free power”, labour), deficient monsoons, market volatility,  limited storage capacities – these hit all but the top tier of big farmers. None of these are insurmountable challenges. But all govts have on offer are debt waivers. Farmers’ incomes can be shored up by efficient water management and adoption of less water-intensive tech. Micro-irrigation projects clearly aren’t reaching farms in Vidarbha and Marathwada effectively. A desperate hunger strike in 2024 by one farmer wasn’t enough to catch govt attention. Contrast this with the alacrity of govt response to hunger strikes by quota activist Jarange Patil.\n\n",
        "headline_1": "Killing fields",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/killing-fields/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-03-2025"
    },
    {
        "full_article": "T’gana CM’s one more neta whose views on free speech are unmoored from Constitution\nWomen, and men too, are “stripped and paraded” with sickening regularity in this country. It’s a crime as old as mobs, calculated to crush victims and their families with shame. Enough Indians still remember the backstory of 1981’s Behmai massacre. But Telangana CM Revanth Reddy seemingly wants to write this “punishment” into statute. Addressing the state assembly on Saturday, he warned that anyone “commenting on women in my family” would be stripped and paraded. A sitting CM – sworn to “bear true faith and allegiance to the Constitution of India” – endorsing crimes as punishments is deeply troubling. Not less so when he puts “my family” above the state. \nIn trying to project himself as a strongman, Reddy has done his state’s people a terrible disservice, as mobs will feel emboldened to dispense their brand of justice. He’s also done a great disservice to the cause of free speech – guaranteed by the Constitution but constantly attacked by the political class and police. Reddy’s angry because two women YouTubers posted a video in which interviewees abused his family and him. They were arrested on March 12. Ideally, there should have been a defamation case, not an arrest. But Reddy wasn’t even satisfied with arrests. He seems to be using the case as a pretext to muzzle individuals “posing as journalists”. He wants media organisations to define the word “journalist”, and submit lists of those who qualify. “Others will be treated as criminals…”\nIndian law does not privilege journalists over other citizens in the matter of free speech. Everybody has a right to have their say, with “reasonable restrictions”, which range from decency and defamation to friendly relations with foreign states. Some of these restrictions are questionable. But that threat to free speech pales before the one posed by police action, which is often prodded by politicians. Circumstances under which free speech can be restricted can only be determined by application of judicial thought. And cases where police action can start are determined only by the Constitution’s list of ‘restrictions’, not by complaints of neighbours or by outrage of moralists or by anger of politicians.\n\n",
        "headline_1": "The Reddy Line",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-reddy-line/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-03-2025"
    },
    {
        "full_article": "Fictional minutes of an honour-able meeting\nSalim didn’t get Anarkali in reel life. Kishore Kumar got her in real. And, in the 1958 hit Chalti Ka Naam Gaadi, the ‘motor mechanic’ even broke into her house in the dead of night to recover ‘paanch rupaiyaa baarah aana’. Among his countless fans, Kishore da not being conferred a Padma award is as big a topic of discussion as that elusive, princely amount, which he never got though Madhubala came to the Ganguly brothers’ garage to pay up the same. \nEven though the eccentric genius will remain king of hearts forever, award or no award, for academic purposes this reporter spoke to highly unreliable sources who recount what happens at the annual Padma award discussions when Kishore da’s name is discussed. It goes like this: \nAnglicised Babu with Oxbridge degree | That very famous singer, what’s his name, has not got a Padma so far. Maybe we should give it to him. I am told he sang well. Every year at the reunions all my friends sing his songs after a few drinks.\nDesi Babu | Very right, Sir. I think you are referring to Kishore Kumar. Great singer.\nAB | So, it’s him this year.\nDB 2 | Sir, there’s a procedural issue. We’ve not been able to figure out for which of his skills he should get an award – singing, acting, production or direction. A high-level committee was set up to determine this in 1989. Their next meeting is in a couple of months. Its report is still awaited and we hope to get it soon.\nDB 3 | Sir, All India Radio had banned Kishore songs during the emergency as he had refused to toe the then govt line. Honouring him now may set a bad precedent. Any great person taking ‘panga’ with govt would then expect the honour he/she deserves either ‘zindagi ke saath or zindagi ke baad’. In life or afterwards.\nNeta ji | Kishore was born in Madhya Pradesh and lived in Mumbai. Perhaps we should consider his name closer to election in those places.\nAB | Hmmm. Best to wait for the 1989 committee report. I have been informed a retired IAS, who was joint secretary when I joined the service, heads it now and the position comes with minister of state rank. We must give him some time. Let’s move to the next name now.\n\n",
        "headline_1": "Yodelling Kishore da",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/yodelling-kishore-da/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-03-2025"
    },
    {
        "full_article": "Yes, the crowds line up for women’s cricket\nToday, the finale of the Women’s Premier League, season 3, will be played at Brabourne stadium, Mumbai. Where’s the buzz been? At the stadiums, across four cities. In Bengaluru, enthusiastic crowding for entry has led to comparisons with kumbh mela. RCB fandom at WPL has given the IPL one a run for its money. Vadodara has shown avid home support to Ashleigh Gardner led Gujarat Giants. Mumbai’s been a keen cheerleader since season 1, when it played the solo host. Lucknow’s getting into the game. But the question in all this is, how much do we expect how fast?\nThe first match of the football WSL in England in 2011 was played in front of just 2,500 people. Today, it has a $84mn broadcast deal. Glass-half-fullers say this is still a fraction of the Premier League. But besides being played across schools and varsities, women’s football there is now a proper career across playing, coaching and management.\nHarsh quizzing about when WPL will deliver a Champions Trophy is really missing the point – a nine-year-old girl asked by TOI about her cricketing hero, named pacer Renuka Singh. Women’s cricket is now developing a franchise following. A deeper bench of players are becoming idols. Whether the bench is deep enough to expand to more teams and cities next year has to be objectively assessed. But to assess how WPL’s done so far, just listen to the cheers tonight.\n\n",
        "headline_1": "WPL wins",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/wpl-wins/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-03-2025"
    },
    {
        "full_article": "We are what we breathe. Now imagine that breath—something we do without thinking—could be quietly slashing years of our lives. That's no idle fear: air pollution claimed 8.1 million lives in 2021 alone, roughly one in every eight deaths worldwide and one in three in South Asia, according to the latest Global Disease Burden report. It's the second deadliest health risk on the planet, trailing only high blood pressure, and it spares no one.\nThe threat comes in two forms: the polluted air filling our streets and the smoke lurking indoors from cooking fires or dusty homes. Over 90% of us breathe air so toxic it acts as a slow poison, says the World Health Organization. Tiny particles—PM2.5—slip past our defenses, wreaking havoc: 48% of chronic lung diseases like COPD tie back to this particulate matter, while 34% of preterm births in 2021—babies arriving too early—link to the air mothers breathe.\nDhaka has some of the deadliest air pollution in the world. Routinely among the world's most polluted cities, its air is a stew of brick kiln soot, exhaust fumes, construction dust, and factory emissions, whipped up by runaway urban sprawl. Recent reports show its Air Quality Index (AQI) often topping 200— \"very unhealthy\"—a daily gamble for lungs and hearts. The Clean Air and Sustainable Environment (CASE) project tracked the toll: In 2018, 75% of days were unfit to breathe. Even in 2020, over half stayed hazardous. For millions in Dhaka, it's coughs that won't quit, cancers that bloom silently, and hearts that give out too soon.\nIn 2024, Dhaka ranked 13th among the most polluted global cities based on AQI-US standards. This year, in January and February, Dhaka consistently ranked first in the list of most polluted global cities for 11 days when AQI exceeded 243, with the highest of 392 on February 10, 2025, surpassing even Delhi and Lahore, two of Asia's most polluted cities. From 25th January 2025 to 23rd February 2025, IQAIR data shows Dhaka's air was unhealthy for 18 days, very unhealthy for 15 days, and hazardous for 1 day. During this period, the average AQI of Dhaka City was 203, and the average PM2.5 concentration was 124 µg/m3. This PM2.5 concentration is eight times the 24-hour standard (15 µg/m3) and 25 times the annual standard (5 µg/m3) set by the WHO.\nThe biggest polluters\nIt is critical to pinpoint the sources of air pollution correctly. When it comes to pointing out the causes of Dhaka's toxic air, most reports and features attribute it singularly to the brick kilns surrounding the city. While brick factories play their part, the actual causes remain largely unexplored due to a lack of comprehensive research. National and international studies provide valuable insights into how different sectors contribute to Dhaka's air pollution. For example, a survey by the Norwegian Institute for Air Research (2015) identified industrial emissions, transportation, and fossil fuel combustion as the primary culprits behind the city's toxic air. The report reveals that these three sectors together release 19,000 tons of Particulate Matter (PM2.5) into Dhaka's air annually, with industries alone contributing 17,556 tons of PM2.5 each year. Industries are also the leading source of Sulfur Oxide (SOx) emissions, releasing around 60,000 tons annually. Additionally, transportation is the major emitter of Nitrogen Oxides (NOx), at 7,500 tons per year, followed by industries at 2,000 tons. In terms of Carbon Oxides (COx), transportation (18,450 tons/year) and fossil fuel combustion (12,350 tons/year) are the dominant sources.\nAnother report, the Bangladesh National Air Quality Management Plan 2024-2030, identified six sectors of PM2.5 pollution in Dhaka City: household combustion, power plants, brick kilns, solid waste, road dust, and transport. Among these, household combustion contributes the most (28%) and transport the least (4%), according to the document. The report states that brick kilns contribute only 13% of Dhaka's total PM2.5 pollution, yet surprisingly, it does not mention industrial emissions at all.\nA significant discrepancy shows up when comparing the two studies. While the Norwegian study identifies industry as the major contributor to PM2.5 pollution, the national report attributes the largest share to households. Additionally, the national report does not provide data on gas pollution, and neither report accounts for ozone pollution. These discrepancies and gaps highlight the urgent need for a comprehensive study.\nSeasonal patterns of pollution in Dhaka's air\n\nAir pollution in Dhaka also exhibits seasonal variability, with significantly higher levels in the winter months (December–February) and lower levels in the monsoon season (June–September). However, in the summer and post-monsoon seasons, although the levels of particulate matter and gases remain lower than in winter, they still exceed air quality standards set by the World Health Organization (WHO) and Bangladesh's National Air Quality Standards. A similar seasonal pattern can be observed in other major cities nationwide.\nWeather phenomena and the intensity of human activities influence the seasonal fluctuations in air pollution. In winter, limited rainfall, increased construction activities, and sporadic sand filling are the primary contributors to elevated pollutant levels in Dhaka. Additionally, northwestern winter winds carry transboundary pollutants and smoke from brick kilns in northern and northwestern Dhaka over the city, pushing air quality to highly toxic levels.\nDuring this period, not only does particulate pollution increase, but the emission of toxic gases—such as NO2, SO2, CO, and O3—from proliferated industries in the city also reaches its peak concentration in the air. However, as the monsoon begins in June and continues through September, heavy rainfall reduces the levels of both gases and particulate matter in Dhaka's air, slightly improving air quality and making it breathable.\nDespite slightly better conditions during the monsoon, ground-level ozone (O3) concentrations remain elevated in summer due to reactions between NO2, emitted by vehicles and industries, and ultraviolet (UV) radiation from the sun. This lower atmospheric Ozone (O3) is particularly harmful to individuals with respiratory conditions. Satellite-based analyses by the Bengal Institute reveal clear seasonal trends in the concentration of major pollutants in Dhaka and its surrounding areas.\nProliferation of brick kilns in and around Dhaka City\nBrick manufacturing in and around Dhaka City continues to be the most cited polluting culprit. While in 1990, there were around 250 brick kilns in the proximity of the city, the number grew three-and-a-half-fold in 2000, driven by the increasing demand for construction projects. Over the past two decades, the number of brick kilns surged to around one thousand. These brick kilns now encircle the city along the five rivers: Buriganga, Turag, Dhaleswari, Shitalakhya, and Bangshi. The availability of suitable textured soil, extensive open lands, easy waterway transportation, and increased city demand are key factors for their locational developments.\nRecent satellite imagery analysis by the Geographic Research Unit of the Bengal Institute identified 389 operational brick kilns within the RAJUK boundary of Dhaka, with an additional 600 kilns located within 20 kilometers of the RAJUK area.\nSmoke containing NO2, CO, SO2, and particulate matter (PM) from coal combustion in these brick kilns, especially during the winter months, is carried over Dhaka City by the northwestern winds, leading to a significant deterioration in Dhaka's air quality.\nTransboundary air pollution transmission\nNot all of Dhaka's air pollution originates within the city itself. During the period from late October to December, the great Indo-Gangetic Plain (an area of 700,000 sq. km.) experiences a dense cloud of smoke in its air, mainly due to stubble burning. Farmers in northern India burn paddy straw after harvesting rice, causing this extremely polluted air, mixed with smoke and particulates, to engulf the densely populated plain, covering Uttar Pradesh, Bihar, and Bangladesh. The cloudy haze over this region is also contributed by more than 100 coal-fired power plants operational throughout the year in northern India. Some studies confirm that Delhi's Air Quality Index (AQI) exceeds 400 during that time, which requires shutting down academic institutes and calls for people to work from home.\nAn article published by the World Bank on February 3, 2023, says that around 30% of the pollution in Bangladesh's bigger cities originates in India. As winter sets in, the northwestern wind carries fine-particle-laden smoke from the extensive Indo-Gangetic region of India towards the southeast, which at that time looks like a river of haze following the Ganges River's flow direction towards Bangladesh. This massive cloud of dust spills out into the Bay of Bengal, crossing the entire sky of Bangladesh.\nREMEDIATIONS AND MEASURES: WHAT WE CAN DO\nGiven Dhaka's persistently hazardous air pollution, remediation is neither straightforward nor quick. Addressing air pollution requires coordinated efforts from the government, industries, businesses, and citizens. While various measures must be implemented across multiple sectors with both short- and long-term goals, the ultimate responsibility lies in comprehensive urban and regional planning that prioritizes the health and well-being of the city's residents. Below is a summary and diagram of the key remediation measures that need to be undertaken.\nEnhancing monitoring and recording systems\nProper monitoring is the first crucial step in addressing this dire condition affecting the city's health and well-being. The government of Bangladesh initiated the Clean Air and Sustainable Environment (CASE) project to monitor air pollution across the country. Under this project, to provide real-time air quality information, the DoE installed 16 Continuous Air Quality Monitoring Stations (CAMS) in eleven cities: Dhaka has 4 stations, Chattagram has 2, and Gazipur, Narayangaj, Narsingdi, Khulna, Barishal, Rajshahi, Sylhet, Rangpur, Cumilla, and Mymensingh, each has one. All of these CAMS record concentrations of PM2.5, SO2, NO2, O3, and CO in the surrounding air of the station location based on which daily Air Quality Index (AQI) data is provided. However, 16 stations are insufficient to assess national air quality, and four stations alone cannot accurately represent Dhaka's air quality. If there are no monitoring stations installed in areas like industrial and other active zones, how can we measure the quality of air for those areas? How can meaningful management strategies be developed without detailed spatial air quality data for all those zones?\nBangladesh launched the National Air Quality Management Plan (2024–2030) (NAQMP), developed by the Ministry of Environment, Forest, and Climate Change and the Department of Environment. The primary goal of the NAQMP is to meet the interim target for annual PM2.5 set by the World Health Organization (WHO) while meeting the targets outlined in the national air quality standards: (1) reducing PM2.5 concentration in the air of the entire country to 15µg/m³ and in Dhaka's air to 30µg/m³ by 2030, and (2) gradually increasing Good and Moderate AQI days annually. Focusing on meeting those targets, a national committee on air pollution control was formed to implement Air Pollution Control Rules (2022) and coordinate with relevant agencies on specific interventions to comply with the new rules. However, this management plan has not been effective due to several resource constraints and limitations. A critical gap in the NAQMP is that it provides a set of suggestions for different entities polluting the air without setting up strict obligations for them. Another weakness is the absence of regulations in the NAQMP to control toxic industrial emissions.\nDisease and pollution correlation\nTo identify the health impacts of air pollution, it is essential to develop a comprehensive locational database of respiratory diseases. Continuous monitoring of patients' respiratory health with their locational information can be collected throughout the year. Once the database is created, it can be correlated with pollution data to understand how people are affected by air pollution and at what level, according to specific areas.\nIssuing air pollution forecasts\nAnother important measure is to provide 2/3 days of air pollution forecast information so people can take cautionary measures in advance. Preparing this forecast model also requires intensive spatial data, as mentioned before.\nControlling industrial emissions\n\nUpgrading factory technologies and shifting to clean energy utilization in factories need to be encouraged through tax exemptions. In addition, industries should install indoor air purification systems for the health benefits of the people working there. Since brick kilns significantly worsen Dhaka's air quality, particularly in winter, alternative locations for these factories should be explored. If relocation is not feasible, improved production methods, such as the Zigzag 2.0 technology proposed by ICDDR,B, must be adopted.\nRegulating vehicular emissions and promoting sustainable transportation\nInvesting in low-emission public transportation infrastructure, such as buses, trams, and metro systems, can substantially reduce emissions by decreasing dependence on private vehicles. This shift will also reduce travel times, minimizing residents' exposure to traffic-related pollution. Additional measures, such as limiting vehicle speeds, designating parking zones, banning vehicles that emit black smoke, restricting heavy-duty vehicles during the daytime, phasing out expired vehicles or upgrading them with particulate matter reduction devices, implementing stringent regulations for diesel-powered vehicles, and promoting environmentally friendly transportation options, can further curb air pollution from traffic. Improving current motor vehicle exhaust technologies to ensure more efficient combustion will also contribute to reducing emissions. In addition, Dhaka's footpaths need to be more pedestrian-friendly to encourage people to walk short distances. In summary, Dhaka's traffic system needs a complete overhaul to create a more sustainable, pedestrian- and eco-friendly urban environment.\nManaging construction, road dust, and open sands\nThe rapid urbanization of Dhaka has led to excessive dust pollution from construction sites and unpaved roads. Implementing mandatory dust control measures—such as covering construction materials, using water sprinklers, and installing dust barriers—can minimize airborne particles. Some studies identified that open sand can travel more than 40 kilometers with wind, and so dust pollution control mechanisms can be developed to reduce particulate pollution from the open sand areas (approximately 17,700 acres) in Dhaka City.\nProtecting and expanding urban blue and green infrastructures\nTrees and green spaces act as natural air filters, absorbing pollutants and improving air quality. Expanding parks, rooftop gardens, and roadside plantations can mitigate pollution and heat while also providing ecological benefits. Implementing urban forestry projects, particularly in high-traffic and industrial areas, can have a long-term positive impact on air quality. Developing a green tree belt around the city on the riverbanks can be a good option to sink dust and gas pollutants and provide city dwellers with a green ambience.\nImplementing strict waste management policies\nThe burning of solid waste, particularly plastic and organic materials, releases harmful pollutants, including PM, CO, and CO2, into the air. Establishing proper waste segregation, promoting recycling, and enforcing bans on open-air burning should be the top priorities to reduce emissions from waste disposal. Encouraging composting and biogas production can provide eco-friendly solutions and generate alternative income sources.\nImproving indoor air quality\nNumerous studies have shown that indoor air quality can be just as poor as outdoor air quality. Polluted air from outside can easily infiltrate homes, exposing residents to the same harmful contaminants. Even in air-conditioned rooms, individuals are not immune to toxic air, as air conditioners primarily cool the air but do not filter out pollutants. Installing air purifiers in homes, schools, and workplaces can improve indoor air quality. Additionally, maintaining indoor plants such as aloe vera and spider plants can naturally improve air quality. Promoting cleaner cooking alternatives, such as LPG, electric stoves, or improved biomass stoves, can reduce household air pollution.\nAuthors: Sanjoy Roy (Coordinator, Geographic Research Unit, Bengal Institute); A K M Tariful Islam Khan (Senior Manager, Development and Communications, ICDDR,B); Dr. Md. Mahbubur Rahman (Project Coordinator, Environmental Health and WASH, HSPSD, ICDDR,B); Nusrat Sumaiya (Director, Research and Design, Bengal Institute); Arfar Razi (Coordinator, Academic Program, Bengal Institute); Israt Jahan Ria (Research Associate, Bengal Institute); Rida Haque (Research and Design Associate, Bengal Institute); Mashiat Iqbal (Research and Design Associate, Bengal Institute); Shaikh Farhana Hossain (Research Associate, Bengal Institute); Atik Ahsan (Senior Programme Manager, Environmental Health and WASH, HSPSD, ICDDR,B); Meftah Uddin Mahmud (Research Investigator, Environmental Health and WASH, HSPSD, ICDDR,B)\nAdvisors: Dr. Tahmeed Ahmed (Executive Director, ICDDR,B); Kazi Khaleed Ashraf (Director General, Bengal Institute)\n",
        "headline_1": "What we know and what we can do",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/focus/news/what-we-know-and-what-we-can-do-3850041",
        "news_paper_name": "The Daily Star",
        "publish_date": "17-03-2025"
    },
    {
        "full_article": "The interim government's move to increase power and fertiliser subsidies in the revised FY25 budget by 57.9 percent highlights, once again, the prevailing mess in the power sector. There had been increases in subsidies during Awami League's tenure too, most of which ended up lining the pockets of vested interest groups and eventually increasing the debt burden of the nation. The interim government seems to be following the same prescription, albeit for different reasons. Reportedly, it is looking to increase the power subsidy to Tk 62,000 crore (a 55 percent rise) and the fertiliser subsidy to Tk 28,000 crore (a 64.7 percent rise).\nA report by this daily quoted a finance ministry official who explained that the power subsidy increase is being considered so as not to raise power prices during this time of high inflation and to pay off the huge arrears carried over from the previous regime. While we appreciate that the authorities took into account consumers' interests and refrained from increasing prices, they could have, for our long-term benefits, taken measures to address the institutional inefficiency of the sector that are draining resources. It is estimated that as much as Tk 11,444 crore could have been saved by reducing power production costs by 10 percent, which in turn could have kept the subsidy in control.\nIn fact, a recent study by the Institute for Energy Economics and Financial Analysis (IEEFA) found that the Bangladesh Power Development Board (BPDB) can save Tk 13,800 crore annually—a loss currently covered by government subsidy—just by fixing some core problems. Its recommendations included shifting half of the existing industrial demand to the grid, which is currently met by captive generators, and adding 3,000 megawatts (MW) of renewables, reducing load-shedding, as well as limiting transmission and distribution losses.\nDuring Hasina's tenure, 81 percent of the power subsidy—Tk 39, 406 crore in the revised budget for FY2023-24—was spent on the rented power plants to pay for capacity charges, even when those plants were sitting idle. It is time to critically revisit the collusive deals of the last regime and reduce reliance on rental power plants. According to IEEFA, transitioning to electric systems from gas-driven appliances, like boilers, will help increase BPDB's revenue from selling additional energy while reducing capacity payments to idle plants.\nThe arrears left by the previous regime may take time to repay, but the interim government should take prudent measures to rectify the situation. Every effort must be made to ensure that the nation is not burdened with additional debt. We can no longer afford inefficiency in the power sector or allow it to run without accountability.\n",
        "headline_1": "Reform power sector to reduce subsidy",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/reform-power-sector-reduce-subsidy-3849656",
        "news_paper_name": "The Daily Star",
        "publish_date": "17-03-2025"
    },
    {
        "full_article": "Out of curiosity, take a moment to review a recent faculty recruitment advertisement from any department of Dhaka University, the oldest and most prestigious university in Bangladesh. You will likely find yourself both perplexed and disheartened, especially if you are familiar with modern academic recruitment practices of renowned universities worldwide. While leading institutions across the globe prioritise academic merit, innovation, and inclusivity, DU's recruitment process seems frozen in time, bogged down by outdated practices that stifle progress and deter qualified candidates, insisting on hard copy applications and pay orders to rigidly evaluating high school results for faculty positions. For an institution of such historical significance, this raises serious concerns about DU's commitment to academic excellence and its ability to evolve with the ever-changing demands of higher education. It is deeply disappointing to see how regressive and out-of-touch the recruitment process remains for such a venerable institution.\nHere's a breakdown of the requirements and why they raise serious concerns:\nIn an era of online application systems and streamlined recruitment processes, requiring a \"prescribed form\" feels like a relic of the past. Modern institutions worldwide have embraced digital platforms that allow applicants to upload their credentials seamlessly. Why is DU clinging to such outdated practices?\nA university, by definition, must embrace universality. Restricting applications to Bangladeshi citizens goes against the global standards of academia. World-class universities attract the best minds regardless of nationality. If DU aspires to compete on the global stage, it must abandon parochial policies like this one.\nThis requirement is nothing short of laughable. In what country does a university consider high school (SSC and HSC) exam results to hire professors? Such criteria might make sense for certain vocational positions but not academic faculty roles. A person's capabilities as a researcher or educator should not be judged by how they performed in their teenage years. It is akin to asking a seasoned pilot about their high school physics grade.\nGenerally, a PhD is the minimum qualification for university faculty. Yet, DU's job posts treat having a PhD and publications as a bonus. This approach undermines the value of advanced research and perpetuates mediocrity. Shouldn't the focus be on the quality of a candidate's PhD, research contributions, and teaching potential?\nWhy is the university demanding money from applicants before even considering them for a position? Are they offering training or benefits upfront? Globally, universities invest in attracting the best candidates, not the other way around. This requirement is not only absurd but also exploitative, especially considering the low salaries offered to faculty.\nWhy is it necessary to submit a hard copy of the application to the university? Are your board members unable to operate computers or access the internet? Or can they not read without paper? Take a moment to research whether any university in the developed world conducts faculty recruitment in this manner. The insistence on attested copies—and eight sets of them—is emblematic of a bureaucracy that refuses to evolve. Most of the world has moved past attestation, trusting digital verification systems instead. The practice of attestation, rooted in colonial distrust, has no place in modern academia.\nThe current admission requirements for the science unit at DU state that students from the science stream must have a combined GPA of 8 in their SSC and HSC (or equivalent) exams, including the fourth subject, with a minimum GPA of 3.5 in each. For example, a student with a GPA of 4.5 in SSC and 3.5 in HSC, or vice versa, qualifies to apply and has a chance of gaining admission. However, this directly contradicts the minimum eligibility criteria for a faculty position in the science unit. A student who meets the admission criteria, excels in their studies, and graduates as the top student in their department—or even the entire faculty—would still be ineligible to apply for a teaching position at DU due to their SSC and HSC results. Such a student might qualify to become a professor at prestigious institutions like MIT or Harvard, but would not meet the criteria to teach at DU. This highlights a glaring inconsistency and the urgent need for a rational, merit-based reform in the educational system.\nAfter all these hurdles, the starting salary for a lecturer is capped at Tk 53,000. Meanwhile a PhD student in India receives a fellowship equivalent to Tk 60,000 or more, along with studio housing if they are married. This disparity is not just embarrassing but indicative of a systemic failure to prioritise education. If the teaching profession is not made attractive and competitive, how can we expect to recruit capable individuals?\nOne unwritten but widely practised rule by our universities is that they tend to recruit their own graduates. Universities worldwide prioritise diversity and fresh perspectives in their academic communities, which is why they generally avoid recruiting their own undergraduates or graduates as faculty. This practice, known as \"academic inbreeding,\" is discouraged to promote intellectual diversity, foster the exchange of ideas, and maintain a dynamic and innovative academic environment. Exceptions are made only in rare cases where candidates demonstrate exceptional brilliance or have gained significant experience and recognition at other reputable institutions, proving their merit through distinguished contributions to their field. In stark contrast, DU—and many other universities in Bangladesh—frequently recruit their own graduates as faculty members. This practice deviates from the proven strategies adopted by renowned global universities and hinders the potential for growth and innovation. It is well-established that no university can significantly improve its global ranking or reputation without embracing the best practices followed by top institutions worldwide. To rise in global stature, Bangladeshi universities must break away from outdated norms and adopt policies that align with international standards of academic excellence.\nEducation is the cornerstone of a nation's progress and the root of many of Bangladesh's problems lies in the neglect of this sector. DU's outdated recruitment policies are a microcosm of the larger issues plaguing our education system. Unless radical changes are made to attract talent and prioritise merit, the future of this nation remains bleak. It is high time we demanded better for our educators, our students, and our country.\nDr Kamrul Hassan Mamun is professor at the Department of Physics in the University of Dhaka.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "DU’s faculty hiring policy is a relic from the past",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/dus-faculty-hiring-policy-relic-the-past-3849506",
        "news_paper_name": "The Daily Star",
        "publish_date": "17-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "World must not fail Rohingya",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/world-must-not-fail-rohingya-1742136199",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "A world left twisting  in the wind",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/a-world-left-twisting-in-the-wind-1742136258",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Advance sale of bus and train tickets",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/advance-sale-of-bus-and-train-tickets-1742136300",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Digital security and misuse of technology",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/digital-security-and-misuse-of-technology-1742136322",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-03-2025"
    }
]