[
    {
        "full_article": "Over eight years have passed since the Supreme Court of India held privacy to be a fundamental right. In the interceding years, three separate drafts for a data protection law have been floated, with little visibility into how the final contours of the Act took shape. The 2023 law achieved simplification of the 2018 draft, with some important protections for user data baked into law. But this was at the cost of giving a wide berth for government organisations to handle the data of Indians, putting in place an anaemic Data Protection Board of India (DPBI), and cruelly amending the Right to Information (RTI) Act, 2005, setting back major advances in transparency achieved over the last two decades. The Digital Personal Data Protection Rules, 2025, notified on November 14, 2025, do little to repair the glaring gaps and damage from the parent Act. In fact, they delay the implementation of practically all key protections to 2027, while implementing the dilution of the RTI Act immediately; public information officers are now authorised to decline any personal information except what is already required to be published by other laws — an all-too-thin slice of the pie for citizens seeking accountability. This is after the government dragged out a three-month consultation period for draft rules which were already delayed, and launched the final form in the heat of the day the Bihar Assembly election results were announced.The delays to reach this point were unfortunate, in January, when the draft Rules were put out, and are inexcusable now. Little has been changed in the Rules’ final form, and the 12-18 months of a compliance timeline, even for giants of the technology industry that have known about this framework well in advance, does not stand the test of good faith. The lack of independence of the institutional framework underpinning these equivocations is particularly worrying: as an example of why, the DPBI will operate under the Ministry of Electronics and Information Technology. A result of this is that the same government organisation courting big-ticket investments into India from the world’s main data guzzlers, firms such as Google, Amazon and Meta, will supervise the body investigating their future mishandling of the data of Indians. Firms handling the data of Indians have few reasons to be upset with Friday’s Rules, as they will have over a year to fully implement the document’s limited aspirations. But for the citizen seeking the aim in the Act and Rules’ title — privacy and accountability from public and private actors with whom sharing data has become an implicit and unavoidable condition of modern digital existence — they will now find that their status quo largely continues: of being open books to the state and Big Tech, on the reflective side of a mirror that hides what is behind it. Published - November 17, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        Right to Privacy\n                    \n                            /                      \n                        \n                        data protection\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Right to Information\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "Too little, much later: on the Digital Personal Data Protection Rules, 2025",
        "headline_2": "The Digital Personal Data Protection Rules undermine right to information",
        "link": "https://www.thehindu.com/opinion/editorial/too-little-much-later-on-the-digital-personal-data-protection-rules-2025/article70287191.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-11-2025"
    },
    {
        "full_article": "The World Health Organization’s Global Tuberculosis Report 2025 was a mixed bag for India. While the tuberculosis (TB) incidence had the highest decline rate, globally, by 21% from 237 per lakh population in 2015 to 187 per lakh population in 2024, India remains among the countries with the highest rates of TB, bearing 25% of the world’s burden. This also means that India recorded the maximum number of cases of TB in 2024. Within the country, Uttar Pradesh has the highest number of cases, followed by Maharashtra, Bihar and Madhya Pradesh. Delhi has the highest TB infection prevalence rate, though its actual case numbers are not that high. As far as multidrug-resistant TB (MDR-TB) is concerned, the scenario seems quite challenging. India, as per the report, also recorded the highest number of drug-resistant TB cases in 2024 — accounting for 32% of global MDR-TB- and rifampicin-resistant (RR-TB) cases. With a treatment success rate for new and treated cases hovering at 90%, and at 77% for MDR-/RR-TB cases started on second line treatment, the saga of the mixed bag continues. India’s TB mortality rate dropped from 28 deaths per one lakh population in 2015 to 21 deaths per one lakh population in 2024. Despite this improvement, the figure is still over three times higher than the government’s elimination target.India has missed the target it set for itself, having advanced for itself the aim to eliminate TB — by 2025, five years before the global target of 2030. While incremental gains have not shored up to a dramatic result, this indeed has meant several million lives saved over the years. In this then, there is hope for a successful TB control programme in a country that has been battling TB for decades. Among the factors that have contributed to the gains include: harnessing advanced technologies, including AI and newer tools for molecular diagnosis and rapid detection of infection and resistance, facilitating better nutrition to prevent TB in susceptible populations, a scheme tailored to address drug-resistant forms of TB and the introduction of newer therapies (including BPaLM). The National TB Elimination Programme has set itself on a progressive path for the future, but unless crucial issues such as gaps in diagnosis (particularly in rural areas), taking care of stark socio-economic disparities and the high MDR-/RR-TB case burden, frequent drug shortages and looming malnutrition, are addressed with vigour, Indian efforts will continue to stay in the realm of swing and miss. Published - November 17, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        World Health Organization\n                    \n                            /                      \n                        \n                        tuberculosis\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        population\n                    \n                            /                      \n                        \n                        Uttar Pradesh\n                    \n                            /                      \n                        \n                        Maharashtra\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        Madhya Pradesh\n                    \n                            /                      \n                        \n                        prescription drugs\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        Artificial Intelligence\n                    \n                            /                      \n                        \n                        rural health\n                    \n                            /                      \n                        \n                        nutrition and diet",
        "headline_1": "Swing, but do not miss: on India and the WHO’s Global Tuberculosis Report 2025",
        "headline_2": "India’s battle against TB will need renewed vigour and focus",
        "link": "https://www.thehindu.com/opinion/editorial/swing-but-do-not-miss-on-india-and-the-whos-global-tuberculosis-report-2025/article70287469.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-11-2025"
    },
    {
        "full_article": "Healthy food is about policy and quality control. As train stations are redone, include that in the blueprint\nSouth Central Railway’s proposal to open up train stations to single-brand company-owned food retail is a smart idea. About 2.3cr train passengers are ever peckish while others want interesting snacks at every station, like the lookaround at airport stalls. As 1200 stations go into redevelopment, a culinary expansion, and the revenue for railways, are welcome. But the need of the hour is what even airports haven’t been able to swing – offering a choice of healthy hygienic food that’s not exorbitant. Three reasons why policy matters.  \nTrust. Confidence that fresh food at any station/airport will be healthy & hygienic doesn’t come easy. Can you really trust that limp salad? Branded outlets have an edge here, as fast food companies too expand into healthier snacking options. But by far, here too, it’s an overload of ultra-processed foods on offer, high in sugar, fat and salt, including the ‘fresh baked’ stuff.\nTime. Passengers’ time is limited, they prefer packaged items or pre-processed meals. Without quality control inspections, these are often unhealthy, regardless of misleading proclamations. Foods include beverages, snacks & tea bars and juice bars. Beverages are all sugary, snacks are what doc said ‘avoid’, tea & coffee are milky and sugary, and juice bars include synthetic concentrates. But no passenger has the time to check.\nTaste. Food is rail culture. No burger company has cracked the vada-pav – a Mumbai special. Or a Goan prawn cutlet. Or the ubiquitous samosa. Some argue you can’t go wrong with fresh. But that’s only in comparison with ultra-processed foods that are way worse. There’s no doubt chhole bhature, or vada & dosa, or a sweet mayo horror that passes off as a sandwich and greasy mishaps sold as croissants, are unhealthy. \nIndia’s obesity problem cannot be addressed if mass food outlets in stations and airports do not cater to what is required. Offer fare low on carbs & fats, up the protein & veggie items, prepared in oil one can trust. But who is serving that? Which is why redevelopment must include standards for food – and include low-sugar beverage choices, whole-grain options in snacks, clear calorie/nutrition labelling and of course, importantly, regular quality audits for food safety. \n\n",
        "headline_1": "On the food trail",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/on-the-food-trail/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-11-2025"
    },
    {
        "full_article": "What made Trump cut tariffs on coffee and other farm produce? Voter pain that’s turning into anger\nIt’s taken Trump nearly eight months to wake up and smell the coffee. What woke him up actually was the alarm over Democrat victories in NYC, Virginia and New Jersey early this month. But coffee – America’s favourite beverage – was already at his bedside, reminding him its price has risen 20% in a year, and that tariffs are partly to blame. Also that affordability isn’t a “new word”, or a “con job” by Democrats.\nSo, news that Trump’s suddenly lowered tariffs on about 200 food, farm and agricultural items, including coffee, isn’t surprising. He forgot, but voters didn’t, that price rise was one of his key poll planks last year. And while he promised to make things better for them, the opposite has happened. Couple of weeks back, Bank of America reported that one in every four US households is living paycheque to paycheque, spending 95% of income on housing, gasoline, groceries, child care and utilities.\nTrump, being Trump, will never admit the folly of tariffs (he imposed them on April 2 so that the world wouldn’t take them for an April Fool’s joke). White House’s spin is that tariff cuts are warranted, “given the substantial progress in reciprocal trade negotiations”. But by its own admission, only two final agreements have been inked so far; the other 11 are framework deals and investment agreements. Officially, the cuts apply to “food not grown in the United States”, such as coffee, cocoa and tea, but beef has been included even though US is world’s biggest producer.\nThere’s a note of desperation there, but Indian producers can cheer. Their spices, tea, coffee, mangoes, cashew, etc, are back in the game. While the bigger trade deal that will make Indian fisheries, basmati, jewellery, and dozens of other product categories competitive again is expected anytime, agri exports worth over $1bn annually will be on US shelves very soon. Trump knows his average voter is hurting, else he wouldn’t talk about $2,000 subsidy cheques and 50-year house mortgages. The sooner he drops tariffs altogether, the better for everyone – his voters and Indian exporters included. \n\n",
        "headline_1": "Caffeine kick",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/caffeine-kick/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-11-2025"
    },
    {
        "full_article": "In politics and life, don’t rush to write off people\nI was sitting looking despondent on the front step as Kamala returned from her walk. “Are you still thinking about the Bihar election results?” she asked, as she plonked herself next to me. “Or is it the air quality in Delhi, the Red Fort blast, or the fact that doctors were involved in death?” Doctors are always involved in life and death, but what becomes morbid is jumping the gun.\nUncles in the park were discussing that 4th Cross Phanendra had been admitted to hospital with pneumonia. Mr Kashyap went to the extent of stating that there was no hope and it was only a matter of time before the announcement was made. We began planning our association’s message on the WhatsApp group and deciding who would buy flowers for Phanendra, when said gentleman hobbled slowly into the park and sat tentatively on the bench next to us. Even Jesus waited for three days to rise again, but Phanendra was faster. He didn’t want to miss our analysis of the elections.\n“This PK man is finished! He looks impressive but does not seem to make a dent on our democrazy,” Kashyap pontificated. “Don’t write people’s obituaries prematurely. Sometimes they recover from a bad spell and return even stronger” – Phanendra’s philosophical footnote seemed even more meaningful after our earlier discussion on his shelf life and expiry date. Politics, like life itself, is hugely unpredictable and psephologists have given up on predicting trends. Veterans continue despite being written off as finito. Yatras and cheering crowds don’t always translate into votes. Deathly distractions sometimes change the course of an election and some elections are a steal for Sushma, Sweety and Saraswati.\nIn this world of Kaun Banega Crorepati and fastest finger first, factchecking and verification before forwarding news should become the norm. It’s difficult to tell Sunil Grover from the original Bachchan. Breaking News is breaking records with the paparazzi, to bring us clickbait in cute capsules. Govinda breaks up with his wife for the nth time. Orry is sorry yet again. Jaya draws a Lakshman Rekha for the paps. Jeetendra falls in dignified slow-motion but picks himself up without missing a beat. Dharmendra responds to a nation singing Yeh dosti hum nahin todenge, Sunny Deol is frustrated by fake news factories. As Woody Allen said, “I’m not afraid of death; I just don’t want to be there when it happens.”\n\n",
        "headline_1": "On expiry dates",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/on-expiry-dates/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-11-2025"
    },
    {
        "full_article": "How BJP-JDU can start changing Bihar’s economic trajectory. Plus, lift the ban on booze\nWhat does NDA’s massive win mean for Bihar’s future? One key takeaway from BJP-JDU’s seat haul is that it’s clear the voter is neither expecting nor looking to the state to provide those elusive ‘govt jobs’, no matter promises made. There’s certainly realisation that govts simply cannot generate the jobs required. But there’s much that govt can do. And what is visible to the Bihari at large, both at home and to the migrant, is what’s been put in place over the last decade – building blocks for a state to develop. Govt investment in road infra is evident – even rural roads have expanded from a mere 1,000 km to 1L km. Over 58L dwellings were built in rural Bihar in last 10 years. Piped water coverage is total. Power consumption has increased. Law & order is relatively stable. All of which counts – a long haul from the Bihar at the turn of the century. So, where to from here?\nAfter 20 years of Nitish’s rule, it is critical to wean Bihar away from its ruinous near-total dependency on cash transfers and remittances. No governed entity can have its future determined by welfare payments and migrant income. Payouts, as a TOI columnist recently noted, were roughly 10% of annual revenue expenditure. Welfare spend just before polls was huge – Rs 10k disbursed to 1.5cr women while 1.1cr pensioners (widows, elderly, disabled) saw monthly pensions nearly triple from Rs 400 to Rs 1,100. Notching up a mighty bill of Rs 9,240cr annually. This has serious consequences for any state, but for Bihar, it means a fiscal wreck. Fiscal deficit at 9.2% of state GDP last year, Nitish’s hopes to cut this to 3% are naturally gone with the payout. Even rich Maharashtra struggles to fund its ‘ladki bahin’ scheme, serviced at the cost of other subsidies. Add to that the fact that migrant earnings, as an analyst wrote in TOI, make up 50% of household incomes – where per capita income is Rs 60k. Together, it makes for an unreliable foundation for growth in India’s poorest state. What Bihar needs, then, for meaningful change is what India needs: lots of private investment. Of course, that’s easier said than done. Private investment India-wide has weakened. State and PSUs have stepped in. In 2023-24, private sector share in gross fixed capital formation (GFCF) – a key measure of investment in physical assets – dropped to 33%, a sharp decline from over 40% in 2015-2016.\nSo, what can Bihar do for an immediate boost? Lift prohibition. In 2015-16, the year before Nitish’s poorly thought out ban, Bihar govt earned Rs 3,142cr excise, primarily liquor revenue, 12% of the state’s tax haul. The next fiscal, post-ban, excise earnings were down to Rs 30cr, and crashed to 0, where it’s stayed. Prohibition has had a grievous social cost. A parallel economy flourishes, hooch deaths have destroyed families. Look to brother UP – in 2023-2024, its excise earnings were Rs 45,571cr. Bihar shouldn’t parch itself of this revenue stream and must ditch the ban that’s run its course.\n\n",
        "headline_1": "NDA, Say Cheers",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/nda-say-cheers/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-11-2025"
    },
    {
        "full_article": "A recent study published in the Journal of Water and Climate Change has brought into focus an often overlooked dimension of climate risk: our coastal towns. According to the Buet-led research team, 22 urban centres across 10 coastal districts now face heightened threats from river erosion, salinity, cyclones, and acute water scarcity, which directly undermine people's livelihoods, health, and social security. While migration to Dhaka gets the most attention, a recent Prothom Alo report shows that coastal upazila towns have become the first destination for climate-displaced families from more vulnerable areas, resulting in heavy population pressure and deteriorating living conditions.\nThe lived realities described in the report make the severity of this crisis clear. In Satkhira city alone, the population has surged from 1.13 lakh in 2011 to over 2 lakh, with 47 slums now housing families displaced from places like Gabura and Shyamnagar. However, these settlements remain waterlogged for months during the monsoon and lack basic amenities. Similar stories emerge from Khulna, where repeated cyclones, including Aila, Sidr, Amphan and Remal, have forced more than 1.23 lakh people to leave their homes over the past decade and a half. The World Health Organization estimates that over 71 lakh people in Bangladesh were displaced due to climate impacts by 2022, a figure that may rise to 1.33 crore by 2050. These numbers emphasise the urgency of reassessing how we manage vulnerable areas, including coastal towns.\nThe Buet study identifies towns such as Chalna, Morelganj, Kuakata, Char Fesson, Lalmohan, Kalaroa, Patharghata, Borhanuddin, and Paikgacha as being under high risk due to the combined challenges of population density, poor housing, inadequate water and sanitation, limited transport options, and recurring disasters. Meanwhile, some towns with lower vulnerabilities at present still face high future risk due to exposure to storm surges, embankment breaches, and salinity intrusion. Add to that the fact that unregulated shrimp farming often accelerates embankment damage, worsening displacement. This mismatch between institutional preparedness and the scale of the hazard leaves coastal towns trapped in a cycle of crisis.\nLocal governments cannot address this challenge through relief operations or isolated interventions alone. What is required is the integration of multi-hazard risk assessments, similar to the approaches outlined by Buet researchers, along with climate-resilient urban planning and stronger municipal governance. There must be durable embankments, safe housing, affordable water supply systems, sustainable drainage, and regulated land use to prevent further ecological damage. Long-term interventions rather than reactive fixes must define our approach. Coastal urban centres are now frontline climate hotspots, and unless the government ensures coordinated investments and proper planning, the ongoing displacement, poverty, and urban breakdown will only intensify.\n",
        "headline_1": "Can we climate-proof our coastal towns?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/can-we-climate-proof-our-coastal-towns-4035151",
        "news_paper_name": "The Daily Star",
        "publish_date": "17-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 17, 2025 00:00:00  \nThat all is not well with the state of Bangladesh's economy is corroborated by several recently published local and international studies. Even though the government managed to stabilise the economy to a large extent from the mess it inherited, prolonged political uncertainty appears to be a major drag on regaining economic growth momentum. Rising poverty rate, investment slowdowns, growing unemployment and persistent inflationary pressure are some of the red lights blinking on the country's economic dashboard. Consequently, the low and middle-income segments of the population are struggling to meet their living expenses. This unsavoury economic reality once again came under scrutiny at the recently held International Conference on Economics, Business and Technology Management (ICEBTM 2025). \nSpeakers at the event underscored that Bangladesh's unemployment rate rose to 5.08 per cent in 2025 from 3.66 per cent the previous year, marking the highest level in three years. Youth unemployment remains alarmingly high at 11.46 per cent. Such figures carry grave implications, as joblessness is pushing more families below the poverty line. Furthermore, according to a study by the Power and Participation Research Centre (PPRC), the poverty rate in Bangladesh has increased sharply, rising to an estimated 27.93 per cent in 2025 from 18.7 per cent in 2022. Another study warns that by December this year, around 16 million people in the country may face severe food insecurity, while approximately 1.6 million children are likely to suffer from acute malnutrition. These facts and figures are not mere figures; every number tells a story of gruelling hardship endured by unemployed youths and poverty-stricken families.\nThe unemployment and poverty situation is closely tied to the overall economic regime of a country. The closure of several hundred factories-triggered by labour unrest, gas shortages, abrupt hikes in bank loan interest rates and political turbulence since the student mass uprising of August 5, 2024 has undeniably worsened the situation. Although the interim government has taken various steps to remove investment hurdles, most local and foreign investors remain in a wait-and-see mood due to lingering political uncertainty, deteriorating law and order and an alarming rise in extortion from businesses. Even on Saturday last, reports emerged of a businessman being threatened with a painful death by rent-seekers if demand for extortion was not met. In such an atmosphere of fear and intimidation, no enterprise can thrive and no one can feel secure. \nThe country is also grappling with a dilemma over money supply. To rein in the galloping inflation, the central bank has been pursuing a tight monetary policy over the last three years, pushing up lending rates and raising the cost of borrowing, which is choking private investment. The prevailing liquidity crisis in some banks is further straining industrial sectors. Garment exporters, for instance, often allege that despite having sufficient deposits - including export proceeds - they cannot access funds due to the liquidity crunch in banks originating from massive surge in non-performing loans. Therefore, to restore economic growth momentum, the government must stabilise the banking sector, lower credit costs and rebuild investor confidence by addressing their legitimate concerns. Without a significant acceleration in private investment, unemployment will remain high and the goal of reducing poverty will remain out of reach.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ominous shadow of joblessness, poverty",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ominous-shadow-of-joblessness-poverty-1763308696",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       November 17, 2025 00:00:00  \nThe Transparency International, Bangladesh (TIB) in early March this year, revealed that private buses and minibuses pay over Tk10.59 billion annually as extortion money to political affiliates, the police, the Bangladesh Road Transport Association (BRTA), city corporations and municipal officials so that they can run their business. Media reports at that time also covered stories on how organised groups with links to local influential figures ran extortion rackets on the national and regional highways. Targets of these rackets were mainly trucks, buses and other commercial vehicles. The incidents of extortion and other types of violent crime being talked about had been taking place hardly six months after the current interim administration took office. That, in other words, means, the change of government has not left any impact on the lives of the general people, not to mention the condition of the business community. The Dhaka Chamber of Commerce and Industry (DCCI) president Taskeen Ahmed at a meeting titled, 'Importance of maintaining improved law and order for easing trade and commerce in May this year compared extortion with an 'abscess' afflicting business and urged the government to adopt a coordinated policy framework and take decisive action stressing commerce-friendly law and order so that the businesses might conduct their operations without fear. On October 19, the Bangladesh Reconditioned Vehicles Importers and Dealers Association (BARVIDA) observed a half-day strike and formed a human chain protesting against extortionists' insatiable demand for money, their threats and attacks on car dealers with bombs and other lethal weapons. With their back to the wall, the leaders of BARVIDA at a press conference issued the warning that unless the extortionists stopped threatening and were put behind bars, the car traders' representative body would stop paying government its revenues from the next month. According to a report published last week (on November 13) in this paper, at a view exchange meeting hosted by the apex body of business and industry in Bangladesh, the Federation of Bangladesh Chambers and Industry (FBCCI) in the city, the wholesalers and importers complained that widespread extortion and harassment of traders are taking place to which the law enforcement agencies are turning a blind eye. Unless such extortion, manipulation and disruptions in the supply chain were urgently addressed, the traders cautioned that the situation would lead to price hike of essential commodities ahead of the Ramadan. In every case, as noted in the foregoing, it is the general traders who were at the receiving end due to the acts of extortion and harassment committed whether by criminal rackets, law-enforcers themselves, public officials, or syndicates of big business (through market manipulation). President of the Shyambazar Agricultural Products Traders Association, for instance, alleged at the view exchange event that they were subjected to extortion twice. First, while loading the goods (on trucks) and second, when unloading those. When the extortionists are in action, the police look the other way, they added. So, what was the July uprising for, if it could not change the lot of the general traders in the kitchen market, at the street corner or on the highways while loading and unloading their goods, or transporting those from the land ports/seaports or from the producers to the consumers' end? \nFrom all the events organised by the business community since the beginning of this year, the demand raised is one and the same and that is about combating extortion and other forms of crime which are hampering their business. Clearly, the business community is seeking redress for an infringement of their right to conduct business normally. To all intents and purposes, theirs has been a voice in the wilderness. Is it then surprising that essential commodities market remains volatile to the chagrin of the general consumers who pay the ultimate price for the chain of extortion rackets operating all the year round, no matter the form of the government? It is as though, governments will come and go, but extortion will continue unchecked. As pointed out by the DCCI president last May, the threats to the businesses in whatever form that may come is undermining investor confidence in the economy. If high price of essential commodities is a sign of inflation, then along with other macroeconomic issues, crime in the form of extortion should also be included as a factor contributing to inflation. In that case, inflation also becomes a law and order issue and should demand addressing as such. But then the question is, how can the government even contain crime-related inflation, if its law-enforcement apparatus is not above board? If the government turns a deaf ear to all the requests, appeal and demand from the traders to improve the situation by holding the extortionists to account, what options are left before them to continue in business? Put up the shutters for the last time or act in the manner of the car traders body, the BARVIDA, which has issued an ultimatum to the effect that they would stop paying taxes to the government, unless the rent-seekers were stringently dealt with by the law?\nIn truth, the vacuum left following the exit of the previous regime has been filled by another group of thugs, extortionists or rent-seekers, by whatever name you call them, to carry out their operation as usual. The interim government, with its police force severely traumatised and demoralised in the wake of the July upsurge was largely ineffective in restoring law and order. So, one might argue, the interim government that assumed office immediately following the upsurge was not able to rein in the criminals on the highways, let alone in society at large. Now, there might be excuses galore to explain away the interim government's failures on the law-and-order front. However, failures may have many explanations, but when it comes to running the affairs of a government, failure cannot be an answer. In fact, for any government to prove its worth, it is now or never. Even if it (initial failure) might be acceptable for a government changing hands peacefully, it is anathema in the case of a post-revolution one. A revolutionary government must be able to put its foot down from the day one or call it quits. Perhaps, the interim government has meanwhile exhausted all its options to explain away its failure to rein in the extortionists and rent-seekers leaving the business community wondering why their clamours for redress are remaining largely unanswered. \nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Traders' call for redress goes in vain",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/traders-call-for-redress-goes-in-vain-1763308729",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       November 17, 2025 00:00:00  \nHolding a national election is a very important event for any country only more so when it is in a momentous transition. Bangladesh, following the July-August uprising, was on the cusp of such a new order. Whether the historical change will materialise desirably, however, hinges not so much on the election but on the framework of governance worked out by the country's leadership and stakeholders. \nThe incumbent government has not got its priority right. It should have been aware of its limitations and focus on its premier objective of turning the system of governance pro-people in place of the oligarchic and dynastic rule. It went overboard where it should never have ventured and thus dissipating its attention. Indecision and foot-dragging have their fair reflection in the consequences. Now the political imbroglio involving arrangement of national election and July charter referendum on the same day has given rise to more uncertainties and confusion than before. \nA national poll is a poll of the highest order, so is a referendum on a charter that seeks to change the system in order to make governance meaningful and at the service of the people irrespective of their social standing. In case of Bangladesh, this referendum perhaps carries more weight than an election. When election to parliament can be relegated to a farce by the ruling party, addressing the system to plug the loopholes is more important than a mere election. Thus the importance of referendum has been diluted by the decision of holding both on the same day. \nThe crucial point here is the subject of referendum. The majority of voters will not have the slightest idea about what they have been asked to endorse or reject. When the July charter is yet to get a unanimous approval ---with some tendering their notes of dissent--- from the political parties, asking for 'yes' or 'no' vote on the issue sounds naive. Moreover, the positive or negative verdict sought from voters on a vague issue makes the exercise ludicrous. Politicians who have criticised the government query elaborated in four distinct segments are right in doing so. All four questions have their distinct implications. Together they do not make the query whole. But the franchise has been asked to exercise 'yes' or 'no' vote. People can endorse one and reject others. How come they approve of all when they have disagreement with one or more of the four questions?\nHowever, agreement or disagreement on one or the other issues follows only when the voters have understood the meaning of the questions posed. Not many people have gone through the July charter nor are they expected to do so in the remaining time before polls. The reference to the July charter in the four questions makes it incumbent on the voters that they read the charter thoroughly. Not all the voters are literate or educated enough to make the meaning of the charter even if it was available. In a country where voters vote for candidates on the basis of party symbols or in rare cases banking on popularity and personal charisma, is not it too much to expect informed verdict from voters on the referendum issue? Then there is no provision for casting votes on the upper house, where members will be proportionate to the vote, as if the upper house is a settled issue! \nPresentation of the referendum on July charter in such confusing and illegible manner may lead to further uncertainty about the plebiscite. Instead of making things simple and clear, a mess of the election and referendum has been made. This may be the result of the absence of enough political acumen or a work of muddled minds done deliberately. If the people fail to appreciate the subject of a referendum because of the government's inability to present it in simple and clear terms, it is not the people's fault but of those who are in charge. Let the matter be brief, simple and clear. Asking people to vote on an issue not crystal clear to them is a gross injustice.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Referendum without shaping outlines",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/referendum-without-shaping-outlines-1763308756",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-11-2025"
    }
]