[
    {
        "full_article": "The Union government has missed an opportunity to put a lid on the prolonged controversy over the arbitrary and the undemocratic use of power by unelected Governors. A Supreme Court judgment on April 8, 2025 clarified the constitutional position over the powers of the Governor and the President in giving assent to Bills passed by State Assemblies. A Division Bench of Justices J.B. Pardiwala and R. Mahadevan held that Tamil Nadu Governor R.N. Ravi’s act of withholding 10 State Bills was “illegal” and “erroneous”. The well-reasoned judgment had outlined the possible courses of action for the Governor and the President once a Bill is before them for their assent, though the Constitution does not specify timelines. The judgment established long awaited and much required clarity on several questions. Now, the Centre, through a Presidential Reference, has brought up all these questions again to the Court, seeking its ‘opinion’ under Article 143. The power of Governors has been an extremely contentious question. The heightened brazenness of some Governors in recent years has created more bad blood between the Centre and the States, and undermined the mandate of States to govern. The Court’s judgment took into account multiple judgments, reports of committees that examined the working of Indian federalism, and Constituent Assembly debates to arrive at a firm conclusion that Governors or the President do not have arbitrary powers to indefinitely hold up a law made by an elected Assembly from coming into force.Governors are whimsical appointees of the Centre, and the Constitution does not vest them with infinite powers, least of all to undermine the elected Assembly. The Centre could have used the Court’s judgment to bring a closure to the controversy once and for all. It could have, if it felt necessary, brought constitutional amendments in line with the Court’s judgment. Instead, the Centre is raking up questions that are already settled, through a presidential reference. As constitutional scholars have pointed out, an opinion given by the Court does not override the Court’s judgment. If it was only clarity that the Centre wanted, it could have sought it through a review petition and other established procedures. By choosing the unusual path of a Presidential Reference, the Centre is signalling an intent to seek for itself powers to be exercised through Governors, that the makers of the Constitution had not given it. The Court’s judgment provided a sound framework for a consensus on the role of the Governor. The Centre should accept that, and if at all required, convene a meeting of Chief Ministers and political party representatives, to resolve any other residual issues. Published - May 17, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Governor\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        constitution",
        "headline_1": "Closing argument: On the Presidential Reference to the top court",
        "headline_2": "The presidential reference seeks to undermine a settled question",
        "link": "https://www.thehindu.com/opinion/editorial/closing-argument-on-the-presidential-reference-to-the-top-court/article69584260.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "18-05-2025"
    },
    {
        "full_article": "Often described in media reports as “hooch tragedies” or “spurious liquor cases”, the recurring incidents of illicit alcohol poisoning across India — most recently near Amritsar, Punjab, which claimed at least 23 lives — follow a grimly familiar pattern of poverty, greed, and regulatory failure. Each tragedy is eerily similar to the previous one, be it in terms of the socio-economic profile of the victims or the motivation of the perpetrators. The victims are typically poor, daily wage earners, seeking respite from the harsh realities of everyday drudgery. They are drawn by the lure of cheap alcohol, a vulnerability exploited by bootleggers, who are at the fag end of a long supply chain. These illicit brews often involve dangerous shortcuts, from incorporating toxic substances such as dead scorpions to diluting industrial methanol, a poisonous chemical that is deceptively similar to consumable ethanol. Methanol, easily pilfered and inexpensive, becomes a deadly profit source for bootleggers who may misjudge dilution ratios, leading to fatal consequences. The nexus among bootleggers, the police, and lower-level politicians is often apparent. While police negligence in Punjab has led to suspensions, these events are more about organised methanol theft in which the bootlegger is only the last mile operator. Methanol is not a drink; it is industrial alcohol, an intermediary in the petrochemical industry with extensive downstream use, and is, therefore, not illicit, except as an ingredient in hooch. It is categorised as a Class B poison in many States, but is cheaper than the liquor made biologically, mostly from molasses. After paying for the pilferage from authorised methanol dealers, bootleggers can still make a handsome profit.Legal proceedings in illicit liquor cases often involve murder and attempted murder charges, besides those under prohibition laws. Yet convictions, as seen in the 2015 Malvani case, can be elusive. A court acquitted 10 of the 14 accused after nine years. None was found guilty of violating the Poison Act. Since methanol production and delivery are inter-State affairs, there is a case for a central framework on methanol transport for preventing such pilferage as well as stringent State regulation. The Poison Act may add teeth to the prosecution’s case. But what is more important is to ensure that the lawmaker-enforcer dyad is incorruptible so that illegal methanol distribution is impossible. Eventually though, it is the sorry economic, social and educational situation of victims that creates a market for unscrupulous agents to make money. This can only be eradicated by tackling poverty, social inequality, and the lack of access to education alongside systemic corruption within law enforcement. Published - May 17, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        media\n                    \n                            /                      \n                        \n                        distiller and brewer\n                    \n                            /                      \n                        \n                        Punjab\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        poverty",
        "headline_1": "​Drinking to death: On illicit liquor cases",
        "headline_2": "Illicit liquor tragedies expose systemic corruption and regulatory failure",
        "link": "https://www.thehindu.com/opinion/editorial/drinking-to-death-on-illicit-liquor-cases/article69584143.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "18-05-2025"
    },
    {
        "full_article": "Authored by GS Tripathi\nGreat people are publicly admired and face criticisms, too. However, a person who is publicly admired, but not criticised is not great; he might be mighty, but intolerant. Those who are neither respected nor criticised publicly are ordinary folks. It does not mean that these people are never admired or criticised. They have their short-range quotas among their limited admirers and critics. In other words, admiration and criticism for them occur somewhat privately.\n\nThe Bhagwad Gita advises that one should do one’s duty, whether it be pleasantor unpleasant, without bothering about admirations and criticisms. A common human tendency is to embrace pleasantness and avoid unpleasantness. However, life is not a bed of roses.\nWhen we wish to honour somebody, we usually admire him. This does not mean that the person has only virtues, and no vices. It is simply overlooking the negative side. Chanakya Niti says, “Learned people have only virtues, and no vices.” This is said to emphasise the role of learning in life; it should not imply that they have no weaknesses.\n\n\nAll human beings have both strengths and weaknesses. There is a saying that all saints had a past, which might not be so saintly. Folklore says that Maharishi Valmiki was a wicked man, Daku Ratnakar, in his teens and adulthood. Somewhat similar was the case with Angulimal, a cruel man, who changed after encountering the Buddha. Thus, transformations in life are not uncommon. It is also true with matter that transforms with temperature, pressure and other extraneous forces. Rigidity resists transformation, while flexibility allows it. Both life and matter have these traits.\n\nPeople are happy when their strengths are cited, but not when their weaknesses are pointed out. Some people enjoy mimicry and caricatures of others, but they feel irritated when it comes to them.\nThe Gita classifies human values in three categories – sattvic, rajasic, or tamasic. Sattvic character is associated with truth and honesty, rajasic character with motive, and tamasic character with negativity. Sattvic admiration surfaces when the admirer’s soul is in a joyous state. It is the purest and most transparent form of admiration. It is long-range, that is, its effect spreads far and wide. It creates positivity and brightness all around.\n\nRajasic admiration is like vishakumbham payomukham , nectar in the mouth, poison in the heart. It is characterised by flowery language coming out of a dark heart. This kind of admiration is widespread in a society that seeks material glory and benefit.\nA tamasic state is always devoid of admiration, be it public or private. It is always critical of everything. Attributes that describe this state are darkness, inertia, noise and chaos. Rise of unrighteousness can only be brought down by the spread of righteousness.\n\nMany are never admired publicly or privately. They spend their whole lives in ignominy. Oliver Goldsmith says, “They spend their whole lives without passionately declaiming against Providence or calling their fellows to be gazers on their intrepidity.”\nThe writer is an adjunct professor of Physics at Berhampur University\n\n\n",
        "headline_1": "Criticism and nature of admiration",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/criticism-and-nature-of-admiration/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-05-2025"
    },
    {
        "full_article": "On April 8, SC pronounced a historic judgment in State of Tamil Nadu vs Governor of Tamil Nadu. Perhaps few SC pronouncements have had, or will have the same impact on Union-states relationship as this judgment.\nRead full story on TOI+\n\n",
        "headline_1": "Does SC’s powers under Article 32 render President’s reference moot?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/does-scs-powers-under-article-32-render-presidents-reference-moot/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-05-2025"
    },
    {
        "full_article": "On Thursday, President Droupadi Murmu exercised her powers under Article 143 of the Constitution to send a ‘reference’ to Supreme Court, asking 14 questions on the extent of the legal powers of governors and the President. This marks only the fifteenth time since Independence that such a reference has made its way from Raisina Hill to Tilak Marg.\nRead full story on TOI+\n\n",
        "headline_1": "Why the President decided to dial the SC in TN governor’s case",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/why-the-president-decided-to-dial-the-sc-in-tn-governors-case/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-05-2025"
    },
    {
        "full_article": "Comms wars are shaping our reality, but we can fight back \nWe are in the midst of a communication war. From what we consume on TV and internet to our visits to shopping malls and our news consumption patterns, there is a constant battle for our attention. Surprisingly, the same mechanisms that influence our choices offline also nudge our decisions online, providing a powerful tool to communicators. So what is the truth? Do we really have a grip on reality?\nIn The War For Reality: How to Win in the World of Fakes, Truths, And Communities, Dmytro Kuleba, the former foreign minister of Ukraine, approaches the subject from the unique perspective of his country’s war against Russian aggression. While the book provides deep insights into the communication war being waged in Ukraine alongside the physical war, the lessons learnt can be applied universally. \nThe book says that the truth lies somewhere between fakes and real truths because everyone can have a different version of the truth. The internet is the natural battleground for communicators. Particularly because of the innate power of images and videos to evoke responses from our brain. This is also the reason behind the rise of GAFA – Google, Amazon, Facebook and Apple – who have figured out how to hack into our brains. Note that these organisations have no qualms about working with local govts of any kind. And authoritarian countries like Russia have taken advantage of this, says the book. \nBut can blockchain tech rid us of our sin? It certainly narrows the scope for manipulation. But the 51% rule and blockchain oracles present a dilemma. The requirement of approval by 51% participants to change a fixed blockchain fact is a high bar, but not impossible to overcome by corporations, billionaires and govts. Similarly, blockchain oracles have to rely on users and available data to adjudicate a contestation over a fact. For example, Ukraine claims that Russia occupied Donbas, whereas Russia insists on a civil war happening there. Both sides would want to introduce their facts in blockchain. But for blockchain oracles to make a decision it would have to rely on data that itself might be manipulated or incomplete. \nWhat about persuasion? Can critical thinking be incentivised? As Nobel laureate Daniel Kahneman postulated, human thinking can be of two kinds – instinctive and rational. The former is immediate and emotional. The latter needs to be constantly switched on by human effort. Therefore, people often make the easiest, and not the most rational, choices. \nYet, it’s possible to nudge people towards making desired decisions. Supermarkets in Ukraine started to mark Russian goods with the Russian flag after the beginning of the war in 2014. This immediately saw Ukrainians refuse to buy these goods. So, apart from internal effort, rational choices can be facilitated through external nudges, the book says. \nOf course, manipulators also have the same tools at their disposal. This is why it’s important to control our emotions. The book says communicators of aggression and temptation are aware that sex, internet and drugs have just the same impact. The goal is to produce dopamine. In this context, betrayal is also a very powerful emotion, while peace is meaningless to those who have not known war. Therefore, ‘betrayals’ and ‘victories’ are easily controlled by the toggle switch of communications. Politicians know this very well, and now have sophisticated tools to manipulate people more efficiently. \nSo, what should we do? Filter emotionally charged news and conspiracy theories, actively search for positive information, don’t look at the world through the lens of ‘betrayals’ and ‘victories’, and don’t get tired of fighting for real values: tough but doable.\n\n",
        "headline_1": "Of Betrayals, Victories And Blockchains",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/of-betrayals-victories-and-blockchains/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-05-2025"
    },
    {
        "full_article": "We congratulate the Women's March for Solidarity (Moitree Jatra), which drew in thousands of women to Manik Mia Avenue in a show of strength, unity and resoluteness to stand up to oppression and discrimination. Several thousand women, along with hundreds of men, marched in Dhaka city with three main demands: that the government take action against threats to women and minority communities, the misinformation campaign against the Women's Affairs Reform Commission, and the weaponisation of religious sentiments to create an environment of fear. They also stated that political parties that want women's support must clearly express their stance on women's complete political, economic and personal freedom.\nWhat was most heartening to see was women from all walks of life and from diverse communities taking part in this grand rally. They included tea garden workers, garment workers, home workers, Indigenous and Dalit women, teachers, students, development workers, cultural activists and human rights defenders. Fifty progressive organisations comprising women workers, cultural activists, students and professionals expressed their solidarity with this unique March.\nThis March has come at a time when women and girls are facing all kinds of threats, especially in the public sphere. Abusive and threatening language has been used against women both in public rallies as well as online. Women have faced assaults in the streets and while playing sports. Sexual violence against women and girls continues unabated, with perpetrators becoming emboldened by the unhindered hate speech and moral policing of certain groups. Threats of rape and abusive language have increased significantly on social media. Mob violence has also targeted women.\nWe have also seen how women, even those who were instrumental in the people's uprising, are being sidelined and their voices silenced through misogynistic speeches and exclusion. All this does not bode well for Bangladesh, a nation built on the principles of equality and justice for all and an end to all kinds of discrimination. The July uprising, too, was primarily based on removing discrimination of all kinds.\nWe agree with their declaration that the government must take action against these threats to women's active participation in all spheres of life. The virtual silence of the interim government after the vicious verbal attacks on its own appointed commission and its members has been disturbing and disheartening. We expect the government to make it clear that it will not tolerate misogyny and will punish violence against women in any form. The interim government, and the government that will be elected in the future, must ensure a safe environment for women and girls, free from violence and discrimination.\n",
        "headline_1": "Govt must listen to women’s voices",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/govt-must-listen-womens-voices-3896886",
        "news_paper_name": "The Daily Star",
        "publish_date": "18-05-2025"
    },
    {
        "full_article": "I remember becoming a voter in 1994. I still do not know what it feels like to vote—I have not voted yet. Every time I thought of voting, I discovered that I had to pick out the worse from the worst. Whoever would win, people would lose. I found voting unnecessary, even criminal. If that sounds like the logic of a lunatic, look around. Take stock of the elections we had. Didn't we have to vote for those grifting charlatans, who almost religiously basked in crime and corruption? An election beckons us yet again. While the interim government led by Prof Yunus reiterates that the election is planned from December 2025 to June 2026, some political yahoos remind us repeatedly that the sooner the election, the faster the slide into democracy. If that sounds a little hooey to you, you are not alone!\nWhile a functional democracy presupposes transparent and timely elections, the correlation between democracy and elections is often incidental. Think, for example, of Hungary. Christopher Rufo, a writer and activist from the US, claims in his pitch, \"Orbán's War,\" that Hungary is the most controversial nation on earth for many reasons; for one, it represents the death of democracy. It holds free and fair elections regularly. No one else besides Viktor Orbán, the prime minister of the country, however, has been winning elections since 2010. Since he resumed office for the second time (his first term lasted from 1998 to 2002), he reformed the constitution and the electoral system so critically that they advanced his political goals permanently and illegally. Gerrymandering, muzzled media, and outmanoeuvred political opponents have contributed further to skewing elections in his favour. Elections alone do not establish democracy. Elections under certain conditions do. Considering this, Bangladesh doesn't seem ready yet to leap into democracy through an election.\nA shift from dictatorship to democracy has never been linear and instant. A dictatorship is a devil's workshop. It begins with transgressions. It ends with devastation. Bangladesh is apparently wrecked now, because it had to weather the brutal dictatorship of Sheikh Hasina for about 16 years until she capitulated to a student-led movement on August 5, 2024. While Hasina's departure is a giant leap towards democracy, sceptics would remind us that she left behind a shattered constitution, a dysfunctional election commission, a broken police department, and a pet bureaucracy. These critical instruments of state operation can't be overhauled overnight. An executive fiat doesn't rejig these instruments. It requires policy formulation, political consensus, logistical preparedness, and even civic engagement. Professor Yunus's government has been working frantically, as we all know, to fulfil all these requirements to hold an exemplary election within the timeframe already declared. In a democratic country, any party can ask for an election at any time. An election, however, is apparently not a partisan demand. It's essentially a public entitlement. Scheduling an election as such warrants caution.\nA case in point is the Philippines. Adrienne LaFrance claims in her pitch, \"A Ticking Clock on American Freedom,\" in The Atlantic that democracy is still extremely fragile in the Philippines following the ouster of Rodrigo Duterte in 2022. Duterte was voted in and out of office democratically, but during and following his tenure (from 2016 to 2022), democracy diminished and then struggled to flourish. He cracked down on his political rivals, gagged the press, and killed tens of thousands of civilians, as human-rights groups claim. The rule of law was unknown to him. LaFrance claims that democratic institutions crumbled in the Philippines in six months under Duterte. Once people lose their freedoms, it can take a generation or more to claw them back if they are lucky, LaFrance claims. That's the reason why Duterte's successor, Bongbong Marcos, has been struggling to steer the country back into democracy. A robust democracy never emerges out of broken institutions. Democracy needs institutional guardrails and administrative custodians. Bangladesh falls flat on both of these fronts, thanks to Sheikh Hasina. Under these circumstances, whoever asks for an early election hardly cares about what democracy is and does.\nDemocracy is not a political system that only stipulates who is going to be ruled by whom. Ideally, in a democracy, no one rules anyone. It's, instead, a system that ensures checks and balances between different arms of a government, which revolves around such fundaments as equity, justice, freedom, and engagement. These are areas of infinite improvement. There's no such thing as the best democracy, because the so-called best democracy can be better still. Democracy is hardly about transferring power through an election. Only when people are criminally innocent about democratic values do they believe that elections are the only gateway to democracy. Adolf Hitler was the democratically elected chancellor of the Weimer Republic (modern-day Germany from 1918 to 1933), but he systematically dismantled his country's democratic structures and processes within 53 days of his tenure, as Timothy Ryback claims in his pitch, \"How Hitler Dismantled a Democracy in 53 Days,\" in The Atlantic.\nAn election is no longer a possibility in Bangladesh. It's a certainty, unless it has to be delayed under extraordinary circumstances. That worries some people. Are we getting ready again to repeat the past to destroy the future? In July-August 2024, we didn't have a picnic to celebrate our political success. We suffered a carnage due to our political failure. One big party went wild for about 16 years. Another big party failed to resist them. Unfortunately, Bangladesh's politics is significantly defined by the see-saw show between these two parties. They are qualitatively similar. They defend dynasties. They deify specific icons and ideologies. What they do as rituals is similar, too. Lie. Gripe. Gloat. Repeat! And all they want is power, because money grows within the proximity of power. We shouldn't tut-tut over something so obvious––politicians are apparently money soldiers. Following Hasina's departure, all they need is an election, which will establish their proprietary right over the country. Boom! The country is back to square one. James Novak in Bangladesh: Reflections on Water mentioned the following quote attributed to Hussain M Ershad, as he was reflecting on ruling Bangladesh, \"You know how it will end; you just never know when.\" That's a spoiler alert to politicians, who sound gung-ho about the election.\nAlerting the breed of politicians we have in Bangladesh is akin to beating a drum to the deaf. They don't hear, because they don't care. They toe their party line to centralise power. And when they prevail, they create an environment where committing a crime is no crime; calling a crime a crime is. They make questioning impossible. They make certain killings sacred. They bend and break the constitution. That was Hasina's playbook. Some of the outlandish statements by some party-people on reform, the interim government, and the election suggest that whoever is going to succeed Hasina following the election will rule the country her way. That's no longer an option. We need fundamental reforms in the legislative, executive, and judiciary for Bangladesh to emerge anew.\nThe constitution in particular must be amended so as not to grant the prime minister absolute power sine die. The tenure of the prime minister can be restricted to two terms spanning over approximately eight years, when the prime minister is not \"the pivot of the whole system of government,\" as political scientist Harold Laski said. A president should not be a ceremonial figurehead; she needs to have more executive power for checks and balances. We can even have the provision of electing the president by direct vote. The typical parliamentary form (i.e., the Westminster) doesn't allow such provision. We must have a hybrid model. Before the election, people expect concrete directives on this front. Fascism, after all, is a constitutional demon in Bangladesh!\nTherefore, the basic boils down to this: Bangladesh doesn't need the roadmap to the election until it has the blueprint for reform—call it the \"July Charter,\" if you wish.\nDr Mohammad Shamsuzzaman is associate professor at the Department of English and Modern Languages in North South University (NSU).\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Why fundamental reforms should precede elections",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/why-fundamental-reforms-should-precede-elections-3896681",
        "news_paper_name": "The Daily Star",
        "publish_date": "18-05-2025"
    },
    {
        "full_article": "\"Whenever the question of women's rights arises, excuses like religion or culture are used to stop it. Why?\" This question was asked by a young woman from a Catholic family in Argentina. On another occasion, the same question came from a Sudanese Muslim woman. I am sure the same question exists in the minds of countless women in Bangladesh, too.\nEverywhere—in homes, on the streets, in religious places—a number of men are eager to bring up religion whenever a women's issue comes up. Often, we come across many men who are not religious themselves but try to use religion or culture to oppose women's choices of clothing, lifestyle, occupations, etc. Regardless of their connection to religion, most men's justifications tend to converge when it comes to women. This is evident across various faith systems not just in Bangladesh but across the world.\nIn the current Muslim inheritance law, the person who seems disadvantaged when a woman gains equal rights is the man, primarily the brother(s). If there is no brother, then the uncle(s) and their sons on the father's side get a portion of the father's property instead of the daughter(s) getting all of it. But were all those who started the panic over equal property rights just these brothers and uncles? It doesn't seem so. Many in those crowds have daughters of their own. If their daughters get equal rights, what is their problem? Not many who protested equal inheritance rights have much property. What is this constant fear about, then, when it comes to women's rights? Or are they being used as pawns by interest groups?\n\nIn Muslim family law, the reason for a woman's smaller share of property has been that the man or men in the family would bear her full responsibility. But if this assumption no longer holds true, why won't today's religious scholars be open to updating the interpretations? In several countries—Turkey, Iraq, Tunisia, Morocco—religious scholars have taken steps to revise the law.\nIn Hindu and Buddhist societies, the tradition used to be giving a woman wealth or dowry during marriage. Sons inherited the father's property, daughters didn't get any share. Now, in India, equal inheritance rights for women and men have been provided legally. But in Hindu-Buddhist minority families in Bangladesh, girls are still deprived, which is justified using religion.\nIn Bangladesh, the number of families where men provide for women is rapidly decreasing. In fact, among the poor, a significant number of households are run by women. In middle- and upper-class families, more and more women are working. Many women now carry the responsibility of financially supporting their families. Some argue that since women get a share from both their father's and husband's properties, they already receive more. However, after receiving a large share of inheritance from his father, doesn't a man also keep an eye on his wife's property?\nIt's often assumed that all adult women are married, that their marriages are stable, and that they receive all their legal rights. But, research, field observations, and lived experiences show none of these are fully true. Unmarried, divorced or widowed women are excluded from these considerations.\nThere has been many cases where the inheritance that married women receive from their fathers exists only on paper. Most women still lack a stable place of their own. In some cases, their husbands pressure them to bring property from their fathers, while their brothers pressure them not to take it. If a woman takes her full share, she risks losing her connection with her natal family—the right to return, visit, or be loved.\n\nA woman's right to her husband's property is negligible, and often more theoretical than real. In both villages and cities, there are painful stories of cruelty and deprivation. Research shows that in rural farmers' families, a woman's working hours exceed those of men when counting all agricultural tasks, livestock care, and household work. Yet, her rights over property, maintaining which she has spent countless hours, remain uncertain. If she manages the household with her husband, she might retain use of the property, but not ownership. If that partnership breaks down, everything—land, house, animals, crops—can disappear overnight. And if she also has no inheritance from her parents to fall back on, she is left with nothing. She may have to survive under the care of her son(s). But what if the sons refuse to do so? We often hear that sons take responsibility for ageing parents and therefore deserve a larger share of property than their sisters. But that is not always the reality. There have been countless cases where sons were found not caring for their elderly parents. Daughters, on the other hand, have been often found to have taken on that responsibility.\nLet me give you an example. In my maternal grandmother's village lives a girl named Pemi, who has speech impairment. Her hut is a one room structure on someone else's land. She lives there with her sick mother, caring for and working hard to provide food for her. Her father had a small piece of land; her only brother took almost all of it, saying her share was spent on her dowry during her wedding. That marriage didn't last. She returned home. The brother didn't take her or their mother in. He says he can't afford to feed them.\nSo now, women of two generations—one denied property, the other with poor, uncertain income—live in a hut. Pemi tries to find work day and night to keep her mother alive. Sometimes she requests a local hujur for the treatment of her mother's unknown illness. Sometimes, mother and daughter cry together—not a normal sob, but a terrifying, heart-wrenching wailing. The villagers understand: Pemi couldn't bring along her child. Her former husband, backed by law, custom and patriarchal power, kept the child with him. Thinking about the child might be the one thing that breaks this hardworking girl's resilience.\nIn Dhaka city, in our neighbourhood, I recently heard of a bitter quarrel among brothers who own a building. None of them wants to take care of their mother. They calculate the cost of her stay, food, everything. This mother's misfortune is greater because she has no daughter to look after her.\nInside and outside the home, many women in Bangladesh go through painful struggles. There are countless teenage girls whose lives are at risk of turning out like those of Yasmin, Tonu, and Munia. And those who survive such odds still face harassment every day. It is hard to find a girl or a woman who has not been teased or attacked by unruly males or thugs while walking on the street. Lately, my students—current and former—tell me of a newer kind of harassment: men standing in front of them and threatening them for not wearing a burqa, using obscene language. These men want women to be submissive and/or send them back indoors. And wearing a burqa doesn't provide much safety either. I've heard of bitter experiences suffered by my students who wear it.\nPeople in Bangladesh live under a net of oppression and discrimination. For women, this net is even more complex. If men's groups see the woman who gave birth to them as inferior, what does that say about them? These people sometimes insist on giving women \"just rights\" instead of \"equal rights.\" But if rights are to be truly just—based on labour, contribution, hard work, and roles—then women should receive more than men. Will they accept that?\nAnu Muhammad is former professor of economics at Jahangirnagar University.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Men’s fear and women's 'just rights'",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/mens-fear-and-womens-just-rights-3896561",
        "news_paper_name": "The Daily Star",
        "publish_date": "18-05-2025"
    },
    {
        "full_article": "We commend the newly formed Nagorik Coalition for bringing some critical issues related to constitutional reforms back into focus and outlining roadmaps for their implementation. Some of the proposals it has forwarded, while not new, deserve proper reflection and consideration—particularly the call to limit a prime minister's tenure to two terms. In a country where autocracy has been enabled by the excessive concentration of executive powers, the proposal seems to be a step in the right direction. However, we believe term limits alone are not enough. What we truly need is a fundamental rebalancing of power to prevent the emergence of another authoritarian regime like that of Awami League.\nSheikh Hasina's rule of 16 years remains a chilling reminder of what happens when too much power is placed in the hands of one individual. It systematically dismantled democratic checks and balances by exploiting constitutional loopholes and turning vital institutions into instruments of partisan control. This was made possible by granting the ousted PM near-absolute authority over the executive, with the legislative and judicial branches duly falling in line. Thus, setting a two-term limit may prevent a repeat of one's continued rule. However, it cannot prevent their continued entrenchment of power by proxy, such as through family members, allies, or loyalists. This distinction is important to remember given our history of dynastic/coalition politics.\nTherefore, as some speakers at the Nagorik Coalition event have pointed out, more crucial than term limits is ensuring that no PM can wield unchecked authority. This means implementing robust mechanisms to distribute executive power, strengthen institutional independence, and hold those in power accountable. The proposed establishment of a National Constitutional Council, with representation from all three branches of the state, for appointments in vital institutions can also help ensure greater transparency and accountability.\nThe coalition's other proposals—such as introducing a bicameral parliament, reviving the caretaker government system, giving constitutional status to the four key parliamentary standing committees, political nomination of women candidates and direct elections to 100 reserved seats for women, and incorporating the July Charter into the constitution—also merit attention. However, the idea of a referendum on the July Charter and constitutional reforms, or of a Constituent Assembly to draft a new constitution, could complicate and unnecessarily delay the process. Instead, the current strategy of achieving consensus on constitutional amendments through dialogue organised by the National Consensus Commission seems to offer a quicker and more practical path. In that respect, it will be wise to have political parties sign some sort of a binding pre-election agreement to ensure the implementation of approved reform proposals.\nFor, ultimately, lasting reform depends on the compliance and cooperation of political parties. Regardless of which party forms the next government, fundamental agreements must be reached on key principles such as balancing of powers at all levels as well as institutional accountability. Only through such shared commitments can we ensure that our democracy does not again fall prey to unchecked rule.\n",
        "headline_1": "Unchecked power at the top must end",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/unchecked-power-the-top-must-end-3894426",
        "news_paper_name": "The Daily Star",
        "publish_date": "18-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 18, 2025 00:00:00  \nThe full scale of mismanagement, waste and arbitrary decisions that characterised Bangladesh's power sector under the authoritarian Awami League regime is increasingly becoming more apparent. One deal after another, struck by the state-run Bangladesh Power Development Board (BPDB), stands out for poor judgment and disregard for national interest. The 718MW JERA Meghnaghat plant stands as a prime example of these problematic deals. Despite the project's completion, it remains idle due to an acute gas shortage and transmission bottlenecks, yet the government is liable to pay millions in capacity charges. This arrangement, signed under a long-term power purchase agreement (PPA), is indicative of the imprudence that has defined energy planning in recent years where contracts were awarded without due diligence, tariffs were inflated and foreign interests were accommodated at the expense of public funds.\nThe JERA Meghnaghat plant is merely the tip of the iceberg in the power sector's crisis. Across the industry, the country is burdened with expensive electricity from unsolicited projects awarded under the now-defunct Speedy Supply of Power and Energy (Special Provision) Act 2010. These contracts often bypassed feasibility studies and were exempt from public scrutiny. This has led to an oversupply of generation capacity -- largely dependent on natural gas -- even though Petrobangla cannot provide even half of the required supply to keep existing plants running. Idle plants continue to collect capacity payments, bleeding the BPDB's finances dry without delivering electricity to the grid. At Meghnaghat alone, three large LNG-based plants sit underutilized due to gas shortages and delays in substation construction. Meanwhile, the government is forced to pay these idle power plant owners through capacity charges, wasting significant taxpayer funds just to meet the costly contractual obligations. \nBlame for this unsustainable mess rests squarely on the ousted Awami League government, which spent years pursuing power generation targets without securing fuel supply or transmission capacity. In many instances, contracts were awarded not on the basis of national demand forecasts or technical merit, but to serve political convenience, funnel money to individuals politically connected with Awami League, and cultivate foreign partnerships for short-term gain. This wilful neglect of prudent planning and financial discipline has saddled the nation with high-cost energy, undermined investor confidence and pushed public utilities like BPDB closer to insolvency. Experts have repeatedly cautioned against inflated demand projections and warned of the dangers of overcapacity, but such concerns were brushed aside. Instead of a stable, affordable energy system, the country has been left with one that is expensive, inefficient and shaped more by private interests than public need. \nThere is, however, a measure of hope that the current interim administration may begin to correct course. The initiative to renegotiate tariffs that started with the JERA plant is a step in the right direction. The incumbent adviser to the Ministry of Power, Energy and Mineral Resources Muhammad Fouzul Kabir Khan deserves a degree of appreciation for initiating this difficult and politically charged process. While his efforts cannot erase the consequences of a decade of misgovernance, they mark a crucial first step towards repairing the extensive damage inflicted upon the sector. To truly rectify the situation, the government must review all existing PPAs to assess fairness and economic viability one by one and phase out the unsustainable practice of capacity payments. Above all, long-term energy planning must be rooted in a reliable fuel supply chain and investment in transmission infrastructure. Bangladesh's energy future must not remain hostage to past mistakes. With a clear strategy and political will, the country can still build a power sector that truly serves its people.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Undoing power sector damage",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/undoing-power-sector-damage-1747490235",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       May 18, 2025 00:00:00  \nEven before the independence of Bangladesh, the waterway was one of the key modes for the movement of freights with India like it was historically the case through the railway. Most of the railway network of Bangladesh was also built and developed in the British period, starting with a 53-km long broad-gauge track between Darsana and Jagati, in 1862. The record also shows that steam navigation in inland waterways began in the mid-nineteenth century with passenger services between Kolkata and key river ports of erstwhile East Bengal. The river routes were relatively cheap compared to road transport. Nevertheless, since the independence of Bangladesh in 1971, the importance of waterways started declining, as the country became focused more on developing roads and highways. The emphasis on roadways has also put the developmental issues of railway to the backburner. Bilateral trade with India also largely depends on roadways, although waterways are still used to carry freight. \nIn 1972, two countries signed the Protocol on Inland Water Transit and Trade (PIWT&T) in accordance with Article VIII of the Indo-Bangla bilateral trade agreement. The protocol was signed to make mutually beneficial arrangements for the use of their waterways for commerce between the two countries. The protocol also allowed the passage of goods between two places in one country and to third countries through the territory of the other. So far, it is one of the few Indo-Bangla bilateral deals that is still working. \n The protocol was initially renewable every two years. Later, in 2015, with a few amendments, the deal became renewable every five years. The relevant section of the protocol said: \"It shall automatically be extended for successive five years unless either Government terminates the protocol by giving a written notice of its intention to terminate to the other Government at least six months before end of term. In case of termination, it shall cease to operate on the expiry of the respective term. But termination shall not affect the actions taken or agreements reached pursuant to this protocol.\"\nConsequently, the protocol was formally renewed on May 20, 2020, extending the scope. Two new routes and five new ports of calls were included in the protocol, making the total number of routes and ports of calls ten and eight, respectively. As the renewed period of five years will end on Tuesday next, it is to see what the governments on both sides of the border do. Suppose the governments maintain silence and neither side gives any notice for termination. In that case, the protocol will get another five years of extension, with the current terms and conditions unchanged. The automatic renewal will be effective from May 21, 2025. So far, there has been no indication from any of the governments to terminate the deal, especially when the two countries' bilateral ties have come under serious strain.\n\nIn the face of a mass uprising, Sheikh Hasina, the autocratic prime minister of Bangladesh, resigned and fled to India for shelter. Since then, the two neighbouring countries' bilateral relations have deteriorated. New Delhi's unconditional support to Hasian and persistent intervention in the domestic affairs of Bangladesh during one and half decades of the Hasina regime made the people of Bangladesh angry and disappointed. Hasina unleashed a reign of terror and oppression in Bangladesh with the backing of India. Her regime brutally killed around 1,400 people during the student-led mass uprising when more than 20,000 were also injured. As Hasina took shelter in Delhi on August 5 last year, a new era of Indo-Bangla ties has also emerged where Bangladesh signalled for a balanced and mutually respectful relationship. As Hasina had turned the country almost into a 'vassal state' of India, her ouster irritated the Indian establishment. Even after nine months of the fall of Hasina, India is yet to accept the reality in Bangladesh, making it difficult to restore normalcy in bilateral relations.\nNevertheless, bilateral trade is going on as both countries are interdependent regarding many products and services, and it is not easy to shift the sources of imports within a short period. The trade and transit cargo movements under the inland waterway protocol routes have also continued, though the volume has declined. The Bangladesh Inland Water Transport Authority (BIWTA) statistics showed that the total volume of cargo carried under the protocol declined by 13 per cent to 4.13 million tonnes (MT) in FY23 from 4.74 MT in FY22. In FY24, the volume declined further by 2.50 per cent in FY24 to 4.02 MT. The official statistics also showed that during the first half (July-December) of FY25, the water vessels carried some 1.97 MT of cargo in various protocol routes. Despite adding new routes under the protocol five years ago, most of the routes remained unused. \nThe protocol's main objective is to reduce the cost of bilateral trade and allow India to transfer goods using Bangladesh's inland waterways. It is also known as a river transit facility. \nAround 99 per cent of the cargo was carried under the inter-country trade arrangements, which means a negligible amount of cargo was transited through Bangladesh waterways from one part of India to another part. Another interesting feature of the cargo movement under the protocol is the dominance of Bangladeshi vessels, as around 99 per cent of the trip is conducted by Bangladeshi ships. It indicates that Bangladeshi water vessel owners have gained significantly in carrying bilateral trade cargo. \nAgainst the backdrop, it is clear that the importance of the protocol is there, and both countries need to continue the arrangement for bilateral trade. The protocol also provides necessary transit routes for India to connect the northeastern region, known as the seven-sisters, with mainland India. Though the usage of transit routes is small, keeping them open is helpful for India in reducing the cost of transferring products from one part to another. Bangladesh also needs to continue the facility for the neighbouring country as the movement of transit cargo is still limited and does not bring additional pressure on the movement of local cargo vessels. It is to see whether both governments will go for auto-renewal of the protocol or amend the agreement.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Renewing inland water trade & transit protocol",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/renewing-inland-water-trade-transit-protocol-1747490336",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       May 18, 2025 00:00:00  \nThe shocking murder of Dhaka University student Shahriar Alam Shammo has once again brought to the fore concerns over students' security on the campus, the country's prime seat of higher education. Shammo, a master's student at the Institute of Education and Research (IER), was youthful, energetic, and politically active. He actively participated in the July-August uprising of 2024 and was visibly involved in organising the department's freshers' reception on Tuesday. Video footage of his vibrant participation in that programme has since circulated widely on social media.\nYet, by a cruel twist of fate, Shammo was brutally stabbed to death by a group of miscreants near Suhrawardy Udyan later that very night. Initial reports suggest the murder followed an altercation with a group of youths after his motorcycle allegedly collided with one of theirs. Police have arrested three suspects, whom they claim are drug dealers. However, many believe that it was a politically motivated murder. Regardless of the speculation, a thorough and impartial investigation is essential to uncover the true motive and ensure that all those responsible are brought to justice.\nIn the aftermath of the incident, students have taken to the streets, demanding justice and even calling for the resignation of the Vice Chancellor. While the murder is reprehensible, it is important to recognise that Suhrawardy Udyan, where the incident occurred, falls under the jurisdiction of Shahbagh Police Station. It is, therefore, the responsibility of law enforcement agencies to ensure safety in and around this area.\nThe bigger question is this: how can a historically significant park, surrounded by prestigious institutions like Dhaka University, Bangla Academy, BSMMU, and the Bangladesh National Museum, continue to be a grey zone for drug dealers, addicts, petty criminals, and anti-social elements? Reports of criminal activity in and around the park are not new. What is shocking is that such activities continue to take place under the very nose of the police. The park remains poorly lit at night, further enabling illicit activities and discouraging public use.\nSuhrawardy Udyan could have been a vital green space offering respite from urban chaos-congestion, noise, pollution, and stress. Instead, it has become a source of fear and discomfort. Drug abuse is rampant, garbage litters the walkways, and muggers lurk in the shadows. Much of its greenery has disappeared due to poorly planned infrastructure development. Thus, what could have been a place to relax and a sanctuary of nature has tragically been reduced to an extension of the city's concrete sprawl and criminal underbelly.\nLet Shammo's murder be a wake-up call. It is imperative that Dhaka University's administration and the government address not only the security of the campus but also its surroundings. Shammo came to this institution to learn and grow, but left in a body bag. His family's grief is beyond words. Their loss is a tragic indictment of the system's failures.\nIn response to the tragedy, the Ministry of Public Works and Housing held a meeting with Dhaka University authorities on Wednesday and decided to permanently close the gate of Suhrawardy Udyan adjacent to the TSC, launch a coordinated operation to evict illegal shops, curb drug-related activities, and improve cleanliness. Besides, it was also decided to form a committee for regular surveillance, install adequate lighting and CCTV cameras, set up a dedicated police box, implement a structured management system modelled after Ramna Park, and restrict public entry after 8:00 PM. Many illegal shops and makeshift structures were evicted on Thursday as part of the measure. \nSuhrawardy Udyan is not merely a public park-it is a part of the nation's history. Allowing the park to degrade into a hotbed of crime not only endangers public security, but also dishonours its historical significance. Shammo's death must not be in vain. It must be the starting point of a serious effort to reclaim its past heritage.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Suhrawardy Udyan tragedy a wake-up call",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/suhrawardy-udyan-tragedy-a-wake-up-call-1747490387",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 18, 2025 00:00:00  \nYour esteemed newspaper recently reported that the foundation plaque of the Kalurghat Rail-cum-Road Bridge will not bear the name of the Honourable Chief Adviser as the inaugurator, rather the project's executing agency's name will only be written in the plaque. This marks a commendable shift from the tradition of self-promotion that often accompanies public project inaugurations in our country.\nIn Bangladesh, lavish inauguration ceremonies have become a cultural norm, particularly in public and political spheres. These events often seem more focused on showcasing the presence of dignitaries than on the actual purpose of the project - serving the public good. Significant amounts of public funds are spent on these occasions, yet such expenditures are rarely disclosed transparently. In many cases, executing agencies are forced to divert or mismanage resources to accommodate these unproductive costs.\nMoreover, it is not uncommon for these events to be delayed due to the late arrival of the chief guest, causing embarrassment for organisers and inconvenience for other guests and stakeholders. In our professional experience, we have witnessed banners bearing long lists of guest names, some of whom never attend. Others feel slighted if their names are omitted or if they are not given an opportunity to speak from the dais. These situations create awkward moments and unnecessary tensions, often overshadowing the purpose of the event itself.\nThis practice echoes a colonial mindset, where ceremony takes precedence over substance. In contrast, corporate and international programmes are generally conducted with efficiency and minimal showmanship, often focusing solely on the event itself without wasting time or resources.\nIt is time we moved away from these outdated practices. The true honour lies not in having one's name inscribed on a stone or banner, but in contributing meaningfully to society. Let us respect the public's time and resources by streamlining such events and focusing on the real beneficiaries - the citizens.\nMd. Refatul Hossain\nAdditional Director (retd.)\nDepartment of Agricultural Extension (DAE)\nFaridpur Region\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Avoid extravagant inauguration culture",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/avoid-extravagant-inauguration-culture-1747490406",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-05-2025"
    }
]