[
    {
        "full_article": "The Supreme Court of India walked a tightrope in its judgment delivered on September 15, 2025, on the Waqf (Amendment) Act, 2025, which amended the 1995 Waqf Act to regulate Muslim religious endowments, including vast land holdings across India. The Court put several controversial provisions on hold but refused to freeze the entire Act on grounds of constitutionality and other concerns. This turned out to be a rare instance where supporters and critics of the Act claimed vindication for their respective positions in the Court’s order. The government views the amendments as necessary to curb the alleged misuse and corruption under the earlier Waqf Act, while critics, including the Congress, see it as arbitrary interference in the affairs of the Muslim community. The Court has now stayed the requirement that only Muslims practising for five years can create waqf, and the power vested in District Collectors to adjudicate waqf property disputes. It also capped non-Muslim members to four in the Central Waqf Council and three in State Boards, down from potentially 12 and seven, respectively. The Court also directed that CEOs of Waqf Boards should preferably be Muslims. The removal of the provision for waqf-by-user recognition in the amended law has been upheld as valid by the Court, with the caveat that waqf properties registered as on April 8, 2025, under such a claim remain protected. Restrictions on waqf status for protected monuments and tribal lands were deemed constitutionally valid.While the order diffuses the conflict for now, the larger question of balancing religious autonomy and state regulation continues — and that is better tackled through building consensus within and between communities. Autonomy claims cannot be a facade for misuse of community resources by its own leaders; nor can any group of people lay claim over public resources in the name of faith. The state has not only the right but also the responsibility to ensure that people are not taken for a ride by anyone. The trouble arises when the state discriminates between religious groups in the application of this principle. The Court rightly went with the philosophy of presumption of constitutionality of laws passed by Parliament. But partisan politics of an extreme nature can delegitimise representational democracy. The government must consciously negotiate with the Opposition in Parliament to ensure that the laws enacted have the widest political and social acceptance. When laws affecting particular communities are made, they should be taken into confidence. None of this is easy, and complete consensus is never possible, but attempts should be made in that direction. Published - September 18, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        Waqf\n                    \n                            /                      \n                        \n                        minority group\n                    \n                            /                      \n                        \n                        land resources\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        corruption & bribery\n                    \n                            /                      \n                        \n                        religion and belief\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        social issue",
        "headline_1": "Letter and spirit: On Supreme Court and Waqf (Amendment) Act 2025 judgment",
        "headline_2": "The Supreme Court did well to stay and uphold different Waqf Act provisions",
        "link": "https://www.thehindu.com/opinion/editorial/letter-and-spirit-on-supreme-court-and-waqf-amendment-act-2025-judgment/article70060505.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "18-09-2025"
    },
    {
        "full_article": "The UN Commission of Inquiry, after a multi-year investigation, has concluded that Israeli authorities have committed genocide in Gaza. The finding is hardly surprising as the world’s leading rights organisations, including two Israeli groups, and genocide scholars, had already accused Israel of committing what is one of the gravest crimes in international law. Yet, the finding would lend weight to such reports and resonate before the International Court of Justice, which is hearing genocide charges against Israel, and the International Criminal Court, which has issued an arrest warrant for Prime Minister Benjamin Netanyahu. The UN Commission found “reasonable grounds” to conclude that four of the five genocidal acts — killing members of a community, serious bodily and mental harm, actions aimed at destroying the group, and preventing births — have been carried out since the war began following Hamas’s October 7, 2023 attack. Israel, which denies allegations of genocide and war crimes, has killed at least 65,000 Palestinians in Gaza in 23 months, many of them women and children. “The responsibility for these atrocity crimes lies with Israeli authorities at the highest echelons who have orchestrated a genocidal campaign with the specific intent to destroy the Palestinian group in Gaza,” says the panel’s leader, Navi Pillay.It is tragically ironic that Israel, a nation built by the survivors of the Shoah, is committing genocide against Palestinians. On the day the UN Commission released its report, Israel launched yet another ground offensive in the famine-stricken Gaza City. Israel’s responses to reports of war crimes and mass killings have invariably been further escalations, killing and displacing even more Palestinians. The war, prolonged by Mr. Netanyahu for his political survival, has left a stain on Israel’s national compass and deepened its global isolation. In the weeks ahead, France, the U.K. and several other countries are expected to recognise Palestinian sovereignty, while the European Commission has proposed to suspend trade concessions with Israel and sanction extremist Ministers. Yet, Israel, shielded by the U.S., shows little concern. The Trump administration is unlikely to turn up the heat on its closest ally. But Europe should start treating Israel as what it has become — a rogue state with genocidal intent and actions. India, once a champion of the Palestinian cause, has so far refrained from directly criticising the Jewish nation. But it should realise that an uncontrollable, expansionist Israel, blowing international law to smithereens, is not in India’s national or regional interests. New Delhi should speak up against the genocide and use its leverage to help bring the war to an end. Published - September 18, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        United Nations\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        Palestine\n                    \n                            /                      \n                        \n                        human rights\n                    \n                            /                      \n                        \n                        international court or tribunal\n                    \n                            /                      \n                        \n                        arrest\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        children\n                    \n                            /                      \n                        \n                        war\n                    \n                            /                      \n                        \n                        crime\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "Genocide in Gaza: On Israel and UN Commission of Inquiry finding",
        "headline_2": "India should speak up against Israel’s atrocities",
        "link": "https://www.thehindu.com/opinion/editorial/genocide-in-gaza-on-israel-and-un-commission-of-inquiry-finding/article70061283.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "18-09-2025"
    },
    {
        "full_article": "SC gives deadline for appallingly delayed Maha-wide local polls. But polls are overdue in 61% of urban bodies \nMaharashtra state election commission got its deserts from Supreme Court on Tuesday. “Inaction and incompetence” is a fitting description of its record over the past five years when elections to 27 of 29 municipal corporations became overdue. Terms of five corporations ended in 2020, of 18 others in 2022, and the rest in 2023. Mumbai, India’s financial capital, has gone 42 months without an elected local body, when rules allow a maximum gap of six months. Local self-govt remains suspended in thousands of municipal councils, zilla parishads and village panchayats also. This gross neglect is impossible to condone, especially after the poll body made light of SC’s Sept deadline to clear the backlog. Now, it’s got four more months, and a warning of “no further extension”. \nOne can hope, therefore, that Mumbai, Pune, Nashik, etc, will have elected corporations by Feb next year, but the larger, pan-India, problem remains unaddressed. Data shows elections to 61% of urban local bodies across 17 states are overdue. Tech capital Bengaluru last held municipal polls in 2015. And across India, civic polls are delayed by 22 months, on average. This undermines the whole idea of self-governance. Our cities and towns are a mess – as the monsoon just reminded us for the umpteenth time – because people don’t have a say in civic matters. State govts can run cities through administrators, but it takes councillors and corporators to bring people’s concerns into town halls.\nEven otherwise, India’s urban local bodies are weak by design. Many functions that should be under them are delegated to other state govt bodies. The biggest weakness is financial, though. On average, municipal corporations fund less than 30% of their expenditure from their own revenues. World Bank estimates Indian cities will need $55bn per year, for the next 20 years, to build infra, but all they can rustle up is $18bn. That shows up when roads and houses get flooded because drainage has not been expanded for decades. SC’s order will get the poll process rolling in one state, but the big fix for local self-govt – and people’s living conditions – has to come from the states.\n\n",
        "headline_1": "Mumbai & elsewhere",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/mumbai-elsewhere/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-09-2025"
    },
    {
        "full_article": "Subjects needing special intensive revision \nWe need to go back to school. Prof Jagdeep Chhokar’s passing made me realise this since his Association for Democratic Reforms was currently opposing SIR. Not only Bihar poll-rolls, many subjects must be specially and intensively revised. So much old syllabus has been dumped in the dust-bin of history. Achha let’s start with that only.\nSome fuddy-duddy teacher forced us to mug up stuff about foreigners who took an inch and became rulers. He warned that if we don’t learn the lessons of history, we are doomed to repeat it. Ha! What a fool he was, and anti-national too. Why we need to learn about Akbar-bakbar who tried combining all faiths? Stuppid, no? Let’s not din such illahi-conceived notions into students any longer. \nSame way, throw out chapters on nitwit Brits. Because of them only we are stuck with crazy angrezi which has kept us away from our vishwa destiny. Good thing we are also throwing their names out of our map. \nWhich brings me to geography. Much has been revised, and other ethnic communities are proudly-loudly demanding more. Political map was first redrawn on linguistic lines then cultural ones. Hill people plainsly say they want their own state. China also keeps trying to revise our borders, but Trump has stalled that – no controversy here. \nSIR-ji, physical map also needs you. Hills have been flattened thanks to ferocious monsoon and mining frenzy. Himalayan riverbeds have become Air BnBs; an airport terminal has landed on Mumbai’s Mithi river. \nForget physical and political maps. Let’s look at Physics. That toh keeps getting special intensive confirmation from political sources. Take Rahul G. He appears to lack gravity, but is a textbook case of all three Newtonian Laws. The First: he remains inert unless acted upon by an external force. Second Law: he illustrates the relationship between force, mass, and acceleration; Newton’s  F=ma is revised to Family, mother, grandma. Third Law: for every BJP action there’s invariably an equal and opposite reaction from RaGa. QED.\nEinstein’s E=mc2? SIR, you may be special to Bihar polls, but all poll-itical relativity gets intensely revised. Energetically. \n                                            ***\nAlec Smart said: “Manipur is mani-splendoured, many-splintered.”\n\n",
        "headline_1": "To SIR, with fear",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/to-sir-with-fear/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-09-2025"
    },
    {
        "full_article": "Japan, Korea & even Peru have cracked the cultural influence game. India must shed its statist approach to follow suit  \nWhen Joseph Nye coined the term soft power, he used it to describe the ability of a country to get other countries to want what it wants. On that metric, Japan’s soft power is humongous. This is best exemplified by the recent success of Japanese anime movie Demon Slayer: Infinity Castle that has already raked in more than $400mn worldwide after its release in major markets – including India – this past weekend. And the global spread of Japanese cultural products like anime and manga paves the way for other things Japanese.  \nCase in point, Japanese sake exports to India have risen by more than 900% over the last decade. Similarly, Japanese beauty products are projected to earn $3.73bn from the Indian market by 2030. All of this because of rising affinity for Japan among Indian consumers, which in turn provides Japan with considerable economic leverage in India. Of course, Japan isn’t the only country to adopt this approach. Korean culture – from K-pop & K-dramas to instant ramyun – has swamped the world in a hallyu or Korean wave. With icons like Psy and BTS, the country of 52mn people punches far above its weight in international mindspace, again leveraged by its renowned chaebols.  \nBut where does India stand in the soft power stakes? Yoga, ayurveda and Bollywood have great global appeal. Sabyasachi is creating substantial buzz in the fashion and couture scene. But what’s missing is a larger strategy to harness them for brand India. For a country of its size and diversity, India can certainly do better. Even Peru – population 32mn – has effected a global gastronomic revolution directly benefiting its farmers, thanks to a clear strategy. For India, first, the statist approach must go. Too much of India’s cultural exports are micromanaged by state institutions like ICCR. Creating opportunities for private sector and individuals should be priority. Second, Japan crafted the Cool Japan strategy for its cultural exports. Korea elevates its cultural icons for public diplomacy. India too needs to have its own strategy that brings together its best cultural offerings to pave the way for tourism, business and exports. Govt should enable, not dictate, for India to realise its true soft power potential.    \n\n",
        "headline_1": "Slaying market demons",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/slaying-market-demons/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-09-2025"
    },
    {
        "full_article": "Sept 17 is significant in history for a number of reasons. On this day, artisans and workers across the country joyfully celebrate Vishwakarma Jayanti. Hyderabad was liberated from the cruel Nizam and Razakars on Sept 17. And, on this day was born a statesman who has dedicated his entire life to the service of the nation and its people – our Prime Minister Narendra Modi.\nThis birthday is even more significant, as it marks his 75th year. On behalf of 140 crore Indians, I extend my heartfelt greetings to Modi-ji and pray to the Almighty to bless him with long life, energy and good health to achieve greatness for India.\n\nRead full story on TOI+\n\n",
        "headline_1": "‘Unique leadership, special charisma’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/unique-leadership-special-charisma/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 18, 2025 00:00:00  \nThe Bangladesh Bureau of Statistics (BBS) earned enough infamy for inaccurate, biased, distorted and even fictitious data over the years. Based on those data provided for creating social and economic indices, there was hardly any chance of getting a real picture of various aspects of the national life including even the Gross Domestic Product (GDP). The made-up outcomes of surveys and study led to \"just what the doctor ordered\". In this case, the doctor is the highest administration that has been after painting a rosy picture on all fronts of national life. More embarrassing was the fact that various government agencies and some private organisations including multilateral organisations came up with different sets of data to make the matter confusing and worse. \nClearly, this practice has improved over the past couple of years when the multilateral bodies insisted on accuracy of data so that they could help the country come out of the shady information and statistics. But still there is a long way to go before the nation knows about its status in terms of socio-economic performances, income, livelihoods and the gnawing poverty hampering equitable distribution of wealth. It is exactly against such a background, the government formed a taskforce in order to collate information scientifically and transform it into reliable data. The taskforce has suggested renaming the BBS as the Statistics Bangladesh (StatBD). Renaming something is not the all important task. What matters most is to bring about a paradigm shift in the statistical body's function. To that end, the organisation has to be given full autonomy independent of the administration that remains subservient to the ruling political party collaborating with each other in order to impose their decisions to conveniently present a false picture. \nThe most important suggestion made by the taskforce led by Dr Hossain Zillur, executive chairman of the Power and Participation Research Centre (PPRC) is the appointment of a chief statistician from the open market to head the government statistical body. Here the intention is clear: the number one position in the department has to be qualified enough to lead the operation of the StatBD. Under him or her, a dedicated team will put in their best of efforts in order to generate unalloyed data so vital for presenting an authentic picture of the country's social, economic health as well as other crucial facts of collective life. This means that the quality of the team must be equal to the task. \nIt is exactly at this point, the recommendation for formation of a council with the assignment of monitoring and overseeing the statistical body stands out. It is because the council will act as vanguard, leaving no room for sidestepping by the statistical body. There have been a lot of commissions including Anti-Corruption Commission (ACC) but those were never allowed to function independently. Quite a number of such commissions turned into toothless tigers. One recent administrative intervention superseding the Directorate of National Consumer Rights Protection (DNCRP)'s directive issued to correct the misnomer of rice speaks volume for the undue exercise of power and curtailment of independence of the institution. The culture of developing institutions has time and again been stymied. The Consumer Rights Protection Council is there to ensure the DNCRP's accountability and transparency but it is the ministry concerned that calls the shot. Let there be no such undue interference once the proposed StatBD comes into being no matter what its official name may be.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Transforming BBS",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/transforming-bbs-1758118629",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       September 18, 2025 00:00:00  \nAn independent, strong and effective human rights commission is indispensable for the protection and promotion of human rights. For decades, Bangladesh has faced censure both within the country and abroad for violation of human rights, particularly in the form of extrajudicial killings and enforced disappearances. But its National Human Rights Commission (NHRC) has remained weak and ineffective - a toothless tiger in the face of grave human rights abuses. With the interim government pledging to place human rights on a solid foundation and having already signed the International Convention on Enforced Disappearances, the need for reforming and strengthening the NHRC is more urgent than ever.\nIn this context, the government has recently unveiled the draft National Human Rights Commission (NHRC) Ordinance 2025, with an aim to strengthen the NHRC in line with international standards. The proposed ordinance, once enacted, will replace the NHRC Act of 2009. \nThe NHRC has long been ineffective, consistently ranked in the \"B\" category in international assessments. Of the 118 countries that have established national human rights institutions (NHRIs), 91 hold \"A\" status while 27 are classified as \"B\". Regrettably, only Bangladesh and the Maldives fall into the latter category in South Asia, while India, Pakistan, Nepal, and Sri Lanka have secured \"A\" status from the Global Alliance of National Human Rights Institutions (GANHRI).\nNHRIs are graded based on compliance with the Paris Principles, adopted by the United Nations General Assembly in 1993. These principles are regarded as the guiding principles for the formation and functioning of the commissions. These principles provide a set of internationally recognised standards to assess the credibility, independence and effectiveness of NHRIs. They also direct that the legal status of a commission has to be strong enough for it to be able to exercise its power independently. It also calls for making the selection procedure of its commissioners open and credible.\nThe NHRC of Bangladesh remained weak mainly because of some limitations in its legal framework, recruitment procedures and funding mechanisms. Although it has been a statutory body on paper, authorised to monitor and investigate violations of human rights, no matter who the perpetrator may be, in reality it has been far from independent. The newly proposed act seeks to bring the NHRC closer to the Paris Principles by complying with the key recommendations of the GANHRI.\nThe draft ordinance proposes appointing chairpersons and commissioners with proven contributions in promoting human rights, particularly in the fields of law and justice, education, healthcare, social services, human welfare and environmental conservation. The selection committee for the chairman and commissioners will comprise one judge of the Appellate Division of the Supreme Court, nominated by the Chief Justice, who will also serve as chairman; two Members of Parliament, one nominated by the ruling party and the other by the opposition; one female professor from a recognised Bangladeshi university, nominated by the University Grants Commission; one internationally reputed human rights activist or a civil society representative, nominated by the President; the President of the National Press Club or a journalist representative nominated by him; and one representative from small ethnic groups or disadvantaged communities. From the names recommended, the President will then appoint the commissioners.\nCurrently, the speaker of the parliament heads a seven-member search committee. Since the establishment of the NHRC, five commissions have been formed, with one chairman serving two consecutive terms. Except for a single university professor, all the chairmen have been retired top bureaucrats. Despite repeated criticism from civil society, the previous government appointed bureaucrats to these positions. Moreover, not a single civil society representative with real experience in human rights work has ever been appointed to the commission. Given their close ties to the government, it was hardly surprising that such appointees refrained from taking actions that would displease those in power. This structural flaw fundamentally undermines the NHRC's authority as an advocate and protector of human rights in Bangladesh. As a result, successive commissions have failed to play their expected role and, more importantly, to earn the trust of the people. \nTherefore, overhauling the recruitment process under the National Human Rights Commission Act has become urgent. Ensuring fairness and transparency in recruitment is the foremost requirement for making the NHRC functional. At the same time, it cannot be denied that the success and effectiveness of such an institution depend on political will, an enabling environment and strong leadership.\nAnother fundamental weakness of the NHRC Act 2009 lies in the commission's mandate, which excludes its power to investigate certain bodies, such as the armed forces and other law enforcement agencies. When most of the worst human rights violations are perpetrated by law enforcers, and the NHRC lacks the mandate to investigate them, impunity is inevitable. The draft ordinance proposes to remove this restriction, empowering the commission to directly investigate and inquire into allegations against any government authority.\nThe commission also lacks financial independence, as its budget is allocated through the Ministry of Law rather than directly to the NHRC. This arrangement has created opportunities for the Executive to exert control over its activities. To address this, the new draft proposes granting the NHRC autonomy over its own budget. In addition to receiving funds directly through annual budgetary allocations, the commission will also be able to access fund from local and foreign donors. Furthermore, as the commission has so far remained Dhaka-centric, the draft envisions expanding its presence to the divisional, district, and even upazila levels, and providing it with necessary manpower.\nOverall, the draft NHRC Ordinance proposes a fairly comprehensive set of measures to strengthen the Human Rights Commission. To further reinforce the commission's independence and authority, the government could also consider elevating the NHRC to the status of a constitutional body. However, the government's responsibility does not end with the drafting an ordinance, it must also ensure its enactment and effective implementation. Reforming and strengthening the NHRC is not merely about fixing a single institution, it is about reinforcing the pillars of democracy, justice and accountability. A credible and empowered NHRC could go a long way towards restoring public confidence in the state institutions and enhancing the country's image internationally.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Reforming human rights commission",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/reforming-human-rights-commission-1758118683",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 18, 2025 00:00:00  \nCox's Bazar has become a regular route for human trafficking by sea in recent years, particularly after more than 1.4 million Rohingya took refuge there. With the sea remaining calm between the monsoon and winter, smuggling rings exploit this period to operate freely. At a meeting on 2 September, law enforcement agencies, lawyers, media workers, and NGO representatives at the Cox's Bazar Police Superintendent's Office rightly emphasised the need for advance preparations to prevent trafficking during the winter season. This is indeed essential.\nMany Rohingya, desperate to escape their conditions in the camps, risk their lives to reach Malaysia in search of a better future. Women and girls are the most vulnerable. Alarmingly, traffickers are also luring Bangladeshi youths into taking this perilous route. Deaths in Thailand's jungles, torture by smugglers, and starvation at sea have repeatedly made headlines. According to reports, over 657 Rohingyas died on dangerous sea journeys in 2024 alone.\nHuman trafficking through Cox's Bazar negatively affects regional labour markets, particularly in Malaysia. Trafficking routes span 21 points across Teknaf, Ukhia, Maheshkhali, and Cox's Bazar Sadar. Although joint forces have rescued victims and arrested traffickers, the lack of specific information on which fishing trawlers are involved remains a serious challenge. Installing GPS systems on trawlers and bringing fishermen under an online database could be effective solutions.\nMoreover, trafficking cases often stall as victims' families hesitate to file complaints, while lengthy trials, weak witness protection, and intimidation by criminals further undermine justice.\nThe government must adopt strong, coordinated measures to curb trafficking by sea, speeding up judicial processes, raising awareness among locals, and tightening surveillance. Only then can this dangerous trade be stopped.\nAshikujaman Syed\nBusiness Development Manager\nTianjin Pharmacn Medical Technology Co., Ltd., Tianjin, China\nsyedashikujaman@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Human trafficking from Cox's Bazar",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/human-trafficking-from-coxs-bazar-1758118712",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 18, 2025 00:00:00  \nIn our society, many girls are still married off at a young age during their school years. This harmful practice of child marriage not only robs them of their childhood but also creates a serious barrier to their secondary education.\nSecondary school is a crucial period when students build the foundation for their future. But for many girls, this journey is abruptly halted. When married young, they face household responsibilities, social expectations, and often motherhood-far too early. As a result, their education, dreams, and mental well-being are severely disrupted.\nChild marriage doesn't just end classroom learning. It isolates girls from their friends, reduces their confidence, and limits their ability to think about a future beyond their homes. In lower- and middle-income families, the situation is worse. Many parents believe early marriage ensures a girl's \"safety,\" not realizing they are sacrificing her independence and potential.\nDespite existing laws against child marriage in Bangladesh, enforcement remains weak. Families continue to arrange such marriages, often with community support or silence. To stop this cycle, we need strong awareness and action from all sides including families, teachers, society and the government.\nParents must support their daughters' education and delay marriage. Teachers and friends should encourage girls to stay in school. Laws must be enforced strictly. And as a society, we must stop treating girls as burdens and start seeing them as future leaders, professionals, and changemakers.\nEvery girl deserves the chance to study, dream, and grow up on her own terms. Stopping child marriage is not just a legal issue, it's a moral responsibility.\nJannati Akter\nStudent\nJumarbari High School\nSaghata\nGaibandha\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Child marriage - a barrier to girls' education",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/child-marriage-a-barrier-to-girls-education-1758118735",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-09-2025"
    }
]