[
    {
        "full_article": "AIADMK general secretary and former Chief Minister Edappadi K. Palaniswami’s assertion that Union Home Minister Amit Shah, while in Chennai last week, did not talk of power sharing in the event of the victory of the newly stitched AIADMK-BJP alliance in the 2026 Assembly election, is not surprising given the State’s contemporary political history. Tamil Nadu is not known to have multi-party regimes. It did not have such an arrangement even in 1952 and 2006 when the Assembly elections did not produce a single-party majority. Even in June 1980, political observers were stunned by the decisive vote in favour of the AIADMK and the rejection of the DMK-Congress combine, which had agreed on sharing power. The AIADMK’s victory was considered to be sensational because in January that year, it had bagged only two Lok Sabha constituencies as against the 37 seats for the DMK-Congress coalition. An explanation was that even though the DMK-Congress front had proposed a coalition ministry, it was an idea that did not go down well with the voter. Since then, the two Dravidian majors have shunned the idea of a coalition government. However, what is inexplicable is the AIADMK chief taking almost a week to clarify the party’s position, even though he was a part of Mr. Shah’s media meet in Chennai. Mr. Shah had said that the issue of the BJP becoming a part of the ministry would be decided after the election. On two earlier occasions including one after his meeting with Mr. Palaniswami in New Delhi last month, Mr. Shah had referred to the nomenclature of the National Democratic Alliance.The Congress, which lost power in the State in 1967, has also expressed its desire on several occasions to have a share in power. In 2006, when the DMK regime was dependent on the Congress for a majority, former chief of the Tamil Nadu Congress Committee E.V.K.S. Elangovan ruffled the DMK’s feathers by demanding a slice of the cake. It is natural that the BJP, which for the first time in Tamil Nadu, saw an improved vote share in the 2024 general election, of 11.4%, without the support of either Dravidian major, is now keen to share power. It is also likely that it might want the AIADMK to follow the example set by the Telugu Desam Party (TDP) in neighbouring Andhra Pradesh. Despite a majority of 135 seats in the 2024 Assembly election, the TDP accommodated the BJP and the Jana Sena Party in the State Cabinet. Apart from the two national parties, the Pattali Makkal Katchi and the Viduthalai Chiruthaigal Katchi, in Tamil Nadu, are known advocates of the concept of power sharing. The AIADMK and the BJP should focus on a credible alternative plan of action such as addressing the State’s chronic problems and livelihood issues before talking about sharing power. Power is a tool of politics, and not its ultimate goal. Published - April 18, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        All India Anna Dravida Munnetra Kazhagam\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Assembly Elections\n                    \n                            /                      \n                        \n                        Dravida Munnetra Kazhagam\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        General Elections 2024\n                    \n                            /                      \n                        \n                        National Democratic Alliance\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        Telugu Desam Party\n                    \n                            /                      \n                        \n                        Andhra Pradesh\n                    \n                            /                      \n                        \n                        Jana Sena Party\n                    \n                            /                      \n                        \n                        Pattali Makkal Katchi\n                    \n                            /                      \n                        \n                        Viduthalai Chiruthaigal Katchi",
        "headline_1": "​Power and agenda: On the AIADMK-BJP alliance",
        "headline_2": "A joint plan of action, not a coalition government, should be priority",
        "link": "https://www.thehindu.com/opinion/editorial/power-and-agenda-on-the-aiadmk-bjp-alliance/article69460996.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "18-04-2025"
    },
    {
        "full_article": "The University of Cambridge issued a press release regarding a paper coauthored by one of its scientists that reported an exoplanet called K2-18b may be habitable, with the misleading headline, Strongest hints yet of biological activity outside the solar system. The paper, published on April 17, 2025, made headlines because astronomers have been interested for some time in this exoplanet’s peculiar surface physiochemistry. The paper is to its credit sedate in its prognostications: the authors have reported detecting the presence of dimethyl sulphide or dimethyl disulphide in K2-18b’s atmosphere; the former is considered a sign of life on the earth and could be on the exoplanet. Independent scientists and the paper’s authors have called for dispassionate efforts to refine the data and reduce uncertainties as well as to double-check the implications. If the history of the search for biomarkers on other planets both within and without the solar system is any guide, there is no guarantee that the findings will not be overturned. The cosmos still harbours too many mysteries for us to not be surprised by new information awaiting discovery. Research of this nature — initiated by curiosity and a pursuit of the unknown — has sometimes been overtaken by hype. Unfortunately, it faces another threat today: funding cuts of the type U.S. President Donald Trump has unleashed in his country.After downsizing or cancelling grants issued via the National Institutes of Health, Mr. Trump began holding entire universities hostage: drawdown DEI initiatives and rein in student protests or forgo federal funding, he seemed to say. The institutions affected count some of the world’s best in their ranks and the funding withheld, a non-trivial fraction of that spent on certain subjects worldwide. Earlier this month, the White House’s budget proposal for the 2026 fiscal revealed its plans to cut National Oceanic and Atmospheric Administration funding by 27%, nix most spending for science at NASA’s Goddard Space Flight Center, and halve NASA’s earth-science budget. The essential programme is to control the practice and pursuit of science that does not align with Republican state ideology. Curiosity-driven research, such as that concerned with the possibility of extraterrestrial life, both proves universities’ freedom to explore the unknown and fulfils the innate curiosity of humankind. However, the Trump government’s policies leave whatever research freedom that remains very precious yet also more vulnerable to misinformation and ideological capture, and the world itself more short-sighted. Published - April 18, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        science (general)\n                    \n                            /                      \n                        \n                        astronomy\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        university\n                    \n                            /                      \n                        \n                        finance (general)",
        "headline_1": "Life unknown: On science and research freedom",
        "headline_2": "The cosmos holds limitless mysteries for the constrained human mind",
        "link": "https://www.thehindu.com/opinion/editorial/life-unknown-on-science-and-research-freedom/article69461009.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "18-04-2025"
    },
    {
        "full_article": "UK top court’s ruling upholding a biological definition of women is a much-needed example of common sense\nUK Supreme Court’s verdict clarifying that only biological women meet the definition of a woman under equality laws is reaffirmation of common sense. The court was clear that it was only adjudicating whether trans women with gender recognition certificates have protection from discrimination as women, and not infringing on trans rights. Given that context, it is illogical to argue that spaces and services designated for women should also be used by trans women. Doing so could actually infringe on the rights and protections of women.\nThis is a raging debate in the West. The issue was so weaponised by elements of the left that aggressive rightwing response found some resonance even in people who disagree with most bits of political right’s agenda. It is nobody’s case that trans people should not be afforded the recognition or, where needed, protection. But blurring gender lines is not the answer. In public life, certain spaces and services have been designed for women because of particular vulnerabilities they face – from men. Extending those very facilities to trans women defeats their purpose. What muddied the waters further in UK was the move in Scotland to push for a self-identification system for those wanting to change their gender. Although the Scottish move was blocked by British Parliament, it sparked wider and justified concerns about conflating women and trans women. Such a conflation would have had serious ramifications in everyday life. There is already a huge debate around trans athletes and their participation in competitive sports.That debate is by no means over.\nIn India, the question of men, women and trans was elegantly addressed by the Supreme Court in 2014 by recognising the transgender community as a third gender, reaffirming their constitutional rights. That’s a sensible way to deal with the issue. \n\n",
        "headline_1": "En-Gendered",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/en-gendered/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-04-2025"
    },
    {
        "full_article": "V-P’s comments on SC strayed far beyond the propriety demanded of those who hold largely ceremonial offices\nIt wasn’t the first time Dhankhar’s comments were at odds with the remit and decorum of his constitutional office – but what he said on Thursday was perhaps the most regrettable as yet. The proximate reason for V-P’s ire seemed to be the Supreme Court’s governors judgment. He described the top court as a “super Parliament”. Worse, he said judges have “absolutely no accountability because the law of the land does not apply to them”. But it’s when he said Article 142 of the Constitution – this gives SC special powers, which it invoked to decide on the Ravi vs TN govt case – was “a nuclear missile against democratic forces, available to the judiciary 24×7”, that he most noticeably departed from norms that guide those holding largely ceremonial constitutional posts. That he made all these remarks at a Rajya Sabha internship programme’s valedictory event is the bitter icing on a very unappetising cake.\nBefore examining V-P’s comments in more detail, it’s necessary to restate certain things. The V-P post, aside from the job as presiding officer of the Upper House, is a ceremonial one. Therefore, a V-P has no locus standi when it comes to matters of policy, politics and judicial verdicts. That means all news consumers, the readers of this newspaper, for example, must realise no matter what any V-P says on any current affairs issue, his post means his comments must be discounted entirely. Similar constraints apply to those holding the job of president and governor. While all our presidents, including the incumbent, have largely been correct in their approach to the job, many governors have strayed so far as to make any distinction between them and politicians meaningless. Dhankhar as governor often answered to that description.\nComing back to his comments, Dhankhar on Thursday also pushed for an amendment to Article 145(3), which deals with the composition of SC benches that decide questions of constitutional law. This is extraordinary. Here’s a constitutional post holder critiquing a constitutional provision that defines how the country’s top constitutional court should go about its core business. There are more improprieties here than we care to count.\nIn today’s fractious political environment, it’s perhaps a good idea to belabour the point. The issue here is not that Dhankhar as a person can’t hold a view that’s highly critical of any or even all aspects of the judiciary’s functioning. What’s unfortunate is that Dhankhar, speaking as India’s vice president, made observations of the kind he made on Thursday.\n\n",
        "headline_1": "Out of line",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/out-of-line/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-04-2025"
    },
    {
        "full_article": "Trump’s tariff tirade has become what might literally be described as ass-inine\nEven as he put a 90-day pause, which excludes China, on the tariff blitzkrieg he’s threatened to launch on the world, Donald Trump dropped another bombshell by making a public post saying that more than 70 countries have lined up to perform an act of osculation on the nether terminus of his alimentary canal.\nThat’s the sanitised version. What Trump, who is known for his unrestrained and unexpurgated gift of the gab as much as for his gift of the gaffe, actually said was that the unnamed nations were all eager, and more than willing, to kiss his a blank blank e.\nThis verbal assault on the protocol of politesse which governs diplomatic discourse, coming from an individual who is regarded as the most powerful on Earth, is in its own way as deserving of a footnote in the pages of history as Khrushchev, then the first Secretary of the Communist Party of USSR, taking off his shoe and banging it on his desk in UN General Assembly to express his displeasure with the proceedings.\nLinguists and other students of what might be called the physiology of language might note that the US president did not use the American English word for the part of the body referred to, which is spelt and pronounced in the same way as the three-letter synonym for donkey.\nThis Americanism indeed has entered unexpleted parlance whereby sports coaches routinely exhort their team to ‘kick ass’ the opposing side, and psycophants are deemed to be ‘ass lickers’.\nThe current tenant of the White House however chose instead to employ the four-letter British word, the resonant ‘r’ of which imparts to it an anatomical explicitness that makes it taboo in polite company and in the presence of small children, neither likely to be within the ambit of the Don’s MAGA constituency.\nThe US president is much given to referencing body parts and bodily functions to disparage his opponents. And his latest trope will only underline the growing perception that his administration is, in all senses of the term, a truly bum deal.\n\n",
        "headline_1": "Don’s bottom line",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/dons-bottom-line/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-04-2025"
    },
    {
        "full_article": "A cultural revolution is underway in America. It’s not yet clear how similar it is to Mao Zedong’s decade-long chaos-inducing mass mobilisation movement in China, the most famous cultural revolution in modern history. But there are some parallels between Trump’s America and Mao’s cultural revolution, which will be 60 next year.\n\nSome are calling it MAGA Maoism, which can be summed up in three nicely alliterative words: badge, bureaucracy, boldness.\nRead full story on TOI+\n\n",
        "headline_1": "Make America Maoist asap",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/make-america-maoist-asap/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-04-2025"
    },
    {
        "full_article": "The eagerly awaited meeting between Chief Adviser Prof Muhammad Yunus and the BNP ended, as expected, with a major difference of opinion on the election dates. The CA stuck to his well-known stance that the election will be held anytime between December 2025 and June 2026, and the BNP stuck to its position that the polls must be held by the end of this year. In contrast to most of their previous meetings, the BNP, for the first time, expressed serious dissatisfaction afterwards.\nHowever, Dr Asif Nazrul, law adviser to the interim government had his own narrative that the BNP did not \"appear dissatisfied\" and stressed that \"under no circumstances will the election go beyond June next year.\" Prior to that, he said the election cannot be held until the trial for the crimes against humanity committed during the July uprising is completed. This raises the legitimate question: can a judicial process be set in a time-barred manner, and if so, will it be acceptable internationally? The chief prosecutor of the International Crimes Tribunal (ICT), Advocate Tajul Islam, had objected earlier when such a time limit was set for the crucial trials.\nThe Jamaat-e-Islami ameer, on his part, has said that the election should not go beyond the next Ramadan, which, in calendar terms, means that it should occur before the last quarter of February 2026. It sounds like a well-thought-out middle ground.\nThe election proponents think setting up a democratically elected government is the most important task at hand. It will restore the people's right to choose their own leaders, to get a parliament where policies will be transparently discussed and adopted, and to get a government that can be held accountable. The interim nature of our present governance process will come to an end, and we will be able to relaunch our democratic journey. Most importantly, the feeling of uncertainty will come to an end and be replaced by a sense of stability that only an elected government with the people's mandate can provide.\nAt present, the world is dealing with us mostly because of the personal prestige and stature of one person, Prof Yunus, and not due to the legitimacy of the government he heads. Whatever the extent of our pride for having a leader of his stature may be, it cannot substitute for the prestige and acceptance of a government with people's mandate. Genuine democracy has been our source of pride from the time of our Liberation War, and we condemned Sheikh Hasina for having deprived us of that. Thus, restoration of democracy and getting an elected government should not be unnecessarily delayed.\nThose who are opposed to having the election by December this year feel that time is inadequate for reforms and holding the election will mean restoring the rotten practices of the past, which included dynastic politics and one-person rule. The argument they use—one which has a strong emotional appeal—is that moving to the old-style politics will make a farce of the sacrifice of 1,400 lives during the uprising. This sentiment is very strong and should by no means be ignored. Whatever we do, we must incorporate the fundamental values—democracy, freedoms, rights of all groups and individuals, equality, anti-discrimination, a nation under law, political accountability, etc— that the uprising tried to evoke in all our future actions.\nBut the need for reforms, which is a widely accepted notion, should not be used as an excuse to postpone the election. Just as these fundamental reforms are necessary, so is an elected government. This author and this newspaper have repeatedly written about how we need and can have both the reforms and election by December.\nWe have not been able to decipher why the CA insists on the six-month time variation. One could understand this position during the early days, when it was uncertain how much time would be required by the reform commissions. But now all the reform recommendations are in. The follow-up process—dialogue with the political parties—has also been very efficiently started. We think Prof Yunus's approach has so far been hugely effective. If the same pace is followed, then within the eight months that is left before the December deadline, significant reforms can be agreed upon and instituted. If we accept the two and half months delay as proposed by Jamaat—till before next Ramadan—then the interim government should have no reason not to announce the election roadmap. The Election Commission has announced its preparedness.\nFrom this newspaper's point of view, June does pose a lot of challenges for holding the elections in terms of weather conditions. Except for one election in June 1996—following the resignation of Khaleda Zia's government in February 1996 and the constitutional requirement to hold an election within 90 days—all the elections since the fall of military rule in 1990 have been held in winter months. The arguments for elections in winter are solid: no rain, no floods and pleasant temperature, all of which contributes to giving the national polls a festive colour and mood. So why the CA wants to take the risk of facing natural calamity that may jeopardise his fundamental commitment to the people is not really clear.\nThe election uncertainty has been further exacerbated by a social media campaign that Prof Yunus should continue in power for several more years. This, of course, is a tribute to his stature, prestige, and the public confidence in his leadership. But there are many other forces, with not the best of intentions for the CA, who may be working behind it. There is a public perception that a section of his interim cabinet, who will have to relinquish their coveted position the moment the CA hands over power to an elected government, is adding fuel to this campaign. This suspicion has unnecessarily been given credence by the home affairs adviser, who said people had gone to him saying, \"Prof Yunus should prolong his stay for five years.\" Social media campaigns are one thing, but comments made by a senior cabinet member—which he tried to explain saying that it was not his opinion and that he was only repeating what ordinary people were telling him—generate doubts.\nWhether such a step, however well-intentioned, is politically wise, institutionally possible, legally acceptable, and good for Prof Yunus's national and global reputation, is something that should be seriously thought about. As we all know, the legal thread on which the legitimacy of this government hangs is an opinion (not a judgment) by the Appellate Division, made to address a special circumstance. As his lifelong admirer and sincere well-wisher, I think that an undue extension of his tenure would mire Prof Yunus into unnecessary and, for him, undignified controversies.\nWe understand the BNP's eagerness for an early election, and that not all of it is based on altruism. We also understand that the reluctance of the National Citizen Party (NCP) regarding the election being held before significant reforms and trials of Sheikh Hasina and others has a lot of partisan considerations behind it. Jamaat's ambivalence is also based on partisan factors. So our national interests are not getting the priority that they deserve.\nWe have three stakeholders on the issue of election: the interim government; the political parties of all shades; and the voters. The viewpoints that we have so far heard belong to the first and second groups of stakeholders. As to what the general public wants, we do not yet know and have heard very little. That has been a major flaw of us journalists. We cannot claim to know. On the bases of our past reporting and experience, we can make an educated guess that they would want their right to vote—which they have been deprived of since 2014—restored. But they would also want stability, economic growth, price stability, employment, etc, all of which is linked to the economy, which in turn needs stability to bear fruit. So both the right to vote and economic growth can be triggered and sustained mainly through the return of an elected government.\nHence, our argument is in favour of an election by December 2025, with an additional six weeks to accommodate Prof Yunus's wish for more time, till the middle of February 2026.\nMahfuz Anam is the editor and publisher of The Daily Star.\n\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Unhealthy election controversy must be resolved",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/the-third-view/news/unhealthy-election-controversy-must-be-resolved-3873826",
        "news_paper_name": "The Daily Star",
        "publish_date": "18-04-2025"
    },
    {
        "full_article": "We respect the right of students from polytechnic institutes to protest for their cause. In a country where technical education is often neglected, their six-point demand—including the removal of \"controversial\" craft instructors recruited after 2021, restructuring the diploma engineering programme into a four-year course, reserving 10th-grade engineering posts for diploma graduates, establishing a separate Ministry of Technical and Higher Education, etc.—merits both policy consideration and constructive dialogue. However, we cannot condone the manner in which they exercised their right to protest, infringing on the public's right to free movement.\nWednesday's road and railway blockades, halting communications in more than a dozen districts as part of a coordinated movement, were yet another example of how disruptive such protests can be. According to a report by this daily, in Dhaka, over 1,000 students from Dhaka Polytechnic Institute blocked the Satrasta intersection in Tejgaon for nearly eight hours. In Cumilla, over 500 students blocked the Dhaka-Chattogram highway for hours. Similar protests were also reported in Chattogram, Rajshahi, Barishal, and elsewhere. As a result, public transport systems broke down, emergency services were delayed, and gridlocks paralysed key intersections and highways, causing massive suffering. In one instance, the military had to be deployed to disperse protesters. Whether their firing of blank shots was necessary or even authorised may be debated, but the mere fact that such measures were needed shows how unmanageable the situation had become.\nWhile the protesters later announced a relaxation of a planned \"rail blockade\" on Thursday, pending the outcome of a meeting with the relevant authorities, they eventually expressed dissatisfaction with the discussions and declared plans to launch even tougher programmes. If executed, it can only mean more suffering. This is not constructive activism; this is holding the public hostage with the sole intention of forcing a decision, which is unacceptable. We cannot allow legitimate grievances to be pursued through illegitimate means. We have seen this tactic used repeatedly since the July uprising, as numerous groups—students in particular—embraced their newfound freedoms of speech and assembly in ways that often caused chaos and unrest.\nIt must be acknowledged that this government, unlike its predecessor, has shown greater responsiveness to protest-driven demands. For instance, soon after Wednesday's protests, Mostafizur Rahman Khan, the principal of Dhaka Polytechnic Institute, was removed from his post. This is not the kind of response students would have received under the old order. So they, too, must show greater restraint, and pursue their cause through peaceful means. We also urge the government to send a stronger message against public disruptions. As the country edges closer to the next election, disruptive protests and blockades may likely continue. So the government must enable the police to act decisively in such situations. It may also consider designating specific areas for protest gatherings, which would protect both the protesters' rights and the public's.\n",
        "headline_1": "Don’t hold the public hostage to press demands",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/dont-hold-the-public-hostage-press-demands-3873581",
        "news_paper_name": "The Daily Star",
        "publish_date": "18-04-2025"
    },
    {
        "full_article": "Biman Bangladesh Airlines has recently been scrutinised for alleged ticket syndicates that manipulate fares through artificial shortages. Reports indicate that senior Biman officials were involved in inflating ticket prices for Malaysia-bound flights in May last year. This issue has sparked widespread criticism, particularly from expatriate workers who rely on affordable air travel. To understand this controversy, it is essential to examine the mechanisms behind Biman's pricing strategies and the broader challenges within Bangladesh's aviation sector.\nPassengers frequently complain that Biman does not sell tickets even when flights appear to have available seats. A combination of fare control strategies and market practices drives this perception. For instance, Biman, like many global carriers, uses a nesting strategy that categorises tickets into hierarchical fare classes. These classes are dynamically adjusted based on demand. When demand is high, lower fare classes are withheld, making it seem like cheaper tickets are unavailable despite empty seats. Additionally, travel agents who have already met their sales targets may have little incentive to continue selling Biman tickets, further distorting availability. The situation is compounded by the \"sugar class policy\" on certain routes—some seats are withheld for passengers without checked baggage due to weight restrictions. Since these passengers are rare on long-haul flights, seats often go unsold, reinforcing the impression of inefficiency of the airline.\nRecent social media comparisons have pointed out stark disparities in fares. One post showed that on the same date, Biman's ticket from Dhaka to Riyadh was more than four times costlier than Air India's from Kolkata to Riyadh. While such comparisons evoke strong reactions, they overlook structural issues. Bangladesh's aviation environment is far more expensive than that of its regional counterparts. The price of jet fuel in Bangladesh is higher than that in most neighbouring countries, including India. Additional civil aviation surcharges in Bangladesh can reach 72 percent annually on delayed payments, substantially higher than the 8-18 percent charged in neighbouring countries. Biman also lacks subsidies or fee waivers that other regional airlines enjoy.\nThe market imbalance also plays a significant role. With only 38 airlines operating in Bangladesh compared to 50 in India, the demand often outpaces supply. The recent cancellation of 58 weekly flights to the Middle East further tightened the market. The exit of airlines like Jazeera Airways, Oman Air, and Fly Dubai from this corridor has exacerbated the situation. Moreover, Biman holds a 22 percent market share in Bangladesh's aviation sector, while foreign carriers dominate the remaining 78 percent.\nTicket sales through a limited number of travel agencies also contribute to inflated prices. These agencies possess large International Air Transport Association (IATA) bank guarantees, allowing them to dominate the Global Distribution System (GDS). They can manipulate availability, indulge bulk purchases, and impose significant markups. Although group bookings are a standard airline practice to boost revenues, Biman has curtailed this option on most routes due to public criticism. Additionally, these major agencies often rely on informal sub-agencies that operate without regulatory oversight, making it difficult for Biman to track or control ticket pricing abuses.\nBiman's operational decisions are often shaped by political and public pressure, which limits its ability to adopt globally accepted revenue-optimising strategies. For example, although a reduction in Middle East flights and an increase in demand during Ramadan could justify fare hikes, Biman chose not to implement a scheduled increase in February 2024. Instead, it maintained or lowered fares to ease the passenger burden.\nThe airline's route planning has also been affected by non-commercial factors. Although Biman decided to suspend its loss-making Manchester route to concentrate on the Middle East, it later reversed the decision due to pressure from the diaspora. This reflects the tension between financial sustainability and national sentiment. Biman's average fleet utilisation in 2023 stood at 8.4 hours per aircraft per day, lower than the global benchmark of 10-12 hours, a sign of inefficiency rooted in both operational and political constraints.\nTo promote fairness and transparency in ticket pricing, several reforms are necessary. First, Biman must promote direct ticket purchases more effectively. Although a 10 percent discount is offered for online bookings, uptake remains low. Many avoid online purchases due to tax implications or a lack of access to digital payment tools. Increasing the limit on mobile financial service (MFS) transactions could help. For example, current bKash limits—Tk 30,000 daily and Tk 200,000 monthly via agent deposits—are often too restrictive for ticket purchases.\nSecond, regulatory oversight of travel agencies and sub-agencies must be strengthened. According to the Civil Aviation Authority of Bangladesh (CAAB), over 70 percent of consumer complaints about airfare involve third-party agents. Collaborations with the Directorate of National Consumer Rights Protection could serve as an additional layer of accountability. Third, operational costs must be brought in line with regional standards. A benchmarking study suggested that aligning jet fuel pricing with international practices could cut fares by 12-15 percent.\nBiman's challenges are symptomatic of deeper issues within the aviation sector in Bangladesh. While the frustration over high ticket prices is understandable, meaningful change requires structural reforms, not just temporary measures. Restoring public confidence requires transparency, better regulation, and the political will to support long-term improvements in service delivery and pricing equity.\nDr Mariha Tahsin is a policy analyst and researcher. She is a visiting research fellow at the BRAC Institute of Governance and Development (BIGD).\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Are Biman’s ‘ticket syndicates’ solely to blame for high airfares?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/are-bimans-ticket-syndicates-solely-blame-high-airfares-3873461",
        "news_paper_name": "The Daily Star",
        "publish_date": "18-04-2025"
    },
    {
        "full_article": "The scorching summer sun may give us a false sense of safety regarding dengue threats, as we often associate the disease with rainfall. The reality is, 16 people have already died from dengue this year. Some 2,074 have also been hospitalised, according to data from the Directorate General of Health Services (DGHS).\nA report in this daily warns of the growing risk of dengue with the Bangladesh Meteorological Department forecasting rain and thunderstorms in many parts of the country this week. Entomologists say that even light rain can lead to an increase in dengue cases, as the mosquito population will proliferate once the first generation of Aedes mosquitoes matures after rain. Therefore, the larvae must be destroyed now to keep the mosquito population under control. Such preventive action is crucial to help us avoid a situation similar to 2023, when Bangladesh saw the highest number of cases and fatalities from dengue in recorded history. That year, a total of 321,179 people were hospitalised, and 1,705 people died from it.\nBy comparison, last year's dengue prevalence was better—101,214 hospitalisations and 575 deaths. These numbers, however, can be disputed as last year's political turmoil upended anti-mosquito drives at the local government level, with almost all councillors and public representatives arrested or on the run since the July uprising. Over eight months later, the situation has somewhat improved, with public officials now supervising basic municipal duties including cleanliness. However, proactive early actions to tackle the threat of dengue in advance of the monsoon are still not visible. This is particularly true for areas outside Dhaka, where mosquito populations are nowhere near under control and almost no anti-mosquito drives are being carried out.\nWe urge the authorities to act early to keep dengue in check. They must identify and eliminate breeding grounds not just in Dhaka but also in places like Barishal, which has seen a spike in cases this year. Anti-mosquito drives should be carried out in neighbourhoods where people have been infected with dengue. Larvae should be destroyed using environment-friendly methods before they hatch, and public awareness campaigns must be launched before the regular downpours begin. Preventive measures will not only save millions in public health expenditure but also hundreds of precious lives.\n",
        "headline_1": "Early action is crucial to prevent a dengue surge ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/early-action-crucial-prevent-dengue-surge-3870891",
        "news_paper_name": "The Daily Star",
        "publish_date": "18-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 18, 2025 00:00:00  \nThe recent high-level meeting chaired by the Chief Adviser of the interim government has reaffirmed Bangladesh's commitment to graduate from the Least Developed Country (LDC) category in 2026. With this, any lingering uncertainty about deferring the transition has effectively been dispelled. As the meeting aptly observed, the country's journey towards graduation, the long awaited milestone, has already taken off, there is no turning back. \nWhile the milestone reflects remarkable progress achieved so far, it comes with significant challenges. Chief among them is the termination of trade preferences, which currently benefit the country due to its LDC status. Acknowledging this, the meeting highlighted the urgent need to build a strong institutional capacity for trade negotiations in the post-graduation landscape. To that end, it has been decided that a dedicated trade negotiation agency will be established immediately. The Chief Adviser has also made it plain that an experienced and competent individual will be appointed to head this new body.\nLDC graduation, like many good things, comes with an opportunity cost-an economic trade-off, as economists would frame it. Graduation signifies more than just improved metrics on paper; it represents a belief by the international community that the graduating country has overcome structural weaknesses that once justified special and preferential support. Consequently, the privileges long enjoyed under the LDC category-such as concessional loans and preferential trade access-will gradually disappear. For decades, Bangladesh's economy has reaped substantial benefits from such supports, particularly under schemes like the Generalised System of Preferences (GSP). The rise of the country's apparel sector as a dominant player in global trading is attributed to such a preferential treatment. While global trends towards tariff reductions and regional agreements have already reduced some of these advantages, Bangladesh continues to be one of the largest beneficiaries of LDC-related trade preferences, especially from the EU. Culmination of preferences is thus the prime issue that worries the businesses. To address this, preparedness is paramount. The transition must be strategically managed to mitigate negative impacts and harness new opportunities. Economic resilience will depend on improving governance, boosting institutional efficiency, and embracing a forward-looking mindset. Dynamism in investment, job creation and productivity will also be essential to sustain post-graduation growth.\nLDC graduation should not be viewed as an end in itself, but rather as the beginning of a new chapter. It marks a shift to a more competitive and self-reliant development path, where gains must be consolidated through consistent effort and reform. The emphasis must be on building a more productive and competitive economy-one that can thrive without special treatment and compete effectively in global market. The decision to move forward with LDC graduation is both bold and timely. While the road ahead is indeed complex, proactive measures-such as institutional strengthening and capacity building-will be key to navigating the post-graduation era. With vision, commitment, and strategic planning, the country can not only weather the transition but also emerge stronger and more resilient in the global economic landscape.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "No pulling back on LDC graduation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/no-pulling-back-on-ldc-graduation-1744900245",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       April 18, 2025 00:00:00  \nIn this country what the businesses demand, they get and they get it at the cost of the consumers. The public are a disparate lot and in the absence of a unified platform, their demands are met with indifference. Contrary to this, traders take resort to all kinds of tactics ---from creation of artificial crisis to arm-twisting to unilateral price hike ---in order to get their way. A case in point right now is the price increase of soybean oil by Tk 14 and Tk 12 to Tk 189 and Tk169 a litre for the bottled and loose varieties respectively. Palm oil price has also shot up by Tk 12 to Tk169 a litre. The importers and millers of the cooking oil had been clamouring for long to get the prices increased. But after the increase, they still grumble that the price of soybean oil justified a hike of Tk 21 a litre. They have foregone the profit of Tk 7.0 a litre considering the greater good of the consumers! How condescending! \nThe truth is that this time businesses involved with cooking oils have at least a valid excuse for hiking prices. With the government withdrawing the 10 per cent duty waiver from the 15 per cent granted earlier for keeping the prices at a tolerable level during the month of Ramadan, they are unlikely to sell cooking oil at the same prices as before. But is the claim made by the Bangladesh Vegetable Oil Refiners and Vanaspati Manufacturers Association (BVORVMA) that the withdrawal of duty waiver justified a Tk21 increase? Did the ministry concerned take a meticulous account of the import, transport and production costs before agreeing to the BVORVMA's demand for the record price rise? Price of soybean oil was increased by Tk8.0 a litre in December last. Since then its price has declined in the international market.\nThe question is, can the common people afford cooking oils at these atrocious prices? Even the commerce adviser had to admit that the current levels of cooking oil prices \"would pose challenges for consumers\". But then, on the question of VAT waiver, he flatly denied the government had any other option. Duty waiver at the moment is a highly sensitive matter, he claimed. How ludicrous! The compulsion of revenue collection and no concessions in matters of tariff as dictated by the International Monetary Fund (IMF) have proved more sensitive than the unpopular price hike drawing public flak! \nWhat about the release of the fourth and fifth tranches of the $4.7 billion IMF loan? After an IMF team's visit to Dhaka, the news about it has almost gone blank. Although there is a casual report on the release of the two tranches together in June, there may be more to it than meets the eye. Once a least developed or developing country seeks help from the multilateral organisations, particularly the Bretton Woods Institutions, the compulsion for going by the recipes, stinging as they may be, is overwhelming. No wonder, the diktat from such organisations has to be complied with even if the people are left to bleed. \nWhat is particularly galling is that cooking oil is not the only essential item that has registered such an outrageous price hike. Onion, egg and vegetables have followed suit. All this comes right at a time when gas price for new factories and industries as well as for the existing ones using the fuel in excess of the approved load has been increased by 33 per cent. According to the Petrobangla, a total of 147.8 million cubic metre of gas was used in excess of the approved load by the country's industrial units between November 2023 and October 2024. The captive power plants also used an additional 57.6 million cubic metre of gas to their approved quota. Now the 33 per cent increased price will be applicable on this volume of gas.\nThe implications and indications of all these transpire a further escalation of prices of commodities. It was the winter's abundant supply of vegetables and items of a short-duration shelf life that was mainly responsible for bringing the inflation below the double digit. Nothing goes to the government's credit. In fact, rice -not easily perishable---continued to register price increase even in the peak harvesting season of Aman paddy. Meanwhile, wheat has also become costlier by Tk 2.0-5.0 a kilogram. The government's policy failure becomes more glaring when it fails to protect the interests of farmers. Right now potato growers are suffering because of low price as well as a lack of storage facility. \nMarket is most likely to grow further jittery with the onset of the lean season and the monsoon. Already onion has raised the signal that the country will have to grapple with this perennial trouble maker. Construction of a number of modern cold storages and warehouses for some basic food items such as paddy or rice, potato, onion, tomato etc; by the government for meeting emergencies or offsetting market manipulation by business syndicates could be undertaken on a priority basis. A good dispensation ought to be proactive instead of reactive in solving food crises. Unfortunately, the interim government has failed to plan innovatively to deal with the crises of essentials both locally produced in abundance and imported like cooking oil, the share of which is more than 90 per cent. Elimination of the middlemen and putting in place a market mechanism to offset business syndicates' intrigues can make the market stable and rein in inflation. \n \nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "No sign of taming inflation and getting at the root of problems",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/no-sign-of-taming-inflation-and-getting-at-the-root-of-problems-1744900321",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       April 18, 2025 00:00:00  \nBangladesh has achieved impressive success in industrialisation over the years with the industry sector's contribution to the gross domestic product (GDP) reaching around 40 per cent. Still Bangladesh is considered an agricultural economy as the sector remains the backbone of rural livelihoods, contributing roughly 12 per cent to the GDP. The sector holds the potential of multiplying the contribution, which the country fails to achieve thanks mainly to the lack of attention it needs. Much has been talked about the development of the agriculture sector and significant steps have also been taken, but the country still lags in actions that could transform the sector into a high-contributing one. Here farmers grow crops just for their survival, without knowing their real contribution to the economy, no matter if the government extends any support or not.\nFarmers in Bangladesh have limited access to finance, one of the major inputs of production, from banking sources and most of those who can access it have to pay unofficial 'speed money', which adds to cost of borrowing and eats into the borrowed amount. This factor, coupled with a lack of proper supervision, natural calamities and political unrest, often leads to default in repayment. According to a report of The Financial Express, non-performing loans (NPLs) of farmers jumped nearly 42.50 per cent to Tk 61.79 billion during the July-January period of the current fiscal year. This rate is much higher than the overall NPL ratio in the banking sector, which stands at around 17 per cent.\nSome examples, however, will make anyone believe that the NPL situation in agriculture credit could have been different had the lenders dealt with the funds a bit differently. Data suggest agriculture loans provided by non-profits and agri-fintechs have much lower NPL ratio, mainly because of the identification of proper loanees, necessary advice to them and close supervision. For example, iFarmer facilitated Tk1.78 billion in loans to around 17,000 farmers from banks and from their own funds and the NPL remains less than 5.0 per cent. This figure represents a small percentage of farmers, but the replication of the model by agriculture lenders might bring in a big change in the agriculture finance landscape in Bangladesh.\nProper monitoring and supervision of farm loans is critically important as in many cases, such loans, especially short-term seasonal ones, are diverted to non-productive uses such as family expenses. This misallocation reduces the capacity of the borrower to repay the loan on time, increasing the NPL burden. However, farm loans, particularly those disbursed through state-owned banks, are often not subject to the same rigorous monitoring as commercial loans or as that offered by non-profits and agri-fintechs. Many rural bank branches are understaffed or lack sufficient capacity for post-disbursement monitoring, leaving a room for misuse of funds or a casual approach to repayment. Conventional lenders should forge greater cooperation with non-profit lending organisations and agri-fintechs in financing agriculture to ensure that their funds are best utilised and make the highest possible contribution to the sector in particular and to the economy in general. Such cooperation could also contribute to curbing informal payment for loans, creating a scope for farmers to invest greater amounts of money in the field they intend to.\nDigitisation of agriculture credit disbursement is also necessary to curb NPL in the sector as manual processes always leave room for corruption. The implementation of crop insurance could also help reduce NPL. Crop insurance has been piloted in a few regions, it is yet to be implemented nationwide. Farmers often bear the brunt of losses due to crop failure or livestock disease in the absence of such insurance.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Making the best use  of farm loans",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/making-the-best-use-of-farm-loans-1744900368",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 18, 2025 00:00:00  \n\nIn today's society, drug addiction has emerged as a grave threat to our youth. This crisis, rooted in family, social, and mental degradation, not only destroys individual lives but also undermines the very fabric of our society. \nFaced with high expectations and life's mounting pressures, many young people seek escape through drugs-often as a response to depression and emotional distress. Over time, addiction results in physical harm, memory loss, a lack of self-control, and moral decline. These ripple effects continue to cross boundaries, increasing family conflict, social isolation, and even criminal activity, ultimately destabilizing communities.\nMany youths are driven to drugs due to mental stress, job insecurity, and anxiety about the future. When families fail to provide emotional support and society offers misguided role models, the appeal of drugs becomes dangerously strong. Unmet expectations and a lack of purpose fuel a cycle of despair and poor decisions.\nIt is crucial that the government implements strict laws to curb both the supply and use of drugs. At the same time, awareness campaigns and counselling programmes should be introduced in schools, colleges, and workplaces. Families and educational institutions must play a more active role in guiding young people. Proper mental health services and support systems are also essential so that the youth can seek help in times of distress.\nDrug addiction is not merely a personal issue-it is a social catastrophe. The youth are the architects of our future, and saving them from this destructive path requires collective awareness, proper guidance and strong community action. If we each take responsibility, we can restore hope and help bring an entire generation back to life.\nSadia Sultana Rimi\nStudent, Department of Mathematics\nJagannath University, Dhaka\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Vicious cycle of drug addiction",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/vicious-cycle-of-drug-addiction-1744900407",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-04-2025"
    }
]