[
    {
        "full_article": "The inflation data for May show just how much can change in one month. Retail inflation came in at a 75-month low of 2.8% in May, with easing food prices the main reason behind this fall. Wholesale inflation, too, slowed to just 0.4%, the lowest in more than a year. The primary driver here, apart from falling food prices, was a drastic contraction of 12.4% in crude oil and natural gas prices. An oversupply of oil and a slowing global economy had meant that the months leading up to May had seen oil prices fall considerably. With India importing about 80% of its oil requirement, this eventually translated into lower wholesale inflation in the country. The Reserve Bank of India (RBI) had, in its monetary policy announcement on June 11, predicted that inflation for the year would come in at an average of 3.7%, down from its forecast of 4% in April. According to some analysts, retail inflation in June could come in as low as 2% — the lower end of the RBI’s comfort band since current factors impact the data with a considerable lag. Overall, the feeling until not too long ago was that inflation would continue to ease. But then Israel attacked Iran, and the monsoon’s progress across the country slowed, both developments that are likely to affect the two key factors, fuel and food, that had, until now, led to the fall in overall inflation.Oil prices jumped as much as 8% in a single day following Israel’s attack on Iran on June 13. The Hindu had, last week, reported that an escalation of tensions between the two countries and a resultant blockage of the vital Strait of Hormuz could result in a 40%-50% increase in shipping costs for Indian exports and imports, and could impact India’s oil supplies from key sources such as Iraq, Saudi Arabia and the United Arab Emirates. This is not an unlikely eventuality, either, with Commerce Ministry officials set to hold a meeting this week with trade and shipping sector stakeholders to discuss how the government can ease their distress. Costlier inputs, especially oil, will eventually move the inflation needle back up. The monsoon has picked up pace again, according to India Meteorological Department officials, but it’s still early days. In the past, even though the overall monsoon has been satisfactory, its uneven spatial distribution has left several agricultural areas parched. It is far from certain that food prices will continue their downward trajectory. In its last monetary policy meeting, the RBI shifted its stance to ‘neutral’, indicating that it was as ready to raise interest rates as it was to cut them. This was prescient, as the last few weeks have shown just how nimble monetary policy has to be in these increasingly unpredictable times.\r Published - June 18, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        inflation and deflation\n                    \n                            /                      \n                        \n                        prices\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        Iran\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        Monsoon\n                    \n                            /                      \n                        \n                        shipping service\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        imports\n                    \n                            /                      \n                        \n                        Iraq\n                    \n                            /                      \n                        \n                        Saudi Arabia\n                    \n                            /                      \n                        \n                        United Arab Emirates\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        food\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "​Easing prices: on the inflation data",
        "headline_2": "Inflation is falling, but the unpredictability factor is high now",
        "link": "https://www.thehindu.com/opinion/editorial/easing-prices-on-the-inflation-data/article69704931.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "18-06-2025"
    },
    {
        "full_article": "Last week, the government issued a set of orders that scientists have heralded as ‘revolutionary’. A major change is in allowing scientific institutions to bypass the Government e-Marketplace (GEM), a Commerce Ministry initiative that is meant to prioritise made-in-India equipment. GEM norms require all government purchases — from laptops to furniture — to be routed through the GEM-portal, with a mandate to buy from the vendor offering the lowest price. While technocrats in government amplified this bypass as a “landmark” initiative to promote ‘ease of doing research and development,’ the fact is that until GEM-based procurement was made mandatory from 2020, the default option was to allow individual scientific institutions the freedom to make their choices regarding the vendors they procure. Take for example, sodium chloride. Something as common as table salt must be available in infinite supply and it is only proper that laboratories — they require great quantities for its myriad applications in research — source it from the supplier who offers it the cheapest. However, much like the avatars of salt — kosher, flat or sea — are uncommonly unique to the chef, the differences in purity even within common salt are critical to scientific research as well as the manufacture of pharmaceuticals. This translates to some vendors being more reliable and, therefore, more preferred.A major aspect of scientific research is about being able to reproduce results of experiments described in publications. Often, this requires fidelity to the methods and materials of the original experimenter. Given the challenge of budgets, the inability to source the right material results in experiments being junked halfway, or crimping on experimental ambition, resulting, overall, in a net loss of resources, time and effort. If this is extended to materials more complicated than salt — precision lathes, customised lab-produced diamonds, biological molecules, for example — it is easy to understand the gripe of scientists. It is understandable, and pardonable, when a government experiments with an untested policy and runs into uncharted waters or unknown unknowns. In the case of GEM, it was a known fact that India lacked an industrial base for sophisticated machinery, and it was inevitable that the hammer-head policy that saw all products as cookie-cutter nails would impede scientific research. India’s scientific ministries are unique in that they are led by scientists, instead of the usual norm of having career bureaucrats. This was due to a recognition, dating back to the early years of the republic, that while science and technology can be employed to serve the state, science itself is unfettered and must be specially nurtured to be useful. A free hand is worth more than two fettered arms. Published - June 18, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        government\n                    \n                            /                      \n                        \n                        science (general)\n                    \n                            /                      \n                        \n                        Salt\n                    \n                            /                      \n                        \n                        research\n                    \n                            /                      \n                        \n                        pharmaceutical\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "​A free hand: on scientific institutes and GEM norms",
        "headline_2": "Science must be unfettered if it is to be useful",
        "link": "https://www.thehindu.com/opinion/editorial/a-free-hand-on-scientific-institutes-and-gem-norms/article69704952.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "18-06-2025"
    },
    {
        "full_article": "DNA tech means remains of AI crash victims will reach their kin. It has also changed the world\nWhen Garuda Airways flight 152 crashed on Sept 26, 1997, many of the 234 fliers were mutilated beyond recognition. Eventually, 48 were interred in a mass grave. Thanks to advancements in DNA matching since then, kin of the Air India crash victims have been spared this pain. At least 135 of the 270 victims – many of them completely charred – have already been identified. Officials hope to complete the task by Wednesday.\nIt’s a measure of technology’s march since scientist Alec Jeffreys found the first genetic fingerprint on Sept 10, 1984. He didn’t discover DNA – that honour goes to Swiss scientist Friedrich Miescher, who made the discovery in 1869, the year Mahatma Gandhi was born. But then, not much happened for the next 115 years. Yes, Watson and Crick figured out DNA’s structure and won a Nobel in 1962, but DNA didn’t have practical uses until Jeffreys’ eureka moment. Within a year, he had helped a boy get British citizenship by establishing a DNA link between him and his parents. The year after, he helped nail the culprit in a double rape and murder case. US caught on in 1986, and by 2013 its Department of Justice was collecting and analysing DNA samples for $40 a pop.\nNow, you can order a DNA paternity test online. Sequencing machines have become tiny – the smallest ones weigh less than a smartphone and cost around $3,000. US troops used one to identify IS leader Baghdadi on their chopper in 2019. Meanwhile, over 40mn people have given DNA samples to private firms to trace their ancestry. In recent weeks, DNA has revealed mix-ups that happened in hospitals in 1940s when newborns weren’t tagged. It’s solved decades-old crimes, and freed innocents who lost their youth in jail. It’s a gift that keeps on giving. \n\n",
        "headline_1": "Connecting people",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/connecting-people/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-06-2025"
    },
    {
        "full_article": "A senior in Akal Takht publicly approves the killing of a woman. This is what patriarchy begets\nThe greater tragedy after the murder in Punjab’s Bathinda of a young woman – killed for her reels on social media – is the support her murderers have received from sections of society, including that of an Akal Takht senior. Control of women and their online avtars is not driven by religious zeal alone. In May, a young Mexican social media influencer, who posted videos on beauty and makeup, was shot dead during a TikTok live stream. In Jan, a Pakistani father, a US citizen, moved his family from US to Quetta – and killed his teenage daughter because he found her social media posts “objectionable”. In five months, three women Pakistani social media influencers, including a 17-year-old, have been murdered – in Islamabad, Peshawar and Pakistan Punjab’s Khushab.\nEach was in effect a case of femicide – killed simply for being a woman, for falling foul of self-appointed agents of social control. They were killed for the agency they displayed online, in content not considered ‘appropriate’ – including makeup – seen as ‘vulgar’ or ‘obscene’. Several Indian comedians and artistes have been accused of ‘obscenity’ and ‘vulgarity’. Vandalism and threats have followed. But, when it came to a woman, criticism or moving court wasn’t enough. For Kanchan Kumari, known online as ‘Kamal Kaur Bhabhi’, murder was the weapon chosen to silence her and, as a bonus, terrify many young women looking to use social media to earn some money.\nAll these young women were simply entertainers catering to large audiences. Moral policing and vigilantism are on the rise globally – rightwing and/or so-called pious men find it all too easy to spot “decay in society” world over – because women, for them, must remain the carrier of a faith’s values, so abortion is denied or ‘sanskar’ is enforced. The Akal Takht senior said “we should not listen to vulgar songs…” – and so it was okay to kill the singer. Such institutional justification of systemic violence against women is the biggest danger to their safety. It compromises police action and silences the laity. Some of course have spoken out against the murder, including a religious figure of a Sikh sect. But they are few and far between. Twin phenomena – normalisation of online trolling of women and violence against those women who’ve refused to be keepers of ‘public morality’ – are the outcomes of modern patriarchy. Self-appointed agents of social control are the real ones who’re degrading society. Letting such justification of murder slide is normalising it. There lies the real danger to women, whether online or offline.\n\n",
        "headline_1": "Justifying murder",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/justifying-murder/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-06-2025"
    },
    {
        "full_article": "The shock wave of grief after the crash of AI 171 should make us mindful of the fragility of life\nSend not to know for whom the bell tolls/It tolls for thee, wrote John Donne. The great divider that is death is, with cruel paradox, also the great unifier.\nAs grief engulfed the families and near ones of the hundreds who perished, heartfelt messages of condolence, sympathy, and offers of assistance flooded in from across the globe, from ally and adversary alike.\nDeath is the ultimate equaliser, the inescapable common denominator, that rules all life. Our birth is fortuitous, a chance happening, a random conjunction created from the chaos of cellular matter. But once born, the only certitude in life is the ending of it.\nThe death of another is a forerunner of our own, a darkness at noon, reminding us of our own mortality.\nAnd like a storyteller of endless invention, the devices death conjures are infinite in their variety, reflecting the underlying irony of life that its greatest creativity is displayed in its dissolution.\nThe cards are stacked in favour of the dealer, Death. To the natural calamities of earthquakes, floods, droughts and famines, are added the perils that progress unwittingly brings in its wake.\nThe growth and spread of cities and urban centres in Europe resulted in the scourge of the Black Death, the bubonic plague of the Middle Ages, which took a toll of over 50mn lives, wiping out half the then population of the continent. The greater the concentration of people, the richer the winnings for the deadly Croupier.\nBut the greatest sleight of hand employed by the deathly Card Sharp is a form of murder-suicide called War, waged for region, or religion, ideology, or insanity.\nEven as human ingenuity explores the reaches of outer space and delves into the mysteries of brain and mind, there are 56 areas of warfare ongoing on our planet today, exacting over 160,000 deaths annually, including the so-called collateral damage of women and children.\nThis is the Dealer’s final trump card: Making us complicit in our own destruction. That’s the real human tragedy.\n\n",
        "headline_1": "The human tragedy",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/the-human-tragedy/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-06-2025"
    },
    {
        "full_article": "What gadgets of doomed aircraft never record\nAs the Air India flight taxied on the Ahmedabad runway, the jet would have gargled fuel to clear its throat, reminders to keep the seat belt fastened would have sounded like familiar chants in the pressurised cabin, a few passengers would have whispered their customary travel prayers, some would have argued that Heathrow offers better connectivity to central London than Gatwick, somebody would have recalled their last flight to Heathrow from Delhi and wondered if the Thames would appear on the Gatwick route.\nThe etiquette-conscious would have deliberated on the correct response to ‘how do you do?’ in UK, some would have joked that Brits wouldn’t mind if people said ‘how’re ya doin’?’ to the King as long as they had waited British-ly in a queue to address the monarch, some laughter would have strummed seat belts when those averse to culinary adventures relished with desi glee the prospect of ordering cholay-bhature in the former Raj HQ.\nA first-time visitor to London would have shown explorational savvy and proclaimed that London Bridge has ‘cliché’ splashed all over it like betel-leaf stains and Charles Dickens Museum is the place for sophisticates, their seat neighbour would have commented that Delhi taxiwallahs’ directional acumen is just as legendary as London’s Black Cab drivers’, some passengers would have started a battle of wills with time itself to hug their loved ones sooner than determined by the mundane arrival schedule, a few would have gone back in time to worry about not switching off all their home lights.\nAnd then as the jet engine’s gargling began smoothing into the war cry of human ingenuity against gravity, even some frequent fliers would have looked out of their windows to marvel at the audacity of a toothpaste-tube-shaped machine to rescue hundreds of people at once from the solidity of routines, passengers would likely not have known that the plane was losing altitude, would probably not have realised that the pilots were overriding instinctual fear with professional focus, the pilots would have been using the muscle of their conscience to strengthen their trained hands to do everything they could to save the passengers in their care and save the metrics that make us all human: love, ambition, excitement, and the faith in ourselves to plan for the next day. Black boxes don’t record those metrics.\n\n",
        "headline_1": "Silent Black Box",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/cache-of-cultures/silent-black-box/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-06-2025"
    },
    {
        "full_article": "We are appalled by the absurdity of the situation unfolding at Dhaka South City Corporation (DSCC). As if the monthlong paralysis of Nagar Bhaban following a siege led by BNP leader Ishraque Hossain was not enough, the latter has now seemingly taken the step of unilaterally assuming mayoral power, running a \"parallel administration\" without taking the required oath of office. On Tuesday, he held a meeting with nearly 70 ward secretaries at a Nagar Bhaban auditorium. The day before, he met with over 70 sanitation inspectors and announced the resumption of emergency civic services—all while being introduced as \"Honourable Mayor\" on a banner displayed behind the podium. He also formed a so-called \"Mayor's Cell\".\n\nThe justification Ishraque provided—that the court cleared the way for him to take charge—is legally and politically tenuous. The ruling he refers to may have temporarily restored his claim to mayorship, but it did not authorise him to begin discharging mayoral duties without completing the mandatory swearing-in process. Nor did it address the disputed nature of elections held under the authoritarian Awami League regime.\nIshraque, it may be recalled, had earlier threatened to take the oath himself if the government failed to administer it. His mayoral posturing now serves not only as a challenge to the interim administration, including the incumbent DSCC administrator, but also as a reckless disregard for democratic processes.\nThe justification Ishraque provided—that the court cleared the way for him to take charge—is legally and politically tenuous. The ruling he refers to may have temporarily restored his claim to mayorship, but it did not authorise him to begin discharging mayoral duties without completing the mandatory swearing-in process. Nor did it address the disputed nature of elections held under the authoritarian Awami League regime. In the absence of political consensus on such matters, a mere legal clearance—controversial in its own right—cannot resolve the underlying crisis of legitimacy. In reality, what we are witnessing is an unauthorised, forcible takeover dressed up as a \"citizen-led\" movement.\nThat said, we're also disappointed by the authorities' handling of this crisis. Despite being fully aware of the disruptions being caused by the siege, they have remained shockingly passive. If, as top officials claim, there are legal and procedural complications preventing Ishraque's swearing-in, those should have been addressed swiftly and transparently. Failing that, stronger action should have been taken to end the unlawful lockdown of a public institution. Neither has happened. The most regrettable aspect of this saga is the message it sends to citizens. When a leader, however aggrieved, occupies a public office with the help of loyalists, it sets a dangerous precedent for our already fragile democracy. And when the government chooses to let this drama play out, it too abdicates its duty.\nThe longer this farce continues, the more it damages trust in both the interim government and those positioning themselves as alternatives to the ousted authoritarian regime. Political legitimacy cannot be acquired by force or theatrics. It must be earned through transparency, public mandate, and the rule of law. We urge both government and BNP higher-ups to intervene immediately to end this impasse and ensure that the DSCC runs without any further disruptions.\n",
        "headline_1": "End this farcical mayoral standoff",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/end-farcical-mayoral-standoff-3919471",
        "news_paper_name": "The Daily Star",
        "publish_date": "18-06-2025"
    },
    {
        "full_article": "The Boeing 787 shudders, a great beast awakening. Outside, the tarmac blurs into liquid mercury. You're strapped into seat 11A. Maybe you chose it for the legroom, the quick exit, or the view over the wing. Or perhaps fate, in the form of an overbooked flight or a last-minute upgrade, deposited you here. Right now, it's just another seat. But imagine, just for a moment, the headlines weeks later: \"Sole Survivor of Flight 470 Found in 11A.\" Suddenly, this unremarkable patch of nylon and plastic transcends its function. It becomes a modern-day relic, a shrine to improbable grace. 11A. The miracle seat.\nAir travel, we're relentlessly reminded, is the safest way to traverse the planet. Statisticians wield probabilities like shields: one fatal accident per several million departures. The drive to the airport? Infinitely more perilous. We nod, absorbing the data, finding comfort in the cold calculus of risk management. Yet, deep in the lizard brain, where logic dissolves into primal soup, another truth simmers. When you're suspended six miles above the indifferent ocean, cocooned in a pressurised tube hurtling through a freezing void at 500 miles per hour, those statistics feel like tissue paper against a hurricane. It's not about knowing the odds. It's about feeling the terrifying fragility of it all. We are, quite literally, defying gravity on borrowed time. The universe, in its vast, silent machinery, doesn't plot our course. It spins its celestial wheels, oblivious. Destiny isn't written in the stars. It's a chaotic collision of mechanics, weather, human error, and pure, dumb luck.\nAnd this is why the \"miracle survivor\" story grips us. It's not just empathy, though that's the spark. It's the shattering of the statistics. It's the defiance of the inevitable. We see ourselves in that crumpled seat, emerging from twisted metal and fire. It's the ultimate \"what if?\" played out in horrifying, glorious detail. The survivor becomes Orpheus, stumbling back from the underworld with a tale we desperately need to hear. Their survival is a flickering candle held against the overwhelming darkness of our own mortality. It whispers: \"See? The universe isn't always cruel. Sometimes, against all reason, it spares one.\" It offers a narrative where chaos yields, however briefly, to a sliver of order, of meaning.\nBut here's the dissonance that scrapes against the soul like a rusty blade: why doesn't the image of a Palestinian girl burning sear itself into our collective consciousness with the same white-hot intensity? Why doesn't her name—if we even know it—become synonymous with horror, her photograph a universal totem of suffering demanding action? If empathy is the engine, why does it sputter and stall before certain thresholds?\nWe see the picture. Maybe we flinch. Maybe we share it with a caption dripping in outrage. But the wave of collective, sustained fascination, the media's rapturous dissection, the transformation of her suffering into a global parable of miraculous endurance? It rarely happens. Her agony becomes another pixel in the relentless, numbing scroll of atrocity.\nIs it evolutionary psychology? Perhaps. Our ancient wiring prioritises the immediate, the singular threat we can potentially flee or fight. A plane crash is a discrete, catastrophic event, a dragon we can visualise. The slow, grinding violence of occupation, the systemic erasure of a people—that's a fog, diffuse and complex. It lacks the clean narrative arc of disaster and survival. Our empathy circuits, tuned for the lion chasing the single antelope, struggle to process the anthill being systematically flooded.\nBut evolution isn't destiny, and wiring can be rewired. The deeper fracture, perhaps, lies in the stories we are sold, and the stories we choose to buy. The miracle survivor fits a pre-existing, deeply comforting script: the triumph of the individual against impossible odds. It's Robinson Crusoe on a desert island of wreckage. It's Katniss Everdeen emerging from the arena. It's Luke Skywalker blowing up the Death Star. It reinforces the myth of the rugged individual, blessed by fortune or grit. We can project ourselves onto that lone figure in seat 11A and imagine we too could be so chosen, so resilient.\nThe burning girl, however, represents a different story—one we find infinitely harder to confront. It's a story of collective punishment, of historical injustice, of power asymmetries so vast they crush the human spirit. It's not an event. It's a condition. Her suffering isn't a fluke of physics. It's the predictable outcome of political choices, ancient hatreds, and global indifference. Accepting her pain fully means accepting our complicity, however passive, in systems that perpetuate such agony. It means acknowledging that the universe's indifference is often amplified by human cruelty. That's a narrative that offers no easy catharsis, no triumphant survivor to applaud. Only a bottomless well of sorrow and responsibility.\nThis is where Baudrillard's ghost haunts the terminal. The French theorist spoke of the \"desert of the real,\" buried under an avalanche of images, information, and simulations. We are bombarded—plane crashes, wars, famines, celebrity scandals, cat videos—a ceaseless, undifferentiated stream. Meaning drowns in the noise. The horror of the burning girl becomes just another image in the feed, competing for our fractured attention. It risks becoming simulacra—a copy without an original, a signifier detached from the profound, unbearable reality it represents. The sheer volume numbs us. We click, we sigh, and we scroll on. The media, often complicit, frames stories based on perceived audience interest, novelty, and that elusive \"narrative arc.\" \"The Miracle of 11A\" has a clear beginning (take-off), middle (disaster), and end (survival). The Palestinian girl's story is a middle without end, a horror without resolution, an injustice demanding uncomfortable, complex engagement. It's deemed \"less consumable.\"\nSo, where does meaning reside in the story of 11A? How do we prevent it, too, from becoming just another disposable spectacle in the infotainment cycle?\nPerhaps meaning isn't found in the survival itself, but forged in the telling and the hearing. The survivor's tale, shared in hushed tones or splashed across headlines, becomes more than a recounting of events. It becomes a ritual. It's a secular hymn to resilience. When we listen, truly listen, to the person who walked out of the fire (or fell from the sky), we aren't just processing data. We are participating in an ancient act of meaning-making. We are saying, \"Your survival matters. Your story matters. It defies the void.\"\nThink of Scheherazade, spinning tales night after night not just to entertain, but to survive. Her stories were her shield against death. Our survival stories are similar shields against existential despair. They are oxygen masks for the soul, dropped from a collapsing sky. They whisper that life, however randomly spared, however precariously held, is worth the terrifying ride. The 11A survivor becomes an unwilling prophet, testifying to the stubborn persistence of being in a universe that seems spectacularly unconcerned.\nThis doesn't diminish the horror of the burning girl. It should amplify it. The hope found in 11A's story isn't an opiate. It should be a catalyst. If one life spared against astronomical odds is a beacon, then the deliberate extinguishing of a life, especially one so young and innocent, should be an unbearable supernova of outrage. The meaning we derive from the miracle should sharpen our focus on the preventable tragedies, demanding why her story isn't granted the same narrative weight, the same global platform, the same relentless demand for answers and change.\nThe stewardess walks down the aisle, her practised smile a mask over the profound responsibility she carries. She offers coffee, a tiny ritual of normality performed in a metal tube hurtling through chaos. Outside the double-glazed window, the wing dips slightly, catching the sun, flashing like a signal mirror. Below, unseen, continents shift, wars simmer, children laugh, and children burn.\nHope is in the stories. But only if we choose the right stories to tell with fervour, and listen to the difficult stories with open, wounded hearts. The story of 11A tells us light can emerge from utter darkness. The story of the burning girl screams that darkness should never have been allowed to fall in the first place. One story offers the solace of the improbable, the other demands the justice of the imperative.\nTo fixate only on the miracle seat is to risk becoming like passengers mesmerised by a single working reading light while the cabin slowly fills with smoke. We need the light of 11A to see the contours of the girl's burned orange dress in the shadows. We need its fierce, improbable glow to illuminate the path towards a world where her fate is not just another forgotten headline, but an unthinkable aberration. The miracle isn't just surviving the fall; it's finding the courage, amidst the deafening static of the world, to truly see the fire, and to reach for the extinguisher. That's the story worth telling until our voices are raw. That's the destination beyond the safe landing.\nZakir Kibria is a writer and policy analyst. He can be reached at [email protected].\n\nViews expressed in this article are the author's own.\n\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The miracle seat and the girl who burned ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-miracle-seat-and-the-girl-who-burned-3919236",
        "news_paper_name": "The Daily Star",
        "publish_date": "18-06-2025"
    },
    {
        "full_article": "We are concerned about the rising volume of bad loans in the banking sector, which reached a record Tk 420,335 crore at the end of March. This accounts for 24.13 percent of the sector's total loans of Tk 17,41,992 crore. In other words, nearly one-fourth of all loans have become defaulted, which is staggering. According to the latest central bank data, state-run banks had bad loans amounting to Tk 146,407 crore, making up 46 percent of their total disbursed funds, while private banks faced Tk 264,195 crore in defaults, or 20.16 percent of their loans. Moreover, foreign banks had Tk 3,239 crore in bad loans, while specialised banks had Tk 6,494 crore. Additionally, the banking sector faced a provisioning shortfall of Tk 170,666 crore, further weakening its financial stability.\nIt should be mentioned that this increase in bad loans is largely the result of irregular lending practices during the now-ousted Awami League government, which are now turning into defaults. Reportedly, the rise in defaulted loans has been driven by various factors, including the rescheduling of term loan maturities through a central bank directive, the reclassification of large loans from certain clients as substandard by the Bank Inspection Department, the failure to reschedule existing loans, delays in repaying instalments of rescheduled loans, and the accrual of interest on already classified loan accounts. The recent tightening of loan classification rules has also contributed to this surge. Whereas previously loans were classified as overdue after 270 days, starting from April 2025, they are to be classified as non-performing after just 90 days. In some cases, defaults have also occurred due to genuine business struggles under global economic pressures.\nWhen the Awami League assumed power in 2009, the total volume of defaulted loans stood at just Tk 22,481 crore. Since then, the amount has risen steadily. Economists allege that influential figures close to the then-government siphoned large sums from banks through irregular means, much of which was laundered abroad. Moreover, the government allowed banks to conceal the true scale of the crisis. Political appointments, manipulative accounting, nepotism, and a lack of transparency in lending during the AL tenure contributed significantly to the sector's current instability.\nWe urge the government to take stringent measures to address the growing crisis of non-performing loans. It must act decisively against habitual defaulters and improve financial governance in the sector. At the same time, credible businesses should continue to receive necessary support, while efforts must be made to steadily reduce the volume of bad loans.\n",
        "headline_1": "A staggering increase in default loans",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/staggering-increase-default-loans-3919196",
        "news_paper_name": "The Daily Star",
        "publish_date": "18-06-2025"
    },
    {
        "full_article": "We welcome the positive outcome of the meeting between the Chief Adviser of the interim government Prof Muhammad Yunus and BNP Acting Chairman Tarique Rahman in London, during which the chief adviser suggested that the election could take place before Ramadan—if sufficient progress is made on reforms and the trials related to the July-August uprising. This conditional acceleration reflects both sides' willingness to link the election timetable to concrete progress on judicial and institutional reforms.\nWe are relieved that the uncertainties regarding the election timing have been allayed by this announcement and that both sides have shown maturity and a willingness to cooperate with each other. This has significantly cooled down the tensions between the interim government and the BNP and has smoothed the path towards a more stable democratic process.\n\nFour political parties and an alliance have welcomed the concurrence between the government and the BNP regarding the timing of the election. This is a significant breakthrough in a climate previously fraught with discord, mistrust, and ambiguity. The agreement indicates a noticeable shift from the chief adviser's earlier insistence on the polls taking place between December 2025 and June 2026, a timeline strongly opposed by the BNP, which demanded a December election.\nNow there is a clear election roadmap that the nation has been waiting for—one that most parties are open to. The National Citizen Party, however, has expressed its disappointment, criticising the decision as being made to satisfy one particular party, the BNP. While their concerns regarding reforms and justice not receiving priority when making this announcement are understandable, the decision to give a definite timeline that is acceptable to most political parties has been a wise one. It has avoided the confrontational politics that was expected following growing resentment of the BNP, which is one of the largest political parties in the country. It has also opened space for dialogue.\n\nThe challenge ahead for the chief adviser and his cabinet is to start meaningful electoral reforms and ensure that the process of delivering justice for those killed in the July-August uprising is initiated with fairness and transparency. The other major challenge is to ensure that the elections are held with maximum voter turnout and participation from all major parties, including the NCP.\n",
        "headline_1": "The London meeting has given clarity and hope",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/the-london-meeting-has-given-clarity-and-hope-3916806",
        "news_paper_name": "The Daily Star",
        "publish_date": "18-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 18, 2025 00:00:00  \nBangladesh economy has been showing signs of higher growth across its major sectors including manufacturing, agriculture and services. Going by the Purchasing Managers Index (PMI), which is a composite index based on surveys on the responses of the purchasing managers of different companies about various aspects of their business, including new orders, production, employment, supplier deliveries and inventories, demonstrated a stronger performance of the economy. \nIn this connection, last May's PMI at 58.9 showed an increase by 6 points compared to what it was in the previous month (April). Evidently, it is a demonstration of reinvigoration seeing that the previous months since February were marked by a slowdown of the economy as indicated by their PMIs. So, the indicators point to an expansionary trend in the major sectors, especially agriculture, manufacturing and services. The agriculture, for example, showed the eighth consecutive month of growth so far as new business initiatives, business activity, employment and input costs were concerned. In particular, the order backlog index, which represents the undelivered portion of orders that a company had received, has returned to an expansionary trend. This is no doubt a positive trend since previous months had been the ones of contraction. Though the higher indices of order backlog indicate growth in business activity, they at the same time are also reflective of the output that is below its maximum potential. That is so because order backlog by definition is indicative of unfulfilled order deliveries. Across a particular sector of an economy, such as the agriculture, it is obviously indicative of a rising demand market. In a similar vein, the manufacturing sector, too, according to the last month (May)'s PMI, demonstrated a positive growth momentum driven by expansionary trend at an accelerated pace for the consecutive ninth month. The breakdown of the indices show that new business initiatives in the manufacturing sector demonstrated a rise. However, the order backlogs index remained contractionary though at a slower rate for ten straight months till May. \nThe construction sector, on the other hand, was expansionary for the sixth consecutive month, though, since April, the sector's growth remained stagnated. That means construction activities gained momentum with order backlogs demonstrating expansionary trend. But so far as new business initiatives and related employment generation was concerned, it reverted to a contractionary track. According to the PMI readings, the costs of inputs which involve the goods and services such as raw materials, components, energy a well as staff that a company employs to run its production process registered a rise, though at a slower pace. Similarly, the services sector demonstrated a faster growth with expansion into new business ventures with an attendant higher index value of order backlogs suggesting strong demands, moderate growth in employment and a rise in input costs. Overall, in experts' view, the economy exhibited an accelerated rate of growth for the month under review. In particular, Dr Masrur Reaz, Chairman and CEO of Policy Exchange Bangladesh (PEB), held that the latest PMI readings implied a faster rate of growth of the overall economy. And that growth took place against the backdrop of, what he pointed out, \"export-led manufacturing buoyancy and uptake in agriculture and its supply chain ahead of the Eid festival\". \nThe interim government would do well to take the growth indicators as reflected in last month's PMI into due consideration to devise its economic policies for the next fiscal year. For, that would help the elected government to take office next to build on a positive legacy left by the incumbent interim government. Though PMI is a widely used indicator tracking an economy's general health, there is still room for critically assessing its findings. Especially, the PMI depends on the company executives' responses which are basically subjective and prejudiced by personal bias. Even so, despite limitations, PMI can at least provide a good rule of thumb for the policymakers to take their cue from.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Economy on positive growth path",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/economy-on-positive-growth-path-1750173758",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       June 18, 2025 00:00:00  \n\nAlthough the country's pharmaceutical sector is often credited -- and rightly so -- for its commendable performance over the years, one of the persistent and pressing challenges hindering its further growth is the overwhelming reliance on imported raw materials, specifically active pharmaceutical ingredients (APIs). Despite the country's strides in medicine manufacturing, the industry's heavy dependence on foreign-sourced APIs remains a structural vulnerability that hampers both sustainability and self-reliance.\nCurrently, it is estimated that the pharmaceutical industry imports nearly 95 per cent of its API requirements. This translates into an import bill of approximately Tk 45 billion annually, putting considerable pressure on foreign currency reserves and leaving the entire supply chain susceptible to global market disruptions. Local producers, constrained by infrastructural limitations and lack of investment, are not in a position to meet more than 5 per cent of the industry's total API demand. This stark imbalance has long been recognised as a bottleneck in the development of a truly self-sufficient pharmaceutical industry.\nOver the past several years, cutting reliance on imported APIs has been a frequent topic of discussion at both policy and industry levels. Yet, tangible progress remained limited until recently. Encouragingly, there has been a renewed drive, both from the government and private sector players, to strengthen backward linkages by boosting domestic API production. This shift in momentum reflects a growing awareness of the strategic importance of indigenous raw material sourcing, not just from an economic perspective but also from the standpoint of national health security.\nOne of the major initiatives in this regard is the establishment of an API Industrial Park in Munshiganj, which is being implemented as a government project. The park is envisioned as a comprehensive industrial hub with dedicated infrastructure and support services tailored to API manufacturers. Additionally, two more API parks are under development in Bagerhat and Khulna through private sector initiatives, signaling growing investor interest in this critical segment of the pharmaceutical supply chain.\nAlongside infrastructural developments, a draft API policy has been prepared and is currently awaiting approval from the government. This policy aims to provide a comprehensive incentive structure, including fiscal benefits, subsidies, and streamlined regulatory processes, to attract both local and foreign investors into the API manufacturing space. If approved and implemented effectively, this policy could serve as a much-needed catalyst for transforming the sector's raw material landscape.\nThe overarching goal behind these initiatives is to reduce dependence on imports, ensure the smooth supply of essential inputs for drug production, and ultimately bring down production costs. Lower costs would not only make medicines more affordable for the domestic population but also enhance the competitiveness of Bangladeshi pharmaceutical products in international markets. A locally secured supply chain would significantly bolster the industry's export potential, which has been growing steadily in recent years.\nIt is important to recognise that sustaining a highly capital-intensive industry like pharmaceuticals requires more than just policy tweaks and infrastructural support. A reliable and cost-effective supply of raw materials is essential to maintaining the viability and profitability of the entire sector. Without local API production, manufacturers are forced to rely on volatile international markets, where prices can fluctuate dramatically, and supply chains can be disrupted by geopolitical tensions, pandemics, or trade restrictions.\nA great deal of the untapped potential within the pharmaceutical sector can be attributed to this very lack of backward linkage. In fact, the absence of readily available APIs is often cited as one of the foremost limitations to the industry's desired growth. The inability to access necessary inputs locally not only increases production costs but also impedes research and development (R&D) initiatives, which are vital for innovation and quality enhancement.\nThe need for robust backward linkage has never been more crucial. As the pharmaceutical industry moves towards more complex formulations, biologics, and personalised medicine, the demand for high-quality APIs is set to rise. Ensuring that the country is equipped to meet this demand locally will require coordinated efforts in terms of investment, training, infrastructure development, and regulatory facilitation.\nBangladesh's pharmaceutical sector currently meets around 98 per cent of the domestic demand for medicines, a remarkable feat in itself. The industry's annual growth rate, estimated at over 24 per cent, positions it as one of the fastest-growing sectors in the country. There are currently more than 240 registered pharmaceutical companies operating in the country. Several of these firms have already begun producing APIs and a wide array of drug formulations spanning all major therapeutic categories. This means the base is already in place; what remains is the scaling up of capabilities and enhancing integration with global standards.\nWith these factors in mind, the industry appears well-poised to embrace cutting-edge innovations and significantly expand its export footprint. However, achieving such aspirations hinges critically on addressing the foundational issue of API availability. Once this key gap is bridged, pharmaceutical manufacturers will find themselves in a far more advantageous position to scale up production, undertake R&D initiatives, and compete globally.\nThus the need to locally produce APIs is not just a matter of economic efficiency -- it is a strategic imperative. If the current momentum is sustained through effective policy implementation, investment, and infrastructural development, the pharmaceutical sector could very well become one of the cornerstones of the country's industrial economy.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Pharma industry in dire need of locally produced APIs",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/pharma-industry-in-dire-need-of-locally-produced-apis-1750173828",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 18, 2025 00:00:00  \n\nIn today's rapidly evolving digital economy, artificial intelligence (AI) has emerged as a powerful force transforming how online businesses operate. From customer service bots to personalised product recommendations, AI is reshaping the landscape for e-commerce platforms, digital service providers, and entrepreneurs.\nAI enables businesses to interact more effectively with customers. Tools like recommendation engines and chatbots personalise user experiences, enhance satisfaction, and reduce operational costs. In Bangladesh, many small and medium enterprises are beginning to integrate AI solutions-such as those found on Shopify or WooCommerce-to automate routine tasks like order processing and inventory management, improving efficiency and reducing errors.\nDigital marketing has also been revolutionised by AI. Tools like ChatGPT, Jasper, and Canva AI allow marketers to generate content, analyse campaign performance, and optimise strategies in real time. Predictive analytics can now forecast demand and suggest investment opportunities based on customer behaviour.\nHowever, the rapid adoption of AI is not without risks. Concerns about data privacy, algorithmic bias, and job displacement are growing. In developing countries like Bangladesh, it is essential to ensure that customer data is collected and stored ethically, and that algorithms remain transparent and fair-especially in sensitive sectors like finance, healthcare, and education.\nMoreover, not all businesses have equal access to the technology and skills needed to adopt AI, creating a digital divide. Over-reliance on automation may also undermine the human creativity and oversight that are still vital in many areas.\nIf harnessed responsibly, AI can help online businesses gain a competitive edge and drive digital growth. But this transformation must be inclusive, ethical, and supported by appropriate training and regulation. As Bangladesh moves toward a \"Smart Bangladesh,\" encouraging AI adoption should go hand-in-hand with policy safeguards and digital literacy initiatives.\nKaniz Batul Shamma, Student, BBA\nNorth South University\nkaniz.shamma.241@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "AI's impact on online business",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ais-impact-on-online-business-1750173864",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 18, 2025 12:00:00  \n\nThe ongoing heatwave sweeping across the country has significantly disrupted daily life and poses serious health risks. With temperatures soaring across regions-from Thakurgaon and Rajshahi to Dhaka, Chattogram, and Barishal-the entire nation is grappling with extreme weather conditions.\nChildren, the elderly, and daily wage earners are particularly vulnerable. \nReports of fever, stomach ailments, skin diseases, and heat rashes-especially among children-have surged.\n For low-income communities, who often lack access to proper healthcare and awareness, the situation is even more dire. Animals too are suffering under the relentless sun.\nIt is crucial to ask why such extreme temperatures are becoming the norm. While natural climatic shifts play a role, human activities are largely to blame for the disruption in environmental balance. Climate studies show that the rate of warming in Bangladesh is higher than the global average. This year's heatwave has not only intensified but also expanded in geographical reach.\nUnfortunately, public preparedness appears minimal. There is a glaring absence of government-level awareness campaigns, drinking water stations, shaded walkways, and emergency response measures. Urban greenery and water bodies, which could naturally mitigate heat, are in alarming decline.\n If heatwaves continue to be dismissed as a seasonal inconvenience, we will only expose ourselves to greater danger in the coming years. \nAuthorities must act swiftly with both immediate safety plans and long-term environmental strategies to protect public health and wellbeing.\nAshikujaman Syed\nBusiness Development \nManager,\nTianjin Pharmacn Medical \nTechnology Co., Ltd.,\nTianjin, China.\nsyedashikujaman@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Heatwave demands urgent precautions, awareness",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/heatwave-demands-urgent-precautions-awareness-1750173889",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-06-2025"
    }
]