[
    {
        "full_article": "A crew of four astronauts including India’s Shubhanshu Shukla completed their roughly two-week mission to the International Space Station on July 15. Mr. Shukla’s trip was presumed to have been an intensive rehearsal ahead of his flight as part of India’s first batch of astronauts for ISRO’s ‘Gaganyaan’ mission, currently expected in 2027. The presumption is because the goals of Mr. Shukla’s trip, which ISRO arranged for by paying north of ₹500 crore to Axiom Space, have not been officially communicated by Indian authorities. Fortunately, clarifications from Axiom and NASA have since cast more light on its purpose. While ISRO and the Department of Space are still expected to proactively disseminate what they know about their activities under Gaganyaan, not least because of the mission’s ₹20,000 crore price tag, Mr. Shukla’s trip ought to strengthen ISRO’s preparations. Human spaceflight is a highly involved endeavour: once in space, the crew is on its own and the resources to respond to a variety of situations are limited. According to a statement ISRO published after the mission launched on June 25, Mr. Shukla and Prasanth Nair — who is also part of Gaganyaan’s first cohort of astronauts and was part of the Axiom mission’s backup crew — were familiarised with “advanced spacecraft systems, emergency protocols, scientific payload operations, microgravity adaptation, space medicine, and survival traits”. As the mission pilot, per Axiom, Mr. Shukla was also coached on docking and undocking, manual operations, atmospheric reentry, and anomaly management. Onboard the space station, Mr. Shukla was exposed to operations in the Japanese and European modules, for which he and Mr. Nair were trained in Japan and Germany. ISRO Chairman V. Narayanan has also said that the Axiom mission cost less than what ISRO might have had to invest if it had to train Mr. Shukla on its own. In all, the NASA-Axiom-ISRO tie-up emerges as an admirable outcome, even as space agencies continue to closely guard space technologies for their strategic value.Concerns that the limitations imposed by the U.S.’s International Traffic in Arms Regulations would prevent the duo from learning much may also be laid to rest. Instead, they may be replaced by concerns about ISRO’s piecemeal communication. Astronauts cut inspirational figures and appeal to all ages. As India prepares for its first human spaceflight mission, there can be no better way to build excitement than by facilitating access to India’s astronauts. The lack of initiative is hard to rationalise, although it is still not too late. ISRO as well as India’s soft power platform will make copious gains by expanding outreach and easing public access to the spacefarers.\r Published - July 18, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        space programme\n                    \n                            /                      \n                        \n                        nasa\n                    \n                            /                      \n                        \n                        ISRO\n                    \n                            /                      \n                        \n                        science (general)\n                    \n                            /                      \n                        \n                        USA",
        "headline_1": "Stepping stone: On Shubhanshu Shukla, NASA-Axiom-ISRO tie-up",
        "headline_2": "The NASA-Axiom-ISRO tie-up is an admirable outcome",
        "link": "https://www.thehindu.com/opinion/editorial/stepping-stone-on-shubhanshu-shukla-nasa-axiom-isro-tie-up/article69823643.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "18-07-2025"
    },
    {
        "full_article": "U.S. President Donald Trump has made a U-turn on Ukraine, shifting from his campaign pledge to end the war within 24 hours of taking office to promising to send more weapons to Ukraine and threatening to impose “severe tariffs” on Russia and its trading partners if the crisis is not resolved in 50 days. The shift reflects the complex realities on the ground. Ukraine, which has lost more than 20% of its territories, including its Sea of Azov coastline, to Russia since 2014, agreed to a ceasefire, under pressure from the Trump administration, based on the current frontline. Russia had initially responded to Mr. Trump’s peace push. It agreed to a naval ceasefire in the Black Sea, and halted attacks on Ukraine’s energy infrastructure for 30 days. Moscow also declared brief ceasefires and sent negotiators to Istanbul for talks with Kyiv on June 2, despite a drone strike by Ukraine deep inside Russia, targeting its bombers. But after the U.S. joined Israel to bomb Iran, despite Tehran’s nuclear talks with Washington, Russia accelerated attacks on Ukraine with drone attacks and troop advances in the Dnipropetrovsk region. In a call with Mr. Trump, Russian President Vladimir Putin said he would not back down from his goals in Ukraine. Caught between an intransigent Moscow and pressure from his allies, Mr. Trump seems to have decided to change course.Nevertheless, Mr. Trump has ruled out giving Ukraine long-range offensive weapons. The plan is to send defensive weapons, including Patriot systems and ammunition to Ukraine through NATO allies. While Patriots could be effective in shielding Ukraine’s skies from Russian missile strikes, they are unlikely to alter the balance in the battlefield. And, the U.S.’s ability to hurt Russia through direct tariffs is limited as bilateral trade stood at just $3 billion in 2024. But if Mr. Trump opts for secondary tariffs, the impact would extend to other countries, including India, China, and Brazil. Since the start of the Ukraine war, the U.S. and Europe have imposed multiple layers of sanctions on Russia, which have failed to impact the Kremlin’s war policies. By threatening to penalise third countries for Russia’s actions, Mr. Trump is doubling down on a failed policy, and also jeopardising the energy security of countries such as India, an American partner. Mr. Trump must realise that he cannot resolve global conflicts through imperial-style ultimatums and threats. Instead, sustained diplomacy with Moscow and Kyiv is essential. Russia must come down from its maximalist demands, and Ukraine’s security concerns should be addressed. His focus should be on finding a middle ground between the Russian and Ukrainian positions to achieve a durable peace.\r Published - July 18, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        NATO\n                    \n                            /                      \n                        \n                        defence\n                    \n                            /                      \n                        \n                        energy resources",
        "headline_1": "Middle ground: On Donald Trump and the Ukraine war",
        "headline_2": "U.S. President Donald Trump must ask Russia to back down from its maximalist position",
        "link": "https://www.thehindu.com/opinion/editorial/middle-ground-on-donald-trump-and-the-ukraine-war/article69823814.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "18-07-2025"
    },
    {
        "full_article": "Cruelty to animals in China’s markets for business & pleasure is rampant, driven by rich consumers\nIs a lion cub a toy? This shouldn’t even be a question. But, in today’s world, the unnatural – wild cats cuddled by humans – is normalised in a reality that’s tranquillised. So, a restaurant in north China’s Taiyuan city has no qualms in offering hugs with drugged lion cubs and a four-course set menu at a grand $150, selling 20 tickets a day. Tickets to a restaurant? Food’s the side dish, the real delight is the cuddles – a performance for the rich to flaunt on social media. Another Chinese hotel ‘trained’ red pandas to crawl into guests’ beds as a wake-up call, an alarm, in every sense of the word. Chinese wealthy’s fetish for close and dangerous interactions with wild animals in cities is paralleled only by Latin American drug cartels’ obsession with private zoos of trafficked species, an Escobar-inspired symbol of status and power. Cruelty underpins all of it. It’s brutal that a spider monkey dressed up as a drug gang mascot should be killed in a Mexican shootout. An escaped Bengal tiger found in a lane along the Pacific had had its claws and fangs removed. China’s new wave of cat abuse is vicious. Cat torture videos ‘popular’ globally are produced mostly in China, which has no animal cruelty laws. \nBut as horrifying as these are, China’s insatiable appetite for animal parts for Chinese traditional medicine is worse – it drives the global illegal animal trade. Where there’s drug trafficking, there’s illegal animal trade. And all roads lead back to China. Mexican drug cartels have their claws into wildlife trafficking, supplying China’s traditional medicine markets, leveraging smuggling ties with Chinese suppliers of chemicals to produce fentanyl & meth. Beijing’s periodic crackdowns have little impact on animal cruelty, whether for business or pleasure. Hummingbirds are killed to make love amulets. A lion cub is made a living doll to turn a profit.\n\n",
        "headline_1": "Cuddle…kill",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/cuddlekill/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-07-2025"
    },
    {
        "full_article": "Washington’s new tariff plan for those who buy Russian oil is hypocritical & will hurt US too\nAfter insulting Zelenskyy in Feb, pausing intelligence sharing with Kyiv in March, and weapons supplies in March and May, Trump finally has a plan to stop Putin. He’s going to hit Russia and its trade partners with “very serious tariffs”. Not immediately – Putin gets 50 days to finish the business he started in 2022. But as a big buyer of Russian oil, India should take note. Trump’s threatened to impose 100% tariff on countries that buy Russian goods after the expiry of his deadline, and if he doesn’t waver, or forget – neither unlikely – the concessions won through a trade deal could be lost.\nWill tariffs work? Not directly, because Russia and US have never been more decoupled economically since the collapse of the Soviet Union. US bought goods worth just $3bn from Russia last year, and sold $500mn worth, down from $29bn and $6bn, respectively, before the start of the war in 2022. That’s why Putin must be checkmated through secondary tariffs on his major oil buyers like China, India and Brazil.\nFossil fuels are a very big part of Russia’s GDP (16%), and make up over half of its exports (55%). By the third anniversary of the war, Russia had earned about $1tn from fossil fuel exports. India, which used to buy just 1% of its oil from Russia before the war, now sources 40%, so the threat of 100% tariff on exports could make it pivot again. And China, which buys 20% of its oil from Russia, might also find 100% tariff discouraging.\nRussia could be hurt, but at what cost? Plugging the Russian pipeline is bound to drive up oil prices, which could increase inflation in most places, including US. Add to that the US-specific price rise resulting from 100% tariff on China, India and other US trade partners, and the political risk might be too much for Trump’s Republicans.\nAbove all, Trump’s threat – backed by Nato secretary-general Mark Rutte – smacks of hypocrisy. After ordering the world not to buy Russian oil, US continued buying enriched uranium from Russia for its nuclear plants. Even when it announced a ban on Russian uranium imports from 2027, it gave a waiver to its largest operator of reactors. Likewise, Rutte’s Europe is still buying gas from Russia, and won’t stop till the end of 2027. So, Trump and Rutte’s threat is less about conviction than convenience. India must play by the same rule.\n\n",
        "headline_1": "Fuel folly",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/fuel-folly/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-07-2025"
    },
    {
        "full_article": "The latest AI invention will take a lot of the marvel and the mystery out of life \nWe all lead wonderful lives, often without realising it. Walking through a park we might notice a flower and wonder what its name is. On a street we’ll come across a large imposing building, and we’ll wonder what it is. \nWe look at the sky and wonder why it’s blue. We sit by the sea and wonder why it’s salty when the rivers and rains that feed it are not. \nIt’s all this wondering that makes our lives so wonder-full. But will we soon lose this wonder? An AI device called Meta consists of an ordinary-looking pair of spectacles with a mic attached which tells you whatever you want to know about where you are and what you’re looking at. \nIt will not only tell you the name of the flower that you happen to see, it will also tell you the names of surrounding flowers and plants which, combined, will make an attractive floral arrangement. \nMeta will give you the name, height, and other details about the building before you, and tell you why the sky is blue and the sea salty.\nAnd if you want to know where the closest restaurant or mall is, Meta will tell you how to get there. \nWonder how Meta can do all these things? Wonder if Meta is hitched to a cloud of limitless data somewhere in cyberspace? You needn’t wonder. Because Meta will tell you how Meta does what it does.  \nMeta is marvellous. But by being marvellous, it takes the marvellousness, the sense of wonder, out of life. \nIt’s like reading a murder mystery in which the murderer is revealed on Page 1. Or watching a suspense movie, where the cliffhanger end is shown at the start, making everything that comes after literally an anticlimax.  \nIt’s our sense of wonder, the small and large mysteries that surround us, which add relish to our lives, like reading a mystery novel or watching a thriller. \nWonder if life would be life without wonder? That’s a Meta-physical question even Meta mightn’t be able to answer.\n\n",
        "headline_1": "Lost wonder",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/lost-wonder/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-07-2025"
    },
    {
        "full_article": "London is going nuts over ‘nariyal’\nOxford Street isn’t yet redolent with aromas of simmering aviyal, albeit close enough. Goodbye, Coca-colonialism’s. Hello, coco-colonialism. London is being blitzed by coconut milk, water, oil, fresh/desiccated/compacted kernel. From tabloid, tube and bus, I’m bombarded with ads ordering ‘Convert to Coconut’. It isn’t baptism by fiery kari, but by cool tetrapack. Downing packaged nariyal paani is not a patch on slurping from the real thing, even if easier to wield. It’s already caught on among India’s sipping classes. Here, the little blue and white cartons are drink du jour not only coz Britain – indeed all exited-from Europe – is in the throes of a throat (and grass)-parching Indian summer. It’s a wider conquest.\nThe unrelenting ad’s baseline says, ‘It’s not a cult’. The udder distaste for milk from nature-intended sources led to such substitutes as soya, oat, almond, apple…Coconut conversion, however, goes beyond Veganism & Co. Its messaging cashes in on the greatest, latest massage: ‘gut health’. This is the silver bullet; sure-fire seduction; certain path to nirvana, physical, mental, psychological, yea, even social. As always, We knew it first. Remember the ancient eastern wisdom of a healthy morning evacuation? Here, ‘potty’ is ensured via pot of ‘Coconut Yog’. That’s yoghurt, not Guruji Iyengar. The ad promises ‘ALL YOUR PROBLEMS WILL BE SOLVED. If your problems are exclusively breakfast-based. Or dessert-based. Or curry-dollop-based. Or wanting-a-whole-coconut-in-each-pot-based.’\nChicken tikka masala and king-sized samosa, ok, but no self-respecting desi visitor will cure home-food yearning with ersatz Ernakulam. Better to favour real curry, Mercifully this is no longer the pineapple-riddled atrocity once dished up in icky-sticky Bangladeshi dives. As a mark of my own upgrading, the only Bangladeshi I encountered was expertly shaking signature cocktails in a Portobello tapas bar – and called himself ‘Jose’.\nStill, good to know that ‘coconut’ is now something more desirable than a WOG (Westernised Oriental Gentlemen) who was ‘brown outside, white inside’. Even more satisfying is palms metaphorically swaying amidst oaks, more evidence of East and West mixing, and nixing colonial Mr Kipling.\n***\nAlec Smart said: “Tesla test-drives India.’\n\n",
        "headline_1": "Coco-colonialism",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/coco-colonialism/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 18, 2025 00:00:00  \nThe utter neglect and mismanagement crippling the country's primary education system have been starkly exposed by recent media reports highlighting the thousands of vacant teaching positions in primary schools including those of head teachers. Of the more than 65,000 sanctioned posts for headmasters, over 34,000 remain unfilled. This means nearly 52 per cent of primary schools are operating without head teachers. In addition, approximately 24,500 positions of assistant teachers are also lying vacant.\nThis acute shortage of teachers is severely hampering both the administrative functioning and academic performance of schools. Students -- particularly those in remote and marginalised areas -- are bearing the brunt of the crisis. Delays caused by protracted legal cases, bureaucratic red tape, absence of fresh recruitment, exam deferrals and sluggish promotion processes have only served to deepen the problem. Even under normal conditions, primary students often advance through the grades with significant learning deficiencies due to poor instructional quality. The ongoing teacher shortage has only compounded this issue, experts warn. As a result, the foundation of the education system is becoming increasingly fragile. Addressing this requires more than just filling the posts; it demands ensuring that every school has a sufficient number of well-qualified teachers.\nIn response to the worsening crisis, the Chief Adviser has reportedly directed the authorities for filling the vacant positions immediately. At a meeting held Monday afternoon, he also stressed the importance of evaluating the candidates' skills in selecting new head teachers. According to a press release from his office, the Chief Adviser mentioned several key criteria for the recruitment process, including years of experience, but also recommended that younger candidates be considered. Additionally, he instructed the authorities to revise existing teacher transfer guidelines to include a clear and transparent procedure.\nAccording to the Annual Primary School Census (APSC) conducted by the Directorate of Primary Education, there are currently 114,630 primary schools in the country, of which 65,567 are government-run. These schools collectively serve nearly 20 million students -- about 10 million of whom are enrolled in government institutions. In the past, 60 per cent of assistant teachers' posts were reserved for women under the quota system. However, in 2023, a revised quota policy was introduced for recruitment across public, semi-public, and autonomous bodies. Under the new guidelines, 93 per cent of positions across all grades are to be filled on merit, with the remaining 7.0 per cent reserved for special quotas.\nReports suggest that legal complications -- particularly court injunctions related to promotions -- have stalled recruitment and career progression for years. It is now of critical importance that these barriers be resolved without further delay. The vacant posts must be filled urgently to prevent irreversible damage to the very foundation of the country's education system. Beyond immediate recruitment, lasting reform requires the establishment of a transparent and efficient mechanism for teachers' promotion and appointment -- one that prioritises competence above all. Anything less would be a disservice not just to the teaching profession, but to the next generation of students and the nation's broader development aspirations.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Filling vacant positions  in primary schools",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/filling-vacant-positions-in-primary-schools-1752767651",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       July 18, 2025 00:00:00  \n\nThe recently published Secondary School Certificate (SSC) results have raised more questions than can be answered. A drop of 14.95 per cent in the pass rate from the last year's 83.04 per cent has triggered a debate not only among the general public but also among educationists. Some hold the view that the inflated pass rate and the number of grade point average GPA-5 achievers of the past few years have now come to a pragmatic level courtesy of genuine ---read strict ---evaluation. Others are of the opinion that a combination of negative factors beyond the examinees' control was responsible for the result reversal this year. \nIndeed, here is a generation often referred to as a lost band of young population starting from the entry level kindergarten kids to secondary and higher secondary students who endured the pandemic trauma and the process of unlearning because of corona shutdown and post-Covid economic hardship for many in countries like Bangladesh. This year's examinees were in class VI at the time of corona virus's rampage. Their learning gap in foundational education is common knowledge. \nMoreover, this is the first batch of SSC examinees which has appeared at examinations on the full syllabus. But the question is, have they been adequately prepared for the demanding first public examination? The answer is a big No. Except the few reputed urban schools, most other educational institutions in small towns and villages are handicapped by constraints starting from incompetent teaching staff and a lack of multimedia facilities. Unreliable power supply also does not help the cause of such schools. \nThe much vaunted learning recovery programme never got going and instead there were political unrest, natural calamities like floods and cyclone which severely affected schooling in several areas of the country. There was a month-long closure of schools in January 2022. During the past five years, these learners did not have the opportunity of attending half the days of classroom teaching of the total scheduled for them. Failure in Mathematics and higher Mathematics has reportedly been responsible for the lower pass rate this year. Then the leniency shown in evaluation of examination scripts for successive years following the pandemic was no longer pursued; instead examiners were instructed to be strict in marking answer papers. The evaluation process still remains subjective because examiners are not trained well to evaluate examination scripts in a uniform manner. When a large number of teachers even could not prepare questions known as the creative type, how can they be relied on for objective evaluation of answers?\nWhat is quite surprising is that even a few educational institutions in Dhaka City boasting enviable results year after year have faltered this year. Not only has the number of GPA-5 achievers dropped but also a significant number of examinees have failed. At least two such schools have exposed the downside of their vaunted legacy of SSC results. Sure enough, the lottery system of admission at the entry point may have something to do with it. But then the more important question is the inability of even the best in the business to impart education. They failed to pay enough attention to the special need of the laggards.\nWhen it comes to the disparities existing between the well managed, full-fledged and well-furnished band of educational institutions located mostly in urban centres including the cadet colleges and the skeletal schools in villages casually run by an indifferent managing committee and teaching staff with questionable teaching quality and skills, student performances cannot but show the gulf of difference. Underprivileged and subjected to the worst socio-economic disparities, students of schools with the barest minimum facilities cannot be expected to shine in examination. Only in rare cases, there emerges one or two extraordinary talent/s from such a background. \nNow the leaders of the quota-movement fame known for championing anti-discrimination have never raised this issue of atrocious discrimination facing their junior learners. If any discrimination in society demands top priority, it is this yawning gap in education imparted at educational institutions depending on their locations. Even if a semblance of uniform standard in education at the primary, secondary education system could be brought about by investing more in the discriminated against educational institutions, it would have been a great service to the nation. Had the coordinators and leaders of the quota movement who eventually led the uprising precipitating the fall of Hasina government demanded enough budgetary allocations for starting, at least, the process of reducing the gap between and among educational institutions, it would take the process ahead. The student leaders could act as influencers to leave a permanent footprint in terms of reducing discrimination in education. \nUnfortunately, nothing happened of this order. The elitist stance is not foreign to the student leaders now leading their own political party. True, they are still vociferous about reform which, they think, will bring an end to the political process of making elected government repressive and autocratic. But they must as well have something fundamental to show as a pragmatic programme with the potential of eliminating socio-economic inequality and disparities. Or, how can their credentials be tested? Unless, equal opportunities for education are open to the underclass, achieving social equanimity is impossible. The SSC and HSC results are a glaring testament to the discriminatory education system under which the students of poor and regressive backgrounds lose their ways in wilderness with no hope of getting integrated into the mainstream society.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "SSC results expose yawning educational divide",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ssc-results-expose-yawning-educational-divide-1752767783",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       July 18, 2025 00:00:00  \n\nThe plying of unfit vehicles across Bangladesh has remained a serious road safety hazard for a long period. Repeated alerts from safety experts and directives of the court have failed to ensure the enforcement of relevant laws thanks to rampant corruption in regulatory bodies, inertia among enforcement agencies, political influence and a lack of awareness. According to the Bangladesh Road Transport Authority (BRTA), the number of unfit vehicles on the road is increasing every year. Data compiled by the regulator suggest that over 600,000 unfit vehicles were plying all across the country last year against around 500,000 in 2022. The majority of the vehicles are auto-rickshaws, which are followed by motorcycles, pickups, trucks, buses and microbuses and private cars. Road safety experts, however, believe the figures compiled by the BRTA are a small fraction of the real number of unfit vehicles. Many of them even believe that a large number of the vehicles operating with a seemingly valid fitness certificate are really unfit as corruption at the regulatory body has hollowed out the certification process. It keeps open the door for vehicles to have their fitness certificates renewed in exchange for money no matter how their condition is. There are allegations that vehicles can even skip mandatory inspection for licence renewal.\nPolitical influence and pressure of vehicle owners and workers play a big role in keeping unfit vehicles on the road. When the government agencies launch any crackdown on such vehicles, owner and worker bodies, linked to ruling parties, employ all their power to frustrate the effort.\nThe unfit vehicles on the road are taking a huge toll on human lives and property and environment. According to a report published by the Road Safety Foundation, over 7,000 people died and more than 12,000 were injured in approximately 7,000 road accidents that occurred across the country in 2024 alone. Unfit vehicles suddenly come to a halt, leading to collisions and traffic congestions. Such vehicles mean poorly maintained engines, which emit black fumes, worsening air pollution. A World Bank-supported study conducted in 2019 found that vehicles contribute over 10 per cent to air pollution in Bangladesh. Rundown buses accounted for more than 80 per cent of excessive emissions in capital Dhaka, which has remained among the most polluted capitals worldwide for quite a long time.\nDespite the devastating consequence of the plying of unfit vehicles, regulators and law enforcers do not take any effective action to take such vehicles off the road. They sometimes conduct drives, but those are half-hearted and inconsistent. Several High Court directives to the transport ministry and police for removing unfit vehicles from roads have fallen on deaf ears.\nThe unchecked plying of unfit vehicles exposes governance flaws, weak institutional coordination, a lack of political will and public awareness. A holistic approach needs to be taken to reverse the situation. Fitness enforcement supported by mobile courts should be made round the year, while BRTA requires stronger oversight, capacity building, and modern inspection systems. There must be effective coordination between the BRTA, the DMP, the highway police and local administration to ensure consistent enforcement. The government needs to publish data on the number of unfit vehicles and enforcement actions while the public should be encouraged to refuse using unsafe vehicles.\nRaising public awareness about the consequences of plying of unfit vehicles is also necessary. Non-government organisations and civil society should conduct campaigns to make commuters aware of the danger from unsafe vehicles.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Unfit vehicles pose  threat to mobility",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/unfit-vehicles-pose-threat-to-mobility-1752767872",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 18, 2025 00:00:00  \n\nCan one be imprisoned simply for expressing an opinion? In Bangladesh, unfortunately, the answer is yes. Section 499 of the Penal Code still treats defamation as a criminal offence, punishable by imprisonment. This raises a critical question: should freedom of speech be curtailed in the name of protecting someone's reputation?\nCriminal defamation is increasingly being weaponised to suppress journalism and dissent. \nMany of these cases, often filed without concrete evidence of harm, amount to harassment -- strategic lawsuits against public participation (SLAPP) -- designed to silence critics through financial and psychological pressure.\nInternational bodies like the UN Human Rights Committee and Article 19 have repeatedly stated that imprisonment for defamation violates global human rights norms. \nMany democratic nations, including the United States and Ireland, treat defamation as a civil matter, striking a better balance between free expression and the right to reputation. In the US, for instance, the First Amendment protects speech, and defamation suits must meet the 'actual malice' standard.\nIn contrast, our legal framework continues to instil fear. A Facebook post or tweet can now land a citizen in court -- or worse, in jail. Such laws not only chill free expression but also hinder Bangladesh's progress towards a democratic and digitally inclusive society.\nReform is urgently needed. Bangladesh should decriminalise defamation by amending Section 500 of the Penal Code and the Digital Security Act. Provisions such as civil remedies, penalties for baseless claims, and judicial safeguards before filing cases should be introduced. \nAdditionally, judges must be trained to distinguish genuine defamation from fair opinion.\nGenuine justice protects, not punishes. The role of media and civil society is also vital -- to ensure factual reporting and prevent malicious defamation. Through legislative reform, public awareness, and responsible journalism, Bangladesh can build a democratic society that upholds both freedom and dignity.\nThe right to speak truthfully must never be a crime.\nBy Surja Mandal\nAspiring Legal Researcher & LL.B. Student\nDepartment of Law\nWorld University of Bangladesh\nsurjamandal032@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Defamation laws need reform",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/defamation-laws-need-reform-1752767896",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-07-2025"
    }
]