[
    {
        "full_article": "President Donald Trumpappears to have set the cat among the pigeons yet again so far as recent Indian foreign policy actions are concerned, this time with regard to an alleged assurance by Prime Minister Narendra Modi that India would halt its oil imports from Russia. Speaking at the White House, Mr. Trump said that Mr. Modi had assured him on Wednesday (October 15, 2025) that India “will not be buying oil from Russia... Now we’ve got to get China to do the same thing”. This utterance follows in the wake of a summer of heightened temperatures in the bilateral space, after multiple claims by Mr. Trump that he played a role in bringing Operation Sindoor to an abrupt halt, with a full and immediate ceasefire agreed only after “a long night of talks mediated by the United States”. India was quick to challenge the White House’s narrative, with a Ministry of Foreign Affairs spokesperson saying that he was unaware of a conversation between the leaders on the previous day, even if discussions were “ongoing” about deepening India’s energy cooperation with the U.S. Nevertheless, he did not unequivocally confirm or deny Mr. Trump’s assertion that India would be halting its purchases of Russian oil. A similar ‘soft denial’ approach seemed to be the chosen tack in the aftermath of Operation Sindoor.The quandary faced by Indian foreign policy strategists is that India is in a sensitive phase of bilateral engagement with the U.S., specifically regarding its hopes for bilateral trade deal in the nearer term and shared regional goals in the context of the rise of China, over the longer arc of the evolving balance of power in Asia. Additionally, Mr. Trump’s sheer chimerical nature, which is either the trait of an impulsive but popular leader on American soil, or the standard “art of the deal” playbook trait of a President seeking to bring global counterparts to the negotiating table, appears to be routinely frustrating South Block mandarins seeking predictability in their engagements with U.S. interlocutors. India may have found an appropriate response in avoiding knee-jerk public reactions to the sometimes outlandish claims of Mr. Trump. However, the bigger challenge for New Delhi is to clarify its global posture on issues such as the purchase of Russian oil in the context of Russian aggression in Ukraine. It would do well to remember that it is not so much the strident voices of the North Atlantic that matter as much as India’s hopes to be a true global power one day, and speak with the moral clarity that accompanies such a title. Published - October 18, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        imports\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        Donald Trump",
        "headline_1": "​Claim, counterclaim: On India and foreign policy",
        "headline_2": "India must speak out on world issues with moral clarity, not tactical ambiguity",
        "link": "https://www.thehindu.com/opinion/editorial/claim-counterclaim-on-india-and-foreign-policy/article70175673.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "18-10-2025"
    },
    {
        "full_article": "In a brazen admission, U.S. President Donald Trump has confirmed authorising covert CIA operations in Venezuela targeting the government of Nicolás Maduro. This escalation follows weeks of deadly strikes on boats in Caribbean waters, threatening to destabilise the region by violating fundamental principles of international law. The prospective actions fall under a grim historical pattern of actions by the CIA — the 1954 coup in Guatemala, the Bay of Pigs disaster in Cuba, the orchestration of the 1973 coup in Chile that resulted in President Salvador Allende’s death and the Contra wars in Nicaragua in the 1980s. Such interventions have led to catastrophic consequences such as decades of instability, democratic backsliding and authoritarian rule, leaving scars across Latin America. Mr. Maduro’s disputed election victory in 2024 has compounded his regime’s economic mismanagement which, combined with sanctions, has devastated Venezuela’s economy. In recent years, millions of Venezuelans have been forced to flee because of the crisis, with many undertaking perilous journeys through Colombia, the dreaded Darién Gap and Mexico to reach the U.S. The refugee influx has provided the Trump administration with ammunition to weaponise the immigration issue and to issue claims about Venezuelan drug trafficking to up the ante against the Chavistas, as the followers of former President Hugo Chávez are called. Mr Trump has repeatedly, without proof, characterised Mr. Maduro as a “narcoterrorist”, alleging that the country operates as a drug corridor, with criminal trafficking organisations under his control. This has been contradicted by the U.S. intelligence agencies, much to Mr. Trump’s disapproval, leading to consequences such as the firing of a National Intelligence Council director who refused to alter his assessment of the drug issue and the Maduro regime.It is not difficult to ascertain the true motive of the Trump administration — to control Venezuela’s massive petroleum reserves and substantial natural gas deposits. The fact that Caracas has maintained strong trading relations with Russia and China, and close ties with the U.S.’s bête noire, Cuba, also presents a geopolitical challenge to American hegemony in the region — this has also explained the hostility by preceding American administrations but none was as brazen as Mr Trump is. This is not to absolve the Maduro regime. Its authoritarian trajectory and manipulation of electoral processes deserve international censure. But acknowledging these failures does not justify illegal U.S. intervention. The international community must resist the Trump administration’s recourse to illegal and Cold War-era regime change policies and instead pursue diplomatic solutions that respect Venezuelan sovereignty while supporting its genuine democratic forces. Venezuela must determine its future without external intrusion.\r Published - October 18, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Venezuela\n                    \n                            /                      \n                        \n                        international law\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        espionage and intelligence\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        natural gas\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        diplomacy",
        "headline_1": "Blatant aggression: On the Trump administration and its Venezuela actions",
        "headline_2": "The Trump administration’s illegal intervention in Venezuela is built on false pretexts",
        "link": "https://www.thehindu.com/opinion/editorial/blatant-aggression-on-the-trump-administration-and-its-venezuela-actions/article70174882.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "18-10-2025"
    },
    {
        "full_article": "It has to head home. There’s no certainty US hostility against Indian talent will go away with Trump. India’s elite will have to demand & work towards building world-class universities here\nAvenues that once brought Indians to richer countries are shrinking as nations like the United States turn increasingly hostile to immigration. Is this a passing storm or the glimpse of a new era?\nRead full story on TOI+ \n\n",
        "headline_1": "Where’ll our brain train go?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/wherell-our-brain-train-go/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-10-2025"
    },
    {
        "full_article": "Obesity is not principally a result of India’s traditional staples of rice and roti, despite conclusions of a recent study. The key reason is consumption of ultra-processed foods\nICMR-INDIAB Survey-21 has triggered a national debate by linking India’s growing obesity to carbohydrate-heavy diets and by implication, to rice and roti as a source of refined carbs. The study’s findings have made headlines highlighting how these two staples ruin our health.\nRead full story on TOI+\n\n",
        "headline_1": "This Diwali…Here’s what to know about eating",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/this-diwaliheres-what-to-know-about-eating/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-10-2025"
    },
    {
        "full_article": "Jaya Row\nWe live in an age of endless options, possibilities, and achievements. Yet why do so many of us feel lost? Because we don’t know ourselves. We’re unsure of what we truly want. So, we get tossed around by others’ opinions.\nThose who know themselves remain centred. Rahul Dravid once joined a CA course as a backup in case cricket failed – but he quit after the first class and chose his true path. Ustad Zakir Hussain never wavered about his purpose. Einstein had no doubts about his vocation.\nLook within. Discover your passion. From childhood, the signs are there. Some recognise them early, others take time. But everyone can find their calling.\n\nWe are all wired for greatness. Not everyone can be a Steve Jobs or a Lata Mangeshkar. But everyone carries the same divine spark. Connect with the Spirit and you’ll rise above every obstacle to achieve excellence.\nEric Liddell, the athlete, had neither a coach nor fancy shoes. His belief was simple – God made me to run, and i will run for God. He was unstoppable. He went on to win the Olympic gold.\nSo, what you do matters more than how talented you are. If you use your gift only to make money, you’ll remain ordinary. Dedicate your talent to a higher purpose – your company, your community, your country.\nAnd excellence flows. The higher the goal, the greater your success. And the highest? When you realise your ability isn’t yours – it’s a divine blessing. You offer it back in gratitude to that Power. That’s when magic happens. You reach perfection.\nWe may have countless followers online and many friends around us, yet we often feel lonely. Because the connection from the heart is missing. When was the last time you truly reached out to someone, felt their sorrow, or rejoiced in their achievements? Loneliness arises from self-absorption. When you’re preoccupied with yourself – your looks, comfort, image – you feel isolated even in a crowd.\nArtificial Intelligence may transform the world, but it can never replace the human quest for love. When you reach out to someone, listen with empathy, and genuinely care, you give something far more precious than wealth – the assurance that they matter. You light a spark of belonging, reminding another soul: You are not alone in this world.\nAs we expand our circle of love, it blossoms into devotion. We begin to sense a benevolent Power that guides our lives – one that blesses us in countless ways, always at the right time, place, and measure. Awareness of this grace fills us with gratitude and awakens a deep yearning to unite with that Force. True devotion expresses itself as love for all beings. This makes for success in life.\nWhen work is performed in an atmosphere of warmth and goodwill, mediocrity transforms to excellence, and drudgery to revelry. You begin to enjoy what you do. Happiness grows as you learn to rejoice in others’ victories as your own. Gradually, selfish desires fade, replaced by a genuine concern for others’ well-being. You grow spiritually.\nWe are an amalgam of matter and Spirit. Matter comprises the body, mind, and intellect. Spirit is the life-giving force that enlivens them. The scriptures declare that we are not the body, mind, or intellect – we are the Spirit. This understanding is a game-changer.\n\n",
        "headline_1": "Expanding the circle of love",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/expanding-the-circle-of-love/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-10-2025"
    },
    {
        "full_article": "OpenAI gets ready to get explicitly competitive. This was inevitable, as are questions that follow\nTreat adult users like adults, is an unexceptional principle, indeed a fine one. But what’s captured interest in Sam Altman’s post about ChatGPT committing more fully to this principle, is that it will be allowing erotica for verified adults. Users are already talking to chatbots about sex and romance. These conversations will clearly race XXXwards as the company relaxes the restrictions it has in place right now. This is very worrying for all those who, with good reasons, believe that pornography is already a public health crisis, seriously undermining the human capacity for healthy relationships. But hasn’t every technological leap of history in a way been a big leap for pornography? Expecting AI to transcend that tendency was always a pipe dream.\nThe printing press took erotica from the very wealthy to a much broader audience, the telephone created phone sex, VHS beat Beta by embracing pornography, which was also a huge driver in the internet’s development and popularisation. As for today’s tech leap, it’s tough to say where it will take us all. Maybe OpenAI will take lessons from platforms like OnlyFans, which does a decent job of ensuring minors don’t sign up. The great poser is how increasingly realistic AI-produced porn will reshape this human addiction.\nAnyway, OpenAI’s cuddle of erotica is eminently good business. What is laughable is Sam claiming this is not about “usage-maxxing”. Dude. Nobody’s buying that. Or that the restrictions that had been put in place for ChatGPT are only being loosened now because the company has “been able to mitigate the serious mental health issues and have new tools”. It’s clear from reportage from across the world that age-gating is still unreliable and mental health dangers are only intensifying. But so is market competition. OpenAI will not let the sexually explicit chatbot companions unveiled by Musk’s AI company and others hurt its growth curve – without some dirty dancing. \n\n",
        "headline_1": "XXXGPT",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/xxxgpt/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-10-2025"
    },
    {
        "full_article": "Chattogram city has long been grappling with a host of problems exacerbating the plight of its residents. Despite spending an estimated Tk 10,000 crore to address the waterlogging crisis over the past eight years, the city still goes under water during heavy rainfall. Its drains and canals remain clogged with waste, hampering the drainage system, while frequent flooding during monsoon often turns its open drains and canals deadly. Adding to the city's woes, there has been a sharp rise in mosquito-borne diseases this year. Against this backdrop, it is unfortunate to learn about the Chattogram City Corporation's (CCC) struggle to clean its 1,600-kilometre drainage network and 57 canals apparently due to a lack of modern machinery.\nReportedly, while the government has approved a long-pending CCC project to purchase essential equipment for this purpose, the approval came with a condition that 60 percent of the funding would come as a loan and 40 percent as a grant. Already burdened with debt, the CCC is reluctant to take on additional loans. The mayor argues that the organisation is a service-oriented body, not a commercial entity, and therefore should not be required to operate under commercial loan terms that involve paying interest. However, the government has urged the CCC to become more self-reliant and accept the loan.\nWhile ideally the CCC should be a self-sustaining entity with its own sources of income, this is not the case in reality. It primarily carries out development activities with funds received from various projects, while only a small portion of its income comes from holding taxes and other sources. The CCC's ability to increase revenue or obtain grants is also dependent on the approval of the Ministry of Local Government, Rural Development and Co-operatives. But the project in question being an important one for the city, we think the authorities should find a way to address funding shortages through proper discussion among the parties involved.\nAt the same time, the CCC must fulfil its responsibilities properly. Its inefficiency or neglect in carrying out basic duties—such as keeping the city clean, addressing the mosquito menace, covering open drains that frequently cause fatal accidents, and regularly cleaning drains and canals under its jurisdiction—is deeply unfortunate. The corporation also has a history of delaying development projects for indefinite periods, a practice that should no longer be tolerated. Experts have repeatedly criticised its failure to properly maintain the city's vital waterways and highlighted serious flaws in project implementation. Going forward, this must change. Moreover, the persistent lack of coordination among various government agencies, which continues to worsen the city's waterlogging problem, must be urgently addressed.\n",
        "headline_1": "CCC must play the role expected of it",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/ccc-must-play-the-role-expected-it-4010391",
        "news_paper_name": "The Daily Star",
        "publish_date": "18-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 18, 2025 00:00:00  \nUnilaterally announcing a fresh hike in edible oil prices last week, the refining companies have clearly defied the government's position on the issue as the Commerce Adviser on Tuesday last denied having approved any such price hike. This hike in oil prices has taken place exactly three weeks after the edible oil price was increased last time on September 22 by the interim government. Notably, on that occasion, the oil companies' association, Bangladesh Vegetable Oil Refiners and Vanaspati Manufacturers Association (BVORVMA), demanded an increase in retail price of soybean oil by Tk10 per litre. However, the government allowed a minimal increase by Tk1.0 per litre, which the oil companies seemingly accepted rather with reluctance. In consequence, the oil refiners, according to reports, even threatened with suspending import and cutting supplies of oils.\nAgainst this backdrop, the edible oil refiners and importers association, whom the vice president of the Consumers Association of Bangladesh (CAB) termed an oligarchy, practically 'blackmailed' the government by effecting a per litre increase in the oil prices from Tk 3.0 (for loose soybean oil), Tk 6.0 (for bottled soybean oil) and Tk 13 (for palm oil) respectively. By increasing edible oil prices without consultation with the government, these edible oil market operators are acting, as though, they were a law unto themselves. In fact, they have been in that kind of mindset since long seeing that the governments of the past, too, yielded to their stubbornness for reasons not hard to understand. \nA look at the prices of edible oils over the last one year would amply demonstrate how the oil companies could get away with their demands with the result that the edible oil price curve has been on an ever-rising trajectory. Statistics maintained by the Trading Corporation of Bangladesh (TCB) show how the price of bottled soybean has increased in recent months. By just over a year, between September 2024 and October 2025, it has seen an increase from Tk 167 to Tk195 per litre. Traders have come up with excuses, such as volatility of international edible oil market, wars, disruptions in supply chain, weakness of taka against dollar and so on to justify hikes in oil prices. But the government, in most cases, proved to be too pliant about accepting their demands. However, the consumers would like to see a change this time around from the interim government. \nThat is especially so when the edible oil companies are behaving in a manner that cannot be considered respectful of law and, as such, unacceptable. True, the edible oil companies' cartel holds an immense sway over the market. Even so, they need to be mindful of the fact that they are dealing in an item that belongs to the category called essential commodities and any arbitrary hike in their price has the potential to affect public life seriously. It is more so when the inflation is still high and the average person has not experienced any rise in their income levels over the years. The edible oil companies need, in that case, to consider striking a balance between profit and public interest. The incumbent government, on its part, to protect public interest, should also include representatives of the consumer public during future talks on any adjustment of edible oil price. However, in the face of unilateral decision of oil price hike by the oil refiners, it is expected of the interim government, especially the commerce ministry, that it would put its foot down and make the edible oil association see reason.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Reining in defiant edible oil companies",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/reining-in-defiant-edible-oil-companies-1760712538",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       October 18, 2025 00:00:00  \nDedicating an entire month to a single issue demonstrates the profound seriousness of the cause. It recognises that a single day of lip service is not enough to cut through the noise and a longer effort is needed to make people truly pay attention. This is precisely why October has been designated as a month to shine light on ADHD, a condition that is too often brushed off as a simple lack of discipline or, worse, a figment of the imagination.\nNowhere is this awareness more crucial than in Bangladesh where mental health rarely receives the attention afforded to physical illness. The latest national mental health survey from five years ago revealed that about 18 per cent of adults and 13 per cent of adolescents suffer from some form of mental health condition. While awareness is slowly growing, limited access to proper diagnosis and treatment keeps old misconceptions alive and well. Too often, unless someone completely loses the grip on reality, society refuses to see mental health as a medical issue at all.\nAttention Deficit Hyperactivity Disorder, or ADHD, stands as a telling example of collective misconception. It exists, but few recognise it. While we have no local data to prove the scale of the problem, global figures make it clear that it cannot be rare. The Nuffield Trust estimates that around four per cent of people in England live with ADHD. Rates are reportedly higher in the United States, though possible over-diagnosis may influence the figure. With a global average of three to four per cent, there is little reason to think the rate in Bangladesh would be any different. \nADHD is a neurodevelopmental disorder, meaning it affects how the brain develops and functions. For years it was misunderstood as a childhood condition that mainly affects boys who appear restless or inattentive in class. However, research now confirms that ADHD often persists into adulthood. Many adults receive a diagnosis only later in life, after years of unexplained struggle. Crucially, ADHD is not a lack of attention but a difficulty in regulating it. Some affected individuals are primarily inattentive, others more hyperactive and many experience both tendencies. This wide range of symptoms means ADHD can look very different from person to person, which is precisely why greater awareness and accurate diagnosis are so essential. \nThe challenges of ADHD are made even tougher by today's fast-paced world. In many Bangladeshi households where both parents work long hours, smartphone has become a default digital babysitter. While a convenient solution, this can be particularly detrimental to a child with ADHD. The endless stream of short videos and reels trains the brain to crave constant excitement, depleting the patience required for sustained focus. Then comes the education system, which only adds fuel to the fire. Our classrooms, with their rigid obsession with rote memorisation and silent obedience, are a poor fit for any creative mind, but for a neuro-diverse learner, they are a prison. A child who learns best through movement or hands-on exploration is instantly branded as troublemaker. With teachers untrained in neurodiversity and schools offering zero flexibility, is it any wonder that these bright, energetic children end up feeling alienated and defeated in a system that refuses to see their strengths? \nParents, unaware of the root cause of their child's behaviour, may respond with harsh discipline, unintentionally exacerbating the child's feelings of inadequacy. It is important for them to understand that ADHD has nothing to do with low intelligence or a lack of willpower. Many with the condition have gone on to achieve remarkable things by learning to channel their energy and creativity into productive outlets. The beloved fictional hero Percy Jackson, for instance, had ADHD. In real life, figures like Will Smith, Emma Watson and Michael Phelps have spoken openly about their diagnoses. Phelps has shared how ADHD made school a struggle but never held him back from breaking world records. Even Bill Gates has acknowledged his own experiences, leading many to view it not merely as a disorder but as a different way of thinking. \nThis is why getting a proper diagnosis is so important. It not only gives a name to a lifelong struggle but also reassures people that they are not broken, only wired differently. This clarity allows individuals to stop fighting against their own minds and start playing to their strengths. In Bangladesh, however, getting an ADHD diagnosis is easier said than done. Psychiatrists are few in number, and their fees place them out of reach for the average family. A handful of psychological health and wellness centres offer assessments, but their capacity barely scratches the surface of the national need. \nThose who have managed to get a diagnosis often voice frustration over the unavailability of medication. Some of the most effective ADHD drugs are banned in Bangladesh due to their addictive potential. Ironically, methamphetamine, widely abused as Yaba and responsible for ruining countless young lives, is used in controlled doses elsewhere to treat ADHD. This contradiction raises uncomfortable questions about the relationship between untreated ADHD and substance abuse, though more research is needed to draw definitive conclusions. \nThe silver lining is that medication is just one piece of the puzzle. Therapy and behavioural interventions have proven to be just as effective, if not more so, in managing the condition. A mix of behavioural therapy, classroom adjustments, family counselling, and, where appropriate, medication has helped countless people live full and meaningful lives. \nParents must be at the heart of any awareness effort, as children with ADHD are at higher risk of anxiety and depression if left unsupported. Many parents fear that a psychological diagnosis will stigmatise their child, but recognition actually opens the door to understanding and practical solutions. A diagnosis does not limit a child's potential but rather helps map out the specific kind of support they need to thrive. \nAs October unfolds, it offers a chance to begin this long-overdue national conversation. The stigma around ADHD will only fade when talking about it becomes as ordinary as discussing a common cold or a fever. \nshowaib434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Breaking the silence around ADHD",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/breaking-the-silence-around-adhd-1760712601",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       October 18, 2025 00:00:00  \nAll of them, students from schools, studying between classes seven and ten, and hailing from different parts of the country, gathered in Dhaka to present their research papers or concept notes. Though sound puzzling, their dedication was evident as they expressed various thoughts creatively, addressing multiple socio-economic challenges and offering solutions to existing problems in education and health. This collective effort made the event vibrant and inspiring.\nOrganised by Chintar Chash (Cultivating the Thoughts), a Dhaka-based voluntary research organisation, this was the tenth annual convention of the young or budding researchers. The organisation's decade-long commitment to stimulating interest among school-level students in analytical thinking and research is commendable. Their workshops on research methodology, conducted across the country, have been instrumental in developing the research capacity of school students, equipping them with the tools and confidence to participate in research work. \n If school-going boys and girls can get a clear idea of why research is critical and also how to do research, they will grow up with a broader mind. By conducting research at the school level, students will also develop their skills in in-depth research on different matters. Moreover, the training will contribute to improving their academic performance. Being a creative extra-curricular activity, research is also a matter of pleasure. \nUnder the programme, school students are encouraged to write both the research and concept papers focusing on problems people face in their daily lives, or issues related to basic human needs like food, clothing, shelter, education, healthcare, etc. They are also allowed to focus on international situations that cause concern, or any other problem they feel necessary to fix. Besides identifying and writing about problems, they also need to propose solutions or approaches to the problems. Moreover, students are also asked to outline plans or frameworks for inventing a scientific device or project in the concept papers.\nThis time, in the tenth conference, to be precise, young researchers presented a wide range of topics, like the seasoned researchers. Although some of the issues are not suitable for school students due to their complexity, allowing them to think and write about these matters adds real value. For instance, when three students of grade 9 at Dinajpur Schools of Liberators presented their paper titled 'Finding the possible causes of congenital heart disease among the people of Dinajpur, Bangladesh,' it may sound astonishing. Nevertheless, it also reflects the students' in-depth thinking and concern about the growing risk of inherited heart disease. Again, three grade-10 students from Notre Dame School and College in Sri Mangal researched the sports skills of 9th and 10th-grade students in Sri Mangal. It is a field-level research providing some good insights applicable to many others as many schools in the country do not have adequate space to offer sports facilities for students. \nThe core aspect of the entire exercise is not the extent to which the young researchers have offered solutions to various problems, but rather how they have developed their research and concept papers. The time and energy invested in preparing the papers through group discussions, library works, field surveys, peer consultations, literature reviews, and meetings with experts are more critical than the outcomes. Their eagerness to present the analyses and findings in a competitive manner is also remarkable. Those who were present at the venue to watch the event has appreciated the efforts. \nWhen several juveniles in the country are trapped in destructive gang culture or when a large number of school students are obsessed with digital devices, it is heartening to learn that younger people are also coming ahead to devote them to research and analysis. It is now necessary to keep the devotion alive and encourage them for innovation in the future. There is no doubt that Bangladesh will see some bright researchers who will emerge from these younger ones in the future.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Budding researchers put their merits on display",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/budding-researchers-put-their-merits-on-display-1760712635",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 18, 2025 00:00:00  \n\nOne mosque from the bygone Bengal Sultanate still stands in Habiganj and is in urgent need of restoration. The Shankar Pasha Mosque, a single-domed, one-story brick structure, sits atop a mound on the northern bank of a large pond. With six octagonal turrets, a verandah on the east, and a mihrab projecting westward, the mosque showcases architectural elegance from centuries past. Its prayer chamber features three doorways on three sides, with wall panels adorned with reliefs of pomegranate trees. A slate stone inscription over one entrance proclaims the name of the ruling sultan. Built during the reign of Sultan Alauddin Hussain Shah in the late 1400s, the mosque reflects influences from the homelands of Muslim colonists who settled in Bengal, reminiscent of small, covered mosques in ancient Iran and Central Asia.\nSultan Alauddin Hussain Shah, of Iranian descent and formerly Syed Hussain Sharif Makhi, ascended to the throne in 1494 and reigned for 25 years. A stone inscription in Sylhet marks the northeast boundary of his kingdom. Rural folklore links the original Syed family of Habiganj in marriage to this sultan. The clan traces its roots to Sipahsalar Syed Nasiruddin (Rahmatullah alaih), a Baghdad-born general who fled after Mongol ruler Hülegü Khan's conquest in 1258. Joining the Delhi imperial army, he later became armed forces chief under Bengal Sultan Shamsuddin Firuz Shah. In 1303, he conquered Sylhet alongside the sultan's nephew Sikandar Khan Ghazi and the great Sufi saint Hazrat Shah Jalal (R).\nAfter conquering Sylhet, Syed Nasiruddin (R) led an army to the principality of Taraf (modern Habiganj), ruled by King Achak Narayan. Following the king's flight to Tripura, he became the region's administrator, introducing Islam, clearing forests, and improving rice cultivation. His family continued to serve as local administrators until 1581. It is plausible that they contributed to the construction of Shankar Pasha Mosque, which remains in use and evokes nostalgia for their descendants.\nAs the mosque falls under the Bangladesh Archaeology Department, private restoration is legally restricted. I call upon Advisor Mostafa Sarwar Farooki, Cultural Affairs Ministry Secretary Md. Mofidur Rahman, and Director General Sabina Alam to prioritise the mosque's restoration. Many Syed family members, both in Bangladesh and abroad, are willing to fund the project if it proceeds with transparency. Preserving this historic mosque is not just a matter of family legacy but a national and cultural imperative.\nTamim Choudhury\nWashington, DC\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Preserving heritage from the Bengal Sultanate",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/preserving-heritage-from-the-bengal-sultanate-1760712657",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-10-2025"
    }
]