[
    {
        "full_article": "The central government’s proposals to reform the Goods and Services Tax (GST) system are bold and timely. They stand to benefit the middle class and the business community, as the government claims. Shifting 99% of the items in the 12% slab to a 5% tax rate, and 90% of the items in the 28% slab to 18% will substantially reduce the tax burden on most consumers. Rationalising the number of slabs and shifting similar products to the same slab will also reduce ambiguity and litigation, which are the major issues businesses have with the current GST setup. Further, while most of the focus has been captured by the rate restructuring proposals, the procedural reforms regarding registration, return filing and refunds are equally important. Simplifying GST is not just about reducing the multiplicity of rates but also about making it easier and less time-consuming for tax-payers to navigate the system. Easing registration, simplifying returns and speeding up refunds, therefore, are welcome improvements the Centre is pursuing. Combined with the new Income Tax Bill and the rejig of income-tax slabs in this year’s Budget, these GST reforms will highlight 2025 as a watershed year for tax reform — direct as well as indirect tax. While the government has not made an official estimate of what the revenue impact of these reductions will be, sources have said that it expects a hit. Two years ago, the Reserve Bank of India had estimated that the average GST rate was 11.6%, which is now expected to fall substantially. However, the government is confident that an increase in consumption and a widening of the tax base will offset most of the revenue loss. With a large number of items set to be taxed at just 5%, the incentives for input tax credit scams and tax evasion will also be substantially removed.A willingness to risk some amount of revenue in order to boost domestic consumption bodes well for the economy, especially at a time when export demand is faltering due to tariff uncertainties. It remains to be seen how the State governments will react to this proposed revenue surrender. They have already been lobbying the Sixteenth Finance Commission to increase the share of States in central taxes. These tax cuts will also make it even more unlikely that petroleum products — a major source of States’ revenues — will be included in the GST any time soon. Politically, it will be difficult for the States to directly oppose these rate reductions, but they might instead pressure the Centre for compensation once again. Crucially, the Centre will be reaching out to the States over the next few weeks to put forth its case. It is important that their concerns are taken on board as well. Published - August 19, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        government\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        Union Budget\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        Reserve Bank of India",
        "headline_1": "​Required reforms: On reforms to the GST system",
        "headline_2": "Risking some revenue to boost consumption will help the economy",
        "link": "https://www.thehindu.com/opinion/editorial/required-reforms-on-reforms-to-the-gst-system/article69947636.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-08-2025"
    },
    {
        "full_article": "Global resistance to a universal treaty on eliminating plastic pollution remains stubborn and huge. Last week, the sixth attempt since 2022 by the United Nations Environment Programme (UNEP) to get member-nations to agree upon a treaty to address plastic pollution ran into the familiar vortex of opposition. There was disagreement among the major blocs of countries on whether comprehensively addressing plastic pollution requires eliminating plastic production itself. All countries agree that the ubiquitous polythene bag, despite its immense practicability and affordability as a container, has ballooned into a civic crisis. India generates around 3.4 million tonnes (MT) of plastic waste but recycles only about 30%. Its plastic consumption rose at a compounded annual growth rate (CAGR) of 9.7% from 14 MT in 2016-17 to over 20 MT in 2019-20. India has a production ban on about 20 single-use plastic items — cups, straws, spoons. While this has, to some extent, induced a degree of behavioural change — in greater reliance of paper and cloth bags — it has had little impact on waste management and recycling. This is also reflective of the global picture. According to the UNEP, the world produces more than 430 MT of plastic annually, two-thirds of which are short-lived products that soon become waste. Overall, 46% of plastic waste is landfilled, while 22% is mismanaged and becomes litter. In 2019, plastic, which is a derivate of fossilised crude, generated 1.8 billion metric tonnes of greenhouse gas emissions or about 3.4% of the global total.Plastic, therefore, can be seen as a waste management problem that can be solved by improving incentives for the market to do a better job of collecting waste and recycling. However, there are countries that point to the decades of attempts made on these lines, with limited gains. To add to that, more evidence has piled up that plastic, non-biodegradable as it is, is making its way into human, animal and marine food systems. Island-nations and territories are swamped by plastic waste washing up on their shores. Then there are granular forms of plastic — or microplastics — with potential for harm. Thus, the only real solution is to reduce at source. However, nations are not all agreed upon this aspect of toxicity. Therefore, in treaty-linked talks, they view calls to cut production as tactics to impose trade barriers and add to the general climate of tariff uncertainty. Unless countries can build greater trust before such talks and hear each other out with an open mind, having more meetings will only be futile. The halcyon days, when some countries could steer resolutions on the environment assuming that the ‘common good’ was incontrovertible, are long past.\r Published - August 19, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        plastic pollution\n                    \n                            /                      \n                        \n                        plastics\n                    \n                            /                      \n                        \n                        United Nations\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        waste management\n                    \n                            /                      \n                        \n                        recycling\n                    \n                            /                      \n                        \n                        international (foreign) trade\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        environmental issues",
        "headline_1": "​Familiar impasse: On the global response to eliminating plastic pollution",
        "headline_2": "Talks on limiting use of plastic must be built on mutual trust",
        "link": "https://www.thehindu.com/opinion/editorial/familiar-impasse-on-eliminating-plastic-pollution-global-response/article69947653.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-08-2025"
    },
    {
        "full_article": "Talks end in no ceasefire, no peace agreement\nIt is impossible to win an argument with Kamala. Even when she is obviously in the wrong, she will sit me down like in a press conference and explain how I am actually responsible. And she can be very convincing. ECI should recruit her in its defence. Putin and Trump could also benefit from her negotiating skills. Every person in the room listening to her version of the story would be certain she was an innocent victim who did not deserve to be blamed.\nIt all started with a wedding on her side of the family. I went along dressed up in a bandgala, determined to keep my mouth shut. Her family politics is more complicated than the Russia-Ukraine war. There are uncles who will not speak to us, and aunties who may smile at us but are not to be spoken to. Everyone knows the old Thaatha sitting in the front row is the root cause of the conflict, but no one says so. Kamala left me stranded in the middle of this war zone and wandered off cheerfully to a group of matriarchs fussing over the bride’s jewellery.\nThe inevitable happened. An uncle walked up and enveloped me in a bear hug, the kind politicians use on the world stage. ‘You know me…I’m Piyush Uncle. I stayed in the house behind yours!’ A population of more than 1.4 billion could hold many people named Piyush. There could be eighty people living in the same house and their house numbers could all be zero. Their father’s name could be fcdpg for all I cared. Even a PowerPoint presentation could not make things obvious for me.\nHe began talking about his share of the ancestral property and I could see that I was being projected onto the big screen and Kamala had noted my discomfort. She swooped down and removed me from the scene like a street dog from Delhi-NCR. ‘Why are you talking to that man!’ she hissed at me angrily. Apparently he belonged to that side of the family that had encroached on the family property decades ago. I was summoned by the old Thaatha in the front row who attempted to broker a ceasefire. Or at least a peace agreement.\nEveryone huddled together and discussed matters seriously. Nothing seemed to change but someone was being nominated for the Nobel Peace Prize. Now Kamala insists I take an oath never to speak again in public or to submit a written apology. I elect to maintain a stoic silence. I have been commissioned as a husband to do so.\n\n",
        "headline_1": "Family war zone",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/family-war-zone/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-08-2025"
    },
    {
        "full_article": "India’s best response to Trump’s ‘daddy diplomacy’ is to keep back channels open\nAs Trump’s attempts to close in on a peace deal in the Ukraine war gather pace, his personalised foreign policy is turning out to be a double-edged sword. Dubbed ‘daddy diplomacy’, Trump obviously wants to take credit for every perceived foreign policy win. But that desire also makes him susceptible to manipulation. Just before meeting Putin in Alaska, he declared he wanted a ceasefire. After that meeting, he wanted a peace deal, aligning his views with Putin’s. Similarly, some flattery by Pakistan army chief Asim Munir and a Nobel Peace Prize recommendation led Trump to declare that he loves Pakistan. India, for not playing along, is being punished with secondary tariffs for buying Russian oil.\nAccording to the Lowy Institute, there are two sides to this phenomenon. First, personalised diplomacy may seem to reap short-term rewards, but it does tend to be counterproductive in the long run. For, diplomacy isn’t a one-shot event. It’s continuous over the years. Sure, Trump might count the recent Armenia-Azerbaijan peace deal as a win for his daddy diplomacy. But having leaders fuse their persona with diplomacy runs the risk of foreign policy unpredictability – they will bail if a process doesn’t align with their political goals.\nThat may not be good for the countries themselves. India and US have all the makings of natural allies, and New Delhi can be Washington’s best partner in the Indo-Pacific as a hedge against China. But Trump’s tariffs are undermining this synergy. Second, Beijing has figured out that if it holds strong and doesn’t give into Trump’s tariff threats, it can actually turn the tables and win. Stand up to daddy diplomacy and eventually Trump will back down. This is precisely why many in Washington believe Trump is going about countering China the wrong way.\nHence, both India-US relations and US efforts to counter China with American allies can do with some quiet diplomacy. New Delhi’s best bet is to keep up back channels in Washington to bring the Trump White House around for mutual benefit. When egos get in the way, foreign policy and long-term national interests suffer.\n\n",
        "headline_1": "Quietly does it",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/quietly-does-it/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-08-2025"
    },
    {
        "full_article": "Vital that GST reform is designed in a way that spurs spending. Economy needs it\nIndia’s proposed GST overhaul can spur demand in the festive season that starts in about a month. It can also partly offset the impact of Trump’s “penal” tariffs that have been estimated to shave off up to 0.6 percentage point from GDP growth this year. That’s why it’s important to get this overhaul right. Eight years ago, GST replaced VAT with the promise of a good and simple system. But there’s nothing good about taxing cream-on-toasted-bun at 18%, when cream and toasted bun are taxed at 5% separately. Nor can three different rates for popcorn – 5% for open, 12% for packaged, and 18% for caramel – be considered simple. These are only the most glaring distortions under the prevalent system. A quick glance over the list of GST rates reveals the bigger problem of classification into luxuries and essentials.\nBy any measure, 28% is an enormous cut for govt to take. It might be justifiable for cigarettes and other “sin goods”, whose consumption govt wants to discourage, but why tax cement at this high rate? Worn-out tyres are among the leading causes of accidents, yet new tyres are taxed at 28%. Why is tooth powder taxed at 12% but toothpaste at 18%? Soap is taxed at 18% across the board, making it a luxury for manual labourers who possibly need it the most.\nThe underlying principle of taxation so far seems to be revenue maximisation. Metaphorically, it amounts to squeezing the goose without killing it. With the proposed GST overhaul, India could transition to an economy that keeps the goose happy, stimulating it to lay more golden eggs. For example, taxing small cars at 18%, as against 28% now, could revive a segment that used to be the main driver of the car market until 2019. That’s why scrapping the 12% and 28% GST rates, and shifting most of the goods and services under them to the 5% and 18% rates, is welcome. But after offering relief on income tax in this year’s budget, nudging interest rates downward, and now reducing GST, govt will run out of options to spur demand. The problem of stagnant incomes is the private sector’s to fix. And it can, sitting as it is on record profits.\n\n",
        "headline_1": "Get it right",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/get-it-right/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-08-2025"
    },
    {
        "full_article": "Scholars today wear many hats, old-timers grab many desks\nThe demands of scholarship are such that these may deter ordinary folk. For one, even while undertaking the most serious research in the library, the scholar must fulfil his or her social obligations. Most libraries allow scholars to bring their phones inside and use these with discretion. At times hectic texting by the scholar may give the impression that he is not serious about his work, but the grim expression on his face should dispel such a notion.\nThe day is long. In the throes of work, a scholar may wear many hats. If you lift your eyes and view the laptop screens in the neighbourhood, you may even see a shopping website or a movie playing. It is necessary for the scholar to rest his mind after grappling with a difficult academic challenge. Occasionally, a web page with a stock market trading account seems to pop up, but it is probably a mathematician working on an algorithm, or beta-testing a data exchange tool.\nToday’s libraries are well-equipped and comfortable. Unbearable summer and dreary winter days inspire intense scholarly engagement. On such days, finding a seat in coveted public libraries is extra difficult. Some scholars reserve desks by leaving laptops and books on them. It is a coincidence that the couple you saw strolling near the trees, or sipping coffee outside, returns to claim these desks.\nOne may try to move to the upper floor, but the few desks there are taken over by old-timers who arrive first and leave at the end of the day. \nSuch scholars go through the demanding post-lunch hours with practised ease. One may find someone drooping in front, their eyes closing. But then a finger that moves on the keyboard, and a head that nods just when you thought he was napping, are evidence enough that academic rigour was not abandoned on a soporific afternoon after a sumptuous lunch in the nearby canteen.\nThe scene outside is one that can lift a sagging spirit. It is like a lounge where people talk and exchange greetings, like a ship’s deck minus food and drinks. After a day of study, when the scholar stops here briefly, the eruption of greetings by other scholars makes him forget disappointments such as the congested academic space and limited funding. He says his goodbyes and returns home to a restful evening.\n\n",
        "headline_1": "Library notes",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/library-notes/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 19, 2025 00:00:00  \nBangladesh's poor global logistics ranking in the World Bank's Logistics Performance Index (LPI) speaks volume for the country's inability to utilise its trade potential and competitiveness. In today's stiffly growing competition in accessing markets abroad, integrated logistics serve as the basis for international trade, providing competitive edge and even global branding of products. It is exactly for this reason, the seaports in several countries have been transformed into multimodal transit points optimising their capacities. If container handling at the Chittagong Port takes five to six days instead of the global standard of one to two days, it is indeed pitiable. How business fails to connect with the global value chain becomes clear from this inefficiency. This is, however, just one aspect of the process, the port or ports concerned also fail to attract foreign vessels to call at such facilities. \nThe roundtable organised by the Financial Express brought together both government functionaries and astute businesspeople in order to collate their opinions and suggestions for riding the rough time ahead in international trade. To the meeting's credit, it has found pragmatic suggestions including greater participation in the process of logistical capacity building. One unanimous verdict that emerged from the deliberations is that there is no alternative to developing and integrating logistics in the form of a multimodal chain. It means that rail, road and the Chittagong Port will get connected through integration of an efficient transport network of both rail and road, sufficient warehouses including inland container depot preferably under public-private partnership and an upgraded distribution system. The bottom line is that the capacity development of not only the Chittagong Port would be enough but other ports ought to be put to optimal use with complementary innovative way of facilitating business. Another large-scale roundtable to be held on the same subject, as informed by the editor of the FE, may give further insight into the way forward.\nCurrently, though, the interim government is talking about the much-hyped reform to the Chittagong Port, the main task to be undertaken is to develop three bay terminals by the Chittagong Port Authority, PSA Singapore and DP World. Hopefully, the track records of the two foreign port operators and supply chain companies will be of tremendous help in expanding the port and the bay terminals' capacities, allowing those to have a competitive edge in real time export. Alongside the World Bank-financed Bay Terminal Breakwater Project, a 'port community system' interlocking the three seaports on the WB model is on the cards. \nUndeniably, to stay in competition there is no alternative to taking advantage of the cheapest export mode -- sea routes that is, particularly after the hawkish global business environment set off following the reciprocal tariffs imposed by Donald Trump on both his friends and foes. A small country like Bangladesh with a limited basket of export goods must develop and diverse its export basket in order to get over the adversities facing business. It has to seize the least opportunities in the shifting global channels emerging from the higher levies slapped on some countries. However, one note of caution: the agreement on handling operation by foreign port operators and supply chain companies should be limited to a reasonable period during which time, the local operators, automation and other related logistics support will match the world's best.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Multimodal logistics  integration at seaports",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/multimodal-logistics-integration-at-seaports-1755532209",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       August 19, 2025 00:00:00  \n\nThe crisis in Bangladesh's healthcare system is a known fact. It is being felt daily by millions of people who are forced to wait for hours in overcrowded public hospitals, struggle to afford exorbitant fees in private clinics or face the cruel choice between treatment and survival. The state of our hospitals today is not just a reflection of weak infrastructure and understaffed wards, but a broader indictment of failed policies and neglected priorities.\nGovernment hospitals, meant to be the backbone of public healthcare, are crippled by dilapidated infrastructure, insufficient medical staff, lack of modern equipment, and an overwhelming patient load. Many lack essential medicines, diagnostic facilities, or even proper sanitation. The result is predictable: citizens who can better-off avoid these institutions altogether. Ironically, this flight from the public sector includes not just the wealthy, but even sections of the middle and lower-middle classes, who increasingly see no alternative but to seek treatment in private hospitals.\nBut here lies the cruel paradox: in the private sector, healthcare has been transformed into a commodity. Profit motives, disregard for regulations, and an absence of ethical safeguards mean that patients are often treated less as human beings in need of healing and more as customers purchasing a product. Here, life-saving services are packaged like consumer goods-sold at high prices and marketed through advertisements, promotions, and flashy claims of \"world-class\" facilities.\nThis crisis is not simply a matter of hospitals, beds, or doctors. It is the direct result of the country's failed health policy. Bangladesh's Constitution guarantees access to healthcare as a basic right. Yet, in practice, this guarantee remains confined to paper, a hollow promise that fails millions who depend on it.\nThere are cases where due to their inability to pay the treatment bill, parents had to flee hospitals leaving their children in the ICU.\nQuestions have been raised if hospitals have no responsibility beyond demanding bills? Is there no space in our healthcare system for empathy? Should poor patients always be treated as liabilities unless they can pay? At what point does a system built to heal transform into a mechanism that alienates the very people it should serve?\nHealthcare in Bangladesh has now become stratified along lines of class, creating a cruel form of social segregation. The wealthy fly abroad for treatment or turn to expensive, large-scale private hospitals in Dhaka. The middle class-often the most vulnerable-take loans, sell property, or exhaust life savings just to afford operations or critical care. And the poor? They endure untreated illnesses, resort to unqualified practitioners, or, in the worst cases, abandon their loved ones in hospital corridors.\nThis is not merely an economic disparity; it is a form of social injustice. It is the erosion of the very idea that life has equal value, regardless of income or status. When the ability to access healthcare depends on how much money one has, society fractures into tiers of humanity-where the lives of the poor become expendable, and the wealthy are protected by privilege.\nUnderlying this crisis is the abysmally low budgetary allocation to healthcare. In the 2024-25 fiscal year, Bangladesh devoted only 5.4 percent of its national budget to the health sector. Experts widely agree this is far below what is required for a country of more than 170 million people. To make matters worse, even this inadequate allocation fails to translate into effective services because of widespread corruption, inefficiency, and resource mismanagement. Funds are siphoned off, equipment procurement is riddled with irregularities, and accountability remains elusive.\nAs a result, the gap between demand and supply grows wider every year. The private sector fills this vacuum, but without proper oversight, it is driven almost entirely by profit motives. Across the country, new hospitals and clinics emerge, not as centers of healing, but as businesses competing through \"packages,\" \"special deals,\" or glamorous advertising campaigns. The tragedy is that this commercialisation takes place in a sector that should, by its very nature, place life and dignity above all else.\nThe current situation cannot be allowed to persist. Healthcare must be reclaimed as a fundamental public good rather than a market-driven service. Several steps are urgently needed.\nFirst, private hospitals must be brought under a strict regulatory framework. Standardised rates for admission, ICU charges, diagnostic services, and essential treatments must be set and enforced. A mandatory quota for poor patients, ensuring access to free or heavily subsidized care, should be part of licensing requirements. Transparency in billing, along with strong monitoring mechanisms, is essential to prevent exploitation.\nSecond, public hospitals must be strengthened. This means not only increasing budgetary allocations but also ensuring those funds are properly spent. Investments in infrastructure, training, and technology are vital. Equally important is creating an environment that promotes professionalism, ethics, and accountability among healthcare workers. Doctors and nurses must be incentivised to stay in the public system rather than migrate to private practice or abroad.\nThird, healthcare must reach rural Bangladesh. The concentration of advanced facilities in urban areas leaves the majority of the population underserved. Strengthening community clinics, upgrading district hospitals, and ensuring consistent availability of medicines can create a more equitable distribution of services.\nFourth, civil society must be engaged. NGOs, charitable organizations, and corporate social responsibility (CSR) programs can play a vital role in bridging gaps. However, their contributions must complement, not replace, the responsibility of the state. A dedicated health fund for poor patients, managed transparently and independently, could provide immediate relief for those unable to afford critical treatment.\nOne of the most pressing questions we face is whether healthcare for the poor will remain dependent solely on sympathy and charity. While acts of compassion from individuals or institutions are valuable, they are not a substitute for systemic change. A humane society cannot allow the health of its most vulnerable citizens to depend on chance generosity or the goodwill of strangers.\nInstead, healthcare must be recognized and enforced as a fundamental right. Just as access to education or protection from violence is considered non-negotiable, access to medical treatment must be guaranteed for all, irrespective of income or social position. This requires political will, legal safeguards, and a social commitment to equity.\nIf Bangladesh is to move forward as a just and inclusive society, it must confront the inequalities that plague its healthcare system. The story of the mother forced to leave her child behind should serve not only as a moment of grief, but as a catalyst for reform. No one should ever be placed in such an impossible situation.\nThe future demands that we reimagine healthcare not as a bill to be paid, but as a shared responsibility and a moral obligation. In this vision, hospitals are not businesses but sanctuaries of healing. Doctors and nurses are not service providers chasing profits, but professionals guided by ethics and compassion. And the state, rather than shirking its duties, stands firmly as the guarantor of health for all.\nThis is not an impossible dream. Many countries with fewer resources than Bangladesh have made remarkable progress in creating inclusive healthcare systems through strong policies, effective regulation, and social mobilization. What is required is the courage to place human lives above financial interests, and the determination to turn constitutional promises into lived realities.\nBangladesh stands at a crossroads. It can continue down the path of commercialisation and inequality, where healthcare remains a privilege of the wealthy and a torment for the poor. Or it can take decisive steps to reclaim healthcare as a basic right, accessible to all without discrimination.\nThe choice should be clear. Healthcare cannot remain a luxury item or a cruel lottery of fate. It must be the most basic assurance of citizenship-one that affirms the equal worth of every life. For the millions who struggle to afford treatment, and for the dignity of an entire nation, the time to act is now.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Healthcare is a right,  not a commodity",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/healthcare-is-a-right-not-a-commodity-1755532269",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       August 19, 2025 00:00:00  \n\nThe self-inflicted tragedy that befell a family of four at the Bamunshikhar village in Paba Upazila of Rajshahi tells us about another level of poverty that is hardly discussed in the circles concerned. As reports go, the breadwinner of the family, Minarul Islam (35), saddled with crippling debts and unable to feed his family members, first strangled his wife and two children and then committed suicide by hanging himself from a ceiling fan. The dead bodies were recovered last Friday (August 15) by Rajshahi police from the victims' house. A suicide note Minarul left tells the story of his desperation in which he held none but himself for the tragedy.\nBut why did he kill his wife and two children-- in all probability against their will? As he confessed in the suicide note, he killed them so after his death they may not have to be at other's mercy for their sustenance. But it can hardly be any justification for killing one's near and dear ones. To all appearances, his sense of self-dignity was so high that he would rather die and force his close ones to do so than share what he was going through with others. Minarul's is not the sole instance of such desperations leading to suicides accompanied by murder of family members. Many incidents of such collective suicide are reported from time in the media, while others are not. But in most cases, it is poverty that often drives a poor mother to kill herself and her children or a man committing such suicide and murders as in the present case.\nThis is an issue for social psychologists and experts to explain why some otherwise normal people resort to such extreme means when in great difficulty like indebtedness or abject poverty. However, people often consider these as stray incidents and then let them fade into oblivion. No further thought is given to such incidents though their number won't be small if counted over a particular year. Such collective suicides linked to poverty usually happen during lean months of the year when jobs are scarce as it was in the case of Minarul. He was not from an indigent background as evidenced from the description of his household provided in the media reports. Neither the man's parents who lived in quarters adjacent to his were poor. But as it came out, even they could not be of any help to save their son, daughter-in-law and grandchildren. From the facts of this particular suicide as could be gleaned from reports on conversation of press people with the suicide victim's blood relations, he borrowed money at exorbitantly high interest rates from some loan sharks or even NGOs. And Minarul could not stand the relentless dunning by the moneylender(s) to repay the weekly instalments of the loan. So, the moneylenders, whoever they might be, cannot also absolve themselves of their wrongdoing in pushing the debt-ridden person to self-destruction. However, the fact remains that it is grinding poverty that drove an entire family to prefer death to penury and indignity. These are the kind of people who would suffer their economic hardships in silence, but would never try to draw others' sympathy by telling their story of sufferings. \nOne would occasionally come across reports of people from middle income brackets, but of late rendered poor due to loss of income, silently standing in queue in the hot summer sun for hours to get low-priced essential commodities delivered from TCB trucks. They never complain nor jostle and shove in the crowd to get closer to the delivery vans, but would rather leave the place silently in case the supplies prove to be limited. One would hear of such people doing low-paid odd jobs during Covid time. And many of them also choose the path of Minarul in the end. \nSocial and poverty researchers need also to study the phenomenon of people taking their own lives out of penury and find ways to address it.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Looking into poverty-linked suicides",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/looking-into-poverty-linked-suicides-1755532314",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 19, 2025 00:00:00  \n\nAn ambulance, which is meant to save lives, was shockingly blocked in Shariatpur costing a newborn its life. How can people be so cruel and inhuman in the name of petty personal interests?\nReports say that a Dhaka-bound ambulance carrying the sick child was stopped by a local gang, who demanded that only local ambulances be used to transport patients. Not only was the vehicle blocked, but the driver was beaten and his keys snatched in broad daylight. After an hour-long scuffle, the child tragically died. Can this be called anything other than cold-blooded murder?\nThe child's father has filed a case against five individuals, and police have already arrested the main accused. We expect the rest to be apprehended swiftly and brought to justice. Given that the father of the arrested accused is a driver for the Shariatpur Civil Surgeon, one can only hope that no undue influence or misuse of power will obstruct the trial.\nSadly, this is not an isolated incident. Ambulance \"mafias\" have long been operating in Dhaka, Chattogram, and other districts. They violently prevent patients from using outside ambulances and impose exorbitant charges. Sometimes hospital staffers are complicit in the racket. Hospitals are supposed to be the last refuge for patients, yet these gangs exploit people at their most vulnerable moments. Shockingly, neither hospital authorities nor law enforcement agencies seem to be taking any meaningful or lasting action.\nThis situation demands urgent intervention frpm the highest level. If hospitals and law enforcement continue to turn a blind eye, such tragedies will keep repeating. Ambulances are to save lives, not serve as a business monopoly at the expense of innocent patients' lives.\nAshikujaman Syed\nBusiness Development Manager\nTianjin Pharmacn Medical Technology Co., Ltd.\nTianjin, China. syedashikujaman@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ambulance blocked, newborn dies",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ambulance-blocked-newborn-dies-1755532346",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-08-2025"
    }
]