[
    {
        "full_article": "India’s goods trade in February saw its steepest decline in nearly two years. Exports fell by 10.9% to $36.91 billion, while imports dropped 16.3% to $50.96 billion, resulting in the smallest trade deficit in over three years (42 months) at $14 billion. While a shrinking trade deficit driven by rising exports would have been a positive development, the simultaneous decline in exports and imports is a cause for concern. Experts partly attribute this narrowing deficit to a high base effect, as exports in February last year, a leap year, stood at $41.4 billion and imports at $60.92 billion. However, exporters also report a trend of American importers holding back on orders, fearing the reciprocal tariffs set to take effect on April 2, as announced by U.S. President Donald Trump on February 13. This announcement came just before his meeting with Prime Minister Narendra Modi, where they unveiled an ambitious plan to boost bilateral trade to $500 billion by 2030 and finalise a free trade agreement (BTA) in the months ahead. Despite Commerce Minister Piyush Goyal’s diplomatic outreach to U.S. Commerce Secretary Howard Lutnick this month, discussions yielded little beyond a commitment to continue BTA negotiations. The looming threat of reciprocal tariffs has unsettled Indian exporters, as the U.S. is India’s second-largest trading partner, accounting for $118.3 billion in trade last fiscal year. It is also the only country among India’s top five trading partners with which India enjoys a trade surplus.Imports also declined sharply, led by a 62% plunge in gold imports compared to last February. This drop is linked to domestic gold prices surging to ₹87,886 per 10 grams last week, dampening consumer demand. Oil imports also fell nearly 30% as India diversified its supply sources in response to additional U.S. sanctions on Russian oil producers and tankers in early January. By mid-2023, Russia accounted for over 40% of India’s crude imports, a significant increase from less than 1% before western sanctions on Moscow following its 2022 invasion of Ukraine. If Washington moves to neutralise its trade deficit with New Delhi, India could face a 15% widening in its overall trade deficit, based on last fiscal year’s $241 billion shortfall. India must diversify its goods and services trade to reduce its heavy reliance on the U.S. Two potential markets are China and the U.K. While imports from China have contributed to about a third of India’s trade deficit for over five years, India’s trade imbalance with the U.K. accounted for less than 3% of its total deficit last fiscal year. The free trade agreement negotiations with the U.K. are an opportunity for India to shift this balance in its favour. Published - March 19, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        imports\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        gold and precious material\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        United Kingdom",
        "headline_1": "​High base effect: On a shrinking trade deficit, rising exports",
        "headline_2": "A shrinking trade deficit, as seen in February, is no cause for cheer",
        "link": "https://www.thehindu.com/opinion/editorial/high-base-effect-on-a-shrinking-trade-deficit-rising-exports/article69344681.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-03-2025"
    },
    {
        "full_article": "In the first acknowledged discussion on the Pannun episode and anti-India activities by pro-Khalistani groups in the U.S. since the Donald Trump administration took office, Defence Minister Rajnath Singh raised the issue in a meeting with U.S. Director of National Intelligence Tulsi Gabbard. He urged the U.S. to designate Sikhs For Justice (SFJ), led by Gurpatwant Singh Pannun, as a foreign terrorist organisation, citing its anti-India activities on American soil and its alleged backing by Pakistan’s Inter-Services Intelligence (ISI). Ms. Gabbard was in India to also attend the annual Intelligence and Security Chiefs Conference, chaired by National Security Adviser Ajit Doval. The conference, now in its fourth edition, took place a day before the annual Raisina Dialogue, the flagship conference of the Ministry of External Affairs (MEA), co-organised with the Observer Research Foundation.Founded in 2007 by Pannun, a U.S.-based attorney, the SFJ advocates “self-determination” for Sikhs in their “historic homeland” of Punjab, seeking to establish a sovereign state of Khalistan. The Indian government banned the organisation in 2019 under the Unlawful Activities (Prevention) Act for anti-India activities. The Khalistani insurgency remains a dark chapter in India’s history, having led to the assassination of a Prime Minister. Its resurgence in several western countries has been a growing concern for India. Pro-Khalistani protests, often turning aggressive, have become a pattern. Most recently, External Affairs Minister S. Jaishankar was heckled, with pro-Khalistan slogans being raised, during his visit to London earlier this month, prompting the MEA to lodge a strong protest with the U.K. Diplomatic efforts to address the issue, particularly with Canada and the U.K., have often been met with a lacklustre response, frustrating India. However, recent allegations that Indian agencies attempted targeted killings of Khalistani sympathisers have strained bilateral ties with Canada and the U.S. Relations with the then Trudeau administration in Canada were tense, while under the Biden administration, India faced significant diplomatic pressure after a U.S. investigation charged an Indian citizen — allegedly linked to the Research and Analysis Wing (RAW) — with orchestrating a plot to kill Pannun. The issue became so serious that Mr. Doval refrained from accompanying Prime Minister Narendra Modi on an official visit. The Trump administration, so far, appears less inclined to escalate the matter and may be more receptive to India’s concerns. While India continues to push for action against anti-India and separatist groups, it must however ensure that its efforts do not impact the by and large cohesive Indian diaspora abroad, nor affect India’s diplomatic relationships with partners.\r Published - March 19, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        espionage and intelligence\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        Canada\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        population",
        "headline_1": "​Changed circumstances: On the U.S., India and extremism concerns",
        "headline_2": "The U.S. now seems more receptive to India’s concerns about Sikh extremism",
        "link": "https://www.thehindu.com/opinion/editorial/changed-circumstances-on-the-us-india-and-extremism-concerns/article69345429.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-03-2025"
    },
    {
        "full_article": "Our political system ought not to become only a game of numbers\nWinston Churchill, who was far from being a PRO for liberalism, remarked that democracy was the worst form of govt, except for all the others that had been tried. \nThe face of democracy, the handmaid of freedom, is not unblemished by warts. And one of these warts, that of delimitation, is currently the centre of fierce controversy. \nDelimitation is an exercise that allocates the number of seats in parliament for the different states based on their population: states with larger populations get more seats and greater parliamentary representation, and a disproportionately greater say in determining national policies and priorities. \nCritics of this system, which include the southern states plus West Bengal and Odisha, contend that this not only goes against the Constitutional premise of federalism, but also rewards those states that have been unable to check unbridled population growth while punishing states which, through progressive family welfare measures, have successfully stemmed the human tide of overpopulation that is fast turning India’s vaunted demographic dividend from a boon to a blight. \nThere are not enough jobs or other means of livelihood to cater to the burgeoning unemployment which is slamming the brakes on the country’s much tom-tommed economic growth. \nThe so-called ‘bimaru’, or less developed states, such as Bihar, Madhya Pradesh and UP, would reap the benefits of delimitation by gaining more parliamentary clout, while the more progressive states, with lower populations and better economic and social indices will, in effect, be penalised. \nThe crux of the controversy revolves around the fundamental interpretation of democracy, the rule of the people, by the people, and for the people. However, in a polity as vast, and as vastly diverse, as India the term ‘people’ does not and cannot define an undifferentiated, majoritarian mass. \nDistinctions of economic status, social customs, religious beliefs, and language differ widely. Like the pieces of a jigsaw puzzle, these differences have to be put together to form a cohesive and comprehensive picture. \nIn such an exercise, delimitation is revealed to be in fact a limitation of democracy. \n\n",
        "headline_1": "Limiting democracy",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/limiting-democracy/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-03-2025"
    },
    {
        "full_article": "Signatures to writing, humans are doing less and less of it by hand. Is resistance possible? Yes\nTurns out that when Trump suggested that the pardons Biden signed with an autopen were autonull, he was just ‘begging the question’. Trump himself uses this mechanical device for reproducing his signature, but ‘only for very unimportant papers’. More to the point, electronic signatures have become super commonplace. We have all come to rely on their convenient legality. Yep, two decades ago when Donald Rumsfeld was outed for signing condolence letters for soldiers killed in Iraq and Afghanistan mechanically, there was outrage. Today, CEOs to netas to taxpayers worldwide would say, duh, makes sense, me too.\nNostalgia-minded folks see signature standards falling everywhere. The studied flamboyance of the John Hancock adorning the 1776 Declaration of Independence, has become rare. Indians may know Manmohan Singh’s signature from the currency notes he signed as RBI governor, or MF Husain’s from his art. Mostly though, we are just trying to make sure our own survives ageing. Even autographs have had their shine stolen by selfies. There is also the fact that film stars to sport champs, many signatures are so unimpressive. It’s hard to sign strongly when you write weakly. Many an Indian grad upon landing in US still finds herself feted, just because the cursive her primary school teacher taught her is a lost art over there. But here too it might go the way of handwritten letters and diaries and greeting cards – lessening and lessening under the digital blitz until it’s no more. \nThose who are concerned about this extinction of experience underline that how we write is deeply tied to what we write. And they aren’t an insignificant number. There’s even an uptick in calligraphy, people being drawn to the beautifully measured putting of pen to paper. Such folk may yet pass on the craft of writing and signing by hand to another generation.\n\n",
        "headline_1": "Signing out",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/signing-out/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-03-2025"
    },
    {
        "full_article": "SC bench says right things. But too many courts exercise their power arbitrarily \nThree pillars of democracy – legislature, executive and judiciary – have codified powers, and police to enforce them. The fourth – media – draws strength entirely from free speech. On Monday, a Supreme Court bench of justices Abhay S Oka and Ujjal Bhuyan hammered home the importance of media freedom during a hearing. It reminded courts, especially, of the need to be tolerant of free speech, and not cry contempt on the slightest pretext. “Why should courts be touchy about some comments made against their orders…,” the bench asked. \nIn Jan this year, 1.45L contempt cases were pending in SC and high courts. Some of them would be against media organisations and independent journalists. And a subset of those could well be arbitrary, unfair or excessive. The 2019 Meghalaya HC order against two women journalists, holding them guilty of contempt for reporting on the perks provided to retired judges and their families, had drawn global attention. Later, SC had stayed the order. \nMonday’s SC hearing was about a Delhi HC order against Wikipedia that deemed criticism to be “interference in court proceedings”. But as the SC bench pointed out, judges have to take criticism in their stride – “Sometimes, someone says that you are sitting here with a preconceived mind or that you are not giving a proper hearing. People say things, and we have to tolerate it…Someone says we are prejudiced. That’s their opinion, but we decide on law.” \nDuring the hearing, the bench once again emphasised the dangers of sweeping gag orders. “Courts can’t pass gag orders…to tell someone to remove something just because there is some criticism of what the court has said or done is not okay,” it said. In 2022, SC refused to bar journalist Mohammed Zubair from posting on X while on bail, saying, “Gag orders have a chilling effect on the freedom of speech.” By now, this should be a well-settled point. Sadly for free speech in India, it isn’t.\nSC has questioned the “legality and validity” of Delhi HC’s directions against Wikipedia. By pursuing this enquiry further, it could build safeguards against the arbitrary exercise of contempt powers. Perhaps, it’s time for a larger Constitution bench to look into this question and answer it once and for all. As the SC bench said on Monday, “The question here is about free speech rights of media.” By extension, it’s about strengthening the fourth pillar of Indian democracy. \n\n",
        "headline_1": "Don’t gag free speech",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/dont-gag-free-speech/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-03-2025"
    },
    {
        "full_article": "Why Modi’s approach to Trump, seen again in a podcast, is diplomatically astute  \nModi’s three-hour podcast with MIT scientist Lex Fridman ranged over many themes, and had some strong pointers on diplomacy. While diplomacy has always been about achieving your ends tactfully, without resorting to conflict, recent times have been marked by a reluctance to talk – and even when two sides sit across the table, coarseness of dialogue. Russia’s invasion of Ukraine, China’s manoeuvres on India’s border, Canada baiting India, the Trump-Zelenskyy White House fiasco, Vance hectoring Europe, all fit this mould. And they fail because they push the idea of “mine before thine”, taking without giving, like children.\nModi made it clear in the podcast that he also approaches diplomacy with India’s interests foremost, but where he differed is in appreciating the other side’s view. That’s what grown-ups do. When Trump raised tariffs, Canada, Mexico and China retaliated. Europe has taken the same path. And for all practical purposes, we are in the early days of a trade war. But India has resisted the temptation to draw its gun. It has reasoned and negotiated. Modi’s remark that Trump and he connect because they put their nations first may seem ho-hum, obvious. It may even seem paradoxical in the current global atmosphere. But it isn’t. Solutions to tricky world challenges, be it Ukraine or Gaza or Trump’s tariffs, can only be found when you see where the other side’s coming from. What is the least they will accept to retreat, what is the most you can gain by losing some? A win-win, not a zero-sum game.\nThe take-no-prisoners approach to diplomacy fails because it starts by drawing a hard mine/thine line. Indian philosophy lays down a wiser path – approach a mutual problem without the distinction of mine and thine. The practice of samta yog – looking for essential commonalities, not apparent differences, seeing everything as a part of a larger whole – opens the mind to the bigger picture. The intent is no longer to start an argument but to find a solution. This understanding is not a sign of “softness”. As Modi stressed on his Washington trip last month: “I appreciate that he (Trump) always keeps the national interest supreme. Like President Trump, it is a great fortune for me to keep the interests of India supreme and work.” He’s made the same point again, without riling Trump. In fact, Trump seems to appreciate Modi’s view, and shared the podcast on his Truth Social handle. It’s a positive start for negotiations on the many thorny issues between India and US.\n\n",
        "headline_1": "Samta Yog: Modi’s Love Offensive",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/find-the-connect/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-03-2025"
    },
    {
        "full_article": "We are disappointed by US intelligence chief Tulsi Gabbard's remarks regarding the alleged persecution, killing, and abuse of minorities in Bangladesh. In an interview with India's NDTV, Gabbard suggested that this issue has been longstanding and that the \"threat of Islamic terrorists\" in the country is \"rooted\" in the \"ideology and objective\" to \"rule and govern with an Islamist caliphate.\" When did all this happen, if at all? Under Sheikh Hasina, Bangladesh was seen as India's best friend. Were we trying to establish an \"Islamist caliphate\" at that time? At a time when the interim government has been actively engaging with the new US administration, such a statement—unsupported by facts or substance—is deeply regrettable.\nAfter years of authoritarian rule, Bangladesh has reembarked on the path to restoring democracy. It is true that, following the fall of the Awami League regime, some attacks against minorities did occur. However, most of these incidents took place when the country lacked a functioning law enforcement system in the immediate aftermath of the August 5 changeover. Moreover, many of the attacks were politically motivated rather than communally driven. Regardless, the interim government has categorically condemned all such incidents and initiated appropriate legal actions. It has even invited journalists from around the world to visit and witness the situation firsthand. Despite these efforts, segments of the Indian media and political class have repeatedly misrepresented Bangladesh—often with completely fabricated reports.\n\nIt is true that, following the fall of the Awami League regime, some attacks against minorities did occur. However, most of these incidents took place when the country lacked a functioning law enforcement system in the immediate aftermath of the August 5 changeover. Moreover, many of the attacks were politically motivated rather than communally driven. Regardless, the interim government has categorically condemned all such incidents and initiated appropriate legal actions. It has even invited journalists from around the world to visit and witness the situation firsthand.\nWe urge Tulsi Gabbard and other US government officials to independently examine all available evidence before making sweeping statements that unjustly link an entire country to global terrorism. Bangladesh has never been part of any global extremist movement. In fact, the only major instance of terrorism on its soil—the 2016 Holey Artisan attack—had Bangladesh as a victim rather than a perpetrator. Bangladesh has consistently been an ally in global counterterrorism efforts, including those led by the US, and remains committed to this cause. Given this reality, we hope that responsible officials, particularly in the US, will take care not to reinforce harmful stereotypes that misrepresent Bangladesh.\nThe people of Bangladesh have unequivocally expressed their desire for democracy by overthrowing the former authoritarian regime through great sacrifice. To ignore this and broadly suggest that Bangladeshis wish to establish an Islamist caliphate undermines their struggle and sacrifices. If anything, Bangladesh has been one of the least communalistic countries in the region, particularly compared to its neighbours. Our chief adviser, a Nobel laureate, has clearly stated that Bangladeshis of all backgrounds belong to the same \"family.\"\nBangladesh seeks to build a stronger relationship with the US, one that requires deep mutual understanding. To achieve this, we urge the US administration to rely on firsthand information gathered through its local embassy rather than external sources. The US is also welcome to send its own journalists or fact-finding missions to assess the ground reality and engage directly with the Bangladeshi people.\n",
        "headline_1": "Tulsi Gabbard should've checked her facts before making sweeping comments",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/tulsi-gabbard-shouldve-checked-her-facts-making-sweeping-comments-3851431",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-03-2025"
    },
    {
        "full_article": "During my classes on \"news gathering and writing for print media\" with first-year university students, I occasionally ask them who Abul Mansur Ahmad was. Only a few of them reply: a prominent politician and the writer of Amar Dekha Rajnitir Ponchash Bochor—a political history-based autobiography. However, it is likely that they only learned about this book and its writer from university admission test guides. As a teacher of mass communication and journalism, it is fairly frustrating for me. A more disturbing phenomenon is that students don't have any idea about the early life of Abul Mansur Ahmad. This multi-talented person was a student of Jagannath College, now Jagannath University, the place I work at.\nAbul Mansur Ahmad is well known for his glorious political and writing career. However, my observation is that his contribution to modern journalism is always overshadowed by his other identities. Nevertheless, he was a lighthouse of professional modern journalism in Bangla newspapers.\nThis visionary started his journalistic career in Dhaka after the First World War. His early write-ups were published in the monthly Shaogat. Then he joined as a full-time sub-editor in the weekly Soltan. Before joining as an editor at Krishak, he worked with another famous journalist and politician, Maulana Akram Khan, on the weekly The Mohammadi. At that time, Krishak was a progressive and people's interest-oriented newspaper promoting communal harmony. Sher-e-Bangla AK Fazlul Huq, an influential politician in the history of Bangladesh, funded this newspaper. However, Abul Mansur Ahmad resigned from this newspaper due to an ethical clash.\nThe versatile genius later founded Ittehad in 1947, another landmark in Bangla journalism. This newspaper, where he served as the editor, started its journey with the support of another Bangalee politician, Huseyn Shaheed Suhrawardy. Abul Mansur Ahmad exercised complete freedom in the newspaper. That is why he was successful in making it the first modern newspaper in Kolkata. He introduced many European and American standards of journalistic practices in newspaper operations, and the breakfast meeting is one of them.\nJournalist Simon John Dring, a friend of Bangladesh during the Liberation War, trained many journalists in our country. I had the unique opportunity to work with him at Jamuna Television in 2013. At that time, he was working with an upcoming 24-hour news-based TV channel as an adviser.\nSimon introduced breakfast meetings in the daily operations, which was very effective for running the newsroom. However, later I found out that Abul Mansur Ahmad had introduced this kind of meeting long ago in the Ittehad newsroom, which was a landmark decision in the history of journalism in this region. He also introduced dedicated pages for sports, literature, cinema, and the city, which was also a groundbreaking step at that time. Additionally, he ensured a proper working environment for the composers at the newspaper. He also increased the journalists' salaries to a considerable level at that time.\nAfter the partition in 1947, he tried to shift Ittehad's operation from Kolkata to Dhaka. However, the government of Khawaja Nazimuddin denied his appeal several times. Not only that, at one stage, the Muslim League also banned the newspaper from coming to Dhaka by air. After a few years of fighting in Kolkata and Dhaka, the most modern and anti-communal publication of that time stopped its operation.\nAbul Mansur Ahmad's journalistic career also ended with the closure of Ittehad. There is no doubt that it was a great loss for journalism in the Indian sub-continent. He is one of the pioneers in the history of journalism of the Bangalee Muslim community in the twentieth century.\nThe information in this article was taken from books: Abul Mansur Ahmad Smarokgrontho, Atmakatha, and Abul Mansur Ahmad er Jibondarshan o Sreejonbhuban.\n\nRahat Minhaz is assistant professor of mass communication and journalism at Jagannath University. He can be reached at [email protected].\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "A pioneer of modern journalism in South Asia",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/pioneer-modern-journalism-south-asia-3851411",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-03-2025"
    },
    {
        "full_article": "In January 2025, the Trump administration froze all USAID foreign aid, causing widespread disruptions to global humanitarian efforts. The decision led to the agency's website being taken offline, workforce reductions, and plans to dismantle USAID under Elon Musk's leadership of the Department of Government Efficiency (DOGE).\nBy February, US Secretary of State Marco Rubio sought to merge USAID's functions into the State Department, while oversight of $8.2 billion in aid became non-operational. A federal judge ordered the freeze to be lifted on February 14, but administration officials refused to comply, leading to legal battles and heightened uncertainty about the future of US foreign assistance. By this time, a list of projects had already announced the termination of their contracts, including a $29 million project from Bangladesh.\nIt has been a month since the Trump administration's stop-work order. A BBC Bangla report highlighted how the funding cuts are impacting NGO workers in Bangladesh. The report referenced the NGO Affairs Bureau, which stated that 274 NGOs in the country receive funding from various international sources, with 87 of them directly funded by USAID. Through these organisations, around 240 NGOs operated projects in Bangladesh. As a result, USAID funding for a total of 327 NGOs has been affected.\nAccording to the NGO Affairs Bureau, more than 10,000 employees were directly employed in USAID-funded projects, all of whom have now become unemployed. Most of these employees were working on a contractual basis, meaning they did not receive severance or financial compensation. Consequently, they are facing immense uncertainty, struggling to support their families after suddenly losing their jobs.\nMeanwhile, essential services such as healthcare, education, agriculture, food security, democracy, governance, environmental protection, energy, and humanitarian assistance have been severely affected, putting millions of underprivileged people at significant risk. An official from an NGO, speaking on condition of anonymity, said, \"I left a permanent job just three months ago to join this organisation in a slightly senior position. My employment here had not yet been made permanent. In this situation, I have now been informed that my job no longer exists. I feel like I have been thrown into the deep sea with my family.\"\nThe abrupt suspension of US foreign aid has sent shockwaves through the global humanitarian sector, leaving millions of crisis-affected people without essential services. A survey conducted by the International Council of Voluntary Agencies (ICVA), a global NGO network promoting principled and effective humanitarian action, found that the funding freeze has resulted in large-scale disruptions to health, nutrition, education, and protection services, exacerbating already dire conditions in vulnerable communities. With 246 NGOs responding to the survey, the findings paint a grim picture: 67 percent of organisations reported receiving Stop Work Orders (SWOs), leading to immediate programme shutdowns, staff layoffs, and increased risks for already at-risk populations.\nThe immediate impact: Lives at risk\n\nThe impact of the funding suspension has been catastrophic. The hardest-hit regions include Africa, Asia, the Middle East, and Latin America, where thousands of humanitarian projects have been abruptly terminated. The survey found that many NGOs relied on US funding—primarily through USAID's Bureau for Humanitarian Assistance (BHA) and the Bureau of Population, Refugees, and Migration (PRM)—to sustain their operations. The funding freeze has led to a \"sudden stop in lifesaving support\" for over three million internally displaced people in one unnamed Asian nation alone. Medical services have been severely impacted. In Africa, HIV-positive children are dropping out of treatment programmes due to medication shortages. In Asia, cholera and malaria prevention efforts have been halted, increasing the likelihood of outbreaks. In the Americas, the suspension has forced the closure of sanitation facilities providing clean water and hygiene services to thousands of Venezuelan refugees, heightening public health risks.\nA staff member of a community-based organisation in Africa shared their concern in the survey: \"We have orphans for whom we pay school fees and provide scholastic materials. We are confused about how they will return to school under these circumstances. Directors are planning to solicit funds from personal savings where possible to ensure these innocent children do not miss school.\"\nThe effects of the funding freeze extend beyond service disruptions. ICVA's findings indicate that the suspension has eroded trust between NGOs, governments, and local communities. Many NGOs now face liquidity crises as the US government owes millions in unpaid reimbursements. Without these funds, organisations have been forced to downsize, scale back operations, or shut down entirely. Around 55 percent of NGOs reported a negative impact on their workforce, with widespread staff terminations and unpaid leave. The loss of trained humanitarian personnel threatens to dismantle years of progress in capacity-building and crisis response, further jeopardising the ability of NGOs to address emerging crises.\nWomen and children: The most affected\n\nThe suspension has disproportionately affected women and children, who are already the most vulnerable in crisis situations. The report highlights increased risks of gender-based violence, child labour, and early marriage as families struggle to cope with the loss of assistance. One NGO in Latin America reported that the cessation of advocacy programmes has made it harder for survivors of domestic and sexual violence to seek justice, increasing impunity for perpetrators. In Africa, orphans and children affected by HIV/AIDS have lost access to education and nutrition programmes, putting them at even greater risk of exploitation.\nA global ripple effect\n\nThe funding halt has triggered a ripple effect across the broader humanitarian sector. UN agencies and international NGOs (INGOs) that rely on US funding to support local partners have had to pass on the cuts. More than 80 percent of NGOs receiving US funding depend on intermediaries like INGOs or the UN to channel resources. With these organisations also facing funding constraints, the entire humanitarian infrastructure is now at risk of collapse. A director of a national NGO in Latin America reported in the ICVA survey: \"We are experiencing the loss of highly qualified professionals for community-based disaster risk reduction, and the loss of professionals in key and strategic positions in the institution who have partial funding in their salaries.\"\nA call for action\nIf the funding suspension remains in place, humanitarian needs will continue to rise due to ongoing conflicts, climate change, and economic instability. The ICVA report underscores that the longer the suspension continues, the harder it will be to rebuild the humanitarian infrastructure that has taken decades to develop.\nUrgent action is needed to restore funding, ensure timely reimbursements, and protect the most vulnerable from the devastating consequences of these decisions. The crisis triggered by the US funding suspension is not just about money—it is about human lives. The international community must step up to prevent further suffering and ensure that humanitarian aid remains apolitical, neutral, and accessible to those who need it most.\nFurthermore, a long-term strategy is needed to help local NGOs survive without excessive dependence on foreign aid. In Bangladesh, where the NGO sector has played a critical role in improving human development indicators, the government must also take responsibility for supporting this sector in its time of crisis.\nMohammed Norul Alam Raju is a researcher and development activist, currently residing in Belgium, pursuing higher studies in Development Policy and Management. He can be reached at: [email protected].\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "One month into USAID funding freeze: How the NGO world is coping",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/one-month-usaid-funding-freeze-how-the-ngo-world-coping-3851376",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "New tools to stabilise food price, create jobs",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/new-tools-to-stabilise-food-price-create-jobs-1742310332",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "LDC graduation in 2026",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ldc-graduation-in-2026-1742310405",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Illegal parking: Cancer of the city",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/illegal-parking-cancer-of-the-city-1742310430",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Cryptocurrency and traditional banking",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/cryptocurrency-and-traditional-banking-1742310452",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-03-2025"
    }
]