[
    {
        "full_article": "Once again, the manner of appointment of the Chief Election Commissioner (CEC) and Election Commissioners (EC) has become controversial, with the government going ahead with the process laid down in its December 2023 law, which is under challenge before the Supreme Court. Last week, the Court had deferred the hearing to February 19, while observing that if there was any development in the interregnum, it would meet the consequences of a subsequent decision on the validity of the Act. Ignoring a request from the Leader of the Opposition (LoP), Rahul Gandhi, the panel elevatedGyanesh Kumar as the CEC and inducted Vivek Joshi as the third member, following the retirement of CEC Rajiv Kumar. The question is whether the Act of 2023 goes against a 2022 Constitution Bench verdict that put in place a committee comprising the Prime Minister, the LoP and the Chief Justice of India (CJI) to select the persons to helm the Election Commission of India (ECI). The Act, however, includes a Union Minister in the committee instead of the CJI. The government argues that the Court’s panel was only an ad hoc measure until Parliament came forward with its own law, as required in the Constitution. The petitioners maintain that the thrust of the 2022 judgment is that the appointment process should be insulated from executive interference so that its functioning will be truly independent.Whether the CJI should be part of the selection committee is debatable, but there is little doubt that the 2:1 majority vested in the executive renders any selection vulnerable to the criticism that those chosen in that manner would not be seen as independent. The BJP-led government has been making appointments in the midst of court hearings. The Court has been declining to interfere in time, leading to such appointments becoming a fait accompli. The government had appointed Arun Goel as an EC in 2022, in the middle of the Constitution Bench hearing, and two ECs in March 2024 in the run-up to the general election to replace Mr. Goel, who had resigned, and another EC who had retired. Few will disagree that the public perception of the ECI as a fearless and fiercely independent institution has been on the decline. If elections are to be seen as free and fair by the whole electorate and not merely followers of the winners, the Court should not delay this matter any further. It has to adjudicate the question of whether the procedure set out in the law falls short of the level of independence envisaged in the Constitution Bench verdict for members of the ECI. Published - February 19, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        executive (government)\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        election",
        "headline_1": "Time and timing: On the CEC selection process",
        "headline_2": "The validity of the CEC selection process needs early adjudication",
        "link": "https://www.thehindu.com/opinion/editorial/time-and-timing-on-the-cec-selection-process/article69234760.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-02-2025"
    },
    {
        "full_article": "By withholding Tamil Nadu’s central share of Samagra Shiksha funds for rejecting the National Education Policy (NEP 2020), the Union Government is flexing its muscles to coerce States into submission. This move also undermines the intent of the Samagra Shiksha scheme (2018-19), which consolidated the Sarva Shiksha Abhiyan, Rashtriya Madhyamik Shiksha Abhiyan, and Teacher Education programmes. The scheme was designed to ensure equitable access to quality education for all schoolchildren. Since last year, Tamil Nadu has repeatedly flagged the non-disbursal of ₹2,152 crore, warning that the funding shortfall has severely strained its school education infrastructure, affecting nearly 40 lakh students and 32,000 staff members. Union Education Minister Dharmendra Pradhan has explicitly blamed the State for the impasse, declaring that the funds will be released only if Tamil Nadu implements the NEP in “letter and spirit”. Adding fuel to the fire, he has insisted that the State adopt the three-language formula, mandating Tamil, English, and a regional language in schools. This stance disregards Tamil Nadu’s long-standing opposition to the trilingual system, dating back to 1937, and its firm commitment to a two-language policy of Tamil and English since 1968. Going a step further, Mr. Pradhan has accused Tamil Nadu’s leadership of being divisive and politically motivated. He even suggested that the State needs to “come to terms with the Indian Constitution” and adhere to the “rule of law”, implying, quite unwarrantedly, that the State was not being run in line with the statute.Unsurprisingly, the response in Tamil Nadu has been swift and sharp, especially on the language issue, which remains non-negotiable for most political parties in the State. Chief Minister M.K. Stalin has rightly questioned which constitutional provision mandates the three-language policy and warned that such blatant coercion will not be tolerated. While the NEP claims it does not “impose Hindi”, successive Union Governments have, until now, respected Tamil Nadu’s autonomy over its language policy. Policies governing subjects in the Concurrent List of the Constitution require flexibility and dialogue to ensure successful implementation across diverse regions. A rigid, one-size-fits-all approach risks undermining cooperative federalism and fostering resentment among States, which are equal stakeholders in central schemes. A more pragmatic approach would be to delink Samagra Shiksha and the Pradhan Mantri Schools for Rising India (PM SHRI) scheme from the NEP and instead tie funding to generic performance indicators. At the same time, Tamil Nadu would do well to finalise and roll out its long-pending State Education Policy as a viable alternative to the NEP, ensuring academic continuity and stability for its students. Published - February 19, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        finance (general)\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        teaching and learning\n                    \n                            /                      \n                        \n                        school\n                    \n                            /                      \n                        \n                        children\n                    \n                            /                      \n                        \n                        language\n                    \n                            /                      \n                        \n                        Hindi\n                    \n                            /                      \n                        \n                        English\n                    \n                            /                      \n                        \n                        constitution",
        "headline_1": "​Undermining federalism: On central funding, States and education",
        "headline_2": "Central funding for States in education should be delinked from the NEP",
        "link": "https://www.thehindu.com/opinion/editorial/undermining-federalism-on-central-funding-states-and-education/article69234439.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-02-2025"
    },
    {
        "full_article": "What Odisha tragedy says to foreign students here\nNepalese student Prakriti Lamsal’s death by suicide at Kalinga Institute of Industrial Technology in Bhubaneswar is tragic; and a wake-up call for GOI, which wants India to become an education hub for developing countries. KIIT seemingly disregarded Prakriti’s complaints of harassment against an Indian student. Later, without investigation, it labelled her suicide a result of heartbreak. When hundreds of other Nepalese students protested, they were bundled out to Cuttack railway station and told to stay away. In one viral video, two KIIT staff are heard shouting at them that the institute’s expenditure on tuition and board exceeds Nepal’s budget. Such arrogance! By this logic, Indians in US should shop at Walmart with a sense of gratitude because the retail giant’s revenue exceeds GOI’s budget.\nThe case snowballed into a diplomatic issue. Nepal’s PM Oli raised it, Indian embassy in Nepal gave an assurance, Odisha govt pulled levers, the institute apologised, urging evicted students to return. It also “removed from service” the two loudmouth officers. In 2013, many had scoffed when a global survey claimed India was among the most racist countries. But ask students from Africa who have suffered racial abuse here. The Jan night in 2014 when a Delhi minister led a ‘raid’ against Nigerians is a stain that won’t wash. Our record on people from our own Northeast isn’t great either. Surveys showed how they were stigmatised as ‘Chinese’ during the pandemic. Now, this case has blown up in Nepal, biggest source of foreign students to India – 13,126 of 46,878 in 2021-22. Oli anyway has been showing off his China tilt. India wants 500,000 foreign students a year by 2047, but is stuck at the 50,000 mark. Accepting what’s wrong might be a good place to start.\n\n",
        "headline_1": "India, teach thyself",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/india-teach-thyself/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-02-2025"
    },
    {
        "full_article": "Trump-Putin chats aren’t bad news for India\nYesterday’s meeting between high-level American and Russian delegates in Saudi Arabia certainly churned the geopolitical pot. First, it’s sent European nations into a huddle, worried that the Trans-Atlantic Alliance’s fraying and a deal on Ukraine would be reached without them at the table. This many of them interpret as being thrown to the Russian wolf.\nSecond, it’s put US aid for Ukraine under a big cloud. Zelenskyy, unsurprisingly, has said that he won’t accept any deals between Washington and Moscow about Ukraine made without Kyiv. But he’s still hanging around in the region, travelling to UAE and Türkiye before going to Saudi Arabia himself. In that sense, Trump has moved the needle on the Ukraine war. Everyone is at least discussing new ideas. Russia reportedly has now said it’s fine with Ukraine joining EU but not Nato.\nUS clearly wants to reset ties with Russia and wean it away from the China-North Korea-Iran camp. That in itself may not be a bad strategy. The Beijing-Moscow compact is a big headache for India too. But will it work? China and North Korea have invested too much in Russia over the course of the war. However, Moscow may be open to hedging. Note that it has not blocked sale of Indian BrahMos cruise missiles to Philippines and now potentially to Vietnam, two countries locked in maritime disputes with China. There are no acceptable solutions yet. But parts are moving to find some. \n\n",
        "headline_1": "Geopoliticking",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/geopoliticking/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-02-2025"
    },
    {
        "full_article": "Maha Kumbh gives BJP lots of political mileage. So, when tragedy strikes, the party and its government officials can’t just deflect blame & make routine noises. What’s missing is proof of genuine empathy\nSaturday night’s stampede at New Delhi station – 18 travellers to Prayagraj were killed – should give the political leadership cause for introspection. Maha Kumbh, which comes once in 144 years, has given BJP lots of political mileage.\n(Picture credit: PTI)\nIt cannot, therefore, shy away from showing greater contrition over the loss of life in the Delhi stampede and other Kumbh-related tragedies.\nRead the full story on TOI+.\n\n",
        "headline_1": "They the people deserve more",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/they-the-people-deserve-more/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-02-2025"
    },
    {
        "full_article": "As president of US-headquartered non-profit, Environmental Defense Fund (EDF), Fred Krupp has been driving climate action, corporate sustainability and policy innovation around the world.\nIn a conversation with Amit Bhattacharya during a visit to India, Krupp talks about why Trump may find it difficult to completely roll back US climate policies, and more.\n\n●Horrible wildfires have ravaged the Los Angeles area. Do you think what’s happening in LA will lead to a more sympathetic understanding of climate change in US, which is deeply polarised on the issue?\nThis is the biggest loss of property by dollar value in any set of fires anywhere in history. It shows that no one, no matter how wealthy, is immune to climate change.\nRead the full story on TOI+.\n\n",
        "headline_1": "‘Trump’s green energy rollback will hurt US economy. India can show world growth is possible without carbon pollution’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/trumps-green-energy-rollback-will-hurt-us-economy-india-can-show-world-growth-is-possible-without-carbon-pollution/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-02-2025"
    },
    {
        "full_article": "We are concerned about the increase in robberies and muggings on the Dhaka-Chattogram Highway over the last six months or so. According to a report by Prothom Alo citing frequent travellers of this route, there have been more than 100 incidents of robberies and muggings at different spots of the 462-kilometre highway during this period.\nAccounts from victims, police officers, and bus and private car drivers suggest that such criminal activities have noticeably gone up, even though the number of robbery cases filed with police stations along the route may not reflect it. Prothom Alo found only 19 related cases filed with three police stations in Narayanganj, one of the districts connecting this important highway. Per these cases, the frequency of mugging and robbery is high in at least 17 spots of the district. Cumilla and Chattogram also have several highly mugging-prone spots. However, victims often don't want to file cases because police cannot generally recover stolen valuables. Instead, many end up being harassed and having to go through trial-related hassles. In most cases, however, police only file a general diary.\nIn recent times, expatriate Bangladeshis have been frequently targeted by muggers and robbers, who often commit the crime when vehicles slow down or get stuck in one place for too long because of traffic, which is a regular phenomenon in the Narayanganj section of the highway. According to police, people don't want to file cases of highway robberies as they tend to move to a safer place quickly afterwards. Even when they do report and police arrest the perpetrators, the latter manage to get bail and resume their criminal activities.\nOur highways are already notorious for the high number of road crashes that occur there. Added to that is the menace of robbery and mugging, not to mention rampant extortion. These crimes don't just affect individuals; cargo vehicles have also come under attack. We, therefore, urge the authorities to take effective measures to make our highways safe. Increasing patrols, raising awareness, and addressing the reasons behind long gridlocks on the highways are some of the measures that can be employed. On the legal front, making reporting of highway crimes easy and ensuring that perpetrators cannot go scot-free after arrests will also help reduce the incidence of mugging and robbery. Transport associations should also cooperate with the authorities to prevent highway criminal gangs. Passengers should be able to travel without the fear of losing their lives and possessions.\n",
        "headline_1": "Make highways safe for passengers",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/make-highways-safe-passengers-3827486",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-02-2025"
    },
    {
        "full_article": "The words \"unpredictable\" and \"rivalry\" come up when fans describe the English Premier League (EPL). These are two essential components that make the EPL the biggest and most watched football league in the world. When you combine these two with football, you get emotions—raw, uncharted, unregulated, and limitless outpourings of emotion. Some positive, some negative, but that is what the beautiful game exudes. When you take that away, what you are left with is a product that does not move you or you no longer resonate with. The emotions of sports are what make it unique.\nThink about some of the most iconic moments in sports—Andrés Iniesta's tribute to Dani Jarque after scoring the winning goal in the FIFA World Cup 2010, Lionel Messi cupping his ears to the Dutch bench in 2022, Cristiano's tears of joy in Euro 2016 or tears of agony in 2008, LeBron's collapse after delivering Cleveland's first title in 52 years, Djokovic ripping his shirt off in celebration after battling Nadal for six hours, or Nadal and Federer's hands intertwined as the latter bid farewell to his sport. What common elements do all these great moments have? Emotions—both good and bad, the unseen burden borne by these athletes, something none of us can truly imagine without walking in their shoes. This is what constructs sports—the passion, the sentiment, and the loose, animalistic side that athletes must possess to become champions. But somehow, in 2025, we have reached a point where we simply cannot allow players to exist in a space of emotion. We expect our athletes to be robots, to bottle up all their feelings and carry on without any reaction.\nSince 2023, the Premier League has been policing emotions, using \"dissent\" as the catchword. Kick a ball in frustration, you will immediately be punished. React loudly, and there's a yellow card. If you scream a profanity, you will see the darker shade coming out of the back pocket of the referee. It is understandable to remind players that surrounding a referee after a foul and demanding a card to be shown or withdrawn can sometimes cross the line from emotion to intimidation. But somehow, we have arrived at a point where rationality and subjective evaluation of a reaction have left the building. Any player, no matter how minimal their reaction, will be punished. Managers on the touchline are continuously penalised for reacting. If they leave their box, they risk being told to leave the field altogether. There is just too much policing going on. Whether it's match officials or Gary Neville giving his two cents on how Gabriel Magalhães celebrating in Haaland's face is disrespectful, or Iliman Ndiaye being booked for his seagull celebration, we are now well past rational regulation. Overt regulations kill the joy, and in turn they take away the excitement of sports.\nEarlier last week, the Premier League announced that they would now be monitoring player celebrations to see whether they are damaging the reputation of the game or inflaming opposition fans or players. Tony Scholes—the Premier League's chief, believes that once celebrations cross the line and turn to mockery or criticism, they should be punished. But who judges that? The referees who are already under condemnation for blatant bias?  Or the Premier League itself, which many claim punishes some more than others? In an ideal world, situations would be dealt with subjectively, but subjectivity in football simply opens the door for favouritism, and this has been laid out in front of us over the past three years.\nHowever, perhaps the real question we should be asking is, what triggered this whole conversation in the first place?\nFrom the sound of it, you would think that this discussion began because a player made an offensive or derogatory celebration mocking a special characteristic of a person or team. But, no. It was Myles Lewis-Skelly, the 18-year-old Arsenal player, copying Erling Haaland's meditation celebration after scoring his first goal for the senior team.\nFor years, players in the Premier League have brought out celebrations mocking their opposition. In recent years, Jamie Vardy's bird celebration against Crystal Palace was compiled into the Premier League's own \"best celebration\" video, Neal Maupay mimicked James Maddison's darts celebration, Andros Townsend did the \"siu\" against Manchester United, Suarez dived in front of David Moyes. There is an abundance of examples. Yet, what seems to be the last straw is an 18-year-old player copying the celebration of Haaland—who just a few months back asked Myles, \"who the f—are you?\" when the latter stepped in to stop a commotion between Haaland and Gabriel.\nThe critics, such as Jamie Carragher and Graham Souness, argue that it's too early for Myles to start mimicking more experienced players.  Because, yes, Neal Maupay is definitely more experienced than James Maddison, and Andros Townsend is miles ahead of Cristiano Ronaldo, right? This is an absurd comment and in many ways highlights the stark differences of how young black players are treated compared to white players, even if they are English. Phil Foden actually does a \"gun\" celebration that many find offensive and that sends the wrong message. Yet, he has never been subjected to any criticism, let alone criticism of this magnitude. Is it the club Myles plays for? Is it his confidence that they don't want to see in a youngster? Whatever it is, you really have to question the underlying theme of racism that black players are subjected to more often than their white counterparts. The constant and harsher criticism has taken out too many stars; do not let Myles be another victim.\nBring back the 2000s; fans do not want to see robots. They want to see a human being giving their all and then reacting to their shortcomings or their unexpected triumphs. They want managers to show passion on the touchline—Wenger and Mourinho did not sell papers or draw eyes to their duels by sitting peacefully on the bench and shaking their hands at the end of the match. No, it's the tie tugging, the heated words, the press conference jabs, that made fans pile in through the gates or pay 25 quid a month to watch these two go at each other. Rivalries thrive on emotions, which showcase the individuality of each player. Personalities are what make them unique and draw fans into the game. Don't stop them now—the Premier League needs these moments to continue being the greatest league in the world.\nRaiyan Binte Rafiq is a sports columnist for The Daily Star. She works in Sports Media in the UK and manages recruitment at Next Level Sports Management in Bangladesh.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "How over-regulation is killing the EPL",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/beyond-the-dugout/news/how-over-regulation-killing-the-epl-3827331",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-02-2025"
    },
    {
        "full_article": "Antimicrobial resistance (AMR) is a pressing global challenge threatening both human and animal health, with its impacts reverberating across ecosystems and economies. But nowhere is this issue more acute than in low- and middle-income countries, including Bangladesh, where widespread misuse of antibiotics in livestock and poultry farming exacerbates AMR risks. Addressing this crisis demands innovative approaches rooted in sustainability and equity. Circular economy, a model focused on resource efficiency, waste reduction, and systemic integration, offers a promising path forward in this regard. When paired with the One Health framework—a multidisciplinary approach that unites human, animal, and environmental health—circular economy principles can transform the livestock sector, fostering resilience against AMR.\nAMR arises when microorganisms develop resistance to antibiotics, rendering treatments ineffective. In Bangladesh, unregulated use of antibiotics in animal farming is a key driver. Antibiotics are often used prophylactically, compensating for unsanitary living conditions and poor farm management practices. The consequences extend beyond farm boundaries, threatening public health, food security, and economic stability.\nIn 2024, I proposed a framework that underscores the critical role of sustainable practices in tackling AMR in the animal health sector. The framework identifies how systemic changes, including better access to veterinary care, improved farm management, and reduced reliance on antibiotics, can disrupt the pathways that drive AMR.\nIntegrating the circular economy model into animal health systems offers a proactive strategy to mitigate AMR. This approach prioritises resource optimisation, minimises waste, and promotes sustainable farming practices. For instance, circular economy principles can guide the development of antimicrobial resistance mitigation toolkits (ARMTs), focusing on preventive health management and judicious antibiotic use.\nBuilding on my proposed framework, ARMTs are designed with farmers in mind. By incorporating advanced technologies, precision agriculture, and community feedback, these toolkits can significantly reduce antibiotic dependency while enhancing farm productivity. Moreover, circular economy encourages recycling of agricultural waste into bio-based products, further reducing environmental contamination, a critical factor in AMR management.\nThe One Health approach complements circular economy by addressing the interconnectedness of human, animal, and environmental health. In tackling zoonotic diseases, which often serve as conduits for AMR, One Health advocates for upstream surveillance and early interventions. This holistic perspective ensures that solutions consider all facets of health and sustainability, reinforcing the structural integrity of farming systems.\nApplying One Health principles alongside circular economy practices can empower local communities. Through education and capacity-building initiatives, farmers and rural practitioners can adopt safer, more sustainable practices. Equally important is the role of policy advocacy, ensuring that these practices are institutionalised for long-term impact.\nTransitioning to circular economy and One Health systems offers significant economic advantages. Reduced reliance on antibiotics can lower costs, improve animal health, and enhance productivity. These changes directly benefit rural economies, where livestock farming is a critical livelihood source.\nFurthermore, this transition supports gender equity. Women, who often play key roles in small-scale farming, stand to benefit from training and empowerment initiatives. By involving women in decision-making processes, we can foster inclusive growth and amplify the societal impact of these interventions. \nAMR is a crisis demanding global cooperation and local action. Bangladesh's experiences provide valuable lessons for other nations grappling with similar challenges. Integrating circular economy and One Health principles into animal health systems offers a replicable model for sustainable development.\nTo succeed, collaboration among stakeholders is essential. As I argued in my proposed framework, partnerships between universities, policymakers, industry, and farming communities can drive sustainable transformations. In doing so, we can create resilient farming systems that protect not only animal and human health, but also the planet's ecological balance.\nAs we look to the future, the message is clear: the fight against AMR requires bold, innovative strategies. By embracing circular economy and One Health, we can turn the tide, ensuring healthier lives for generations to come.\nDr Krishnendu Saha is associate professor of circular economy at Birmingham City University, UK. \nThis article is derived from the author's article published in Business Strategy and the Environment, a prestigious journal on sustainable business. \nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "How circular economy can help tackle AMR in animal health sector",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/how-circular-economy-can-help-tackle-amr-animal-health-sector-3827276",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Need for a national cancer database",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/need-for-a-national-cancer-database-1739891020",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-02-2025"
    },
    {
        "full_article": "A canal in Dhaka illegally occupied by local people is filled with household waste and garbage.   —Collected Photo ",
        "headline_1": "Reclaiming canals:  Now or never",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/reclaiming-canals-now-or-never-1739891095",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Country needs to brace for climate catastrophe",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/country-needs-to-brace-for-climate-catastrophe-1739891188",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Deadly voyage to Europe",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/deadly-voyage-to-europe-1739891214",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-02-2025"
    }
]