[
    {
        "full_article": "The Supreme Court, in quashing the Delhi High Court’s orders against Wikimedia to take down a Wikipedia page on the basis of a defamation case filed by the news agency, Asian News International (ANI), has set right an error by the High Court. A High Court judgment, passed on April 2, 2025, allowed the taking down of the Wikipedia page by saying that the statements were defamatory and were not a verbatim reproduction of the text in the references that it quoted; that the references were themselves “editorials” or “opinionated articles” and that being an encyclopaedia, Wikipedia carried a “higher responsibility”. The reasoning is problematic as the references are based on long form reporting and quotes from independent investigators, and are not “opinions” or “editorials” as the High Court made them out to be. The Court has clearly differed with the High Court’s reasoning by observing that the takedown order was based on too wide a prayer, and noted that the directions to remove all false, misleading and defamatory content were too broadly worded. The Bench has now directed the news agency to make a fresh plea to the High Court pointing out specific portions to be removed from the webpage. The fact that Wikipedia is an Internet intermediary which enjoys safe harbour provisions as the content creation and moderation are handled by users of its site should suggest that any wide-ranging takedown order could punish the very model on which the encyclopaedia operates.Wikipedia is a community-driven encyclopaedia freely available on the Internet and is maintained by volunteers across the world. Even if the quality of articles is not uniform, their editors generally include experts and Wikipedia allows users to edit the content provided they stick to site guidelines. Disputes on content leading to “editing wars” are generally resolved by discussions on the page and measures such as placing the page on “extended confirmed protection” or “full protection”, allowing only “extended confirmed users” for the former and administrators for the latter to make changes. These users are not selected by Wikimedia but elected by community members based on their prior editing activity and reputation. These processes have ensured a significant degree of reliability on the encyclopaedia, even as it has become a repository of more than 62.95 million articles in over 350 languages. In asking for the takedown of articles by interpreting critical information as defamation and by even threatening penal action against Wikipedia, judicial actions could unwittingly lead to the stifling of open discussion of entities on the encyclopaedia, thereby acting against the interest of the free flow of information.\r Published - April 19, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        internet",
        "headline_1": "A welcome move: On Wikipedia and Supreme Court order",
        "headline_2": "Arbitrary takedown orders on Wikipedia will stifle free flow of information",
        "link": "https://www.thehindu.com/opinion/editorial/a-welcome-move-on-wikipedia-and-supreme-court-order/article69465732.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-04-2025"
    },
    {
        "full_article": "President Donald Trump’s threat to revoke the tax-exempt status of Harvard University as an educational institution will have far-reaching consequences not only for the wider student community but also for corporate America and the military-industrial complex. The administration also indicated that it would block the admission of foreign students, who make up nearly a third of Harvard’s student body. The university has refused to accept intrusive federal government control over its activities based on the premise that the government is providing hefty grants. The ostensible reason for the Trump administration’s move is the so-called “leftwing, antisemitic” protests against the Gaza War that broke out at Harvard and Columbia, which have the image of being left-liberal. The Trump administration seems to be playing to its ‘Make America Great Again’ (MAGA) base which has nursed historical grievances against northeastern elites and their universities, exemplified in the Ivy Leagues. These institutions are indeed elite in terms of academic standards but Harvard admits students from a socio-economic spectrum through generous scholarships. The Trump administration opposes Diversity, Equity and Inclusion principles ideologically and Harvard could also have been targeted for this reason. But Harvard has deep pockets and has heft in the corridors of power to outlast Mr. Trump.Mr. Trump’s slashing of government research funds has also affected several public universities, including in deep-red States such as Alabama. Public universities, barring a few such as in Michigan, Texas, and California that have built a sizeable endowment, depend on state support and are under increasing political control. America’s government-induced crisis in higher education threatens a key edifice of American strength and power. It strikes at a long-standing belief in that nation, which is borne out by data, that getting a college degree is a surer path towards prosperity. Mr. Trump, formerly a Democrat, is only part of a long-term global mega-trend in politics. The big picture is that America is only a late entrant in defunding public higher education. The U.K., under Margaret Thatcher, was an early starter. India joined the stream long ago with the NDA government only deepening the cutbacks. Australia, Singapore, Germany and the Scandinavian countries are holding out among the developed nations. It is no coincidence that China’s ascent has paralleled continued public funding of higher education. Much like the U.S. universities of the past, Chinese higher education institutions are building a knowledge base on other nations and regions. Future generations of Americans will see this as a self-inflicted wound. Published - April 19, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        university\n                    \n                            /                      \n                        \n                        students\n                    \n                            /                      \n                        \n                        higher education\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        research\n                    \n                            /                      \n                        \n                        finance (general)\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        Singapore\n                    \n                            /                      \n                        \n                        Germany\n                    \n                            /                      \n                        \n                        China",
        "headline_1": "​Self-inflicted wound: On higher education and Trump administration’s move",
        "headline_2": "The U.S. stands to lose a lot by defunding higher education",
        "link": "https://www.thehindu.com/opinion/editorial/self-inflicted-wound/article69465200.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-04-2025"
    },
    {
        "full_article": "Investors dread greedy, crooked startup founders\nAnother one bites the dust. The startup business is nine parts risk, maybe more. Anecdotally, over 90% of restaurants in India shut down within 18 months. ‘Real’ startups, the ones whose staff – in popular imagination – codes on tablets sitting in cafes, also have a 90% failure rate globally. It could be bad luck, or bad service, or a horribly stupid idea like ‘Juicero’. They made a $400 Wi-Fi-connected juicer, raised $70mn, and became a Silicon Valley darling until somebody showed you could extract the same amount of juice with your bare hands, faster.\nBluSmart wasn’t a stupid idea, though. It was an electric cab service without surge-pricing and last-minute ride cancellation. People in Delhi-NCR, Mumbai and Bengaluru liked it. What broke it was the original sin of business – promoter greed. A cookie seller keeps his hands out of the cookie jar, but BluSmart’s Jaggi brothers thought nothing of helping themselves to borrowed funds at their parent firm, Gensol. Altogether some 262cr hasn’t been accounted for. But their purchase of a premium Gurgaon apartment with company funds is talk of the town now.\nLenders, drivers and customers with money stuck in BluSmart wallets have become collateral damage, but India’s startup scene is also tarnished. Commerce minister Piyush Goyal feels, with some justification, Indian startups aren’t enterprising enough – fixated on ice cream delivery rather than AI foundational models. Investors have other reasons to worry. There’s been a spate of big-name scandals. BharatPe, GoMechanic, Mojocare, Paytm and others have been in regulatory crosshairs. The fall of Byju’s – valued at $22bn in 2022, now worthless and sued for $533mn in US – is the most glaring. While investors can forgive bad ideas – Juicero – what they detest is deceit, a la Elizabeth Holmes of Theranos, and now the Jaggis.\n\n",
        "headline_1": "Straight up fraud",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/straight-up-fraud/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-04-2025"
    },
    {
        "full_article": "His influence is reason Beijing wants to pick his successor\nHistory is not a political project written in the present, Dalai Lama reminds Beijing, and the free world, in Voice for the Voiceless: Over Seven Decades of Struggle with China for My Land and My People. That said, commitment to a mutually beneficial relationship would mean “there’s no need to insist the two parties agree on exactly the same version of the past.”\nIt’s been 75 years since China invaded and annexed Tibet. Tibetan Buddhism’s spiritual head turns 90 in July. The hot question is who’s his successor? He/she’ll be from the free world, says Dalai Lama. In a cruel twist, the ‘leader’ of this ‘free world’ recently created a more immediate problem for Tibet’s govt-in-exile. It froze USAID funds.\nFrom his first encounter, as a hopeful teenager, with Mao Zedong to his expectations of Deng Xiaoping (who said “except for independence, everything is negotiable”), to Tibetan govt-in-exile’s last exchange in 2010 for Tibet’s self-rule, not independence, the book lays out both the road travelled and a roadmap ahead for the Tibetan struggle. The basic point: “The simple truth is no Tibetan will ever say, ‘I am a Chinese’.”\nThere have been no formal talks since 2010. A meeting with Xi during his 2014 trip to India didn’t materialise. Dalai Lama had hopes from Xi as “the most powerful Chinese leader since Deng Xiaoping”. That “he’d seize the opportunity for a bold vision (for) Tibet…Xi had made positive remarks about Buddhism (in Paris).”\nThe monk was told Xi’s mother was a practising Buddhist, and, he had met Xi’s father, who had opposed the Tiananmen crackdown, on his first visit to Beijing 1954-1955.\nBut Dalai Lama always found CCP’s leadership changes “hard to gauge”. Transitions from Deng to Jiang to Hu to Xi were “difficult to navigate in real time”. When dealing with “any Chinese leader, it isn’t clear if one is speaking to an empowered individual or someone caught in the complex web of power relations with other Politburo members,” writes Dalai Lama. Individual efforts seemed thwarted by the leadership.\nThe book recounts China’s Buddhist traditions and argues that Tibetan Buddhism alone can bring “mental peace among millions of young Chinese.” Beijing’s got their land. But Dalai Lama may just be making his way into Chinese people’s hearts and minds. “What gives me hope is that the relationship between the two peoples – Tibetans and Chinese – has not been irreparably damaged.”\nCommunist China had invaded a theocratic state. But Dalai Lama shaped Tibet-in-exile as a democracy. He mused that people may abolish his post even – an acutely political idea that would put paid to Beijing’s strategy of picking his successor. The takeaway from the Tibet struggle perhaps is that CCP has had to concede that Dalai Lama’s reach and influence – regardless of the fact that Beijing sees him as a “separatist” – has no parallel.\nCommunist China waiting to appoint a religious head, the next Dalai Lama, shows how strong the current Dalai Lama’s brand is. \n\n",
        "headline_1": "Dalai Lama’s quiet victory over China",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/dalai-lamas-quiet-victory-over-china/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-04-2025"
    },
    {
        "full_article": "Great news photos become more than just an image\nIf you are not close enough, your photograph is not good enough, said the Hungarian war photographer Robert Capa. He was at work when he stepped onto a landmine and died. It’s a dangerous job. But it is able to tell the world about the most horrific things done by humans to each other – proof like nothing else that, yes, absolutely, that happened. The winning picture of this year’s World Press Photo competition is that of a young Palestinian boy, with both arms severed. It brings the brutal destruction of Gaza ‘close’ to those far away, and not just in kms.\nOver time, some photographs become emblematic of large historic events. Like the one of a naked girl fleeing a napalm bombing, which refuses to let American atrocities during the Vietnam War fade into collective amnesia. Or the one titled Raising the Flag on Iwo Jima that represents American heroism in World War II. Photographers of TOI, India’s newspaper of record, have also taken readers close to the most troubling events, again and again. The frontal photo of a man pointing a pistol at a policeman and threatening to kill him during the 2020 Delhi riots, and photos of Ajmal Kasab that helped establish his guilt in the 26/11 attacks, are just two of the most haunting examples.\nThe camera may be the most important invention since the printing press. But at what point, how many photographs later, do viewers grow immune to the horrors captured in these? When do these stop afflicting the comfortable and comforting the afflicted? The sad truth is that no one book or photo can end a war – that power continues to vest with men in power and their generals. And yet, the truth of the greatest photos is also indisputable. These are humanity’s conscience. However much we wring our hands at their limits, we would be more uncaring without them.\n\n",
        "headline_1": "When it clicks",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/when-it-clicks/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-04-2025"
    },
    {
        "full_article": "It’s not in the Ivy League but in smaller US universities that most students from India & most Americans get degrees. These are under far greater threat from the White House\nJudging by the headlines, Trump’s attacks on American universities are centered on prestigious institutions like Harvard, Columbia and Tufts, where the administration has arrested students and demanded obedience from administrators.\n\nBut these attacks obscure what the administration is doing to the colleges that serve most students in US, and most students who come to US from India.\nRead the full story on TOI+.\n\n",
        "headline_1": "Trump vs non-Harvards",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/trump-vs-non-harvards/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-04-2025"
    },
    {
        "full_article": "It is encouraging to see constructive discussions at the first foreign-secretary-level talks held between Bangladesh and Pakistan in 15 years. Given the complex and often strained history between the two countries, the meeting marked a gradual thaw in relations as both sides sought to build on earlier interactions between the two heads of state in September and December. At the meeting, among other topics, Dhaka notably raised two historically unresolved issues: it demanded $4.52 billion as Bangladesh's share of pre-1971 assets and dues as well as a formal apology for the genocide committed during the Liberation War. It also requested the repatriation of stranded Pakistanis from Bangladesh. In response, the Pakistani delegation expressed a willingness to continue discussions.\nWe must say that while economic imperatives likely, and rightly, drive ongoing efforts, addressing these issues is vital to a solid foundation for bilateral relations. Pakistan's pre-1971 role remains a deep wound for Bangladeshis and a stumbling block to building a truly fruitful partnership. There may be debates about the number of civilians killed by Pakistani forces, but the repressions and brutalities we suffered during our independence struggle are a matter of historical record. For us, asking for a formal apology or reparations is not about seeking revenge; it's about the need for admission of a historic tragedy and fostering genuine reconciliation. That said, we need to be prudent given the complexities involved.\n\nWhile economic imperatives likely, and rightly, drive ongoing efforts, addressing historic issues is vital to a solid foundation for bilateral relations. Pakistan's pre-1971 role remains a deep wound for Bangladeshis and a stumbling block to building a truly fruitful partnership. There may be debates about the number of civilians killed by Pakistani forces, but the repressions and brutalities we suffered during our independence struggle are a matter of historical record. For us, asking for a formal apology or reparations is not about seeking revenge; it's about the need for admission of a historic tragedy and fostering genuine reconciliation.\nFor context, apologies issued by Japan for wartime atrocities in South Korea and China were often seen as insufficient as they were deemed vague, lacking legal reparations, or undermined by subsequent statements and actions of politicians. This highlights the difficulty of securing apologies that are both meaningful and enduring. Nevertheless, sustained diplomatic pressure has, at times, prompted renewed gestures of atonement from Japan. We must learn from such examples and engage with Pakistan accordingly. On Pakistan's side, a formal apology would also help its own collective reckoning as much as it would mend ties with us. The economic aspect of Bangladesh's demands could prove to be more challenging, however. As of April 4, Pakistan's foreign exchange reserves stood at $15.75 billion. Meeting the demand for $4.52 billion would mean parting with more than a quarter of those reserves—an unfeasible prospect at the moment. We, therefore, need to approach the issue with patience and strategic foresight.\nIt's important to remember that both sides have much to gain from an improved relationship, not just economically but also in other areas of shared interest. Bangladesh's exports to Pakistan stood at $61.98 million in FY2024, while imports from Pakistan were $627.8 million—a gap that greater cooperation can help address. However, these imports are still considerably lower than those from China and India. Enhanced trade ties with Pakistan could diversify our sourcing markets and offer competitive advantages. Already, direct shipping has begun between Bangladesh and Pakistan, while trade and visa procedures are getting easier, with direct flights on the cards.\nOf course, sensitivities rooted in something as crucial as 1971 will not vanish overnight. But a future-oriented approach—combining constructive dialogue, historical reckoning, and acknowledgement of mutual benefits—can go a long way. The first steps in that direction have already been taken. We hope that the scheduled visit of Pakistan's Deputy Prime Minister and Foreign Minister Ishaq Dar later in the month would further normalise Bangladesh-Pakistan relations.\n",
        "headline_1": "Thaw in Bangladesh-Pakistan ties a welcome development",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/thaw-bangladesh-pakistan-ties-welcome-development-3874426",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-04-2025"
    },
    {
        "full_article": "US President Donald Trump's sweeping tariffs have unleashed economic chaos, roiling stock and bond markets and triggering panic around the world, especially in lower-income countries that rely heavily on exports to the United States. The result could be an entirely manufactured global recession, with the developing world bearing the brunt.\nThe brief calm in financial markets following Trump's abrupt announcement of a 90-day \"pause\" on most of his \"reciprocal\" tariffs—excluding those on Chinese imports, which he raised to 145 percent—has proven premature. While some billionaires and loyalists may have made a killing by correctly interpreting Trump's social media posts ahead of his sudden policy reversal, the disruptions to global trade and finance caused by his tariffs continue to pose serious risks.\nMoreover, despite the pause on some tariffs, a universal 10 percent tariff on all US imports remains in effect, along with sector-specific tariffs of 25 percent on steel, aluminium, automobiles, and auto parts. There are new exemptions for smartphones, computers, and other electronic devices, even as Trump has also threatened new duties on pharmaceuticals, semiconductors, copper, and lumber. Taken together, these measures will reduce the availability of imported goods, raise prices for US consumers, and impose steep costs on exporting countries.\nBut ultimately, the tariffs imposed on each country will depend on future negotiations, where the US is expected to play hardball. Trump has already made clear his disdain for foreign leaders, boasting that many were \"kissing my ass\" and willing to \"do anything\" to reverse the tariffs. As a result, the final scope of Trump's tariffs remains uncertain.\nMost critically, Trump's latest tariff hike on Chinese imports all but ensures that the Sino-American trade war will continue to escalate. The increase to 145 percent is largely symbolic—a tit-for-tat move after China raised its own tariffs—since the previous 104 percent rate had already made most Chinese imports commercially unviable. In effect, the administration has signalled its intent to shut down trade with China.\nThe implications for US consumers and domestic producers that rely on Chinese inputs are profound. Trump's open distrust of goods from Chinese-owned factories, even when routed through third countries, has forced governments hoping to maintain access to the US market to scramble for alternative sourcing and production options. The mere expectation of such shifts has already severely disrupted global supply chains.\nUncertainty has always been a major deterrent to economic activity, and the unpredictability of the Trump administration's policies (marked by erratic decision-making, sudden reversals, and on-again, off-again announcements) has made future developments nearly impossible to anticipate using standard risk models. Trump's preference for shock-and-awe tactics, reminiscent of other \"strongmen\" like Indian Prime Minister Narendra Modi, compounds the problem.\nRising uncertainty will inevitably discourage investment, as businesses shelve new projects and postpone planned expansions while waiting to see how events unfold. The subsequent slowdown could weigh heavily on US growth and employment, with consequences that extend far beyond the direct economic impact of Trump's tariffs.\nWorse still, the US cannot win its trade war with China. The Chinese government clearly knows this and is playing the long game. At any moment, the two superpowers' economic war of attrition could spiral into a major financial crisis or even a military confrontation.\nThe alarm bells are already ringing. The falloff in demand for US Treasury bills, long considered the world's safest asset, signals diminishing confidence in the economic leadership of the US. Moreover, the simultaneous drop in US stocks, bonds, and the dollar points to growing doubts about the US Treasury's ability to serve as the global benchmark for asset prices, even as they remain the preferred vehicle for high-volume financial transactions.\nAs with previous self-inflicted economic crises, the US economy will undoubtedly suffer, but the heaviest burden will fall on the developing world. Cancelled or delayed export orders are already undermining production and fuelling unemployment. Meanwhile, financial volatility is threatening economic stability long before the full impact of Trump's tariffs can be felt.\nThese developments are already reflected in the yield spreads on developing countries' sovereign bonds, particularly those of lower- and middle-income economies. In the month leading up to April 9, emerging-market sovereign dollar debt values fell by an average of 2.9 percent, while average yields rose to 7.4 percent. The sovereign bonds of debt-stressed countries like the Maldives, Sri Lanka, Gabon, and Zambia dropped by more than 10 percent.\nUnfortunately, developing countries are all too familiar with this kind of financial and economic turmoil. For decades, many have been trapped in a cycle of currency depreciation, rising borrowing costs, strained public finances, forced spending cuts, and domestic market instability that constrained investment and private-sector activity.\nThe lessons for developing economies are clear. Not only is globalised trade being upended, but financial globalisation is bound to become even less appealing to countries seeking stable, long-term financing to support their development goals.\nTrump is determined to dismantle the global economic order, which in his view allows other countries to take advantage of the US. In response, many developing economies will likely begin to reconsider their participation in—and subordination to—an unequal system that no longer serves their interests. But the road ahead will remain perilous until a credible alternative takes shape.\nDr Jayati Ghosh, professor of economics at the University of Massachusetts Amherst, is a member of the Club of Rome's Transformational Economics Commission and co-chair of the Independent Commission for the Reform of International Corporate Taxation.\n\nCopyright: Project Syndicate, 2025\nwww.project-syndicate.org\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The Global South will pay for Trump’s trade war",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/project-syndicate/news/the-global-south-will-pay-trumps-trade-war-3874301",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-04-2025"
    },
    {
        "full_article": "It is disappointing that the metro rail authority's installations and equipment have yet to be removed from the Shaheed Anwara Park in the capital's Farmgate area. Since 2018, the park has been used by the Dhaka Mass Transit Company Limited (DMTCL) as a project site office and storage area for construction materials. Initially, it was agreed that the park would be restored to its original condition upon completion of rail construction. However, in 2023, DMTCL announced plans to construct an on-site station plaza, including shops, hotels, restaurants, entertainment centres, and so on.\n\nNaturally, the announcement came as a shock, forcing urban planners, environmental activists, and local residents to launch a protest movement. In December, three advisers from the interim government met with the protesters. During the meeting, it was assured that all the installations and equipment at the park would be removed by March 26. However, more than two weeks have passed since the deadline, but that promise still remains unfulfilled. Moreover, the government had pledged that the park would be restored, re-greened, and reopened to the public. This is critically important given Dhaka's current state, where green spaces are rapidly disappearing, leaving few parks or playgrounds available.\n\nAccording to urban planners and environmental activists, the metro installations and equipment currently occupying the park could be cleared within a week if the will existed. Even if twice that time were required, there can be no justifiable reason for the delay in clearing the site and reopening it to the public. What is equally concerning is that the authorities have offered no clear explanation for the delay being caused. Speaking to Prothom Alo, Fauzul Kabir Khan, adviser to the Ministry of Road Transport and Bridges, said he had consulted the relevant officials, claiming that some remaining work in the park was yet to be completed. They are now saying that the western part of the park will be vacated by June.\n\nThis is unacceptable. The authorities must understand that seven years have already passed since the park was closed. So, they must expedite the efforts to clear the park of all stored materials, proceed with restoring it as promised, and reopen it to the public at the earliest opportunity. The lack of importance placed by the authorities on preserving open spaces and parks in Dhaka must also change.\n",
        "headline_1": "Why is Anwara Park still occupied?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/why-anwara-park-still-occupied-3874231",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-04-2025"
    },
    {
        "full_article": "Music, fairs, and colourful processions—the celebrations welcoming the Bangla New Year 1432 were truly a sight to behold. On Monday, people came out in droves to participate in what is typically the largest festival observed in the country, particularly in Dhaka. This year's festivities carried special significance, being the first after the fall of a dictatorship that had pushed the people to the edge for more than a decade.\n\nMisgivings abounded ahead of the celebrations though, especially after two motifs created for the Borsho Boron Anondo Shobhajatra were burnt down on the Dhaka University campus just two days prior. There was also controversy surrounding the renaming of the traditional morning procession in the capital. Fortunately, the unease that had been thus stirred did not overshadow or mar the festivities eventually. In the end, a greater sense of unity and togetherness prevailed.\n\nWhat truly set this Pahela Baishakh festival apart was the scale of public participation: members of about 28 different ethnic minority communities, along with people from all walks of life, joined in the processions and festivities. From eight-year-olds to octogenarians, everyone came out to proudly stake their claim to a shared heritage and cultural identity. The message of peace, inclusivity, and diversity was loud and clear. This, we must acknowledge, was made possible by the government's commendable efforts in ensuring that the celebrations proceeded smoothly and safely.\n\nThat is not to say the festivities were entirely without blemish. The suspension of celebrations at Chattogram's DC Hill, for example, was quite distressing. It followed an attack by a group of miscreants, identified as members of the BNP-backed Jatiyatabadi Samajik Sangskritik Sangstha (Jasas) and its like-minded organisations, who opposed the programme and vandalised the venue. This is an issue that BNP should address with due seriousness.\n\nApart from that, beyond the music and joy and food, festivals like this should also prompt reflection. Ours is a heritage built on resilience, communal harmony, and compassion, but we must also confront the uncomfortable truth that intolerance, exclusion, and discrimination have increasingly taken root in our society. Monday's celebrations marked a step towards resisting those influences and reaffirming our collective desire for a truly equal and inclusive society. Moving forward, we must strive to be free from prejudice and inequality in all spheres of life. Our social, political, and economic systems must become truly inclusive and diverse, and the discrimination still faced by marginalised communities must be eradicated. Only then can we build a society that truly reflects the spirit of Pahela Baishakh.\n",
        "headline_1": "A potent display of unity amid diversity",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/potent-display-unity-amid-diversity-3871976",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 19, 2025 00:00:00  \nThe interim government is reportedly going to be tightfisted while preparing the next national budget with a view to curbing inflation. It aims to bring the inflation down to 6.5 per cent by the next fiscal year (FY2025-26). However, in the current fiscal (FY2024-25) under the revised budget, the Finance Ministry has projected the inflation rate to be at 8.5 per cent, though the overall inflation rate was 9.35 per cent last month (March), slightly higher (driven by non-food items) than the previous month this year, according to the Bangladesh Bureau of Statistics (BBS). Notably, the inflation rate has remained above 9.0 per cent for the last 23 months. In fact, the major driver of the rise in inflation rate in Bangladesh is generally attributed to high price of essential commodities. Now, one wonders, how can the government expect to rein in the inflation rate since just after the Eid it, reportedly, following consultations with the refiners, did substantially raise the per litre retail price of bottled soybean oil by Tk 14 and those of non-bottled varieties of soybean and palm oils by Tk12. \nBoth these items being kitchen essentials, the decision is definitely going to hit the lives of the low-income section of the population hard by increasing its cost of living further. As it could be gathered, the period of low VAT facility at 5.0 per cent that the oil importers and refiners had been enjoying since mid-December last year having now being over, the prices of the edible oils in question are at present being set according to their rates on the international market. Though the international market for soybean oil reportedly declined by 10 per cent during the January-March period of this year, the government, allegedly, has succumbed to the pressure coming from the edible oil refiners. Prior to the edible oil price hike, there also came an official announcement to raise gas prices by 33 per cent for new industries and gas-based captive power plants. The new measure surely pushes up the cost of production of many industries and discourages new investment at a time when the government has been seriously trying to attract new domestic and foreign investments.\nThe central bank's decision to continue with the contractionary monetary policy aimed at containing inflation comes into question. What is more important is not any abstract theory that has proved to be effective historically in slowing down economies that get overheated due to high consumer spending. This is a phenomenon often observed in advanced industrial economies and not in a developing economy like Bangladesh where other factors like market distortions caused by syndicates, rent-seeking by powerful quarters while the essential commodities are in transit and disruption of supply chain by various other non-market actors are at work. So, according to some experts, streamlining of inefficient business regulations and untangling supply chains from exploitative practices could help. Also, other means like effective application of stricter law-enforcement measures would be necessary. \nAgainst this backdrop, the government in its upcoming budget would do well to adopt a more balanced and flexible policy to fight inflation while at the same time allowing the economy to grow. The government's actions from various fronts need to be complementary, not contradictory, for the greater good of the country's economy.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Balanced, flexible policy needed to tame inflation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/balanced-flexible-policy-needed-to-tame-inflation-1744984329",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       April 19, 2025 00:00:00  \nLike much of the world, Bangladesh built its economy around international trade with other countries. This reliance on exports and imports has been one of the cornerstones of the country's economic growth since its independence. It wasn't meant to be a bad thing because for nearly a century, the global economy has been driven by countries buying and selling goods. Economists have labelled it as globalisation and have been pushing for it since they believe when countries trade freely, it generates more prosperity for everyone involved with the commerce. \nHowever, that long-held principle is now being tested. With US President Donald Trump's imposition of sweeping trade tariffs, a plan he paused for most countries for three months, the world appears to be turning toward protectionism. While it is still unclear how far-reaching the changes will be, it is evident that countries like Bangladesh that are deeply reliant on exports will likely bear significant impacts. \nOn April 2, when announcing \"reciprocal\" tariffs on nearly all imported goods, President Trump said, \"If you want your tariff rate to be zero, then you build your product right here in America because there is no tariff if you build your plant, your product in America.\" This is a protectionist policy intended to discourage US imports. Apparently, Trump administration believes any country's exports to the US has to be balanced with its imports from the US, otherwise it will be penalised with tariffs. \nAs the world's largest importer of goods, adoption of such a stance by the US has significant global implications. When it treats its trade deficit with another country as a loss and seeks to impose tariffs proportional to that deficit, it risks setting off a chain reaction. As a consequence, affected countries may retaliate or impose their own trade restrictions to protect their balance of payments.\nIn the last fiscal year, Bangladesh had a $6.2 billion trade surplus with the US largely due to strong demand in the US market for Bangladesh's high-quality, reasonably priced apparel. However, under the new trade logic, it makes Bangladesh a target. While President Trump may think trade deficit as bad, this view is flawed. As argued by Nobel laureate Paul Krugman, no one considers it a problem to have a trade deficit with their local grocery store. The store sells goods to a customer who doesn't necessarily sell anything back, but no one sees this as unfair. If that's not considered negative for an individual, why should it be negative for a country? Nevertheless, as long as the US continues to interpret trade imbalances negatively, Bangladesh must reassess its import-export strategies accordingly.\nWhile enjoying a trade surplus with the US, Bangladesh faces considerable trade deficits with other major partners including approximately $20 billion with China, $10 billion with India and $600 million with Pakistan annually. Should exports to the US face headwinds, the country must adjust by re-evaluating its imports. Bangladesh could consider imposing tariffs on foreign products that have viable local alternatives, especially from countries with whom it runs large trade deficits. Ironically, there are instances where the opposite seems to be occurring. For example, India, which enjoys a significant trade surplus with Bangladesh, imposed non-tariff and para-tariff barriers such as anti-dumping duties on certain Bangladeshi export items. In a new world order of economic nationalism, such disparities must be addressed.\nGiven that reserves of foreign currency are finite, a reduction in export earnings should be matched by a corresponding decrease in import expenditure. However, this reduction in imports cannot be achieved overnight. Instead, a strategic, long-term plan is needed to reduce reliance on foreign goods. To that end, Bangladesh could adopt a 15-year roadmap to restructure its economy so that it can gradually build capacities to replace imported items with local alternatives. \nAmong Bangladesh's top imports are cotton and cotton yarn, primarily sourced from China and India, and vital for the dominant readymade garments industry. Currently local cotton production meets only 2.0-3.0 percent of national demand even though the country has suitable climate conditions to produce much more. The good news is Bangladesh has developed high-yielding cotton varieties with desirable fibre quality, which if effectively utilised by local farmers could present significant opportunity for import substitution. To capitalise on this, the government can take proactive steps such as offering incentives to farmers and tax benefits to mills that use locally produced cotton. The transition thus gets encouraged.\nLooking ahead, Bangladesh must also diversify its export destinations to reduce risks associated with over-reliance on a single market, as exemplified by the current situation with the US. Nearly one-fifth of Bangladesh's exports go to the US, and this level of dependence can turn into vulnerability. The quality of Bangladeshi products is evident from their acceptance in competitive markets like the US and parts of Europe. To build on this strength, the government should actively pursue diplomatic outreach and trade agreements to identify and cultivate new export markets for these high-quality goods. \nEqually important is strengthening domestic self-reliance. Economic nationalism appears to be on the rise in various countries where advocates are calling for spending the taxpayers' money at home as long as the costs remain reasonable. In India, the government under Prime Minister Narendra Modi has promoted the \"Make in India\" initiative to actively encourage local manufacturing. To avoid appearing overtly protectionist, his administration has strategically combined this push with efforts to attract foreign investment. Similarly, in Bangladesh campaigns urging consumers to boycott some items of foreign origin frequently circulate on social media. Although the impact of these calls on sales may be limited, such campaigns can still damage brand reputations and strengthen public sentiment in favour of local goods. \nWith a substantial consumer base exceeding 160 million, Bangladesh stands to gain significantly from prioritising local products. Encouraging consumers to choose domestically manufactured goods would not only conserve valuable foreign currency but also create jobs and support the growth of local industries. \nshoeb434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Buying local goods in time of trade war",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/buying-local-goods-in-time-of-trade-war-1744984389",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       April 19, 2025 00:00:00  \nAs summer starts, different parts of the country are likely to face severe water crises in the coming days, as a piece of news warns. It is said that in Feni District, water is unavailable from 167,000 tube wells due to the depletion of underground water. Around 70 per cent of tube wells have stopped yielding water at some upazilas in the district. So, residents are forced to fetch water from distant sources or consume unsafe water from ponds and ditches, causing serious health hazards. As there is no water in tube wells, ponds, canals, beels or swamps, people are eagerly waiting for rains. \nThe situation in Feni is not exceptional, as many areas of the country are already in similar crises. Millions of people are struggling to fetch the necessary fresh water for drinking and cooking. Even in some areas, adequate water for washing is not available. This means that people are unable to maintain basic hygiene, leading to increased health risks. Every day, they have to take a long walk to collect water from different sources, and not all of it is clean. So, millions of people have been suffering, not just from the lack of water, but also from the health issues that arise from using contaminated water.\nOver the years, groundwater depletion has become a serious concern in the country. This means that the water stored underground, which is crucial for our survival, is being used up faster than it can be replenished. The main reason for this is the excessive extraction of groundwater for agricultural production. As irrigation in Bangladesh is still inefficient, it leads to misuse of water, adding pressure on both ground and surface water, posing a serious threat to ecology. Bangladesh's three main rice growing seasons are December-January to April for Boro, April/May to June-July for Aush, and July-August to November-December for Amon. As the cultivation of Boro has already been completed and the harvesting time is near, the water demand is low now. Nevertheless, the cultivation occurs during the dry winter season, and farmers have to extract significant amounts of groundwater using shallow and submersible pumps. The extraction caused groundwater depletion, and the lack of rain since November has made it difficult to recharge the ground level. \nWater extractions by dyeing machines at textile factories also deplete the water table in industrial zones like Narayanganj and Gazipur throughout the year. The persistent extraction leads to a water crisis in urban areas, which intensifies in summer. \nRapid but unplanned urbanisation also increased the problem as unregulated extraction coupled with misuse of water becomes a regular phenomenon. Many households in Dhaka and other cities in the country are used to wasting water instead of preserving and recycling it. Misuse of water is also visible in many educational institutions, commercial centres, and masques, although there is an opportunity to recycle some of the water used there. For instance, installing a recycling system in mosques makes it possible to clean and reuse the water used for ablution. Similarly, recycling mechanisms can be introduced in various educational institutions and offices. Investing in a well-designed recycling system will be beneficial in the long run, although installation and operation costs are initially high. \nThe depletion of groundwater is a global crisis now. An international study found that rapid groundwater-level depletions are widespread in the 21st century, especially in dry regions with extensive croplands. Moreover, groundwater-level declines have accelerated over the past four decades in 30 per cent of the world's regional aquifers. Nevertheless, there is still a lack of cooperation among the nations to work together to address the crisis. Some countries are even yet to recognise the severity of the situation. This is where policymakers and community leaders play a critical role. They can implement and enforce water conservation measures, educate the public about the importance of such conservation, and invest in water recycling technologies. One of the key tools to fight against the crisis is efficient recycling of used water.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Water recycling to  ease its crisis",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/water-recycling-to-ease-its-crisis-1744984442",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 19, 2025 00:00:00  \n\nIn today's fast-paced, hyperconnected world, marketing has transformed into the backbone of success across all sectors from just a business function. Whether it's education, healthcare, technology, finance, development, or even artificial intelligence nothing thrives without the strategic power of marketing. As a student of Accounting & Finance at North South University, I've come to realise that the need for marketing minds is no longer limited to traditional corporate settings; it's now essential for progress, innovation, and impact in every industry.\nWe often assume that if a product or service is good, it will naturally succeed. But in reality, even the best ideas remain invisible without proper promotion. Consider AI, a field built on cutting-edge technology and innovation. Despite its vast potential, AI needed aggressive marketing and public education to gain global acceptance and trust. The rise of tools like ChatGPT or Tesla's self-driving features didn't just happen through innovation they were also fuelled by compelling storytelling, user education, and strong branding. That's marketing at work.\nIn Bangladesh, where start-ups, educational institutions, NGOs, and even public services are evolving fast, marketing is more critical than ever. A healthcare app needs to earn trust. An education reform programme needs community engagement. A small business needs to cut through the noise to reach customers. All of these require marketing strategies that build awareness, credibility and loyalty.\nWhat's fascinating is how marketing itself has evolved. It's no longer just about ads and billboards. It's data-driven, digital, emotional, and personal. It involves understanding the audience deeply, crafting relatable narratives, and creating experiences that resonate. In an age where attention spans are short, only powerful and purposeful marketing can sustain engagement.\nIn conclusion, marketing is no longer an option it's a necessity. It is the muscle that drives growth, builds brands, influences perception, and connects ideas with impact. From classrooms to boardrooms, and from tech labs to local startups, marketing minds will lead the way forward. It's time we give this powerhouse the attention and respect it deserves in every sector of Bangladesh and beyond.\nAsiq Mohammad Mokbel Hossen\nStudent\nDepartment of Accounting & Finance\nNorth South University\nasiq@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The power of marketing",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-power-of-marketing-1744984467",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-04-2025"
    }
]