[
    {
        "full_article": "In an unconscionable act, a professor of political science at Ashoka University, Ali Khan Mahmudabad, was arrested on Sunday by the Haryana Police after two separate first information reports (FIR) were registered against him in Sonipat. These FIRs were over his social media posts in connection with Operation Sindoor. The first message analysed the strategic reasons for India’s Operation Sindoor as it had to tackle a Pakistan regime — led by the military — that has sought to hide behind non-state actors while promoting terror in India. It also noted how the empanelment of Muslim military officers in India’s press briefings showcased the pluralist vision of the country, even though this was in contrast with the communal reality that Muslims face in many parts of India in recent years. The second post condemned the “blind bloodlust for war” by some netizens following the ceasefire, while arguing that only the world’s military-industrial complex benefited from war and that both Hindu and Islamic scriptures emphasised that patience and restraint are virtues in conflict. There is nothing objectionable in his posts that were lucid and patriotic calls for an inclusive India and evinced an understanding that India has been forced to target terror-hubs in Pakistan by removing the distinction between terrorists and the larger terrorist infrastructure backed by Pakistan’s military regime. The Haryana Police’s move was based on complaints by office-bearers of the Bharatiya Janata Party (BJP)’s Yuva Morcha and the Haryana State Women Commission Chairperson Renu Bhatia, which said that the posts were disparaging to women in uniform and attributed malicious intent to the Indian government. This is plainly false, and there should have been little basis for the Haryana Police to have acted on these complaints, if they had cared to read and understand the clear messages in the posts.It is also alarming that the arrests have been made on charges that are related to endangering the country’s sovereignty and integrity, and promoting enmity between different groups — akin to the charges of sedition levelled against dissidents in the recent past. Too often, and very wrongly, the charge of sedition has been used by law enforcement agencies across India to quell dissent and the professor’s travails are symptomatic of a pernicious trend in recent years, especially in States ruled by the BJP. His arrest is also a reflection of the worsening state of academic freedoms, where critical understanding and reflections in institutes of higher education on the policies and the actions of the state and governments have been frowned upon and even criminalised in some cases. On Monday, the Supreme Court of India agreed to urgently hear the professor’s case against his arrest. The Court must reiterate the importance of the freedom of expression and come down heavily on law enforcement agencies that misuse powers to slap serious charges related to sedition, on frivolous grounds. Published - May 20, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        arrest\n                    \n                            /                      \n                        \n                        university\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        minority group\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        human rights\n                    \n                            /                      \n                        \n                        Haryana\n                    \n                            /                      \n                        \n                        police",
        "headline_1": "Thought police: on a professor’s arrest",
        "headline_2": "A professor’s arrest for posts points to misuse of law against dissent",
        "link": "https://www.thehindu.com/opinion/editorial/thought-police-on-a-professors-arrest/article69594526.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-05-2025"
    },
    {
        "full_article": "Mixing history, tradition and commerce, the old city neighbourhoods of India’s metropolises have a unique vibrancy, colour and feel. Some of the hardiest entrepreneurs, talented craftsmen and canny businesspeople have set shop there, along with the working classes, that help turn the wheels of the economy. These neighbourhoods are home to narrow lanes, crumbling commercial structures, and pigeon holes that serve as residences. Packed with people, these bustling neighbourhoods create well-knit communities too. Built well before modern fire safety norms evolved, most of these buildings are also major fire hazards. A stone’s throw away from the Charminar in Hyderabad, a building in Gulzar Houz housed a large joint family engaged in the jewellery business from the time of the Nizam, as well as several shops. As is common in old cities, a tunnel-like entrance near the shops led to a passage and then a courtyard around which there were shops on the ground floor and living areas above. A skylight above the courtyard permitted light, but no air. On Sunday morning, a fire devastated the family killing 17, eight of them children. There was only one staircase to the living areas, a common feature in such accidents. A few seconds of inhaling smoke can trigger panic. Brain death happens in a few minutes. The dead had literally no means of escape once the fire took over the narrow passage. Photographs taken hours after the blaze was put out still showed smoke obscuring the insides.Gulzar Houz-type buildings are a common sight across India’s inner cities, and are standing fire hazards. In Hyderabad, the street was wide enough for firefighters to access but that is not the case elsewhere. A fire safety audit would establish key deficiencies of each building and perhaps suggest solutions. But there are millions of such buildings and this would be a humongous task. Communities can be engaged by city planners to create awareness and promote safety. Too often, a building is built for a certain electric load, and over time, the load increases multi-fold with air-conditioners becoming must-haves. Fire safety takes a hit right there. Creating more access and exit points and training residents to escape fires are eventually the most effective fire safety measures. Each neighbourhood could have volunteer fire champions who would advocate for fire safety. While policy and government action can initiate change, communities will have to be in the forefront of ensuring fire safety. Published - May 20, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Hyderabad\n                    \n                            /                      \n                        \n                        fire\n                    \n                            /                      \n                        \n                        accident (general)\n                    \n                            /                      \n                        \n                        building material\n                    \n                            /                      \n                        \n                        hazardous materials",
        "headline_1": "​Old and unsafe: on the Hyderabad fire",
        "headline_2": "Cities must undertake fire safety audit for their old buildings",
        "link": "https://www.thehindu.com/opinion/editorial/old-and-unsafe-on-the-hyderabad-fire/article69594499.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-05-2025"
    },
    {
        "full_article": "Police action against Prof Khan shows little logic & raises several larger questions\nToday, the Supreme Court will hear the appeal against the arrest of Prof Ali Khan Mahmudabad of Ashoka University. That the original complainants were a Haryana govt appointee and a BJP sarpanch shouldn’t have made any difference to local police’s response. But Khan was taken into custody for a social media post that contrasted “rightwing commentators’” praise for Col Qureshi with their stand on “lynchings, arbitrary bulldozing…”. Let’s assume that some can disagree with him. Or that some may even hold the view that Khan’s argument was ill-timed. But can anyone seriously argue that Khan allegedly committed the following crimes – “sow communal divisions”, “endanger India’s sovereignty and unity” and insulted “the modesty of women”? Yet these were the crimes Haryana police charged him with. Among the provisions used was BNS Section 152, which bears a striking resemblance to IPC’s sedition provision. A local court promptly sent Khan to 48 hours police custody. Khan’s attempts to clarify his post after he received the Women’s Commission’s summons didn’t make a difference. The Ashoka University faculty association’s statement that the arrest was “calculated harassment” was spot on.\nMany larger questions come up via this case. First, is there any application of mind by local police when complaints are made by those associated with governing parties in various states? Second, isn’t it now clear that BNS Section 152 is as much a blunt instrument as the sedition provision was? Third, is criticism protected by free speech? For police and some politicians, the answer seems no. Recall here what SC had said when it quashed the case against Imran Pratapgarhi, who had posted a Faiz poem – the court said standards of free speech can’t be decided by those “who always perceive criticism as a threat…”, that those taking objection should respond by “counter-speech”, not by demanding police action.\nBut as SC yet again hears a case that should never have seen the light of day, all thinking Indians must also ask why a professor who praised, logically and cohesively, GOI’s military response to Pahalgam found himself behind bars.\n\n",
        "headline_1": "An arresting moment",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/an-arresting-moment/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-05-2025"
    },
    {
        "full_article": "US just lost its last AAA rating to its debt problem, but any loss of confidence in US will be bad for all\nFor the first time in 100 years, America is without an AAA credit rating. It’s easy to blame Trump, his tariff mess, and his planned tax cuts, for the loss, but this downgrade was a long time coming. S&P, one of the big three rating agencies, had downgraded US in 2011, under Obama. Fitch followed in 2023, under Biden, and Moody’s did so on Friday. While presidents and policies have changed, America’s underlying problem of too much debt has only grown. So the lower ratings inform lenders that lending to Uncle Sam for the long term isn’t as safe as they think.\nThat’s not to say US will default on treasury bills due next week, or even T-notes due over the next few years, but the long-term picture isn’t rosy. In 2024, US govt spent $1.8tn more than its revenues. This year, the deficit could touch $2tn. Over the years, cumulative govt debt has crossed $36tn, and is at 125% of GDP. But there are no free lunches even for govts, so US pays close to $1tn as interest on its borrowings, which is more than its defence expenditure, or its health budget. \nTo get back to an AAA rating, US would need to raise revenues – by increasing taxes, for example – or cut expenditure. And Trump was expected to do the latter. Setting up a department of govt efficiency, or DOGE, under Elon Musk was expected to trim govt departments, staff strength and costs. So far, DOGE claims to have saved $160bn, but it can’t go on slashing departments forever. On the other hand, Trump’s tax cuts could add up to $5tn to the deficit over a decade. \nSo if US govt debt goes on increasing, at some point not just rating agencies but also investors will get wary. Demand for US bonds, and their prices, will dip, pushing up yields – this is already apparent. If bond yields stay up, other borrowers – both govt agencies and private sector – will need to pay more interest to borrow. That will slow down growth globally. Trump’s tariffs have already imperilled global growth. Some analysts say he’s counting on a slowdown to lower interest rates, so that US can refinance its debt cheaply. But rising inflation due to tariffs would put paid to that. Trump didn’t create America’s debt problem, but he’s in the White House now, and it’s his job to steer US towards a more fiscally prudent course.\n\n",
        "headline_1": "Saving America",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/saving-america/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-05-2025"
    },
    {
        "full_article": "What Lady Hastings sowed, Powai Lake is reaping\nPowai Lake in central Mumbai has a migrant problem. The migrants are from faraway South America. And having arrived over two centuries ago, the water hyacinths are in no mood to relocate. They sprawl across the still waters. When in bloom, their pretty purple flowers and thick leaves make a trendy green statement. Legend has it that Lady Hastings, wife of India’s first governor-general, was among those seduced by the floating emerald isles. She rather fancied she could improve the aesthetics of lakes in India, and in a move fraught with historical repercussions, gifted the water hyacinth to our land. \nLittle did she realise that she was unlatching the gates to the world’s most invasive aquatic species. The water hyacinth is the botanical equivalent of a serial killer – stealthy, swift and pitiless. It overwhelms other plants by outpacing and outgrowing them. It sucks oxygen out of the water and rings the death knell for fish. \nIn dealing with unwanted plant and unloved flower, Powai Lake is not alone. Water bodies around the globe are similarly swamped, and authorities are testing out one desperate solution after another. In Kenya’s Lake Victoria, they tried to convert the plant to biofuel. In America, a political leader (no, not The Don) came up with the somewhat offbeat suggestion that hippopotamus be imported from Africa and prodded to eat the proliferating plant.\nIt’s not as if Powai is short of ideas. The lake is fringed with hot talent. A premier institute of technology is located on its banks, and on the other side is a company providing high-tech solutions to the nation’s key problems. But the lake’s woes remain intractable. Undeterred, Mumbai’s civic officials are waging an epic battle in the water. Last year municipal authorities claim they cleared nearly 6,000 metric tonnes of the plant through physical removal. Chemical solutions have also been tried, with no sustainable success. It’s not just a moving target that rescue teams are facing, but also a doubling one – plant population can increase hundred-fold within a month. Days after the crew heaves a sigh of relief at wrapping up a strenuous eviction campaign, hyacinths reappear as before. They smile brightly at the sun, serenely oblivious to all attempts at assassination. Phew, if only Lady Hastings had stuck to roses and crocuses.\n\n",
        "headline_1": "A botanical serial killer",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/a-botanical-serial-killer/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-05-2025"
    },
    {
        "full_article": "India recently had a small but important military operation called Operation Sindoor. It was a success, but it also showed something new: when India deals with Pakistan in a conflict, it’s not just fighting Pakistan—it’s fighting Pakistan + its powerful friends.\nHere’s what that means:\n1. Not Just Pakistan Anymore\n\nPakistan is getting a lot of help from other countries like China and Türkiye (Turkey).\n\nChina gives Pakistan 80% of its weapons, including missiles and air defence systems.\n\nTürkiye has sent hundreds of drones to Pakistan that were used to attack Indian military bases.\n\n\nSo now, India has to prepare not just for Pakistan’s strength, but also for the extra power it gets from these friends.\n2. India Must Upgrade Fast\n\nIndia’s military needs to become stronger quickly, not slowly over 20 years.\n\nRight now, India isn’t spending enough money on modern weapons and equipment.\n\nSome of the money India does spend goes to buying expensive stuff from other countries.\n\n\nWhat India really needs to do is:\n\nBuild more of its own weapons and systems.\n\nSupport Indian defence companies that can make high-tech tools for the army.\n\n\n3. Our Air Force Did Well – But Needs Help\n\nMost of the recent fighting was in the air. And India’s air defence systems did a great job!\n\nSystems like SAMAR and Akash, made in India, worked really well.\n\nThe S-400, bought from Russia, also helped a lot.\n\n\nBut there are some problems:\n\nIndia is supposed to have 42 fighter jet squadrons, but only has 31 right now.\n\nSome of our special radar planes (called AWACS) are getting too old.\n\nPakistan now has new Chinese fighter jets with powerful missiles.\n\nIndia’s plan to buy new multi-role fighter jets can’t be delayed any longer.\n\n\nIn Short:\n India now faces a “Pakistan Plus” problem — Pakistan plus China and Türkiye helping them with strong weapons. That means India has to upgrade its military faster, spend smarter, and build more of its own defence systems to stay ready and strong.\n\n",
        "headline_1": "India’s ‘Pakistan plus’ problem",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/indias-pakistan-plus-problem/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-05-2025"
    },
    {
        "full_article": "We are alarmed at the growing menace of teen gang violence in different parts of the country, especially in Manikganj where things have been particularly disturbing. According to some recent reports, clashes between teen gangs have become quite common in the district city and nearby regions. Just over the past month, there have been at least five violent incidents in the town, as per locals. For instance, about 30-40 members of teen gangs, armed with machetes and Chinese axes, ran amok on the streets last Tuesday, following what appeared to be an internal feud among the groups. Several students were injured. While police have made a number of arrests and filed cases in connection with these incidents, their lack of effect suggests that the root of the problem lies deeper—and reactive law enforcement alone cannot solve it.\nThese teenagers, mostly aged between 12 and 17, often come from lower- or middle-income families; some are school dropouts, while others are still enrolled but heavily disengaged from academic activities. Often, members of the gangs are seen roaming the streets, creating panic through open displays of weapons, engaging in turf wars, and harassing female students. Their involvement in drugs, \"senior-junior\" rivalries, and romantic disputes has also been reported. The teen gang culture is usually attributed to children's exposure to political exploitation during Awami League's 15-year rule, when Chhatra League formed its units even at the school level, drawing teenagers into street politics and creating a breeding ground for gang activities. Other political groups also provided patronage. That said, we must also acknowledge the influence of persistent social tensions and lack of parental supervision, which combined to create a climate where young minds easily find validation in violence.\nWhile the Awami League's fall on August 5 brought a temporary lull in the teen gang culture, it has surged again in recent months, with violent activities reported in Dhaka's Mohammadpur, Cumilla, and Chandpur of late. This suggests that successive political actors have been either reluctant to confront this issue or interested in exploiting it, as teen gangs—with their potential for street-level muscle—can be used to extend influence on the ground. And this situation, we fear, may worsen with the approach of the next elections.\nBut given its long-term effect on the future of the nation, it is vital that we address the teen gang culture with the seriousness it deserves. There is an evident need for awareness, especially of parents, as well as community support, safe and sufficient recreational spaces, and quality education for young men so that they can direct their energy to constructive things. Political parties also must stop providing patronage to teenagers for their own gain. We all must understand that we risk losing an entire generation to violence if we fail to act now.\n",
        "headline_1": "Stop teen gang violence in Manikganj",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/stop-teen-gang-violence-manikganj-3898346",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-05-2025"
    },
    {
        "full_article": "When my travel agent mentioned I'd see many BMWs in Dhaka, I pictured sleek German engineering. Three days into the visit, I finally understood his joke.\nMy introduction to Dhaka's transportation ecosystem began soon after leaving the airport. \"Don't worry about traffic laws,\" my driver cheerfully informed me, \"nobody else does!\" Already disoriented from the airport saga, I managed a nervous smile, unsure of what that meant. Ninety harrowing minutes and five kilometres later, I was no longer laughing.\nThe true kings of Dhaka's roads aren't the buses, cars, or traditional rickshaws—they're the battery-powered rickshaws that swarm the streets, moving in random directions, often whooshing past like shooting stars. These three-wheeled chariots race at an impressive speed of 30 kilometres per hour, occupying every available inch of space and favouring the central segment traditionally reserved for faster vehicles (lanes don't exist on Dhaka roads).\nAs a pedestrian, I am still learning what locals call \"rickshaw radar\"—a sixth sense that warns me when one of these sleek missiles is about to appear from thin air. Once, after carefully analysing the surroundings, I was crossing the road when one such rickshaw appeared from nowhere, almost breathing down my neck. I jumped aside, only to find that the vehicle, upon reaching the other side, turned around and crossed the road again, as if taking a thoughtful stroll in its backyard!\nThe simple act of exiting the car has become a heart-pounding adventure. You carefully open the door, scan in all directions, and still miss the super-rickshaw that whooshes past with mere centimetres to spare.\nWhat directional convention do they follow? I tried to figure that out, but had to give up. In all the countries I visited, vehicles typically follow predictable patterns—staying in lanes, signalling turns, and acknowledging right of way. Here, these omnipresent vehicles operate in four dimensions, appearing suddenly from the right, left, front, rear, and possibly alternate universes, usually without warning.\n\"But surely there are traffic regulations?\" I asked a colleague, who responded with laughter usually reserved for naive children. \"Look around you,\" he gestured broadly. \"Does this look regulated to you?\"\nHe had a point. What I witnessed wasn't traffic so much as a perpetual negotiation conducted through honks, near-misses, and what appears to be telepathy. How the residents of Dhaka arrive anywhere alive remains one of the great mysteries of the modern world.\nThe battery rickshaws themselves are a fascinating study in adaptation. Far from appearing primitive, many are equipped with sports-car-like digital displays, showing speed and battery levels. Some have bright LED lights, turn signals, and horns that could wake the dead. These aren't your grandfather's rickshaws—they're mini-vehicles with attitude.\nThis attitude extends to their drivers, who perceive traffic police as mere decorative suggestions rather than authoritative figures. Once, when an officer attempted to clear battery rickshaws from a congested intersection, he found himself surrounded by dozens of angry drivers. The resulting \"discussion\" sent him to the hospital with minor injuries and a major reassessment of his career choices. (His wife has since filed a divorce suit because she had married him for his \"authoritative status,\" which was now lost.)\nThese confrontations aren't isolated incidents. Battery rickshaw drivers have demonstrated an impressive ability for collective action. The upscale Gulshan neighbourhood recently attempted to ban these electric terrors from its main roads—a decision that sparked immediate outrage. Hundreds of furious drivers blocked access points to the area, creating traffic jams visible from the International Space Station. The police eventually dispersed them using methods I won't detail here, but the issue remains far from settled.\nWhat's remarkable is how Dhaka residents have normalised this daily ballet of near-death experiences. They navigate the chaos with an ease that suggests either Zen-like acceptance or complete fatalism. My local friends barely notice when I flinch at a rickshaw speeding by, close enough to count the driver's eyelashes.\n\"You'll get used to it,\" they assure me. I'm not convinced human beings should \"get used to\" traffic patterns that resemble a video game designed by sadistic nerds, but adaptation is apparently the only option.\nWhat about the mysterious BMW acronym that had me so confused? After several weeks in town, I learned it stands for \"Bismillah Motor Works\"—a local manufacturer that produces these zippy electric cuties. And why not? Many of their drivers wear denim and T-shirts from reputable brands and sport aviator sunglasses thanks to the byproducts of Bangladesh's apparel industry and counterfeit market.\nFor future travellers, I recommend excellent travel insurance, nerves of steel, and the acceptance that traffic rules are more like traffic suggestions—applicable only when convenient and generally ignored by the sleek BMWs of Bismillah Motor Works. They are a brilliant testament to Bangladesh's innovative minds. I only wish they followed predictable traffic rules!\nDr Sayeed Ahmed is a consulting engineer and the CEO of Bayside Analytix, a technology-focused strategy and management consulting organisation.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Not your average BMW: Decoding Dhaka's rickshaw kings",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/not-your-average-bmw-decoding-dhakas-rickshaw-kings-3898246",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-05-2025"
    },
    {
        "full_article": "It is encouraging that a Magura court has concluded the trial proceedings of a rape case in just 24 days after the trial commenced on April 23, 2025. Reportedly, the court sentenced 44-year-old Hitu Sheikh, the prime accused, to death for the rape and murder of his daughter-in-law's eight-year-old sister. However, three other accused were acquitted as the charges against them could not be proven beyond a reasonable doubt. That said, the surprising efficiency with which our judicial system worked in this case may serve as a model for future trials.\nAfter the verdict, the victim's mother was reported to have expressed disappointment over the acquittal of three accused, stating, \"They deserved punishment, as they assisted in the murder and concealed information.\" We hope proper justice will be served if or when the case is appealed, but for the moment, what we should take away from this case is the speed with which the trial was conducted. The same urgency should be applied to the many other rape cases pending in courts across the country. As a Supreme Court lawyer rightly pointed out, inconsistency in the pace of justice leads to disparity and undermines public confidence in the judiciary.\nAccording to the Human Rights Support Society, at least 6,305 women and girls were raped in the past five years. Despite this alarming rate, conviction remains extremely low. Of the 20,914 cases of violence against women and children filed through 14 one-stop crisis centres between 2001 and July 2024, only 1.48 percent ended in convictions. Currently, 101 Women and Children Repression Prevention Tribunals are handling such cases, with each burdened by an average of 1,500 pending cases. To address this backlog, more tribunals must be established. Additionally, we must protect victims and witnesses as they are sometimes pressured into withdrawing cases or settling out of court. The longstanding problems of faulty investigations and inadequate forensic facilities should also be addressed through institutional reform.\nIn our country, rape trials often drag on for years—even in lower courts. The swift verdict in the Magura case shows that timely justice is indeed possible. While we strongly support expediting investigations and trials, it is equally important that the process be thorough and fair. We urge the government to do everything in its power to ensure both speed and quality in justice delivery.\n",
        "headline_1": "Magura rape verdict shows swift justice is indeed possible ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/magura-rape-verdict-shows-swift-justice-indeed-possible-3898186",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-05-2025"
    },
    {
        "full_article": "We would like to draw the attention of the relevant authorities to the deepening water crisis across Khulna and its neighbouring districts. Reportedly, 85 percent of the 101,350 hand pumps in the Khulna division are non-functional, including 28,452 in Khulna district alone. The situation is similarly dire in Jashore, where two-thirds of the 24,303 tube wells are unusable.\nWith the vast majority of hand pumps in Khulna not working, people are being forced to travel long distances and queue for hours alongside hundreds of others to collect water. In some areas, the situation is so severe that only a single functioning tube well remains, serving as the sole safe water source for several nearby villages. In recent years, many previously functional hand pumps have dried up—a trend that appears to be accelerating. Experts and officials from the Department of Public Health Engineering (DPHE) attribute this crisis to excessive groundwater extraction, low rainfall, a lack of water retention structures, climate change, and increasing salinity intrusion. According to them, hand-operated tube wells stop functioning when the water table falls below 26 feet. When it drops to between 30 and 35 feet, even motor pumps fail to extract water. At those depths, only submersible pumps can draw water.\nAccording to the DPHE, the groundwater level in the Khulna region ranged from 18 to 22 feet during March and April of 2015-16. But today, it has dropped to between 24 and 32 feet in parts of the southwestern region. Similarly, the water level has reportedly fallen below 30 to 35 feet in areas of Jashore Sadar, Bagharpara, Jhikargacha, and Sharsha. Although submersible pumps are being installed in some of the worst-affected areas, and Tara No. 6 tube wells and centrifugal pumps are being deployed in places where the water level has fallen below 30 feet, the pace of implementation appears wholly inadequate. This indicates that the authorities have failed to grasp the severity of the crisis and the suffering of the people, which is unacceptable. It is high time the authorities addressed this growing crisis with the seriousness it demands, accelerating the installation of more advanced water pumps.\nAt the same time, it is important to recognise that the continued and rapid extraction of groundwater is completely unsustainable. Therefore, the government must not only prevent further damage to the region's water retention structures but also ensure their restoration. In collaboration with experts, it must identify and implement additional measures to address this crisis and guarantee long-term water security for the people in the region.\n",
        "headline_1": "Address Khulna’s deepening water crisis urgently",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/address-khulnas-deepening-water-crisis-urgently-3895991",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 20, 2025 00:00:00  \nDhaka City's chaotic transport operation has defied every attempt to rationalise and improve it. Now experts cite that mega projects have not been complemented by foundational improvement in bus service, pavements and signalling. So commuting in the capital city has failed to improve. Now the Strategic Transport Plan (STP)-2015 will not only undergo a revision but also require greater investment---in some cases more than double the original estimated expenditure. The 2025 STP rules out addition of any more Mass Rapid Transit (MRT) to the ones under construction or planned for Dhaka City. Instead, it puts emphasis on bus network, bus route rationalisation and traffic management. The 20-year plan for the city's transport operation will require an investment of $59 billion in place of $20.57 billion estimated under the 2015 STP.\nIf additional infrastructure development is not on the cards, why the expenditure will be three times the earlier estimated amount is somewhat intriguing. According to a report carried in the FE, the Bangladesh Road Transport Authority (BRTA) and the Dhaka Transport Coordination Authority (DTCA) will develop together vehicle inspection centres and bus fleets, upgrade depots and install intelligent transportation systems (ITS) under the World Bank-financed Bangladesh Clean Air Project phase-1. This may be part of the overall upgraded transportation because under the project, 500 electric buses are planned to be introduced from July 1 next. There is just a month before the likely introduction of electric bus but little, if any, infrastructure development is noticeable as yet.\nIf the electric buses form part of the bus-route franchise system, how the authorities propose to bring the bus companies under it needs to be cleared. Its latest attempt to rationalise bus routes and develop a franchise system for bus companies ended up in utter failure like its previous attempt to introduce Nagar Paribahan. Initially, the Nagar Paribahan made quite an impact but this time the move lost its way from the start in the face of stiff resistance from bus operators. Also, the memory of the authorities' failure to take the old and ramshackle buses off the road for dumping those into the junk yard is still fresh. How can the traffic system in Dhaka be streamlined without completing this basic task? Then, without addressing the problem arising out of the proliferation of motor cycles and battery-run rickshaws of all shapes and oddities, which have taken over the city like alien hordes, no improvement to the city's traffic system can be imagined. \nDhaka's traffic system calls for an overhaul, not just an upgrade. A city that is yet to put in place an effective traffic signal system cannot change itself overnight. Even the men and women in uniform regulating the traffic flow are dispensable if a modern and ITS management system can be introduced. But vigorous opposition is expected from the companies now operating their buses as erratically as they like. The Traffic Division of the Dhaka Metropolitan Police (DMP) and the bus operators have long colluded with each other to sustain the anarchic traffic system with the politicians also sharing the unclean profit. This nexus has to be busted before introducing any noteworthy system of traffic management. In the past many good initiatives were sabotaged before those could take roots. These issues have to be taken care of on a priority basis before starting the works of the traffic system's foundational tier.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Implementing Strategic Transport Plan",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/implementing-strategic-transport-plan-1747668129",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       May 20, 2025 00:00:00  \n\nJapan has long been one of Bangladesh's most dependable and consistent development partners. Since the latter's emergence as an independent nation in 1971, Japan has extended unwavering support to a broad range of sectors -- infrastructure, health, education, energy, and governance -- shaping much of Bangladesh's socio-economic progress. Today, as Bangladesh stands on the cusp of graduating from its Least Developed Country (LDC) status, the importance of deepening its bilateral relationship with Japan is more pressing than ever.\nA significant milestone in this enduring friendship is on the horizon. The upcoming three-day visit of Chief Adviser Professor Muhammad Yunus to Tokyo marks an important diplomatic engagement that is expected to yield major decisions aimed at further advancing Japan-Bangladesh ties. At a time when global alliances are being redefined and regional economic architecture is undergoing transformation, such high-level visits signal a renewed commitment to elevating bilateral cooperation to strategic heights.\nThe recent 6th round of Foreign Office Consultations (FOC) between the two nations, held in Tokyo, underscored the depth and breadth of this partnership. Japan reiterated its intent to deepen engagement with Bangladesh under the Bay of Bengal Industrial Growth Belt (BIG-B) initiative -- a visionary framework that seeks to integrate Bangladesh into regional value chains and catalyze industrial growth. By promoting high-quality infrastructure development and encouraging Japanese companies to establish manufacturing and production bases in Bangladesh, BIG-B has the potential to transform the country into a key economic hub in South Asia.\nThe alignment of this initiative with Japan's larger vision of a Free and Open Indo-Pacific is not only strategic but also timely. As geopolitical dynamics shift and regional economies seek greater interdependence, Bangladesh's geographical position as a gateway between South and Southeast Asia makes it an indispensable partner for Japan's Indo-Pacific aspirations. By reinforcing economic cooperation through BIG-B and other bilateral platforms, both countries are contributing to a shared vision of regional stability, open trade, and sustainable development.\nOne of the most noteworthy developments during the FOC was Japan's positive response to Bangladesh's request for Duty-Free Quota-Free (DFQF) market access for Bangladeshi products beyond the LDC graduation. This is a crucial consideration for our exporters, especially in the garments sector, who may face increased tariffs once Bangladesh transitions out of LDC status. Japan's willingness to consider continued DFQF access, along with improved entry for Bangladeshi fruits and vegetables, reflects its understanding of our developmental needs and its commitment to equitable trade relations.\nThe FOC also provided a platform for comprehensive discussions on an array of bilateral and multilateral issues, ranging from trade and investment to regional security and humanitarian cooperation. High on the agenda was the plight of the Rohingya population. Japan's continued humanitarian assistance and its support for the voluntary, safe, and dignified repatriation of Rohingya refugees underscore Tokyo's role as a responsible global actor. As the burden of hosting over a million displaced people continues to weigh heavily on Bangladesh, such international solidarity is both necessary and commendable.\nBeyond trade and humanitarian concerns, both sides explored avenues of cooperation in human resource development, energy transition, climate resilience, and disaster management. Japan's experience and technological expertise in these areas can significantly enhance Bangladesh's capacity to adapt to the challenges of the 21st century. Joint initiatives such as effluent treatment plants, solar power projects, and modernisation of shipyards are not merely development projects -- they are vital instruments for building a green, resilient, and inclusive future.\nThe discussions also touched upon the importance of cultural exchange, people-to-people connectivity, and educational cooperation -- areas that form the bedrock of long-term diplomatic ties. At a time when global politics is increasingly polarized, soft power diplomacy and mutual cultural appreciation serve as powerful tools to strengthen mutual trust and understanding.\nJapan's reassurance of support for Bangladesh's interim government and reform agenda is particularly significant. As the nation navigates complex governance and economic challenges, strategic partnerships such as this can serve as both a stabilising force and a source of inspiration. Japan's model of development -- rooted in innovation, discipline, and human capital -- offers valuable lessons for Bangladesh's own journey toward prosperity.\nFurthermore, Bangladesh has sought Japan's increased Official Development Assistance (ODA) in the form of concessional loans, extended repayment periods, and budgetary support. As the largest bilateral ODA donor to Bangladesh, Japan has consistently demonstrated its reliability. In this next phase of development -- which will involve major infrastructure modernization, digital transformation, and green transition -- continued Japanese assistance will be instrumental.\nIt is also worth noting that the two countries reaffirmed their commitment to multilateralism and shared interests in regional and global forums. In a rapidly changing world order, cooperative diplomacy is key to tackling shared challenges such as climate change, economic inequality, and security threats. Japan and Bangladesh, through their collaborative efforts, can be valuable contributors to a more inclusive and peaceful international system.\nAs the editorial team of this newspaper reflects on the evolving Bangladesh-Japan partnership, we are filled with optimism. The relationship between these two countries is not transactional; it is built on mutual respect, shared values, and a vision for a better future. The upcoming visit of Professor Muhammad Yunus to Tokyo is not just a diplomatic formality -- it is an opportunity to reaffirm our strategic alignment and to script a new chapter of deeper cooperation.\nIn the end, advancing Japan-Bangladesh ties is not just a foreign policy goal; it is a national imperative. In Japan, we find a partner that respects our sovereignty, supports our aspirations, and stands with us in times of need. As we look ahead, let us strengthen this friendship with renewed vigor, ensuring that our partnership continues to blossom for the benefit of both nations and the broader region.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Advancing Japan-Bangladesh ties",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/advancing-japan-bangladesh-ties-1747668179",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       May 20, 2025 00:00:00  \n\nFrequency of thunderstorms and their attendant lightning strikes are increasing globally and the culprit is global warming. The issue has been discussed multiple times on different occasions in the media. The fact that the country's peasants are dying in increasing numbers while working in their crop fields as they have no protection against thunderbolts is concerning. Mere discussion of the mortal threat they are exposed to, especially during the monsoon will not suffice. A report by the UN Capital Development Fund (UNCDF) published in early 2023 revealed some startling truths about how Bangladesh has become a global hotspot of lightning strikes. The report says, \"Bangladesh has one of the highest rates of death by lightning on the planet with over three hundred recorded fatalities in any one year, compared to less than 20 fatalities in the United States of America, which has almost double the population\". But the situation was not so critical in the past. The same UNCDF study adds that during the entire 1950s, only 37 people died by lightning strikes!\nAnother report published recently in a local daily says that the districts most prone to thunderstorms and lightning strikes are also the ones that are the major foodgrain producers. The districts include Sunamganj, Sylhet, Moulvibazar, Netrakona, Dinajpur and so on. A similar study on the danger that thunderbolts pose to the country's agricultural sector was done some years back by two researchers of the Khulna University of Engineering and Technology (KUET). They also came up with similar findings. Especially, April, May and June are the peak farming months when Boro rice is harvested and plantation of Aman starts. These are the two dominant varieties of rice in Bangladesh. Boro, a dry season rice dependent on irrigation, is grown between December and April, while Aman is broadcast or transplanted during the rainy season (July-November). Unfortunately, during these months, frequency of thunderstorms along with thunderbolts also increases significantly leaving the peasants quite unprotected from the unpredictable deaths from the sky. However, with modern-day advancements in meteorological science, it is possible to forecast which areas have the potential to form thunderstorms depending on the level of humidity in the air, the presence of hot air and factors causing to lift the hot air upwards. \nThese are the ideal conditions for creating thunderstorms. Since thunderstorms are the main sources of thunderbolts, it is possible to warn the inhabitants of particular areas where weather patterns bear the symptoms of thunderstorms brewing. But meteorologists cannot still locate exactly where a thunderstorm will form. Similarly, it is still beyond meteorological science to tell when and where lightning will strike. Though one cannot exactly locate where a thunderstorm would form or a lightning would strike, it is still possible to identify areas where thunderstorms are highly likely and warn people, especially farmers to keep indoors. In this connection, some developments have reportedly taken place with the support of the UNCDF. Lightning sheds, each 10 metres high and fitted with lightning rod on top for earthing of the electrical charge created in the thunderstorm have been built in some thunderstorm-prone areas. The haor area where the sheds are built at Rafinagar Union at Dirai in Sunamganj are meant for giving shelter to fishermen, many of whom died by thunder strikes while fishing. Notably, the lightning sheds have been built using concrete and are accessible from the ground level via concrete steps. These are two-storey structures and during the flooding seasons boats can be moored to the higher steps of the lightning shelters so fishermen/peasants can take shelter on the second floor of these structures.\nBut these lightning shelters are meant for haor areas in the northeastern districts of Bangladesh. What is necessary is to build more of the UNCDF-assisted lightning shelters across the country, especially for peasants in the rice growing districts. \nBut these lightning sheds are but a temporary answer to the issue. To assuage angry Nature, trees, especially tall trees, which are natural lightning arresters, have to be planted close to the crop fields. The government needs to take up a massive programme to this end.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Saving peasants from thunderbolts",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/saving-peasants-from-thunderbolts-1747668222",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 20, 2025 00:00:00  \n\nThe local pharmaceutical industry plays a vital role in a densely populated country like ours, generating approximately $3 billion in annual revenue. With nearly 99 per cent of the industry domestically owned, it boasts of a strong local foundation that fosters economic resilience and self-reliance. Pharmaceutical companies actively disseminate information about both new and existing products to doctors and the Directorate General of Drug Administration (DGDA), ensuring safe and effective use of medications across the country.\nThis sector significantly supports the healthcare system through initiatives such as doctor training, internship opportunities, research and development, and sponsorship of seminars and professional meetings for specialised physicians. These efforts not only contribute to the continuous education of medical professionals but also promote collaboration and knowledge sharing across the healthcare sector. In many cases, pharmaceutical companies also provide essential medical instruments-such as stethoscopes, surgical kits, and blood pressure monitors-to healthcare practitioners, improving their diagnostic and treatment capabilities, especially in underserved areas.\nThe pharmaceutical sector is continually enhancing its research capabilities and adopting cutting-edge technologies-such as biotech advancements and digital health tools-to stay competitive on a global scale and meet the evolving needs of patients and healthcare providers alike.\nRafid Alam\nJr Officer, SFE\nAristopharma Ltd\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Importance of local pharma industry",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/importance-of-local-pharma-industry-1747668246",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-05-2025"
    }
]