[
    {
        "full_article": "Filing frivolous cases against publications and summoning journalists without proper investigation or perusal of material evidence have become a part of the police playbook in States ruled by vindictive politicians who brook no criticism. The Assam Police’s decision to reportedly summon the founding editor Siddharth Varadarajan and consulting editor Karan Thapar of The Wire under Section 152, among others, of the BNS, is yet another case of the state trampling on press freedom. The fact that the summons were issued by the Guwahati Crime Branch to the journalists in a fresh sedition FIR on the same day, August 12, 2025, when the Supreme Court had issued notice on The Wire’s petition challenging the constitutional validity of the new sedition law (Section 152) and had protected them from any “coercive action” by the Assam Police, makes these actions egregious. The summons, apart from another one related to a case registered at the Morigaon Police Station, seem to pertain to a report in The Wire on Operation Sindoor. The Wire has also pointed to other disturbing issues — the summons do not carry the FIR date or provide any details of the alleged offence or include a copy of the FIR — all of which are mandatory according to the BNSS sections associated with the summons. In addition, keeping the FIRs secret and not mentioning the reasons for the summons hint at police intimidation.Critics of Section 152 had rightly feared that it was a rebranded version of the colonial-era sedition law, whose cases the Court had kept in abeyance in 2022. Section 152 has even more expansive and dangerous provisions, setting the bar much lower for prosecution than the previous sedition law. Terms such as “knowingly” could allow for prosecution even where there was no malicious intent to cause harm, unlike Section 124A’s strict requirement to prove clear intent to incite disaffection. The vague language around “sovereignty, unity, and integrity of India” provides dangerous latitude to law enforcement agencies. Even legitimate acts such as criticism of government policy could be construed as “endangering unity”. Without clear definitions or safeguards, Section 152 can target individuals for merely expressing opinions that authorities deem threatening. This law’s invocation against journalists questioning government narratives creates a chilling effect on press freedom. The Court’s intervention in The Wire’s case, to examine Section 152’s constitutional validity while protecting journalists from coercive action, acknowledges the potential for abuse. However, the Assam Police’s defiant response suggests that without stronger judicial oversight and clearer guidelines, Section 152 will continue to be weaponised against dissent. The onus now lies on the Court to recognise the unconstitutionality of the sedition laws, in their earlier form or rebranded, which have no place in a democratic society. Published - August 20, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        police\n                    \n                            /                      \n                        \n                        Guwahati\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        investigation\n                    \n                            /                      \n                        \n                        Assam\n                    \n                            /                      \n                        \n                        media\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025",
        "headline_1": "​Sedition redux: On trampling on press freedom",
        "headline_2": "New sedition law threatens freedom of expression further",
        "link": "https://www.thehindu.com/opinion/editorial/sedition-redux-on-trampling-on-press-freedom/article69952849.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-08-2025"
    },
    {
        "full_article": "The unprecedented multilateral summit at the White House on Monday (August 18, 2025) between U.S. President Donald Trump and a host of European leaders, including Ukraine President Volodymyr Zelenskyy, just after Mr. Trump’s meeting with Russian leader Vladimir Putin in Alaska on Friday (August 15, 2025), points to a renewed willingness on all sides to end the Ukraine war. The Alaska summit marked a new start in Mr. Trump’s push for conflict resolution, although it did not yield an immediate breakthrough. While Mr. Trump invited Mr. Zelenskyy to the White House to discuss ‘the Putin proposal’, European leaders, including the British Prime Minister, France’s President and the chiefs of the European Commission and NATO, also travelled to Washington, in a strong show of solidarity with Ukraine. Mr. Zelenskyy’s visit to the White House, in February, had gone poorly. This time, Mr. Zelenskyy and his European allies were careful not to upset their host.The message from Europe is clear: irrespective of Washington’s position, Europe is firmly committed to Ukraine’s security. But European leaders also recognise that they lack the capability to continue to back Ukraine in a war it is not winning should the U.S. cut off its weapons supplies to Kyiv. So, the challenge before the French and British leaders was to persuade Mr. Trump — he has already ruled out NATO membership for Ukraine — to offer some form of American support for security guarantees to Ukraine as part of a final settlement. Europe has already begun planning to send a “reassurance force” to Ukraine. Mr. Trump’s comments signalling support for the idea of security guarantee were a small but significant breakthrough. He said Europe would be “the first line of defence” but did not rule out American involvement, adding that Mr. Putin would accept western security guarantees for Ukraine. The next big question is on where to draw the ceasefire line. Mr. Putin wants all of Donbas and is willing to freeze the frontline in the south. Mr. Zelenskyy and his European partners have so far ruled out any territorial concessions for peace, but all sides are ready to continue the talks. Mr. Zelenskyy should adopt a pragmatic approach, weighing Ukraine’s future security against its present battlefield vulnerabilities. Mr. Putin should realise that this may be his best opportunity to end the war that he launched in February 2022. Mr. Trump and the European leaders must now work towards a compromise formula that addresses Ukraine’s future security needs and Russia’s past grievances. The current momentum for peace should not be squandered.\r Published - August 20, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        summit\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Europe\n                    \n                            /                      \n                        \n                        Ukraine\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        France\n                    \n                            /                      \n                        \n                        Germany\n                    \n                            /                      \n                        \n                        NATO\n                    \n                            /                      \n                        \n                        defence equipment\n                    \n                            /                      \n                        \n                        peace negotiations",
        "headline_1": "Peace momentum: On the White House meetings and the Ukraine war",
        "headline_2": "Ukraine needs to see its future security in the context of its battle losses",
        "link": "https://www.thehindu.com/opinion/editorial/peace-momentum-on-the-white-house-meets-and-the-ukraine-war/article69951960.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-08-2025"
    },
    {
        "full_article": "Only a few things are for certain in India: that the price of onions will rise before an election, that an India-Pakistan match will be described as ‘more than cricket’, and that elections will never be held in monsoon. The calendar is ruthlessly clear: Our great democratic extravaganza unfolds in the comfortable shades of spring or winter. By June, when the clouds gather and the first raindrops hit, the ballot boxes are already tucked away. Coincidence? Hardly.\nIt’s not that the Indian monsoon is apocalyptic. It is not a Katrina, a Harvey or a typhoon with a Viking name. In fact, in most places the rain is oddly well-behaved. It arrives roughly on schedule, cools the earth, restores groundwater and gives farmers reason to exhale. But let it rain for two hours in Gurgaon and suddenly the Millennium City looks like an audition tape for Atlantis. Cars bob like half-hearted gondolas, office towers turn into aquariums, and WhatsApp fills with memes of corporate executives rowing to work.\nThe problem isn’t that the rain is catastrophic. The problem is that it is revealing.\nRead more on TOI+\n\n",
        "headline_1": "Of rains and votes",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/of-rains-and-votes/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-08-2025"
    },
    {
        "full_article": "Two recent acquittals have become part of a provocative discourse in India. First, on July 21, a division bench of the Bombay high court, in a 671-page ruling, overturned the 2015 MCOCA sentencing for the 7/11 serial train blasts, which had horribly torn up Mumbai in 2006.\nSecond, on July 31, an NIA court in Mumbai, after a protracted trial, acquitted all the accused in the 2008 Malegaon bomb blast case.\nThe key similarity in both acquittals is that the prosecutions failed to discharge their duties in establishing the offences beyond reasonable doubt. And then there are glaring dichotomies, which are of grave significance too.\nRead full story on TOI+\n\n",
        "headline_1": "A tale of two acquittals",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/a-tale-of-two-acquittals/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-08-2025"
    },
    {
        "full_article": "Sumit Paul\nThis is my simple religion. There is no need for temples, no need for complicated philosophy. Our own brain, our own heart is our temple; the philosophy is kindness.” – Dalai Lama.\nAug 19 is commemorated as World Humanitarian Day. While acts of humanity, sensitivity, empathy and camaraderie cannot be squeezed into just a specific day, this day reminds us of humanity’s shared destiny on earth. An individual can live fully only when he rises above individualistic concerns to broader concerns of all humanity because life’s most urgent question is, ‘What are you doing for others?’ This is the crux and purpose of human existence: What are we doing for others?\nRemember, the two most important days in the lives of all of us are the day we’re born and the day we find out why? Because it’s not enough to be just a human. We must exercise our humaneness and empathise with all. Service to others is the rent we pay for our room here on Earth. The Upanishadic concept of Vasudhaiv Kutumbakam – the world is a family – is not utopian or quixotic. The thread and spirit of humanity and empathy run through all souls and all individuals.\nIf our souls aren’t stirred by what’s happening in Gaza, Ukraine, Afghanistan and many parts of the world, we’re dead souls of Russian author Nikolai Gogol’s novel. Jalaluddin Rumi says in Dari (Afghan variant of Persian), “Kaz min anfaas nee insaan,” – just to breathe doesn’t make us a human. To be human, you must be humane and adopt a humanitarian approach and attitude towards all beings, not just humans.\nIt’s worthwhile to mention that in Islamic mysticism and spirituality, tasawwuf, there’s a subtle difference between aadmi and insaan . The former is one who breathes – jo’dam’le woh aadmi – the latter is endowed with Uns – universal love; Agape of Christianity, Uns or Unsiyat is Arabic for love. Jis mein Uns ho woh insaan hai . We can all experience love, no matter who we are or where we come from. No matter our differences in background, culture, or beliefs, love connects us all.\nIt is a powerful force that unites people from all walks of life and brings communities together in times of joy and sorrow. Love transcends boundaries and reminds us of our shared humanity, making it the most precious and enduring aspect of the human experience. Whether it is love for family, friends, or even strangers, it is the common thread that weaves us all together in a world that can often feel divided.\nAn individual’s humanity and humaneness can bring about a universal change. This is humanitarianism. In these uncertain and gory times when mankind is beleaguered, even the smallest act or deed of love and empathy can make a difference. Urdu-Persian poet ‘Nashtar’ Nishapuri said, “Ya toh har chehra muskuraye ya phir har chehra ro de/Jazbaat sab ke ek se hon, sabhi saath hansein, sabhi saath royein” – Every face should either smile or cry/ Feelings of all should be the same; all should smile and cry in unison. Let us act right now.\n\n",
        "headline_1": "Let’s make the world a humane place",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/lets-make-the-world-a-humane-place/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-08-2025"
    },
    {
        "full_article": "Talks end in no ceasefire, no peace agreement\nIt is impossible to win an argument with Kamala. Even when she is obviously in the wrong, she will sit me down like in a press conference and explain how I am actually responsible. And she can be very convincing. ECI should recruit her in its defence. Putin and Trump could also benefit from her negotiating skills. Every person in the room listening to her version of the story would be certain she was an innocent victim who did not deserve to be blamed.\nIt all started with a wedding on her side of the family. I went along dressed up in a bandgala, determined to keep my mouth shut. Her family politics is more complicated than the Russia-Ukraine war. There are uncles who will not speak to us, and aunties who may smile at us but are not to be spoken to. Everyone knows the old Thaatha sitting in the front row is the root cause of the conflict, but no one says so. Kamala left me stranded in the middle of this war zone and wandered off cheerfully to a group of matriarchs fussing over the bride’s jewellery.\nThe inevitable happened. An uncle walked up and enveloped me in a bear hug, the kind politicians use on the world stage. ‘You know me…I’m Piyush Uncle. I stayed in the house behind yours!’ A population of more than 1.4 billion could hold many people named Piyush. There could be eighty people living in the same house and their house numbers could all be zero. Their father’s name could be fcdpg for all I cared. Even a PowerPoint presentation could not make things obvious for me.\nHe began talking about his share of the ancestral property and I could see that I was being projected onto the big screen and Kamala had noted my discomfort. She swooped down and removed me from the scene like a street dog from Delhi-NCR. ‘Why are you talking to that man!’ she hissed at me angrily. Apparently he belonged to that side of the family that had encroached on the family property decades ago. I was summoned by the old Thaatha in the front row who attempted to broker a ceasefire. Or at least a peace agreement.\nEveryone huddled together and discussed matters seriously. Nothing seemed to change but someone was being nominated for the Nobel Peace Prize. Now Kamala insists I take an oath never to speak again in public or to submit a written apology. I elect to maintain a stoic silence. I have been commissioned as a husband to do so.\n\n",
        "headline_1": "Family war zone",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/family-war-zone/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 20, 2025 00:00:00  \nMany existing laws of Bangladesh area legacy of the long past colonial era. Those include the penal code, civil and criminal procedural codes, contract law and company law. Though there is a single bench in the High Court Division of the Supreme Court dealing with maritime law, there is no special court system dedicated, for instance, to resolving commercial litigations. Against this backdrop, Bangladesh is going to have its first dedicated commercial court system. In this connection, Chief Justice Syed Refaat Ahmed informed the Press following a seminar held recently that valuable inputs in this regard have been obtained from the development partners, legal professionals, academicians and the business community. So, it is expected that based on those agenda, the final draft of the Commercial Court Ordinance 2025 would be prepared soon and submitted to the government for its implementation.\nThe need for commercial courts that offer a specialised mechanism for resolving business disputes efficiently cannot be overstated. For those are vital for increasing investor confidence to ensure more foreign investment in the economy with attendant economic growth. In fact, the traditional courts are overburdened with a large number of cases still pending. This causes inordinate delays in resolving disputes relating to trade and commerce. On this issue, it could be leant that as of March 2025, more than 25,000 loan recovery cases under the Artha Rin Adalat Ain (Money Loan Court Act), or Act, for short, remain unresolved. Notably, the said Act was enacted in parliament in 2003 by repealing the previous Artha Rin Adalat 1990, especially to expedite recovery of defaulted loans with banks and other financial institutions. In exercise of the Section 4 of the Act, the Money Loan Courts (MLCs) were established to handle cases involving loan defaults. Obviously, the objective was to reduce the backlog of such financial disputes so that the efficiency of the financial institutions in question could be improved. But seeing that the MLCs are still burdened with such a huge number of pending cases, thanks to defaulting borrowers' filing writs in the HC to contest those and often obtaining stay orders in their (loan defaulters') favour, the justification for reforming the prevailing financial dispute resolution system hardly needs further explaining.\nHence is the move for establishing commercial courts, of which the key pillars would include summary judgments to discourage frivolous cases, a two-tier threshold system to improve Small and Medium Enterprises' (SMEs') accessibility and structured settlement mechanisms. There is no question that the Draft Commercial Court Ordinance reflects a strong commitment to establishing a new covenant between commerce and justice towards speedy delivery of justice, introduction of expertise in handing disputes relating to finance, trade and commerce and ensuring integrity of the justice delivery system. It is reassuring that the development partners including the United Nations Development Programme (UNDP), the European Union (EU) and others have extended support and provided valuable inputs in framing the draft commercial ordinance. It is hoped that such cooperation from all quarters concerned would continue to develop a robust and efficient commercial legal system here.\nWhile appreciating efforts towards building a dedicated legal framework for expeditious resolution of disputes of commercial origin, a word of caution is necessary. It is that laws are framed often with the best of intentions. But history provides ample proof that good laws in themselves are no guarantee for getting the intended positive changes in a system. As always, it is the execution of the laws and the political will behind it that ultimately matter. So, the emphasis should be on building the necessary political consensus for the Draft Commercial Court Ordinance 2025 implementable and effective.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Commercial Court  Ordinance not just  another law",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/commercial-court-ordinance-not-just-another-law-1755615978",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       August 20, 2025 00:00:00  \n\nFor decades, policy circles and industry stakeholders have repeatedly stressed the need for reforms and diversification to rejuvenate the country's readymade garment (RMG) exports. Reforms essentially imply structural changes in production and operations, with a strategic shift from low-end, mass-volume products to high-end or semi-high-end categories that effect higher value addition. Diversification, on the other hand, refers not only to broadening the range of apparel products but also to extending export reach beyond the conventional markets of North America and the European Union. Although some progress has been made on both fronts, the pace has been far slower than the required. In today's rapidly changing global trade dynamics -- especially involving apparel exports -- the challenges are more complex than they were a decade ago, forcing Bangladesh at a crossroads.\nDespite the difficulties, optimism persists that Bangladesh can still make a transitional leap in apparel exports. A recent diagnostic report prepared jointly by the World Bank, the International Finance Corporation, and the Multilateral Investment Guarantee Agency highlights this potential. According to the report, Bangladesh's RMG sector could generate as much as US$94 billion in annual export earnings by 2029, provided that the industry actively expands into non-traditional markets and embraces manmade fibre (MMF) production in a big way. Achieving this ambitious target would require sustaining an average annual growth rate of 15 per cent -- a formidable challenge that demands wide-ranging, coordinated reforms across trade policy, industrial operations, and financial systems.\nThe report also identified four sectors in Bangladesh with the highest growth potential where private investment could play a transformative role. These include the RMG, middle-income housing, domestic production of textile dyes and paints, and digital financial services. The findings also shed light on broader concerns such as foreign direct investment (FDI) trends, the overall business climate, and cross-cutting regulatory bottlenecks that hinder private sector growth. The clear message is that while Bangladesh's growth prospects remain bright, achieving them will require regulatory clarity, accelerated digital transformation, and establishment of a more inclusive and investment-friendly climate.\nThe United States, Bangladesh's single largest apparel export destination, is likely to play a particularly pivotal role in this anticipated prospect. Recent tariff actions by the US, targeting multiple countries including some of Bangladesh's competitors, carry important implications for Bangladesh's RMG exports. The US tariffs are largely aimed at curbing Chinese exports. Consequently, many American apparel brands and retailers are now adopting a strategy of geographical diversification in sourcing to reduce over-dependence on China. Rising tariff rates on Chinese apparel and the intensifying strategic rivalry between Washington and Beijing have prompted several leading US fashion companies to scale down their sourcing from China -- some planning to reduce it to single-digit percentages, and others even considering moving out of China altogether.\nThis geopolitical and trade reorientation presents Bangladesh with a unique window of opportunity. With China's declining market share in the US and the search for alternative sourcing bases, Bangladesh could secure a larger slice of the American apparel market. The numbers tell the story: China's share of the US apparel import market dropped from 37.7 per cent in 2013 to 21.3 per cent in 2023. During the same period, Bangladesh's share rose from 6.0 per cent to 9.0 per cent. Vietnam has also been a major beneficiary, expanding its share from 10 per cent to 17.8 per cent. India, Cambodia and Pakistan, too, recorded modest gains. Clearly, the global sourcing map is shifting and Bangladesh stands to benefit if it can position itself strategically.\nThe critical question, however, is whether Bangladesh is ready to seize this opportunity. Industry insiders point out that despite clear signals of shifting demand, fresh investment to expand production capacity -- especially in MMF-based and other high-value apparel items -- has been limited. The country still depends heavily on imported raw materials for producing value-added garments, particularly MMF-based products. Without building domestic capacity in this area, Bangladesh risks missing out on lucrative future orders. Moreover, structural challenges such as energy shortages, rising utility costs, and persistent logistics bottlenecks continue to undermine the country's competitive edge.\nLocal exporters, however, remain cautiously optimistic. They argue that with its existing scale and experience, Bangladesh already has the capability to absorb some of the work orders likely to be diverted from China. The competitive edge lies in cost efficiency, skilled workforce, and a strong reputation as a reliable supplier. But for this to translate into long-term market resilience, the country must urgently address its internal weaknesses. Expansion of investment in MMF production, reliable energy supply, upgrading of port and transport infrastructure and removal of bureaucratic bottlenecks are the key imperatives.\nAnother important trend is the pricing strategy of US fashion companies. Even amid rising costs from tariffs and supply chain adjustments, these companies have largely avoided widespread retail price hikes. Instead, they have absorbed some of the cost pressures internally while maintaining their sourcing diversification strategy. This signals that buyers are looking for competitive suppliers who can ensure flexibility, speed and quality without significantly raising end prices. Bangladesh's ability to align with this evolving buyer preference will be decisive in slicing greater market shares.\nIndustry leaders repeatedly emphasise that a strategic shift from low-end to high-value apparel is no longer optional but essential. Bangladesh must move beyond being predominantly a producer of basic garments to one that specialises in design-driven, technologically advanced, and higher-margin items. At the same time, exploring new and emerging markets outside the US and EU is crucial. Countries in East Asia, Latin America, and Africa represent untapped potential that could further diversify Bangladesh's export portfolio and reduce dependence on a few large markets.\nThe pathway to revamping Bangladesh's RMG sector lies in a dual strategy of reforms and diversification. Reforms must focus on upgrading the industry to produce more high-value products supported by stronger backward linkages in MMF and other inputs. Diversification must go beyond products to include new markets. The opportunities created by the shifting global trade dynamics are real, but seizing them will require vision, investment and matching strategic policy.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Reforms and diversification key to boosting RMG",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/reforms-and-diversification-key-to-boosting-rmg-1755616022",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 20, 2025 00:00:00  \n\nArtificial Intelligence is transforming creativity on a global scale, challenging the traditional boundaries between human imagination and machine capability. From composing music and writing novels to designing fashion and visual art, AI systems are now active participants in creative processes. This shift raises a critical question: will AI enhance human creativity, or will it replace it?\nAI can generate ideas, suggest alternatives, and optimise designs at speeds no human can match. Yet creativity is more than patterns and probabilities, it is emotional resonance, cultural context, and lived experience. A machine may produce a technically perfect painting, but it cannot convey the subtle history, emotion, or perspective embedded in human art. The real value lies in collaboration: humans guiding AI to expand possibilities while retaining originality and meaning.\nGlobally, businesses and content creators face a challenge: integrating AI tools without letting algorithms dominate creative decision-making. Policies must ensure intellectual property rights, ethical use, and recognition of human contribution. Education systems should teach AI literacy alongside critical thinking, so the next generation can collaborate with technology rather than compete with it.\nThe future of global creativity does not belong solely to humans or machines, it belongs to those who can blend both thoughtfully. How humanity navigates this balancing act will define the next era of art, business and culture.\nYana Islam Rifa\nBachelor of Business Administration \nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "AI and the future of creativity",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ai-and-the-future-of-creativity-1755616043",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 20, 2025 00:00:00  \n\nOnce upon a time, leisure for young people meant reading books, playing cricket, or chatting with friends. Today, it is dominated by mobile phones, especially short video content on TikTok, Instagram Reels, YouTube Shorts, and Facebook Reels. What began as harmless fun has now become a dangerous addiction.\nThese platforms are designed for endless scrolling. One video ends, another appears instantly, trapping users in a dopamine-driven cycle of \"just one more.\" Many university students now admit they cannot fall asleep without scrolling reels for hours. This is not entertainment anymore, it is addiction.\nThe impact is visible in education and career preparation. Students often waste two to three hours daily on short videos, leading to poor concentration, declining grades, and loss of valuable study or skill-building time. In the long run, this habit threatens their professional future.\nEqually concerning are the effects on mental health. Young people fall into comparison traps, measuring their worth against others' \"perfect\" online lives. Instant gratification makes real-life challenges feel boring, while low engagement with their own content can trigger anxiety and depression. Social isolation is also growing, as conversations and family bonding are replaced by reels and trends.\nPhysical health is at risk too. Constant screen time causes eye strain, headaches, and back pain. The World Health Organization reports that teenagers spending over four hours a day on screens show a 30 per cent drop in physical activity-raising risks of obesity and heart disease.\nThis problem is not limited to teenagers; even adults are affected. But the danger is most severe for the youth, whose education and career years are being consumed by endless scrolling.\nTo address this, awareness and discipline are essential. Parents and teachers must guide young people, while schools should introduce digital literacy to promote balanced technology use. Alternatives like reading, sports and skill-building should be encouraged.\nShort videos can be a source of fun and even learning, but when addiction takes over, they damage studies, health and relationships. The youth are the future of Bangladesh; they must learn how to balance before the screen steals their potential.\nArshie Akter Sunny\nMass Communication and Journalism\nJagannath University\narshieakter205@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Addiction to short video content",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/addiction-to-short-video-content-1755616066",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-08-2025"
    }
]