[
    {
        "full_article": "The Supreme Court, in quashing the Delhi High Court’s orders against Wikimedia to take down a Wikipedia page on the basis of a defamation case filed by the news agency, Asian News International (ANI), has set right an error by the High Court. A High Court judgment, passed on April 2, 2025, allowed the taking down of the Wikipedia page by saying that the statements were defamatory and were not a verbatim reproduction of the text in the references that it quoted; that the references were themselves “editorials” or “opinionated articles” and that being an encyclopaedia, Wikipedia carried a “higher responsibility”. The reasoning is problematic as the references are based on long form reporting and quotes from independent investigators, and are not “opinions” or “editorials” as the High Court made them out to be. The Court has clearly differed with the High Court’s reasoning by observing that the takedown order was based on too wide a prayer, and noted that the directions to remove all false, misleading and defamatory content were too broadly worded. The Bench has now directed the news agency to make a fresh plea to the High Court pointing out specific portions to be removed from the webpage. The fact that Wikipedia is an Internet intermediary which enjoys safe harbour provisions as the content creation and moderation are handled by users of its site should suggest that any wide-ranging takedown order could punish the very model on which the encyclopaedia operates.Wikipedia is a community-driven encyclopaedia freely available on the Internet and is maintained by volunteers across the world. Even if the quality of articles is not uniform, their editors generally include experts and Wikipedia allows users to edit the content provided they stick to site guidelines. Disputes on content leading to “editing wars” are generally resolved by discussions on the page and measures such as placing the page on “extended confirmed protection” or “full protection”, allowing only “extended confirmed users” for the former and administrators for the latter to make changes. These users are not selected by Wikimedia but elected by community members based on their prior editing activity and reputation. These processes have ensured a significant degree of reliability on the encyclopaedia, even as it has become a repository of more than 62.95 million articles in over 350 languages. In asking for the takedown of articles by interpreting critical information as defamation and by even threatening penal action against Wikipedia, judicial actions could unwittingly lead to the stifling of open discussion of entities on the encyclopaedia, thereby acting against the interest of the free flow of information.\r Published - April 19, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        internet",
        "headline_1": "A welcome move: On Wikipedia and Supreme Court order",
        "headline_2": "Arbitrary takedown orders on Wikipedia will stifle free flow of information",
        "link": "https://www.thehindu.com/opinion/editorial/a-welcome-move-on-wikipedia-and-supreme-court-order/article69465732.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-04-2025"
    },
    {
        "full_article": "President Donald Trump’s threat to revoke the tax-exempt status of Harvard University as an educational institution will have far-reaching consequences not only for the wider student community but also for corporate America and the military-industrial complex. The administration also indicated that it would block the admission of foreign students, who make up nearly a third of Harvard’s student body. The university has refused to accept intrusive federal government control over its activities based on the premise that the government is providing hefty grants. The ostensible reason for the Trump administration’s move is the so-called “leftwing, antisemitic” protests against the Gaza War that broke out at Harvard and Columbia, which have the image of being left-liberal. The Trump administration seems to be playing to its ‘Make America Great Again’ (MAGA) base which has nursed historical grievances against northeastern elites and their universities, exemplified in the Ivy Leagues. These institutions are indeed elite in terms of academic standards but Harvard admits students from a socio-economic spectrum through generous scholarships. The Trump administration opposes Diversity, Equity and Inclusion principles ideologically and Harvard could also have been targeted for this reason. But Harvard has deep pockets and has heft in the corridors of power to outlast Mr. Trump.Mr. Trump’s slashing of government research funds has also affected several public universities, including in deep-red States such as Alabama. Public universities, barring a few such as in Michigan, Texas, and California that have built a sizeable endowment, depend on state support and are under increasing political control. America’s government-induced crisis in higher education threatens a key edifice of American strength and power. It strikes at a long-standing belief in that nation, which is borne out by data, that getting a college degree is a surer path towards prosperity. Mr. Trump, formerly a Democrat, is only part of a long-term global mega-trend in politics. The big picture is that America is only a late entrant in defunding public higher education. The U.K., under Margaret Thatcher, was an early starter. India joined the stream long ago with the NDA government only deepening the cutbacks. Australia, Singapore, Germany and the Scandinavian countries are holding out among the developed nations. It is no coincidence that China’s ascent has paralleled continued public funding of higher education. Much like the U.S. universities of the past, Chinese higher education institutions are building a knowledge base on other nations and regions. Future generations of Americans will see this as a self-inflicted wound. Published - April 19, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        university\n                    \n                            /                      \n                        \n                        students\n                    \n                            /                      \n                        \n                        higher education\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        research\n                    \n                            /                      \n                        \n                        finance (general)\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        Singapore\n                    \n                            /                      \n                        \n                        Germany\n                    \n                            /                      \n                        \n                        China",
        "headline_1": "​Self-inflicted wound: On higher education and Trump administration’s move",
        "headline_2": "The U.S. stands to lose a lot by defunding higher education",
        "link": "https://www.thehindu.com/opinion/editorial/self-inflicted-wound/article69465200.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-04-2025"
    },
    {
        "full_article": "Investors dread greedy, crooked startup founders\nAnother one bites the dust. The startup business is nine parts risk, maybe more. Anecdotally, over 90% of restaurants in India shut down within 18 months. ‘Real’ startups, the ones whose staff – in popular imagination – codes on tablets sitting in cafes, also have a 90% failure rate globally. It could be bad luck, or bad service, or a horribly stupid idea like ‘Juicero’. They made a $400 Wi-Fi-connected juicer, raised $70mn, and became a Silicon Valley darling until somebody showed you could extract the same amount of juice with your bare hands, faster.\nBluSmart wasn’t a stupid idea, though. It was an electric cab service without surge-pricing and last-minute ride cancellation. People in Delhi-NCR, Mumbai and Bengaluru liked it. What broke it was the original sin of business – promoter greed. A cookie seller keeps his hands out of the cookie jar, but BluSmart’s Jaggi brothers thought nothing of helping themselves to borrowed funds at their parent firm, Gensol. Altogether some 262cr hasn’t been accounted for. But their purchase of a premium Gurgaon apartment with company funds is talk of the town now.\nLenders, drivers and customers with money stuck in BluSmart wallets have become collateral damage, but India’s startup scene is also tarnished. Commerce minister Piyush Goyal feels, with some justification, Indian startups aren’t enterprising enough – fixated on ice cream delivery rather than AI foundational models. Investors have other reasons to worry. There’s been a spate of big-name scandals. BharatPe, GoMechanic, Mojocare, Paytm and others have been in regulatory crosshairs. The fall of Byju’s – valued at $22bn in 2022, now worthless and sued for $533mn in US – is the most glaring. While investors can forgive bad ideas – Juicero – what they detest is deceit, a la Elizabeth Holmes of Theranos, and now the Jaggis.\n\n",
        "headline_1": "Straight up fraud",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/straight-up-fraud/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-04-2025"
    },
    {
        "full_article": "His influence is reason Beijing wants to pick his successor\nHistory is not a political project written in the present, Dalai Lama reminds Beijing, and the free world, in Voice for the Voiceless: Over Seven Decades of Struggle with China for My Land and My People. That said, commitment to a mutually beneficial relationship would mean “there’s no need to insist the two parties agree on exactly the same version of the past.”\nIt’s been 75 years since China invaded and annexed Tibet. Tibetan Buddhism’s spiritual head turns 90 in July. The hot question is who’s his successor? He/she’ll be from the free world, says Dalai Lama. In a cruel twist, the ‘leader’ of this ‘free world’ recently created a more immediate problem for Tibet’s govt-in-exile. It froze USAID funds.\nFrom his first encounter, as a hopeful teenager, with Mao Zedong to his expectations of Deng Xiaoping (who said “except for independence, everything is negotiable”), to Tibetan govt-in-exile’s last exchange in 2010 for Tibet’s self-rule, not independence, the book lays out both the road travelled and a roadmap ahead for the Tibetan struggle. The basic point: “The simple truth is no Tibetan will ever say, ‘I am a Chinese’.”\nThere have been no formal talks since 2010. A meeting with Xi during his 2014 trip to India didn’t materialise. Dalai Lama had hopes from Xi as “the most powerful Chinese leader since Deng Xiaoping”. That “he’d seize the opportunity for a bold vision (for) Tibet…Xi had made positive remarks about Buddhism (in Paris).”\nThe monk was told Xi’s mother was a practising Buddhist, and, he had met Xi’s father, who had opposed the Tiananmen crackdown, on his first visit to Beijing 1954-1955.\nBut Dalai Lama always found CCP’s leadership changes “hard to gauge”. Transitions from Deng to Jiang to Hu to Xi were “difficult to navigate in real time”. When dealing with “any Chinese leader, it isn’t clear if one is speaking to an empowered individual or someone caught in the complex web of power relations with other Politburo members,” writes Dalai Lama. Individual efforts seemed thwarted by the leadership.\nThe book recounts China’s Buddhist traditions and argues that Tibetan Buddhism alone can bring “mental peace among millions of young Chinese.” Beijing’s got their land. But Dalai Lama may just be making his way into Chinese people’s hearts and minds. “What gives me hope is that the relationship between the two peoples – Tibetans and Chinese – has not been irreparably damaged.”\nCommunist China had invaded a theocratic state. But Dalai Lama shaped Tibet-in-exile as a democracy. He mused that people may abolish his post even – an acutely political idea that would put paid to Beijing’s strategy of picking his successor. The takeaway from the Tibet struggle perhaps is that CCP has had to concede that Dalai Lama’s reach and influence – regardless of the fact that Beijing sees him as a “separatist” – has no parallel.\nCommunist China waiting to appoint a religious head, the next Dalai Lama, shows how strong the current Dalai Lama’s brand is. \n\n",
        "headline_1": "Dalai Lama’s quiet victory over China",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/dalai-lamas-quiet-victory-over-china/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-04-2025"
    },
    {
        "full_article": "Great news photos become more than just an image\nIf you are not close enough, your photograph is not good enough, said the Hungarian war photographer Robert Capa. He was at work when he stepped onto a landmine and died. It’s a dangerous job. But it is able to tell the world about the most horrific things done by humans to each other – proof like nothing else that, yes, absolutely, that happened. The winning picture of this year’s World Press Photo competition is that of a young Palestinian boy, with both arms severed. It brings the brutal destruction of Gaza ‘close’ to those far away, and not just in kms.\nOver time, some photographs become emblematic of large historic events. Like the one of a naked girl fleeing a napalm bombing, which refuses to let American atrocities during the Vietnam War fade into collective amnesia. Or the one titled Raising the Flag on Iwo Jima that represents American heroism in World War II. Photographers of TOI, India’s newspaper of record, have also taken readers close to the most troubling events, again and again. The frontal photo of a man pointing a pistol at a policeman and threatening to kill him during the 2020 Delhi riots, and photos of Ajmal Kasab that helped establish his guilt in the 26/11 attacks, are just two of the most haunting examples.\nThe camera may be the most important invention since the printing press. But at what point, how many photographs later, do viewers grow immune to the horrors captured in these? When do these stop afflicting the comfortable and comforting the afflicted? The sad truth is that no one book or photo can end a war – that power continues to vest with men in power and their generals. And yet, the truth of the greatest photos is also indisputable. These are humanity’s conscience. However much we wring our hands at their limits, we would be more uncaring without them.\n\n",
        "headline_1": "When it clicks",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/when-it-clicks/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-04-2025"
    },
    {
        "full_article": "It’s not in the Ivy League but in smaller US universities that most students from India & most Americans get degrees. These are under far greater threat from the White House\nJudging by the headlines, Trump’s attacks on American universities are centered on prestigious institutions like Harvard, Columbia and Tufts, where the administration has arrested students and demanded obedience from administrators.\n\nBut these attacks obscure what the administration is doing to the colleges that serve most students in US, and most students who come to US from India.\nRead the full story on TOI+.\n\n",
        "headline_1": "Trump vs non-Harvards",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/trump-vs-non-harvards/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-04-2025"
    },
    {
        "full_article": "The body of a six-month-old baby was recovered on Saturday from a canal in Chattogram after the child had gone missing on Friday. A woman and her baby were travelling in a rickshaw when the baby fell into an open sewer, which had a strong current after rainfall. This story has tragically become one that plays out every now and then in Chattogram, notorious for its open drains and canals, where many have perished while others have been severely injured. A significant number of the victims were children. Despite lofty—and expensive—projects by the authorities to fix the city's drainage system, something as basic as closing all the open drains and canals to prevent people from falling into them has not been completed. Why such apathy for public safety?\nIn the last several years, there have been innumerable reports of people falling into open drains or canals, with some of the bodies never found. People have been expressing their fear, as most drains do not have protective slabs or retaining walls, which make them deadly after rainfall. The media has been relentlessly reporting on these incidents. Yet these deaths continue, robbing families of their loved ones.\nThe Chattogram City Corporation (CCC) and the Chattogram Development Authority (CDA) are the agencies responsible for maintaining and repairing the drainage system. They are therefore the main government bodies that should be held responsible for such criminal negligence. In 2021, the CCC found 5,527 risky spots along the drains, canals, and footpaths of the city. While around 80 percent of these spots have been covered and 70 percent of retaining walls built along the canals (according to a news report), there are still many vulnerable spots that are potential death traps—which is why a six-month-old baby had to die.\nIt is well known that these open drains and canals become clogged with silt and waste during the rainy season, causing them to become submerged, making it impossible to see them on the flooded roads. Thus, pedestrians or rickshaws falling into the drains, or people getting swept away by the open canals, has become a common occurrence. Yet the four projects worth Tk 14,389 crore initiated by the Awami League government could not complete the renovation of these canals and drains.\nWe expect the interim government to immediately take steps to demand answers from the CCC and CDA, and instruct them to cover the remaining risky spots on an urgent basis. Deaths caused by official negligence can no longer be tolerated. With the upcoming rainy season, they cannot afford to waste any more time.\n",
        "headline_1": "Open drains and canals continue to claim lives",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/open-drains-and-canals-continue-claim-lives-3875041",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-04-2025"
    },
    {
        "full_article": "Nearly two decades ago, I visited an office in Dhaka and overheard a brief conversation between a superior and their subordinate. The former was telling the latter that they had planned to go to India for Eid shopping but couldn't make it because they were down with flu. Honestly, up until then, I was not aware that there are Bangladeshis who regularly visit the neighbouring country for such purposes.\nWe often hear that Bangladeshis hate India and that this becomes obvious especially during international matches involving the Indian cricket team. But what about Bangladeshis who travel to India just for shopping and buy products which are available in their own country at equally or more reasonable prices? Do they hate India? Given that they earn money in Bangladesh and spend it in another country probably without much thinking, can we ask the following question: Do they love their motherland for which innumerable people laid down their lives in 1971 and then again in 2024?\nWithout questioning the patriotism of these India-going and shop-in-India Bangladeshis, we can also ask a set of questions from the opposite direction: are there Indians who receive salaries from their country but do their shopping in Bangladesh? Do Indians love Bangladesh? Or, are Indians anti-Bangladeshi?\nThe above red herring is intended to initiate a discussion on the question if Bangladeshis are anti-Indian.\nThe prefix \"anti\" is generally associated with a sense of hostility and antagonism. But do Bangladeshis have the power—political, economic, diplomatic or military—to be hostile and antagonistic to their behemoth neighbour which is one of the largest economies with one of the strongest militaries in the world? Similar questions can also be raised in India's relations with the people of its other neighbours. Are they also anti-Indian?\nI am wondering about these questions because in media parlance, the concept of anti-Indianism is often used to characterise the attitude of Bangladeshis towards India. This unjust, populist accusation that Bangladeshis are anti-Indian has spilled over in academic discourse too.\nI have come across journal articles where academics, who are otherwise well-trained, do not hesitate to caricature and stereotype Bangladeshis as anti-Indian. I have read essays, published by reputable presses, where Bangladeshis are routinely associated with phrases such as: \"anti-Indian sentiments,\" \"anti-Indian feelings,\" \"not just anti-Indianism but anti-Hinduism,\" \"anti-Hindu feelings,\" \"anti-Indian forces,\" \"anti-Indian posture,\" \"anti-India plank,\" \"anti-India stand,\" \"anti-Indian machinations,\" \"anti-Hindu violence,\" and \"anti-Indian rhetoric.\" By the way, the extension of the rhetoric of anti-Indianism to anti-Hinduism is premised upon the assumption that India is a Hindu country even though constitutionally it is a secular state (with a Hindu majority).\nIn terms of proportional land sharing between Bangladesh and India, no other two countries can perhaps be as close neighbours as Bangladesh and India are. Moreover, Bangladeshis who were born before the partition of 1947 were Indian. For example, my parents were born (British) Indian and died Bangladeshi and were Pakistani in between. Likewise, there are millions of Bangladeshis who are still alive and were born when the entire subcontinent was known as (British) India. They have lived under three flags and have embraced three nationalities—(British) Indian, Pakistani, and Bangladeshi. That is to say, India is not geographically and spiritually far removed from the people of Bangladesh.\nBut what instilled a sense of horror in Bangladeshis that may have given them reasons to dislike the Indian establishment and for which anti-Indianism is associated with them?\nIn order to understand the recent surge of so-called anti-Indian views among Bangladeshis, we need to examine the misrule that shipwrecked their country for over a decade on successive Indian governments' watch.\nFor fifteen and a half years from early 2009 to August 5, 2024, Bangladeshis were crumbling under the juggernaut of Sheikh Hasina's fearsome and self-serving regime. Under Hasina's mafia-style fascist rule, they lost their right to life and death with dignity. Occurrences of extrajudicial killings and enforced disappearances became the main instrument of the Hasina administration to rule Bangladesh and to keep its population under subjugation. Family members of many victims didn't even have the opportunity to observe funeral rites for the dead. Nor were they able to properly mourn their loved ones or accord them a dignified burial. There were many instances where government forces killed citizens and concealed the dead bodies, and bereaved family members were given an opportunity to receive the remains of the deceased only after agreeing to say in public that their loved ones died of heart attacks, strokes, or other health complications.\nDetailed information about the existence of a network of secret torture centres, called Aynaghar or the House of Mirrors (ghost houses), that government forces set up across Bangladesh under Hasina's leadership is now emerging. We are gradually grasping the fuller extent of post-mortem drowning or dead body dumping cases orchestrated by the regime.\nOn the economic side, financial institutions, including Bangladesh's central bank, were plundered and ruling party high-ups and their cronies siphoned off money to purchase expensive properties in foreign destinations and/or to deposit into their offshore bank accounts. People were forced to pay high prices for food items and other necessities in order to satisfy the greed of those in power. In the name of megaprojects, ministers and their subordinates and henchmen fattened their pockets.\nAll these and many other instances of human rights violations, corrupt practices and financial crimes continued unabated because the regime didn't need public support to cling to power. It hardly practiced even a modicum of democracy. It ruled through a combination of repression and fake/nocturnal elections one after another, and any form of dissent was met with violence, persecution, custodial torture or death in police custody.\nIt is common knowledge in Bangladesh and beyond that the Hasina regime remained in power undemocratically for such a long time almost solely through India's covert and overt support. As, in his 2024 book Pathways of Autocratisation, Ali Riaz argues that \"Bangladesh's autocratisation process\" under Hasina was \"influenced by the overall global political situation, but… accentuated, perhaps succeeded, because of its neighbour India's unqualified support for\" her since 2009 (pg 62). Unfortunately, India's patronisation of autocracy in Bangladesh is often given an innocuous label—a strategy to maintain \"a stable regional political system\" even if to the detriment of Bangladesh.\nAfter a months-long intense struggle known as the July revolution and at the expense of thousands of lives and limbs, on August 5, 2024, Bangladeshis collectively removed Hasina's oppressive regime (she fell and fled to the country whose interests she seemingly espoused). Now a constant barrage of allegations has been mounted against Bangladeshis that they are anti-Indian. In other words, the liberation of Bangladeshis from oppression is being perceived as going against India's interests.\nBut why?\nDuring Hasina's fifteen-and-a-half-year rule, she did everything to accommodate Indian demands, regardless of what was in Bangladesh's national interests. Trade deficits in favour of India increased, Bangladesh gave India transit benefits and access to rivers and ports free of cost while buying electricity from it at an outrageously high price. For these and many other reasons, Bangladesh became a greater source of remittances for India. What is more, for decades Indian forces have been killing Bangladeshis at the borders on a regular basis while the relations between the two countries were being described as \"golden\" during Hasina's rule. Considering these and other examples, Bangladesh was having a relationship with India that was heavily slanted in favour of the latter.\nBangladeshis simply wanted this \"lopsided\" relationship to end. Does this make them anti-Indian?\nDr Md Mahmudul Hasan is professor in the Department of English Language and Literature at the International Islamic University Malaysia. He can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Are Bangladeshis anti-Indian?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/are-bangladeshis-anti-indian-3874846",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-04-2025"
    },
    {
        "full_article": "The immigration lines in most developed countries are smooth as most passengers simply scan their e-cards and walk through. Bangladeshi passport holders, however, often appear to be a spanner in the wheel that blocks the flow. The queue behind us grows longer and more restless. Officials need time to verify our documents. Occasionally, their superiors surface from hidden cubicles to cast more suspicious eyes. Once cleared, our bags come under a fresh round of random profiling. Our alien-coloured green passport is a symbol of exclusion. While the image-driven media creates a hearty narrative of global mobility full of opportunities and connectivity, the aspirations of most Bangladeshis are met with resistance through no fault of their own.\nBangladeshi passports are ranked among the weakest in the world. According to the latest edition of the Henley Passport Index, our passport stands at 100th, with war-torn states like Libya and the Palestinian territories in our cohort. The weak status of our passport is a reality check for many who suffer from false-inflated egos. It exposes us to dehumanising processes that include visa hassles, exploitative syndicates, and immigration humiliation. It affects our global mobility in business, education, family visits, and tourism. In the year up to March 2024, the UK Home Office rejected 53 percent of visa applications by Bangladeshis, against the global average of 21 percent. The figure is nearly the same for Schengen states. Last month, the Malaysian airport authority denied entry to 51 Bangladeshi nationals despite their having valid visas, allegedly for \"loitering suspiciously in the arrival hall.\"\nThe difficulty in getting visas has contributed to the rise of an \"industry\" that profits from complexity and opacity. Many embassies employ middlemen or agents who levy hefty consultation or processing fees. In some instances, digital slots are allegedly monopolised by syndicates and sold by informed insiders. Then there is the added trouble of travelling to a third country to obtain consular services. If things are less than favourable there, you may encounter additional challenges in obtaining a second visa before attending your main interviews.\nEven licensed visa service firms are not beyond criticism, being accused of delaying regular punters to encourage the purchase of premier services. A recent exposé revealed that a renowned visa agency held onto Italian visas for over a year, demanding heavier fees. On the other hand, freelancers entice visa-seekers with promises of guaranteed visas. First-time travellers and those unfamiliar with the digital protocol are easy targets. These visa consultants operate in the shadow zone of legality. Victims have hardly any legal protection from these scheming agents and scammers. The reason is simple: the state does not value its citizens enough.\nIn most cases, we consider visa rejection to be a personal failure. But it is time for our state, particularly our diplomats, to realise that the refusal is often a failure of our soft power diplomacy. The state must stand by its citizens to reclaim the narrative. If Bangladeshis are considered burdens or threats, it will affect our labour market, trade, education, and cultural exchanges. As a country with a high unemployment rate, many see the outside world as a provider of life-changing opportunities. Yet, they are frustrated by the obstinacy of the legal channels. Aspiring immigrants frequently fall prey to scammers, who encourage them to undertake perilous journeys involving smugglers, fake documents, and alternative travel routes through forests, hills, or oceans. The popular code used for such a process is known as \"game.\" In recent years, thousands of Bangladeshis have reportedly tried to enter Europe through gaming. Some of them drowned in the Mediterranean Sea. Authorities arrested many and relocated them to temporary refugee shelters. Some ended up working as undocumented labourers in various regions of Europe.\nThe lack of a global reputation for Bangladeshi travellers discourages not just migrants, but also tourists and professionals. With the middle class on the rise, there is a growing demand for travelling abroad, attending international events, and sending children to overseas institutions. Genuine students with scholarships or businessmen with all-paid-for trips are denied visas for no apparent reason. The stated reasons, such as \"low income\" or \"insufficient ties to home,\" often exacerbate the situation. The weak positioning of our travel document is due to weak diplomatic initiatives, inefficient migration services, and a non-existent passport strategy.\nWith a global icon now at the helm of the government, the time is right for the Ministry of Foreign Affairs to push for fair visa policies for Bangladeshi nationals. The ministry must take proactive steps to establish bilateral visa facilitation agreements with key partners, particularly for students, businesses, and migrant labourers. There should be advocacy for establishing more embassies in Dhaka, joint application centres, and long-term visa processing setups. We must examine the reasons behind Dhaka's status as a challenging posting for overseas envoys and enhance the basic amenities provided to them. Conversely, we need to upgrade our documentation process to enhance the credibility of our certificates and paper trails.\nAdditionally, the Ministry of Expatriates' Welfare must coordinate with law enforcement, civil aviation, and anti-corruption bodies to end the nefarious \"visa industry.\" Government-run support portals must be empathetic and supportive to promote transparency and reduce dependency on middlemen. There should be steps to increase our skilled labour pool, targeting specific countries for fast-track mobility arrangements. Already, the chief adviser has mentioned the need for nurses and carers in the global market.\nWe can follow bilateral models like the Indo-German skilled workers' agreement or the Sri Lanka-Japan Specified Skilled Worker (SSW) programme to curate a niche market. The foreign ministry also has a mandate to raise the fair visa issue through diplomatic and multilateral channels. We must remind the Global North of its touted moral high ground and emphasise that mobility is a development right, not a privilege.\nThe time has come to promote our culture through public diplomacy. We need a database of our diaspora talent and showcase them to promote national reputation before the host countries, replacing the \"risk\" label. At the same time, we need to invest in our youth so they become globally informed citizens of the world. It is our duty to give them the freedom to study, to love, to work, and to dream beyond borders. We must train them to export our ideas, forge partnerships, and bring knowledge home. But first, we need to unlock our windows before expecting the world to open its gates for us. It's time to reclaim the dignity of our green passports, not with misplaced patriotism, but with strategic interventions. We look forward to the day when Bangladeshis walk through green channels, proud of their green passports.\nDr Shamsad Mortuza is professor of English at Dhaka University.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "The sorry state of our green passports",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-sorry-state-our-green-passports-3874606",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-04-2025"
    },
    {
        "full_article": "It is disheartening to learn about the deplorable condition of roads in Pirojpur municipality, where nearly 90 percent reportedly require urgent repairs. According to sources, aside from around 20 kilometres of paved roads and approximately 70 kilometres of earthen roads, most roads across the nine wards remain damaged. For instance, the Dhuppasha Road has been unfit for vehicular movement for nearly a decade. As a result, vehicles are often forced to navigate carefully due to potholes and uneven surfaces, while many residents choose to walk as a safer alternative. Unfortunately, the municipal authorities have taken no meaningful steps to renovate these roads, citing a lack of funds.\nPirojpur's situation is hardly unique. Roads in districts and villages across the country often suffer from the same fate. In many cases, roads become dilapidated soon after construction due to the use of substandard materials. In others, projects remain incomplete or abandoned for years. Numerous reports have exposed the inefficiency, mismanagement, and corruption within the Local Government Engineering Department (LGED) that oversees most of these projects. One recent example is a road constructed by LGED in Patuakhali's Bauphal upazila, which collapsed just a day after completion. In another case, an 11-kilometre road in Narayanganj deteriorated within six months of repairs.\n\nPirojpur's situation is hardly unique. Roads in districts and villages across the country often suffer from the same fate. In many cases, roads become dilapidated soon after construction due to the use of substandard materials. In others, projects remain incomplete or abandoned for years. Numerous reports have exposed the inefficiency, mismanagement, and corruption within the Local Government Engineering Department (LGED) that oversees most of these projects.\nThe condition of bridges is similarly troubling. For instance, in the Amtali upazila of Barguna, the collapse of 10 iron bridges in just eight months severely impacted around 65,000 residents. Likewise, a concrete bridge built over the Banshbaria canal in Patuakhali remains unused due to the absence of approach roads—another example of poor planning and execution.\nThese cases reflect a chronic lack of attention towards road infrastructure outside the capital and major cities, particularly in rural and municipal areas. A Prothom Alo report from last year noted that about 50 percent of LGED roads required repairs, while many village roads were unusable—a situation that remains largely unchanged to this day. Insufficient budget allocations often delay necessary maintenance, which ends up costing more in the long run. This scenario must change. The government must not only ensure adequate funding for repair but also overhaul its project implementation processes. The practice of awarding contracts to politically connected contractors must end to ensure accountability and quality. For Pirojpur municipality, in particular, immediate fund allocation and repair are paramount.\n",
        "headline_1": "Take steps to repair Pirojpur roads",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/take-steps-repair-pirojpur-roads-3873326",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 20, 2025 00:00:00  \nThe three-month pause on \"reciprocal\" tariffs announced by the Trump administration for all countries except China leaves a narrow window for action. While three months is scarcely enough time for any government to negotiate a complex trade deal, this is the timeframe within which Bangladesh must operate. In his letter to the US president Donald Trump, chief adviser Muhammad Yunus had requested the postponement of US tariff measures for this specific duration, a period he said was needed to implement initiatives to increase US exports to Bangladesh. With his wish granted, it is now the government's responsibility to seize this opportunity to protect the largest single-country destination for Bangladesh's goods. \nAgainst this backdrop, the Centre for Policy Dialogue (CPD) recently organised a discussion titled \"Trump Reciprocal Tariffs and Bangladesh: Implications and Response\" to examine the strategies for responding to the emerging situation. It is already well established that, contrary to its name, the US's reciprocal tariff is not truly reciprocal but rather a unilateral measure aimed at reducing its trade deficit. As noted during the discussion, exports from the US to Bangladesh face an average duty of 6.2 per cent, which drops to 2.2 per cent after rebates, while Bangladeshi products entering the US face tariffs averaging 15.2 percent. Given that the existing tariff structure already favours the United States, any proposition from Bangladesh for further tariff reductions is unlikely to generate reciprocal interest. Some experts at the CPD event suggested that securing a Free Trade Agreement (FTA) with the US could help safeguard Bangladesh's export market. Examples of several developing countries, such as Jordan, which have FTAs with the US, were cited to illustrate the possibility of Bangladesh achieving such an agreement through effective negotiation. However, this policy suggestion misses the mark, as the primary focus of the US tariff measures is to increase its exports to address trade deficits. It is therefore highly improbable that the US would agree to reduce tariffs without this key concern being addressed. It is worth noting that having an FTA did not prevent Jordan from being subjected to 20 per cent reciprocal tariffs as it maintained a trade balance unfavourable to the US. \nWhile pursuing an FTA and activating the Trade and Investment Cooperation Forum Agreement (TICFA) as suggested in the CPD dialogue may be valuable in the long term, the severely limited timeframe within which Bangladesh must find a solution renders this approach less useful. Any viable solution to navigate the current challenge must involve a positive response to the US demand for a more balanced trade relationship. There are indeed measures that Bangladesh can take towards achieving this. For instance, Bangladesh's top imported item is refined petroleum, valued at almost $7 billion per year, primarily sourced from countries with which Bangladesh holds significant trade deficits, including China, India, Malaysia and Singapore. Another major import of Bangladesh is cotton and cotton yarn, procured mainly from China and India. Notably, the United States is the world's leading exporter of both refined petroleum and raw cotton. Rather than importing these crucial items from countries with whom Bangladesh already has substantial trade deficit, redirecting a portion of these imports to the US could be a pragmatic move toward balancing bilateral trade. \nFor long-term security and resilience, Bangladesh must diversify its export markets to reduce the risks of over-reliance on any single market. However, extraordinary circumstances call for extraordinary measures, and in the short term, redirecting key imports to the US appears to be the most viable option. If pursued deftly, such a strategy could not only help Bangladesh avoid punitive tariffs but also create additional entry points for its products in the US market.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ensuring US  market access",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ensuring-us-market-access-1745076080",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       April 20, 2025 00:00:00  \nThe government withdrew restrictions on yarn imports from India through the land ports around two decades ago. Earlier, the restriction had been imposed on the pretext of infrastructure weakness, smuggling, and tax evasion at the land ports. The ban, effected on March 9, 2002, sparked a bitter rivalry between export-oriented clothing manufacturers and domestic yarn producers. Three years later, the government re-opened the land ports, allowing yarn imports from India. \nAlmost two decades later, the country is witnessing a similar situation as the government banned yarn imports through the Benapole, Bhomra, Banglabandha, Burimari, and Sonamasjid land ports on April 13 this year. The restrictive move came after India on April 8 cancelled the transhipment facility for Bangladeshi exports to third countries through India's land customs stations to ports and airports in containers or closed-body trucks. Indian authorities at that time mentioned that the transhipment facility had been withdrawn due to cargo congestion at Indian airports, which was affecting Indian exporters.\nActually, the Indian move is a calculated step to pressure the Yunus-led interim government, which is currently in a delicate position due to the ongoing political transition in Bangladesh. As New Delhi has yet to accept the reality of post-Hasina Bangladesh, it has been putting various pressures on the interim government. Indian media categorically linked the cancellation of the transhipment facility with the chief adviser Muhammad Yunus's comments on the north-eastern region of India. During his visit to China last month, Yunus said that seven sisters, the seven north-east states of India, are landlocked, and that the only access to the ocean is through Bangladesh. He also asked China to invest more in Bangladesh. Indian politicians, experts and the media labelled it as provocative remarks and blamed Yunus for inviting Chinese influence in a region that India considers vital to its security and territorial integrity. \nAfter his visit to China, Yunus joined the BIMSTEC (Bay of Bengal Initiative for Multi-Sectoral Technical and Economic Cooperation) summit in Bangkok, where he met with Indian prime minister Narendra Modi. The long-awaited bilateral meeting was a critical move to ease the strained relations between the two neighbouring countries. Since the fall of Sheikh Hasina's government on August 5, when she resigned as the country's prime minister and fled to New Delhi, relations between the two countries continued to deteriorate.\nYunus-Modi meeting actually took place amidst a concealed anxiety and discomfort, which was reflected in the varied official versions coming out from the two countries after the meeting. India's decision to cancel the transhipment facility for Bangladesh heightens the uneasiness further. Finally, on Thursday, the Indian external affairs ministry's spokesman mentioned that the cancellation of the transhipment was due to 'some of the developments' that took place earlier. He said, \"I would urge you to look at some of the developments that preceded it so that you can get a full perspective on the issue.\" Though he did not elaborate or explain the developments, it is not difficult to understand what he meant. \nSince the fall of the Hasina regime in the face of a student-led mass uprising, New Delhi has been expressing its disappointment and anger through a series of statements and steps, making it further clear that it has no respect for the choices and wishes of Bangladeshi people. The Indian government has allowed thousands of Hasina loyalists and leaders of the Bangladesh Awami League to stay in India, especially in the West Bengal. Most fled secretly crossing the borders on and after August 5, without any valid travel documents. The lack of documents does not bar them from staying safely in India, thanks to the BJP-led Indian government's generosity towards Hasina and her loyalists. New Delhi has also persistently raised the so-called 'minority issue' in Bangladesh to pressure the interim government. At the same time, a section of Indian media continues to spread hatred and disinformation in this regard. For the last couple of months Indian government has also started to harp on the string of 'inclusive and participatory elections' in Bangladesh. \nSo, the bilateral trade-related restrictions need to be viewed in the above-mentioned context. Equipped with a number of tools in hand to make the international trade of Bangladesh costlier, New Delhi is better positioned to exert pressure on the Yunus-led government further. So, it is not unlikely that Bangladesh will face more trade restrictions from India in the coming days. As the bilateral trade balance is heavily tilted towards India, it will be more challenging for Bangladesh to address such actions like the cancellation of the transhipment facility. \nMotivated restrictive trade measures with its potential for sparking retaliatory action are a risky game that can exacerbate the situation. The recent ban on yarn imports from India through land ports is viewed as a retaliatory move for India's cancellation of the transhipment facility. This non-tariff barrier (NTB) is in place while imports through sea ports remain open. India has been a major supplier meeting 80 to 90 per cent of Bangladesh's annual demand for yarn for the export-oriented garment industries, particularly knit garments. The country imported yarn worth $3.22 billion in the last fiscal year, a 15 per cent increase from the previous year, indicating that local yarn manufacturers are unable to meet the entire demand. The geographic proximity has also been a key factor in the significant yarn imports from India over the years. \nThere is an allegation since long that India has been dumping low-quality yarn in Bangladesh. Bangladesh Textiles Mills Association (BTMA) recently demanded the imposition of anti-dumping duty on Indian yarn. The organisation made a similar demand before the ban on the import of Indian yarn in 2002. Nevertheless, the imposition of anti-dumping duty requires rigorous investigation to prove the dumping and proper compliance with the rules of the World Trade Organization (WTO). Once imposed, the affected party can challenge the duty through the respective government and drag the duty-imposing country into the dispute settlement platform of the WTO. To keep the duty, the imposing country has to prove that there is no violation of WTO rules, whereas the affected country needs to show that the imposition of anti-dumping duty breaches WTO rules. It, however, takes a long process.\nThe recent imposition of a non-tariff barrier (NTB) on yarn imports from India is expected to exert significant pressure on Bangladesh's export-oriented RMG industry. This comes at a time when exports to the United States, the leading market, are already facing a new challenge due to Donald Trump's tariff escalation. Although Trump has suspended the so-called reciprocal tariff on Bangladesh for three months, the future remains uncertain. India's cancellation of the transhipment facility has further compounded the pressure on RMG exports from Bangladesh. \nHowever, the use of trade restrictive measures by two neighbouring countries to exert pressure on each other is not a win-win situation. If negotiations are not conducted in a balanced manner, the situation could worsen further in the coming days.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Rising risk of Indo-Bangla trade retaliations",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/rising-risk-of-indo-bangla-trade-retaliations-1745076288",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       April 20, 2025 00:00:00  \nRemittance inflow hit a record high of US$3.29 billion in March, marking 65 per cent year-on-year increase compared to the same period last year. However, behind the glossy figures lies a grim reality: when juxtaposed with a growing procession of deaths among Bangladeshi expatriate workers, this economic success rings hollow.\nThe data from the Wage Earners' Welfare Board paints a chilling picture of this escalating tragedy. Since 2020, the number of migrant worker deaths has steadily climbed, reaching a staggering 4,813 last year alone - increasing from 4,552 in 2023, and 3,140 recorded in 2020. On average, Bangladesh is receiving 400 bodies each month, that means thirteen bodies in a single day. Since 1993, at least 57,216 of the country's hardworking citizens have returned home in coffins. \nMost of these deaths occurs in the Middle East, with Saudi Arabia, the primary destination for Bangladeshi workforce, topping this list, followed by Malaysia, the UAE, Oman, and Kuwait. Saudi Arabia saw 1,626 Bangladeshi deaths last year alone.\nA significant proportion of these deaths are attributed to \"natural causes\" such as stroke or brain haemorrhage. But what is quite unacceptable is that Bangladesh authorities readily accept the explanations provided against the deaths as mentioned in the deceased expatriate workers death certificates provided by host countries without further scrutiny.\nHow can it be that a majority of these deceased individuals were young, between the ages of 38 and 42, many succumbing within a short period of their employment? These were individuals deemed medically fit, possessing medical certificates to prove it, before embarking on their overseas journey. What unseen forces are at play that are claiming the lives of these healthy, young men in such alarming numbers? Why isn't the government launching any investigations to determine the underlying causes of these deaths?\nHuman rights activists say that the extreme temperatures prevalent in Middle Eastern countries, coupled with potentially hostile working environments, inhumane work pressures often stretching 12 to 18 hours a day, unsanitary living conditions are likely significant contributors to conditions like stroke and heart disease.\nUnsafe working condition and physical abuse may well be another significant cause of death of migrant workers. Earlier many aggrieved families complained of witnessing physical injuries or marks on the returned bodies, only to be met with a wall of silence or dismissive explanations. The foreign missions, meant to look after the interest of the Bangladeshi citizens abroad, display a lacklustre attitude that is insensible, to say the least. This inaction not only betrays the trust of our expatriates and their families but also emboldens unscrupulous foreign employers to exploit and abuse our workers with impunity, knowing there will be no serious repercussions. These vulnerable individuals have none to help when their employers exploit them. \nWhile speaking to the media the Adviser for Expatriate Welfare Ministry Asif Nazrul said that the government is now providing free ambulance services and a certain burial cost to deceased expatriates. But more than just a free transport home after death, the families of these deceased expatriates deserve to know the truth - the exact causes of their loved ones' death and, more importantly, what measures will be implemented to prevent such tragedies from recurring. The government must prioritise the well-being and safety of its overseas workforce, not just count their remittances. A comprehensive investigation into these alarming death rates, coupled with proactive measures to ensure safe and humane working conditions, is not just a moral imperative; it is a fundamental responsibility the nation owe to those who contribute so significantly to its prosperity. The silence must be broken, and justice must be sought for our fallen remittance heroes.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why are so many expatriates dying abroad?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-are-so-many-expatriates-dying-abroad-1745076339",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 20, 2025 00:00:00  \n\nSafe and clean water is one of the most fundamental human rights and an essential prerequisite for a healthy life. Ensuring this right is a core responsibility of the state. However, in the capital city of Dhaka, this basic necessity is being alarmingly neglected.\nFor far too long, residents in various parts of Dhaka have been suffering due to the severely compromised quality of water supplied by WASA. The water often carries a foul odour, appears blackish or yellowish, and is frequently contaminated with dirt - and, shockingly, even insects. This water is clearly unfit not only for drinking but also for daily household use such as cooking, bathing, and cleaning.\nAs a result, waterborne diseases are on the rise. People are increasingly falling victim to diarrhea, skin infections, eye conditions, and even chronic health issues related to the kidneys and liver. The situation is especially dire for slum dwellers and low-income communities who cannot afford alternative sources of clean water.\nIn a modern city like Dhaka, where the foundation of a healthy and functional life depends on safe water, such contamination is nothing short of a humanitarian crisis. It is not just a violation of citizens' rights-it is a matter of public health and human dignity. WASA and the relevant authorities must take immediate and effective steps to ensure the supply of clean, safe water to all residents of Dhaka. Our health and future depend on it.\nProgga Das\nStudent, Department of Economics\nEden Mohila College\n proggadas2005@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Foul ordour and insects in WASA water",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/foul-ordour-and-insects-in-wasa-water-1745076354",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-04-2025"
    }
]