[
    {
        "full_article": "In the early hours (IST) of March 19, 2025, a SpaceX crew capsule bearing NASA astronauts Sunita Williams, Barry Wilmore, Nick Hague, and Roscosmos cosmonaut Aleksandr Gorbunov splashed down off Florida. Ms. Williams and Mr. Wilmore had returned to the earth after nine months in the International Space Station (ISS), whereas they had originally been expected to spend eight days in the course of testing Boeing’s Starliner crew capsule. The Starliner saga has now concluded, but not before it twisted the reality of human spaceflight out of context, making it sound like a caper rather than a testament to the virtues of protocol. Following Starliner’s launch in June 2024, a series of malfunctions left Ms. Williams and Mr. Wilmore onboard the ISS before the capsule returned empty to the ground in September. The events spurred concerns and indignation in the popular imagination, swirling around a dearth of information both NASA and Boeing were reluctant to fill. As their stay was expanded to nine months, curiosity swelled over their well-being. While this response was natural, speculation fuelled by insufficient updates and political propaganda in the U.S. also fanned misinformation that cast Ms. Williams and Mr. Wilmore as having been “stranded” in space.If the “stranded” narrative captures the gist of Starliner’s failure, it misses the inalienable contingencies at the heart of human spaceflight. Ms. Williams herself has sought to downplay the use of such terms. Over the years, but especially in the wake of the Challenger and Columbia shuttle disasters in 1986 and 2003, NASA has instituted procedures its personnel are required to follow in a variety of situations where events buck a pre-planned sequence. One is that astronauts onboard malfunctioning spacecraft can move to the ISS, which is always prepared to host such visitors. But many actors framed NASA as weak-willed for sticking to its protocols. When it scrubbed a prior launch attempt of the capsule that returned the astronauts for technical reasons, supporters of U.S. President Donald Trump accused the agency of infirmity rather than acknowledging it as a well-known safety measure. Narratives that overlook the simple fact that two veterans were picked to pilot Starliner’s first crewed flight belie the existence of multiple safety checkpoints and the great lengths to which space agencies go to ensure one unexpected outcome does not spell catastrophe. People, including in India — where concern for Ms. Williams parallels a growing pride in the country’s budding human spaceflight programme owing to her Indian ancestry — would do well to replace notions of triumphalism in space with good old “safety first”. Also, space agencies should realise the importance of clear, timely communication as an integral part of safety protocol. Published - March 20, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        nasa\n                    \n                            /                      \n                        \n                        space programme\n                    \n                            /                      \n                        \n                        USA",
        "headline_1": "Safe from space: On the return of the NASA mission space crew",
        "headline_2": "NASA did well to follow established protocol in bringing astronauts back",
        "link": "https://www.thehindu.com/opinion/editorial/safe-from-space-on-the-return-of-nasa-mission-space-crew/article69349440.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-03-2025"
    },
    {
        "full_article": "Slakes thirst, powers rituals – and fills an iconic well with faith\nTomorrow is Navruz, new year for Iranians globally. On the same vernal equinox, India’s Parsi Zoroastrians have Jamshed-i-Navroz, named after the legendary Persian king whose ceremonial wine cup reportedly never ran dry. So it’s an apt day for trustees of Mumbai’s ever-flowing Bhikha Behram Well to celebrate its historic tricentennial. Like Lord Ram’s arrow at the city’s Banganga tank, Moses’s staff during the Biblical exodus of Israelites and Islamic Hajar’s ZamZam font, this sacred landmark is linked to the All-caring One. In 1725, a divine Voice, ringing forth in a dream, ordered an 18th century Parsi merchant to sink a well. When Bhikha Behram finally obeyed – after two successively sterner reminders – sweet water gushed forth, silencing sceptics who’d scoffed that the ordained sea-shore location could yield only the brackish. Ha! What chance unpotable against Omnipotent command?\nFor 300 years, Bhikha Behram’s proxy bequest has served Parsis thirsting for divine intervention, and other Mumbaikars merely thirsty. What fascinates me most is the Sacred Feminine, wellspring of its boon-granting powers. Zoroastrianism’s Ardvisura Anahita presides over all water, which is second only to fire in our hierarchy of reverence. Ava/Aban Yasht prayed to her is among the longest of Avestan hymns.\nAwesome to behold, she is statuesque, strong and beautiful. Dressed in finest beaver skins and ornaments, mantle, even slippers of gold, she rides a chariot drawn by four Persian steeds representing clouds, wind, rain, sleet. Ardvisura Anahita gives ‘strength to men, knowledge to priests and teachers’; but women are ‘in her special care’.\nAcross cultures – our Ganga-Yamuna, Celtic Danu, Egyptian Anuket, Greek Thalassa – female divinities are obvious custodians of this life-source. The ancients knew what we can’t seem to learn. Water’s mystic power is subpoenaed in all-faith rituals. Before recent contenders waded in, it was the predicted cause of future wars. Indeed, sans water, the planet would have to depend on AI-assisted recreations of nature – like backdrop of recent ET awards – since the real thing would have withered away. Taking us with it.\nAll ends when wells end.\n***\nAlec Smart said: “Aurangzeb, aur kaun? Razing history is grave mistake.”\n\n",
        "headline_1": "Waternamah",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/waternamah/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-03-2025"
    },
    {
        "full_article": "RBI chief batted for ordinary bank customers. More can be done\nIndian banks are awash in money. In 2023, they held 103L cr – $1.2tn – in FDs alone. The small customer can seem too small from their vantage. So, kudos to RBI governor Sanjay Malhotra for speaking up for the little guy. On Monday, Malhotra rapped banks for poor customer service. Everybody’s had a taste of it, but data shows the full extent of the rot. Complaints received under RBI’s ombudsman scheme – not resolved by your bank, hence escalated to RBI – have grown at 50% a year for the past two years. If India’s GDP grew that fast, it would overtake US in just over 5 years. That’s why Malhotra called it a “highly unsatisfactory situation” that needs “urgent attention”. He also flagged the underreporting of complaints by banks. In 2023-24, India’s scheduled commercial banks together received over 1cr complaints, but it turns out they were window dressing data – many complaints were listed as requests, queries and disputes, which is a regulatory violation.\nIn simpler times, banking-related complaints were mostly about forgery and wrong entry, but complexity has broadened the gamut of problems. For example, on Wednesday TOI reported about a man in Gujarat whose credit score fell because of his bank’s mistake, making him ineligible for loans. Bank branches misselling investment schemes and other products like life insurance is another outrage. A few years ago, a report pointed out that bank branches rewarded staff for selling these products but not for better customer service.\nLast year, RBI raised concerns about gold loans. In Dec, it cautioned banks about unsecured loans, and top-up loans offered with minimum due diligence. Now, SC has sought a CBI probe into another old problem – the “nexus” between banks and builders due to which lakhs of homebuyers are paying EMIs without any hope of getting their house. As it told counsel for banks on Tuesday: “…knowing not a brick has been laid at the site, you released 60%. How can this be without quid pro quo?” Banks have much to answer, and fix. They should heed Malhotra’s warning: “Left unresolved, such issues can erode consumer confidence and tarnish the entire ecosystem.”\n\n",
        "headline_1": "Well said, Guv",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/well-said-guv/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-03-2025"
    },
    {
        "full_article": "Putin came out ahead on Ukraine peace talks. But is Bibi’s bombing of Gaza a Trump pressure tactic on Russia? \nTrump did make a deal – Putin’s deal. America – and Ukraine – had wanted a land-sea-air ceasefire. It didn’t get anything close to it. Russia’s nod to a temporary halt on attacking energy infra is one of those small concessions Putin doesn’t mind. Same for technical negotiations for a maritime ceasefire in Black Sea. Remember, Ukraine has the advantage there. And just a few hours after the call, different regions of Ukraine were hit by Russian drones. Putin’s saying the war is on. Therefore, he’s also saying the Trump-blessed ceasefire isn’t a deal he’ll sign. That’s why he is trying to do a deal only with Trump, bypassing Ukraine and Europe. He knows Trump is looking for a political win. And he himself needs something substantial for his home audience. Notice that he’s tagged on a demand that all foreign military aid and intelligence support to Kyiv be stopped, “to prevent an escalation of the war”.\nBut Trump may just have an ace as well. Israel’s re-bombardment of Gaza, breaking a ceasefire there, on the day of Trump-Putin call may not be a coincidence. Israel’s military actions have already caused massive damage to Iran and its proxies. Iran is not only aligned with Russia but has also provided crucial material support in the Ukraine war. Already, thanks to Israeli offensives in Lebanon and Syria, Russia’s buddy Bashar al-Assad had to run away, and Russian assets in Syria were lost.\nSo, getting Netanyahu to pound Gaza again could be Trump’s indirect way of piling pressure on Putin. Russia may confront an unhappy choice: either hold on to advantages on the Ukraine front and lose more influence in West Asia, or start compromising in Ukraine and retain a foothold in West Asia. But Trump should also know this: a peace deal minus Ukraine/Europe voices is unlikely to hold.\n\n",
        "headline_1": "Deals within deals",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/deals-within-deals/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-03-2025"
    },
    {
        "full_article": "In student/tourist visas & green cards, Trump has found an easy way to demonstrate power. The costs will be borne not just by ‘foreigners’ but by America itself\nThe first two months of Trump 2.0 have been a flurry of activity with very little effect. Despite unprecedented claims of executive power, many of Trump’s promises – even things he said were going to be easy – have gone unfulfilled.\n\nBut a flailing Trump seems to have found one area where he can get something done, and he’s determined to punish universities and cancel visas, no matter how counterproductive this might be.\nRead the full story on TOI+.\n\n",
        "headline_1": "Liberty’s getting trumped in US",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/libertys-getting-trumped-in-us/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-03-2025"
    },
    {
        "full_article": "The recent arrest of Ataullah Abu Ammar Jununi, commander-in-chief of the Arakan Rohingya Salvation Army (ARSA), along with 10 others, has once again highlighted the militant threats long plaguing the refugee camps in Bangladesh. On Tuesday, Ataullah and six others were placed on remand while the rest were sent to jail. Earlier, Rab made the arrests after conducting special drives in Narayanganj and Mymensingh. According to case filings cited by Prothom Alo, all the arrestees except one hailed from Myanmar's Rakhine State, likely arriving in Bangladesh sometime after the mass exodus of Rohingya in 2017. This development is significant given how militant groups like ARSA have terrorised the Rohingya camps for years, engaging in targeted killings, abductions, trafficking, extortion, and such crimes.\nAtaullah and his group first gained prominence after they carried out an attack on Myanmar's border posts in Rakhine in October 2016, resulting in the deaths of several officers. They gained wider notice following their August 25, 2017 attacks on around 30 police and army posts that led to the ruthless military crackdown that drove around 740,000 Rohingya into Bangladesh. Since then, ARSA has continued its activities within the refugee settlements. Hundreds of Rohingya are believed to have been killed by ARSA members. The group has also been accused of targeting Rohingya leaders advocating for repatriation, including the 2022 assassination of Mohib Ullah, chairman of the Arakan Rohingya Society for Peace and Human Rights. ARSA has also been linked to the killing of a DGFI officer near the Tumbru border, showing how militant threats within the camps spilled onto nearby territories, threatening our internal security.\nFor years, however, the Awami League government refused to acknowledge the activities of Rohingya militant groups. This not only provided cover for their operations but also created an environment of impunity that allowed them to expand their criminal networks. Even though ARSA appeared to have lost ground to its rival Rohingya Solidarity Organization (RSO) since 2023, the relative security vacuum has led to an exponential rise in violence—with murders, abductions, and extortion skyrocketing between 2022 and 2024, according to a recent report by Fortify Rights.\nAgainst this backdrop, the government must take stern action to dismantle these militant groups. While it is true that they may try to exploit the vulnerabilities caused by the recent cuts in WFP/US funding for Rohingya refugees—with fewer resources now available for them—there is no alternative to strengthening internal security measures. The government should launch a comprehensive crackdown on all armed groups operating within the camps. Moreover, it must ensure that captured militants face justice, whether through domestic legal proceedings or through international mechanisms such as the International Criminal Court, as the director of Fortify Rights has recommended. While the wait for repatriation prolongs, we cannot sit back and delay action on these threats anymore.\n",
        "headline_1": "Take steps to address militant threats in Rohingya camps ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/take-steps-address-militant-threats-rohingya-camps-3852986",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-03-2025"
    },
    {
        "full_article": "The general practitioner (GP) system is the cornerstone of healthcare in many countries, providing individuals with their first point of contact for medical care. GPs are trained medical professionals who diagnose and treat various health conditions, from minor illnesses to chronic diseases, while emphasising preventive care through regular checkups, vaccinations, and health education. Acting as gatekeepers, GPs coordinate patient care, referring them to specialists when needed. Countries that have achieved universal health coverage—such as the UK, Australia, and Canada—rely heavily on GP systems to improve accessibility, ensure continuity of care, and enhance health outcomes.\nDespite progress in Bangladesh's health sector, primary healthcare (PHC) remains inadequate, particularly in rural areas where access to qualified doctors is limited. Urban areas, on the other hand, lack a structured PHC delivery system, forcing citizens to rely on hospitals and informal healthcare providers. This leads to high out-of-pocket expenses.\nUHC, which envisions accessible, affordable, and quality healthcare close to home, remains an elusive goal in Bangladesh. A well-structured GP system could take us one step ahead. It could revolutionise healthcare delivery by ensuring that every individual has access to a registered family doctor. A proposed GP model for Bangladesh would assign a medical team to every 5,000 people, led by a graduate doctor. Families would register with a GP team, with the flexibility to change providers every six months. GPs would be contractually appointed, with performance-based renewals tied to measurable outcomes like healthcare provision and patient satisfaction. Vulnerable populations would receive free or subsidised services, while emergency care, including ambulance services, would be universally free.\nUnder the system, the existing infrastructure, such as community clinics in rural areas, could minimise implementation costs. In urban areas, rented facilities could serve as GP centres. An integrated approach linking the GP system with the broader healthcare network would be essential for success. Public-private partnerships (PPPs) are essential for bridging gaps in the country's healthcare system. While current PPPs focus primarily on construction models, there is untapped potential in service-driven contracts, such as operation and maintenance, and greyfield upgrades.\nHowever, the integration of the GP system into government structures requires a robust payment model. Salary-based systems may fail to motivate, whereas pay-for-performance or fee-for-service models incentivise quality. Bundled payments, capitation or global budgets offer flexibility, but payment models must prioritise comprehensive care, including promotion, prevention, treatment, and rehabilitation.\nPPP agreements must include clear quality indicators. The private sector is adept at maximising profit; therefore, the government must skilfully set and enforce quality standards within contracts. Transparent performance reporting and strong monitoring frameworks are essential to maintaining accountability and ensuring that healthcare providers meet their obligations. The experience of integrating PPPs in other sectors offers valuable lessons for healthcare. By aligning community clinics, government structures, and private partnerships, Bangladesh can create a more equitable, efficient, and patient-centred healthcare system.\nEven so, the financial viability of a GP system poses significant challenges. Bangladesh's low tax-to-GDP ratio, lack of social insurance frameworks, and predominantly informal workforce are major barriers. Global models, such as tax-based systems in the UK and Canada, performance-linked funding in Sweden and New Zealand, and mixed approaches like Singapore's, offer valuable lessons. Emerging economies like Rwanda and Thailand demonstrate the feasibility of community-based insurance and capitation-based funding for GP systems.\nFor Bangladesh, direct contributory mechanisms for the informal sector are impractical in the short term. Despite these challenges, several avenues could be explored, such as: i) redirecting unutilised funds within the health sector budget; ii) imposing targeted taxes on sugary beverages, luxury goods, and tobacco; iii) leveraging corporate social responsibility (CSR) funds; and iv) introducing minimal monthly charges or per-minute phone call fees. However, university students, formal workforce groups like garment workers, and other groups like bank account holders and microcredit beneficiaries, may be brought under compulsory health insurance schemes.\nBangladesh's COVID vaccination programme which successfully registered over 13 crore individuals using national identity cards (NIDs), highlights the potential for technology-driven healthcare solutions. A nationwide health card system could centralise patient data, enabling personalised, data-driven care. Additionally, artificial intelligence (AI) and the Internet of Things (IoT) could streamline healthcare processes by enabling real-time health data tracking, efficient referrals, and better care coordination.\nThe feasibility of these models has already been demonstrated through initiatives like UNICEF's Aalo Clinic programme in urban areas and Palli Karma-Sahayak Foundation's (PKSF) Samridhi programme in rural areas across Bangladesh. These examples highlight the scalability of the GP system in both rural and urban settings. By leveraging existing infrastructure, integrating advanced technology, and prioritising primary care, Bangladesh can build an equitable, efficient, and future-ready healthcare system.\nIntegrating the GP system into Bangladesh's broader healthcare infrastructure is a critical step toward achieving UHC. While it presents challenges, health experts generally agree that it is feasible with clear aspirations and a comprehensive, well-thought-out plan. Annual performance audits, based on defined quality metrics, will identify service gaps and areas for improvement, with public reporting enhancing transparency. A well-functioning complaint redress system will also be crucial for resolving patient grievances and maintaining satisfaction. It is important to avoid shortcuts and carefully consider the ground realities to prevent the common pitfalls that often arise during implementation.\nThe authors are members of UHC Forum and PPRC and experts in the health sector.\n\nViews expressed in this article are the authors' own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Reimagining primary healthcare through the GP system ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/reimagining-primary-healthcare-through-the-gp-system-3852341",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-03-2025"
    },
    {
        "full_article": "Several years ago, while preparing for one of our brand management classes at Dhaka University, we searched for a suitable example of a brand that significantly contributes to a country's GDP. We found a few well-known brands from the US, such as Coca-Cola, Google, and Amazon. However, their contributions to GDP were not substantial, given the vast size of the American economy. One brand that caught our attention in Asia was Samsung, which seemed to have a significant impact on South Korea's GDP. According to a 2015 article published in The New York Times, the Samsung brand accounted for one-fifth of South Korea's exports and contributed approximately 17 percent of its GDP. Reflecting on the considerable impact of a single brand on a country's economy, we began to contemplate Bangladesh's RMG industry. The RMG industry contributed about 82 percent of total exports and 12.69 percent of our GDP in FY2015-16. We tried to identify notable brands from the sector, but could not find any. Consequently, we intended to raise this point during the next brand management class discussion, but unfortunately, it was unsuccessful.\nAfter further investigation, we realised that Bangladesh primarily manufactures products for others, concentrating significantly on lower-value-added goods. While the sector does produce some higher-value-added products for major brands, the quantities are relatively small. Further analysis indicated that we have substantial expertise in both lower- and higher-value-added manufacturing, as the sector has been operating for over 35 years, and we possess the necessary hard and soft resources to produce all types of RMG products. This encouraging discovery led to some questions: when we are highly equipped, why do we only produce for others? Why can't Bangladesh have its own global brand? We only get paid for stitching; the company that owns the brand enjoys the major share of the pie.\nIn 2017, Dhaka University hosted a seminar outlining the roadmap for Bangladesh to achieve its $50 billion target for the RMG sector by 2021. We posed a question to the chief guest, who was both an RMG businessman and the state minister of an important ministry. We asked how realistic and sustainable the roadmap could be without our own Bangladeshi brand. He replied that we are not yet at a stage where we can have our own brand. This made me wonder why, despite having a mature industry and exceptional expertise in both hard and soft resources, we do not recognise the significance and necessity of establishing Bangladeshi RMG brands for the international market. Later, while conducting an ILO-funded research in the RMG sector, we asked the same question to several decision-makers from major RMG firms in Bangladesh. Most of their responses were along the line of \"creating a brand is expensive and demands a significant time commitment. It also entails considerable risks, as we are collaborating with big brands. We certainly want to avoid threatening our existing business.\"\n\nThe insights they shared are indeed true. However, Bangladesh has a comparative advantage over other nations from both the supply and demand sides. We have the necessary infrastructure, manufacturing efficiency, and the presence of feeder industries; thus, the upstream value chain is mostly well-established, except for occasional vulnerabilities in yarn supply. Additionally, Bangladesh is familiar with the downstream value chain as it effectively utilises it for its buyers. Consequently, establishing this chain would be less challenging, aside from the need for acceptance from independent international retailers and their willingness to feature Bangladeshi brands on their shelves, as well as consumer preference for these brands.\nBangladesh is strongly positioned to gain preference from both retailers and consumers. This is because these key downstream actors recognise that Bangladesh can produce high-quality products as a country of origin. Bangladesh has been manufacturing top-notch clothing for brands like Tommy Hilfiger, Giorgio Armani, Hugo Boss, Zara, and H&M, with \"Made in Bangladesh\" tags on the clothing that customers see. Therefore, the country-of-origin-based points of differentiation are already acknowledged by both retailers and end customers. If customers encounter a new brand that is of good quality and carries a \"Made in Bangladesh\" tag, they are unlikely to dismiss the brand outright. Besides those who are hardcore loyal to a particular brand, many customers will certainly be interested in trying the new brand from Bangladesh.\n\nAccording to Bangladesh Garment Manufacturers and Exporters Association (BGMEA), our apparel exports worldwide reached $38.48 billion in 2024. Although we still have considerable progress to make to achieve the previously set $50 billion target, there are ample opportunities to extend this goal within the $1.84 trillion global market. Unfortunately, without owning brands and benefiting from the premiums that established brands command in the value chain, it will be challenging for Bangladesh to capitalise on the available opportunities in the global clothing market. Creating and sustaining a brand in the international market is an expensive endeavour. However, a few companies have the financial capacity to do so. If it seems too costly and risky for major RMG players, a consortium could be established to create and develop a Bangladeshi apparel brand, allowing for shared risks. BGMEA could lead this initiative.\nLet us conclude with the Samsung story. Samsung has inspired other South Korean brands like SK, Hyundai, and LG, and nearly half of South Korea's GDP comes from Samsung and its success-inspired brands. These companies compete globally—most are going head-to-head and succeeding in their respective industries. They are sometimes viewed as the frontrunners of innovation in their fields. When will Bangladesh witness a day when it can proudly say our apparel brands are the market leaders and innovators in the global apparel industry?\nDr Muhammad Ismail Hossain and Dr Nasrin Akter are professors in the Department of Marketing at the University of Dhaka.\n\nViews expressed in this article are the authors' own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "It’s time Bangladesh built its own global apparel brand",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/its-time-bangladesh-built-its-own-global-apparel-brand-3852106",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Exigency of loans for CMSMEs",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/exigency-of-loans-for-cmsmes-1742401696",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Efficient use key to  energy security",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/efficient-use-key-to-energy-security-1742401742",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Waste burning in open area",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/waste-burning-in-open-area-1742401765",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Banking reform a vital step",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/banking-reform-a-vital-step-1742401788",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-03-2025"
    }
]