[
    {
        "full_article": "The majority decision by a Bench of the Supreme Court to reverse its May 2025 order, which had stayed the grant of post-facto environmental clearances, illustrates the difficulty of dealing with the seemingly irreversible consequences of a much-abused law. The controversy is also about the form of the Environment Ministry’s instruments that normalised those exceptions. The Environment (Protection) Act 1986 and EIA notifications of 1994 and 2006 are framed around prior environmental clearance (EC), which means that large construction and industrial projects must not start work until an authority has assessed their consequences. Decisions by the Court including Common Cause (2017) and Alembic Pharmaceuticals (2020) treated post-facto EC as impermissible where prior EC was mandatory. The order in May, in Vanashakti, read this as ruling out post-facto ECs altogether for such projects. The new majority does not say ‘EC first’ is no longer the rule but locates a narrow space for post-facto clearances by relying on Alembic, D. Swamy, and others to allow ‘regularisation’ when considerable resources have already been committed, usually with fines. This still means that the Ministry can maintain ‘EC first’ as the legal default and allow post-facto clearances only in rare, highly constrained cases. In any case the spirit of the EC regime remains ex ante.A clearance granted after construction has begun or finished cannot replicate the EIA’s rationale, which is to make environment-related decisions before the potential cumulative consequences are underway. Post-facto clearances can only impose penalties, prescribe mitigation or order closure or demolition. Even if the judiciary permits such ECs in some circumstances now, the clearances will be remedial and sit uneasily with the structure of environmental jurisprudence in India since the 1990s. The majority’s concern about differential treatment of past and future violators is also understandable, even if its remedy is not. Vanashakti struck down the 2017 notification and subsequent Environment Ministry office memoranda that facilitated post-facto ECs, but it let existing post-facto ECs stand. The majority treated this as discriminatory, which is fair, but unequal treatment during a shift from a permissive to a stricter regime is to be expected during regulatory housekeeping. Its existence does not by itself require that an old route be revived. The Court has also recalled the bar on post-facto ECs and reopened the legal question, indicating that limited post-facto regularisation is not in itself untenable. In the end, the Ministry must treat post-facto ECs as exceptional not least because they are inherently at odds with the legal framework. Any complaint about discrimination between past and future violators should be addressed by tightening legacy clearances, not by normalising post-facto regularisation. Published - November 20, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        environmental issues\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "Breaking the rules: On the reversing of the Vanashakti ruling",
        "headline_2": "Post-facto clearance must remain the exception, not the rule",
        "link": "https://www.thehindu.com/opinion/editorial/regulations-and-violations-on-the-reversing-of-the-vanashakti-ruling/article70298450.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-11-2025"
    },
    {
        "full_article": "Saudi Crown Prince Mohammed Bin Salman’s visit to the White House marked the official end of a brief chill in relations between the most powerful country and the most influential Arab state. Ties had hit a low after Jamal Khashoggi, a Saudi dissident journalist in the U.S., was murdered inside the kingdom’s consulate in Istanbul in October 2018. U.S. intelligence agencies later concluded that MBS had ordered the killing. During his election campaign, Joe Biden had vowed to hold MBS accountable. Yet, it was Mr. Biden who took steps to rehabilitate the prince. He travelled to Jeddah in July 2022 where he greeted the heir to the Saudi throne with a fist bump. Donald Trump, who brokered the 2020 Abraham Accords, has been keen to deepen America’s traditional ties with its Arab partners. On Tuesday, he defended MBS’s human rights record, claiming that the prince “knew nothing” about Khashoggi’s murder. He also promised to sell tanks and F-35 fighters to Saudi Arabia, despite Israel’s objections. It will also get access to America’s most advanced computer chips. MBS is seeking to build vast data centres to transform Saudi Arabia into a technological power house.Historically, Saudi Arabia’s abysmal human rights record has played little role in shaping its relationship with Washington, long anchored in geopolitical and energy interests. There have been moments of strain, such as the 1973 oil shock, the post-9/11 distrust or the chill after the Khashoggi murder, but both sides have consistently prioritised strategic alignment over values. One persistent complication, however, has been Israel, America’s closest regional ally, which does not have formal diplomatic ties with Riyadh. After the Abraham Accords were signed, the Biden administration pushed Saudi Arabia to join the framework by normalising ties with Israel. MBS had said in September 2023 that Saudi Arabia and Israel were in an advanced stage of negotiations. But the October 7 Hamas attack and Israel’s genocidal Gaza war halted the momentum. Today, Saudi Arabia says it remains open to joining the Accords, but only if there is a credible, time-bound path towards a two-state solution to the Palestine question — a position Israel opposes. Mr. Trump appears to have realised both the regional complexities and Israel’s intransigence. He now seems prepared to deepen ties with Saudi Arabia without demanding an immediate commitment to recognise Israel. In effect, he has de-hyphenated Saudi Arabia from the Abraham Accords, for now, choosing instead to cultivate direct, stronger ties with the kingdom, which he views as central to his broader West Asia plans. Published - November 20, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Saudi Arabia\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        Turkey\n                    \n                            /                      \n                        \n                        US PRESIDENTIAL POLLS\n                    \n                            /                      \n                        \n                        United Arab Emirates\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        human rights\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        murder\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict",
        "headline_1": "Reset with Riyadh: On U.S.-Saudi Arabia ties",
        "headline_2": "The United States seems to have de-hyphenated Saudi Arabia and Israel in its West Asia plans",
        "link": "https://www.thehindu.com/opinion/editorial/reset-with-riyadh-on-us-saudi-arabia-ties/article70299291.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-11-2025"
    },
    {
        "full_article": "Terrorism cases need speedy disposal. SC’s 6-month guidance should jolt govt to beef up NIA courts & NIA\nSC has again urged Centre to speed up trials in NIA cases, this time with the welcome recommendation of a “six-month” time frame. It’s no secret that justice moves slowly in India. The reason is also well-known: shortage of judges. In July, 371 posts of judges – 33% – were vacant across high courts alone. But the country’s NIA courts make these numbers look good. By govt’s own admission in Sept, only three of the 50 designated NIA courts exclusively dealt with NIA cases. That means judges in these courts had to divide time between ordinary criminal cases and high-profile terror trials, “at the cost of…hundreds of undertrials who are languishing in jail, senior citizens, marginalised persons”. \nThe result is long delays. Baramulla MP Abdul Rashid Sheikh, for example, has spent years in jail after being named in a terror funding case. He requires custody parole to attend Parliament every time. That’s why SC had warned in July that it would release undertrials in NIA cases if their trials took too long. Since then, govt has been working to strengthen NIA courts. Talks are on with 11 states, but space has been a hurdle for setting up the 10-12 planned exclusive NIA courts.\nBesides, NIA has its own staff woes that slow down probes. Of its 1,901 sanctioned posts, 541, or 28%, were vacant in June this year. These include ground roles ranging from constable to inspector. After the Nov 10 Delhi blast, filling up these posts should be a priority. And to ensure that terror accused are brought to justice swiftly, NIA courts with adequate staff and infrastructure should be set up, per SC’s directions. The top court has sought a firm decision by Dec 16. Govt should stick to the deadline.\n\n",
        "headline_1": "Trial & Terror",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/trial-terror/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-11-2025"
    },
    {
        "full_article": "Women now swing the vote\nLike washing powder, are women the ‘New, Improved’ version of ‘booth-capturing’? Looks like they can finally deter the gents from the usual patriarchal put-downs. Nitish Kumar is welded to his seat because Mithila is happily (and safely) cycling to school in Bihar which was once the world’s bottom-ranker. Maithili is doing ditto into the mainstream. She’s shed the figurative ghunghat; though it may be a while before she victoriously twirls a gamchha. Don’t worry. it’ll happen. ‘Arrey kuchh na, hamaar time aayi!’  \n‘Give a woman an inch and she will become a ruler.’ Nice to know.\nMeira Kumar or even Rabri Devi don’t deserve the ‘beti, bahu, biwi’ scoff  label. Jagjivan Ram’s daughter won her own name-fame during her five years  as Speaker of 15th Lok Sabha. Rabri Devi, as proxy CM, was more business-like, unlike Lalu’s languorous tea-shop style. Their anointed heir is being deflated by his prickly sisters – soon after the electorate did.\nTheek ba, rajniti alag ba, so forget curated political routes. Bucking Bihar’s backward ‘streeotype’ are street-smart women influencers. Not just Patna’s  Maddhu Singh and Nisha Srivastava, but Bhagalpur’s Divyasha Kumari and Ritu Singh from (I looked it up) Barhiya. Even cooler are stand-ups like ‘Bihar ki Biharan’ Shreya Priyam, or ‘weak independent woman’ Sharon Verma whose self-confident self-deprecation mines the routine derision of their state and its people.    \nNitish K may have been branded ‘Paltu Ram’, but his defection to women’s empowerment is win-win. He’s not only made them wield the karchi-ladle as ‘rasoiya-didis’ churning out wholesome midday meals for schoolkids. He’s also made them wield lathis via police reservation – thus raising them from sattu-staple to satta-authority, from litti to choka-ing crime. Kyunki saas bhi kabhi bahut sassy ho sakti.\nYes, you’ve come a long way, bahini. Keep showing those cement-headed netas that there’s as much electoral gain from intra-structure which bridges gender chasms. As the jailor ‘Mistress of Murderers Row, Countess of the Clink, Matron Mama Morton’ in the musical Chicago didn’t quite tell Roxie Hart  ‘When you’re good to Mahila/Mahila votes for you.’ \n                                            ***\nAlec Smart said: “Trump is no longer screamin’, ‘Yeh dil MAGA more!’.”\n\n",
        "headline_1": "Chula to Jhoola",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/chula-to-jhoola/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-11-2025"
    },
    {
        "full_article": "Politics is very different in these two big states, but for next year’s polls, the party’s base strategy will be similar \nMahila vote finely targeted in Bihar, while caste remained the narrative, it’s interesting that Modi yesterday made a pan-India outreach to ‘farmers’ – another category of his four ‘castes’ – from India’s most urbanised state Tamil Nadu, agriculture just 13% of its economy. Modi was in Coimbatore, the assembly seat BJP’s nominee won the last election, narrowly beating Kamal Haasan. In 2021, BJP sent four MLAs to TN’s 234-seat legislature with 2.6% votes. It had won four seats of 21 contested in 2001 too, then in alliance with DMK under Karunanidhi but crashed in 2006 when 221 of its 225 candidates lost their deposit. But its vote share has stayed between 2% and 3% since 2001. Quarter century and five elections on BJP and DMK are at extreme ends politically and ideologically, their battles bitterly fought.  \nIn TN, handlooms supplement farm incomes that, like everywhere else, are suffering the uncertainties of climate change. CM Stalin just ahead of PM’s visit sought Centre address the challenges of TN’s surplus paddy production this year – increase procurement, raise moisture limit, allow bigger packs to speed up mill ops. TN also wants GST on mango pulp to be reduced from 12% to 5%. What electoral narratives will finally emerge closer to the elections – if campaigning hasn’t already begun – are unknown but no doubt, caste will never be too far away, framed in TN as a battle on sanatan dharm.\nIn Bengal too, voting alongside TN in about six months, caste and faith will collide for political rivals, incumbent Trinamool and main opposition BJP, to carve up the electors-market in ever new target groups. Thirty years of Left’s ‘party-society’, where the go-between for govt and public were party workers, crumbled effortlessly under CM Mamata Banerjee for all manner of fault lines to be expressed – subcastes, Gorkha subnationalism, religion, language – and new local bosses’ drew their own lines for hooliganism. A new fault line is the Bengali Muslim as ‘infiltrator’. BJP’s progressed handsomely in Bengal, scooping up 77 seats and 30% votes in 2021, from 3 seats and 10% votes in 2016, up from 2% votes in 2006. Its gains in volatile Bengal where Mamata Banerjee is battling anti-incumbency and a thousand cuts also means the state where political violence is institutionalised risks frequent bloody clashes. On this, ditch the fighting – Centre and state must together ensure enough forces are on the ground to prevent party worker excesses.\nTN is rich and industrialised, Bengal relatively poor and agrarian. The two incumbents are on the same side only in their stand on new voter rolls, on language and likely, on mahila welfare and vote – women’s literacy in TN is 73%, in Bengal 71%. Fearsome election machinery on its side, the challenge for BJP is to find the right narrative pitch, and identify gaps in welfare and overlooked groups. No other way to breach TN and take over Bengal. \n\n",
        "headline_1": "TN, Bengal & BJP",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/tn-bengal-bjp/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-11-2025"
    },
    {
        "full_article": "What links America’s Epstein scandal to Bihar elections? The power of comedy \nAs much as the Epstein saga seems like a bottomless cesspit, its central disjuncture is how many of America’s rich and powerful, have been spotted swimming in it. Such disjunctures are comedy gold, but only if the comic has empathy and moral muscle, besides wit and intelligence. Lesser pens can trivialise the horrific abuse of children for TRPs. Finer ones can make a difficult topic accessible to people, even as they demand political accountability. While usually docile Republicans push Trump to cede ground on the release of the Epstein files, late night US TV has kept up its job of landing endless punches. These make clear how, despite recent setbacks, comedy still remains in better humour in this country than others.\nA lot of it is decidedly non-snobby. On The Daily Show, Josh Johnson described Republicans releasing 23,000 pages of Epstein documents to counter the three emails released by Democrats as “trying to hide pissing yourself by shitting yourself”. And Jon Stewart talked about how near-impossible it is to talk about this saga without sounding  “ejaculate-adjacent”. The verb ‘release’ being Exhibit A. There is an air of ‘vox populi’ about all this. It’s in the hoary tradition of jesters and wise fools. Another aspect of it is, as Shakespeare wrote in Twelfth Night, “What great ones do, the less will prattle of.” But great and less have to be understood as inverse as well. The Epstein files don’t just inveigh Trump and Bill Clinton. Peter Thiel, Noam Chomsky, Larry Summers, Steve Bannon – the Who’s Who featured here are from across the political, financial, academic aisles. When the moral squalor is in high places, political humour enables people to criticise it, whether or not the powerful are finally punished for it. \nIf the Epstein story has shown how humour keeps public attention focused on injustice in America, in India too standup is having a golden moment. Bihar elections, for example, put the spotlight on how many young people from the state are dishing out social-political laughter to packed clubs, from Gurgaon to Bengaluru. This is a new kind of ‘adda’ space – serving conscience plus chuckles. But whereas the worst that US comics have to fear is getting cancelled, here there’s the whole gamut of FIRs, arrests, physical attacks to be dreaded. This is very uncool. Comedy often turns sharper as the stakes go higher. It shouldn’t take uncommon courage to tell a stinging joke.\n\n",
        "headline_1": "It’s Serious, So Laugh",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/its-serious-so-laugh/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-11-2025"
    },
    {
        "full_article": "In the occupied West Bank, Palestinian villages have become open fields for illegal Jewish settlers operating under the protection of the Israeli army. In recent weeks, organised Jewish mobs, some armed with rifles and sticks, others carrying torches, have unleashed violence across occupied Palestinian towns and villages. It is not only that Israeli soldiers stand providing cover for the illegal Jewish mobs, but the army also blocks Palestinian farmers from accessing their farms for the annual olive harvest.\nThe Jewish mob's thuggery follows a clear pattern where settlers attack homes, burn olive groves, beat villagers and drive out farmers from their land. Multiple international eyewitness accounts and videos showed Jewish settlers descending from Jewish-only colonies, escorted by soldiers firing tear-gas or live ammunition at Palestinians defending their farms. Meanwhile, Western media copies Israeli military euphemising these attacks as \"flash points\" or \"friction.\"\nSince October, the olive harvest season in Palestine, Palestinian farmers have been attacked at least 259 times by illegal Jewish settlers. When Palestinian civilians attempt to defend their villages, they face violence—nearly 1000 died at the hands of Jewish settler mobs in the West Bank since 2023, including four American Palestinian citizens. Often, no charges were filed against the Jewish murderers. The violence has become so normalised that government ministers openly praise the mobs as defenders of \"the Land of Israel.\" Jewish settlers now act as shock-troops in a slow-motion official annexation strategy, blurring the line between state and vigilante.\nUnder the watchful eyes of Israeli soldiers, Jewish mobs attack journalists filming the olive harvest. Refusing to intervene, the Israeli army fired steel-plated rubber bullets and tear gas at the Palestinian farmers and international activists, dispersing the olive pickers and empowering the Jewish mobs to cut and burn olive trees. In another arsonist attack, Jewish settlers on November 13 torched a mosque, sprayed the walls with racist graffiti, and set cars ablaze.\nIt is an open partnership between the Israeli army and Jewish settlers under an apartheid occupation. A dual legal system where illegal Israeli Jewish settlers are governed by civilian courts, while Palestinians have little rights in military courts. The distinction is not administrative; it is what Jewish apartheid in Palestine looks like.\nAccording to Israeli and Palestinian human-rights groups, Jewish impunity is systemic: 97 percent of complaints filed against Jewish vigilantes resulted in acquittals or closed without investigation. In contrast, in Israeli military courts, 96 percent of the cases against Palestinians lead to convictions.\nBeyond direct mob violence, a parallel system of control is tightening the noose on Palestinian daily life. According to the Israeli newspaper Haaretz, there are 877 checkpoints and roadblocks restricting the movement of 3.3 million Palestinians across the West Bank, including East Jerusalem. Checkpoints are for the non-Jewish only natives, while the illegal Jewish settlers enjoy free movement on Israeli-only roads. These barriers are not for \"security,\" they operate as economic choke-points in a regime of systematic separation.\nThe economic and social cost for non-Jews is enormous. Trucks carrying perishable goods rot at checkpoints; workers lose entire shifts; ambulances sit in line. As one Palestinian described the ordeal simply: \"time is being stolen from us.\" The military checkpoints serve as a visible thread in a larger web of structural Jewish apartheid.\nCaught between armed Jewish mobs and military rule, Palestinians find no refuge in their own leadership. The Palestinian Authority (PA), remains largely paralysed or unable to defend them. While the PA maintains security cooperation with the occupier and silences dissent in the streets of Ramallah or Jenin, settlers torch olive groves a few miles away.\nInternationally, Israel continues to face little consequence. The United States provides billions in aid while shielding it from accountability at the United Nations. The EU issues perfunctory statements of \"concern,\" while maintaining preferential trade with Israel and continues to do business with the very settlements they describe as illegal under international law. By importing goods produced in illegal Jewish-only colonies, the EU, UK, and US are directly enabling Israel's racist mob culture.\nThese illegal colonies are bankrolled by an extensive network of Israel-first Zionist Americans, among them the Kushner family, and non-profit platforms, including several synagogues that openly host fundraising drives to finance the construction of Jewish-only homes on stolen Palestinian land.\nThis fusion of settler ideology and state power represents the logical endpoint of Israel's occupation. The army's policies ensure that every act of settler terror becomes yet another instrument in its overarching strategy. The apartheid wall, checkpoints, and military zones suffocate Palestinian life, while Jewish mobs terrorise their towns and villages.\nTo that end, the Jewish mob violence is not an aberration, but rather an inevitable outcome of a system built on Jewish supremacy and dispossession. As long as Western governments and media continue to ignore this silent Israeli war in the West Bank, as they did prior to October 7, 2023, in Gaza, Israel will persist in quietly sanctioning, arming and shielding the Jewish mobs.\nUnlike in Gaza, there is no organised armed resistance to defend Palestinians in the West Bank, no declared war zone, no pretext to hide behind. What Israel is doing exposes its cruelty in its rawest form. It is carried out in broad daylight against a defenceless people whose only crime is existing on their own land, refusing despair, where their mere survival has become an act of resistance. It is a 77-year-long, unprovoked, racist campaign of state-sanctioned Jewish-mob terror.\nThis is an abridged version of an article first published on Middle East Monitor on November 17, 2025.\n\nJamal Kanj is the author of Children of Catastrophe: Journey from a Palestinian Refugee Camp to America, and other books. He writes frequently on Palestine/Arab world issues for various national and international publications.\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "No refuge for Palestinians caught between Israeli military and Jewish mobs",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/no-refuge-palestinians-caught-between-israeli-military-and-jewish-mobs-4038636",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-11-2025"
    },
    {
        "full_article": "With the three main political players gearing up for elections, it appears that Chief Adviser Muhammad Yunus has managed to placate all sides with the four-point referendum proposal. They had fallen apart in bitter disagreement over the July charter ever since its signing in October. The chief adviser decided to address the nation as the parties remained entrenched in conflicting stances even after a one-week deadline from the government.\nHe outlined the key provisions of the July National Charter (Constitution Reform) Implementation Order signed earlier on Thursday, which has so far elicited a mostly favourable response from the parties. They have largely welcomed the order. There has not been much talk about the referendum itself or the order, however, which some have pointed out to be beyond the remit of the current government. The government has also not made any attempts yet to explain to the people what these points mean or even what the July charter really is. This article will strive to illustrate some issues raised by the referendum and other relevant aspects of the order. Let us discuss the four points of the referendum one by one.\nPoint one says that an election-time caretaker government, an Election Commission, and other constitutional institutions (i.e. the Ombudsman, the Comptroller and Auditor General, and the Public Service Commission) will be constituted in accordance with the procedures described in the July charter.\nExcept for the Election Commission, BNP had issued notes of dissent on appointments in each of the above. The party has been arguing that the formation of these institutions should be based on specific legislation and not be outlined in a manner that lacks accountability. The charter outlines several options to appoint the head of the caretaker government. While BNP agrees with the first two options, it had submitted a note of dissent when the third option is to be invoked. However, all those notes of dissent appear to have been brushed aside in the referendum.\nThe second point states that the next parliament will be bicameral. A 100-member upper house will be formed on the basis of proportional representation of the votes received by political parties in the national election. It also states that any constitutional amendment will require a simple majority of the upper house.\nOnce again, BNP had registered its note of dissent both regarding proportional representation and the requirement of upper-house approval for constitutional amendments. The order again does not appear to heed BNP's notes of dissent. The party had contended that the upper house should reflect the distribution of seats in the lower house and, further, that since upper-house members are not directly elected, they should not have the power to weigh in on constitutional amendments.\nThe third point obligates the winning parties in the next election to implement the 30 proposals of the July charter that enjoy consensus among all parties. These include increasing women's representation in parliament, electing the deputy speaker and parliamentary committee chairpersons from the opposition, limiting the term of the prime minister, enhancing the powers of the president, etc. This point places a binding commitment on the next ruling party that it must implement these proposals, although they are not exhaustively listed anywhere.\nThe fourth point states that other reforms mentioned in the July charter will be implemented as pledged by the political parties.\nThis acknowledges that parties may choose to implement other proposals as they see fit and according to the positions they submitted to the commission. This provision clearly recognises the notes of dissent of different parties, and thus BNP's objections regarding the Anti-Corruption Commission, the energy regulatory commission, or the appointment of the central bank governor will come into play, since none of these are constitutional bodies.\nThe implementation order also envisions a Constitutional Reform Council that will be effective for 180 working days starting from the first sitting of the incoming parliament. Further, this council will double as a parliament and as a reform council to institute constitutional changes outlined in the July charter. The order states that constitutional reform proposals will require a simple majority of the council to be carried through.\nNow, at first reading, it appears that the 180 days amount to six months or more since they are described as \"working days\". However, there is still a distinction to be made as to whether working days refer to the number of days that parliament will be in session or simply regular weekdays as the rest of us would think of them. If it refers to the parliament's sitting days, then it would take much longer than six months. In fact, it might take up to two years or more for parliament to sit for 180 days, during which time the council would remain operative.\nAlso, the simple majority requirement does away with the two-thirds majority rule for changing the constitution, which in spirit contradicts the current constitution. This also creates the danger of the ruling party or coalition making other changes to the constitution, or changing parts that were not on the table to begin with. Further, this simple-majority rule would eliminate any requirement that amendments be bipartisan. The two-thirds rule at least assured broader support within parliament.\nOn the face of it, BNP appears to have softened its stance on most of its objections, as have Jamaat and NCP. Thankfully, it seems parties are willing to move away from their initial positions and gear up for elections.\nHowever, the people still have a right to know, since they will be voting yes or no. The provisions of the charter aside, the points of the referendum itself require thorough clarification from the government so that citizens know exactly what they are voting for and its potential consequences. After all, it is the people whom the government must cater to, not just the political parties.\nTanim Ahmed is digital editor at The Daily Star.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Citizens deserve clarity before a referendum vote",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/citizens-deserve-clarity-referendum-vote-4038206",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-11-2025"
    },
    {
        "full_article": "In the wake of the recent amendments to Bangladesh's labour law, Kalpona Akter,president of Bangladesh Garment and Industrial Workers Federation, spoke with Monorom Polok of The Daily Star about factory owners' anxieties over the new unionisation rules, the inclusion of domestic and non-profit workers under legal protection, and other issues.\nHow do you respond to owners' associations' concern that allowing just 20 workers to form a union could disrupt production and create chaos in factories?\nBefore I offer my perspective, it is important to first clarify where responsibility lies. The factory owners themselves are entirely responsible for the situation they now call harmful to the industry. For all the things involved, there is no one else to blame—not the workers, not the labour leaders, not the government, not any international organisation.\nAbout seven or eight years ago, a complaint was filed with the International Labour Organization (ILO) governing body under Article 26 against Bangladesh for violating Conventions 87 and 98—those concerning freedom of association and collective bargaining. It clearly showed, with evidence, that workers in Bangladesh were not free to form or join trade unions.\nDrawing from my experiences, this is not something entirely new. Around three decades ago, when I used to work in a garment factory, I was expelled and blacklisted simply because I joined and facilitated the formation of a union. The situation has not changed even today, as owners treat it like a crime whenever workers try to form unions or even express interest in learning more about their rights. They harass workers inside and outside the factory premises, often dismiss them, and even physically assault them. Sometimes the workers are also forced to leave their communities.\nThe owners believed that since they had possessed political connections and power for the last 15 or 16 years, it would always remain the same for them. They regarded themselves as kings and the workers as merely subjects. Subsequently, even after the ILO complaint, they did not seem to consider it seriously.\nThe interim government has now removed this obstacle for two main reasons: firstly, the working class and trade unions have been fighting for their rights for years now. Secondly, the government could not risk losing credibility in the international arena. The ILO had already been pushing for compliance, and both the European Union and the US trade channels, which have major business ties with Bangladesh, have been putting pressure in this regard. Thus, this change was inevitable and long overdue.\nThe owners' fear that this change will disrupt work is a misplaced perception. At least a single union was bound to be formed. Earlier, the law allowed up to three unions in a factory. However, for years, the owners' syndicate used their influence and did not allow even one union to form or exist in a functioning way. Now, there might be more than one, depending on the situation. In some factories, unions might form with seven percent of workers; in others, it can be 12 percent or 13 percent, and in some cases, unions can be formed with 20 percent of workers. Depending on the factory size, the magnitude of the unionisation will vary. On the workers' front, this is a major achievement.\nEarlier, there was some sort of arrangement with the labour ministry that if one union were registered, no second one would be approved. Garment owners took advantage of this loophole, and also formed what we call \"yellow unions,\" created by the management itself. They now claim that there are 1,400 unions in operation, but in reality, more than half are defunct. There are fewer than 50 factories with any active Collective Bargaining Agreement (CBA).\nSo, this fear the owners express is less about disruption and more about losing control. Although they verbally acknowledge workers as an equal part of the system, they merely believe in it. If they did, they would have agreed to sit down for negotiations. Furthermore, owners take part in spreading misinformation as well, as seen in the Adamjee Jute Mills case. They claimed that the mill closed down because of labour unions, which is based on no truth. Adamjee was shut down mainly due to political interference and mismanagement, not unionisation.\nIf both owners and workers are willing to comprehend and respect the amended law, even five unions in one factory will not be an issue, as negotiations would go through a CBA process.\nThe amended law also brings domestic workers, seafarers, and non-profit employees under legal protection for the first time. What is your assessment of this inclusion?\nIt is truly historic. Just two days before the amendment, the ILO ratified three major conventions. I was a bit disappointed that Bangladesh had not ratified Convention 189 on domestic workers, but later, the amendment eased my disappointment.\nFor the first time, domestic workers, seafarers, and non-profit workers—who have long been invisible—are now being recognised under the amended law. That is a remarkable step forward.\nBut we also need to talk about what this means in practice. For domestic workers, the biggest change will be in how employers treat them. Of course, we are yet to know about the extent of benefits that are to be included in the final gazette. But even with the amendments in place, there is a cultural barrier at play, as domestic workers are often disregarded as \"workers\" due to social stigma.\nFor example, in a household, a domestic worker might work from 12pm to 3pm, including lunchtime. But providing lunch to the worker is often at the mercy of the household owner or employer. If a domestic worker requests lunch, it is often considered unacceptable, although it might fall well within the worker's rights.\nHowever, domestic workers often have more negotiation power than, say, garment workers. Employers cannot just dictate terms. Domestic workers often set their own rates and even ask for a raise. That can be seen in a positive light. Nevertheless, domestic workers tend to face more serious issues than other workers, such as domestic abuse, sexual harassment, and gender-based violence. That is why legal protections for them are absolutely crucial. Moreover, most of our recommendations for the amendments were included in the final gazette, and it shows progress, even if small.\nBangladesh has often been praised for passing progressive laws, but implementation remains a challenge. How do you think this new amendment might be implemented?\nImplementation is going to be the real test. On paper, it looks good, but without proper enforcement, it will be rendered meaningless.\nIf we look at our history, no government has ever truly stood on the side of the workers. They have always adhered to the interests of the businesses. The first responsibility of the next government must be to break that pattern. In this case, the interim government has shown some commitment, and the political parties campaigning to assume power have also shown support. But we need to learn from our past and refrain from repeating the same pattern.\nAdditionally, we need proper infrastructure to make implementation feasible. For example, the Department of Inspection for Factories and Establishments (DIFFE) has repeatedly complained about insufficient manpower and resources. If the state can recruit hundreds of police officials, why not more inspectors to protect workers' rights? Bangladesh has over seven crore workers; therefore, protecting their rights should be a national priority. A large, well-resourced, and sustained institution must be built for this purpose.\nThe pilot project, the Employment Injury Insurance (EII) scheme, is also an important step in this process. If it can be actualised into a law and implemented properly, it could cover all workers nationwide. Whatever may be the case, we cannot leave things on paper. Implementation must start; there is no alternative to it.\nWe are living in a changing time, and I'm hopeful. People from all walks of life have become more politically aware, and the actions of the government do not easily go unchecked anymore. Therefore, there lies a strong scope for accountability, and the law must be implemented accordingly.\nFinally, what message would you give to both workers and owners as this transition unfolds?\nTo the workers, I would suggest staying united, knowing their rights, and utilising the fresh avenue the amendments have offered. For the owners, they must accept the change and cooperate. They have long benefited from a system that silenced workers, but that time has come to an end.\nIf both sides approach with mutual respect, this can be a turning point in Bangladesh's labour history.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "‘Factory owners’ fear of labour unions stems from their loss of control’",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/interviews/news/factory-owners-fear-labour-unions-stems-their-loss-control-4038211",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-11-2025"
    },
    {
        "full_article": "The rise in the country's fertility rate, as revealed in the Multiple Indicator Cluster Survey 2025, should serve as a wake-up call for policymakers. After decades of remarkable progress, bringing the Total Fertility Rate (TFR) down from 6.3 in 1975 to 2.3 by 2012, the rate has now increased to 2.4. This reversing trend is worrying. Experts warn that without effective family planning and population policies, it could negatively impact the country's economy, education, health, and overall development.\nThe survey shows that contraceptive use among married women has fallen from 62.7 percent in 2019 to 58.2 percent, while access to modern methods has also declined, with 73.5 percent of women's needs met, compared to 77.4 percent in 2019. Moreover, the rise in fertility occurs alongside some other worrying social indicators. For instance, child marriage, though reduced to some degree over time, still remains alarmingly high. Reportedly, the rate of child marriage among girls under 18 in Bangladesh is still 56 percent, which is unacceptable. Moreover, the number of adolescent girls aged 15-19 who have already had children has risen sharply, from 83 percent in 2019 to 92 percent. Teenage childbearing is clearly one of the major contributors to the rising fertility rate.\nThe survey also highlights some meaningful progress in health and nutrition. For example, institutional deliveries have risen to 71 percent, and skilled birth attendance has reached 77 percent, marking significant improvements in maternal health. The under-five mortality rate has fallen from 40 to 33 per 1,000 live births, while infant mortality has improved from 34 to 29 per 1,000. These gains show that well-designed interventions can deliver results, giving hope that renewed efforts in family planning can reverse the current trend as well.\nWe, therefore, urge the government to revise its family planning programmes and policies and take coordinated action across ministries. It must immediately strengthen its family planning services, including ensuring an uninterrupted contraceptive supply, rebuilding outreach networks, and restoring strong community-level engagement. Preventing child marriage must also be prioritised, with necessary support systems and incentives to keep adolescent girls in school. Awareness campaigns targeting young couples, especially in poverty-affected areas, are equally essential. Without such urgent interventions, the decades of progress made in population control and management risk being undone.\n",
        "headline_1": "Rise in fertility rate concerning",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/rise-fertility-rate-concerning-4037296",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-11-2025"
    },
    {
        "full_article": "The International Crimes Tribunal-1 has sentenced deposed prime minister Sheikh Hasina and former home minister Asaduzzaman Khan Kamal to death for crimes against humanity committed during the mass uprising last year. The tribunal has also sentenced former police chief Chowdhury Abdullah Al-Mamun, who is a state witness and has pleaded guilty, to five years' imprisonment. The case concerns the brutal killing of what the UN estimates to be around 1,400 protesters during the July-August uprising.\nSheikh Hasina was sentenced to death on two charges. She received the death penalty for Charge 4, concerning the shooting and killing of six unarmed protesters in Dhaka's Chankharpul on August 5 last year. Charge 5 relates to the shooting of six student protesters in Ashulia on the same day—five of whom were later burned after death, while the sixth was allegedly set on fire while still alive.\n\nHasina was also sentenced to imprisonment until natural death for making inflammatory remarks and ordering the use of deadly weapons against protesting students. Under Charge 2, she was found guilty of ordering the killing of student protesters through the use of helicopters, drones, and lethal weapons. According to the tribunal, Asaduzzaman was sentenced to death on two charges. Prosecutors filed five charges against the accused, including failure to prevent murder, amounting to crimes against humanity under Bangladeshi law. They also asked the tribunal to confiscate the assets of all three defendants, if convicted, and distribute them among the victims' families.\nThe court's conclusion regarding Sheikh Hasina's superior command responsibility in the execution of the atrocities by subordinates, including the police forces, has been well established. The UN Human Rights Commission's report also corroborates this. Videos, verified by international organisations and media, of law enforcers and security forces shooting down unarmed protesters have evidenced the brutal and deliberate use of excessive force. The deaths of small children who happened to be in the line of fire when security forces shot from helicopters have been widely reported by the media, including our own paper. Audios of telephone conversations provide further reinforcement of the allegation that the former PM, along with her aides, was complicit in planning the crackdown and instructing subordinates to carry it out in the cruellest way. As the tribunal has found, none of the accused took any steps to prevent the atrocities committed by law enforcers, nor did they take any measures against them after the fact. Given such compelling facts, the verdict was inevitable.\n\nFor the families of the martyrs, as well as the thousands of protesters who have been permanently disabled by the horrific shootings during the uprising, the verdict against the former prime minister and former home minister may provide some measure of closure. We hope that, as the cases under the ICT continue, all legal steps are taken for the sake of transparency and fairness.\n",
        "headline_1": "An inevitable verdict",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/inevitable-verdict-4037021",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-11-2025"
    },
    {
        "full_article": "It is frustrating that despite the promises of last year's July uprising, where women played a key role, they continue to be systematically sidelined from political power. Over the past year, their participation has also declined across various sectors. A recent discussion organised by a newly formed platform called Women in Democracy has again highlighted this troubling reality. Sadly, the July National Charter has also failed to address women's rights or their political participation in a meaningful way.\nPatriarchal dominance has, in fact, intensified since 2024, as speakers at the event noted. Harassment of women in public and digital spaces has reportedly increased, but political parties have shown little interest in taking up this cause. Women who entered politics after the uprising also face an increasingly hostile environment, ranging from cyberbullying to social pressure. This is most evident in the ongoing debate over women's parliamentary representation. The Election Reform Commission had proposed 100 reserved seats filled through rotation-based direct elections, a system that could have given women genuine democratic legitimacy. However, the National Consensus Commission rejected this proposal, and the July National Charter retained only 50 reserved seats (gradually increasing to 100), mandating that parties nominate just five percent women in general seats (rising to 33 percent by 2043). When women constitute half of the population, can offering them only five percent representation in parliament truly be considered democratic?\nUnfortunately, our political parties seem to remain largely indifferent to women's political participation. The BNP's nomination of only ten female candidates, including its Chairperson Khaleda Zia, for the upcoming national election is a case in point. Reports also suggest that no party has taken meaningful steps to end the long-standing suppression of women activists and leaders within their internal structures.\nDirect elections are crucial because they grant women independence, visibility, and legitimacy, none of which symbolic quotas can deliver. At the national conference of the Forum for Women's Political Rights (FWPR) held on October 9, activists rightly demanded that all political parties be legally required to nominate at least 33 percent female candidates, gradually rising to 50 percent, through amendments to the Representation of the People Order (RPO). Because without binding legislation, parties will continue to prioritise rhetoric over real change.\nThe July uprising ignited hopes among people to end exclusion, discrimination, and undemocratic practices. Yet the reforms enacted since then have fallen short of creating the inclusive democratic culture that people demanded. We urge all political parties, particularly major ones like the BNP, to include more women in decision-making positions. Unless women's participation within parties and their representation in parliament increase significantly, meaningful change in our political culture will remain elusive.\n",
        "headline_1": "We need more women in politics",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/news/we-need-more-women-politics-4036456",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-11-2025"
    },
    {
        "full_article": "We condemn the recent spate of violence seemingly orchestrated as part of Awami League's \"Dhaka lockdown\" and nationwide \"shutdown\" programmes, in reaction to the International Crimes Tribunal's announcement of the verdict date in a case against Sheikh Hasina. In five days since Tuesday, more than 30 arson attacks—mostly targeting buses—and crude bomb blasts took place, with two deaths reported. Comments made by members of the AL on social media, alluding to the \"success\" of the programmes, indicate that the party has been involved in instigating these vicious acts. A driver was burnt alive and a passenger severely injured when a parked bus was set on fire in Mymensingh on Tuesday. Such acts are deplorable, suggesting that the AL, far from being repentant for its horrific role in the killing of over 1,400 people during the mass uprising, continues on a path of creating fear among citizens.\nThe violence has persisted, with several crude bombs detonated in Dhaka on Saturday, alongside arson attacks in three districts. According to a news report, police have arrested four activists of the AL and its affiliated bodies for allegedly engaging in these violent acts. Although law enforcement agencies are on high alert, with the government beefing up security in various locations, there is apprehension that further violence may occur following Monday's verdict in the case against Sheikh Hasina on charges of crimes against humanity.\n\nWhile the absconding leaders of the AL, whose political activities have been banned, appear to be instigating the violence through their supporters, other factors have also increased the likelihood of violence ahead of the national elections. A report in this daily revealed how leaders of the underworld, either recently released from prison or returning from abroad, have become very active, resulting in the recent spate of killings, extortion, and armed clashes in general. Most concerning is that police have received intelligence suggesting that underworld gangs could be hired as \"muscle\" during the elections to intimidate voters and attack rival campaigners. The possibility that the AL may also employ these criminals to create chaos during the elections cannot be ruled out.\nIt is disturbing to note that several notorious criminals have been released from jails since the uprising, while others have dared to return from abroad to resume their activities and \"reclaim territory.\" More than 1,300 firearms were looted from police stations during the uprising, many still unaccounted for. In addition, there has been a reported increase in illegal firearms entering the country through various border areas.\n\nThe government must, therefore, act swiftly to re-arrest identified criminals, initiate targeted operations to recover illegal firearms, and stop their influx across border points. Unless urgent steps are taken, violent crimes will continue, and the situation will become increasingly difficult to control.\n",
        "headline_1": "Stop the surge of violence urgently",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/stop-the-surge-violence-urgently-4036186",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 20, 2025 00:00:00  \nBangladesh's drive to build a substantial stock of rice to meet any contingency appears, on the face of it, to be quite logical. When the market is jittery despite a highly satisfactory boro--- the number one grain--- harvest, the government allowed 242 private traders to import rice. Now that Asian countries report record paddy harvests and India, the topmost rice exporter deregulates its export, price of the staple on the international market has dropped sharply. Traders who obtained import licences did not want to miss the opportunity. They rushed to import rice, particularly from India. Parboiled rice with 5.0 per cent broken rice was imported at only Tk 46 a kilogram. By September 400,000 tonnes of rice out of the 500,000 ceiling arrived in the country. The rest 100,000 tonnes may have been left for a bargain before import and use according to the situation. \nQuite intriguingly, prices of all varieties of rice have increased in times of both boro and aman harvests. Even the import of rice to the tune of 400,000 tonnes by September had no reflection on the staple's price. Earlier, prices of coarse and fine rice were increased by Tk 2.0 to Tk5.0 a kilogram but this year prices have soared by as high as Tk10 to Tk15 a kilogram. Another important factor is that the country's domestic rice production was 40.60 million tonnes in the financial year 2024-25, which is marginally lower than the previous year's 40.70 but more than enough for the country's need. The country consumes 35-37 million tonnes of rice annually. If these estimates are correct, why should the country have to import rice in the first place? Loss of food grains would not quite explain this. The business syndicate of importers, millers and middlemen are out to manipulate the rice market. \nSo, import of rice alone cannot restrain the volatility of market. If it did, the imported rice priced at Tk 46 a kilogram would have had a sobering impact on the rice market. Shortfall or not, the business syndicate knows how to skirt around any government restriction. In case of obtaining import licences, there were binding terms and conditions that the imported rice has to be disposed of in the open market by September 30 but the deadline has been extended up to November 30. The conditions also make it incumbent on the importers that they sell rice in the original packages and report to the district food controllers on their stocks, storage and sale in order to avoid rebranding of imported rice. \nIt is quite clear that the gap between the imported price at Tk 46 a kilogram and selling price of even coarse rice at Tk 65-70 leaves a huge profit margin. A reasonable profit margin would have helped bring down prices of all types of rice but this has not happened. The coarse variety is now sold nearly at prices of the medium grain and the medium's price has touched the finer variety with the finer grain selling at Tk 95-100 a kilogram. This happens when prices of rice have dropped by 35 per cent on the international market. Therefore, without reining in the business syndicates, the market of food and other essentials can never be made stable.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Import of rice alone can't stabilise market",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/import-of-rice-alone-cant-stabilise-market-1763566166",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       November 20, 2025 00:00:00  \nDigital financial transactions have increased by leaps and bounds over the past decade in Bangladesh, primarily driven by the impressive growth in the number of Mobile Financial Service (MFS) users. Estimates suggest that there are now more than 90 million active MFS users in the country, collectively conducting daily transactions worth nearly Tk 50 billion. With such rapid expansion in digital transaction, one would expect the dominance of cash to ebb gradually and the economy to move steadily towards a less-cash system. \nHowever, the dominance of cash is showing no sign of abating. As the latest Bangladesh Payment Systems Report 2024 published by Bangladesh Bank reveals, although digital transactions - covering payments through mobile wallets, internet banking, and other electronic channels grew in volume in 2024, their share of total payments actually declined. The report shows that traditional, non-digital payments are now expanding faster than digital channels, while MFS are experiencing a drop in transactions. \nAccording to the report, digital payments rose from 366.7 million transactions in December 2023 to 403.1 million a year later. However, their share of total payments dropped from 51 percent to 47 percent. In value terms, too, digital channels posted only marginal growth, increasing from Tk 751.4 billion to Tk 763.4 billion - a decline in share from 29 percent to 28 percent of total transaction value. In sharp contrast, non-digital payments expanded rapidly, growing 31.4 per cent in volume and capturing an even larger share of the total value.\nThis reversal underscores that a majority of people remain accustomed to traditional transaction systems, while it also reveals structural challenges within MFS that policymakers must address if the momentum towards a less-cash economy is to be sustained.\nBangladesh Bank attributes this trend to the increasing preference of MFS users for cash-out services over digital-to-digital transfers. This means that most users are relying on MFS primarily to send money from one place to another, rather than using their mobile wallets for day-to-day financial transactions. If users are increasingly withdrawing cash instead of keeping money within the digital ecosystem, the ambition of moving towards a cashless or less-cash economy is bound to falter.\nThis is particularly concerning at a time when policymakers have been emphasising the need to expand cashless systems, especially given that the country spends an estimated Tk 200 billion annually on cash management. This staggering expenditure covers the printing of currency, security, managing idle cash and operating ATM networks. Experts suggest that shifting towards a less-cash economy by expanding MFS usage and incentivising digital payments would significantly reduce these costs, and also enhance financial transparency.\nIn this regard, Bangladesh can take a leaf from neighbouring countries' playbooks on how they succeeded in popularising digital transactions. India's Unified Payments Interface (UPI), launched in 2016, has become one of the world's most successful real-time payment platforms, handling nearly 20 billion transactions a month with a transaction value approaching USD 290 billion. A key driver of India's success in popularising cashless transaction is that UPI offers completely free P2P transfers and most QR-based payments at zero cost, making digital payments more attractive than cash. \nSri Lanka, meanwhile, introduced its national QR standard, LankaQR, in 2018 and formally launched it in 2019 to promote interoperable, low-cost digital payments, including for feature-phone users. Pakistan's Raast platform, launched in 2022, offers free P2P transfers and has recently been supported by a government subsidy covering a portion of merchant QR transaction costs to accelerate adoption. These regional examples demonstrate the importance of cost-free transactions, interoperability, and government-supported incentives in driving mass adoption of digital payments.\nBangladesh's digital payments landscape is shaped largely by the dominance of MFS. Customers can receive funds free of cost, but cash withdrawals incur service charges. According to a study by Transparency International Bangladesh (TIB) Bangladesh has the highest MFS service charges among neighbouring countries. For instance, withdrawing Tk25,000 via bKash costs Tk372.5 to Tk462.5, compared to Tk355.7 in Pakistan (Easypaisa), Tk231.3 in Myanmar (Wave Pay), and no charge in India (Phone Pay).\nApart from high service charges, the universal Quick Response (QR) code payment system introduced by Bangladesh Bank, known as Bangla QR, is yet to gain popularity. Launched in January 2023, Bangla QR was designed to standardise QR-based payments across all banks and platforms. However, even nearly after three years, it remains absent from most storefronts. Many banks don't even have the updated mobile apps to support Bangla QR. Instead, stickers from mobile financial service providers like bKash and Nagad dominate the market, leaving the unified system struggling to gain a foothold.\nThe situation is similar for TakaPay, the local currency debit card introduced in late 2023 to reduce reliance on global payment networks such as Visa and Mastercard. Despite being the first of its kind, only eight banks currently offer it, and most consumers remain unaware of its existence.\nAgainst this backdrop, experts argue that even if 5 per cent of Bangladesh's annual cash-management expenditure - estimated at around Tk 200 billion - were invested in promoting digital payments, the long-term economic gains would be substantial. Effective coordination among Bangladesh Bank, commercial banks, MFS operators and payment service providers is crucial to ensure seamless transfers from bank accounts to MFS wallets and to facilitate interoperability across all MFS platforms. Besides, Bangla QR and Taka Pay systems need to be promoted to increase digital payment system. Bangla QR and TakaPay also need stronger promotion to expand digital payment usage. \nThe authorities can begin by mandating the use of Bangla QR for all merchants and shops. Obtaining or renewing a trade licence could require displaying a valid QR code. QR codes may also be issued to all bank, MFS and PSP users to enable quick person-to-person transfers. In addition, QR-based payments can be integrated into government service platforms, including electricity bills and Metro Rail ticketing. Such measures would significantly boost public awareness, increase the use of digital transactions, and accelerate the country's transition towards a modern, transparent, and efficient digital economy.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "What's holding back growth  of cashless transactions?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/whats-holding-back-growth-of-cashless-transactions-1763566198",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 20, 2025 00:00:00  \n\nNational University, the largest higher education institution in the country, serves students from remote villages to major cities. However, prolonged administrative inefficiency, session backlogs, delayed results, careless script evaluation and unreasonable fees have caused widespread frustration and anxiety among students.\nExaminations are often conducted long after the scheduled time, with results taking three to six months, or even longer after re-evaluation requests, to be released. Shockingly, in 2025, students are still being asked to sit for 2023 exams, while 2024 exams may only be held by 2026. Such delays disrupt academic planning, limit employment opportunities and cause severe mental stress.\nFinancially, the burden is heavy. Board challenge or re-evaluation fees are BDT 1,200 per subject, with additional charges for form submission and grade improvement exams. In the era of online processes and digital management, such costs are unreasonable and unjustifiable.\nEqually concerning is the quality of script evaluation. Many students face incorrect marking; in some cases, previously failed subjects are later upgraded to A+ or first-class after re-evaluation. Recently, only 68 per cent of fourth-year students passed their exams, while in some departments, up to 50 per cent failed a single subject despite passing all others. Students unable to afford re-evaluation fees are forced to repeat a year, adding further stress. Professional, attentive, and accountable evaluation is urgently needed.\nThese systemic failures result in session backlogs, wasted time and financial hardship for millions. When the nation's future depends on higher education, such inefficiency is unacceptable. Immediate reforms are essential: reduce re-evaluation fees, review form submission charges, conduct exams on time, publish results promptly and strengthen script evaluation standards. Prompt and effective measures are crucial to safeguard the future of students and the nation.\nRaisul Islam Rifat\nStudent\nAnandamohan College\n National University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "NU students facing myriad problems",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/nu-students-facing-myriad-problems-1763566219",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 20, 2025 00:00:00  \n\nBefore the city wakes, Rashed, a 23-year-old delivery rider in Dhaka, is already on the road. Rain, heat, or traffic accidents don't stop him - only exhaustion does. Like thousands of others, he keeps Bangladesh's digital economy running while risking his health, safety, and life. It is work of blood, sweat and sacrifice that no app ever acknowledges.\nBangladesh now has over 1?million gig workers, from ride-sharing drivers to freelancers and delivery riders. Apps promise speed, convenience, and modernity, but behind every click are workers pushing themselves to the limit just to survive in today's economy. Surveys reveal that over 90 per cent fear for their safety, yet most platforms offer no accident insurance. Many sacrifice sleep, ignore injuries, or work 100+ hours per week just to survive. Flexible work has become a euphemism for relentless survival.\nThis workforce powers a business model designed for efficiency, not fairness. Platforms avoid providing formal employment benefits, rely on algorithms to push performance and penalise delays. Investors celebrate growth, but the human cost remains invisible until accidents, burnout, or public outrage exposes it.\nRegulation exists but is weak. Labour laws rarely protect gig workers, and enforcement is inconsistent. Without fair pay, insurance, safe conditions and accountability, Bangladesh's digital economy risks becoming a booming story of profit built on invisible suffering. Rashed's daily struggle is a reminder: behind every tap, click, or delivery lies a human life and progress that ignores them is nothing but a fragile illusion.\nJannatul Mawa \nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Invisible hands behind digital boom",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/invisible-hands-behind-digital-boom-1763566239",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-11-2025"
    }
]