[
    {
        "full_article": "In ensuring the screening of the film Thug Life — thespian Kamal Haasan plays the lead role — in Karnataka, the Supreme Court of India has unequivocally asserted a fundamental free speech principle that certified films cannot be stifled by protests or a recourse to “hurt sentiments”. Following Mr. Haasan’s comment in a pre-launch event, that Kannada was born from Tamil (it is factually inaccurate as both languages have been known to share a proto-Dravidian ancestor), the film has faced an extra-judicial ban in Karnataka; the Karnataka High Court had suggested that he apologise. The Supreme Court’s directions however repudiate this “moral” position taken by the High Court, bringing into focus the judiciary’s role as a guardian of due process. After the film was certified by the CBFC, there should be no fetters on its release, and, therefore, the extra-judicial ban violated the rule of law. The film certification framework, governed by the Cinematograph Act, 1952 and its rules, is designed to safeguard creativity, while maintaining a balance between constitutionally mandated free speech and reasonable restrictions. The CBFC, equipped to vet films with these legal standards, is solely tasked with doing so. Amorphous groups claiming “hurt sentiments” to intimidate a film’s release have no role in this. Giving in to such claims risks violating free speech rights and hurting the livelihoods of actors, artists, technicians and workers. The top court rightly characterised extra-judicial bans as a direct infringement on film-makers’ constitutionally guaranteed right to freedom of speech and expression.By emphatically rejecting the extra-judicial ban, the Court has reiterated its positions that maintaining law and order in the face of divergent views is the state’s responsibility. It is vital to understand that certified and regulated freedom of speech, as assessed by the CBFC, is distinct from hate speech, which finds no constitutional protection and can be legally restricted. This crucial distinction underscores that legitimate artistic expression, once cleared by the designated authority, deserves state protection. Moving forward, the Court’s directions should pave the way for the state to provide institutional safeguards against unofficial bans overriding the CBFC’s certification and release. These could include holding theatre owners accountable for unwarranted cancellations of scheduled releases, policing guidelines that distinguish lawful dissent from illegal intimidation and also allowing for citizens to watch a certified film without fear.\r Published - June 21, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        film making\n                    \n                            /                      \n                        \n                        Karnataka\n                    \n                            /                      \n                        \n                        judiciary (system of justice)",
        "headline_1": "​No fetters: On Thug Life, extra-judicial bans",
        "headline_2": "In Thug Life case, Court upholds certified films against extra-judicial bans",
        "link": "https://www.thehindu.com/opinion/editorial/no-fetters-on-thug-life-extra-judicial-bans/article69718373.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "21-06-2025"
    },
    {
        "full_article": "Scientists from IIT-Delhi and the DRDO recently demonstrated a key advance in quantum cybersecurity that stands to revolutionise how the world will communicate in the future. The world’s secrets are currently stored and communicated via channels that are protected by difficult mathematical problems. Over the years, an increasing amount of computing power available to certain actors has forced these problems to become difficult and nigh-uncrackable. The imminence of quantum computing requires this paradigm to change because quantum computers can (at least on paper) solve problems currently out of reach of the most powerful conventional supercomputers. Quantum cybersecurity is one prong of this change, promising to protect communication channels irrespective of the computing power available to malicious actors. The IIT-Delhi and DRDO team successfully demonstrated a quantum key-distribution scheme through one kilometre of free space on the institute’s campus. Such a technology allows two individuals (or stations) located a kilometre apart to securely access messages they send each other. If an eavesdropper tries to intercept any message, instantaneous changes in the keys the individuals use to decrypt the messages will reveal the channel has been compromised, and in a way that the eavesdropper cannot prevent. If scaled up to include satellites, the technology could allow stations anywhere in India to exchange information through a quantum network without fear of being compromised.Herein lies the rub. Quantum communications is one of the four themes of the National Quantum Mission, approved in 2023 with an outlay of ₹6,003 crore until 2031. Many of the same problems assailing fundamental research in India have already beset research under the Mission, however. A small fraction of the outlay has been disbursed thus far even as venture capital flow into startups remains trivial. Scientists have complained that just-in-time funding, absence of single-window clearances, and documentation requirements have increased the duration of projects. There are persistent foreign hardware and software dependencies: materials required for specific use-cases, such as cryostats and sensors, need to be fabricated abroad while most quantum software stacks are currently implemented by multinational companies. Government pay does not match global offers and lack of timely access to resources has forced researchers to accept short-term contracts and rent equipment. In fact, India’s commitment, itself down from the ₹8,000 crore announced in 2020, is dwarfed by those of the U.S. and China, which are five- and 20-times higher, respectively. If the demonstration at IIT-Delhi is to scale, the government cannot simply ‘clip on’ scientific talent and technological and economic opportunity to existing infrastructure. Administrative reform is essential.\r Published - June 21, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        science (general)\n                    \n                            /                      \n                        \n                        cyber crime\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        research\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        China",
        "headline_1": "Quantum challenge: On IIT-DRDO demonstration of quantum key-distribution scheme",
        "headline_2": "Administrative reform is essential for India to make advances",
        "link": "https://www.thehindu.com/opinion/editorial/quantum-challenge-on-iit-drdo-demonstration-of-quantum-key-distribution-scheme/article69717803.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "21-06-2025"
    },
    {
        "full_article": "HCs and trial courts must follow SC’s line on free speech\nThe Constitution is clear – you have the right to freedom of speech and expression, subject to reasonable restrictions. But like an Ashokan edict carved in stone, the Constitution’s letter is only as good as the spirit of the institutions tasked with upholding it. In the Thug Life case, SC has once again struck a blow for free speech. While clearing the Kamal Haasan film’s release in Karnataka, it has made it abundantly clear that one person’s “hurt sentiments” are not a reasonable ground for curbing another’s right to expression: “In India…there will never be an end to the hurt sentiment phenomenon. But for that, right to free speech cannot be jeopardised…” Three months ago, in the Imran Pratapgarhi case, SC had forcefully made the same point: “Even if a large number of persons dislike the views expressed by another, the right of the person to express the views must be respected and protected.” \nAs the chief arbiter of the land, SC could not have made itself clearer in March any more than it can now. There’s no way its word can be misunderstood or misinterpreted. Yet, Calcutta HC told a 22-year-old early this month: “Look, we have freedom of speech but that doesn’t mean you will go on to hurt others.” Then, Karnataka HC told Haasan: “You or any citizen have no right to hurt sentiments of the masses…” And lower courts’ views on free speech are generally even more stifling. This divergence of opinion within the judiciary has a chilling effect on free speech because there’s only one SC above hundreds of HCs and subordinate courts. If free speech is a pillar of democracy, and a tenet of the Constitution, it shouldn’t have to run the gauntlet with the hope of eventual salvation in the apex court. \n\n",
        "headline_1": "Last word",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/last-word/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-06-2025"
    },
    {
        "full_article": "To really help, new HIV vax has to be made cheap \nA pill to treat multidrug-resistant HIV, lenacapavir, has been approved by US drug regulator FDA as a preventive vaccine. This is a huge deal – incidence of HIV may have declined since 1990s but even today about 13L people globally are infected by the virus every year. But its price is an obstacle. Sold for $28,218 per year in US, it’s prohibitive even for high-income nations. Pharma company Gilead that manufactures lenacapavir has reportedly tied up with over 100 middle- and low-income countries for manufacture of generics pending approvals. But access likely will still be tricky for poorer African countries that bear the HIV burden.\nDrugs to prevent HIV transmission have been around almost a decade, but a daily dosage regimen makes these unreliable. People forget and there’s the stigma/doubt in partners that a daily dose is preventive. Lenacapavir needs to be taken just twice a year. Its long-lasting effect in preventing infection – almost 100% in adults and adolescents – is thus the best bet today. Also because HIV research in US bears the additional burden of Trump administration’s slashed funds.\nAn effective vaccine for HIV has been elusive for decades because of its rapid mutations. Several mRNA vaccines, like those developed for Covid and considered the most promising, are in clinical trials. But since Jan, under Trump’s health secretary Bob Kennedy Jr, NIH stopped funding hundreds of such HIV vaccine-related research. This is what makes repurposed lenacapavir a lifeline, provided it’s made affordable. \n\n",
        "headline_1": "Dose of hope",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/dose-of-hope/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-06-2025"
    },
    {
        "full_article": "Great wealth brings great isolation, and a siege mentality\nThe most expensive car is worth only around $30mn and the most expensive watch, $55mn. If you’re a billionaire, neither will make you stand out in a ‘crowd’ of 3,000-plus other billionaires, collectively worth over $16tn. But stand out you must, because ‘esteem’ or ‘status’ is the fourth rung of the human hierarchy of needs, as psychologist Abraham Maslow declared 82 years ago. \nYou could buy a mansion, but the costliest on the market is worth some $300mn. On a good day, Elon Musk makes twice as much. Yachts are a better bet. The costliest is rumoured worth $4.8bn – just shy of Trump’s net worth – and even relatively modest ones, like Jeff Bezos’ $500mn ‘Koru’, cost many thousands of dollars per hour to maintain. There’s no return on investment here, only loss, and if you’re brave enough to bleed dollars without noticing, sociologists will now place you above the ‘haves’ as a ‘have-yacht’.\nIn his new book The Haves and Have-Yachts, New Yorker writer Evan Osnos dwells on this super-wealthy class and its quirks. In 2022, he’d written an article – The Floating World – focused on owners of ‘gigayachts’, that is yachts longer than 295ft, which already numbered around 100 then. But the book, which is a collection of his New Yorker essays on the super-wealthy – hence subtitled Dispatches on the Ultrarich – explores their attitudes, illustrated by actions.\nWhile Musk, possibly the wealthiest man in history, talks about settling Mars, other ultrarich have been making D-Day plans for Earth. Osnos writes about Reddit co-founder Steve Huffman, who got eye surgery done at 33 to improve his odds of surviving a disaster. Antonio Garcia Martinez, who used to be product manager at Facebook, bought five acres of woods on an island, and installed generators and solar panels there. What raised eyebrows, though, was his decision to bring thousands of rounds of ammunition. “I think people who are particularly attuned to the levers by which society actually works understand that we are skating on really thin cultural ice right now,” he told Osnos.\nThis survivalist streak also drives yacht-buying, says Osnos. Billionaire Peter Thiel, whose name crops up regularly in connection with America’s rightward swing, has been known to fund the Seasteading Institute, whose mission is to “enable floating societies which will allow the next generation of pioneers to test new ideas for govt”. Their website mentions “building startup communities that float on the ocean with any measure of political autonomy.” Read together, “new ideas for government” and “political autonomy” suggest a real estate analogue of cryptocurrency.\nOne of Osnos’ essays, ‘Ghost in the Machine’, offers a peek inside the money-making empires of tech moguls. For example, when Facebook Live faced the problem of livestreamed suicides, its chief technology officer sent an internal memo: “Maybe it costs a life by exposing someone to bullies. Maybe someone dies in a terrorist attack coordinated on our tools. And still we connect people. The ugly truth is that we believe in connecting people so deeply that anything that allows us to connect more people more often is de facto good.” \nTo ordinary mortals, who satisfy Maslow’s fourth level of needs with a new bag or a pair of shoes, these ideas and attitudes may be troubling, but it’s important to be acquainted with them, to understand the forces shaping our world.\n\n",
        "headline_1": "Haves’ guide to the lives of have-yachts",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/haves-guide-to-the-lives-of-have-yachts/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-06-2025"
    },
    {
        "full_article": "Israel and Iran have been sworn enemies for years. Just last Oct, Iran rained 180 missiles on Israel in one evening, but their ongoing fight, now in its eighth day, is different. It’s a direct military confrontation, minus the proxies. Both sides have hit residential areas as well as military sites. An Iranian missile barrage hit an Israeli hospital yesterday, while Israeli aircraft are targeting Iran’s nuclear facilities and missile launchers.\n \nRead full story on TOI+\n\n",
        "headline_1": "Five ways to West Asian meltdown",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/five-ways-to-west-asian-meltdown/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-06-2025"
    },
    {
        "full_article": "We are alarmed by the sheer number of students who are not taking this year's HSC and equivalent examinations, scheduled to start on June 26. According to a report, a total of 14,83,689 students registered as regular candidates under the 11 education boards—including the madrasa and technical boards—for the 2023-24 academic year. Among them, just over 10,50,000 filled out forms to appear in the exams. The remaining students—more than 4,25,000—did not. The reasons for such a large number of students dropping out at this critical stage of their academic journey must be addressed. If these students falter now, it will not only be detrimental to their individual futures but will also result in a substantial loss for the nation.\nWhile student dropout after SSC, HSC, and equivalent levels is common in Bangladesh, the situation is more severe this year, as the number of HSC examinees has dropped to the lowest in the past three years. Understandably, poverty is a major driver of absenteeism, while child marriage also plays a significant role: 51 percent of girls in Bangladesh are married before the age of 18, according to a recent UN report. Many students join the workforce immediately after passing the SSC exams. A recent survey on this year's absent SSC candidates has highlighted these issues. A similar survey should be conducted to identify the causes of absenteeism at the HSC level. Educationists say the rising cost of education could also be a factor behind dropouts.\nAccording to a report by the Dhaka education board, 40 percent of girls who failed to appear in this year's SSC exams had been married off before the exams, despite having completed exam registration. Over seven percent of students were absent due to entering the workforce because of financial hardship, while others missed the exam for reasons such as illness or lack of preparation. A similar situation appears to be contributing to absenteeism at the HSC level. The recent protests by some HSC candidates in Rajshahi or elsewhere also suggest that some students are unprepared to sit the exams.\nWe urge the authorities to address the root causes of students' exam absenteeism through effective measures. Ending child marriage, of course, should be at the top of the list of priorities. Equally important is ensuring that financial hardship does not force parents to withdraw their children from education. The government must keep education within everyone's reach by implementing meaningful reforms in the sector. No student should be forced to abandon their education under any circumstances.\n",
        "headline_1": "Why is HSC absenteeism so high this year?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/why-hsc-absenteeism-so-high-year-3921711",
        "news_paper_name": "The Daily Star",
        "publish_date": "21-06-2025"
    },
    {
        "full_article": "Israel, like many other colonial projects, was established through violence and has relied on the use of force to occupy Arab territory ever since. Understanding that its existence depended on having a superior military in a hostile region prompted Israel to initiate a nuclear weapons programme soon after its founding in 1948.\nEven though Israel was a young nation, by the mid-1950s, with the aid of France, it had secretly begun the construction of a large nuclear reactor. That two allies had teamed up to launch a nuclear weapons programme without the knowledge of the administration of President Dwight D Eisenhower turned out to be a colossal (and embarrassing) American intelligence failure.\nNot until June 1960, the final year of Eisenhower's presidency, did US officials catch wind of what was already known as the Dimona project. Daniel Kimhi, an Israeli oil magnate, having undoubtedly had one too many cocktails at a late-night party at the US embassy in Tel Aviv, confessed to American diplomats that Israel was indeed constructing a large \"power reactor\" in the Negev desert—a startling revelation.\n\"This project has been described to [Kimhi] as a gas-cooled power reactor capable of producing approximately 60 megawatts of electric power,\" read an embassy dispatch addressed to the State Department in August 1960. \"[Kimhi] said he thought work had been underway for about two years and that a completion date was still about two years off.\"\nThe Dimona reactor wasn't, however, being built to deal with the country's growing energy needs. As the US would later discover, it was designed (with input from the French) to produce plutonium for a budding Israeli nuclear weapons programme. In December 1960, as American officials grew more worried about the very idea of Israel's nuclear aspirations, French Foreign Minister Maurice Couve de Murville admitted to US Secretary of State Christian Herter that France had, in fact, helped Israel get the project off the ground and would also provide the raw materials like uranium the reactor needed. As a result, it would get a share of any plutonium Dimona produced.\nIsraeli and French officials assured Eisenhower that Dimona (now known as the Shimon Peres Negev Nuclear Research Center) was being built solely for peaceful purposes. Trying to further deflect attention, Israeli officials put forward several cover stories to back up that claim, asserting Dimona would become anything from a textile plant to a meteorological installation—anything but a nuclear reactor capable of producing weapons-grade plutonium.\nIn December 1960, after being tipped off by a British nuclear scientist concerned that Israel was constructing a dirty (that is, extremely radioactive) nuke, reporter Chapman Pincher wrote in London's Daily Express, \"British and American intelligence authorities believe that the Israelis are well on the way to building their first experimental nuclear bomb.\"\nIsraeli officials issued a terse dispatch from their London embassy, \"Israel is not building an atom bomb and has no intention of doing so.\"\nWith Arab countries increasingly worried that Washington was aiding Israel's nuclear endeavours, chairman of the Atomic Energy Commission John McCone leaked a classified CIA document to John Finney of The New York Times, claiming that the US had evidence Israel, with the help of France, was building a nuclear reactor—proof that Washington was none too pleased with that country's nuclear aspirations.\nPresident Eisenhower was stunned. Not only had his administration been left in the dark, but his officials feared a future nuclear-armed Israel would only further destabilise an already topsy-turvy region. \"Reports from Arab countries confirm [the] gravity with which many view this possibility [of nuclear weapons in Israel],\" read a State Department telegram sent to its Paris embassy in January 1961.\nAs that nuclear project began to make waves in the press, Israeli Prime Minister David Ben-Gurion moved quickly to downplay the disclosure. He gave a speech to the Knesset, the Israeli parliament, admitting the country was developing a nuclear programme. \"The reports in the media are false,\" he added. \"The research reactor we are now building in the Negev is being constructed under the direction of Israeli experts and is designed for peaceful purposes. When it's complete, it will be open to scientists from other countries.\"\nHe was, of course, lying, and the Americans knew it. There was nothing peaceful about it. Worse yet, there was a growing consensus among America's allies that Eisenhower had been in on the ruse and that his administration had provided the know-how to get the programme off the ground. It hadn't, but American officials were now eager to prevent United Nations inspections of Dimona, fearful of what they might uncover.\nBy May 1961, with John F Kennedy in the White House, things were changing. JFK even dispatched two Atomic Energy Commission scientists to inspect the Dimona site. Though he came to believe much of the Israeli hype, the experts pointed out that the plant's reactor could potentially produce plutonium \"suitable for weapons.\" The CIA, less assured by Israel's claims, wrote in a now-declassified National Intelligence Estimate that the reactor's construction indicated \"Israel may have decided to undertake a nuclear weapons program. At a minimum, we believe it has decided to develop its nuclear facilities in such a way as to put it into a position to develop nuclear weapons promptly should it decide to do so.\"\nAnd, of course, that's precisely what happened. In January 1967, NBC News confirmed that Israel was on the verge of a nuclear capability. By then, American officials knew it was close to developing a nuke and that Dimona was producing bomb-worthy plutonium. Decades later, in a 2013 report citing US Defense Intelligence Agency figures, the Bulletin of the Atomic Scientists revealed that Israel possessed a minimum of 80 atomic weapons and was the only nuclear power in the Middle East. Pakistan wouldn't acquire nukes until 1976 and is, in any case, normally considered part of South Asia.\nTo this day, Israel has never openly admitted possessing such weaponry and yet has consistently refused to allow inspectors from the International Atomic Energy Agency to visit the secretive site. Nonetheless, evidence suggests that a \"major project\" at Dimona was underway in 2021 and that Israel was by then actively expanding its nuclear production facilities. The absence of UN or other inspections at Dimona has resulted in no public acknowledgment from Israel regarding its nuclear warheads, leading to a lack of accountability. This situation renders their illegal bombing of Iran for its alleged nuclear programme all the more hypocritical.\nJoshua Frank is co-editor of CounterPunch and co-host of CounterPunch Radio. His latest book is Atomic Days: The Untold Story of the Most Toxic Place in America, published by Haymarket Books. He can be reached at [email protected] and his Bluesky handle is @joshuafrank.bsky.social.\n\nThis article was first published by CounterPunch on June 20, 2025. A longer version of this piece first appeared on TomDispatch.\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Israel’s nuclear deception: Flagrant lies and brazen hypocrisy",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/israels-nuclear-deception-flagrant-lies-and-brazen-hypocrisy-3921676",
        "news_paper_name": "The Daily Star",
        "publish_date": "21-06-2025"
    },
    {
        "full_article": "The chief adviser of Bangladesh's interim government and the current high-level leadership have repeatedly been calling upon the nation's youth not to chase jobs, but to become entrepreneurs. This message is undoubtedly positive, progressive, and timely. The question, however, is: where do these initiatives come to a halt, and why?\nIn today's reality, many young men and women, relatives of migrant workers, and even people over 50, are stepping forward with their small savings and limited capital to start micro-ventures, such as poultry farming, fish cultivation, and vegetable production. Their goal is simple: to stand on their own feet and contribute to national productivity.\nEspecially noteworthy are the remittance warriors working abroad—those who toil day after day on foreign soil to send money home. They provide their families not only sustenance but also the opportunity to dream. In many such families, agricultural farms, poultry sheds, fish ponds, and coconut or date orchards have been established with the money sent by returning relatives. We, too, are part of this wave. Our family members have been quietly planting dreams in the soil of our villages for years.\nBut these dreams can be destroyed due to a fundamental lack of accountability.\nRecently, a heartbreaking incident occurred at our family-owned multipurpose agricultural farm in Nahata union of Magura's Mohammadpur upazila. Over a hundred ducks and more than a hundred maunds of pond-cultivated fish died. Terrified, my family members made repeated calls to the local agricultural and livestock officials. But no one answered the phone or came to investigate.\nThis was not just a loss for one family; it was a significant social and economic setback.\nThe death of a farm and the inaction of the local administration indicate the potential facade behind our so-called \"development.\"\nAcross the country, at the upazila level, we have agricultural offices, offices of the fisheries department, livestock services, youth development bureaus, and employment and training centres. All these have salaried officers, monthly allowances, vehicles, phone lines, and even training budgets. But are they doing any fieldwork? Many entrepreneurs claim they don't see these officials even once a year. \nThe most tragic part is this: those who sacrifice their lives abroad and send back money for their families, face an administration that is indifferent and silent when they need state support the most.\nIs this what we call development? Is the wave of \"development\" limited only to megaprojects? Development means standing beside people at the grassroots, saving small entrepreneurs, and transforming remittance income into sustainable potential. If the state fails to do this, then calling upon youth to become entrepreneurs becomes nothing more than political rhetoric.\nWe who live abroad and still think of our country, support our families and keep the backbone of the nation strong with remittances—what do we get in return?\nThe questions are simple, the answers are hard. Must we turn to Dr Muhammad Yunus for answers? Because those who are responsible for running the country seem far too busy these days with politics and media showdowns.\nLet me end by saying: development is not just about bridges, flyovers, and tunnels. It is about saving a small poultry farm, keeping fish from dying in a pond, and standing by a dreamer who has limited resources. Development means a responsible administration at the grassroots, proactive communication, accountability, and real support.\nWe demand an end to this national mismanagement immediately. We are waiting for an accountable state, effective transformation, and a true citizen-state partnership.\nRahman Mridha is a researcher, writer and former director of Pfizer in Sweden. He can be reached at [email protected].\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Will our remittance warriors get government support to fulfil their entrepreneurial dreams?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/will-our-remittance-warriors-get-government-support-fulfil-their-entrepreneurial-dreams-3921671",
        "news_paper_name": "The Daily Star",
        "publish_date": "21-06-2025"
    },
    {
        "full_article": "We are alarmed by the level of microplastic contamination in our aquatic ecosystems. A recent study has found microplastic particles—smaller than 5 millimetres—in the intestines, liver, and even muscle tissue of hilsa fish. Heavy metals such as cadmium, lead, mercury, and arsenic have also been detected in the fish's body. These particles, originating from plastic bags, bottles, synthetic fabrics, tyres, and cosmetics, are ingested by fish as they make their way into rivers and oceans. This raises serious concerns about food safety in the country as hilsa is a widely consumed fish here.\nPlastic pollution, especially microplastic contamination, has now become a global issue, and Bangladesh seems to be in a more vulnerable state in this regard. Reportedly, between 2005 and 2014, Bangladesh experienced a 169 percent surge in plastic production, which is significantly higher than the global average growth rate of 25 percent. The presence of microplastics is higher in our coastal areas, where fishing boats and cargo ships dispose of plastic waste. Household waste disposal also contributes to this. So, fish in this area tend to ingest a higher amount of microplastics. Several studies have estimated that 10 to 30 billion microplastic particles are discharged into the Bay of Bengal daily through the Ganges River and its tributaries. The impact of this contamination is clearly visible at the Meghna estuary, which is the most important habitat and breeding ground of hilsa fish.\nPrevious research also found the presence of microplastics and heavy metals in hilsa fish from the Meghna basin and the Bay of Bengal. Not only hilsa, other fish and aquatic creatures are also vulnerable to plastic pollution. A 2022 study revealed that 17 species of fish and three species of shellfish from three key rivers in the Sundarbans were contaminated with microplastics. The study estimated that an adult consuming 300g of microplastic-contaminated fish muscle per week would ingest 74,282 microplastic particles annually, while a child eating 50g weekly would absorb 12,380 particles a year. These findings underscore the severity of plastic pollution in our aquatic ecosystems and the risks it poses to both marine life and human health. We need drastic action to reverse the trend.\nUnfortunately, despite the ban on single-use plastic, the authorities are failing to prevent its use or discharge into rivers, and they are also failing to enforce the ban on polythene bags. We therefore urge the government to take strict action to ensure enforcement, raise public awareness, and make alternatives to plastic products widely available for a greater effect.\n",
        "headline_1": "Microplastic contamination of hilsa was inevitable",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/microplastic-contamination-hilsa-was-inevitable-3919986",
        "news_paper_name": "The Daily Star",
        "publish_date": "21-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 21, 2025 00:00:00  \nThere is no denying that waterborne diseases like cholera, diarrhoea and typhoid pose a threat to physical wellbeing of children and adults alike in Bangladesh. According to an estimate, every year, 272,000 premature deaths occur simply because the victims lack access to safe drinking water. That means, unsafe water, poor sanitation and hygiene, in short, WASH, continues to remain a big challenge for the policymakers in the government demanding timely intervention with necessary budgetary allocations. But recent reports in this regard are indeed disappointing. In this connection, a coalition of civil society organisations, namely, Power and Participation Research Centre (PPRC), Water Aid, Fresh Water Action Network South Asia, Water for All and so on recently held a press conference expressing concern over the declining fiscal interventions, that is, budgetary allocations in these critical areas of human development. \nThe trend actually threatens the country's progress towards achieving sustainable development goals that include ensuring clean water and sanitation for all. In the proposed Annual Development Programme (ADP) for the fiscal year (FY) 2025-26, for instance, WASH allocations have dropped from Tk. 182.28 billion in FY 2022-23 to Tk 109.01 billion. However, the proposed amount for FY 26 is slightly higher than the current fiscal's revised ADP allocation at Tk.91.41 billion. Even so, the next fiscal's budgetary commitment for WASH is far below what is required to meet the challenges. Worse yet, whatever fiscal commitment for WASH is being made by the government is being tainted by a discriminatory approach to distribution of the fund among the different recipients. The Dhaka Water and Sewage Authority (WASA), for example, is slated to receive a larger portion of the allocation at Tk.31.4 billion than the Department of Public Health Engineering (DPHE), which is supposed to provide WASH services across the country. The city corporations, who are also important candidates for WASH allocations, are witnessing inequities since only seven out of all the 12 city corporations of the country are going to receive WASH allocations. Disparities also persist within intra-urban allocations. Apart from that, disparities are pronounced between urban and rural areas so far as WASH-related public investments are concerned. \nSuch negative approach is also evident in the vital areas of gender and social inclusion. In fact, the problem does not lie simply with curtailing of fund allocation for WASH. It has also to do with the mindset of the policymakers who set the priorities for budgetary allocation among different sectors. \nOn this particular issue, the head of PPRC, one of the concerned private organisations at a press briefing held recently emphasised that water and sanitation were not issues of merely technical nature. On the contrary, they are very much within the domain of fundamental human rights that encompass the citizens' essential health, dignity and resilience. In that case, the PPRC chief stressed that budgetary framework should reflect the importance of Water Supply and Sanitation when the impacts of climate change is worsening with attendant deepening of social inequalities. \nNow, it is not only the poorer allocations for the health and sanitation in the national budget that is the main cause of concern. International assistance for the WASH sector, too, has experienced a sharp decline recently. The USAID, which provided USD371 million in FY 24 for Bangladesh, has dropped to USD164 million in 2025. As a result, some programmes supporting health care, clean water, disaster response, education, etc., had to be shut down. So, it is time the government concentrated more on mobilizing internal resources with concomitant increase in budgetary allocations to ensure the citizens' basic rights including clean water, sanitation and hygiene (WASH).\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ensuring citizens'  basic WASH rights",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ensuring-citizens-basic-wash-rights-1750430105",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       June 21, 2025 00:00:00  \n\nAlbert Einstein once remarked that insanity is doing the same thing over and over again but expecting different results. That very cycle of repetition is playing out in the way revenue is being collected to finance the national budget. In the proposed budget for the 2025-26 fiscal year, the government has set an ambitious revenue target of Tk 5.64 trillion, with Tk 4.99 trillion expected to come from the National Board of Revenue (NBR). Few believe the NBR will be able to meet this target given its track record. Economists have said so. Observers have said so. Even NBR officials themselves have admitted as much. How could the outcome be any different when the same institution collected only Tk 3.82 trillion in FY 2023-24 and Tk 3.25 trillion the year before using the same old and exhausted methods! Even in the current fiscal year, projections suggest the deficit may exceed Tk 1 trillion. \nIf this were a time of political and economic stability, the target set for the NBR in the proposed budget would still have been difficult to achieve due to the existing tax structure and outdated collection mechanisms. But the current situation is far from stable. The country is in the midst of a transitional phase. Economic activity has slowed following the fall of the previous authoritarian regime, the investment climate remains subdued and law and order have yet to be fully restored. Worsening matters further is the internal turmoil within the tax administration itself. A section of customs and tax officials who had earlier protested the government's ordinance to restructure the NBR continues to demand the removal of the NBR chairman. This persistent internal discontent has created a tense and unproductive environment within the tax machinery. In such a volatile environment, it becomes even more difficult to imagine how the government can come close to meeting its ambitious revenue target. \nPart of the rationale behind setting such a high target lies in Bangladesh's tax-to-GDP ratio, which, according to the finance adviser's budget speech, stands at a modest 09 per cent. By international standards, this figure is indeed low. India's tax-GDP ratio, for example, hovers around 20 per cent. Nepal's exceeds 25 per cent. These comparisons are often invoked to justify ambitious tax targets. However, the case of Bangladesh is complicated by serious doubts surrounding the accuracy of its GDP figures. According to many experts, key economic indicators including GDP have been significantly overstated. The previous fascist government for various political and economic motives routinely disseminated inflated data. For instance, a 2022 World Bank report estimated Bangladesh's average growth rate between 2009 and 2019 to be 4.2 per cent, whereas official government figures claimed it was 07 per cent. These inflated numbers including the uncorrected GDP estimates continue to distort the real picture. Such exaggerations may be one reason why revenue collection appears to fall short, because the denominator itself is artificially high. Consequently, while the official target appears 9 per cent, the actual effective rate may be 11 or 12 per cent, placing undue strain on businesses and individuals. \nFaced with persistent revenue shortfalls, the government has opted to increase the tax burden rather than expanding the tax base as a way to boost income tax revenues. One such measure is the hike in the turnover tax. Under the new budget, companies and firms with an annual turnover of Tk 50 lakh or more, and individuals with a turnover of Tk 04 crore or more, will be required to pay a minimum turnover tax of one percent. Last year, this rate stood at 0.6 percent. This policy is deeply problematic. By its nature, turnover tax does not distinguish between profitable businesses and those operating at a loss. Even companies incurring losses must pay this tax, which is non-refundable as a minimum tax. In effect, this penalises struggling businesses. If a business generates no income, how can it be justified to impose an income tax? This tactic of taxing what is easy rather than what is equitable is fast becoming the norm for the government policymakers. Their response to revenue shortfalls is to mechanically raise the turnover tax, with little regard for fairness or the adverse impact on businesses and the broader economy. This method may yield immediate results but obviously does not serve the long-term objective of building a sustainable and just tax regime.\nSlow progress in tax collection in Bangladesh stems from widespread tax evasion, not from insufficient turnover tax rates. There are individuals and businesses who, despite substantial earnings, continue to avoid taxes either by not disclosing their assets or by underreporting income. Detecting such evasions is challenging but possible. Digitalisation and systematic data-sharing are essential prerequisites for success in this regard. Currently, the Bangladesh Road Transport Authority (BRTA) and the Dhaka Power Distribution Company (DPDC) share their data with the NBR. This collaboration needs to expand. The more such collaboration and integration occur between NBR and other public and private institutions, the more effectively tax authorities can identify evaders. \nA number of institutions and companies hold valuable client and consumer data that could significantly enhance tax intelligence. For example, access to utility service databases could help the NBR estimate property ownership, rental income and living standards. Similarly, access to regular banking data would be a game-changer. Banks serve as repositories of information on deposits, loans, foreign transactions and expenditures, all of which can help provide an accurate picture of an individual's or a company's financial situation. There is no doubt that establishing such a data-sharing system might have been difficult under a partisan government. But with an interim government now in power, one that is better positioned to withstand political pressures that typically obstruct such reforms, this is an opportune moment to push for its implementation.\nThere can be no doubt that absence of solid information provides cover for tax evasion. Until NBR closes this information gap, tax dodgers will continue to slip through the cracks and revenue collection targets would continue to remain unmet. \nshoeb434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Targeting revenue through unfair taxes",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/targeting-revenue-through-unfair-taxes-1750430163",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       June 21, 2025 00:00:00  \n\nAt least half of the urban population in Bangladesh does not have the convenient access to the public transport. An international study unveiled the finding a few years ago, based on data from 2020. It showed that around 51.80 per cent of the country's urban population have some convenient access to public transport. The same report, prepared by Our World in Data, mentioned that the ratio was 45 per cent in Sri Lanka, 39 per cent in India and 19 per cent in Pakistan. It means that, despite many problems, access to public transport in Bangladesh is better compared to that of peer countries in South Asia. Nevertheless, regular commuters in Dhaka and other major urban centres of the country may differ with the data, as they have to bear with the inconvenience of accessing public transport.\nThe globally recognised benchmark for convenient access to public transport is the distance from a location to a public transport node is not more than 500 meters so that it can be conveniently covered on foot. The convenience criteria also include the availability of buses and trains, especially during peak hours, adequate boarding and disembarking facilities in these transports, and stoppages at safe and comfortable locations. Although it is not always difficult in Dhaka to reach a public transport node by walking 500 meters or less, other amenities are largely absent. There is no timetable for public buses. A safe and comfortable bus stop is almost nowhere to be found. Moreover, the majority of public buses in Dhaka are mini-buses, which are unable to accommodate a large number of passengers at a time. Again, many of these buses are dilapidated and continue to pollute the air by spewing out thick clouds of black smoke, causing environmental pollution. \nOver the years, a number of attempts have been made by the governments to make bus-oriented public transport efficient. Most of the moves fail due to flawed planning and mismanagement. The overhead metro rail, introduced a few years ago, is the only efficient and convenient public transport in Dhaka, which has already gained tremendous popularity. There is a long-term plan to expand the metro rail network by constructing five additional routes, which may take two to three decades to complete. In the meantime, demand for public buses is expected to remain high even after all six metro routes become fully operational. Instead, better public buses are necessary to complement the metro rail and make overall public transportation more efficient in the long run. \nAttempts to discipline the public bus service have failed time and again, mainly due to the strong presence of rent-seekers in the sector. The Hasina regime provided political patronage, making the rent-seekers very powerful. The result is the criminalisation of the public bus sector. Even ten months after the fall of the autocratic regime of Hasina, the Yunus-led interim government has failed to make any tangible changes in the sector. It is now under the grip of newly emerged rent-seekers.\nThe proposed budget for the next fiscal year (FY26) also fails to address the issues relating to revamping the country's public transport, such as allocating a portion of the transport budget to replace the existing ramshackle public buses with newer, better ones. \nMoreover, the advance taxes on various types of public buses have been increased, which will take effect from the next fiscal year. For instance, a commercially running bus having 52 or more seats will be subject to Tk 25,000 advance income tax annually, which is now Tk 16,000. In a similar vein, buses having seats less than 52 will be charged Tk 20,000 instead of Tk 11,500. For air-conditioned buses, the tax will be much higher. No doubt that bus operators will charge extra fair to cover the tax hike, and passengers have to pay the ultimate price.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Budget again ignores  public transport",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/budget-again-ignores-public-transport-1750430207",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 21, 2025 00:00:00  \n\nAir pollution is one of the most serious environmental health threats of our time. While outdoor air pollution rightly receives widespread concern, the dangers of indoor air pollution often go unnoticed, despite being just as harmful, if not more so. In Bangladesh, this silent threat affects millions of households every day.\nA major source of indoor pollution is cooking fuel. In rural areas, many people still rely on wood, crop residue, or dung for cooking. These traditional fuels emit smoke and harmful gases, especially when used in poorly ventilated kitchens. Prolonged exposure can lead to respiratory diseases, eye irritation, and even long-term heart and lung complications-particularly among women and children who spend more time near cooking areas.\nEven in urban areas like Dhaka, where traditional stoves are less common, indoor air is not necessarily safe. Gas stoves without proper ventilation can release dangerous gases like carbon monoxide. In addition, indoor pollutants such as dust, mould, and chemicals from cleaning products, paints, furniture polish, and mosquito coils further degrade air quality. Poor indoor air also aggravates asthma and allergies, posing serious risks for elderly people and young children.\nAddressing this issue requires both awareness and action. Households should be encouraged to use cleaner fuels like LPG, ensure proper ventilation, and install exhaust fans in kitchens and bathrooms. Simple habits such as regularly opening windows and avoiding overuse of chemical products can make a meaningful difference. Indoor plants and air purifiers can also help improve air quality. There is a need to raise public awareness about indoor air quality, especially in low-income and rural communities.\nProtecting the air we breathe at home is essential for our health. These small but deliberate changes can make our living environments healthier and safer for all.\nAmena Akter Farhana\nDepartment of Economics\nGovernment Titumir College\nfarhanaaktheramena@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Indoor air pollution: A silent threat",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/indoor-air-pollution-a-silent-threat-1750430231",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-06-2025"
    }
]