[
    {
        "full_article": "The Supreme Court of India last week turned the spotlight on some controversial provisions of the Waqf (Amendment) Act, 2025 passed by Parliament recently. The amendments expand government control over waqf properties at the cost of the autonomy of the Muslim community to manage them. On April 17, the Court recorded the Centre’s assurance that waqf properties, including “waqf by user”, will not be de-notified and appointments will not be made to the Central Waqf Council and State Waqf Boards, based on provisions of the new law till May 5, the next hearing. The Centre thus preempted a judicial order which appeared possible during the hearing. The Court had raised concerns about the provisions in the new law which discontinued the category of waqf by user, made non-Muslims eligible for appointment in the council/waqf boards, and gave the state unilateral power to take over the control of waqf properties in the event of a dispute, pending its final resolution. The new law can potentially bring into dispute the legal status of many Muslim sites which came into existence before modern land registration laws were in place. Lawyers for the petitioners who are challenging the constitutionality of the new law, pointed out that as much as half of all waqf properties could be so by long usage and may lack documentation.There are around 100 petitions before the Court on the issue. Questions that it will have to settle include whether the provision that a waqf can be made only by persons who have demonstrably practised Islam for at least five years violates the right to freedom of religion; whether changes in the definition of waqf to exclude “waqf by user” are discriminatory and whether the proposed inclusion of non-Muslim members to the council/waqf boards violates Article 26. Article 26, among other things, guarantees a religious group the right to “establish and maintain institutions for religious and charitable purposes” and “to manage its own affairs in matters of religion.” True, some sections of these amendments promote inclusivity and wider representation of different sects of the Muslim community, and ensure transparency and accountability in the management of waqf properties. However, there are concerns about their impact and distortion of the religious nature of the waqfs. Though there were prolonged consultations and a long parliamentary debate before the law was passed, pointedly missing was any effort to take the Muslim community into confidence on a matter that affects it. The Court is now seized of these questions which will have ramifications for the character of India as a secular, pluralist country.\r Published - April 21, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Waqf\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        religion and belief\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "​Law of the land: on the judiciary and waqf amendments",
        "headline_2": "All aspects of the waqf amendments need a serious study",
        "link": "https://www.thehindu.com/opinion/editorial/law-of-the-land-on-the-judiciary-and-waqf-amendments/article69471582.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "21-04-2025"
    },
    {
        "full_article": "Affirmative action remains one of the most effective ways of addressing historical wrongs and systemic deprivation. The most recent attempt to address deep-rooted discrimination against persons with disabilities in Tamil Nadu is likely to have a far-reaching impact for the community. Chief Minister M.K. Stalin tabled two Bills in the Assembly last week to increase the number of persons with disabilities in all local bodies in the State. While one Bill seeks to nominate persons with disabilities to all town panchayats, municipal councils and municipal corporations with amendments to the Tamil Nadu Urban Local Bodies Act, the second intends to bring into law the decision to nominate one person with disabilities to all village panchayats, panchayat union councils and district panchayats by amending the Tamil Nadu Panchayats Act. Mr. Stalin said once these Bills are enacted, there would be guaranteed posts for 650 persons with disabilities in urban local bodies, 12,913 in village panchayats, and 388 in panchayat unions, besides 37 persons with disabilities in district panchayats. At the moment, there are only 35 persons with disabilities in urban local bodies, he informed the House. Besides ensuring dignity for persons with disabilities, and eroding stigma and discrimination, this change would empower the community, involving their representatives in decision-making at the grassroots level.It is the role of the government to take along its citizens, particularly those who may have an impediment that might come in the way of their harnessing equal opportunities as the rest of the population. After the 73rd and 74th amendments to the Constitution that allowed for one-third representation of all seats in panchayati raj institutions and urban local bodies to be reserved for women, some States, including Tamil Nadu, increased this to 50%. Since then, the very raucous and long-drawn-out battle was finally resolved in 2023, with the Women’s Reservation Act being passed for 33% reservation for women in the Lok Sabha and State Legislative Assemblies. This will be effective after the publication of the Census conducted following the Act’s commencement. Meanwhile, Tamil Nadu’s effort to appoint persons with disability is the first such effort in the country at bringing a marginalised community not merely into the mainstream but as leaders of society, thus raising their profile and larger acceptance, besides bringing change that will benefit the rest of the society. Given the initial experience of implementing women’s reservation in panchayati raj, where women panchayat leaders were de facto replaced by the husband in decision-making, it is important that the government ensures the benefit truly reaches the intended — in this case, persons with disabilities.\r Published - April 21, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        disabled\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        local authority\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        Reservation\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        constitution",
        "headline_1": "​Enabling legislation: on Tamil Nadu Bills, persons with disabilities",
        "headline_2": "Nomination of persons with disabilities to local bodies is a pioneering move",
        "link": "https://www.thehindu.com/opinion/editorial/enabling-legislation-on-tamil-nadu-bills-persons-with-disabilities/article69471304.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "21-04-2025"
    },
    {
        "full_article": "‘How I turned into Trump for three hours’\nAssuming that the American govt ever talks outside Signal, we will find out what the 47th US president and his advisers are thinking – when he declares, de-declares, quasi-declares and re-declares the cost of being in business with US – some 25 years from now, if the tariff memos are declassified. That’s just too late. But I may have stumbled upon the confounding map of Trumpian economics while playing Settlers of Catan.\nIt’s fairly straightforward and relatively low-conflict (as much as a colonisation-based game can be). You are a settler on a fictional island called Catan. You produce resources – wheat, sheep, wood, brick, ore – and use them to build roads, settlements, cities. Settlements get you one point, cities get you two. First to 10 wins. And anyone can block your supply lines with a robber.\nLast weekend, I was playing with this friend of 16 years – let’s call him A – who never loses. I hate it. And I had dragged a friend – we’ll call him M – into this interminable conflict.\nGame 1 | I had it all – I could produce all five resources, and I’d placed a robber to block A’s supply lines. But M stole nine bricks from me. My bricks – tediously earned by being where the resources were and thoughtfully hoarded!\nGame 2 | I never had the right mix of resources to make everything by myself. Bricks but no wood – I couldn’t build roads. Wood but no sheep – I couldn’t build settlements. But A and M made sneaky deals, and kept trading with each other – they were always flush with what they needed. I think the dice were biased.\nGame 3 | Right. Production and trade. I had to figure out both. I monopolised brick production, cordoned off ports, and built fast. Five settlements down, it was time to build cities. But…I couldn’t. Obsessed with bricks and roads and settlements, I’d paid no attention to ore, without which cities couldn’t be built. I looked around. Would A trade my bricks for some ore? No. Would M? No. Why wouldn’t they just do what I wanted? I was inches from victory. But now, I stayed put, while A and M raced ahead.\nI had lost all three games. Turns out you can’t wall yourself in and strong-arm your way to victory. Not even in a board game.\n\n",
        "headline_1": "In Catan world",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/in-catan-world/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-04-2025"
    },
    {
        "full_article": "Thackerays are expected to resurrect a subnational politics, a ground ceded to BJP’s nationalist Hindutva \nWatching Mumbai politics is like watching a NatGeo wildlife documentary. There’s the tiger’s crouch & pounce, the eagles circling to feed off movement on the ground, the studs warring to mark their territories, and cacophony of birds & bees, macaques & monkeys. The feverish speculation of Thackeray cousins patch-up that could spell an imagined revival of “an undivided Sena” for the “good of Maharashtra” has the political jungle’s creatures all perked up sniffing the air, ears alert, eyes wide open.\nThe family drama | Uddhav inheriting Shiv Sena led to cousin, anti-migrant hardliner Raj, exiting to form his own party, now electorally wiped out, although MNS cadre has a ‘value’ in creating ruckus. Uddhav lost the “original” party to Eknath Shinde and moved across the political divide to the relatively progressive secular side. But that didn’t pay off electorally. And Uddhav’s attempts at resurrecting his grandfather’s more inclusive politics haven’t seen much traction.\nThe party drama | Meanwhile, Shinde – who engineered a coup, whisked off partymen and workers, managed to become CM, and held his ground through Lok Sabha 2024 elections – was stunned by BJP’s enormous win in Nov’s assembly elections, killing his dreams of returning as an elected CM, making do with a deputy CMship. Now, the prospect of the Thackerays “coming together” has Shinde worried. The stoic exterior gave way to snapping at a reporter who asked him about the cousins.\nBMC polls | The task, and ask, is iffy. BJP, with its nationalist Hindutva, is on terra mega firma. MNS’s extreme position, and Uddhav’s flirting with centrist politics will need a meeting ground that can recapture the Marathi First political sentiment, a regional Hindutva. Brothers not at strife hardly indicate a New Sena politics – also, the party’s with Shinde. Mumbai’s municipal polls will be the test for any attempt at pulling together a new politics. The “emotional talks” don’t qualify even as a trailer. But Maharashtra’s on the watch, hawk-eyed.\n\n",
        "headline_1": "Cousins in arms",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/cousins-in-arms/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-04-2025"
    },
    {
        "full_article": "China dominated global shipping when others slept. US port fees can’t reverse the trend\nIn what could be another major hit to global trade, US last week unveiled new port fees for Chinese-owned or operated ships that call on American ports. The ‘tax’ will come into effect from Oct. These fees are a culmination of a US inquiry into China’s dominance of global shipping that was instituted under the Biden administration. The conclusion is that Beijing has used unfair practices – including huge state subsidies – to pummel competition in shipbuilding. Chinese-built ships today form a major part of the fleets of all top 10 global shipping companies, while Chinese shipping firm COSCO is the second-largest ocean transporter. With more than 80% of global trade carried out on ships, Washington believes the Chinese stranglehold on shipping must be broken.\nHowever, Washington’s plans previewed in Feb had caused alarm across the shipping industry. The unveiled fees are a watered-down version of what was initially threatened – up to $1.5mn per ship per port call. Instead, Chinese-owned or operated ships will be charged $50 per net tonne, while Chinese ships owned by non-Chinese firms will be charged $18 per net tonne. The rates will then increase by $5-$30 a year over the next three years. But coming on top of the 245% tariff on Chinese exports to US, the port fees will further burden American logistics firms and consumers.\nThere are two points here. First, it’s apparent that Team Trump is not thinking things through before announcing policies. This is highly disruptive and eventually leads to a rollback, eroding trust. Second, port fees are an unscientific way to revive US shipping. True, US was No.1 in this industry after WWII. But over the last decade-and-a-half China methodically went about dominating the industry, blurring the lines between its naval expansion and commercial shipping. In 2024, China State Shipbuilding Corporation constructed more commercial tonnage than the entire US shipbuilding industry since WWII. China today churns out more than 1,700 ships a year; US only about five.\nHence there’s no catching China here in the near future. But there’s a lesson too. Commercial shipbuilding is capital intensive but isn’t rocket science. Seafaring nations with large coastlines such as India too could have been players in this industry with proper planning. Indian ports have seen huge improvement with nine ranking among the top 100 globally. But little investment has been made in commercial shipbuilding, representing a huge missed opportunity. There’s no point in blaming China for this. \n\n",
        "headline_1": "Shape up or ship out",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/shape-up-or-ship-out/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-04-2025"
    },
    {
        "full_article": "Investors dread greedy, crooked startup founders\nAnother one bites the dust. The startup business is nine parts risk, maybe more. Anecdotally, over 90% of restaurants in India shut down within 18 months. ‘Real’ startups, the ones whose staff – in popular imagination – codes on tablets sitting in cafes, also have a 90% failure rate globally. It could be bad luck, or bad service, or a horribly stupid idea like ‘Juicero’. They made a $400 Wi-Fi-connected juicer, raised $70mn, and became a Silicon Valley darling until somebody showed you could extract the same amount of juice with your bare hands, faster.\nBluSmart wasn’t a stupid idea, though. It was an electric cab service without surge-pricing and last-minute ride cancellation. People in Delhi-NCR, Mumbai and Bengaluru liked it. What broke it was the original sin of business – promoter greed. A cookie seller keeps his hands out of the cookie jar, but BluSmart’s Jaggi brothers thought nothing of helping themselves to borrowed funds at their parent firm, Gensol. Altogether some 262cr hasn’t been accounted for. But their purchase of a premium Gurgaon apartment with company funds is talk of the town now.\nLenders, drivers and customers with money stuck in BluSmart wallets have become collateral damage, but India’s startup scene is also tarnished. Commerce minister Piyush Goyal feels, with some justification, Indian startups aren’t enterprising enough – fixated on ice cream delivery rather than AI foundational models. Investors have other reasons to worry. There’s been a spate of big-name scandals. BharatPe, GoMechanic, Mojocare, Paytm and others have been in regulatory crosshairs. The fall of Byju’s – valued at $22bn in 2022, now worthless and sued for $533mn in US – is the most glaring. While investors can forgive bad ideas – Juicero – what they detest is deceit, a la Elizabeth Holmes of Theranos, and now the Jaggis.\n\n",
        "headline_1": "Straight up fraud",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/straight-up-fraud/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-04-2025"
    },
    {
        "full_article": "We welcome the submission of proposals by the Women's Affairs Reforms Commission, which provided 433 recommendations aimed at eliminating discriminatory provisions and structures in our laws, policies, and institutions. Unlike many other reform reports, this one specifies recommendations that the interim government can implement immediately. Among these is the withdrawal of Bangladesh's reservations to two articles of the United Nations Convention on the Elimination of All Forms of Discrimination Against Women (CEDAW), which ensures legal equality in marriage and divorce.\nIn this regard, the commission proposed the introduction of a uniform family code to ensure equal rights in marriage, divorce, inheritance, and maintenance for women across all religions—which can be made applicable optionally during the current government's term. Other laws that require strengthening and/or amendment to make the provisions more inclusive and victim-friendly, according to the commission's proposal, include the Prevention of Domestic Violence Act-2010, the Guardians and Wards Act-1890, and rape and labour laws. The report also recommends enacting a new law on sexual harassment based on the 2009 High Court guidelines.\nRights of female migrant workers, domestic labourers, sex workers, as well as the elderly also came under the purview of the commission's recommendations. For example, it urged the government to ratify and implement the International Labour Organization's Conventions C189 and C190, which focus on domestic workers' rights and protection of workers from workplace violence and harassment, respectively. It proposed the establishment of help desks at all police stations and courts for women, children, the elderly, and people with special needs. Other recommendations include ensuring six months' paid maternity leave and two weeks' paid paternity leave in all sectors, and implementing the National Broadcasting Policy 2024 to stop mass media from presenting women in a negative light. In the political arena, the most notable recommendation was expanding parliamentary seats to 600, with 300 seats for directly elected women. Although this appears \"unrealistic,\" the commission chief believes such an increase is necessary.\nFor years, rights groups have been advocating for many of these changes only to be ignored by successive governments, thus allowing the perpetuation of repressive and discriminatory laws denying women equal rights. For the first time, a comprehensive document has now been drawn up with the aspiration that we can actually move forward towards a more women-friendly society. Sadly, certain quarters, instead of presenting constructive criticism and logical arguments for or against the recommendations, are already voicing their opposition and demanding the dissolution of the Women's Affairs Reforms Commission itself. We are, however, encouraged by Chief Adviser Muhammad Yunus' directive to promptly implement recommendations where possible. We hope that all political parties and other stakeholders will engage in healthy debate about the recommendations, recognising that ensuring equal rights for all genders will lead to a just, fair, and prosperous nation.\n",
        "headline_1": "We cannot miss this opportunity to truly empower women ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/we-cannot-miss-opportunity-truly-empower-women-3876241",
        "news_paper_name": "The Daily Star",
        "publish_date": "21-04-2025"
    },
    {
        "full_article": "The Cold War was a war of armaments and ideologies—but it was also a war of words, fought in classrooms, libraries, and on the printed page. As part of its strategy to win hearts and minds in the newly decolonised world, the United States launched the Franklin Book Program (FBP) in 1952, deploying books as emissaries of liberal democracy, scientific progress, and capitalist modernity. In East Pakistan, where questions of language, identity, and cultural autonomy shaped the politics of everyday life, Franklin's arrival intersected with a growing Bengali intellectual movement. At the centre of this intersection stood A.T.M. Abdul Mateen, the founding director of Franklin Dhaka, whose vision and leadership transformed the programme from an American soft-power project into a vehicle for the cultural and linguistic assertion of East Pakistan's Bengali intelligentsia.\nMateen's path to this position was shaped by the intellectual trajectories of the Indian Muslim middle classes in the twentieth century. Educated at Aligarh Muslim University and later at Cornell University, where he completed a master's in international economics, Mateen returned to Dhaka as a lecturer in economics and history at Ahsanullah Engineering College. With no prior experience in publishing, he was inducted into Franklin's fold in 1955 by Datus C. Smith, Franklin's founding president, who had been persuaded by Pakistani diplomat and literary figure Ahmad Shah Bokhari to extend the Franklin model from Lahore to Dhaka. It was a moment of convergence—between American cultural diplomacy and East Pakistan's search for a modern intellectual identity.\nFrom a modest office at 29, Purana Paltan, Ramna, Mateen led a skeletal team tasked with producing high-quality Bangla translations of American and global works in science, literature, and the social sciences. What emerged under his stewardship was more than a publishing programme—it was a print revolution, grounded in Cold War geopolitics but animated by local aspirations for linguistic dignity and intellectual autonomy.\nFranklin's First Publication and the Quest for Local Legitimacy\n\nFranklin Dhaka's first publication was not a translation of an American classic but an original biography of Benjamin Franklin, written in Bangla by Syed Abdul Mannan and released on August 14, 1956, to mark Pakistan's Independence Day. The book's symbolic timing and content—a life of a man who had helped unify the American colonies—was a deliberate choice. In his preface, Mannan expressed hope that Franklin's example would inspire Pakistan's youth to work towards national reconstruction. A new circular introducing the book, authored by Mateen himself, described Franklin's mission as part of a \"sacred duty to impart knowledge to the people deprived of such opportunities.\"\nThis rhetorical positioning was crucial. Franklin's success in East Pakistan hinged not only on its ability to produce quality books but on the legitimacy of its operations in the eyes of local intellectuals, writers, and policymakers. Mateen knew that to avoid the suspicion that Franklin was a mere cultural outpost of the United States Information Service (USIS), the programme needed to project itself as a partner in national development. And so, Franklin Dhaka consciously fashioned its identity as an indigenous initiative—staffed by local translators, artists, editors, and publishers—working to address a chronic shortage of Bangla-language reading materials in the fields of science, economics, technology, and the humanities.\nFranklin Dhaka's Challenge to Commercial Publishing Norms\n\nOver the next few years, Franklin Dhaka established partnerships with leading local publishers such as Majid Publishing House, Mullick Brothers, Wadud Publications, and Purbachal Prakshano. A distinctive collaborative model was developed: translators, editors, proofreaders, artists, and calligraphers were all compensated, and the final products were designed to match international publishing standards. The aim was not only to disseminate knowledge but also to set a new benchmark for book production in the country. Franklin books became instantly recognisable for their attractive design, rigorous editing, and thematic relevance.\nThis was no small feat in a publishing ecosystem dominated by textbook monopolies. Many established publishers were reluctant to cooperate with Franklin, viewing it as a foreign competitor. Mateen lamented what he saw as the narrow commercialism of these publishers, whose primary interest was the mass production of low-quality textbooks and exam guides. \"A nation's character is built not by textbooks,\" he wrote to Franklin's headquarters in New York, \"but by books other than that.\"\nTo counter this publishing inertia, Mateen actively nurtured new entrants—individuals with education, integrity, and nationalist zeal. He described his cohort of publishers as \"graduates and outstanding leaders in their respective fields,\" confident that \"the history of Cairo, Lahore, and Tehran may also be repeated here at Decca.\" Franklin's cultural politics was thus intricately tied to an emerging Bengali middle class eager to claim its space in the postcolonial public sphere.\nFranklin Dhaka and the Scientific Lexicon of Bangla\n\nAt the heart of this effort lay a linguistic project. If Bangla was to replace English as the language of education and governance in East Pakistan, it required a corpus of modern literature. The political rhetoric surrounding linguistic rights often ignored the practical task of developing Bangla's scientific and administrative vocabulary. Franklin, in this context, became a tool for language development. Its Bangla translations of American books in physics, chemistry, biology, home economics, and political science filled an urgent pedagogical void.\nThe Basic Science Series, for instance, employed the expertise of respected scientists such as Prof. Fazlur Rahman, Prof. Zahurul Huq, and Prof. Abdullah Al-Muti. These were not simply translations—they were acts of cultural adaptation, rendering modern science intelligible and accessible in Bangla. For vocational institutes like the Dhaka Polytechnic, Franklin books became indispensable, particularly for students who lacked English proficiency. As one instructor, Sultanuddin Ahmed, wrote, \"the severe shortage of technical books and writings available in Bengali\" was hampering national progress.\nCultural Censorship and Strategic Adaptation\nFranklin Dhaka also had to navigate the delicate religious and political terrain of East Pakistan. When considering the translation of H.A.R. Gibb's Mohammedanism, a respected but Eurocentric history of Islam, Datus Smith advised that the book be reviewed by \"not too liberal students of Islamic doctrine\" before translation. A similar caution was applied to Cressy Morrison's Man Does Not Stand Alone, which used science to argue for the existence of God. Mateen ensured that two learned theologians reviewed the manuscript to ensure its alignment with Islamic values.\nThese accommodations reflected the dual imperatives of Franklin: to disseminate American ideas while respecting local cultural and religious norms. Franklin's publishing decisions were guided by the understanding that cultural diplomacy required restraint. Illustrations were redesigned, content revised, and even titles changed to avoid offence and gain legitimacy.\nBooks and the Burden of Foreign Aid\n\nFrom its inception, Franklin Dhaka faced a peculiar dilemma. It offered high-quality books and professional compensation for authors and artists at a time when local publishers were primarily focused on the profitable textbook market. Yet, it also carried the stigma of being a foreign initiative, vulnerable to accusations of cultural imperialism. These tensions were evident in public discourse. A review published in the Bangla literary magazine Meghna in July 1956 described Franklin as a \"necessary evil\" of foreign aid. Discussing Chhoto Theka Baro—a Bangla translation of Sarah K. Bolton's Lives of Poor Boys Who Became Famous, rendered by journalist Serajuddin Hussain—the reviewer warned that \"our culture [might] be held to the apron strings of American politics.\"\nYet the same review conceded Franklin's importance, especially in a literary market where publishers dismissed poetry and fiction as \"nonsensical affairs\" and were \"overwhelmed with the dream of becoming rich overnight.\" Franklin, it noted, \"saved, at least some of our literateurs and artists… from the pangs of hunger.\" That the translated book added new characters and was praised for its narration, emotion, and cover design by A. Sabur underscores Franklin's success in fostering a literary aesthetic that resonated locally—even while remaining entangled in geopolitical anxieties.\nTranslation as Transformation\nMateen's advocacy of translation was deeply rooted in a modernist ethos. He drew parallels between Franklin's work and the great translation movements of Islamic history—under the Abbasids, and in medieval Bengal under Muslim rulers. At public events, he cited the Hadith: \"Knowledge is the gem which the Muslims have lost.\" He argued that translation was the only means through which the masses could access global intellectual developments. \"Facts about science are universal,\" he reminded his audiences, \"and these books, although translations, have yet retained the maximum amount of originality.\" He compared Franklin's work to the translation movement of the Abbasid Caliphate: \"It is no exaggeration to say that after the days of Haroun-al-Rashid and Mamun, Franklin Publications… is the largest single well-planned international translation program undertaken by any country or cultural organization on such a gigantic scale.\"\nFranklin Dhaka consciously resisted the notion that translation was a mechanical act of linguistic equivalence. Translation became an interpretive and creative enterprise—one that transformed original texts into new works of literature in their own right. This view clashed with the prevailing nationalist emphasis on original writing as the sole site of literary merit and authorship.\nMateen's team, which included translators such as Ashraf Siddiqui, Serajuddin Hussain, and Principal Ebrahim Khan, produced works that were both faithful and transformative. They coined new terms, adapted stylistic conventions, and sometimes restructured content to better suit local sensibilities. In many cases, only selected chapters were translated, titles were changed, and illustrations replaced. The result was a genre of books that were foreign in origin but Bengali in form—books that looked and felt local.\nStill, this process provoked debate. The issue of linguistic purity versus evolution became a flashpoint in the reception of Franklin's books. In a review of Chhoto Theka Baro, Shamsul Huq of the British Information Services praised the literary quality of the Bangla translation but criticised the use of Urdu and English loanwords, arguing they undermined the integrity of the Bengali language. His critique echoed broader anxieties among Bengali intellectuals over the creeping influence of Urdu in East Pakistan's cultural landscape.\nAgainst Linguistic Purism\nPrincipal Ebrahim Khan, a prolific Franklin translator and educator, dismissed such purism as \"madness.\" He argued, alongside linguist Dr Muhammad Shahidullah, that Bangla had always been a hybrid language, shaped by centuries of Persian, Arabic, Portuguese, and English influence. \"We should not be ashamed that Bangla is a mixed language,\" Shahidullah declared at a 1948 literary conference. In this view, translation and linguistic borrowing were not threats to identity but instruments of intellectual growth.\nThis debate unfolded within a broader context of postcolonial language politics. For Franklin's translators and editors, the goal was not simply to replace English with Bangla, but to make Bangla capable of bearing the weight of modern knowledge. This required technical innovation, cultural negotiation, and institutional support. Franklin books were not just literary exercises; they were infrastructural interventions in the nation-building project.\nFidelity or Fluency?\nThe politics of translation extended beyond vocabulary to the structure and rhythm of the text. A reviewer in Pakistan Observer criticised one Franklin translation for adhering too closely to the English original, resulting in awkward and grammatically flawed Bangla. \"Every word in each sentence has been faithfully rendered,\" the reviewer noted, \"though in doing so they have often offended rules of grammar and composition.\"\nIn contrast, Dr Sajjad Hussain of Dhaka University praised the \"dynamic\" prose of the Bangla version of Steinbeck's The Moon is Down, translated by Mahiuddin Ahmed, but criticised the translator's literalism and questioned the title's rendering as Astorag—a word that in Bangla evoked \"sunset\" rather than the novel's darker implications. This debate revealed the tightrope walked by Franklin's translators: between fidelity to the original and resonance with local meaning.\nAnd yet, there were successes that silenced the sceptics. One review of The Telephone Book, translated by Qazi Afsaruddin Ahmed, celebrated the translator's ability to render a foreign text in such natural Bangla that it read like an original work. \"While reading the book, I was charmed by the translator's ability to produce something foreign in his own language in a way so that it appears… as if he was reading something original.\"\nReclaiming Intellectual Autonomy\nThe Bangla editions of Franklin books were thus not just translated copies of American originals. They were new books, reshaped by cultural context, political prudence, and literary craft. This transformation was recognised by readers, who increasingly viewed these works as local contributions. Translators emerged as literary figures in their own right, and Franklin's authorship became a shared space—between the American original, the Bengali translator, and the reading public.\nFranklin's emphasis on adaptation over literalism ultimately enabled its greater acceptance. Major projects like the translation of Edward R. Murrow's This I Believe included new contributions from Pakistani voices, allowing the book to speak more directly to its audience. In doing so, Franklin Dhaka mirrored the ambitions of its director: to create a Bengali literary public grounded in the universal values of knowledge and shaped by the specific conditions of postcolonial society.\nDemanding Reciprocity in the Franklin Programme\nDuring the 1957 visit of Franklin's New York-based directors, Mateen organised a series of receptions, field visits, and roundtable discussions with Bengali intellectuals. The Bengali press, including Daily Azad and Ittefaq, covered these events in detail, noting the programme's contributions and highlighting the demand for publishing original works by Bengali authors—not just translations. Indeed, the call for a \"reverse flow\" of literature became increasingly vocal. Principal Ebrahim Khan and Prof. Ashraf Siddiqui, among others, urged Franklin to publish Pakistani writings for international audiences. Their concerns reflected a broader anxiety: that without such reciprocity, Franklin would be reduced to another conduit for American cultural imperialism. To their credit, Franklin's leadership responded by proposing Franklin Fellowships for Bengali authors and acknowledging the need for more locally authored content.\nThe Legacy of A.T.M. Abdul Mateen\nUnder A.T.M. Abdul Mateen's leadership, Franklin Dhaka published over 100 titles and printed nearly half a million copies in less than five years. The range of publications—spanning juvenile literature, technical manuals, science textbooks, biographies, novels, and philosophical treatises—addressed a critical shortage of educational and general reading materials in Bangla. These books circulated widely across schools, universities, and homes, transforming Franklin into more than a conduit of American cultural diplomacy. It became a catalyst for redefining Bangla as a language capable of bearing the weight of modern knowledge and intellectual inquiry.\nMateen would go on to enter national politics, eventually becoming the Deputy Speaker of Pakistan's National Assembly on the Awami League ticket in 1966. Yet, his most enduring legacy lies in shaping the modern identity of the Bangla language—not through protest or polemic, but through print. Through tireless correspondence, coalition-building, and cultural diplomacy, he reimagined Bangla as a language central to the assertion of national cultural identity. His vision echoed that of his mentor, Datus C. Smith, who described books as \"the invisible capital of the nation.\" Mateen laid the groundwork for a modern Bengali literary public sphere, anchored in a vibrant and forward-looking publishing industry. This contribution was no mere footnote to Cold War history; it was a foundational chapter in the intellectual development of Bangladesh.\nIn today's Bangladesh—where debates over language, identity, and education remain deeply resonant—Mateen's pioneering work with Franklin stands as a reminder of how books, and those who believe in their transformative power, can quietly shape nations. The story of Franklin Dhaka under Mateen's stewardship is not simply that of an efficient administrator or cultural intermediary; it is the story of a generation of Bengali intellectuals who, in the shadow of West Pakistani hegemony and amidst the turbulence of Cold War politics, imagined nation-building through books.\nNadeem Omar Tarar is a Visiting Senior Research Fellow at the Department of Anthropology, University of Texas at Austin, TX, USA.\n",
        "headline_1": "The untold story of Franklin Book Dhaka: In the shadow of the cold war",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/focus/news/the-untold-story-franklin-book-dhaka-the-shadow-the-cold-war-3876186",
        "news_paper_name": "The Daily Star",
        "publish_date": "21-04-2025"
    },
    {
        "full_article": "In the heart of Dhaka, amid the chaos and vibrancy of life, a young girl named Bashonti navigates her challenging existence. Born in a village that once thrived along a riverbank, her family's life was uprooted by the relentless force of river erosion. At a tender age, Bashonti, along with her mother, father and brother, migrated to the slums of Dhaka, trading a world filled with greenery and open fields for narrow alleyways and city concrete. This new reality starkly contrasted with her idyllic memories, and instead of offering opportunities, the city suffocated her with its struggles. \nEach year, an estimated 700,000 Bangladeshis are displaced by climate-induced disasters. River erosion alone displaces 100,000 people annually. The International Organization for Migration (IOM) reports that up to 70 percent of slum dwellers moved to Dhaka after experiencing environmental hardships, such as river erosion, cyclones, and flooding.\nBashonti often longed for the river and the lush landscapes of her village, feeling out of place in her crowded surroundings. The harsh conditions of water scarcity and lack of sanitation only heightened her discomfort. In Dhaka's slums, 50-65 percent of residents who report receiving water services from Dhaka WASA access this water source directly from their own dwelling, yard or plot. And only 27.9 percent of slum households used improved non-shared toilet facilities while 41.9 percent used improved but shared toilets.\nWith her family preoccupied with survival, Bashonti frequently found herself alone, tasked with adult responsibilities from a young age. She was coerced into doing chores and left to fend for herself against the grim realities of her environment, including harassment from neighbourhood men—an experience she learnt to accept as part of life. A report by Bangladesh University of Health Sciences (BUHS) revealed that 88 percent of children experienced physical abuse or sexual harassment at least once, with 55 percent enduring this repeatedly. \nAt just five years old, Bashonti was thrust into a world where she was responsible for helping her mother cook and fetch water. Endless tasks on the grindstone for spices left her hands sore and blistered, prompting tears of frustration. Despite her desire to play freely, the narrow alleys were filled with adult reprimands, cutting short her childhood. A 2021 study shows that women in Dhaka division spend 4.48 hours in unpaid domestic services for household and family members and 1.36 hours in unpaid caregiving services for household and family members, where men did the same for 0.54 hours and 0.27 hours, respectively.\nAmid these difficulties, hope emerged when Bashonti was admitted to a nearby school, a brief escape from her harsh life. However, the classroom lacked adequate infrastructure. In Bangladesh, primary school enrolment has reached 98 percent, while slum households have a primary school enrolment rate of only 77.2 percent, with girls facing higher barriers to completing education. Yet, against all odds, Bashonti completed her primary education and surprised her family, only to face societal pressures, including the prospect of an early marriage. \nEventually, she returned to her village to live with her grandparents while grappling with financial constraints. Menstruation was an added challenge for her. Nearly 40 percent of girls miss school due to menstruation as a result of inadequate facilities and supplies. Determined to succeed, Bashonti continued her education and ultimately married a farmer, albeit one with less education than her.\nUnfortunately, her new life was burdened by domestic responsibilities, farming, and the relentless impacts of climate change on their livelihoods, exacerbating financial strains. Climate change leads to a decline in productivity and increase in rice in the domestic markets. Simulation with a 25 percent reduction in arable land and 15 percent reduction in productivity also found that rice land and non-rice agricultural land are also decreasing day by day.\nClimate crisis is linked to rising domestic violence in South Asia as well. Over 55 percent of married women in Bangladesh face physical or sexual harassment in their lifetime, and 80.2 percent of currently married women experience at least one form of partner violence including physical, sexual, economic, and controlling behaviour. Bashonti again became the victim of societal failings, suffering in silence until the strains of her life drove her to a breaking point. \nThe decision to move back to Dhaka with her mother-in-law marked a new chapter filled with hope. As Bashonti adjusted to the bustling metropolis, she secured a job in a workshop, only to discover wage inequalities between male and female workers. One such study found that rural women earn 45 percent less wages than men and urban women earn 31 percent less than men.\nThe gender wage gap persists across industries. However, with resolve, she pursued training and became a garment factory supervisor, carving out a space for herself in a vital sector for the economy. The garment industry contributes approximately 83 percent of Bangladesh's export earnings, employing over 40 lakh workers, of whom nearly 54 percent are women. In a regular working month (excluding overtime), the average salary was Tk 9,984 (Tk 9,669 for women and Tk 10,928 for men). However, the statutory minimum wage was only increased to Tk 12,500 (106 euros). This figure is far below the subsistence level. Workers often contend with delayed wages, and are often forced into high-interest debt to survive, all while women frequently navigate unwanted advances to secure loans.\nBashonti felt the weight of systemic issues. In RMG factories, sexual violence or harassment in the workplace is widespread; In Bangladesh, 80 percent of female garment workers have either experienced or observed such behaviour in the workplace. Reflecting on Bangladesh's historical context, she recognised the pivotal role women have played in the nation's journey, yet questioned whether they have truly progressed at the same pace as men.\nWith the arrival of her child, the issues of feeding and caring became paramount. Stunting in slums is 60 percent higher than in non-slum areas, while children in slums are 74 percent more likely to be underweight compared to children in non-slum areas. Besides, without adequate childcare facilities, the burden of motherhood only compounded her existing challenges. \nUntil the contributions and needs of women like Bashonti are acknowledged and supported, the façade of progress will remain fragile. Bangladesh can increase its economic output by nearly 40 percent by closing the gender gap and increasing women's participation in the economy, according to the International Monetary Fund (IMF). \nUltimately, Bashonti's story embodies the resilience and strength of countless women trapped within the complexities of poverty, exploitation, and systemic neglect. The juxtaposition of glistening skyscrapers against the backdrop of impoverished slums serves as a haunting reminder of the social disparities that persist in Bangladesh. Her journey speaks to the urgent need for societal transformation.\nKazi Amdadul Hoque is a climate, development, and humanitarian activist. His X handle is @KaziAmdadbd. He can also be reached at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "How the weight of systemic issues weigh women down",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/how-the-weight-systemic-issues-weigh-women-down-3875716",
        "news_paper_name": "The Daily Star",
        "publish_date": "21-04-2025"
    },
    {
        "full_article": "It is disappointing that the metro rail authority's installations and equipment have yet to be removed from the Shaheed Anwara Park in the capital's Farmgate area. Since 2018, the park has been used by the Dhaka Mass Transit Company Limited (DMTCL) as a project site office and storage area for construction materials. Initially, it was agreed that the park would be restored to its original condition upon completion of rail construction. However, in 2023, DMTCL announced plans to construct an on-site station plaza, including shops, hotels, restaurants, entertainment centres, and so on.\n\nNaturally, the announcement came as a shock, forcing urban planners, environmental activists, and local residents to launch a protest movement. In December, three advisers from the interim government met with the protesters. During the meeting, it was assured that all the installations and equipment at the park would be removed by March 26. However, more than two weeks have passed since the deadline, but that promise still remains unfulfilled. Moreover, the government had pledged that the park would be restored, re-greened, and reopened to the public. This is critically important given Dhaka's current state, where green spaces are rapidly disappearing, leaving few parks or playgrounds available.\n\nAccording to urban planners and environmental activists, the metro installations and equipment currently occupying the park could be cleared within a week if the will existed. Even if twice that time were required, there can be no justifiable reason for the delay in clearing the site and reopening it to the public. What is equally concerning is that the authorities have offered no clear explanation for the delay being caused. Speaking to Prothom Alo, Fauzul Kabir Khan, adviser to the Ministry of Road Transport and Bridges, said he had consulted the relevant officials, claiming that some remaining work in the park was yet to be completed. They are now saying that the western part of the park will be vacated by June.\n\nThis is unacceptable. The authorities must understand that seven years have already passed since the park was closed. So, they must expedite the efforts to clear the park of all stored materials, proceed with restoring it as promised, and reopen it to the public at the earliest opportunity. The lack of importance placed by the authorities on preserving open spaces and parks in Dhaka must also change.\n",
        "headline_1": "Why is Anwara Park still occupied?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/why-anwara-park-still-occupied-3874231",
        "news_paper_name": "The Daily Star",
        "publish_date": "21-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 21, 2025 00:00:00  \nLower operational expenses and streamlined regulations are two of the most critical factors that contribute to entrepreneurial growth, investment, and job creation. Recognising this, governments worldwide are seeking ways to reduce the cost of doing business and create investment-friendly environments by addressing regulatory hurdles. In the United States, this commitment is reflected in the appointment of Elon Musk-renowned for his emphasis on efficiency and innovation in the private sector-as head of the Department of Government Efficiency. In this role, Musk is actively engaged in identifying and implementing cost-saving measures across government agencies. In contrast, Bangladesh appears to be moving in the opposite direction. The cost of doing business continues to rise, driven by increasing tax burdens and tariff hikes on utility services, while regulatory measures, in most cases, remain rigid. The country's aviation sector presents a glaring example of how policy flaws can stifle the growth of promising ventures and ultimately force them out of the market. According to a Financial Express report, no fewer than eight private airlines have been forced to cease their operation over the past two decades, while the remaining three are struggling to stay afloat. One of them, NovoAir is reportedly on the verge of shutting down.\nThe challenges facing private airlines in sustaining operations in Bangladesh are multifaceted. While some hurdles have emerged naturally, many others have been imposed by unfavourable policy decisions. One natural challenge is the decline in domestic air travel, driven largely by the rapid expansion of road and rail connectivity. For example, the construction of the Padma Bridge has significantly reduced air travel by passengers on Dhaka-Barishal and Dhaka-Jashore routes. Still, stakeholders believe the root cause of private airlines' misery lies not in improved road connectivity, but in the country's aviation policy framework, which remains far from business-friendly.\nOne glaring issue is the price disparity in jet fuel-local airlines pay up to 15 per cent more than foreign carriers. In addition, regulatory roadblocks such as excessive surcharges, 30-35 per cent tax on tickets, high aeronautical, landing, and parking fees further compound the sector's woes. The annual surcharge imposed by the Civil Aviation Authority of Bangladesh (CAAB) stands at a staggering 72 per cent, compared to just 12-18 per cent in India, 2.0 per cent in Pakistan, 8.0 per cent in Singapore, and 10 per cent in Oman. Clearly, this high rate of surcharge is counterproductive. Once private airlines fall into arrears with surcharge payments, recovery becomes nearly impossible. GMG Airlines, United Airways, and Regent Airways have been forced to ground their fleets as surcharge debts accumulated, according to aviation analysts. Regent Airways, the most recent airline to cease operations, owes Tk 2.83 billion in surcharges; United Airways owes Tk 3.55 billion, and GMG Airlines Tk 3.68 billion, according to data from the CAAB. Driven by these excessive operational costs and regulatory measures, the country's aviation sector has virtually turned into a graveyard for private airlines.\nA paradigm shift in policy is, therefore, crucial to fostering the growth and viability of local airlines. Firstly, the entire cost structure imposed on local airlines must be urgently revisited. Secondly, the current taxation regime and the imposition of excessive surcharges need radical reform. Thirdly, the role of the CAAB must evolve beyond that of a mere regulatory body towards one that actively facilitates the growth and development of the aviation industry. Without a transformative policy change, the market share of local airlines will continue to shrink, paving the way for foreign carriers to dominate the Bangladesh skies, capturing the economic benefits and potentially leaving local travellers with fewer choices and compelling them to pay higher fares in the long run.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bangladesh - a graveyard for private airlines!",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bangladesh-a-graveyard-for-private-airlines-1745160706",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alin   |  \n       April 21, 2025 00:00:00  \n\nThe Civil Aviation Authority of Bangladesh (CAAB) is learnt to have taken steps to enhance cargo handling capacity of Biman. The move has been in response to India's termination of the transshipment facility for Bangladeshi exports through that country's land, sea and airports. The quick move of the interim government to increase manpower and facilitate uninterrupted cargo service by the Biman is definitely a move in the right direction. Notably, every time any Indian authority took measures that affected Bangladesh's interests in some way, the interim government, unlike the previous governments, has taken countermeasures to protect its interests. Had Biman improved its cargo capacity earlier, the present situation could not have arisen in the first place. The fact that additional staff is being employed at the Dhaka airport to enhance its cargo clearance capacity, activities are ongoing at an accelerated pace to make the airport's third terminal fully operational by October next, starting cargo handling operation by the Sylhet Osmani International Airport by April 27 and similar plans afoot for the Chattogram airport are definitely welcome developments. Along with capacity expansion, it is equally important to streamline customs clearance operation of the airports to make those simpler, faster and cheaper. \nThe initiatives of the Civil Aviation Authority and the sole cargo handling agent, the Biman Bangladesh Airlines, or Biman, in this direction have been long time coming. Though the present move is to create an alternative route for the Bangladeshi exports, especially the garment products to their overseas destinations, the long-term impact of it would make the Biman Bangladesh Airlines, or Biman, more active and turn it, if possible, into a profit-making concern. Of course, for the present, the main purpose is timely shipment of the country's chief foreign exchange earner, the apparel products. In fact, dependence on a third country for any vital service can never be called a good decision. Even such services can face disruptions even if the third country in question might not have done it wilfully. \nWhen it comes to transporting goods through rail, road, sea or airport of a third country, there is always the risk of dislocations due to accidents, natural or manmade. In that case, the third country would be unintentionally responsible for the disruptions. Similar reasons may be behind, say, a vital service like power supply, or movement of foodstuffs from any single source outside Bangladesh. When it is intentional as in the present case of cessation of the transshipment arrangement for the export of certain Bangladesh-origin goods overseas, then it is obviously a cause for concern. One wonders, if and when similar other arrangements with that country might come up against challenges of a similar kind in the future. One may recall at this point the Indian ban on cattle export in 2014. Though earlier Bangladesh was dependent on Indian cattle imported or smuggled through the border to meet its regular demand for bovine meat and more so when the (cattle's) demand shot up manifold during the Muslim religious festival of Eid-ul Adha, that country slapped a ban on cattle export in 2014. The main reason for such a decision on the part of the government of India was the Hindu nationalist Bharatiya Janata Party (BJP) then came to power. Interestingly, according to a review of the US Department of Agriculture in 2016, India by then had become the world's largest beef exporter, accounting for 20 per cent of the world's beef trade. However, the 2014's ban on cattle export definitely caused severe supply shortage of cattle meat in Bangladesh for the time being. But soon the country, thanks to its resilience in the face of any kind of adversity, overcame the temporary disadvantage. A report published in a local English daily in August 2019 referring to the Bangladesh Livestock Services (BLS) said that close to 2.9 million cattle farms in that year reared 11.18 million cattle heads mainly as sacrificial animals for the Eid-ul-Adha celebrations. The thriving livestock sector created employment for half a million people in that sector. It's like as the popular phrase goes, 'one door closes and another one opens'. \nThe same has been the case with onion, so important for cuisine. In 2019, for instance, onion price saw an unprecedented surge in Bangladesh due to India's ban on the export of the agricultural product. A similar ban on onion export was imposed by that country in 2023. \nOf course, those decisions were made with an eye to protecting its domestic market, or in the interest of the onion farmers of India. But since Bangladesh has been dependent on Indian onion, the sudden bans or raise in duties on export caused severe supply shortages of that item in Bangladesh. But whenever Bangladeshi onion farmers increased their acreage of cultivation they could produce surplus onion in the country. In any case, it all depends on the government of the time to adopt the right policy at the right time. \nUnderstandably, some decisions by the interim government taken in national interest might have irked the government of India. \nBut what is important to consider under such circumstances is what has prompted the third country concerned to have taken certain decisions. If such decisions are made to protect the national interest of the country concerned, then it should not be a thorn in the side of a third country. For it is an accepted truth in international relations that every sovereign country has the right to take decisions to protect its national interest. So, nations need to be accommodative when it comes to each other's national interests. But if such interests are at cross purposes, for instances, sharing water of trans-boundary rivers between next-door neighbours like Bangladesh and India, it is advisable to settle matters through dialogue. So, unless there is any justifiable reason to be on a collision course, diplomacy is the right path to take. That requires the recognition of the fact that every country, however small it might be in terms of its size and population, has its self-respect as a sovereign nation. Many big nations often fails to accept this simple truth. As a result, tensions and sometimes conflicts arise. But sooner the close neighbours begin to realise this basic truth and start holding each other with due respect, the better it is for regional peace and growth.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "National interests must take centre stage",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/national-interests-must-take-centre-stage-1745160832",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       April 21, 2025 00:00:00  \n\nThis is nothing less than a scene cut out from a Sci fi thriller. A bus with its entire roof knocked off by the impact of a collision with a covered van and dangling from its rear runs in full speed on the highway for the first few kilometres and then jettisons it midway to cover almost six kilometres. About 60 passengers now could have enjoyed a joy ride if they were briefed earlier and volunteered for such a breathtaking travel like the superrich who do for a spaceflight on Elon Musk's SpaceX. Instead, they started screaming for their lives because the daredevil at the steering wheel had no intention of listening to their appeal for stopping the vehicle that now turned into a tourist bus with open roof. Maybe, the man thought it was the chance of a lifetime to give the passengers an experience they would never forget. \nWell, this real-life stranger than fiction drama was enacted on the Dhaka-Mawa Expressway on Thursday night. The bus first hit a covered van in its rear when the roof came off. Common sense dictates that the driver stopped the bus then and there. But he sped up and knocked a private car from behind and then had caused another rear-end collision with another private car before stopping on a side road and fleeing. There is a different version of this story. The roof did not come off from the collision with the covered van but it happened when the driver hit the railing of the expressway at Samostipur under Sreenagar Upazila. \nNo matter how it happened, the fact is indisputable that the driver did not stop the bus. The latest version of the report says that he panicked when the roof went flying. Accepted that this can happen but why did he continue running the bus at a break-neck speed? The answer is that he wanted to stop at a safe place and run away with his assistant, the conductor of the bus. They did. Mercifully, no passengers died and only eight sustained injuries.\nNow average drivers of buses in this country are like this man who wanted his own safety first, not of the passengers. In a country where law has long become a casualty with the mobs taking law into their own hands to deliver summary punishment leaving the victims either instantly dead or fatally injured, a driver's instinct is likely to escape the wrath of the public boiling at the heat of the moment. In this case, the man claims he saw police and army vehicles trailing him behind and he got even more panicked. \nThis is exactly where he erred. His life was safe if he submitted to the men of uniform. They would have taken him into custody instead of subjecting him to summary trial. The problem with the driver of this Barishal Express bus, like the majority of his kind, was his lack of understanding of the situation. Here the bus might as well be unfit for running on a long route such as the one between Dhaka and Barishal. But the way it hit other vehicles from behind clearly indicates, the man at the wheel was at fault. Other vehicles did not hit his bus, rather it was the other way round in all three collisions involved. \nThe questionable system of issuance of licences is just a part of the problem. Then the bus companies' mindless duty roster with no or little rest for drivers is largely to blame for accidents, particularly in which buses hit other vehicles either standing on roadside or moving at a low speed. Again, a problem not given much attention to is the lack of a minimum level of education for drivers. The majority of them are almost illiterate who cannot read notice boards or even know the meaning of the various road signs. Together with training for drivers to make them thoroughly familiar with traffic rules and road signs, a mandatory orientation course for them to value life can improve their performance.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Daredevilry or an  act of panic!",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/daredevilry-or-an-act-of-panic-1745160895",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 21, 2025 00:00:00  \nSocial networking presents both opportunities and challenges for companies. While it offers avenues for engagement and financial gain, it also poses a significant risk to brand reputation. A single viral post can rapidly escalate into a major crisis, making real-time crisis management essential.\nFor example, on April 9, 2017, at Chicago O'Hare International Airport, four paying customers were involuntarily removed from United Express Flight 3411 to accommodate \"deadheading\" employees. In 2018, two Black men were arrested at a Starbucks location in Philadelphia, sparking widespread protests and leading to the dismissal of former manager Shannon Phillips. Incidents like these gained massive attention on social media through extensive sharing. \nTo detect and respond to crises early, companies use social listening tools such as Brandwatch, Sprout Social, and Meltwater. These platforms help identify negative sentiment spikes and unusual brand-related activity. Research shows that the first 60 minutes are critical in shaping public perception. Transparent and authentic communication is essential. Coordination among PR, legal, and operations teams ensures aligned messaging. Trusted voices like influencers can help counter misinformation. Additional measures include implementing anti-bias training-like Starbucks did post-crisis-and offering refunds, apologies, and corrective actions to restore public trust.\nAI plays a significant role in identifying and managing crises. Algorithms analyse real-time social media sentiment to detect negative trends before they escalate. For instance, natural language processing (NLP) can scan vast numbers of posts to highlight critical issues. Tools like Dataminr and Meltwater alert PR teams when there is an abnormal spike in brand mentions. Airlines use AI to address flight disruptions and customer concerns efficiently. Platforms like Facebook and Twitter deploy AI to flag and fact-check misleading viral content.\nNike stood by its core values in a bold advertising campaign featuring Colin Kaepernick, despite initial backlash. It resulted in increased revenue and deeper engagement from key supporters.\nPepsi's 2017 ad featuring Kendall Jenner was widely criticised for trivialising social justice movements. Many viewers felt it mocked real protests. The delayed and inadequate response from Pepsi only worsened the backlash, leading to intensified criticism.\nIn today's digital era, social media can either elevate or damage a brand's reputation instantly. Companies must be more proactive and strategic in their crisis management efforts. \nMd. Minhazul Islam, Student\nNorth South University\nislam.minhazul.232@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Crisis management in the era of virality",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/crisis-management-in-the-era-of-virality-1745160929",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-04-2025"
    }
]