[
    {
        "full_article": "In yet another press conference, Congress leader and Leader of the Opposition in the Lok Sabha Rahul Gandhilevelled serious allegations against the Election Commission of India (ECI) and the Chief Election Commissioner of India. He accused the ECI of inaction in a case of fraud involving electoral rolls in the Aland constituency in the run-up to the 2023 Karnataka Assembly elections. While his allegations in an earlier press conference, on electoral roll inconsistencies in the Mahadevapura constituency in Karnataka, did not really add up to the definite existence of a ploy to aid a particular party, his accusations on Aland are a smoking gun — that attempts were made at manipulation, to the Congress’s disadvantage, in a close contest with the Bharatiya Janata Party. The Aland findings, brought out first in an investigative report in The Hindu earlier this month, did not pertain to any actual effect on the elections. This is because the ECI did manage to stop the fraudulent deletion of nearly 6,000 voters after miscreants filed Form-7 applications designed to remove the names of legitimate voters. But Mr. Gandhi’s allegations, taking off from The Hindu’s report, are centred on the fact that a CID probe into the fraudulent activity has been stalled due to the ECI’s refusal to provide access to crucial technical documentation, leaving investigators unable to follow the digital footprint of the fraud, buried in a maze of shifting IP addresses and phone numbers.The ECI’s reaction is puzzling — it acknowledges that fraudulent attempts to delete voter names were made and that it had shared details with the police investigating the case, but it does not address the core allegation about not responding to the CID’s repeated requests for “destination IP and destination port” data, which are necessary to pinpoint device data and, in turn, the identity and location of the fraudsters. Without this, it would be akin to finding a needle in a haystack. The ECI must respond specifically to these allegations and to the requests made by the Karnataka CID. It should also work to prevent Form-7 misuse, especially to stop voter removal by third parties. At a time when the ECI’s credibility has taken a hit — largely of its own doing given the manner in which it has gone about the Special Intensive Revision (SIR) in Bihar — its dismissive reaction to the serious allegations in the Aland case is unnecessary and counter-productive. Mr. Gandhi and his party should not limit their critique of the ECI, the SIR process and inconsistencies in electoral rolls to rhetoric and a regurgitation of known data. They must do more to raise public consciousness about the need to have a fair and just electoral process. Published - September 20, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        Karnataka Assembly Elections 2023\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        investigation\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        police\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        judiciary (system of justice)",
        "headline_1": "Quit stalling: On Aland, Rahul Gandhi’s press meet, the ECI’s response",
        "headline_2": "The Election Commission of India must aid in taking forward the probe on Aland electoral roll fraud",
        "link": "https://www.thehindu.com/opinion/editorial/quit-stalling-on-aland-rahul-gandhis-press-meet-the-ecis-response/article70070671.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "21-09-2025"
    },
    {
        "full_article": "The signing of a mutual defence agreement between Saudi Arabia and Pakistan, which declares that “any aggression ... shall be considered an aggression against both”, is a moment of consequence for both countries as well as for West and South Asia. Saudi Arabia, the custodian of Islam’s two holiest mosques, and Pakistan, the Islamic world’s only nuclear power, have always enjoyed a special relationship. Pakistan has trained Saudi forces for decades, while the kingdom has provided generous financial assistance, including help for Islamabad’s nuclear programme. With the agreement, this partnership has now been institutionalised. Yet, its timing, announced a week after Israel bombed Qatar, underlines the shifting sands in the Persian Gulf’s security landscape. For decades, its monarchies relied on solid security guarantees from the U.S. But with the U.S. focus shifting away from West Asia, the durability of the old framework has come into question. When Saudi oil installations were attacked by Iranian allies in 2019, the U.S. did nothing. Israel’s attack on Qatar, which hosts America’s largest base in West Asia, seems to have expedited the realignment.In the Abraham Accords, the U.S. tried to bring the Arab monarchies and Israel closer to build a common front against Iran. Four Arab countries, including the UAE, signed up, and Saudi Arabia was expected to follow. But the Hamas attack of October 7, 2023 and Israel’s Gaza war, which has spilled into other countries, have derailed the process. With the Pakistan agreement, Saudi Arabia is sending a clear signal to Washington and Tel Aviv that it is diversifying its security alliances. For Pakistan, which desperately needs Saudi financial assistance, closer defence ties at a time when Gulf monarchies are rattled by Israel’s unchecked militarism, are an opportunity to present itself as a security provider. For India, which fought with Pakistan in May, the agreement could complicate its manoeuvres in West Asia. As India has taken a pro-Israel tilt, Arab monarchies seem to be hedging their bets, even if that means overlooking India’s concerns. Yet, it is not clear whether the agreement offers Pakistan’s nuclear umbrella to Saudi Arabia or an immediate Saudi response if Pakistan comes under attack. Risks of entrapment come with the agreement: Pakistan could be dragged into West Asia’s polycrisis or Saudi Arabia could be pulled into the tensions in South and Central Asia. India must prepare for rapid changes in West Asia’s security order. It might be tempted to double down on its tilt towards an isolated, dangerous Israel. That would be a mistake. Instead, India’s long-term focus should be on promoting stability in the region, and maintaining a strategic balance among all pillars of its West Asia policy. Published - September 20, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        defence\n                    \n                            /                      \n                        \n                        Saudi Arabia\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        armed conflict\n                    \n                            /                      \n                        \n                        armed Forces\n                    \n                            /                      \n                        \n                        nuclear policy\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        Qatar\n                    \n                            /                      \n                        \n                        imperial and royal matters\n                    \n                            /                      \n                        \n                        United Arab Emirates\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        diplomacy",
        "headline_1": "Shifting sands: On the defence agreement between Saudi Arabia, Pakistan",
        "headline_2": "India’s West Asia policy must maintain a strategic balance",
        "link": "https://www.thehindu.com/opinion/editorial/shifting-sands-on-the-defence-agreement-between-saudi-arabia-pakistan/article70070190.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "21-09-2025"
    },
    {
        "full_article": "America’s tense politics post-Charlie Kirk is in part centred around gun rights, which are sanctified by a Constitution largely frozen in time. India’s Constitution is more responsive to changing society because it’s easier to amend. That’s a plus as long as politics is responsible\nThe shooting and death of right-wing commentator Charlie Kirk in US has rightly drawn widespread condemnation.\nViolence in any form is unacceptable in a democratic society.\n\nYet, once the immediate outrage passes, the episode also offers an opportunity to reflect on a deeper structural issue: the way constitutions, by their design, can lock nations into paths increasingly out of step with contemporary realities.\nRead the full story on TOI+.\n\n",
        "headline_1": "Us & US: Taking a constitutional",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/us-us-taking-a-constitutional/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-09-2025"
    },
    {
        "full_article": "Gen X has made way for Gen Z but the Victorian judginess many mums & dads grew up with continues to torment their kids. Apps are new but pressure to do saat pheras is mostly unchanged\nAs a 52-year-old married woman, I spend a lot of time imagining how much more fun my life would be if I were single.\nIn my imaginary world, I am a lean, mean, Tinder-wielding machine.\nMatching and un-matching with wild abandon.\n\nAn abandon I wish I had exhibited in my 20s when I was actually single. But I could never have been that girl because I came of age in India.\nRead the full story on TOI+.\n\n",
        "headline_1": "If we didn’t have marriage would we still have dating?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/if-we-didnt-have-marriage-would-we-still-have-dating/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-09-2025"
    },
    {
        "full_article": "By Gurudev Sri Sri Ravi Shankar\nPeace is a deep, positive inner experience. If we look at life closely, three things are essential for peace: passion, dispassion, and compassion. Passion is essential to achieve anything worthwhile.\nWithout it, one could feel lost, unenthusiastic, or even depressed. On the other hand, unbridled passion can lead to anxiety, fear of uncertainty, and even insomnia.\nWhile passion propels one into action, dispassion allows one to relax.\nA certain amount of dispassion is essential to feel sane, safe, and have a sound sleep.\nIt broadens one’s vision and allows one to look at life from a bigger context, acknowledging the fact that people and situations are constantly changing.\nWhen one embraces this sense of impermanence, the world appears like a transit lounge.\nThis awareness makes individuals pause and reconsider the priorities of their life. The third aspect is compassion which defines our humanity.\nIn absence of which, life appears dry and meaningless.\nWhen these three go out of balance, it induces stress and societal discord. This is the primary cause of today’s mental health crisis.\nUnfortunately, neither at home nor in school have we ever learned how to deal with anger, jealousy, fear, or sadness.\n\nTherapy and medication can help to some extent, but they are not enough. This calls for fundamental rethinking. What we need is a way to get to the root of stress and eliminate it.\nOur breath holds many secrets. Have you noticed how you breathe when you are angry, or excited, stressed or sad or very relaxed? As you are reading, just observe how your breath is. There is certain rhythm to our breath that is linked to our emotions.\nAnd if one cannot handle mind directly, one can do that through breath. Yog, pranayam and Sudarshan Kriya make it so easy to use the breath to feel relaxed and happy; and for the mind to become calm.\nMeditation is no longer a luxury today but a necessity, if we want to create a peaceful world. These two together bring that rare combination of outer dynamism and inner calm. If there is even one disturbed person in a family, the whole family suffers. World peace begins with individuals being at peace with themselves first.\nWars don’t begin on the battlefield; they begin in the mind. A perceived threat, a breakdown in communication, a lack of trust – these are seeds of war. That is why dialogue is so important because when words fail, weapons take over. But eventually, we always come back to dialogue.\nWhy not begin with it? I remember once in Washington, i was addressing a gathering when a big, hefty man came rushing towards me with lot of rage.\nEveryone was shocked. As he came close, i simply said, “Wait.” He stopped, sat down, and tears started flowing from his eyes. Something had changed him. All that violence disappeared. When you’re well-founded in nonviolence, violence subsides around you.\nAt the same time, being peaceful does not mean being weak. You must be capable of self-defence. Peace and strength go together. In fact, peace is the greatest strength.\nInternational Day of Peace is on September 21\n\n",
        "headline_1": "Peace is not just absence of war",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/peace-is-not-just-absence-of-war/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-09-2025"
    },
    {
        "full_article": "Plenty, because we aren’t so different from wheat and yeast\nThe periodic table sorts 118 elements into rows and columns. Two dozen of these are manmade, the rest are building blocks of everything across the universe. Similarly, amino acids are the building blocks of life. All living things – from a virus to a blue whale – are assembled from just 20 of these. Dive into a cell, and the nucleotides or building blocks of DNA – A, T, C, G – are also identical across plants and animals. \nThe ancients had grasped this unity via philosophical reasoning. The Gita, for instance, urges you to see “one undivided imperishable reality within all diverse living beings”. Nikolay Kukushkin, neuroscientist and self-described “molecular philosopher”, discusses this unity with scientific rigour in his book One Hand Clapping: Unravelling the Mystery of the Human Mind. \nKukushkin studies “the miracle by which molecules form memories”, and the book’s title references a Zen ‘koan’ or riddle: “If two hands come together and make a sound, what is the sound of one hand clapping?” From a Zen perspective, there is only one hand. Duality arises from the idea of observer and observed. By extension, Kukushkin says, “The boundary between human and the rest of the world is not real.” As for the notion that humans are the acme of evolution – perfection – it is deeply flawed. There are many special things – like photosynthesis – that we can’t do. And whatever exceptional qualities we have are a result of the properties and “essences” of nature that developed before us.\nAt the molecular level, life could not have existed without carbon’s unique tendency to form multiple strong bonds with other atoms. In the living world, where would we be without proteins – long chains of amino acids – that do everything but replicate themselves? Even our memories are formed through their action, Kukushkin says.\nOur journey from single-celled organisms can be summed up as the story of natural selection. But what is it? A randomness that chooses long necks for giraffes and hard shells for coconuts? Kukushkin says, “Selection is built into the logic of the universe.” Instead of “God” designing every single living being, here’s nature laying down what will or won’t work under certain conditions.\nAt the cellular level, nature follows rules set billions of years ago. When nutrients are abundant, a protein called mTOR turns on to promote cell growth; when they are depleted, a protein called AMPK turns off cell growth. This is true across the board from fungi to humans. There’s another protein called MAPK that yeast uses to adapt to a salty environment, and humans to form memories. \nAnd talking of memories, our minds are so complex, we can get lost in our own maze. We are prone to subjectivity, bias, and confusion between reality and imagination. “Our brains…are not even trying to determine what the world really is,” Kukushkin says. Rather, they are always trying to “align reality with expectation”. Remember “The Dress” from 2015? Some saw it as blue-and-black, and others as white-and-gold, depending on whether they thought it was shot in natural light or artificial light. And now our biases and  expectations are colouring AI, not because we want them to, but because of the properties of carbon, amino acids, etc that have shaped us. We are, after all, the sound of one hand clapping. \n\n",
        "headline_1": "What’s Bread Got To Do With Memories?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/whats-bread-got-to-do-with-memories/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-09-2025"
    },
    {
        "full_article": "The impact of rising temperatures on people's health has been in discussion for quite some time, yet policymakers and businesses have largely remained unresponsive to this threat. In this context, we hope that the World Bank's recent study, which highlights both the health and economic consequences of increasing temperatures in Bangladesh, will finally prompt some meaningful action.\nThe study estimates that Bangladesh lost 250 million workdays and up to $1.78 billion in 2024 due to heat-related illnesses. Between 1980 and 2023, the country's maximum temperature rose by 1.1 degrees Celsius, with Dhaka experiencing a 1.4-degree increase, making it a hotspot for urban heat. During the same period, the \"feels like\" temperature has jumped by 4.5 degrees Celsius. Consequently, during summer, more people suffer from persistent coughs, diarrhoea, depression, and anxiety compared to the winter months. The elderly and women are most affected, but people aged 50-65 within the working age group also report these health problems in significant numbers. The study also found that work absenteeism increases with rising temperatures: at 35-37 degrees Celsius, absenteeism averages 0.8 days, but at temperatures above 37 degrees Celsius, it jumps to 1.4 days. Heat disproportionately impacts informal and unskilled workers and the poor, compared to formal, skilled workers and the wealthy.\n\nDevelopment—not just in Dhaka but across the country—has often come at the expense of parks, trees, and water bodies. Yet both private commercial bodies and public institutions continued building at the cost of the environment, violating laws under the guise of progress.\nThese findings should serve as a wake-up call for policymakers and businesses alike. Economic growth cannot be sustained if workers' health continues to decline due to increases in heat and absenteeism. Dhaka's heat report also deserves scrutiny. Between 1989 and 2020, the city lost 47 percent of its dense green cover, while its temperature continued to rise. Dhaka has also frequently topped global lists for the worst air quality. Development—not just in Dhaka but across the country—has often come at the expense of parks, trees, and water bodies. Yet both private commercial bodies and public institutions continued building at the cost of the environment, violating laws under the guise of progress.\nThe World Bank report presents glaring evidence that such progress will not be sustainable in the long run. Northern Bangladesh is already paying the price of global warming, with ground and surface water declining at an alarming rate. In the south, global warming is increasing salinity. Both phenomena are likely to increase the number of climate migrants to cities. There is no time for the government to wait for donor funds to address these issues. Whatever can be done at the national level must be done first, including increasing green spaces in cities and preserving forest cover across the country. Political parties must also prioritise environmental issues that impact health and wellbeing over populist policies. Finally, we urge the interim government and those about to follow to strictly enforce environmental laws, stop unplanned urbanisation, and treat rising temperatures and heatwaves as climate emergencies within a comprehensive, multi-sectoral strategy.\n",
        "headline_1": "Time to re-green our country",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/time-re-green-our-country-3988331",
        "news_paper_name": "The Daily Star",
        "publish_date": "21-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 21, 2025 00:00:00  \nThe recent report that Bangladesh's twelve city corporations operate on a collective annual budget of just Tk 230 billion, an amount that severely constrains their capacity, stands as a damning indictment of the nation's urban governance crisis. This figure is astonishingly low for entities that host more than half of the country's economic activity. It is plain to see that Bangladesh's economic lifeblood flows through its cities, yet these very engines of growth are being deprived of the resources they need to function effectively. This chronic underfunding carries a massive macroeconomic cost. According to estimates by the Policy Research Institute of Bangladesh (PRI), economic inefficiencies stemming from poor planning, weak coordination and misallocation of resources are costing the economy 6 to 10 per cent of GDP each year. The PRI report also highlights a critical failure in municipal revenue collection, noting that property and transfer taxes in Dhaka and Chattogram contribute a mere 0.13 per cent and 0.06 per cent of GDP, respectively. For cities of such scale and economic importance, this contribution is undeniably negligible. \nWhile revenues remain meagre, the cities themselves continue to expand rapidly, yet their capacity to generate jobs is steadily shrinking. Urban employment growth dropped from 4.0 per cent between 2010 and 2017 to just 0.8 per cent thereafter, with industrial employment even slipping into negative territory. This exodus of industrial jobs from urban centres suggests cities are struggling to provide a business-friendly environment. The decline in job creation is particularly troubling given that the urban population already nears 40 per cent of the national total and is projected to reach 50 per cent by 2030. This relentless growth places ever-greater demand on city services. The strain is most severe in Dhaka, where an extreme concentration of people and economic activity has worsened both inequality and inefficiency. Daily life is hampered by congestion, pollution, overburdened utilities and traffic gridlock, leaving residents to navigate a city that often seems unfit for its own size. Much of this could have been avoided with proper urban planning. However, policy has been largely reactive rather than proactive, perpetually trying to catch up with problems instead of guiding urban growth in an orderly and sustainable manner. \nEven as the pressures on Dhaka mount, the city's immense pull makes citizens, businesses and government institutions reluctant to move elsewhere. Meanwhile, a city with natural advantages like Chattogram, home to the nation's critical port, remains drastically underdeveloped relative to its potential. Similarly, industrial hubs like Gazipur produce significant goods, yet the workers who fuel this production are often left to live in squalid conditions with limited access to safe water, proper sanitation and quality schools. This is not a sustainable path for development.\nThe current trajectory of uneven urban growth and weak local funding cannot continue if Bangladesh hopes to sustain development and raise living standards. Achieving this requires effective city management, which in turn depends on specialised expertise, strong local governance and active citizen participation. City corporations in their present form remain hamstrung. They are entrusted with monumental responsibilities but are granted limited power, unable to collect taxes effectively and forced to rely on insufficient central funds. Expecting much from them is futile unless they receive real capacity and adequate resources to operate transparently and responsibly. Under the circumstances, the only way forward is to strengthen city corporations and invest properly in cities rather than allowing expansion to proceed unchecked.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "A crisis in urban governance",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/a-crisis-in-urban-governance-1758379605",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       September 21, 2025 00:00:00  \nIn its three decades of existence, the members of the World Trade Organization (WTO) have negotiated only two new trade deals. The latest one is the Agreement on Fisheries Subsidies (AFS), which entered into force last week. At the 12th Ministerial Conference (MC12) in Geneva in 2022, the members of the multilateral trade rule-making body agreed to accept the deal. Since then, it took almost two and a half years to become effective, as it is necessary to be ratified by at least two-thirds of the members. So far, 112 members have ratified or officially accepted the deal by submitting the instrument of ratification or formal paper of acceptance to the WTO secretariat. Earlier, at the 9th Ministerial Conference (MC9) in Bali, Indonesia, in December 2013, members agreed to introduce the Trade Facilitation Agreement (TFA), which came into effect in February 2017.\nAfter obtaining the necessary ratification, the WTO General Council celebrated the entry into force of the fisheries subsidies deal at a special meeting last week. Despite the celebration, it is only the first phase of the agreement labelled as Fish-1 that comes into effect. To make the entire deal effective, the members must complete the negotiation of Fish-2 within four years. At the 13th Ministerial Conference (MC13) in Abu Dhabi last year, members were unable to break the deadlock on the negotiations for Fish-2. Now they have agreed to finish the talk by September 2029. Before going to analyse the scope and effectiveness of the agreement, let's have a look at the key areas of the deal in brief. \nThe AFS aims to curb harmful subsidies and protect the livelihoods of fishing communities worldwide. To do so, the first phase of the deal prohibits subsidies on: (i) illegal, unreported and unregulated (IUU) fishing; (ii) the fishing of overexploited stocks and (iii) fisheries on the high seas outside the jurisdiction of regional fisheries management organisations. According to the Food and Agriculture Organisation (FAO) of the United Nations (UN), approximately 36 per cent of global fish stocks are currently overfished, compared to 10 per cent in 1974. It is also estimated that governments spend approximately US$22 billion annually on subsidies to expand fishing capacity, contributing to overcapacity, overfishing, and other practices that deplete fish stocks and undermine efforts to achieve sustainable fisheries. Additionally, the total economic losses caused by IUU fishing are estimated to be approximately US$50 billion. The second phase of the agreement aims to curb subsidies that promote overcapacity in fishing fleets or overfishing. These two types of subsidies were also included when negotiations for the agreement began. Later, some members strongly objected to negotiating the last two types of subsidies for the time being. So, it was excluded from the negotiation and placed as the second phase of the deal for later talk.\nAs Bangladesh is yet to ratify the deal, the country can continue the tiny subsidies it has been providing. It will, however, not be eligible to get the technical assistance. AFS provides a 'peace clause' to the least-developed countries (LDCs) and developing countries, exempting them from subsidy bans within their own exclusive economic zones for two years. Furthermore, developing nations and LDCs whose annual share of the global fish catch does not exceed 0.8 per cent will be allowed to submit their fisheries notifications to the WTO every four years instead of every two years.\nTo understand the implications of the AFS, the government in June this year appointed a consulting firm to conduct a 'Study on WTO Agreement on Fisheries Subsidies: Impact and Way Forward for Bangladesh.' As the study is likely to be completed by the end of the year, it yet to see what the output it can provide. Meantime, the country needs to closely monitor the progress on the second phase of the deal.\nThe WTO deal is expected to reduce the depletion of global fish stocks and support sustainable fisheries, and it is the first trade deal in the WTO which is more focused on the environment than on trade. The big question is whether the agreement will be able to curb the harmful subsidies and ultimately protect the global fish stocks to a sustainable level. The answer requires some analysis.\nFirst, the deal is applicable to countries that have ratified it, and not to those that have not officially accepted it. Some big fish-producing and exploiting countries are yet to ratify the deal. For instance, India, Indonesia, Thailand, Mauritania, Mexico, Morocco and Thailand alone account for one-fifth of the world's fishing catch, and they have not ratified the deal along with some other countries like Bangladesh, which has a little or negligible share in global fishing catch. Nevertheless, over a quarter of the world's sea fish catch is not covered by the deal, and the countries will be able to continue with their subsidies.\nSecond, though WTO members are already required to notify their fisheries subsidies under the WTO Agreement on Subsidies and Countervailing Measures, under the AFS, they have to provide fisheries-related information, such as subsidies, fish stocks, conservation methods, fishing fleets, vessels identified as involved in illegal fishing, and others. Those who do not ratify the agreement have no obligation to provide any such information, and so there will be a gap in this regard. In other words, the repository on global fish subsidies will be incomplete for a long time. Members who accepted the deal can exchange information among themselves, but they can't compel those who have yet to accept the deal. It is difficult to say when the rest of the members will ratify the agreement. \nThird, the WTO DG is playing a crucial role in the progress of the AFS. The DG is expecting that there will be good progress in the upcoming ministerial conference, to be held next March in Cameron, regarding Fish-2. With only six months in hand, such an expectation is overambitious, especially when there is almost no sign of advancement in negotiation. It is also unlikely that countries like India and Indonesia will move ahead soon unless their demand on some aspects of the second phase of the deal is addressed. In December last year, both countries blocked the revised text on the Fish-2, which is also labelled as the additional provisions on the fisheries subsidies agreement. India argued for 'subsidy paid per fisher' approach instead of 'total subsidy' by a country that contributes to overfishing and overcapacity.\nOverall, WTO members have to do a lot of work in the near future to make the AFS effective and all these are not easy at all as a number of obstacles are already there. Addressing the concerns of the millions of small fishermen is a big challenge also. So, it is unlikely that the deal will contribute to reduce the fisheries subsidies and help the sustainability of the global fish stock.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Will WTO deal to curb fisheries subsidies work?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/will-wto-deal-to-curb-fisheries-subsidies-work-1758379635",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       September 21, 2025 00:00:00  \nNo fewer than 150 hills and hillocks are now at risk of being completely flattened. This time, the cause is not population pressure or the need to reclaim land for agriculture, but a grave error in survey records that borders on criminality. A report in a vernacular daily has revealed disturbing facts: in the Bangladesh Survey (BS) records, about 150 hills and hillocks in Chattogram city, Hathazari, and Sitakunda were wrongly categorised as shankhola (wetland), nal (lowland), khila (uncultivated land), or even homesteads.\nUnder the Environment Conservation Act, cutting hills and hillocks is strictly prohibited. But due to the glaring errors in the land records maintained by the Ministry of Land, the Ministry of Forest and Environment is reportedly finding it difficult to take legal action against those responsible for levelling hills and selling them off as residential plots. In a time when widespread deforestation is taking a heavy toll on the environment, it is hard to imagine such an environmental crime is taking place due to errors in government's land record.\nThat the hills and hillocks in Chittagong, like the hills in other areas, were being whittled down by timber smugglers and influential quarters had been known for years. It is strange that all these years the authorities practically did nothing to stop this reckless environmental depredation. The criminals are flattening the hills in a systematic way. \nThe real problem does not lie in the absence of laws but in their enforcement. Those who violate environmental laws for personal gain are often so powerful and well-connected that the Department of Environment, local administrations, and even law enforcement agencies remain helpless spectators. Errors in survey records further complicate matters, making it difficult for authorities to pursue legal remedies. Even when cases are filed, proving the offences in court becomes a daunting task.\nFor example, the Chittagong Development Authority (CDA), for its part, has prohibited construction on hills and hillocks, but it too has been unable to enforce its directives effectively. Administrative weaknesses, combined with faulty land records, have provided the violators with impunity.\nThe consequences of hill cutting are catastrophic. Hills and hillocks are inseparably tied to the topography, biodiversity, and cultural heritage of Chattogram. Destroying them means destroying the very ecosystem that sustains the region. In recent years, Chattogram has witnessed recurring landslides, floods, and prolonged waterlogging-direct results of indiscriminate hill cutting. The loss of green cover intensifies heat, disrupts food chains, fills up streams and canals, and worsens urban water crises.\nA study by Professor SM Sirajul Haque, former faculty member of the Institute of Forestry and Environmental Science at Chittagong University, revealed that in 1976 the total hill area in Chattogram city was 32.37 square kilometres. By 2008, it had shrunk to just 14.2 square kilometres. In the 17 years since, the loss has almost certainly been greater. Such destruction cannot be brushed aside as development-it is outright environmental vandalism.\nThis raises pressing questions. Why has the error in the 1970 BS survey not been corrected even after 55 years? How sincere are the Department of Environment, the CDA, and other relevant bodies in preventing hill cutting? The consequences of treating environmental protection as mere rhetoric are already evident. Bangladesh today faces heatwaves, heavy rainfall, flash floods, and droughts with alarming frequency. Each crisis is a reminder of the price of neglect.\nThis is a serious challenge before not only the forest department but also the administration and law enforcers. The errors in land record must be corrected without any further delay, and the authorities must come down hard on the culprits responsible for cutting hills. This is a plain question of sustainability of the environment.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Denuding hills - a monstrous crime",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/denuding-hills-a-monstrous-crime-1758379660",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 21, 2025 00:00:00  \nIn both urban and rural Bangladesh, many traditional professions quietly exist, though rarely recognised. These include clock repairers, quilt makers, khundhai artists, and beading artists - trades passed down the generations. Despite their declining visibility, they play a vital role in preserving our cultural heritage. Yet, with the rise of modern technology and industrial alternatives, these crafts are fading fast.\nA recent survey found that 65 per cent of people are unaware of the work done by such artisans. Many dismiss these professions as outdated, despite their historical and cultural significance. Interestingly, 72 per cent of respondents believe that if these trades received government and societal support, younger generations would take interest. This highlights the urgent need for awareness and preservation efforts.\nWhile modernity has reshaped our daily lives, these unconventional professions continue to contribute silently. Handmade clocks, clay toys, bamboo crafts - once integral to society - are now overshadowed by mass-produced goods. Artisans survive on minimal demand and personal passion, despite facing economic and social neglect.\nTo preserve these fading professions, financial and social support is crucial. Government bodies and local authorities can provide training, subsidies, and access to wider markets. Schools and colleges should host workshops to spark youth interest. E-commerce platforms can be used to promote and sell traditional crafts globally. Media coverage can also help increase public awareness.\nAbove all, consumers play a key role. Choosing handmade, traditional items over factory-made alternatives can breathe life into these professions. Such choices not only support livelihoods but also sustain cultural identity.\nThese unconventional trades are more than jobs. They are living archives of our history, creativity, and resilience. Preserving them means valuing our roots and ensuring that future generations inherit not just stories, but skills and pride. While the state has a role to play, so do we. By recognising their work and sharing their legacy, we can ensure these professions are not forgotten in the craze for modernity.\nSania Tasnim Lamia\nStudent, Jagannath University\nlamiasaniatasnim@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Professions forgotten in the craze for modernity",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/professions-forgotten-in-the-craze-for-modernity-1758379684",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-09-2025"
    }
]