[
    {
        "full_article": "With his swearing-in as Chief Minister of the NDA-led government in Bihar, Nitish Kumar has begun his tenth term cumulatively at the helm of the State. This remarkable political longevity reflects not just his personal acumen but also the JD(U)’s electoral performance, which saw the party double its previous tally to 85 seats. His success owes much to the social coalition he has painstakingly built over the years. The JD(U)’s support base among the EBCs and Dalits, augmented by substantial backing from women across these sections, has provided accretion to the support bases of the BJP and other NDA allies. This multi-caste, multi-class coalition gave the alliance a decisive social edge over the Opposition Mahagatbandhan, helping it stave off anti-incumbency. That voters have prioritised welfare deliveries over Mr. Kumar’s serial realignments speaks to the efficacy of targeted benefits in insulating incumbents. Yet, electoral success cannot obscure the hard reality that confronts the septuagenarian leader. Bihar remains at the absolute bottom on virtually every socioeconomic indicator. It continues to be the largest source of out-migration, a consequence of inadequate employment opportunities. Its economy remains trapped in a vicious cycle: agriculture hampered by fragmented landholdings and concentrated ownership, and a services sector largely confined to government employment. The near absence of organised industry and the State’s inability to attract investments represent a governance failure that transcends political partisanship. Years of administration have prioritised road and bridge construction, while education and health have languished.The Opposition’s inability to capitalise on these deficiencies is telling. The RJD’s limited social coalition, the Congress’s organisational weaknesses, and the Left’s confinement to pockets of support have failed to convert economic distress into political momentum. Welfare doles have evidently shielded the government as well. However, the Opposition’s inadequacy does not invalidate the critique of the government’s economic record. A State cannot thrive on transfer payments and handouts. With the JD(U) occupying a pivotal position at the Centre, there is little excuse for the new administration to continue on this trajectory. The government must pivot toward securing sustainable livelihoods. Catalysing sectors such as food processing, leveraging Bihar’s agricultural fertility, and creating an enabling environment for investment are essential. More ambitious measures, including land reforms that transfer holdings from absentee landowners to sharecroppers, may be politically difficult, but remain necessary. Mr. Kumar’s tenth term must be measured not by electoral arithmetic but by whether it marks an inflection point in Bihar’s development trajectory. Published - November 21, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        National Democratic Alliance\n                    \n                            /                      \n                        \n                        Janata Dal (United)\n                    \n                            /                      \n                        \n                        Caste\n                    \n                            /                      \n                        \n                        dalits\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Rashtriya Janata Dal\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        food\n                    \n                            /                      \n                        \n                        welfare\n                    \n                            /                      \n                        \n                        migration",
        "headline_1": "New reckoning: On Nitish Kumar’s tenth term in Bihar",
        "headline_2": "Nitish Kumar’s tenth term must deliver economic transformation for Bihar",
        "link": "https://www.thehindu.com/opinion/editorial/new-reckoning-on-nitish-kumars-tenth-term-in-bihar/article70304020.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "21-11-2025"
    },
    {
        "full_article": "After battling political exposure for months, U.S. President Donald Trump has finally signed a Bill passed by Congress mandating the Department of Justice (DoJ) to release files relating to the investigation of sex offender and disgraced financier Jeffrey Epstein, who died in prison in 2019. The President’s assent was effectively his concession to enormous pressure from both sides of the political divide, Democrats and Republicans, who had mounted a strong campaign to shine a light upon Epstein’s communications including those with or mentioning Mr. Trump. With the House of Representatives passing the Epstein-related legislation by a 427-1 vote, and the Senate granting unanimous consent to pass the same, there was no avoiding presidential approval for the demand to reveal detailed documentation regarding a man who was convicted of soliciting prostitution from a minor and died by suicide before facing charges relating to sex trafficking of minors. The DoJ has to release within 30 days all files stemming from the investigation of Epstein, with redactions allowed only for details of his victims but not for details of others that may cause any “embarrassment, reputational harm, or political sensitivity”.The broader context to the turn in the Epstein saga is the established fact of Mr. Trump’s friendship with Epstein, even though the President has refuted all knowledge of Epstein’s criminal activities and that he severed relations years ago. Indeed, even though there was no mention of suggested criminality, Mr. Trump’s name was writ large in the 20,000 pages of documents from Epstein’s estate that congressional lawmakers released recently. The information suggests that Epstein did communicate with several other noted social elites including former Prince Andrew of the U.K., Mr. Trump’s former adviser Steve Bannon, and former Harvard president Larry Summers. In what appeared to be a bid to deflect attention away from himself and his associates while acceding to the demand to release the files, Mr. Trump has also said that he would direct Attorney General Pam Bondi to investigate the links that Epstein might have to former President Bill Clinton, JPMorgan and Chase banks, and LinkedIn founder Reid Hoffman, a Democratic donor. Whatever insights the files reveal, it is clear that Mr. Trump has had an association with a high-society criminal guilty of sex crimes against minors and likely against women too. The question is whether voters, especially women in his conservative base of supporters, will consider this association sufficient grounds to back away from Mr. Trump and from MAGA politics more generally. Published - November 21, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        politics\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        sexual assault & rape\n                    \n                            /                      \n                        \n                        justice and rights\n                    \n                            /                      \n                        \n                        crime, law and justice\n                    \n                            /                      \n                        \n                        government departments\n                    \n                            /                      \n                        \n                        investigation\n                    \n                            /                      \n                        \n                        human trafficking\n                    \n                            /                      \n                        \n                        Donald Trump",
        "headline_1": "​Epstein exposure: On Trump and the Epstein files",
        "headline_2": "Trump might have a lot to lose politically from the revelations",
        "link": "https://www.thehindu.com/opinion/editorial/epstein-exposure-on-trump-and-the-ep/article70303276.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "21-11-2025"
    },
    {
        "full_article": "Voting is a constitutional entitlement. But SC interprets it as a right subject to ordinary law\nNew voter rolls are being made in a dozen other states after Election Commission’s SIR exercise in Bihar where many of the nearly 65L – about 8.5% of the electorate – whose names were excluded from the new voter rolls were never informed they no longer had a vote.\n\nMeanwhile, Parliament’s Leader of Opposition has alleged ‘vote theft’ in state polls.\nRead the full story on TOI+.\n\n",
        "headline_1": "What SIR doesn’t get about votes",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/what-sir-doesnt-get-about-votes/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-11-2025"
    },
    {
        "full_article": "Two analysts write on the capture of judiciary & fallout of Hasina’s farcical trial on Bangla politics\nBy Veena Sikri\nOnce Yunus assumed charge as chief adviser to an interim regime on Aug 8, 2024, it became evident that weaponisation of the judiciary was among his top priorities – almost immediately after the operation that ousted Sheikh Hasina.\n\nHasina established Bangladesh International Crimes Tribunal (ICT) in 2010 under the mandate of International Crimes (Tribunal) Act of 1973, updated in 2009, exclusively to try those who perpetrated war crimes during the 1971 Liberation War.\nRead the full story on TOI+.\n‘Bangladesh must brace for more violence as banned Awami League fights back’\n\nBy Smruti S Pattanaik\nAfter Hasina’s government fell in Aug last year, the loud call for her trial, and to bring people responsible for the July/Aug violence to justice, nowhere included a ban on Awami League. It was not on interim government’s agenda either.\nOf course, interim government’s home adviser Sakhawat Hossain was removed from his position within three days of being appointed for his comments on Awami.\n\nA former election commissioner, he had commented, “As a political party, organise yourselves. Participate in elections.\nIf the people vote, go ahead.”\nRead the full story on TOI+.\n\n",
        "headline_1": "Death sentence for Bangladeshi democracy",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/death-sentence-for-bangladeshi-democracy/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-11-2025"
    },
    {
        "full_article": "By Vijay Hashia\nIntuition is often regarded as a glimpse of inner truth, arising spontaneously and independent of logical deduction. When cultivated, this inner guidance can steer one towards the knowledge of one’s true Self.\nIn Vedantic and other spiritual philosophies, Self-realisation refers to the awareness of one’s essential nature beyond ego or personality. This is the recognition of the Self, Atman, as a reflection or fragment of the universal consciousness, Brahmn.\nIntuitive guidance, then, can serve to Self-realisation, as it bypasses the analytical mind and taps into a more fundamental layer of awareness that is directly connected to this universal consciousness.\nIntuitive experiences dissolve boundaries between self and the world, fostering a profound sense of oneness as a ‘union’ with the Divine or the Absolute.\n\nBuddha delved into depths of his being. He gained access to avast wellspring of wisdom that surpassed the boundaries of intellectual knowledge. Through intuitive insight, he effortlessly grasped the fundamental nature of suffering, impermanence of all phenomena, and the path to liberation from the cycle of rebirth and suffering.\nA quote often misattributed to Albert Einstein suggests, “The intuitive mind is a sacred gift, and the rational mind a faithful servant. We have created a society that honours the servant and has forgotten the gift.”\nThis ‘gift’ is a wellspring of creative vision, a manifestation of an almost transcendent awareness that cannot be fully captured by intellectual analysis alone. Intuition arises from an innate, often mysterious connection with universal truths, bearing wisdom that logic might struggle to decipher or even acknowledge.\nThis perspective speaks of the broader human dilemma of discerning between the seen and unseen, the measurable and immeasurable. In privileging the rational society often diminishes profound wisdom that intuitive awareness brings, reducing its role in our lives to margins.\nTrue wisdom lies in harmonising these faculties, allowing the rational mind to perform its diligent role while remaining open to the boundless insight that intuition offers, thereby embracing a fuller, richer, and more integrated understanding of life.\nIntuition arises from an innate, often mysterious connection with universal truths, bearing wisdom that logic might struggle to decipher or even acknowledge.\nIntuitive experiences are often mystical, inexplicable to describe in words, as they involve a deep sense of connection that goes beyond ordinary limits of human experience.\nSome describe these experiences as kind of ‘Union’ with the divine or the Absolute in which the boundaries between self and the world dissolve and a sense of oneness is achieved.\nGita suggests that complete self-surrender to a higher power can be an intuitive guidance, leading to Self-discovery and a deep appreciation for the interconnectedness of all things.\n\n\n",
        "headline_1": "Beyond reason: Knowing intuitive mind",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/beyond-reason-knowing-intuitive-mind/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-11-2025"
    },
    {
        "full_article": "Terrorism cases need speedy disposal. SC’s 6-month guidance should jolt govt to beef up NIA courts & NIA\nSC has again urged Centre to speed up trials in NIA cases, this time with the welcome recommendation of a “six-month” time frame. It’s no secret that justice moves slowly in India. The reason is also well-known: shortage of judges. In July, 371 posts of judges – 33% – were vacant across high courts alone. But the country’s NIA courts make these numbers look good. By govt’s own admission in Sept, only three of the 50 designated NIA courts exclusively dealt with NIA cases. That means judges in these courts had to divide time between ordinary criminal cases and high-profile terror trials, “at the cost of…hundreds of undertrials who are languishing in jail, senior citizens, marginalised persons”. \nThe result is long delays. Baramulla MP Abdul Rashid Sheikh, for example, has spent years in jail after being named in a terror funding case. He requires custody parole to attend Parliament every time. That’s why SC had warned in July that it would release undertrials in NIA cases if their trials took too long. Since then, govt has been working to strengthen NIA courts. Talks are on with 11 states, but space has been a hurdle for setting up the 10-12 planned exclusive NIA courts.\nBesides, NIA has its own staff woes that slow down probes. Of its 1,901 sanctioned posts, 541, or 28%, were vacant in June this year. These include ground roles ranging from constable to inspector. After the Nov 10 Delhi blast, filling up these posts should be a priority. And to ensure that terror accused are brought to justice swiftly, NIA courts with adequate staff and infrastructure should be set up, per SC’s directions. The top court has sought a firm decision by Dec 16. Govt should stick to the deadline.\n\n",
        "headline_1": "Trial & Terror",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/trial-terror/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 21, 2025 00:00:00  \nThe interim government's amendment of the labour law, despite objections raised by business groups during the draft stage, has triggered fresh protests demanding its withdrawal. Opponents argue that some key provisions deviate from the understandings reached earlier in tripartite meetings involving the government, employers and labour representatives. The gazette notification issued on November 17 by the Ministry of Law, Justice and Parliamentary Affairs introduced a range of revisions, including reducing the number of workers required to form a union, easing trade union registration requirements, expanding definitions related to workers and workplaces and imposing new obligations on employers regarding safety, hygiene and maternity benefits. One of the most significant shifts allows for 20 workers in factories employing between 20 and 300 workers to form a trade union.\nThese changes, widely seen as driven by international pressure, aims to align Bangladesh's labour standards with global norms -- an alignment deemed crucial for sustaining preferential trade benefits, particularly in the European Union. Rights organisations, major buyers, and international partners such as the International Labour Organisation (ILO), the EU and the United States have been consistently advocating for stronger labour rights and more flexible trade union rules. However, several provisions of the amended Ordinance have drawn sharp criticism for allegedly straying from the consensus built during earlier consultations. A central point of contention concerns the criteria for forming trade unions. The amended ordinance replaces the percentage-based representation system with fixed numerical thresholds. Critics say this change departs from the tripartite committee's recommendation, which required a minimum of 50 workers to form a union in establishments with 50 to 500 employees. The new framework, they argue, lowers the bar too far and risks destabilising industrial relations.\nUnder the Bangladesh Labour (Amendment) Ordinance 2025, at least 40 workers' representation would be required for factories having workers ranging from 301 to 500. Factories having workers from 501 to 1,500 and 1,501 to 3,000 would require 100 and 300 workers' consent respectively to form a trade union. Some 400-worker representation is a prerequisite to form a trade union in factories with more than 3,000 workers. The ordinance permits up to five unions within a single establishment, raising fears of union proliferation, factionalism, and potential interference from external actors. These sweeping changes have drawn strong resistance from key industry bodies. They argue that several provisions incorporated into the ordinance go beyond what had been agreed upon in the consultative process. The trade bodies warn that unless the amendments are reconsidered, the industry could face operational instability.\nAt the core of the business community's dissatisfaction is the belief that the consensus-based approach promised during the amendment process was not honoured. Their grievance -- that the agreed positions reached in tripartite discussions were sidelined -- cannot be dismissed lightly. Since the reform was meant to reflect a broad-based agreement, it was reasonable to expect adherence to the negotiated outcomes. The controversy now underscores the delicate balance required between meeting global labour standards and ensuring stability in the country's industrial landscape.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Labour ordinance goes past tripartite agreement",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/labour-ordinance-goes-past-tripartite-agreement-1763654230",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       November 21, 2025 00:00:00  \nReports on hunger and food insecurity are unnerving. The 2025 state of food security and nutrition in the world (SOFI) report finds that 673 million people constituting 8.3 per cent of the global population faced acute hunger in 2024. The SOFI is an annual publication by five important United Nations (UN) agencies---the Food and Agriculture Organisation (FAO), International Fund for Agriculture Development (IFAD), United Nations Children's Fund (UNICEF), World Food Programme (WFP) and World Health Organisation (WHO). The same report claims that 2.3 billion global people faced moderate to acute hunger and 2.6 billion could not manage nutritious and healthy diets. \nIndeed, there was a sharp rise in the number of global people facing hunger and experiencing food insecurity in the post-pandemic time. In 2021 the number of people suffering chronic hunger was 828 million, which came down to 733 million in 2023. The hunger rate has continued to decline but not as fast as could make up for the lost progress in the past five years. Yet the current ratio of one in 11 people as against one in four 55 years ago is a progress on the global hunger front. If the present trend prevails, 512 million people still are likely to face acute hunger in 2030. The prevalence of hunger is uneven with 60 per cent of the hungry people projected to be living in Africa. \nWar and internecine feuds have been the main reason behind food insecurity for 140 million people in 20 countries. The Covid-19 pandemic may have triggered the food shortages but its impact has been particularly telling for those countries riven by armed conflicts. Climate change and unpredictable extreme weather have been responsible for food losses and insecurity. Yet the world produces enough food to feed its 8.2 billion people but for the uneven distribution of the same. \nAccess to food is a human right and if the world cannot ensure availability of healthy food to a large number of its people, the present civilisation ought to stand accused of not living up to its promise. When billions of dollars are spent on weapons of mass destruction and people go hungry in any corner of this planet, the psychological shock should have been monumental for world leaders. Instead of resolving conflicts, they stoke social unrest and even violent hostilities in underdeveloped countries in order to monopolise exploitation of resources there. This is in addition to the plunder of wealth, particularly from Asia and Africa, during the colonial rule. \nLike the climate fund the biggie emitters of CO2 in the world are now contributing to as a compensation for spoiling the planet's health, the once colonial power have been making some amend in the form of aid or donation for their act of mindless exploitation of the colonies under them. Now the development aid has already shrunk and likely to shrink further in the days to come. A study by the Barcelona Institute for Global Health (ISGlobal) paints a grim picture of the impact of abrupt cuts to such aid by the major donor countries. The United States of America, Britain, Germany have tight-fisted to reduce their development aid for the first time in three decades. The ISGlobal's projection is that the aid cuts would be responsible for 22.6 million additional deaths in developing countries by 2030. Of those, 5.4 million will be child deaths. In its 2026 Global Outlook, the WFP claims that 318 million people may face 'crisis level hunger or worse' in 2026. \nThis is an indication that the 'Zero Hunger', one of the sustainable development goals (SDGs) will remain out of reach by 2030. The predicament of both displaced people such as the Rohingya on account of political unrest and conflicts and the climate refugees will be worse on account of the slashing of the overseas development assistance (ODA) by the rich nations in the West. \nThen why are the donors reducing their assistance? Their economies are not performing particularly well. The rise of Asia, including some South-east Asian countries and China and India in particular has made the Western powers nervous. A cold war-like political atmosphere is now vitiating relations between and among the major players of the world. US President Trump has made the European powers to finance their security requirements, curtailing their overwhelming dependence on America. Here is an American president who betrays method in madness has, in the name of US interests, antagonised both allies and enemies. Rich and developed countries have been compelled to dig deep into their reserves. \nThe humanitarian cause of feeding the hungry has been relegated to the back burner. Trump's inconsistent reciprocal tariffs have had adverse impacts on the global economy in general. He penalises some for following policies that clash with American interests but exonerates others for the 'same offence'. Unpredictability of his trade policies has caused unprecedented disruptions to international commerce and trade. The international programmes of feeding the world's hungry and taking care of the health and hygiene in countries not capable of addressing such critical issues themselves are no longer a priority. \nWith the climate change wreaking havoc and the artificial intelligence (AI) pushing human employees out of job, more and more people are set to lose their jobs. The digital divide has only turned people more selfish and devoid of compassion. Nations are out to build their defence mechanism in terms of lethal weapon system and economy. Unless the fresh race for economic and defence superiority can be contained, the hapless, poor and hungry will have no chance of survival as healthy and dignified citizens on this planet.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Hunger and food insecurity stare in the face of world",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/hunger-and-food-insecurity-stare-in-the-face-of-world-1763654268",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       November 21, 2025 00:00:00  \nAt a recent roundtable on business climate organised by The Financial Express, the vice chairman of the Export Promotion Bureau has posed a pertinent question: should the government be doing business at all? The question is as old as the state-owned enterprises themselves and is more relevant today than ever before, but it seldom received the attention it deserves.\nIn the current era of hyper-competition when technology is going through a revolutionary change and the demand for managerial excellence is increasing, government-owned enterprises are mostly being led by general-cadre administrative officials who lack business operation skill and integrity. So, what happened was inevitable. The government continues to carry the burden of state-run enterprises that, in most cases, fail to justify their existence.\nThe state-owned businesses of the country reflect a legacy inherited from the philosophy shaped during the early years of independence, when the state took upon itself the responsibility of producing and distributing essential goods. Over time, the global and local economic landscape changed massively and private sector entrepreneurship began to flourish. New players arrived with better managerial skills, innovative ideas, adaptive strategies and improved financial discipline. They outperformed state-owned enterprises in efficiency, strategies, innovation, and sustainability. But state-owned enterprises continued to operate with persistent inefficiencies, outdated technology and at chronic losses.\nThe cadre-service officials, who are entrusted with the tasks of leading public enterprises, may be highly capable in administrative or bureaucratic tasks, but running a business needs an entirely different skill set. Managing production and supply chains, driving profit strategies, tackling financial risks, maintaining competitiveness and protecting shareholder interests are not the tasks that bureaucratic training prepares one for. The mismatch between business requirements and administrative training inevitably produces inefficiencies.\nA lack of accountability, transparency and integrity are a few major issues that most state-owned enterprises face. While the private sector is governed by discipline and accountability, public enterprises show the opposite trend. The governance structure in most state-owned enterprises is weak, with little internal oversight and almost no consequences for poor performance. Audit observations accumulate year after year with almost no corrective action. Boards are often constituted with people without expertise to ensure good governance. Political considerations sometimes influence key decisions -- from procurement to recruitment. On the other hand, those appointed to lead these businesses often serve short stints - they come from other assignments and again are transferred to some other posts. Such short tenures work as a deterrent to the development of a sense of ownership among the leadership as well as to making meaningful changes. So public enterprises keep making losses and are protected by taxpayers' money. The same scenario prevails in public enterprises in diverse sectors - from jute to textile, sugar to medicine, postal to telecom, transport to engineering.\nOn the contrary, private enterprises cannot afford making losses. Market pressures force them to innovate, adapt, and manage resources efficiently. If any private enterprise fails to keep up and make losses for a long period, it risks defaulting on loan repayment. Once anyone becomes a defaulter, s/he becomes ineligible for fresh loan, running public office and even risk imprisonment.\nNow a question remains -- should the government completely withdraw from all sorts of commercial activities? Global experience suggests that governments need not be completely absent from such activities, but their involvement must be strategic. Sectors related to national security, essential public services, utilities, or large-scale infrastructure like railways require state ownership. But in such cases, professional management is necessary, not administrative control. Many countries have corporatised state-owned enterprises, choosing performance-based appointment models, constituting professional boards, and adopting international reporting standards. China is a bright example of running public enterprises viably. Bangladesh has made attempts for reforms in public enterprises, particularly state-owned banks, progress remains slow. The country should no longer carry the burden of loss-making state enterprises in non-strategic sectors where the private sector has demonstrated clear superiority. If the enterprises in strategic sectors are to survive and make meaningful contributions, they must be restructured with a strong emphasis on professional management, transparency and strict performance metrics.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Should government  still be in business?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/should-government-still-be-in-business-1763654299",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 21, 2025 00:00:00  \n\n A new trend is emerging in Bangladesh's business landscape: the rise of ethical consumerism. Today's consumers, particularly the younger generation, are becoming increasingly aware of how and where their products are made. They prefer supporting brands that prioritise fair labour practices, environmental sustainability, and honest business operations, rather than those focused solely on profit. This shift in mindset is encouraging many local companies to adopt eco-friendly materials, reduce plastic use, and ensure ethical production methods.\nHowever, some firms exploit this trend through \"greenwashing,\" claiming to be sustainable without taking genuine action. To prevent this, transparency and accountability must be promoted through certification, public reporting and consumer education. If supported by the government and media, ethical consumerism can drive sustainable economic growth and inspire a new era of responsible business in Bangladesh. Ultimately, our buying choices can shape not only markets but also the moral direction of our economy.\nSumaiya Sultana\nUndergrad Student\nBachelor of Business Administration (BBA)\nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Rise in ethical consumerism",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/rise-in-ethical-consumerism-1763654321",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-11-2025"
    }
]