[
    {
        "full_article": "The joint statement by the leaders of Canada, France and the United Kingdom, and announcements by the U.K. and the EU to pause trade talks with Israel are proof that the Netanyahu government is growing more isolated over its brutal campaign on Gaza. Since the ceasefire ended on March 18, over 3,000 residents have been killed in the enclave, according to the Gaza Health Ministry. Israel’s chokehold on aid and humanitarian supplies has pushed thousands to the brink of starvation, a fact that even Donald Trump, President of Israel’s all-time ally, the U.S., referred to during a trip to West Asia last week. Mr. Trump’s decision to skip Israel was seen as a mark of his displeasure with Prime Minister Benjamin Netanyahu’s policy on the issue. Despite the rebukes, Mr. Netanyahu has said Israeli Defence Forces needed to continue to target Hamas operatives in the area, and added that Israel would now re-take full “military control” of the Gaza strip, which the IDF had vacated in 2005. The comments provoked an angry response from the leaders of Canada (Mark Carney), France (Emmanuel Macron), and the U.K. (Keir Starmer), all of whom had pledged their support to Israeli actions in response to the October 7, 2023 terror attacks. They called the level of human suffering in Gaza “intolerable” and Israel’s escalation of bombardment a “disproportionate” response, condemned the Israeli leadership for threatening to evict all Palestinians forcibly from the strip, and recommitted to a “two-state solution” for Israel and Palestine, to be discussed at a United Nations conference in June. Significantly, the three countries even threatened sanctions against Israel. Mr. Netanyahu’s response, to accuse the three leaders of handing Hamas a “huge prize”, and vowing not to stop “until total victory is achieved”, indicates that he still believes that he can continue without being checked.It is time for the international community to speak up so that Mr. Netanyahu does not think he can get away with what international agencies are calling genocide. New Delhi has notably thus far not issued any statement. This silence may be because of its own preoccupation with Pakistan and due to Israel’s unequivocal support over Operation Sindoor. There is no link or equivalence between the two situations, however. Too many lives have been lost in the incessant bombardment by Israel of an area of two million people. Despite the depredations, Israel has not, with any clarity, met its objectives of bringing back the hostages or of wiping out Hamas’s presence there yet. Mr. Netanyahu has tried to frame his government’s actions as a “war of civilisation over barbarism”, but it is he who must consider how much this direction-less war that appears to punish the weakest and most defenceless the most resembles the latter more than the former, as the numbers of supporters for this war diminish worldwide. Published - May 22, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Canada\n                    \n                            /                      \n                        \n                        France\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        European Union\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Palestine\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        economic sanction\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict",
        "headline_1": "​Israel’s isolation: On the western world and Gaza",
        "headline_2": "Netanyahu must not be allowed to get away with mass murder",
        "link": "https://www.thehindu.com/opinion/editorial/israels-isolation-on-the-western-world-and-gaza/article69602889.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-05-2025"
    },
    {
        "full_article": "The marginalised have come to the fore with Banu Mushtaq winning the International Booker Prize for 2025. In a first for Kannada, Mushtaq and her translator Deepa Bhasthi walked away with the top honours on Tuesday night (May 21, 2025) in London for Heart Lamp. This is also the first time in the history of the prize that a collection of short stories has won. Breaching walls, breaking ceilings, and enduring angry outbursts, Mushtaq chronicles the lives of Muslim women and their anxieties. Her stories are also peopled by clueless husbands, children who are like “monkeys without tails”, loving and, sometimes overbearing, grandmothers, muscular brothers and maulvis. But as Mushtaq has said in interviews, the narratives are primarily about women and how “religion, society, and politics demand unquestioning obedience from them, and in doing so, inflict inhumane cruelty upon them”. She writes with candour and wry humour, even as the women are often struggling to stay afloat with their backs against the wall. In her moving acceptance speech, Mushtaq harped on the power of words to “create a world where every voice is heard, every story matters, and every person belongs”.Showering praise on Kannada, she said that it is a language that sings of resilience and nuance — “to write in Kannada is to inherit a legacy of cosmic wonder and earthly wisdom”. The 77-year-old Mushtaq hails from Hassan in Karnataka, like another illustrious writer, Raja Rao, who wrote in Kannada, English and French. Mushtaq, a lawyer and activist, was inspired to write after hearing of the “pain, suffering, and helpless lives” of the women she interacted with. The “radical translation” by Bhasthi was praised by the Jury chair Max Porter who said it “ruffles language to create new textures in a plurality of Englishes”. Heart Lamp’s Booker, just three years after Geetanjali Shree won for Tomb of Sand, should open doors for India’s rich regional languages to gain a wider readership. Mushtaq follows a trail of writers such as Perumal Murugan, Vivek Shanbhag, Bama, Jayant Kaikini, M. Mukundan and S. Hareesh who observe the human condition in a socio-political context with their translators ensuring the rhythms of the original language are not lost. In a world that often tries to divide people, Mushtaq said that literature remains one of the “last sacred spaces where we can live inside each other’s minds if only for a few pages”. It is the only place that can embrace stories from unheard corners and translations that defy borders. Published - May 22, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        award and prize\n                    \n                            /                      \n                        \n                        Kannada literature\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        award-winning books\n                    \n                            /                      \n                        \n                        society",
        "headline_1": "​Stories from the heart: On Banu Mushtaq winning the International Booker for Heart Lamp",
        "headline_2": "Banu’s Booker will help regional languages gain global recognition",
        "link": "https://www.thehindu.com/opinion/editorial/stories-from-the-heart-on-heart-lamp-and-the-booker-prize-2025/article69602336.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-05-2025"
    },
    {
        "full_article": "Killing top Maoists like Basavaraju will hobble extremism, increasing prosperity will finish it  \nThe killing of top Maoist leader Basavaraju in Chhattisgarh on Wednesday is a morale booster for security forces and leaves Naxals on the backfoot. Basavaraju, as Amit Shah pointed out on X, is the highest ranking Naxal neutralised in over three decades of operations. He was allegedly the mastermind of the April 2010 Dantewada ambush in which 75 CRPF personnel were killed, and also the 2013 Jhiram Ghati massacre in which most of Chhattisgarh Congress’s top leadership was wiped out. Since 2017-18, he had led CPI(Maoist) as its general secretary, and carried a ₹1cr bounty on his head. \nBy eliminating Basavaraju, GOI has taken a giant stride towards its goal of ridding the country of Naxalism by March 31 next year. The fact that this successful operation – in which 26 other Maoists were killed – was carried out close on the heels of the 21-day Operation Black Forest that resulted in the arrest of 54 Naxals and the surrender of 84 others, shows the increasing momentum of govt’s assault on the last strongholds of Naxals. Last month, Shah had said the total number of Naxal-affected districts had reduced to 18 across seven states, from 38 in nine states earlier. And almost 90% of Naxal violence is now concentrated in six districts across four states.\nFor years, Naxal or ‘Left Wing Extremist’ (LWE) violence has been considered as India’s biggest internal security challenge – bigger than Kashmir – and Shah had acknowledged this in an interview to India Today recently. Back in 2006, Manmohan Singh had also said as much: “It would not be an exaggeration to say that the problem of Naxalism is the single biggest internal security challenge ever faced by our country.” At that time, the number of Naxal-affected districts was 160. It had blocked investments and held up development, perpetuating the backwardness of these regions. Now, as the threat abates, govt must fast-track development to ensure Maoists find no takers for their violent ideology.\nWhile Shah recently said, “Disgruntlement over the lack of development could be seen as a cause of Naxalism”, Singh’s diagnosis was similar: “Exploitation…iniquitous socio-political circumstances, inadequate employment opportunities…lack of land reforms – all contribute significantly to the growth of the Naxalite movement.” It’s not surprising that Naxalism’s retreat has coincided with India’s rapid economic growth. While guns will silence old ideologues, only prosperity will shut down the nursery of violence.\n\n",
        "headline_1": "Red star waning",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/red-star-waning/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-05-2025"
    },
    {
        "full_article": "Gaza is a 21st century human tragedy. Those who can, won’t end the war. Those who wage the war, will provide aid \nPalestinians in Gaza are protesting against Hamas. Israelis in Tel Aviv and Jerusalem are denouncing Netanyahu’s renewed assault on Gaza since March. After a bloody weekend of bombing, Netanyahu escalated the offensive Monday vowing to take “full control” of Gaza. The death toll has estimatedly crossed 50,000. One in five Palestinians is starving. Three points. \nOne, Qatar was part of the ceasefire dealmaking and has said the international community must react to Israel’s escalation, which, per a Qatari minister, will “give legitimacy to non-state actors”. This is more of the Arab states’ hands-off approach, leaving it to US to stop the Israel-Hamas war. The Arab world seems to find no major reason to upset smooth bilateral ties with US, by talking of Washington’s role in regional stability. \nHamas is a terror group – little can be expected from it. But Washington can stop fellow democracy Israel’s wildly disproportionate retaliation to Hamas’s Oct 7 terror act. Yet Trump 2.0 is content snatching credit for a pause in fighting. If Israel didn’t hold up its side of the deal, ah well, what can Trump do? If anything, Trump’s return has emboldened Netanyahu, who faces no consequences. Over 3,000 Palestinians are estimated killed since March 18. \nThree. What has triggered sharp reactions from EU, UK and Canada is Netanyahu’s weaponising of food and aid. For 80 days and counting, Israel has blockaded food, water, and medicine from entering Gaza. Tel Aviv has decided a US and Israel-backed aid organisation will be the conduit for relief. So, forces driving the offensive will provide aid instead of neutral UN organisations. That’s almost Trumpian. Calling Israel’s aid blockade “catastrophic”, EU – Israel’s biggest trade partner – will review their trade, valued at over €42bn a year. UK too has suspended trade talks. In short, Netanyahu’s pounding of Gaza cannot be stopped by talking to him, but he can be taken on for flouting humanitarian law. Whatever it takes. \n\n",
        "headline_1": "Who’ll stop Bibi?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/wholl-stop-bibi/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-05-2025"
    },
    {
        "full_article": "Held in terror by Don Alphonso and Salim Langda\nPray heed the plight of the Person Who Doesn’t Like Mangos. Other minorities know naught of our marginalisation, discrimination, the looks ranging from sheer pity to sneer contempt. We are the pariahs of polite company – sliced, cubed, pulped, if not skinned alive and stoned.  \nAs the first basket of blushing Lalbagh lifts its hay veil, as the first Gulabkhas spreads its fragrance, the rest of the country awakes to life and salivation. I sink into inescapable hell. Soon the Don himself swaggers through the street, his flag-bearer trumpeting  his arrival, ‘Haaa- poos!’ He overpowers every mall foodhall and street stall, establishing his dominance. His eager followers, nay worshippers, are swept up in the fervour of ecstasy. I get swept into the corners of ridicule. ‘You don’t like mangos?! What’s wrong with you?! Are you anti-national, or wot?!!!\nActually, I’m just hungry. There’s nothing else on the menu. Especially if you are Gujju. Forget omnipresent aam ras. Even the skin isn’t spared but is lavished with the rye-hing no vaghar bestowed on everything from bheenda to teenda. We Parsis seem to have adopted this mangi-ficent obsession along with the language and dress conditions for settling in Jadi Rana’s Gujarat fiefdom millennia ago. We cook the ripe mango with mutton like we do everything from tomatoes to turiya. We uniquely pickle it whole, steamed and steeped in a mustard-spiked vinegar, earning brownie points or bucks with this Bafenu achar. Invited anywhere, I sit sullenly sucking my resentment while the rest of the table is spaced out sucking skin and stone. \nIn humble Mumbai bhojanalay or hi-fly Bombabe restaurant, everything else gets its just desserts. Last week, it even drove un-evictable caramel custard off a toff  Club’s menu;  actually, in an ‘I kissed thee ere I killed thee’ act, it smothered poor pudding to desecration and death.  Mango may be the ‘food of love’ but no one seems to ‘sicken and so die’ of its ‘surfeit’. \nMy old aunt used to clear a shelf of her Godrej almirah for this summer visitor, pacing up and down her balcony awaiting the guy with crate and cry. She’s gone to the great orchard in the sky where the aambrosial cup never runs dry, and where no keri appears perfect and ready to eat but turns out rotten at the core. That is ‘the most unkindest cut-open of all.’ \nNot just foods, everything  bows-out to the ‘King’. In my small, local readymades shop, you can’t see the tees for this Dawood. I kid you not. Salim Langda, Malda Mastan, Lala Chausa will strut their hour about the state. Accompanied by molls: Don’s own Pairi, Neelam, Dusseri, Badami or any aamrapalli as sweet by other name.\nRight through their stranglehold, we, disgruntled dishonourables, must remain silent. Bound by the ‘Aamerta’ code.\n                                          ***\nAlec Smart said: “MP mantri’s Col Sofiya apology was just naam ke vastey. Just as his slur was naam ke liye. As is Prof Mahmudabad’s absurd arrest.” \n\n",
        "headline_1": "Persona non manga",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/persona-non-manga/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-05-2025"
    },
    {
        "full_article": "US president’s attempted reset of peace negotiations between Moscow and Kyiv either failed or was just a show. From Russian leader’s comments after Monday’s chat, it’s clear only a military defeat can stop him\nIn the early 19th century, one of the founding fathers of modern war studies, German General and military historian Carl von Clausewitz commented, on the Napoleonic Wars, that “[t]he conqueror is always peace-loving […]; he would much prefer to march into our state silently […].” This has been and remains an observation that applies to most military aggressions. Though simple and understandable, Clausewitz’s idea was initially ignored by most Europeans when interpreting Moscow’s behaviour after the start of the Russo-Ukrainian war in 2014.\nRead full story on TOI+\n\n",
        "headline_1": "Putin trolling Trump?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/putin-trolling-trump/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-05-2025"
    },
    {
        "full_article": "The UN's warning on the state of Gaza on Tuesday—that two million people face starvation and 14,000 babies face death within 48 hours if aid doesn't reach them on time—paints a picture that is not just dire; it is the epitome of distress. These people are being subjected to a war they had no part in making. World leadership has failed to put a stop to this blatant disregard for human lives in a largely one-sided war that has violated all international conventions on armed conflict and human rights. The current situation should have a sobering effect on world leaders, and from recent reports, it seems it has, at least on the surface. However, whether they can capitalise on that and come together to restrain Israel from causing further damage remains to be seen.\nAccording to reports, Israel on Monday allowed humanitarian aid to enter the Gaza Strip, which it had blocked for more than two and a half months, letting five aid-carrying trucks through. But this happened not because Israeli leadership decided to uphold human rights; its prime minister explained to supporters that preventing a famine in Gaza was necessary for \"diplomatic reasons\" as \"images of mass starvation\" could delegitimise their war efforts. Just a few days ago, however, he launched a fresh military offensive in Gaza—a move Israel's war cabinet approved earlier this month, aimed at \"taking control\" of the entire strip.\n\nCountries and people worldwide have been criticising Israel's genocidal actions in Gaza since the beginning of its military offensive in retaliation to the Hamas attack on October 7, 2023. That has made no difference whatsoever, as their concern has never translated into effective action to stop Israel from indiscriminately killing innocent civilians. Israel continues to do as it pleases, having killed more than 53,000 people in over 20 months now.\nThe lack of empathy in Israel's leadership for the starving residents of Gaza boggles the mind. Its actions, including blocking aids, have drawn widespread condemnation, including from some of its allies. On Monday, the UK, France, and Canada warned of \"concrete actions\" against the country if it continued its operations in Gaza. But this is nothing new. Countries and people worldwide have been criticising Israel's genocidal actions in Gaza since the beginning of its military offensive in retaliation to the Hamas attack on October 7, 2023. That has made no difference whatsoever, as their concern has never translated into effective action to stop Israel from indiscriminately killing innocent civilians. The ceasefire deal finalised in January this year fell through in less than two months. Israel continues to do as it pleases, having killed more than 53,000 people in over 20 months now.\nEvidently, mere warnings will no longer cut it. The time has come for Israel's friends to force its hand through stern measures. If that means imposing targeted sanctions to make it follow international laws and allow humanitarian efforts in Gaza—without any conditions—then so be it. There is absolutely no time to waste when people, including babies, are starving to death.\n",
        "headline_1": "Don’t let babies become war casualties ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/dont-let-babies-become-war-casualties-3900121",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-05-2025"
    },
    {
        "full_article": "Once a symbol of resilience, Dhaka has now become synonymous with relentless street protests and processions with various demands. What was once a means of voicing collective grievances has turned into a spectacle that is chaotic, disruptive, and at times alarmingly close to being anarchist. In today's Dhaka, the fastest way to be heard is not through dialogue or democratic processes, but by blocking roads and disrupting public life. The more disruption one causes, the more likely they will gain attention and concessions.\nThis shift reflects a deeper crisis: the breakdown of institutional governance. The streets have replaced the parliament and other platforms for voicing demands and shaping national discourse. Negotiation has given way to confrontation. Tragically, public suffering—once something to be avoided—has become a calculated strategy. Disorder is now the norm.\nWhat we are witnessing is more than just a wave of protests, however. Since the July uprising, a troubling new trend has emerged. Under the guise of \"mob justice,\" various groups, including students, have taken the law into their own hands. Empowered by public sympathy and a sense of impunity, they have often engaged in unlawful activities without accountability. What began as a broad-based movement for democratic renewal is now at risk of being hijacked by those seeking power, recognition, or revenge.\nIs this the spirit of July? Did people sacrifice their lives for lawlessness to prevail? The movement was not led by students alone—it was a national awakening that drew strength from people across social, political, and ideological divides. Even many Awami League supporters took part, united by a desire for genuine change. Yet now, some groups are attempting to claim sole ownership of that legacy, silencing or ignoring the very diversity that made the uprising powerful.\nThe real danger lies in the precedent that these token street victories are setting for the future. From public to private university students, from government to private sector employees—everyone seems to be on the streets, forming new protest groups with new demands every day. The demands are endless, and so are the chaos and disruption. It was the students who paved this path, showing how the government could be influenced or forced by protests. When Awami League's activities were recently banned under pressure from demonstrators led by NCP and other groups, it further solidified the appeal for exploitative street protests.\nWe've seen such patterns before. The Shahbagh movement, too, began with high hopes on the streets. But without structural backing, leadership, and clear goals, it faltered. That history should be a warning: revolutions that remain on the streets are vulnerable to being co-opted, lost, or crushed.\nMeanwhile, the interim government, entrusted with steering the nation towards its most critical election in decades, is faltering. Reform was promised. A fresh start was envisioned. But instead, we see delay, dysfunction, and drift. While some argue that the government is overwhelmed, others believe it is using the unrest to justify prolonging its stay in power. Either way, public trust is eroding, and expectations are fading.\nWhat's most disappointing is that capable individuals are in key positions, yet they appear paralysed by indecision or political caution. The government has either failed to set its priorities right or has chosen to linger in power. As the days pass, the distance between the people's aspirations and the state's actions only grows.\nThe Yunus administration's signature stance has been to turn a blind eye till a street campaign begins to disrupt civic life and cause serious public suffering. But by that point, the one immediate and most expedient recourse has been to capitulate and agree to the demands.\nThe interim government has thus far failed to show a convincing resolve to reject demands from the streets, no matter how unreasonable. Whether it was to increase the age limit for government jobs or the demand for a separate university for certain colleges, the government has not been able to dissuade protesters in most cases. Nor has it been able to foil such campaigns.\nThe path forward must begin with restoring law and order, not through repression, but through principled leadership. Parliament, not the streets, must once again become the centre of democratic discourse, which demands an immediate, transparent, and credible election roadmap. Only then can the people's voice return to its rightful place: within the institutions built to serve them.\nIf this moment is squandered—if the hopes of July dissolve into infighting and opportunism—the consequences will be devastating. Bangladesh has waited too long for democratic rebirth. It cannot afford to be betrayed again.\nMohammad Al-Masum Molla is a journalist at The Daily Star. He can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The price of unchecked protest politics",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-price-unchecked-protest-politics-3899976",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-05-2025"
    },
    {
        "full_article": "The balance may be shifting. Resolving the Rohingya crisis is being swayed by more external winds than internal thrusts. Dynamics such as Bamar treatment of the Rohingya, humanitarian care of the evicted Rakhine persons, and Bangladesh-Myanmar discussions on repatriating the displaced persons from Cox's Bazar camps have been overtaken by Myanmar's 2021 coup d'etat and its civil war consequences, regional spillovers thickening across Southeast Asia, and an independent resurgence of \"democracy\" inside Bangladesh, splashing externally.\nIn reverse order, Bangladesh Chief Adviser Prof Muhammad Yunus is more cited globally today not so much for his trademark microfinance contributions as his democracy-salvaging attempts since the historic ouster of the Awami League regime through a student-led democratic uprising last year. In comparison to Bangladesh's efforts in reviving democracy, Myanmar's deficiency of democracy has emerged more despairingly.\nDemocracy is a reform movement in deficient countries. The other side of this movement defends the status quo to keep narratives in the same ballpark. Bamars, the largest ethnic group in Myanmar, who represent that \"other\" Rohingya side, controlled all of Myanmar from Naypyidaw through the Tatmadaw armed forces. Under today's civil war, reportedly, less than one quarter remains in their hands. The National Unity Government (NUG), a mixed group, influences the rest. Its reformers, the National League for Democracy (NLD), a party of former Nobel Peace Prize winner Aung San Suu Kyi, replaced military rule with \"democracy\" in 2015 and won again in 2020. After a stuttering start, her party was ousted in the February 2021 coup, after the Rohingya malaise spilled over into Bangladesh.\nOther NUG members include discriminated ethnic groups in the northeast, north, and northwest. Because of that discrimination, they defend the status quo (their histories, identities, and interests), but support the reformers to evict General Min Aung Hlaing, the coup leader and current State Administration Council chairman. This gap between the local and provincial priorities and the overarching national priority—such as democracy—matters. These ethnic groups include the United League of Arakan (ULA) and its armed faction, the Arakan Army (AA), along Bangladesh and India's eastern borders; Kachin Independence Army (KIA) along China's southern border; Karen National Union (KNU) along Thailand's border; and Ta'ang National Liberation Army (TNLA) and Myanmar National Democratic Alliance Army (MNDAA), both of which function mostly out of Shan state along China's southern border, among others.\nRakhine, the Rohingya home, stands divided between ULA/AA and the Arakan Liberation Party (ALP). The ALP military faction, Arakan Liberation Army (ALA), often collaborates with Naypyidaw's State Administration Council and clashes with the ULA/AA along the Bangladesh borders. They subject the Rohingya people to crossfires in such locations as Buthidaung and Maungdaw, and signal the increasing need for negotiations rather than battleground exchanges to sort local problems.\nThe growing ULA/AA empowerment gives it greater intra-NUG salience. It has evicted Naypyidaw military forces across Rakhine and finds support from the Organization of Islamic Countries (OIC). Bangladesh unofficially satisfies two ULA/AA conditions for a Rohingya solution: recognition of the ULA/AA, and mobilisation of UN-based global support.\nNUG's \"reformer\"claim is, however, tainted. The 2017 Rohingya eviction was an NLD decision to let China complete its economic corridor across Rakhine and Kyaukphyu port in the Bay of Bengal. Such evictions go back to 1785 for ethnic discrimination, not geopolitics.\nResolving a national crisis, such as Hlaing eviction and Rohingya repatriation without fixing local fissures, weakens any Rohingya solution. Without exogenous platforms and management, this may be impossible given the depth of local distrust. If Myanmar's democracy is to work, attention must shift from one Nobel Prize winner, Aung San Suu Kyi, the 2017 eviction perpetrator, to another, Yunus, whose \"democracy\" bonds extend to Malaysian Prime Minister Anwar Ibrahim. The Malaysian politician visited Prof Yunus on October 4, 2024, and will host/chair the 46th ASEAN annual summit on May 26-27. That summit's theme of \"Inclusivity and Sustainability\" cannot but prioritise the Rohingya issue.\nProf Yunus's democratic ideologies pushed Gen Hlaing to announce Myanmar's election this year. This is an ASEAN membership requirement. When Prof Yunus attended the BIMSTEC Summit in Bangkok in April, he articulated his \"Three Zeroes\" agenda and called on the member-states to promote dialogue between conflicting parties in Myanmar to resolve the Rohingya issue. In a landmark move, Myanmar's Deputy Prime Minister and Foreign Minister U Than Shwe announced an agreement to take back 180,000 Rohingya at the summit—against the 800,000 names Bangladesh proposed even as camp denizens have crossed 13 lakh—as part of repatriating one quarter of a million from Cox's Bazar. So clearly, exogenous platforms help.\nDemocracy is not a new ASEAN issue since the 2008 ASEAN Charter's preamble emphasised \"democracy, law, and good governance.\" Article 1 targets \"strengthening democracy,\" and Article 2 \"democracy principles.\" Even right after Gen Hlaing's February 2021 coup, ASEAN prepared a five-point consensus to end violence, begin dialogue, not only appoint a special ASEAN envoy to Myanmar but also visit Myanmar, and provide humanitarian assistance. Myanmar's civil war made it irrelevant.\nEver since 2021, ASEAN summits have treated the Rohingya issue. Cambodia's Prime Minister Hun Sen emotionally posted the Rohingya issue when he hosted/chaired the 2022 summit, but his meeting with only Hlaing offended NUG leaders. Indonesia's President Joko Widodo organised many meetings and supplied lots of humanitarian aid, but could not convert sentiments into substance at the 2023 summit. The same thing happened in Laos in January 2024 when the country's foreign minister met Hlaing. Opening that closed Rohingya door becomes more urgent constantly.\nMalaysian Prime Minister Anwar Ibrahim faces similar clouds this year. A harsher global context awaits him: a new US administration's tariff policies have deepened ASEAN trade relations with China, widened Myanmar's own policy options and doors, and with India preoccupied in Kashmir, China faces less Southeast Asian constraints. So, the obvious question arises: why break Myanmar's status quo? After all, Myanmar's top foreign investors (particularly China, India, and Japan) remain better off with the status quo. China influences ethnic NUG partners, because of those groups overlapping China's borders, since the country itself remains a stranger to democracy, to push Myanmar in that direction. In short, Malaysia's ASEAN summit this month would toss between these ill winds and the hopes that the vanguards of democracy that Anwar and Yunus symbolise. Riddled with mines, those remain the only salvaging elements for a Rohingya resolution. Without intra- and inter-boundary dialogues, no resolution seems feasible, including any \"humanitarian corridor,\" and when displacement camps only grow, creating such passages misses a crucial beat.\nYunus mobilised another exogenous platform for a Rohingya solution: the UN. Its outgoing secretary-general, António Guterres, not only visited Dhaka, but also shared iftar with nearly 100,000 Rohingya in the Kutupalong camp in March, giving the neglected Rohingya what they most deserve: inclusiveness internationally, on an equal footing, not out of \"noblesse oblige.\"\nBangladesh's exogenous reputation depends upon its endogenous treatment of its own election. Squaring the Rohingya circle fortifies two other global wishes: reformers, particularly the expressive youths who voted in 75 countries in 2024 (the most ever in any one year), shifting to negotiations via more streetside protests; and historically discriminated/persecuted groups replacing survival instincts with betterment. Peace, after all, is the springboard of reforms, and the postulated target of all conflicts, meaning zero-sum insulated approaches beg for collaborative, inclusive, and external counterparts—a shift too historically unprecedented to instantly change the ballgame.\nDr Imtiaz A Hussain is professor at the Department of Global Studies and Governance (GSG) at Independent University, Bangladesh (IUB).\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Debunking the Rohingya crisis, Bangladesh’s role, and the ASEAN Summit",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/geopolitical-insights/news/debunking-the-rohingya-crisis-bangladeshs-role-and-the-asean-summit-3899776",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-05-2025"
    },
    {
        "full_article": "It is encouraging that a Magura court has concluded the trial proceedings of a rape case in just 24 days after the trial commenced on April 23, 2025. Reportedly, the court sentenced 44-year-old Hitu Sheikh, the prime accused, to death for the rape and murder of his daughter-in-law's eight-year-old sister. However, three other accused were acquitted as the charges against them could not be proven beyond a reasonable doubt. That said, the surprising efficiency with which our judicial system worked in this case may serve as a model for future trials.\nAfter the verdict, the victim's mother was reported to have expressed disappointment over the acquittal of three accused, stating, \"They deserved punishment, as they assisted in the murder and concealed information.\" We hope proper justice will be served if or when the case is appealed, but for the moment, what we should take away from this case is the speed with which the trial was conducted. The same urgency should be applied to the many other rape cases pending in courts across the country. As a Supreme Court lawyer rightly pointed out, inconsistency in the pace of justice leads to disparity and undermines public confidence in the judiciary.\nAccording to the Human Rights Support Society, at least 6,305 women and girls were raped in the past five years. Despite this alarming rate, conviction remains extremely low. Of the 20,914 cases of violence against women and children filed through 14 one-stop crisis centres between 2001 and July 2024, only 1.48 percent ended in convictions. Currently, 101 Women and Children Repression Prevention Tribunals are handling such cases, with each burdened by an average of 1,500 pending cases. To address this backlog, more tribunals must be established. Additionally, we must protect victims and witnesses as they are sometimes pressured into withdrawing cases or settling out of court. The longstanding problems of faulty investigations and inadequate forensic facilities should also be addressed through institutional reform.\nIn our country, rape trials often drag on for years—even in lower courts. The swift verdict in the Magura case shows that timely justice is indeed possible. While we strongly support expediting investigations and trials, it is equally important that the process be thorough and fair. We urge the government to do everything in its power to ensure both speed and quality in justice delivery.\n",
        "headline_1": "Magura rape verdict shows swift justice is indeed possible ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/magura-rape-verdict-shows-swift-justice-indeed-possible-3898186",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 22, 2025 00:00:00  \nWhile speaking at a discussion meeting titled \"Bangladesh Economy 2025-26: Policy Reform and National Budget\", a number of leading economists of the country have recognised slight improvement in inflation and stability in the foreign exchange market but felt disappointed at the interim government's failure to effect any structural construct and improved governance in the economic sector. The economic reforms and strategies recommended in the white paper and the task force report respectively have been ignored, they complain. Essentially, the economists including Dr Debapriya Bhattacharya, head of the 12-member committee responsible for preparing the white paper on Bangladesh's economy, and other members of the committee have raised the issue of leadership in the financial sector at a time when Bangladesh finds itself at a crossroads. A highly challenging time demanded a bold and innovative recipe for initiating the process of economic transformation if not an outright turnaround by this time. \nSuch an active, innovative, dynamic and strategic shift is missing. The spirit of the July-August uprising backed such a paradigm shift in economic transformation but this has not happened. Why the interim government could not do justice to the hope reposed in them is their overreliance on the bungling bureaucracy. Dr Debapriya has cited a specific example on this. According to him, of the nexus of looters of national wealth, corrupt 'politicians have fled, business groups have become subdued and the bureaucrats have now reinvigorated'. It is quite natural that the bureaucrats have become accustomed to seeing not much merit in any radical shift in economic policy formulation and implementation. The kind of structural transformation needed to reduce or eliminate anti-equity bias is unlikely to be favoured by the bureaucracy known for maintaining status quo because their interests, sometimes unholy, are best served in the process. They consider a pro-people stance a threat to their lofty and secure position. \nIt is exactly at this point, a more dynamic leadership was in demand for lifting economy from the morass largely a creation of the previous government of Sheikh Hasina. The economists feel aggrieved because to them economic reform should have received the highest priority but, they allege, it has not. If economy wobbles providing no comfort for the nation, other reforms which allegedly are getting higher priority will not be sustainable, they warn. Economic reform directed towards narrowing the yawning gap in wealth distribution and income can certainly address social inequality and disparities. \nHowever, it is a daunting task for any government, let alone an interim one. This world has witnessed the crumbling of socialist economy in former Soviet Union, other East European countries and China to the cheer of market economy that encourages private entrepreneurship and business conglomeration. Perhaps a middle way allowing both big private manufacturing units and businesses to flourish and small and medium enterprises (SMEs) at the grassroots level to take roots with government backing may be an appropriate answer to the economic dilemma. The unemployed figure of 3.02 million recorded in the last quarter of 2024 may reinforce the compulsion for a happy combination of productive sectors in order to create employment. But this has to be complemented by streamlining education, particularly technological and technical types, along with improvement of law and order situation in the country.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Importance of economic governance",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/importance-of-economic-governance-1747839285",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       May 22, 2025 00:00:00  \nThe education and health sectors have historically been neglected in government budget allocations, resulting in excessive commercialisation and high out-of-pocket expenses for citizens. Many had high hopes that the interim government would break this trend by prioritising these two critical sectors through increased funding and meaningful reforms. Unfortunately, that hope now appears to be fading as allocations for both education and health are set to decrease in the upcoming fiscal year. Compared to the current fiscal year's Annual Development Programme (ADP), funding for education will be reduced by approximately 30 billion taka, while the health sector will see a cut of around 25 billion taka.\nThe funding cut for the health sector comes at a time when the Health Sector Reform Commission is advocating for an increase in health spending to 15 per cent of the national budget and 5 per cent of GDP. This recommendation reflects the magnitude of systemic investment needed to revitalise the country's ailing health sector. \nYet, it is perplexing that the government is moving in the opposite direction. . Although the reform proposals have yet to be formally approved, the government could have at least signaled that, starting this year, health and education would be treated as priority sectors. If the current government ignores the reform commissions' recommendations, chances are high that all the well-meaning proposals, no matter how promising, will be shelved and forgotten under future political administrations.\nThe Health Sector Reform Commission, headed by National Professor Dr. AK Azad Khan submitted a fairly comprehensive report to Chief Advisor Dr Muhammad Yunus just two weeks back. The commission has put forward a bold and ambitious set of measures aimed at transforming the country's healthcare system into a more inclusive, accessible, and pro-people framework. At the heart of the Commission's recommendations is a call to recognise primary healthcare as a legally enforceable fundamental constitutional right, to be provided free of cost. It is unfortunate that, even after 54 years of independence, the state has failed to ensure basic rights such as healthcare for all citizens. \nAlthough Article 15 of the Constitution enshrines food, clothing, shelter, education, and medical care as fundamental rights, there is no legal mandate to enforce it, rendering the basic rights largely ornamental. Recognising primary healthcare as a legal right, therefore, would mark a significant step forward, especially at a time when social disparities have been increasingly undermining equal access to these basic services. However, legal recognition alone is not enough. Such a shift demands concurrent investments in healthcare infrastructure, staffing, training, and logistics to become meaningful in practice.\nTo support this transformation, the Commission recommends making union-level health and family planning centres into fully functional primary healthcare centres, attended by at least two MBBS doctors and other necessary staff. In urban areas, equivalent facilities are to be established at the ward level. Once implemented, the people will receive free primary treatment at these facilities at ward or union levels. Facilities at this tier will function as referral points in the proposed system. According to the Commission's plan, a structured referral mechanism would direct patients with more chronic or acute conditions to Upazila or district-level hospitals. \nThe commission also proposes providing initial essential medicines ree of cost, then at subsidised prices from pharmacies at public healthcare facilities to be established under a National Pharmacy Network. Equally important is the proposed exemption of VAT on medicines for life-threatening and chronic conditions such as cancer, diabetes, hypertension, and essential antibiotics, which would significantly benefit low-income populations.\n However, without sufficient budgetary support, even the most well-intentioned policies will remain nothing more than words on paper. Over the past decade, health sector budgetary allocations have remained stagnant at around five per cent of the national budget. Compounding the issue, the Ministry of Health has consistently failed to fully utilise its allocated funds. This lack of budget implementation capacity has often been cited as a reason for slashing allocation for health. Without enhancing the government's ability to plan, execute, and monitor spending effectively, increased allocations alone will not yield improved health outcomes. Deep-seated issues like corruption, administrative inefficiency and political interference must also be addressed for any reform measure to succeed. At the same time, good governance and oversight are essential to ensure that increased spending translates into improved outcomes for citizens. \nMeanwhile, concerns about the feasibility of the Commission's proposals were raised during a recent webinar hosted by the South Asian Network on Economic Modeling (SANEM), titled \"Health Reform Commission Report: Quick Fixes or Transformation?\" Leading health economists pointed out that the report lacks a phased, time-bound roadmap. It offers limited guidance for policymakers on sequencing reforms, estimating costs, or identifying financing strategies. While the recommendation to increase health spending to 5 per cent of GDP is laudable, it would remain ambitious without a clear mechanism to fund such an expansion. They said the report does not address crucial options such as national health insurance, public-private partnerships (PPPs), or diaspora contributions-recourses that could help close the funding gap without unduly burdening taxpayers.\nBangladesh's healthcare sector stands at a pivotal crossroads. The country has made notable progress in several development indicators, yet the health sector continues to lag-not due to a lack of potential, but because of a lack of sustained priority. This trend must be reversed. A healthy population is not only a matter of social justice but also a cornerstone of economic productivity and national development. A universal healthcare system cannot be built on a fragile fiscal foundation. The government must take the Health Sector Reform Commission's recommendations seriously and act with urgency and commitment. Health is not a luxury-it is a fundamental necessity that must be enshrined and upheld in the national development agenda.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Health budget cut runs counter to reform ambition",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/health-budget-cut-runs-counter-to-reform-ambition-1747839378",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Seyed Mosayeb Alam   |  \n       May 22, 2025 00:00:00  \n\nThe numbers are ugly. Bangladesh's non-performing loans (NPLs) have exploded to over Tk 3.45 trillion by the end of 2024. When you include restructured and written-off loans, the bad asset mountain rises to a staggering Tk 4.75 trillion-about a third of all outstanding loans. That's not just bad. It's catastrophic. The banks are choked. The economy is stalled. And trust? It's on life support.\nSo here comes the cavalry: a government-backed Special Purpose Vehicle (SPV)-a \"bad bank\" of sorts. Think of it like a janitor for the banking system, sweeping up toxic corporate loans so the banks can breathe again. But this isn't just about cleaning up a mess. It's about rewriting the rules of the game, once and for all.\nLet's break down why this bad bank could be the game-changer we need-and what needs to go right.\nA Smart, Surgical Strike on Big Loans. This isn't a blanket bailout. The bad bank will target large corporate loans, the ones dragging multiple banks down with them. We're talking exposures above Tk 100 crore-loans that were \"evergreened\" or rescheduled so many times they've become zombie assets. These are the big fish that jam the gears of the banking machine. By taking them off the books, banks can finally start lending again. SMEs and manufacturers, long deprived of credit, might finally get a break.\nBuilt for Recovery, Not Rescue. The bad bank isn't just a dumping ground. It's designed to recover value. Loans will be bought at steep discounts, not face value. Banks will get a small cash payment upfront-say 15per cent -and the rest as security receipts. They only cash out if the bad bank recovers the loan. That means everyone has skin in the game. No free lunch. No moral hazard. Just focused, performance-driven resolution.\nGovernance With Teeth (If We Dare to Bite). The biggest risk? Politics. Elite borrowers, connected insiders, and rent-seekers have feasted on our banks for decades. If the bad bank becomes just another toy in their arsenal, we're done. That's why its board must be independent, its mandate legally protected, and its operations transparent. Borrowers who defaulted deliberately should be barred from buying back their assets at discounts. That trick worked in India under the amended Insolvency and Bankruptcy Code-and it should work here too.\nReal Economic Uplift, Not Just Optics. The bad bank isn't just a fiscal maneuver. It's an economic stimulus in disguise. By freeing up bank capital, credit-to-GDP could rise from 45per cent to 50 per cent, according to simulations. That's no small feat. A one-point rise in credit-to-GDP can lift investment by 0.7 per cent. That means factories restarting, SME financing doubling, and sectors like construction and manufacturing bouncing back. For an economy desperate to grow, this is rocket fuel.\nOf course, the road ahead is littered with landmines. Let's not kid ourselves. If the bad bank overpays for junk loans, we're handing a quiet bailout to the same banks that let this happen. If politicians interfere in recoveries, the whole thing collapses. And if defaulters are allowed to return through the backdoor, we might as well close shop and call it a day.\nBut here's the twist: we don't need to invent anything new. We just need to take inspiration from what's worked. Malaysia's Danaharta. Ireland's NAMA. India's NARCL. All of them used structure, pricing discipline, and legal power to recover billions. Bangladesh can do the same-if we have the political will.\nLet's not forget: this bad bank isn't forever. It should have a sunset clause. A clear timeline. A mission that ends. That keeps it lean, focused, and honest. No bloated bureaucracy. No second coming of Biman-style state inefficiency.\nAnd when the cleanup is done? Then comes Act II. We must fix the root causes: better governance, tighter regulation, stronger loan classification rules, and early warning systems. Otherwise, this whole effort will just buy time for the next disaster.\nSo, is this our last shot?\nPossibly.\nIf done right, this bad bank could mark the start of a financial renaissance. If done wrong, it'll be just another headline in the long obituary of Bangladesh's banking sector.\nLet's choose wisely.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "A clean slate for BD's banks?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/a-clean-slate-for-bds-banks-1747839446",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 22, 2025 00:00:00  \n\n\"The pressure is too much for me to handle. I can't take it anymore.\" These were the final words in Dhrubajit's diary, a student who recently took his own life, blaming the country's education system for his unbearable mental distress. His tragic death serves as a stark reminder of the immense pressure placed on students and the urgent need for systemic reforms to prioritize mental health and well-being over academic performance.\nThey say education illuminates one's path, guiding individuals toward righteousness and wisdom. However, our education system often seems like an oppressive burden, stifling students' spirits and, tragically, driving some to take their own lives. Last year, at least 310 students died by suicide. According to a survey, 49 per cent of them were school students - a deeply disturbing statistics.\nEducation plays a crucial role in a student's life and is often seen as the ultimate measure of success. In our society, the prevailing belief is that academic excellence guarantees a brighter future. As a result, high expectations from loved ones and society create an invisible fear in students. Regardless of their academic performance, they prioritize education above all else. Yet, instead of focusing on true understanding, many overthink and grow increasingly anxious about their future.\nAlthough the purpose of education is simple, we tend to complicate it. From average students to top performers, all experience anxiety about their studies. This mental pressure often prevents them from exploring interests beyond the syllabus, ultimately stifling their creativity.\nThis dark side of our education system must be addressed. We cannot allow our lives to become completely dependent on academic achievement. It is essential to normalise and broaden our perspective on education - otherwise, many more young lives may be at risk.\nTasfia Tahreen \nStudent \nIdeal school and college \nJatrabari, Dhaka\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Dark side of our education system",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/dark-side-of-our-education-system-1747839469",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-05-2025"
    }
]