[
    {
        "full_article": "After nearly three-and-a-half years and 13 rounds of meetings, member-states of the World Health Organization (WHO) have agreed on measures to prevent, prepare for and respond to pandemics. On April 16, the Intergovernmental Negotiating Body finalised a proposal for the WHO Pandemic Agreement. The draft, described as a “generational accord to make the world safer”, is now ready to be adopted next month by the World Health Assembly. Though more limited in scope than the ambitious one first proposed by WHO, it is still a remarkable achievement considering the varied priorities and compulsions for the Global North and the developing countries, especially with the U.S. not a part of WHO since January. While the developed countries baulked on firm commitments to sharing diagnostics, treatments, vaccines and technology transfers, developing countries hesitated to commit to sharing pathogen samples and genome sequences without assured access to tests, treatments and vaccines developed using the shared material. The disagreements are reminiscent of how Indonesia turned the spotlight on the inequitable H5N1 sample sharing mechanism in the mid-2000s in the absence of equitable and affordable access to vaccines developed using its samples.The first article that all countries agreed upon was the commitment to protect health-care workers better. The most remarkable achievement was in getting every country to agree on the pathogen access and benefit sharing system. Developing countries that share pathogen samples and genome sequence data are guaranteed to get access to any diagnostics, vaccines or treatments that are developed using the samples/data. Negotiations on how countries will share samples and vaccines/drugs are set to continue. Pharmaceutical companies have committed to donate 10% of their production to WHO and offer up to another 10% at affordable prices. The COVID-19 pandemic brought the inequitable vaccine distribution to the fore. Many developed countries stockpiled vaccines while many developing countries, especially those in Africa, were left waiting for vaccines. The case of vaccine manufacturers sharing the technology with developing countries during a pandemic has also been sorted out. The main debate centered around the conditions under which this transfer will happen. Countries have agreed that technology transfer will be on “mutually agreed terms”, and not “voluntary” as pharma companies wanted it to be. According to the journal, Nature, besides “promoting equitable access to health products, the treaty underlines that countries should ‘promote and otherwise facilitate or incentivise’ the exchange of technology and know-how” that will enable developing countries to make their own vaccines.\r Published - April 22, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        disease\n                    \n                            /                      \n                        \n                        disease prevention\n                    \n                            /                      \n                        \n                        health treatment\n                    \n                            /                      \n                        \n                        vaccines\n                    \n                            /                      \n                        \n                        Indonesia\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        journals and diaries",
        "headline_1": "​Landmark agreement: On the draft WHO Pandemic Agreement",
        "headline_2": "The accord on pathogen access and benefit sharing is path-breaking",
        "link": "https://www.thehindu.com/opinion/editorial/landmark-agreement-on-the-draft-who-pandemic-agreement/article69474783.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-04-2025"
    },
    {
        "full_article": "The Trump administration’s frustration over the lack of progress in diplomatic efforts to end the Ukraine war was evident in Secretary of State Marco Rubio’s remarks in Paris last week. After talks with America’s European allies, he warned that the U.S. would “move away” if there was no progress “within days”. U.S. President Donald Trump appeared to endorse the comments. Despite Mr. Trump’s campaign promise to end the war “within 24 hours”, months into his presidency, he remains far from building a consensus on even a temporary ceasefire. If he expected the Russians to jump on a proposal for a ceasefire in return for some Ukrainian concessions, he has miscalculated. The U.S. has already ruled out NATO membership for Ukraine and declared it would not be part of any post-war security guarantees for Kyiv prior to direct negotiations with Russia. It also arm-twisted Ukraine into proposing a 30-day ceasefire. However, while Mr. Trump appears focused on an immediate cessation of hostilities, the Kremlin has insisted that any ceasefire deal must be part of a comprehensive peace agreement that addresses its core security concerns. The U.S. is reportedly circulating a new proposal to end the fighting — shared with European and Ukrainian officials, it has the U.S. prepared to recognise Crimea, which Russia annexed in 2014 following a contentious referendum, as Russian territory. The plan also takes NATO membership “off the table” for Ukraine and seeks to freeze the conflict along the front line, effectively leaving the territories Russia captured since the war began in 2022 in its hands. After responses from Ukraine and Europe, the U.S. plans to approach Moscow. But Russia has stuck to its maximalist positions, which include rejecting security guarantees for Ukraine and insisting on its demilitarisation.Wars rarely end through maximalist positions. While Russia has made territorial gains, it has also paid a price. Ukraine, despite its apparent weakness on the battlefield, signals that it is ready to continue the fight, with western support. Europe has also made it clear that it will continue backing Ukraine — with or without American involvement. For any lasting peace in Ukraine, it is important to address Russia’s legitimate security concerns. However, the Russian demands that Ukraine limit its defence partnership with its allies or accept restrictions on its military capabilities are untenable for any sovereign nation. So, Mr. Trump should continue to strive for common ground between all the parties — the U.S., Ukraine, Europe and Russia — for a durable peace, instead of appeasing just one power. Published - April 22, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        France\n                    \n                            /                      \n                        \n                        NATO\n                    \n                            /                      \n                        \n                        European Union\n                    \n                            /                      \n                        \n                        peace negotiations",
        "headline_1": "Elusive truce: On the U.S. and the Russia-Ukraine war",
        "headline_2": "Russia must give up its maximalist position and end the war",
        "link": "https://www.thehindu.com/opinion/editorial/elusive-truce-on-the-us-and-the-russia-ukraine-war/article69474810.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-04-2025"
    },
    {
        "full_article": "Excessive pvt school fees are thanks to poor regulation in a market defined by high demand, low quality\nIn Delhi, parents have hit the streets to protest excessive school fees. Private schools charging exorbitant sums under numerous heads are now a routine nightmare for families. Some media reports say school fees have gone up 50-80% over three years. Even at half that rate of increase, it’s shockingly high. Almost half of all schools in Delhi are private. Nationwide, that number’s almost one-third. Crumbling govt education infra will obviously push more and more parents to register their children in private schools – plus the pull of English-medium education is stronger than ever, understandably so. Enrolment in private schools has grown exponentially – from about 20% in 2010 to 46% in 2023.\nBut while demand is huge, just a handful of schools deliver quality education – and these cater to wealth & social networks. In a majority of private schools, expensive doesn’t guarantee excellence. This majority has poor learning delivery, prioritises profit, and is known more for high costs and lack of accountability. Given low-grade teaching, the relationship between students, their parents and such private schools becomes bruisingly transactional. Aspiring middle-classes are stuck paying extortionate fees for subpar learning. Neighbourhood schools compete not on scholarship or pedagogy, but on ‘facilities’ available. And for each ‘facility’, there’s a rate. Taken together, private schools are running a kind of monopoly, making high profits by selling a low-quality service. Parents and students are hapless consumers without any bargaining power.\nEducation departments are squarely to blame for the regulatory void. Derecognition for malpractice is well within every education department’s writ. Of course, politicians and businesses are intricately involved. Even a judge-led committee’s report on excessive fees, which identified 449 private schools in Delhi that overcharged parents, failed to reach its logical conclusion. The fatal flaw may even be the policy itself. Why is it in India, policy demands private schools can only be run by nonprofits? It makes every education entrepreneur create a meaningless trust or society. The dodgy practice starts there – high fees follow. Allow schools to legally make profit, and regulate their fees.\n\n",
        "headline_1": "Class oppression",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/class-oppression/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-04-2025"
    },
    {
        "full_article": "Vance is no ordinary veep because he gets the spotlight, a testament to his political cleverness\nIn his 2016 memoir Hillbilly Elegy, JD Vance writes about the time he didn’t know “you needed to wear a suit to a job interview”. Nine years later, having worked as venture capitalist and senator, he has no sympathy for the suitless, as Zelenskyy found out. Vance has changed in other ways too. From “Never Trumper” who declared, “I think this election (2016) is really having a negative effect, especially on the white working class,” to staunchly pro-Trump. He won’t be caught describing Trump as “idiot” and “reprehensible” now. Where he was considered pragmatic and thoughtful as a senator, he seems comfortable playing Trump’s “wingman” and “attack-dog”. Note how he berated EU at the Munich Security Conference in Feb, shouted at Zelenskyy in the White House, and flew uninvited to Greenland, to press Trump’s territorial claim on the island.\nWhat’s unusual about Vance, besides the pugnacity – his old remark about US being run by “a bunch of childless cat ladies” won’t be forgotten anytime soon – is that he gets so much spotlight. By the third month of Biden’s presidency, Kamala Harris had slipped into obscurity. Under Trump 1.0, Mike Pence kept a low profile. Biden, under Obama, was largely invisible. So, why isn’t Trump’s second veep a backroom boy? When Trump was asked early in Feb if he saw Vance as his successor, he said, “No…but he’s very capable.” That may be read as endorsement from a president who is still hopeful of a third term, never mind the difficulty of amending the US constitution. But even if it isn’t, it won’t stop Vance, who is simply too ambitious, and astute. He read Trump’s first win correctly before the pundits, patched up when Trump was down and out, and has stood resolutely by him since. Don’t forget Vance is just four years old as a politician, and he will pivot again if it suits him.\nBut the way things are going, he won’t need to. So far, Trump has given him free rein. Now, Vance is in India on a “personal” trip coinciding with high-level trade talks. He’s likely to push for a quick deal, which US needs as much as India, since China shows no sign of blinking first. Besides, a deal will be a feather in the hillbilly’s hat.\n\n",
        "headline_1": "Hillbilly Ji",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/hillbilly-ji/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-04-2025"
    },
    {
        "full_article": "When enemies outnumber friends, an even temper helps\nTo the unfamiliar, Kazo’s walks are a routine affair, without novelty or danger. Little do they know about the perils he deals with. Being a good-looking golden retriever has some advantages. Luna and Coco – female retrievers – always meet him warmly. But the flipside is making enemies, who outnumber friends.\nDanger is afoot even before the walk begins. The other two dogs on the floor – Taro and Jaro, who have never been friendly – come up to the door and challenge Kazo to step out and have a two-on-one. The sensible Kazo avoids direct confrontation and instead responds from the balcony as soon as they are in the parking lot.\nThe troubles are Rusty, the brown Irish setter, and Spike, a German shepherd. Rusty is able to spot Kazo from far. He wants to break free and have a go, but his handler takes him into the block, so that the boundary wall hides one from the other. The diplomatically astute Kazo growls but doesn’t let things come to a boil.\nAs for Spike, his handler takes him across the road when he sees Kazo, which helps because it would be foolhardy to consider Spike an equal. But the danger isn’t over yet.\nThe last stretch – the Mall Road – is where the ill-mannered rottweiler Puffy lives. Puffy once got Kazo on the wrong foot – right in the middle of the road since his owners often let him loose – but Kazo managed to escape unhurt. Every time he nears Puffy’s house, he takes a quick look, and when he isn’t around, goes near the gate and lets out a growl.\nThen there are a few dogs who bark bravely from inside their gates, but Kazo doesn’t even lift his head. On the way he exchanges a respectful glance with a powerful Tibetan mastiff, known to take on even leopards in the mountains. He also passes by a Lhasa apso, hardly a few inches above the ground, who makes a desperate lunge at him, but Kazo steps away tolerantly. He prefers equal sparring partners, even if there’s no sparring to be done. Before returning home, he takes a round of the back lane where he meets cats. He is okay with them, and they don’t leave the path when he comes around. They mew when they see him, and he regards them with cool authority before returning home.\n\n",
        "headline_1": "Kazo’s walks",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/kazos-walks/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-04-2025"
    },
    {
        "full_article": "To cope with Trump’s attacks against them, American universities must change the public perception they are elitist & do a better job of communicating how socially valuable their research is\n\nIt’s a dizzying, devastating time to be one of the 4mn-plus who are employed in higher education in US. The Trump regime is attacking colleges and universities on multiple fronts: pulling the plug on federal grants from agencies like National Institutes of Health (NIH) and National Science Foundation, revoking student visas of hundreds of international students, threatening to withhold even more federal dollars if schools refuse to eliminate DEI programming, and cutting, if not eliminating, Department of Education, from which students borrow money for college, and/or get need-based aid, such as Pell grants.\nRead full story on TOI+\n\n",
        "headline_1": "Battle for US colleges",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/battle-for-us-colleges/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-04-2025"
    },
    {
        "full_article": "We are shocked to learn of the killing of Jahidul Islam Parvez, a third-year student of Primeasia University, who was stabbed to death in broad daylight on Saturday. That a young life could be so brutally cut short over something as trivial as a \"suggestive\" exchange of laughter is both heartbreaking and alarming. According to media reports, Parvez and some friends were having snacks near the university in Banani when a quarrel broke out after some individuals questioned their alleged mocking of two female students. Although the situation seemed to have been resolved with the intervention of university officials, Parvez was fatally stabbed shortly afterwards. Police have since arrested three individuals, while eight were sued in a case filed by the victim's cousin.\nAmong the accused are two leaders of the Banani thana unit of the Students Against Discrimination (SAD) platform, which prompted rival Jatiyatabadi Chhatra Dal (JCD) leaders—who claimed Parvez as one of their own—to accuse SAD of orchestrating the attack. The SAD, for its part, denied the allegation, accusing Chhatra Dal of exploiting the tragedy for political purposes. This war of words has been distracting, but it does add to the conversation surrounding political violence in the country. Just last month, at least 23 people were killed and 733 injured in over 97 incidents of political violence, according to the Human Rights Support Society. These figures are a sobering reminder of the uphill battle law enforcement faces in containing crimes in post-uprising Bangladesh.\n\nWhat worries us most is the continued vulnerability of general students, even though the political lines on university campuses have been redrawn following the July uprising that ended the long dominance of Awami League's now-banned student wing. The fact that the three individuals arrested by police are only 19 years old also indicates young people's growing inclination towards violence. The activities of teen gangs, in particular, have been a source of concern in recent years, with many—including students—being lured by the promise of quick power and easy money. This is an alarming trend that demands urgent intervention.\nWhat worries us most is the continued vulnerability of general students, even though the political lines on university campuses have been redrawn following the July uprising that ended the long dominance of Awami League's now-banned student wing. The fact that the three individuals arrested by police are only 19 years old also indicates young people's growing inclination towards violence. The activities of teen gangs, in particular, have been a source of concern in recent years, with many—including students—being lured by the promise of quick power and easy money. This is an alarming trend that demands urgent intervention.\nAt this stage, we don't know the exact identity or motive of Parvez's killers. But it is paramount that those responsible be brought to justice through a fair and transparent trial, both for the sake of his grieving family and the safety of general students. A university should be a place of learning and growth, not a battleground for gang activities, petty quarrels, or political vendettas. Government authorities, university administrations, political parties, and society at large have a collective responsibility to ensure that our students can study and grow without fearing for their lives.\n",
        "headline_1": "A tragic reminder of student vulnerabilities",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/tragic-reminder-student-vulnerabilities-3876746",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-04-2025"
    },
    {
        "full_article": "Let us indulge in a thought experiment and jump forward 50 years. In the year 2075, a student in a Bangladeshi school is preparing for a subject she has been neglecting the whole year. At the very last moment, she sits down to study and sees the topic is \"Dictatorship and Sheikh Hasina: 2009-2024\". She quickly pulls out her personal AI assistant and types in: \"Who was Sheikh Hasina and what did she do between 2009-2024?\"\nBut here, we depart from the future and come back to the present. Because unlike this indolent student, we already know what Hasina did. If we compress the answer into a single sentence for the benefit of this student, it would be something like: \"Hasina made free and fair elections impossible in Bangladesh and used the resultant lack of accountability to kill and torture thousands, oppress millions, launder billions of dollars, and destroy the financial system.\" On a tangent, it is one of the lasting Foucauldian legacies of Hasina that we had to get into the habit of saying \"free and fair\" before elections—something that is generally assumed as a given in much of the world.\nLike all self-evident truths, this axiom bears repeating. Hasina was only able to create a system of accomplices, killers, torturers, and looters because she removed the fear of accountability that haunts every democratic government. The fear of being accountable to the people, of having to look them in the eyes and account for all their wrongdoings, of being on the receiving end of the same measures that were being imparted: Hasina promised a magical reprieve from all of these, and enough people believed her, for a while. In the vacuum of democracy created by a lack of elections, the worst impulses and behaviour flourished.\nIt was therefore something of a shock to read that Nahid Islam, the lionheart of the July uprising and convenor of the National Citizen Party (NCP), had said that elections may not be possible this year due to the law-and-order situation and its lack of improvement. Somewhere in a posh Delhi villa, Hasina must be chuckling to herself. Instead of creating all the elaborate stratagems and theatrics to hold rigged elections while trying to maintain the façade of democracy, she could have just delayed elections indefinitely by blaming it on the law-and-order situation. If anything, she is probably thinking, she did not plan big enough. Hasina mired the country in crossfires and enforced disappearances; she could have also then blamed the same to delay the elections. No need to get dummy candidates or engage in nocturnal voting, just keep delaying the elections.\nSarjis Alam, another NCP leader, said something similar previously when he stated that no one should speak of elections until Hasina was punished for her crimes. Hasina kept us in an autocratic purgatory during her regime. Why should we give her the satisfaction of remaining in the same limbo even after she has fled? It is worth repeating, over and over, if necessary, that one cannot claim to be anti-Hasina while displaying the same defining characteristics as our former prime minister. All those who fought together to oust Hasina have a collective obligation to do and be better than what Hasina managed, if they are to stay true to the spirit of last year's uprising.\nWe waded through a tsunami of blood and tears last July to rid ourselves of a government that would not hold elections for fear of the results. We want to believe the current interim government is better and knows better. Starting from the chief adviser down to other responsible stakeholders of the state, many individuals have spoken about December being the likely date of the next parliamentary election. It should be the priority of every Bangladeshi who believes in democracy to assist in the hastening of the festival of election, where the people of Bangladesh will once again reassert their constitutional sovereignty over their country, and Bangladesh will again proudly take its place amongst the democracies of the world.\nIt is also incumbent upon us to flatly reject the false binary that posits we can have either reforms or elections. Bangladesh can and must have both. As is the broad consensus, all pro-July parties will hopefully agree on a common set of reforms, perhaps to be partially implemented before and partially after the elections. An elected parliament, on the other hand, can tackle reforms with far more alacrity and enthusiasm than the current government, whose dependence on consensus, amidst stakeholders with widely divergent priorities, has too often left it mired in inaction and indecisiveness.\nThe medicine for bad politics is better politics. The perfect rejoinder to the last 15 years of autocracy is to return to the practice of democracy, with a durable system that can hold free and fair elections after every parliamentary term, and where the transition of power can happen with handshakes and democratic continuity. That is a dream worth pursuing. That is a Bangladesh we could proudly pass on to our future generations.\nEhteshamul Haque is an attorney barred in Virginia, who previously worked at the US Department of Justice, HP, and Verizon.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Reforms vs elections? A false choice for an aspiring democracy",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/reforms-vs-elections-false-choice-aspiring-democracy-3876631",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-04-2025"
    },
    {
        "full_article": "We are concerned about the growing trend of rivers drying up in Bangladesh. The plight of the Shibsa River, as highlighted by a recent report, is yet another example of how careless our treatment of rivers has been. Once a vital communication route linking Khulna to Kolkata, the Shibsa used to bustle with boats, launches, steamers, and so on. Today, however, it has declined drastically, reduced to a narrow stream in many parts. This dried-up condition spans roughly 27 kilometres of the river as it flows through the Paikgachha upazila. From there, it continues eastward through Soladana and Garuikhali unions before entering the Sundarbans and merging with the Pasur River. Although its 64-kilometre portion inside the Sundarbans still carries tidal water, heavy siltation is rapidly reducing its depth.\nThis situation cannot be attributed to any one reason alone; rather, it is the result of decades of unplanned, often illegal interventions such as the construction of polders and embankments as well as encroachment on riverbanks. For instance, around a hundred ponds and various structures have been set up along the Shibsa's banks, leading to persistent waterlogging in surrounding areas. Over the years, many rivers have been similarly choked by encroachment, pollution, and short-sighted government projects cutting floodplains off from them, increasing siltation, and eventually making rivers shallower.\nFollowing the fall of the Awami League government, there have been noticeable efforts against illegal settlements along riverbanks, but those have proved to be insufficient in addressing the decline of our rivers. The fact is, without comprehensive measures addressing all the interlinked issues, our rivers cannot be saved. One major concern in this regard is the persistent inactivity of the National River Conservation Commission (NRCC), the so-called guardian of rivers. The delay in reactivating this commission—currently run by an additional secretary who merely holds its chairman's responsibilities on an additional basis—has compromised its ability to steer river conservation efforts.\nThese issues need to be resolved. Saving rivers like the Shibsa requires a holistic strategy based on sound river management principles. This includes reactivating and strengthening oversight institutions like the NRCC, implementing the Tidal River Management (TRM) system to restore natural tidal flows, preventing illegal occupation of riverbanks by local administrations, and conducting regular dredging. At the same time, there must be greater public awareness of their pivotal role in river conservation. We must also hold relevant authorities accountable for negligence and wrong policies.\n",
        "headline_1": "Save Shibsa River from further decline",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/save-shibsa-river-further-decline-3876501",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-04-2025"
    },
    {
        "full_article": "It is quite perplexing that the prime public health facility in Bangladesh's port city does not have a functional magnetic resonance imaging (MRI) machine. According to a report by this daily, Chittagong Medical College Hospital's (CMCH) only MRI machine has been out of service for three years now, forcing patients to go to private facilities for the test. Thus, instead of paying Tk 3,000-5,000 for MRI scans at the CMCH, they are spending Tk 9,000-20,000 for the diagnosis at private facilities.\nThis is not the first time that inadequacy and unavailability of essential equipment have been reported at public hospitals. Often, the reason behind the unavailability is not a shortage of funds. Rather, the hospital authorities' mismanagement, inertia, and perhaps even a lack of compassion for general patients leave medical equipment without maintenance and timely repair. Some machines even remain unused for years because of a lack of trained operators. In the case of the MRI machine at the CMCH, the hospital authorities' refusal to pay the supplier Tk 1 crore for a comprehensive maintenance contract after the expiry of the warranty period in 2020 resulted in patients paying higher prices for MRI scans elsewhere.\nApparently, the CMCH authorities wanted to save Tk 35 lakh by offering the supplier Tk 65 lakh. What happened instead was that patients bore the burden of their failure to negotiate a deal. If a minimum of 12 patients at the CMCH require MRI scans daily, then a minimum of Tk 12.5 crore has been spent by general patients, out of pocket, over the three years just to get MRI scans. This raises the question: what public money did the CMCH save by not accepting the supplier's terms? While easier terms and even change of suppliers are indeed options that can be explored, did the authorities carry out a patient-centric cost-benefit analysis at any stage? Ironically, Tk 3.5 crore has now been allocated to repair the machine, with specialists from the supplier company as well as engineers from the National Electro-Medical Equipment Maintenance Workshop and Training Centre working for the last two months to repair the broken machine.\nThe saga of CMCH's MRI machine shows how our healthcare system continues to fail patients as decisions are not made with their best interests in mind. We urge the government to focus more on health sector reforms, initiating a comprehensive overhaul so that public healthcare becomes more accessible, efficient, and patient-friendly.\n",
        "headline_1": "Make public hospitals more patient-centric",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/make-public-hospitals-more-patient-centric-3874881",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 22, 2025 00:00:00  \nThe recommendations made by the Reform Commission on Women's Affairs in its report submitted to the chief adviser on Saturday bear special significance at a time when the country has been witnessing a fresh spate of gender violence including sexual abuse and aggression. As many as 433 reform proposals covering 15 thematic areas have been made. One notable feature of the recommendations is that they have broadly categorised in three groups on the basis of implementability by the incumbent interim government and the next elected government respectively; and others left for the future. Thus the outstanding proposal concerns the adoption of a uniform family code to ensure equal rights in marriage, divorce, inheritance and maintenance irrespective of religions. This, according to the 10-member commission, can be implemented by the interim government. The establishment of a permanent women's commission with the assignment of monitoring violations of women's rights and protecting the vulnerable certainly deserves immediate consideration. \nHowever, the electoral reform the Women's Affairs Reform Commission has suggested to bring about gender parity in people's representation may be debatable. It suggests raising the number of parliamentary seats to 600 with each constituency boasting one general seat and another seat reserved for women. But both will be elected through popular votes. If there is a provision for an upper house, 50 per cent of the nominees will be selected by 'political parties in a proportional manner using the zipper method whereby an equal number of male and female candidates are alternated on party lists'. Here the emphasis evidently is on equal representation in parliament no matter if the legislature is unicameral or bicameral. Critics may find that such an initiative smacks of something more than quota provision. Also, the two people's representatives from one constituency may give rise to frictions and clash of interests unless their respective jurisdiction is clearly outlined. The likely scenario would be total monopoly of power and function by the elected members of parliament (MPs) to the sidelining of those elected to the reserved seats. \nEven if these women parliamentarians are not dubbed '300 sets of necklace' like the earlier '30 sets of necklace', the economic implications cannot be ignored. Apart from the Jatiya Sangsad's limited capacity for such a large assembly, the residential accommodation for such a bevy of VIPs, transports, electric and transport bills and other miscellaneous costs are likely to be staggering. Will it be cost-effective? The idea of reservation is not far removed from protectionism and provision for quota. Parliamentary debates and legislation alone cannot change society for the better.\nIn fact, the bottom line ought to be empowering women right from the grassroots level. This calls for sustaining the good work of greater girls' attendance at primary and secondary schools together with their proportionate higher grades and pass rates up to SSC and HSC examinations. It is important to create the right environment for these girls to pursue higher education and take their rightful places in administration and other important professions and areas of life including teaching and research. Mere creation of parliamentary seats for women will fizzle out in meaninglessness. Empowerment of women must be complemented by creating facilities for sports, healthy cultural activities and entertainment all across the country to stem the social rot. Such a progressive outlook of life as against the conservative one now gaining ground can foster attitudes towards and relations between genders on the basis of equality and mutual respect.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Empowering women",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/empowering-women-1745245897",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       April 22, 2025 00:00:00  \nOver the past year, there has been a cautious but notable thaw in the once-frozen diplomatic ties between Bangladesh and Pakistan. The change came in the wake of political transition in Bangladesh following the fall of the Awami League government on August 5 last year and installation of an interim government. Keen to pursue a pragmatic foreign policy, the new administration initiated moves to re-engage with Islamabad. This shift marked a significant departure from more than 15 years of virtual diplomatic stagnation between the two nations.\nIn that context, Bangladesh took some important steps -- restoring a direct shipping link and granting permission for a Pakistani airline to operate direct flights to Dhaka. Diplomatic overtures were reinforced when Bangladesh's Chief Adviser met Pakistan's Prime Minister Shahbaz Sharif on the sidelines of the UN General Assembly in September. The leaders agreed to revitalise the bilateral relationship and explore new avenues of cooperation.\nThe latest in this string of initiatives was the 6th round of Foreign Office Consultations (FoC), held in Dhaka last week. It drew considerable attention from diplomatic circles in South Asia, as it signalled a potential new chapter in the Bangladesh-Pakistan relationship. The discussions covered a wide range of issues -- economic, educational, agricultural, and cultural -- tapping into shared history and the aspirations of both peoples. At face value, the talks were cordial and comprehensive, with expressions of satisfaction on both sides regarding recent high-level engagements in global forums such as New York, Cairo, Samoa, and Jeddah.\nYet beneath this seemingly smooth surface lies a stubborn historical fracture -- one that remains unhealed, unresolved, and overlooked: the unresolved legacy of the 1971 Liberation War.\nDespite the optimistic tone, the talks revealed a familiar impasse. Bangladesh reiterated three long-standing demands, all of which remain unmet since its emergence as an independent nation over five decades ago. These are; a formal apology from Pakistan for the genocide committed during the 1971 Liberation War; Bangladesh's rightful share of pre-independence financial assets held in Pakistan's central treasury; and repatriation of stranded Pakistanis still living in refugee camps across Bangladesh.\nSadly, Pakistan remained non-committal on all three counts. Although both sides publicly claimed the meeting was \"fruitful\" and that they would \"remain engaged\" on the outstanding issues, Islamabad's own statement tellingly omitted any mention of the three core demands. This silence has not gone unnoticed in Dhaka, sparking widespread scepticism about Pakistan's sincerity. Can these long-standing wounds simply be glossed over in the name of moving forward?\nThe short answer is no.\nThere can be no genuine reset in relations between Bangladesh and Pakistan without a full and formal acknowledgement of the atrocities committed by the Pakistan Army during the 1971 Liberation War. That war was not merely a political separation -- it was a brutal, bloody genocide. Over three million Bangladeshis were killed. Tens of thousands of women were subjected to rape and systematic sexual violence. Homes, schools, and places of worship were destroyed. Entire villages were burnt to the ground. These crimes are not mere footnotes in history -- they are etched into the collective consciousness of Bangladesh, shaping its national identity and moral memory.\nA meaningful reconciliation cannot be built on denial, silence, or diplomatic evasion. It requires truth, justice, and accountability. The most fundamental starting point for that is an unambiguous, unconditional apology from Pakistan to the people of Bangladesh. Without such a gesture, talk of cooperation in trade, education, and connectivity will remain hollow-lacking the moral foundation necessary for any long-term partnership.\nMany observers in Bangladesh and beyond have pointed to examples around the world where nations have sought to right historical wrongs through apology and reparation. From Germany's post-Holocaust stance to South Africa's Truth and Reconciliation Commission, the international precedent is clear: true healing begins with acknowledgement.\nPakistan has, over the years, expressed \"regret\" or \"sorrow\" in vague diplomatic language -- but that is not enough. Regret is not accountability. Sorrow is not justice. Bangladesh is not seeking vengeance; it is seeking closure. That closure must be delivered with the courage to say, in no uncertain terms: \"We are sorry for the crimes committed in 1971.\"\nIn addition to the apology, the other two demands -- fair distribution of financial assets and the humane resolution of the status of stranded Pakistanis -- are also essential for repairing trust. These are not new or unreasonable demands; they are rooted in international principles of equity and responsibility. It is worth remembering that Bangladesh has, for decades, housed tens of thousands of \"Bihari\" Pakistanis in makeshift camps, offering humanitarian support while awaiting a lasting solution from Islamabad. This burden cannot be borne indefinitely, especially without Pakistan's direct participation in the repatriation process.\nThe economic and academic cooperation discussed during the FoC -- including scholarships, agricultural training, and maritime studies -- are certainly welcome. But they are not a substitute for justice. Similarly, shared concerns on multilateral platforms, such as the condemnation of Israeli aggression in Gaza or the call to revitalise SAARC, reflect some alignment in international views. However, these areas of consensus should not be used to deflect attention from the historic wrongs that still demand redress.\nIn this context, the path forward for Pakistan is clear.\nIf it genuinely wants to restore normalcy and rebuild trust with Bangladesh, it must exhibit the moral courage to confront its past. That includes offering a public, official apology-one that does not hide behind euphemisms or deflect responsibility. This should not be seen as an act of weakness, but rather a bold step toward moral leadership and reconciliation. Only then can the two nations, linked by history and geography, begin to forge a future free from the shadows of 1971.\nFurthermore, Bangladesh must also remain firm in its principles during this diplomatic outreach. Resetting ties should not come at the cost of forgetting history. Economic cooperation, people-to-people contacts, and regional integration are all valuable, but not at the expense of justice. The wounds of 1971 are too deep to be buried under trade deals and cultural exchanges alone.\nThe recent meetings between Bangladesh and Pakistan have opened a diplomatic window, but it is one that must be used wisely. Symbolic gestures must now give way to substantive action. Until Pakistan formally acknowledges and apologises for its war crimes, any effort to \"revamp\" bilateral ties will remain, at best, superficial.\nHealing begins with truth. Reconciliation begins with justice. And in this case, justice begins with a clear, loud, and unequivocal apology from Pakistan. Nothing less will suffice.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Resetting BD-Pak relations: Wishes and realities",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/resetting-bd-pak-relations-wishes-and-realities-1745245974",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       April 22, 2025 00:00:00  \nUS president Donald Trump's tariff war with the rest of the world, many economic and financial experts think, could lead to the collapse of the US dollar as a global medium of exchange. Reports coming from the leading global financial service firm, J.P. Morgan research reports say that there is a 40 per cent probability that the U.S. economy is falling into a recession by the end of 2025. A recession is characterised by a decline in economic activities of a country marked by rising unemployment, decreased consumer spending, falling industrial productions etc. However, falling into recession does not mean the end of an economy, since the US has experienced, according to the Wikipedia, some 48 recessions since the mid-19th century. Whether a country is in a state of recession or not is known from its official recognition by the country concerned. So, until the US government, or the National Bureau of Economic Research (NBER), which defines recession as a 'significant decline in economic activity that is spread across the economy', is coming up with its report that the country is actually experiencing recession, it cannot be said that the US is in a recession. In the case of the Great Recession, it started in effect in December 2007 following the global financial crash. But the NBER did not recognise it as such until next December. Similarly, the Covid-19 recession lasted three months from February to April of 2020, but its recognition through official announcement came in June of that year. So, even though signs of a recession are there, we would have to wait for NBER's report to know if the US is already going through a recession.\nBut while awaiting US's declaration of a recession, the falling value of dollar is sending yet another alarming signal about the US economy's worth vis-à-vis those of its rivals like China. But then, are all other symptoms of USD in a free fall also there? Has the greenback been devalued to such a level that there is a widespread loss of confidence in the US economy? Have other countries stopped using USD as their reserve currency amid geopolitical shifts? If all these developments are there, then surely the dollar should be facing a deep crisis.\nNow, the value of USD is undoubtedly falling in the world currency market. In fact, currencies are rising and falling all the time caused by fear of inflation, decisions of the central banks and various other factors. But what economists are worrying most about is the recent dramatic drop in USD value that reflects something very ominous. Especially, the US president's recent attempt to reshape world trade using tariff has resulted in the loss of confidence in the US. USD being a fiat currency which means its worth is not backed by gold or any other valuables, but by the rest of the world's trust in the US as a stable and dependable economy. Also, the political power of the US government matters. The US dollar's dominance in cross-border trade and as a safe haven has been nurtured by the US administration, whichever of the two parties was in office, over the past decades. All these factors helped keep US borrowing cost down and allowed the country project power abroad. In this connection, the University of California economist Barry Eichengreen, for instance, says: \"Global trust and reliance on the dollar was built up over a half century or more\"…\"But it can be lost in the blink of an eye\". So, what has happened meanwhile that seriously damaged USD's image? \nActually, since mid-January, the dollar has fallen by 9 per cent among a basket of currencies. Such a steep decline in value is a rare development in the last three years. In fact, a continuously steep fall in dollar's value is indeed a matter of concern for practically the entire world for the simple reason that it is the world's reserve currency. But we would still have to wait for a while to say anything final about US dollar.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Is the US dollar collapsing?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/is-the-us-dollar-collapsing-1745246033",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 22, 2025 00:00:00  \nArtificial Intelligence (AI) is reshaping the way businesses operate, enabling them to interact and evolve with greater efficiency. By automating repetitive tasks, AI reduces the workload on human personnel, allowing them to focus on higher-level, critical, and creative work.\nAI systems now handle tasks such as data entry, scheduling, customer support, and inventory management with increased speed and accuracy. One of AI's greatest strengths lies in its ability to process vast amounts of data, empowering companies to make more informed, evidence-based decisions in areas like marketing, finance, and operations.\nFor example, AI can predict demand, detect fraud, personalize customer experiences, and even anticipate when machinery will require maintenance-reducing downtime and saving costs. Another key application is in customer service, where AI-powered chatbots and virtual assistants provide 24/7 support, improving response times and enhancing customer satisfaction.\nAs AI technology continues to advance, it's clear that businesses that adopt it thoughtfully will gain a competitive edge-boosting productivity, reducing costs, and maintaining agility in a rapidly evolving market.\nNusrat Jahan Joly\nStudent, Bachelor of Business Administration\nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Al's impact on business efficiency",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/als-impact-on-business-efficiency-1745246059",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-04-2025"
    }
]