[
    {
        "full_article": "The Lokpal’s ruling that High Court judges are amenable to its jurisdiction and the Supreme Court order staying it on its own motion raise more than a mere question of law. The issue concerns both the independence of the judiciary and its accountability. That the Court, government law officers and senior advocates found the Lokpal’s decision disturbing is understandable, as many believe that judicial independence will be undermined if judges of constitutional courts are made answerable to the Lokpal, even though they fall under the definition of ‘public servant’ under the Prevention of Corruption Act. The Lokpal view appears to be prima facie incorrect. There is nothing to suggest that superior court judges were ever considered to be under its remit. Last month, the Lokpal, headed by former Supreme Court judge, A.M. Khanwilkar, rejected a corruption complaint against a former Chief Justice of India (CJI) on the ground that the Lokpal Act, 2013, did not concern apex court judges and that its reference to “persons” who are members of any body or authority created by an Act of Parliament cannot be applied to the Supreme Court, an institution established by the Constitution. However, in respect of High Court judges, it said High Courts established by statutes creating the respective States were statutory bodies, and their judges were “persons” within the meaning of Section 14 of the Lokpal Act.The independence of the judiciary was the foremost consideration when the Court held in K. Veeraswami vs Union of India (1991) that no case can be registered against them without consulting the CJI, even though it also said judges were public servants under the Prevention of Corruption Act. Based on this principle, the Lokpal has referred the complaint to the CJI. While the Lokpal ruling is set to be reviewed, the time may have come to address the issue of accountability in the rare event of a credible corruption charge arising against a judge. The matter is now dealt with by the Court through an in-house procedure, initiated only if the Chief Justice of a High Court, or the CJI or the President receives a complaint. If the charges appear true, asking the judges concerned to resign, denying them judicial work or recommending their removal through Parliament are the options available. Some judges are transferred from one High Court to another, but whether a corruption charge is the reason is never disclosed. The Court should see if the present mechanism is enough or it needs to be expanded to include credible follow-up action such as an independent prosecution under its supervision. Both accountability and independence ought to be equally important for the judiciary. Published - February 22, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        Lokpal\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        public officials\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        corruption & bribery",
        "headline_1": "Judges’ dilemma: On the judiciary, its accountability",
        "headline_2": "Accountability and independence ought to be equally important for judges",
        "link": "https://www.thehindu.com/opinion/editorial/judges-dilemma-on-the-judiciary-its-accountability/article69247691.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-02-2025"
    },
    {
        "full_article": "With less than a week for the UGC’s deadline to submit feedback on its draft regulations on the appointment and promotion of university teachers and Vice-Chancellors (V-C), States ruled by parties other than the BJP have ratcheted up their opposition. At a conclave in Thiruvananthapuram, Kerala, Tamil Nadu, Telangana and Karnataka challenged the regulations, saying they would undermine the federal structure, diminish the powers of State legislatures, and weaken the autonomy of State universities. This is the second such conclave, with a previous meeting in Bengaluru including the governments of Himachal Pradesh and Jharkhand, and expressions of solidarity from Punjab. In Tamil Nadu and Kerala, the main Opposition parties are also supportive of the stances of the ruling parties there; some regional parties that belong to the BJP-led NDA have reportedly expressed their concerns in private. A key concern is the UGC’s proposal to play an enhanced role in the selection and appointment of V-Cs of State universities. Under the new regulations, the search-cum-selection committees will comprise nominees of the Chancellor (usually the Governor in State universities), the UGC Chairman, and the University syndicate or senate, neatly cutting out State Higher Education departments which were responsible for setting up these expert panels. The Chancellor will appoint the V-C from the list of three to five names shortlisted by the selection committee. UGC chairman M. Jagadesh Kumar has argued that the proposed structure “eliminates ambiguity and ensures a more transparent process”, but States oppose the centralisation of power, leaving many State universities leaderless, especially in Tamil Nadu.Apart from the allegation that the new regulations will dilute academic standards, increase commercialisation and politicisation, and reduce access to higher education for poor and disadvantaged students, the States have asked why they are being sidelined in university administration even while they continue to bear most of the financial costs for State-run higher education. Beyond higher education, there is a larger constitutional issue of Centre-State relations at stake: can delegated legislation such as the rules and regulations framed by the Union government and its agencies in the executive branch under a central law override the provisions of a plenary State law passed by a State legislature? The opposing States plan to send a high-level delegation to the Union Education Ministry and challenge the regulations in court, indicating a political and legal escalation of the issue. The UGC must not ignore this plethora of concerned voices and should remove anti-federal provisions from its draft before notifying the new regulations. Published - February 22, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        university\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Telangana\n                    \n                            /                      \n                        \n                        Karnataka\n                    \n                            /                      \n                        \n                        Himachal Pradesh\n                    \n                            /                      \n                        \n                        Jharkhand\n                    \n                            /                      \n                        \n                        National Democratic Alliance\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        higher education\n                    \n                            /                      \n                        \n                        laws",
        "headline_1": "​Southern discomfort: On UGC draft regulations",
        "headline_2": "Delegated legislation from the Centre should not override States’ plenary laws",
        "link": "https://www.thehindu.com/opinion/editorial/southern-discomfort-on-ugc-draft-regulations/article69248429.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-02-2025"
    },
    {
        "full_article": "From Trump’s baseball cap to Gandhi topi\nKings had crowns, Trump has a baseball cap, as does his billionaire sidekick Musk. When supporters put it on, with MAGA insignia, it’s like their own umbilical cord with the Disruptor-in-Chief. But is Trump the first US prez with a signature head cover? Hardly.\nBack in the day the 6’4” Abraham Lincoln chose to tower over others even more with a high top hat. In more modern times, Bush Jr and Sr and Reagan have turned eyes with a Stetson. To their critics it spoke a yeehaw foreign policy agenda, to their fans a rugged, true-blue Americana. Reagan put a Stetson on Gorbachev too, and that picture at his California ranch speaks to their ending the Cold War together as much as any other. But on the side, Americans giggled, because Gorby had put the cowboy hat backwards. Why didn’t Reagan tell him, will remain one of the great unanswered questions of history. In any case, this was still cooler than Lenin’s flat cap or that fur cap with ear flaps sported by most Soviet leaders.\nNo country has the abundance of cap styles India does. Putting his head through this diversity is a must for a neta peddling his wares hither and thither. One topi does have extra special political lineage: the Gandhi cap. But it’s also a victim of changing times. If you see a lot of it at a public gathering, the material will be ‘Chinese net’, not khadi. \n\n",
        "headline_1": "Head-y politics",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/head-y-politics/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-02-2025"
    },
    {
        "full_article": "Rather than being served by it\nHunger and obesity, bumper crops and environmental damage are simultaneous facts of our food system. This incredibly complex global network is hard to describe. How the World Eats: A Global Food Philosophy by Julian Baggini is a panoramic overview of traditional societies, the industrialised world, and those in-between. It explores all the debates from the ideal diet to agri systems to global food companies, but shuns binary solutions or single prescriptions.\nTake the idea of the optimal meal, with large servings of fruit, vegetable and grain. The Maasai in east Africa eat milk, meat and blood, the Inuit eat barely any plant. Yet, transitioning away from these diets has harmed their health outcomes. Instead of going by findings of nutritional science, it may make sense to trust the enduring traditional diets.\nMeanwhile, while the sustainable foraging lifestyle of the Hadza in Tanzania is the kind romanticised in the paleo diet, they have been known to happily eat other food if it was an option. Humans can eat novel foods and thrive.\nThe book takes on the idea that food can be broken down into nutritional components and engineered for the perfect mix. This mainly works for manufacturers who label their goods and claim to serve public health. In fact, we know little about the chemicals in a food (there are 2,306 distinct components in a clove of garlic), let alone their effects on health.\nRed meat is not inherently bad for you, it depends on what it is eaten with. Celebration of omega-3 fatty acids and damnation of omega-6s was similarly reductive. While there might be a link between some deficiencies and illnesses like scurvy, the link between nutritional excesses and lacks with chronic illnesses is a high jump, not warranted by the evidence.\nThis also goes for the bogey around industrial, or ultra-processed food. Not all of it is equally bad, even if whole food is better for you. It also complicates questions around farming. Tiny Netherlands is one of the world’s biggest agri exporters, because of its intensive farming with synthetic inputs. While organic, regenerative and no-till farming are often talked up as the ideal answer, different conditions demand different solutions, and the principle is to do no more than what the land can tolerate.\nThe book shows how global food corporations and their shareholders came to be at the centre of the food regime, through 1980s and 90s and the formation of WTO. Only determined regulation can fix these harms. Food workers are exploited as landowners and traders profit. The answer is to ensure poor people have enough money to eat well, rather than keep them dependent on cheap and unhealthy food.\nIt also explores the historical inequalities behind commodity crops like Belgian chocolate or Italian coffee, where intermediaries, manufacturers profit while countries in Africa provide the beans and labour, and a single chocolate bar costs more than a cacao farmer’s earnings.\nOn many other contentious topics, from the meat industry to GM crops, the book advises empiricism over purity, while also showing the organised interests behind a particular recommendation. Food should be at the centre of the food world, not commodification or corporate profits. Compassion and equitability are clearly essential, and that can only happen through democratic accountability, when we act like ‘food citizens’ rather than passive consumers.\n\n",
        "headline_1": "Humans now serve the global food system",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/humans-now-serve-the-global-food-system/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-02-2025"
    },
    {
        "full_article": "It’s optional, when truth is made in echo chambers\nTrain or platform, what’s moving? Common sense doesn’t let the question arise outside an introductory physics class. Suspend common sense, and there’s observed reality – people who are neither inside the train, nor on the platform, can settle the point objectively. But when Trump says the platform is moving, common sense and unbiased observers don’t count. Consider the $21mn question about USAID-funded interference in Indian polls. It came from Trump’s mouth and became truth in one universe. Now, some reports say the money went to Dhaka, not Delhi, just as condoms worth $50mn didn’t go to Gaza, but to Mozambique. And since these aren’t quantum dollars, they couldn’t have gone to both Dhaka and Delhi. Yet, Friday’s political jousts, predictably, weren’t really about establishing facts.\nOrdinarily, new facts force a reconsideration of old positions, but when reality becomes unmoored from fact, people believe what they choose to believe. So, truth becomes optional. Some argue an optional truth is no truth at all, hence the term ‘post-truth’. The problem with living in a post-truth world is that there’s no more space for reason and reasoning. Data shows immigrants are good for the US economy, but Trump’s MAGA camp believes they are not, and you can’t convince it otherwise. There’s no progress when you cannot question and reason – earth remains flat and stationary; 5G towers spread Covid. There’s no reference plane anymore: you are either in the train or on the platform, and that depends on the ideological ticket you bought. The only way to settle a dispute is to fight.\nProblem is, fact-scarce politics affects the governed. First, by colouring popular perceptions. And, second, via sub-optimal policy choices. Politicians, though, will stick to fact-scarce politics as long as it helps them win elections. That, probably, is the only uncontested fact.\n\n",
        "headline_1": "What’s a fact?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/whats-a-fact/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-02-2025"
    },
    {
        "full_article": "Supreme Court has mostly ruled against govt attempts to restrict this right, right from 1950. The ruling on Allahbadia case will be another test\nWhen the Constitution came into force on Jan 26, 1950, ‘we the people’ had fettered our right to free speech guaranteed under Article 19(1)(a) by “reasonable restrictions’ – libel, slander, defamation, contempt of court, decency and morality and security of state or attempt to overthrow a govt – through Article 19(2).\nA month later, Madras govt on March 1, 1950, under Madras Maintenance of Public Order, banned sale and distribution of a Mumbai news weekly CrossRoads within the state as it had published an article on police violence in Salem prison resulting in death of ‘communist’ prisoners.\n\nPublisher Romesh Thappar moved the Supreme Court directly terming the order an infringement of the right to free speech.\nRead the full story on TOI+.\n\n",
        "headline_1": "How free is free speech",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/how-free-is-free-speech/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-02-2025"
    },
    {
        "full_article": "Prof Rehman Sobhan raised an important point on Thursday, at a book launch ceremony, about why, after years of studies and research, the fundamental problems of our economy do not get solved. Why do we have this history where findings, recommendations, and knowledge of researchers, experts, and think tanks on crucial aspects of the country repeatedly get ignored and shoved aside by political leaders and implementers? We believe that the answer lies in the fact that there's a basic disconnect among the academia, political leaders, and bureaucrats in the country.\nNumerous studies have been conducted on every single social and economic sector in Bangladesh, yet in nearly 54 years since our independence, no fundamental reforms have been carried out based on the findings of those studies. One glaring example of this phenomenon is the recommendations of the 29 task forces created in 1991 under the leadership of Prof Sobhan. As the planning adviser in Justice Shahabuddin's caretaker government, Prof Sobhan called upon 250 experts of the country and formed the task forces—which dealt with topics ranging from the economy, environment, and energy to the revival of the jute industry—to reconstruct Bangladesh after the fall of Ershad's autocratic regime. However, none of the succeeding elected governments, which included both the Awami League (AL) and the Bangladesh Nationalist Party (BNP), implemented the recommendations of the task forces. The political parties' inaction shows how policymakers or political leaders in our country distance themselves from research and in-depth economic and social guidance provided by academia.\nGlobally, governments and policymakers depend on academia, experts, and think tanks for policy advice on fundamental issues in a nation. However, in Bangladesh, we have this dubious record of ignoring and shunning proposals made by experts and think tanks. Sadly, even when political leaders acknowledge expert advice, the proposals face obstacles from policy implementers, i.e. the bureaucrats. They often let their narrowmindedness get in the way and choose to promote megaprojects and allocate resources to programmes that are often unnecessary or require huge investments. Such bureaucratic preferences have created the path for unbridled corruption in the past, serving the interest of a select few in the process.\nNow that we are looking at reforms again, we must ask ourselves whether we want to take lessons from our past. Crucial recommendations submitted by all the reform commissions formed under the interim government led by Prof Muhammad Yunus will face the same fate as previous expert proposals if we fail to establish a line of communication and a path towards adherence and commitment among the three tiers of our society: academia, policymakers, and policy implementers. The distance between these three tiers must be reduced to solve the problems that have affected our society and economy for the last five decades.\n",
        "headline_1": "Collaboration a must among academia, policy makers and implementers",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/collaboration-must-among-academia-policy-makers-and-implementers-3830121",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-02-2025"
    },
    {
        "full_article": "Bangladesh has entered a new era—at least, that was the promise.\nAfter years of repression, election fraud, and unchecked state violence under autocrat Sheikh Hasina's government, the student-led uprising brought the interim government to power with a perceptibly sweeping mandate for change.\nThey wanted justice. They wanted an end to extrajudicial killings, enforced disappearances, police brutality, and an inclusive Bangladesh.\nYet, within six months into the new administration, we are having to grapple with grave misgivings especially since the script is strikingly similar.\nThe Mohammadpur gunfight early on February 20 reminds us that the state machinery has yet to be reformed. Two young men—Miraz Hossain and Md Jummon—were killed in an 'exchange of gunfire' with joint forces.\nThe official narrative claims that security forces raided the area based on intelligence that a group of criminals was planning a robbery. According to the Inter-Services Public Relations (ISPR), the suspects opened fire from the roof of a one-storey building, forcing the joint forces to retaliate. When the gunfire stopped, two bodies were found on the roof. Weapons were allegedly recovered from the scene. A photo of a bloody pistol was circulated. The joint forces arrested five other youths.\nAccording to The Daily Star, family members admit that both men had criminal records, but their deaths raise disturbing questions. Jummon's sister recalled that he had received phone calls before stepping out that night—only to end up dead an hour later. Locals reported unusual activities in the area before the raid, including an army patrol and announcement over megaphones instructing people to stay indoors. A section of the tin roof where the bodies were found appeared to have been cut—something that did not exist before. The forensic report confirmed that both men died of bullet wounds.\nThis is not an isolated incident. Almost identical scripts were played out hundreds of times. And they were passed off as 'gunfights' or 'crossfire', both euphemisms for extra-judicial killings. The justification was always the same—crime control, national security or self-defence. But in reality, they were state-sanctioned executions.\nThe world took notice when the United States imposed human rights sanctions on the Rapid Action Battalion (Rab) in December 2021, forcing a decline in such incidents.\nThe Mohammadpur gunfight, as law enforcers insist it was, gives rise to apprehensions that Bangladesh's law enforcement agencies still remain unreformed.\nWhat makes this case alarming is the government's silence. This administration came to power on the promise of justice and accountability. It was supposed to be different. Yet, it appears to be following its predecessor's playbook to curb crime.\nThe rise in crime, particularly in Dhaka, is undeniable. Robberies, muggings, and violent attacks are surging, and law enforcement must act. Yet the government's \"Devil Hunt\" operation has largely targeted opposition members, while actual criminals roam free.\nInstead of dismantling organised crime, the interim government appears to be using law enforcement as another tool for political persecution.\nThe people did not topple one dictatorship only to end up with a tamer version.\n",
        "headline_1": "Mohammadpur 'gunfight' follows a disturbingly similar script",
        "headline_2": "",
        "link": "https://www.thedailystar.net/news/bangladesh/news/mohammadpur-gunfight-follows-disturbingly-similar-script-3830041",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-02-2025"
    },
    {
        "full_article": "Palestinians in Gaza and the West Bank have been forced to live a dreadful life amid the intermittent horrors of bombings and killings. After over a year of Israeli genocide in Gaza, there is now a fragile ceasefire. However, US President Donald Trump's repeated threats of \"all hell breaking loose\" upon the Gazans have been looming large.\nWe are tired of being mentally shocked and morally bruised by the extent of the depravity of which Israel and its international backers are capable. All these have numbing effects on our moral sensibilities and do not seem to sufficiently outrage people's common sense and reason anymore.\nWhile Gaza is currently under the media spotlight, Israeli murders and mayhem of the Palestinians who live in Jenin and other refugee camps in the West Bank have gone unabated. As devastation sites, according to Palestine's foremost political commentator Mustafa Barghouti, there is not much difference between Gaza and places in the West Bank.\nGiven the level of Israeli cruelty inflicted on Palestinians, we can safely say that the Zionist authorities and their Western allies are fuelled and intoxicated by bloodlust and that the IDF soldiers are unhinged psychotics. But why do they massacre Palestinians? Are they driven by sadistic tendencies alone?\nThere are methods behind their murderous madness. A discussion of the abuses of children and other vulnerable groups in Victorian workhouses may help understand the schemes of Israeli settler colonialism and the logic of its domination and oppressive tactics.\nIn Victorian England, workhouses were meant to keep the paupers off the streets. The inmates had to work hard without any payment and were forced to live in squalid and disease-infested conditions. Even though the poor were provided with accommodation and (inadequate) food in the workhouse, the system bore hallmarks of slavery.\nVictorian writer Charles Dickens was a formidable critic of the workhouse system. In his April 1850 essay \"Pet Prisoners,\" Dickens drew a comparison between the treatment convicted felons received at London's Pentonville Prison and the treatment the poor got at a nearby workhouse at Saint Pancras. In order to highlight points of contrast, he mentioned the amount of food provided for the prisoners of Pentonville and that for the inmates of the workhouse to show the malnutrition of the latter. Dickens concluded that the lodging of the workhouse inmate was \"very inferior\" to that of the prisoner.\nA month later, in May 1850, Dickens wrote another essay, titled \"A Walk in a Workhouse,\" where he discussed the pitiable condition of \"fatherless,\" \"desolate and oppressed\" children in a workhouse that he visited. He characterised the workhouse as a \"little world of poverty\" that was \"inhabited by a population of some fifteen hundred or two thousand paupers, ranging from the infant newly born or not yet come into the pauper world to the old man dying on his bed.\" Here again, Dickens alluded to \"the Model Prison at Pentonville\" and reasserted that \"in respect of cleanliness, order, diet, and accommodation,\" the \"dishonest felon is … better provided for and taken care of than the honest pauper\" in the workhouse.\nDickens's novel Oliver Twist is perhaps the most vivid—though fictional—account of the abuse and cruelty against inmates in Victorian workhouses. The narrator of the story describes the state of food deprivation of the poor children in the workhouse of Mr Bumble in the following way:\n\"Oliver Twist and his companions suffered the tortures of slow starvation for three months: at last they got so voracious and wild with hunger that one boy, who was tall for his age … hinted darkly to his companions that unless he had another basin of gruel per diem, he was afraid he might some night happen to eat the boy who slept next to him.\" (Chapter 2)\nSince the intention of the authorities was to deter the poor from seeking parish relief, they rendered the conditions inside the workhouse deliberately harsh and sufficiently degrading so that the poor did not wish to live there. As the narrator in Oliver Twist informs us, the workhouse authorities \"established the rule that all poor people should have the alternative … of being starved by a gradual process in the house, or by a quick one out of it.\"\nIn the novel, the board of the workhouse is composed of \"long-headed men\" and \"practical,\" \"sound-judging,\" and \"mighty philosophers\" who make \"wise and humane regulations.\" They had in mind that the sole intent of establishing Victorian workhouses was to curtail public spending on poverty. In order to deter people from resorting to government support, the inmates of workhouses were subjected to hard work, (semi-) starvation, and other adverse living conditions. The authorities made the conditions of the workhouses repellent so that the poor did not opt to live there.\nThe Zionist blueprint for Palestine resonates with the strategy of the workhouse authorities of Victorian England. Practitioners of Israeli realpolitik seem to have been following in the footsteps of the \"practical philosophers\" in Oliver Twist. They have taken measures to subject Palestinians to cruel treatment and excruciating hardships to expel them from their land. The Israeli authorities have been making the conditions in Palestine increasingly difficult so that the Palestinians do not want to live there and so that the former can extend their occupation and settler colonial control over the lands of the latter.\nThe recent declaration by President Donald Trump to forcibly transfer and resettle the population of Gaza elsewhere exposed the design of the US-Israel alliance. One justification that the US president offered is that Gaza is now \"a demolition site\" where no one can live. What Trump didn't say is that Gaza didn't become unliveable because of any natural disaster. The demolition man—Benjamin Netanyahu—who was next to Trump when he made the reprehensible statement is primarily responsible for what Palestine is today. Netanyahu has been rightly awarded an arrest warrant by the International Court of Justice (ICJ) for his war crimes in the region.\nThe spectre of repeated Israeli violence in Gaza and the West Bank seems to have attained a semblance of normality in the face of world leaders' indifference to the suffering of Palestinians. Like \"the humble, half-starved\" Oliver Twist in Dickens's novel, Palestinians are \"despised by all, and pitied by none\" of the global powers.\nBut the violent, broad-daylight atrocities and war crimes of Israel against Palestinians will remain a blot on the conscience of the global community. In order to understand what Palestine is, one has to visualise a Victorian workhouse that has been subjected to bombings, ethnic cleansing, genocide, and other dastardly crimes for many decades.\nDr Md Mahmudul Hasan is professor in the Department of English Language and Literature at the International Islamic University Malaysia. He can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Palestine: A large Victorian workhouse?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/palestine-large-victorian-workhouse-3830021",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "RADP cut can spare health & education",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/radp-cut-can-spare-health-education-1740148976",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Boosting NBR's tax  collection capability",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/boosting-nbrs-tax-collection-capability-1740149085",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "NGOs must explore new funding options",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ngos-must-explore-new-funding-options-1740149247",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Digital currency: Threat or opportunity?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/digital-currency-threat-or-opportunity-1740149260",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-02-2025"
    }
]