[
    {
        "full_article": "The pushback by pilot bodies and the agencies that are investigating the Ahmedabad air crash, to the damaging leaks by sections of the media could well turn out to be a tepid attempt to staunch the flow. While these leaks have been dismissed as “selective, unverified, irresponsible and baseless reporting” and triggered legal responses, they have, in a way, set a narrative going. There is no fathoming of what more the cockpit voice recorder could contain — especially relating to the troubling possibility of ‘human intervention’ in the crash of Air India flight AI171 on June 12. In this the Aircraft Accident Investigation Bureau (AAIB) has to turn the spotlight on itself for its presentation of the key findings in its preliminary report. Its sparse detailing of an unusual “transitioning” of the two separate fuel control switches, from “run to cutoff’ and back, a standalone snatch of conversation, reflecting unease and denial, between the crew in the unfolding disaster — that has been left open to endless interpretation — and, finally, a near blanket signing-off of no recommended actions concerning the aircraft type, the engine, and the manufacturers, only point to one direction — of the need for the release of a full and raw cockpit voice recorder transcript.In a legal analysis, if credible evidence of ‘human intervention’ does emerge, the investigation could shift, with the International Civil Aviation Organization (ICAO) Annex 13 inquiry, that is focused on safety, moving alongside a parallel criminal probe under domestic law. It must be noted that in 2015, following the Germanwings flight 9525 accident — a case of definite ‘human intervention’ — the Government of India was mulling “mid-term” psychometric tests. Then Union Minister of State for Civil Aviation Mahesh Sharma had said that psychometric tests should be carried out on pilots in India from time to time. He added that the Ministry would hold consultations with the regulator, the Directorate General of Civil Aviation, to facilitate the preparation of fresh rules keeping in mind the crash of the German plane. A senior counsellor at the Kolkata-based Indian Institute of Psychometry (founded in 1978) had also favoured having a repeat of psychometric tests “if a person, especially a pilot or cabin crew, was undergoing mental stress or had had a tragedy on the personal front”. On July 17, in a letter of appeal, the AAIB had said that it would publish updates, as and when required, which would have content of technical and public interest. While it is understood that an air accident investigation would be meticulous, at the same time, the hope is that the AAIB clears the fog in the AI171 accident and presents the unvarnished facts — as promised in Parliament on Monday.\r Published - July 22, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Ahmedabad plane crash 2025\n                    \n                            /                      \n                        \n                        media\n                    \n                            /                      \n                        \n                        aviation safety\n                    \n                            /                      \n                        \n                        Airlines\n                    \n                            /                      \n                        \n                        air and space accident\n                    \n                            /                      \n                        \n                        investigation\n                    \n                            /                      \n                        \n                        Kolkata\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        psychology\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        Parliament proceedings",
        "headline_1": "Unvarnished facts: On the Ahmedabad air crash, AAIB investigation",
        "headline_2": "The full and raw cockpit voice recorder transcript must be released",
        "link": "https://www.thehindu.com/opinion/editorial/unvarnished-facts-on-the-ahmedabad-air-crash-aaib-investigation/article69839015.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-07-2025"
    },
    {
        "full_article": "It is raining welfare in Bihar. Nothing surprising: the stakes are high for the ruling National Democratic Alliance in the approaching Assembly elections. According to recent announcements, household consumption of up to 125 units of electricity per month will be free, with effect from August 1 this year. This scheme will cover around 1.67 crore households. Under the Kutir Jyoti Yojana, the government will provide free rooftop solar installations for about 58 lakh Below Poverty Line families. The welfare hamper of the ruling coalition also includes a promise of 35% job reservation in all State government jobs for women, an increase in social security pension from ₹400 to ₹1,100, the creation of a Bihar Youth Commission, and more. A new internship support scheme offers between ₹4,000 and ₹6,000 a month to youth (18 to 28 years) for undertaking internships, and based on their educational qualifications. The plan is to start supporting 5,000 youth in the first year and scaling it up to cover one lakh beneficiaries over the next five years. To promote religious tourism, the State has announced a ₹882.87 crore redevelopment plan for Punaura Dham Janki Mandir, said to be the birthplace of Lord Rama’s wife Sita. Migrants from the State who live outside will receive government support to return home during festivals.All this follows a familiar pattern of governments using welfare as an instrument of election-eve management of popular sentiment. The absence of any serious planning or vision behind such sporadic announcements is evident. They are often in response to the promises of a political rival. In Bihar, the Opposition Rashtriya Janata Dal has said that the Nitish Kumar government’s welfare catalogue is a forced reaction to its promises of similar measures if voted to power. Ahead of the Maharashtra Assembly elections, the Mahayuti government rolled out a cash transfer scheme for women which helped it win. Later, the new government pruned the list, admitting that there were undeserving beneficiaries. Free electricity schemes now exist in several States. Prime Minister Narendra Modi has often questioned the rationale of ‘freebies’, but arbitrary new schemes continue to proliferate. In Bihar, the scramble among parties is also in the context of Chief Minister Nitish Kumar’s advancing age. His party, the Janata Dal (United), is smaller than the Bharatiya Janata Party (BJP), and the election could further alter the dynamics of State coalition politics. The control of power had increasingly shifted from Mr. Kumar to the BJP in the last five years and the future of the JD(U) is set to decline. Competitive welfarism is all that remains in the toolkits of all parties to woo voters.\r Published - July 22, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Bihar\n                    \n                            /                      \n                        \n                        welfare\n                    \n                            /                      \n                        \n                        National Democratic Alliance\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        solar\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        social security\n                    \n                            /                      \n                        \n                        religion and belief\n                    \n                            /                      \n                        \n                        tourism\n                    \n                            /                      \n                        \n                        migration\n                    \n                            /                      \n                        \n                        Rashtriya Janata Dal\n                    \n                            /                      \n                        \n                        Maharashtra Assembly Elections 2024\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Janata Dal (United)",
        "headline_1": "Cost of promises: On the Bihar election and poll-eve welfare measures",
        "headline_2": "Election-eve welfare measures display a lack of respect for voters",
        "link": "https://www.thehindu.com/opinion/editorial/cost-of-promises-on-the-bihar-election-and-poll-eve-welfare-measures/article69838988.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-07-2025"
    },
    {
        "full_article": "The acquittal of Mumbai train blasts accused is a devastating indictment of police & prosecution\nBombay HC’s acquittal of the 12 men convicted (seven on life-term, five on death row) for the 11/7 train blasts is deeply worrying given what judges have revealed about the shoddy investigation and prosecution’s negligence. HC said prosecution had “utterly failed to prove the case” beyond reasonable doubt. That such “deceptive closure undermines public trust while the true threat remains at large.” Trial court’s conviction was junked on several points that included 1) confessions were a product of torture, 2) it was ‘very odd’ that witnesses identified the accused after four years, 3) witnesses were ‘stock witnesses’, rolled out frequently, 4) it took three months before one witness claimed to have seen bombs ‘assembled’, 5) prosecution’s evidence was simply ‘not safe’ to base convictions on.\nIf this is the state of investigation into one of the worst terror attacks India has suffered, one shudders to think what many routine probes entail. In the July 2006 synchronised blasts on seven suburban trains in Mumbai within minutes during evening rush-hour, over 800 had been hurt, and 187 killed. Anti-terror cops charged the accused under the harsh state law MCOCA and stringent anti-terror law UAPA in Nov 2006. In 2015, a special court convicted all 12. The convicts’ appeals have been pending in Bombay HC since 2015; Maharashtra state asked HC to confirm the sentences. HC acquitted all after regular hearings for six months since July 2024.\nThe last few years have seen a marked uptick in prisoners going from death row to acquittal. Higher courts and Supreme Court are routinely expressing dismay at sloppy investigation, where police and prosecution’s sole aim is to ‘pretend’ a case is solved. The 11/7 case is among the most significant of such cases – there was no application of mind by police, prosecution or the trial court. In Feb 2022, an analysis by The Print showed that in the previous year, six HCs had acquitted 30 convicts sentenced to death by lower courts. In each, HCs had rebuked investigators for false evidence, missing forensic samples, corruption, ‘manufactured FIRs’, coached witnesses, and pulled up prosecutors for even ‘hiding evidence’. Yesterday’s acquittals are a loud wake-up call. Cops and trial court judges must give their full and serious attention. \n\n",
        "headline_1": "Terror of omissions",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/terror-of-omissions/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-07-2025"
    },
    {
        "full_article": "Homely ramifications of an exposé at a Coldplay concert\nKamala is not talking to me. Because of some Kiss Cam catching a cheating husband at a Coldplay concert. What does that have to do with me? I asked her in my usual whiny voice. I’m used to being blamed for everything. But not international affairs. I thought MEA was dealing with that. But these international issues have national ramifications. \nThink Global Act Local is not just a slogan for Indian housewives. It’s a way of life. If Trump is claiming there is no Epstein file, Kamala is convinced I’m hiding something here. I tried to counter her with a generic Not All Men! but that was not acceptable defence apparently. She was convinced that all men were making a concerted effort to cheat on their bitter halves. I tried mentioning the husband of the lady in the picture. But Kamala was not discussing Cuckold Play. She was focused on the couple in the camera only. ‘Shee! The way he ducked down when the camera caught him. That’s a sign of sure guilt.’ I assured her that I would smile and wave at the camera if I was ever caught at the neighbourhood Ganesh pandal. \n‘Did you know that 78.5 % of Indian husbands have cheated on their wives at least once in their lives. Socialite Saroja said that NASA has done research on this.’ The statistics sounded as authentic as voter-turnouts in the Maharashtra elections. But I was not going to counter the fake news forward from her Kitty WhatsApp group.\nShubhanshu Shukla may have gone to space, but even he didn’t take his wife with him. I want to know with which lady he shared his gajar ka halwa. No space or any other trips for me. I was grounded. I knew I had to cancel my All Boys Bangkok break planned next month. I’m not sure whether they have jumbotrons in those massage parlours. Imagine if that was replayed on social media. I’m only worried the neighbours will know I have a paunch. \nMeanwhile the lady who shop-lifted in Target has been forgotten. I was about to use that exposé to curtail Kamala’s shopping trips. But the latest scandal has checkmated me. I’m shifting from astronomy to astrology – but still seeing a sky full of stars.\n\n",
        "headline_1": "The Bitter Half",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-bitter-half/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-07-2025"
    },
    {
        "full_article": "New polls show majority of Americans are now against harsh action on immigration. That’s good news   \n“Our policy to people born elsewhere should be clear: Enter by the law, or leave,” Trump wrote in his 2000 book, The America We Deserve. He won his second term after promising voters “the largest deportation programme in American history”, and started his presidency by signing an executive order titled ‘Protecting the American People Against Invasion’. Trump struck a chord because US does have a major illegal immigration problem. There were over 11mn unauthorised residents by 2022, and roughly 1 in every 15 was Indian. India got a taste of his crackdown in Feb when the first Globemaster with 104 deportees touched down in Amritsar.\nAnd such flights have continued, with an average of 14,700 deportations worldwide every month. The number sounds big, but Obama was deporting 36,000 a month in 2013. What’s different about Trump, though, is the noise and severity – people shamed and transported in cuffs. And America is sick of it, new polls this month show. \nA Gallup survey found that only 38% of Americans now support deporting all illegal immigrants, down from 47% last year. In fact, 78% are all for letting them become citizens. Why? Because the ordinary American recognises that the vast majority of illegal immigrants, who have lived for years in America without causing trouble, are useful. Now, a CNN poll also shows the majority of Americans (55%) think Trump has gone too far on deportations. They don’t want any more detention centres, and 59% are against detaining illegal immigrants who have lived in America for years. \nTrump should pay heed to these voices, especially when the mood against immigration in his own Republican camp is changing fast – only 48% now want less immigration, as against 88% last year. Throwing out millions of settled workers would be disruptive for the US economy, and also for their home countries. Indians who have invested their wealth and time to build a life in America, after entering without authorisation, may draw some hope from these developments. So can students and professionals who have been waiting to study and work in America legally. And if Trump relents, America can go back to being the land of opportunity.  \n\n",
        "headline_1": "Melting pot bubbling",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/melting-pot-bubbling/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-07-2025"
    },
    {
        "full_article": "Unregistered drones are law enforcement’s new challenge, one that’s not easily solved\nCivilian drones are proving to be a new headache for law enforcement across the country – an unsurprising fallout of drones becoming cheaper and more widely available. In towns and villages in western UP, for example, drones are regularly spotted after sundown. With growing suspicions that these are linked to local thefts or dodgy characters looking to make privacy-violating videos, people have been forced to mount rooftop vigils. Complaints of videography and snooping using drones, especially in relation to sensitive govt facilities, have been growing in Tamil Nadu. Other state authorities too are seized of the matter. \nThere are three issues here. First, compliance and enforcement of drone regulations are weak. To operate a civilian drone in India one needs to register the drone on the DGCA website, obtain a remote pilot licence, and be aware of flying regulations, including locations of no-fly zones. But most private drone operators don’t bother, and there are now lakhs of unregistered drones. As of April this year, only 32,000 were registered against an estimated 5L-plus drones in the country. \nSecond, despite the fact that import of drones is banned in India, foreign drones – especially of illegal Chinese make – are found across grey markets throughout the country. Chinese drones are actually smuggled across India’s porous borders. They are dismantled for the journey before being reassembled here. Third, given the rise of the attention economy, drone videos that infringe privacy are in high demand.\nThe sheer number of drones is seriously stretching limited police resources. One  solution is faster development of the Indian drone industry to lower domestic drone prices. This will stem imports, and perhaps ensure better monitoring of drone use. But it’s not a guarantee by any means. Drones are going the way of all tech breakthroughs – the baddies will more often than not outsmart the good guys.\n\n",
        "headline_1": "The new buzz",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-new-buzz/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 22, 2025 00:00:00  \nBanking has been undergoing transformation at a phenomenal rate. The latest trend apparently runs counter to the very concept of bank serving as a depository of cash or currency. Maintenance of cash -- enormous sums to be precise, is costly. How costly it can be is revealed by Bangladesh Governor Dr Ahsan H Mansur. According to him, Bangladesh has to spend a fabulous sum of Tk 200 billion on management of cash each year. Along with the central bank which alone prints bank notes, 61 commercial banks have to bear the costs of maintenance of idle money, transportation, security, insurance, storage, teller services, and sorting instruments. Printing of each currency note has a cost. If 1,000-taka note costs around Tk5.0-6.0, printing costs of notes of smaller denomination and coins in particular may exceed the value of those notes and coins. In a country where currency notes are subjected to all kinds of abuse, it is not surprising that an additional cost is involved annually with reprinting of 13 per cent banknotes rendered damaged. \nClearly, cashless transaction and transfer of large amounts of money digitally for payment and other purposes can drastically bring down the expenditure on cash management. The country also stands to benefit immensely if its informal sector governed mostly by black money or unaccounted-for economy, thought to be bigger than the formal one, can thus be curbed. So the positives are many if the country can plan for a systemic transition to a cashless society. That calls for payment of small amounts of daily transaction through QR codes to online transfer of big amounts in financial deals by using financial services like PayiO or wire transfer via banks. Cost-cutting and avoidance of physical contact and hassles in such transactions are highly desirable. \nYet things are not very simple and straightforward as one would like them to be. Unless cent per cent cybersecurity and digital protection can be ensured, clients are unlikely to be convinced of such transactions. The notorious digital heist at the Bangladesh Bank has not helped the cause. Breaching of cybersecurity cannot be ruled out unless the cyber unit of each bank or financial institution is manned by highly efficient and knowledgeable staff. Then there is the issue of digital and financial literacy, without a reasonable level of which confidential financial transactions can expose such operations to cybercriminals always on the lookout for banking heists. \nLast but not least, the deplorable law and order situation in the country certainly points to make digital transaction safe and secure but the investments made in infrastructure like ATM booths -- so long considered convenient -- are likely to prove to be a waste of money with the booths falling in disuse. Anti-social elements, particularly those looking for innocent victims to commit financial crimes have their own novel way of breaching security codes. In the latest such incident, a 28-year-old young man from Shripur was lured into a private car before taking him hostage and snatching away his debit and credit cards for swindling about Tk600,000 from his accounts in four banks on Saturday last. His flight abroad was scheduled the same night. So without improving the law and order, embarking on a course of cashless transactions may be fraught with danger.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "How challenging transition to cashless transaction is",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/how-challenging-transition-to-cashless-transaction-is-1753112345",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       July 22, 2025 00:00:00  \n\nThe Rohingya crisis, now in its seventh year, continues to test the resilience of the international humanitarian system and the moral conscience of the world. More than one million Rohingya refugees currently reside in squalid, overcrowded camps in Cox's Bazar, Bangladesh. Driven from their ancestral homeland in Rakhine State, Myanmar, by one of the most brutal campaigns of ethnic violence in recent memory, these refugees have been living under makeshift tarpaulin roofs, in what has become one of the most densely populated areas on earth -- just 24 square kilometres of land, housing a vast population in exile.\nDespite the heroic efforts of the Bangladesh government, local communities, and international humanitarian agencies, the situation for the Rohingyas is becoming increasingly dire. Not only have the conditions deteriorated within the camps due to prolonged displacement and environmental degradation, but also an alarming shortfall in international funding now threatens the very survival of this vulnerable population. Without urgent international action, the ongoing deplorable humanitarian situation may worsen, pushing an already traumatised community to the brink of desperation.\nThe current Rohingya crisis erupted in August 2017 when Myanmar's military unleashed a wave of targeted violence in Rakhine State, forcing over 700,000 Rohingya people to flee across the border to Bangladesh. With the influx that followed, Bangladesh became host to what is now the world's largest refugee settlement. Although Rohingyas were previously excluded from full citizenship and basic rights in Myanmar, the scale of brutality that ensued -- from arson and rape to indiscriminate killings -- amounted to what the United Nations described as a textbook example of ethnic cleansing.\nIn the face of such atrocities, the global community rallied, at least initially. A coordinated mechanism called the Joint Response Plan (JRP) was created, enabling the United Nations agencies and the Bangladesh government to pool resources and coordinate efforts to provide food, healthcare, shelter, water, sanitation, and education to the refugees. It was a shining example of multilateral cooperation, with many donor countries and international organizations stepping forward in solidarity.\nHowever, this early momentum is now faltering. The crisis of compassion is being replaced by a crisis of commitment.\nAccording to reports, the funding situation for Rohingya assistance has reached a critical point. In 2024, the JRP sought $934 million to provide basic services and support to the refugee community. As of May, only 15 per cent of that amount had been secured. This marks a continuation of the downward trend from last year, when the appeal for $852 million raised only $558 million. This widening gap between needs and resources is not just a bureaucratic concern -- it is a matter of life and death.\nThe consequences of such funding shortfalls are grave. The World Food Programme (WFP), for instance, has already reduced the monthly food voucher per refugee from $12.50 to $6 due to severe funding shortfalls.\nThe UNHCR has warned that unless additional funds are secured soon, health services will be severely disrupted by September, and food assistance could cease altogether by December. Such developments could have devastating effects --malnutrition, disease outbreaks, and social unrest are all likely outcomes in such conditions.\nThe funding crisis is being exacerbated by shifting global priorities. With major Western donors -- including the United States -- redirecting resources towards military support in Ukraine and other geopolitical hotspots, humanitarian crises like that of the Rohingyas are falling by the wayside. Global humanitarian budgets are shrinking even as global displacement reaches historic highs. This is not just a failure of economics; it is a failure of ethics.\nThe situation is further complicated by a renewed influx of Rohingyas into Bangladesh. In the past 18 months alone, at least 150,000 more refugees have crossed the border due to ongoing violence and persecution in Myanmar's Rakhine State. Far from improving, the situation within Myanmar has become more unstable due to military rule and widespread conflict. For the Rohingyas, the threat of further ethnic violence looms large, and for Bangladesh, the burden of hosting more displaced people becomes increasingly unsustainable.\nThe international community must recognise that the prolonged stay of refugees in host countries without adequate support creates long-term risks -- not only humanitarian but also social, environmental, and political. The host community in Cox's Bazar has already sacrificed much, enduring environmental degradation, rising living costs, and social strain. It is unreasonable -- and unjust -- to expect Bangladesh to continue bearing this burden alone.\nIt is imperative that the world not only steps up funding for Rohingya humanitarian assistance but also actively supports sustainable solutions to the crisis. While humanitarian aid is essential for immediate survival, the only viable long-term solution is safe, voluntary, and dignified repatriation of the Rohingyas to their homeland in Myanmar. For this to happen, the international community must exert consistent and coordinated pressure on the Myanmar military junta to ensure the protection of the rights of the Rohingyas and guarantee their citizenship, security, and access to justice.\nIn this regard, the international legal mechanisms and diplomatic platforms, including the International Court of Justice (ICJ), the UN Security Council, ASEAN, and the Organization of Islamic Cooperation (OIC), must intensify efforts to hold Myanmar accountable and push for inclusive political reforms.\nBangladesh has shown tremendous generosity in opening its borders to a persecuted population. But generosity cannot be a substitute for global responsibility. The crisis is international in origin and must be international in its resolution.\nAddressing the funding gap for the Rohingya crisis must begin with moral clarity. The world must reaffirm that no population should be allowed to languish in limbo, deprived of basic human dignity, simply because their suffering is no longer headline news. Donor countries must recommit themselves to the humanitarian principles they claim to uphold.\nFirstly, major donors, especially those who once played a significant role in supporting Rohingya assistance, must increase their contributions to the JRP. New donors -- including emerging economies -- should be encouraged to participate as part of a shared global responsibility.\nSecondly, humanitarian aid must be depoliticised. The provision of food, healthcare, and education to vulnerable populations should never be held hostage to shifting geopolitical interests.\nThirdly, regional cooperation must be enhanced. Countries in South and Southeast Asia must develop a coordinated framework for refugee management, burden-sharing, and cross-border humanitarian assistance.\nFinally, repatriation should remain the central pillar of international engagement with the Rohingya issue. This requires not only sustained diplomatic pressure but also investment in rebuilding the Rakhine State with infrastructure, security guarantees, and inclusive governance mechanisms that can ensure the safe return of the Rohingya people.\nThe plight of the Rohingya refugees in Bangladesh is not merely a local or regional issue -- it is a global test of our shared humanity. The international community must act now, decisively and generously, to bridge the widening funding gap and prevent a humanitarian disaster. At the same time, the world must press harder for a sustainable, rights-based solution in Myanmar. The cost of inaction is too high, not just for the Rohingya, but for the credibility of global humanitarian commitment.\nBangladesh has done more than its fair share. Now the world must do the same.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Rohingya refugees: World must meet funding shortfall",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/rohingya-refugees-world-must-meet-funding-shortfall-1753112419",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       July 22, 2025 00:00:00  \n\nEvery year, publishing of the Secondary School Certificate(SSC) and Higher Secondary Certificate (HSC) exam results is followed by mixed reactions from the participating students. And it is only expected that successful candidates will celebrate, while the unsuccessful ones will be sad. But some unsuccessful students commit suicide to express their unhappiness about the exam results. This is very unfortunate. This year's SSC results announced on July 10 were also followed by, so far as reports go, more than a dozen suicides mostly committed by girls. Families whose young members take their lives in this way are naturally devastated. But society has, as it were, accepted such unwanted family tragedies as a fait accompli. Thoughtful articles are written, discussions are held to find an answer to this very old problem of self-inflicted deaths by some teenage boys and girls every year who could not perform in exams according to their own or their families' expectations. Why should failures in exam draw self-destructive reaction from our children? Obviously, it is the loss of self-esteem that drives our children to end their lives so gratuitously. If anything, it is the prevailing system of examination to evaluate young learners' academic aptitudes to blame for the tragic consequences that befall them. It is not that the same students who committed suicide due to their lack of success following July 10's SSC results never failed in their school examinations. Some of them might have indeed experienced failures in their school level tests. But those could not traumatise them in this way. In fact, the long wait for the SSC or HSC results, the tension it gives rise to among the candidates, their family members and well-wishers prove too heavy for those tender-hearted children to bear. So, when the bad news comes, they collapse and choose to die. \nExaminations to evaluate a student's school performance should not be so exacting. Moreover, why should a three-hour test for each subject decide the fate of a student's entire educational career? Can even an anonymous examiner selected by the education board who have no idea about the candidate whose answer script s/he is marking, be an honest judge of the examinee's real abilities? \nWhat is more, just anonymity or remoteness cannot be the sole yardstick to ensure the impartiality of an examiner. On the contrary, a teacher who has intimate knowledge of the student being evaluated for her/his academic skills should be the best person to judge the candidate in question.\nWhat is being argued here is the fact that the existing system of public examinations to test a student's merit is not foolproof and it has its serious demerits, too. The existing system has to be revamped. The grading method needs also to take into account a student's record of performance during the entire academic year before the final examination. So, methods have to be devised so that some points reflecting a student's test records at school is also incorporated in the final scores achieved by a student in the final publicly held examinations. Also, organising public examinations for the secondary and higher secondary levels needs a rethink. If degrees at the highest levels of education at a university can be awarded by teachers of the same institution, why should it be so different at the secondary and tertiary levels? \nIn this age of information technology and AI, it should be possible to design an examination system that can assess an individual student's academic aptitude by taking into consideration the history of her/his school records and adding those to the grade points achieved through the existing system of public exams where hundreds of thousands of candidates sit for tests at the same time under the country's education boards. \nBoth the process of learning and the tests to evaluate a student's performance at schools should be enjoyable and humane. And every student regardless of her/his performance should be able to feel happy at the end of the school years. \nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Giving education system  a human face",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/giving-education-system-a-human-face-1753112549",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 22, 2025 00:00:00  \nThe National Reform Council has brought all political parties to a consensus on the terms of reference for the appointment of the Chief Justice and the declaration of a state of emergency. This is a positive sign of progress in the government's reform initiatives following the formation of the committee, which gives hope that it will bring about necessary reforms in statutory positions and organisations.\nSo far, we are satisfied with the committee's functionality and the way political parties are being involved in the reform process. The committee also appears to be carrying out its duties and responsibilities independently. We expect it to succeed in advancing talks on electoral reforms, including fundamental changes such as establishing a proportionally representative upper house, defining the structure of key constitutional and statutory bodies in the constitution, and ensuring women's representation in parliament through direct elections.\nFollowing the mass student-public upsurge of July-August 2024, momentum for reforming government machinery, social institutions, and business bodies has been growing. The goal is to eliminate the possibility of autocratic rule once and for all. Law enforcement agencies and statutory bodies should no longer be manipulated by political leaders for their own interests. Reforms must ensure equal access to services and justice for all. This is a public demand that political leaders must understand.\nWe are observing with appreciation the bold and commendable reform initiatives underway in the National Board of Revenue, BSEC, academic and educational institutions, financial bodies, and various other government organisations. The Reform Council has been working diligently to bring about meaningful structural changes, including in the electoral process. It is now essential that all political parties act with maturity and show genuine commitment to the country. Otherwise, the people will not hesitate to overthrow them, just as they did with the previous government.\nAbu Taher\nSenior Deputy Director \nICAB\nabutaher011@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Stay united to bring about meaningful reforms",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/stay-united-to-bring-about-meaningful-reforms-1753112577",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-07-2025"
    }
]