[
    {
        "full_article": "By holding that the judiciary cannot fetter Governors and the President to “one-size-fits-all” timetables or usurp their functions by assuming “deemed consent” of proposed Bills by States, and also clarifying that these authorities cannot resort to “prolonged and evasive inaction”, the Supreme Court’s answer to the 16th Presidential Reference appears as a constitutional balancing act. But, substantively, it is a blow to federalism as it effectively allows Governors unchecked powers to block or delay State legislation without constitutional accountability. This opinion contradicts a progressive judgment in April 2025 that had prescribed three-month timelines and used Article 142 to grant deemed assent to some Bills passed in the Tamil Nadu Assembly. The Court invoked separation of powers to reject timelines and Article 142’s use, but this empowers Governors at the cost of State rights. The judgment claims that Articles 200 and 201 prescribe no deadlines, but disregards explicit constitutional text. In Article 200, the Governor must declare his decision “as soon as possible” — the Court called it too “elastic” to support timelines, rendering constitutional text unenforceable. The Court’s assertion that Governors are not bound by the Council of Ministers’ aid and advice contradicts constitutional history. The framers explicitly removed the phrase “in his discretion” — a phrase in the Government of India Act, 1935 — from Articles 200 and 201. Even the Sarkaria Commission recommended a six-month period for Governors to decide on Bills.The Court did rule that withholding assent must be followed by returning the Bill to the Assembly. But the judgment rules that even if the Assembly passes the Bill a second time, the Governor retains the option to reserve it for the President. This kills the binding nature of the legislature’s second passage. Consequently, whether at first instance or after reconsideration, a Governor can refer a Bill to the President under Article 200. Once there, Bills can languish indefinitely as the judgment ruled that the President has no obligation to consult the Court. The Assembly has no recourse to re-pass Bills in a binding manner, and the judgment provides no guidance on when referring a Bill to the President is appropriate. While the judgment talks of a “limited mandamus” for prolonged inaction, it refuses to define what constitutes a “reasonable period of time”, forcing States into legal battles to prove delay. By removing procedural safeguards (timelines and deemed assent), extraordinary remedies (Article 142), and oversight (judicial review of actions under Article 200), the Court’s opinion has allowed the possibility of executive overreach. States have little mechanism to challenge arbitrary delays, no automatic approval after reasonable periods, and no remedy when Bills are referred to the President, even on subjects under the State List. And these are situations that have recently transpired in many Opposition-ruled States. The Court appears to have found a way to turn the letter against the spirit of the Constitution. Published - November 22, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        Governor\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        Tamil Nadu",
        "headline_1": "​Blow to States: On the Supreme Court and State Bills",
        "headline_2": "Supreme Court should have upheld timelines for Governors and President",
        "link": "https://www.thehindu.com/opinion/editorial/blow-to-states-on-the-supreme-court-and-state-bills/article70308688.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-11-2025"
    },
    {
        "full_article": "The introduction of the second iteration of the National Action Plan on Antimicrobial Resistance is an acknowledgement that, but for some marginal gains, implementation of version 1 was, at best, sluggish. In a welcome move, the Centre has released a further version of the policy, though the details are not yet available in the public realm, to give the nation a booster shot at trying to fix the rather humongous AMR problem that the country has had to contend with, increasing volumes to boot. In October, WHO released its Global antibiotic resistance surveillance report, which recorded that in 2023, approximately one in three bacterial infections in India were resistant to commonly-used antibiotics. Globally, it was one in six confirmed infections. It spelt out why India was disproportionately affected — factors included a high infectious disease burden, overuse and misuse of antibiotics and gaps in the surveillance and healthcare infrastructure. E.coli and Klebsiella pneumoniae have exhibited high resistance to critical antibiotics, making the very last line of drugs ineffective. But human health is not the sole footprint AMR possesses; there is scarcely a field in the food chain where its cold arms have not touched — from veterinary practices to contaminating soil and water health and, thereby, agriculture and aquaculture. This ubiquitous spread of AMR has spurred scientists to push the One Health technique — it integrates the prisms of human health, animal health and environmental health — to handle growing resistance in communities.The time is, no doubt, ripe for India to take AMR seriously and push for an enhanced, committed antibiotics stewardship programme. While the first National Action Plan played a key role in raising the profile of AMR, the actual implementation suffered. It is true that the country expanded its national surveillance programme by adding a solid laboratory network (thanks, in part, to the COVID-19 pandemic), it also scored a win with the ban on Colistin as a growth factor in the animal husbandry sector. However, the programme flailed as it failed to secure potent collaborations with States. A few States drew up their own policies, but only Kerala implemented it well enough to see a slight drop in AMR levels in the community, recently. This policy will have to tackle every aspect of AMR’s causative factors, including the rampant overuse and misuse of antibiotics. The One Health approach will have to be strengthened, and better co-ordination with States ensured. This time around, the policy will have to be the real deal and deliver, against resistance. Published - November 22, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        medicine\n                    \n                            /                      \n                        \n                        medical research\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        World Health Organization\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        disease\n                    \n                            /                      \n                        \n                        health\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        aquaculture",
        "headline_1": "​Overcoming resistance: On the National Action Plan on Antimicrobial Resistance (2025–29)",
        "headline_2": "Version 2 of the National Action Plan on Antimicrobial Resistance requires fresh commitment",
        "link": "https://www.thehindu.com/opinion/editorial/overcoming-resistance-on-the-national-action-plan-on-antimicrobial-resistance-202529/article70307950.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-11-2025"
    },
    {
        "full_article": "Tejas, despite Dubai tragedy, remains vital for IAF  \nIt was a terrible tragedy, bad optics for India, and it put a sharper focus on a critical indigenous defence project. The pilot didn’t survive the Tejas crash at Dubai Air Show. And images of India’s fighter jet tumbling to the ground at one of the world’s biggest showcases for aviation tech, have multiple implications. Accidents and crashes are not unknown at air shows. Back in Aug, a Polish Air Force pilot was killed when his F-16 jet crashed during the rehearsal for the Radom Air Show. Add to this crashes during training and routine peace-time flights – in July, a US Navy F-35, one of the most advanced fighters in the world, crashed in California. \nBut current military-geopolitical circumstances mean that Dubai’s Tejas crash attracts greater attention. Coming after Op Sindoor, which saw aerial battles with Pakistan, the crash will certainly get the rumour mills churning. That Pakistan’s China-made JF-17 was also taking part in Dubai will add masala to the narrative. This crash is, there’s no getting away from it, awful PR for India. But more substantive issues are at stake. \nThe Tejas project has been hit by massive delays in production. For example, deliveries of Tejas MK1A were to start from Feb 2024. But thanks to engine delivery delays by America’s GE and other issues with integration of electronic warfare suite and specialised munitions, deliveries will only begin next year. IAF has been poorly served by those in charge of Tejas. But indigenisation must continue despite setbacks. IAF’s squadron numbers are down, especially with the retirement of  MiG-21s. Given India’s strategic-security challenges, thanks to a China-Pakistan nexus, Tejas is absolutely vital for IAF. It’s supposed to bulk up the air force to the point where multi-theatre deployment is not an issue. Dubai is a tragic reminder of that imperative.\n\n",
        "headline_1": "Bad Optics But…",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/bad-optics-but/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-11-2025"
    },
    {
        "full_article": "Its old liberal face was a triumph of PR  \nRemember when Elon Musk was in Hillary Clinton’s camp? He said Trump didn’t “seem to have the sort of character that reflects well on the US”. That’s broadly the story of most tech “bros” – Mark Zuckerbergs and Eric Schmidts. Twitter’s Jack Dorsey gushed in 2010: “Wow…I had the honour of sitting right next to Secretary Clinton.”\nSome pundits explained this liberal slant as morality – most billionaires were setting up philanthropic trusts at the time. Others said it was self-interest, because govt projects padded tech revenues. But now when the tech world makes no pretence of progressive politics at all – Meta’s ditched diversity; Musk wielded a chainsaw on stage “for bureaucracy” – an alternative explanation is needed. Journalist Jacob Silverman provides it in his book Gilded Rage: Elon Musk and the Radicalisation of Silicon Valley.\nAlthough Musk figures on the cover and in the title, the book is not about him. But as the biggest billionaire of all, and briefly Trump’s right hand, he’s an exemplar of the class. “He became the most high-profile example of a dramatic rightward political shift among top tech executives and venture capitalists, and his public persona utterly transformed,” Silverman writes.\nThe question is why. And it would be a mistake to look for answers in the months leading up to Trump’s re-election, because “This new political reality didn’t start with Elon Musk or Peter Thiel or the 2016 election…” Look back far enough, and the tech industry began life in the military’s lap. It made its earliest chips for American ICBMs. In the post-9/11 era, “tech companies…established a massive, indiscriminate surveillance apparatus at home.”\nEven when tech bros were cultivating a friendly, politically-correct image, the reality was that they “marketed themselves like utopian college campuses but governed themselves as ruthless surveillance states”. Silverman cites Twitter, whose largest outside shareholder was Saudi billionaire Prince Alwaleed bin Talal, and the relationship went beyond money. The Saudi state was able to “track dissident thought… unmask pseudonymous accounts and trace their owners, who were then arrested”. How? The Saudis had “a spy ring inside Twitter itself”. \nTo imagine the tech universe as liberal and progressive even though it consorted with the most repressive regimes – in 2016, Uber got $3.5bn from Saudi Arabia’s Public Investment Fund – is delusional. What we fell for, Silverman says, was its PR.\nSo, why have the “bros” embraced reactionary politics now, why are they raging despite having everything? One, Trump’s re-election “moved the window of acceptable political opinion firmly to the right, (and) a wealthy class already predisposed to authoritarian beliefs readily followed”. Two, they aren’t exactly young anymore, and see that they have failed to change the world in any fundamental way. San Francisco, home to Silicon Valley, is decaying. In Thiel’s words: “We wanted flying cars, instead we got 140 characters.” Three, they consider themselves superior to the rest of humanity and miss the adulation that waned after a string of scandals last decade. So, they need a new power trip.\nLoose monetary policies since the pandemic gave them the opportunity. Easy money enriched billionaires massively, even though most – like Trump acolyte Vivek Ramaswamy, for whom Silverman worked briefly – have nothing useful to show for their fortunes. The only use they’ve found for their billions is to amass power for power’s sake.\n\n",
        "headline_1": "Silicon Valley Didn’t Turn Right, We Read It Wrong",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/silicon-valley-didnt-turn-right-we-read-it-wrong/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-11-2025"
    },
    {
        "full_article": "Kissing is evolutionary tradition. Moral police, take note\nTrust scientists to take the thrill out of kissing, tracking its roots back 21mn years ago to find most apes locked lips – before modern ‘we’ happened, let alone modern romance – as they chased a most unromantic question: why did this germ-sharing behaviour evolve at all? They call it ‘an evolutionary conundrum’, essentially since there’s no benefit to kissing, how come the ‘behaviour’ survived millennia? Neanderthals and humans ‘shared oral bacteria’ even 112,000 years ago – if that passes off as a smooch. There wasn’t enough data to see if apes canoodling was platonic/affectionate, or sexual as in tied to mating. Regardless, the study has piqued interest in the obvious follow-up – when did romance enter the locked lips picture? And onwards to a not-so-scientific field – why on earth do some cultures frown upon kissing when it is, verily, timeless tradition?  \nEnter human behavioural scientists in 2015 who studied romantic-sexual ‘lip-to-lip contact that may or not be prolonged’ in 168 cultures. That definition alone is a ‘kiss of death’ for a kiss in a peer-reviewed journal. Their findings? Kissing isn’t nearly as universal as believed. Just 46% of cultures kiss. And, more socially complex the culture, higher the frequency of kissing. Which simply means that moralising judges, rude and crude cops, judgy aunties & WhatsApp uncles everywhere are but sad products of lame homogeneous societies, not guardians of tradition.\n\n",
        "headline_1": "Apes Knew, Do We?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/apes-knew-do-we/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-11-2025"
    },
    {
        "full_article": "The other day in a Gurgaon mall I was made aware of something that was obvious but which I had somehow overlooked till that moment.\nAll the people I saw – of both genders and of all ages, from teenagers to senior citizens – were wearing a uniform. Or rather, a half uniform, in that their clothing from the waist down was the same.\nHad the country launched a recruitment drive for some sort of citizens’ militia which made people wear this half uniform? Of course not. What the people were wearing was what’s become the uniform or half uniform, not just for urban India, but for the whole world. They were wearing denim jeans.\nThe word denim is derived from the term ‘serge de Nimes’, serge being a type of hard-wearing cloth made in the French city of Nimes. The original fabric was acombination of wool and silk, not the all-cotton cloth it is today.\nWhat made the serge from Nimes unique was the technique of using blue indigo dye for the warp threads, while leaving the weft threads white, creating the blue-white look that distinguishes denim.\nHow did the serge de Nimes get associated with the word jeans, and how did this ensemble become as emblematic of America as Coke and mom’s own apple pie? Genoa in Italy produced a similar cloth used for making pants for sailors, which was called ‘geane’, pronounced jean. During the California Gold Rush in the 1870s, a German immigrant to America called Levi Strauss began using a hybrid of denim ‘geane’ to sell his ‘jeans’ to miners.\nTo make his jeans more durable, Strauss added metal rivets on the stress points. He also added a small pocket-inside-a-pocket on the front right-hand side for the wearer to keep a watch safe during hard manual labour.\nFrom their humble origins jeans became a paradoxical sartorial statement, combining working-class egalitarianism with high fashion, rugged individualism with mass-produced ‘me-too-ism’.\nTheir universality of appeal has embedded them into what might be called the human jean-nome.\n\n",
        "headline_1": "Jean-etic code",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/jean-etic-code/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 22, 2025 12:00:00  \nEarthquakes seldom announce themselves before they strike yet their consequences reflect years of choices made about how cities grow and how safety is enforced. The tremor that rippled through Dhaka and nearby districts on Friday morning was a moderate event by global standards, but even so it made buildings sway and walls crack, revealing how vulnerable Bangladesh's urban landscape really is. The Bangladesh Meteorological Department measured the quake at 5.7 while the United States Geological Survey recorded it at 5.5. Unlike previous tremors that often originated far from the capital near the borders of India or Myanmar, this seismic event was centred a mere 13 to 14 kilometres from Dhaka and at a shallow depth of 10 kilometres. The fact that the epicentre was so close to such a densely populated megacity is the most worrying part of this event. As buildings shook, people poured into open spaces within minutes and the capital was briefly overtaken by confusion and fear. At least five people including a ten-month-old child tragically lost their lives after railings and walls gave way, and several hundred people were injured. Many of the injuries occurred as people rushed for the staircases to escape, a common but often dangerous reaction during earthquakes. The event also caused cracks to appear across numerous buildings in the capital, partially collapsing some structures and sparking fires in several locations.\nThe true danger during an earthquake, however, does not only come from the shaking itself but in human failings in construction. Expert assessments repeatedly warn that a large share of the capital's buildings is critically vulnerable. Many modern buildings, including residential blocks, contain inherent flaws such as soft ground floors used for parking that become fragile points during seismic movement. The problem is intensified by the inconsistent quality of construction materials, especially concrete, whose strength is often weakened by poor mixing and lax supervision. Routine violations for the Bangladesh National Building Code including the omission of soil testing have produced an urban environment where even a moderate quake can cause major damage. Furthermore, ageing and uncoordinated urban utilities like water and gas lines present secondary threats. Their rupture in a major quake could trigger fires and hazardous conditions easily overwhelming emergency services.\nThose who study the region's seismic history know very well that a major seismic event in this part of the world is not a matter of if but when. Yesterday's quake made this reality ominously clear. Bangladesh sits close to a network of active fault systems responsible for historically devastating earthquakes such as the Great Arakan event of 1762 and the major Assam tremors of 1897 and 1950. Seismologists warn that major quakes follow cycles and that a high-magnitude event in the region is long overdue. This 5.7 tremor demonstrated, with uncomfortable clarity, how catastrophic the situation could become if the next quake reaches a magnitude of 6 or above. The consequences would almost certainly exceed the limits of current preparedness and overwhelm any meaningful rescue effort.\nThe events of Friday should therefore serve as a clear and definitive prompt for action. A comprehensive plan needs to be implemented with urgency, beginning with a mandatory structural audit of all high-rise buildings and critical infrastructure. Enforcement of the building code must be restored as a non-negotiable requirement with uniform penalties for violations. Concurrently, a massive public awareness campaign is essential to cultivate a culture of construction safety. The tremor that happened yesterday has caused some damage and loss of life, but the next one might bring the entire city's skyline crashing down if authorities fail to take action immediately.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Earthquake and the risk to Dhaka residents",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/earthquake-and-the-risk-to-dhaka-residents-1763736161",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       November 22, 2025 00:00:00  \nDuring last Ramadan, standing beside UN Secretary General Antonio Guterres in a refugee camp, Professor Muhammad Yunus expressed his hope that the Rohingya community would be able to offer their next Eid prayers in their homeland of Arakan. His words kindled a fragile expectation among a persecuted people driven from their ancestral land and condemned to statelessness. With less than four months remaining until the Eid, that promise now rings hollow. Repatriation remains a distant prospect while the situation in Rakhine State grows more volatile by the day. Far from returning, more 150,000 Rohingya have crossed into Bangladesh this year alone, bringing the total number of refugees in the country to over 1.5 million.\nFor the Rohingya population, tragedy is a legacy passed down through generations. It began in 1784 when the Burmese king Bodawpaya invaded Arakan, unleashing mass killings that forced about 200,000 Rohingya to escape to Chittagong. The pattern repeated in 1942 when Burmese nationalist forces, under the Japanese occupation, initiated a new wave of ethnic slaughter, driving another hundred thousand to flight. This recurring cycle of pogroms, sexual violence and arson pushed entire communities of successive generations into Bangladesh where many gradually settled and blended into local society. The Myanmar army recognised the convenience of this phenomenon and continued to weaponise terror as a means to empty the land of those they viewed as unwanted.\nEmboldened by past impunity, the military launched its most savage campaign yet in 2017 under the guise of a \"clearance operation.\" This unprecedented barbarity led to an estimated 25,000 Rohingya deaths and forced over 740,000 to flee to Bangladesh. The United Nations is now investigating these events as a genocide. This violence, encouraged by extremist monks like Ashin Wirathu, has also tarnished the global perception of Buddhists as a peace-loving community. Time magazine aptly described Wirathu as \"the face of Buddhist terror\" which is a choice of powerful words given how rarely the terms \"Buddhist\" and \"terror\" are conjoined. \nBangladesh is having a very hard time supporting this massive refugee population with its limited resources. A densely populated country facing serious economic pressures cannot indefinitely absorb an ever-growing influx from a neighbour, which makes repatriation an unavoidable policy priority. Yet this goal is constantly undermined by a narrative from Myanmar's ruling elites and ultranationalists that portrays the Rohingya as recent Bengali interlopers. This is a deliberate act of historical erasure because the Rohingya community has long been rooted in the history and society of Arakan. Historical records show that in 1430, the founder of the Mrauk U dynasty, Min Saw Mon, reclaimed the Arakanese throne with military assistance from the Sultan of Bengal and ruled as Sulaiman Shah. Muslim influence in the Arakan court became significant since then, and the community known today as the Rohingya flourished. Over the next two centuries, eighteen Muslim aqas held prominent administrative roles. Even during Burma's struggle for independence, Rohingya leaders such as Abu Gafur and Sultan Ahmed worked alongside General Aung San in the pre-independence constituent assembly and contributed to drafting the country's foundational constitution. Despite this legacy, the community has been stripped of citizenship and denied recognition.\nHope for a solution briefly rose when foreign affairs advisor Md. Touhid Hossain took office, especially since he had written extensively and thoughtfully about the crisis. It was expected that his expertise would translate into tangible progress. But reality has proven otherwise. In his earlier work, he stressed the importance of engaging with the Arakan Army (AA) and anticipated that it would become the dominant force in post-war Rakhine. He had also cautioned against any action the AA could perceive as hostile since their position would heavily influence the chances of any future repatriation arrangement. \nHowever, the way things are now shows that optimism was misplaced. While the AA has been successfully contesting the military and controls significant territory in Rakhine, its stance on the Rohingya is unequivocally hostile. The AA's ideology is built upon a Rakhine nationalist vision that outline a sovereign Rakhine state that explicitly excludes the Rohingya. The AA has shown no interest in integrating Rohingya into its ranks or accepting their return. Its leader Twan Mrat Naing has even accused Bangladeshi authorities of applying new pressures, an allegation that suggests a deteriorating relationship and tragically echoes the military's own propaganda. This leaves the Rohingya in a limbo. The global Rohingya population exceeds two million. It is remarkable that a community of this size, having faced genocide, rape and oppression in their homeland, has been unable to mount an effective resistance. This stands in contrast to the Arakan Army which, representing an ethnic Rakhine population of roughly the same size, is successfully challenging the military junta. \nIn the refugee camps of Bangladesh, the Rohingya are deprived of both dignity and a future. Forced to survive on minimal rations, they are barred from legitimate business and other income generating activities that could give them a measure of independence. This idleness and hopelessness have predictably led to a rise in criminality such as drug trafficking and theft. The Rohingya children are denied formal schooling because of the fear that education will lead to integration. A community trapped in such conditions, stripped of education and opportunity, cannot reasonably be expected to develop the leadership required to unite its people and defend their rights.\nThis reality demands a new and honest assessment. When diplomacy serves only to prolong an injustice and oppression never lets up, what choices are left? Throughout history, many peoples have struggled for self-determination, often with external support. Even our own Mukti Bahini received essential assistance during the Liberation War of 1971. The Rohingya have endured centuries of persecution and their only response thus far has been to run. But those who are now confined to camps, their lives slipping away, must consider that acceptance of their fate is not the only option. The path to self-determination, though fraught with peril, may be the one that leads away from perpetual victimhood. The international community must understand that a political solution requires not just talking with the oppressors, but empowering the oppressed with the means to claim their rightful home. In absence of bold action, the cycles of displacement and violence will continue and the burden on Bangladesh will never end.\nshowaib434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The Rohingya's path to self determination",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-rohingyas-path-to-self-determination-1763736191",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       November 22, 2025 00:00:00  \nLast Wednesday, countries observed the World Toilet Day with three key messages: we'll always need the toilet, toilets are under pressure and we need toilets fit for the future. The significance of these messages cannot be overstated. UN-Water, the UN's coordination mechanism on water and sanitation, set 'sanitation in a changing world' as the theme for this year's World Toilet Day, recognising that inadequate sanitation is a global crisis, with Bangladesh among the many affected countries. Data provided by the World Health Organisation (WHO) and UNICEF showed that 3.4 billion people still live without safely managed sanitation services, a staggering figure that underscores the urgency of the issue. In other words, nearly half of the world's population do not have a safe sanitation system. The implication is severe. For instance, unsafe water coupled with inadequate sanitation and perilous hygiene is responsible for the deaths of around 1,000 children under five every day.\nThe WHO defines sanitation as 'access to and use of facilities and services for the safe disposal of human excreta.' The sanitation services range from the provision and emptying of toilets to the transport, treatment and final disposal or use of excreta. Handwashing is a key part of sanitation and personal hygiene that removes infectious agents from hands and prevents spread of disease. In Bangladesh, safe sanitation is still a big challenge, though the country made the toilet revolution more than a decade ago and drew global attention. \nKey indicators of the toilet revaluation are the reduction of open defecation, enhanced use of sanitary toilets and improved sanitation. Bangladesh has made significant strides in these areas, reducing the rate of open defecation to almost zero per cent around a decade ago and increasing the use of hygienic toilets to around 70 per cent. The ratio of non-sanitary or kaccha toilets is also below 3.0 per cent. This remarkable progress in eliminating open defecation and increasing the use of sanitary toilets has significantly reduced overall health hazards, offering hope for further improvements.\nThe Bangladesh Multiple Indicator Cluster Survey (MICS) 2025, jointly conducted by the Bangladesh Bureau of Statistics (BBS) and the United Nations Children's Fund (UNICEF), showed that 73 per cent of the country's households have access to basic sanitation, which refers to the use of improved facilities not shared with other households. The improved sanitation facilities are 'those designed to hygienically separate excreta from human contact and include flush/pour flush to piped sewer system, septic tanks or pit latrines; ventilated improved pit latrines, composting toilets or pit latrines with slabs.' Around 19 per cent are using limited sanitation, such as an improved facility shared with other households. Only around 8.0 per cent are practising unimproved sanitation facilities that include flush or pour flush to an 'open drain, pit latrines without a slab, hanging latrines and bucket latrines.' \nNevertheless, according to the survey report, only 4.3 per cent of households in Bangladesh are connected to a sewer line, indicating that a lot of work needs to be done in this regard to improve overall sanitation. Generally, households not connected to a functioning wastewater sewer generate wastewater, and the excreta mostly end up in water bodies through either inefficiently built and improperly managed septic tanks or pit latrines, causing groundwater contamination, or via storm drains, which in turn contaminate open water bodies. In Bangladesh, around 76 per cent of households safely dispose of excreta in situ through improved on-site sanitation facilities, according to the MICS 2025 released last week. A recent study (Journal of Water, Sanitation and Hygiene for Development (2025) 15 (4): 287-304) found that a lack of knowledge about sewer connection procedures and perceived low risks of disease transmission are two significant barriers at the individual level to adopting sewer connection. Moreover, complex administrative processes, high installation costs, bureaucratic delays, inadequate support from DWASA, and outdated infrastructure are organisational-level barriers to this. So, it is time to overcome the obstacles in a well-planned manner to connect toilets to a sewer line properly.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Toilet success, sewer failure",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/toilet-success-sewer-failure-1763736224",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 22, 2025 00:00:00  \n\nWhen I was growing up, going to the Ekushey Boi Mela felt like a full-day festival. It was not only a book fair; it was an event the whole family looked forward to. I remember clutching my parents' hands as we walked past colourful stalls, the smell of fresh paper mixing with the excitement of discovering new characters, worlds and stories. Those were the days when a new book could make my entire week.\nI still remember the joy of receiving books as presents. On birthdays or after final exams, whenever a relative gifted me a storybook, I felt as though they had given me a treasure chest. I would run my fingers over the glossy covers, stack them carefully on my bedside table and begin reading the moment the guests left. Books were not just \"things\"-they were companions, teachers, friends, and windows into the big wide world.\nBut over the years, as I look around at children growing up today, the landscape has changed dramatically. Instead of being excited about purchasing new storybooks, children are rushing to their phones. Instead of asking for storybooks, they ask for devices. Free time is spent on online games, YouTube Shorts, and, more recently, making Facebook reels. The excitement of opening a new book has been replaced by the dopamine hit of notifications and algorithm-fed entertainment.\nIt's not always the children's fault. Parents themselves read far less than they did in the 1980s and 1990s. Back then, a large portion of educated households engaged regularly in reading-newspapers, magazines, novels, and poetry collections. Today, that habit has shrunk sharply, replaced by smartphones that dominate our mornings, mealtimes, and nights. Children simply mirror what they see.\nIf we want our children to fall in love with reading again, we must lead the way. We need to bring books back into the home. Make fun and interesting storybooks available for children on tables, shelves, and bedsides. Let our children see that we are turning pages ourselves instead of scrolling. Books raised a generation with imagination, empathy, and curiosity. If we revive that culture, books can raise the next one too.\nAishi Dastidar \naadastidar08@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Back to books again, please!",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/back-to-books-again-please-1763736246",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-11-2025"
    }
]