[
    {
        "full_article": "Rival fronts in Bihar are settling their internal dynamics even as constituents negotiate seat sharing and individual parties choose their candidates for the two-phase Assembly polls, on November 6, 2025 and November 11, 2025. The National Democratic Alliance (NDA) has had relatively smooth sailing in seat sharing with the Bharatiya Janata Party (BJP) and the Janata Dal (United), or JD(U) taking 101 seats each. The Lok Janshakti Party (Ram Vilas) is contesting 29 seats, while six seats each will be contested by the Hindustani Awam Morcha (Secular) and Rashtriya Lok Morcha. The Mahagathbandhan or Grand Alliance of the Rashtriya Janata Dal (RJD), the Congress, the CPI, CPI(M), CPI(ML) and others is, however, struggling with conflicting claims over seat sharing and even leadership of the alliance. In the clearest manifestation of the BJP’s upper hand in the NDA, it will, for the first time, contest as many seats as the JD(U). The JD(U) had already lost its senior partner status in the alliance in 2020, but its leader, Nitish Kumar, continued at the helm as the BJP did not want to upset the apple cart. In 2025, the BJP appears more confident of being an authentic platform for the backward caste communities which considered Mr. Kumar as their key leader. Consequently, the BJP has indicated that Mr. Kumar may be replaced in the event of the alliance winning yet another term, beating anti-incumbency.The BJP’s strategy for primacy involves a combination of caste-based social engineering and a consolidation of horizontal identities such as youth, women, farmers and senior citizens. It is clever in accommodating caste interest groups, but is also using state resources in a brazen manner to offer welfare schemes that cut across caste. It is notable that the BJP, which decries subsidies, has designed schemes which are little more than ill-disguised efforts to purchase votes. A grant of ₹10,000 to start businesses has reached more than a third of women voters. Between the Congress and the RJD too, there is a cold war. As they enter the decisive phase of the battle, the two big parties appear to consider each other necessary but share little organic and emotional bonding. Their resolve and posture appear to fall short against the challenges. A formidable caste combination in Bihar is against the Mahagathbandhan, and the RJD has a past that continues to haunt it. The Mahagathbandhan is trying to match the NDA’s schemes by making undeliverable promises. Unfortunately for Bihar, the strategies of both alliance groups ring cynical than optimistic. Published - October 22, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Bihar\n                    \n                            /                      \n                        \n                        National Democratic Alliance\n                    \n                            /                      \n                        \n                        Rashtriya Janata Dal\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        Communist Party of India -Marxist\n                    \n                            /                      \n                        \n                        Communist Party of India\n                    \n                            /                      \n                        \n                        Communist Party of India-Marxist Leninist Liberation\n                    \n                            /                      \n                        \n                        Janata Dal (United)\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Caste\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        demography\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        senior citizens\n                    \n                            /                      \n                        \n                        welfare\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025",
        "headline_1": "Cold calculations: On rival fronts, preparing for the Bihar polls",
        "headline_2": "NDA and Mahagathbandhan are using schemes and promises to get votes",
        "link": "https://www.thehindu.com/opinion/editorial/cold-calculations-on-rival-fronts-preparing-for-the-bihar-polls/article70182665.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-10-2025"
    },
    {
        "full_article": "When the Taliban recaptured Kabul in August 2021, after two decades of insurgency, Pakistan viewed it as a tactical victory. Imran Khan, then Prime Minister, famously said the Afghans had “broken the shackles of slavery”. But the Taliban’s return emboldened the Tehrik-e Taliban Pakistan (TTP), which is organisationally distinct from, yet ideologically aligned with, the Afghan Taliban. Over four years, Pakistan, particularly the Khyber Pakhtunkhwa province bordering Afghanistan, has seen a dramatic surge in militant attacks. This year alone, at least 2,414 people were killed in militancy-related violence in Pakistan, according to an Islamabad-based think tank. Pakistan blames the Afghan Taliban for sheltering the TTP, better known as the Pakistani Taliban, and tensions escalated into full-scale cross-border clashes. On October 9, 2025, while Taliban Foreign Minister Amir Khan Muttaqi was visiting India, Pakistan carried out air strikes in Kabul, apparently targeting the TTP. These strikes triggered a week of cross-border attacks that left dozens dead, before a fragile Qatar-brokered ceasefire took effect.When the Afghan Taliban were waging an insurgency, Pakistan offered them refuge and support. Pakistan’s military establishment expected the Taliban to remain loyal once in power. But when the Taliban took over the reins in Afghanistan, the old patron-client relationship was replaced by state-to-state ties, with deep structural contradictions. The Pakistani Taliban, which oppose the merger of Pakistan’s tribal areas with Khyber Pakhtunkhwa, want their version of a strict Islamic code to be enforced and demand the release of TTP prisoners, drew inspiration from the Afghan Taliban’s triumph. The Durand Line, the colonial-era border, re-emerged as another flashpoint as Kabul has never recognised it. Besides, Pakistan’s decision to deport thousands of Afghan refugees strained ties further. What likely provoked the Pakistani establishment even more was India’s diplomatic outreach to the Taliban. By carrying out air strikes on Kabul in response to militant attacks, Pakistan appears to be setting a new precedent — holding Kabul directly accountable for cross-border militant attacks — in a move reminiscent of India’s doctrine of responding to terrorism with overwhelming force against Pakistan. Yet, the security crisis in Pakistan now engulfing its tribal areas is largely of its own making. For decades, it has followed a contradictory policy — fighting terrorism while harbouring terrorist/militant groups that were fighting its neighbouring countries. It backed the Taliban for over two decades, hoping that a Taliban-controlled Kabul would offer it strategic depth. That strategy has now backfired. If Pakistan believes that it can restore internal security by bombing Afghanistan, it is mistaken. Prolonged conflict and chaos will only deepen instability and strengthen insurgency. Published - October 22, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Afghanistan\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        Qatar\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        terrorism (crime)",
        "headline_1": "Turning tides: On Pakistan-Afghanistan tensions",
        "headline_2": "Pakistan cannot ensure internal security by bombing Afghanistan",
        "link": "https://www.thehindu.com/opinion/editorial/turning-tides-on-pakistan-afghanistan-tensions/article70186646.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-10-2025"
    },
    {
        "full_article": "From Iran, an example of power elite’s hypocrisy that’s replicated the world over\nDo as I say not as I do, is the classic authoritarian schema. Sometimes this double standard gets so naked that people’s tolerance, or gullibility, is breached. That’s what’s happened with Rear Admiral Ali Shamkhani, a top Iranian official and Khamenei confidante who led the crackdown on the Woman, Life, Freedom protests. A video of his daughter’s wedding has surfaced, where the bride, her mother and many attendees are without any headdress. To be clear, it’s the contrast with how Mahsa Amini’s life was taken for not wearing a hijab that makes the stylish strapless wedding dress in the video jarring.\nOf all the ruling elite’s hypocrisies, the ones inflicted on young persons are the worst. The freedom they confer on their own while pillorying its larger circulation serves a gatekeeping role. If its opportunities don’t get into broader circulation, privilege can keep reproducing seamlessly within the ruling class. Social mobility be damned. In India we have seen politicians decry English-medium education and Western culture while making sure their own heirs attend the choicest of rich countries’ institutions. In America MAGA leadership diverts MAGA grievances with harsh political attacks on the Ivy League, but continues its own family affair with the Harvards, Yales and UPenns uninterrupted. Taliban officials are known to treat their daughters to driving privileges and modern education, even overseas colleges.\nWhat are people to do? Every time govts invoke crisis to tell everyone to accept hardship for the greater good, check if there’s new austerity at the top too, and don’t stop asking what caused the crisis. Hierarchy is more insidious in the age of representation than in the ‘We rule because we are born to’ era. So folk have to be alert to ‘patriotism’, ‘tradition’, ‘merit’, ‘reform’…being weaponised against them. Elite hypocrisy is also excellent data – it can reveal what freedoms hold how much power.\n\n",
        "headline_1": "For them, not us",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/for-them-not-us/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-10-2025"
    },
    {
        "full_article": "A simple puzzle shows how our minds play tricks on us \nThere’s a simple puzzle doing the rounds on social media, which illustrates the selective process of our memories. \nIt consists of a square grid of various numbers that appears on the screen of your mobile phone. You are required to select any number of your choice. When you make your selection, you are asked to remember the number you have chosen. \nThe numbers are replaced by a pair of eyes at which you have to look as though you are undergoing hypnosis. Then the eyes disappear and the grid of numbers reappears. And – hey presto! – the number you chose has vanished as if by magic. \nA friend of Bunny’s instantly solved the mystery behind the missing number which had been chhoo-mantar-ed as though by a sorcerer.\nShobha pointed out that the way this ‘magic’ trick works is very simple. When, as told, you focus on a single number, you remember only that number and no others on the grid. \nSo when the grid reappears, you don’t realise that all the numbers on it have been changed. Which means that whichever number you chose will mysteriously have disappeared. \nLike RAM, random access memory, in computers our minds are programmed to contain information fed into them and ignore peripheral data, which are deemed to be unnecessary or irrelevant. \nThis focusing, or selective processing, of the mind is why we have that common experience of recalling the same incident we witness along with others very differently from the way the others who were present remember it. \nThe Japanese film classic, Rashomon, directed by Akira Kurosawa in which different characters describe the same incident in very different ways reveals the selective subjectivity of what we call reality.  \nIf our individual memories are programmed to be selective in what we recall and what we blank out, that collective memory of ours that we call history, is perhaps even more selective in what it chooses to remember and what it chooses to forget. And it’s becoming even more picky and choosy in its selectiveness. \nThe Mughals? Who dat?\n\n",
        "headline_1": "Mirage of memory",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/mirage-of-memory/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-10-2025"
    },
    {
        "full_article": "India’s growing its role in data centre market, but it must augment water availability first\nMonday’s outage at Amazon Web Services is a reminder of the cloud’s earthly nature. You can ‘dematerialise’ your songs, movies, photos, identity, friendships, bank accounts, games and whatnot, but they still reside as zeroes and ones somewhere on physical servers in physical data centres. And there are thousands of these data centres – around 12,000 globally – already in the 33rd year of the internet’s public release. That’s a double-edged sword. The good that these pillars of the internet do is well-known. UPI payments, for example, won’t be possible without them. But their growing scale is increasingly drawing attention to the harm they are capable of.\nLike the human brain – which accounts for about 20% of your body’s energy use at rest – data centres are terribly energy-hungry. The more demanding a task – like generating an AI video from text prompts – the more energy they consume. And while doing so, they produce massive amounts of heat that could cripple them. So, all data centres consume megawatts of electricity, and millions of litres of water for cooling, which is a scarce resource. That’s why in US, which houses about half the world’s data centres, proposals to build new ones are being greeted with protests as people in their vicinity face supply shortages.\nWhile India is a small player relative to US – who isn’t? Even China is at roughly 10% the size – it aspires to increase its share rapidly. Google’s announcement last week of a $15bn investment over five years is a step in this direction. Indian data centre capacity is likely to grow by around 80% between 2024 and 2027. Data centre water consumption, meanwhile, looks set to jump from 150bn litres in 2025 to almost 360bn litres in 2030. But you can’t cool these centres with ordinary river water – it has to be of potable quality. Since no Indian city currently has enough water round the year even for residents, either data centres or the people will have to remain thirsty. Unless, massive investments are made in improving civic water supplies starting now.\nData centres will only increase, and India needs more of them for national security and citizens’ data safety. In the long term, technology might reduce the water requirements of these centres, and they might be able to run on grey water – processed sewage – but for now, speedy water supply augmentation is necessary.\n\n",
        "headline_1": "Thirsty data",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/thirsty-data/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-10-2025"
    },
    {
        "full_article": "Tinkering with I-T and GST rates is paying off, but won’t push GDP into higher orbit without deeper reforms\nBy all accounts, it’s been a happy Diwali for India Inc. White goods and cars have seen brisk sales since GST 2.0 kicked in on the first Navratra in late Sept. On Dhanteras, Maruti reportedly delivered 51,000 cars – roughly 35 every minute, and a record. Hyundai was expecting 20% sales growth over last year the same day. Cars sit near the top of the consumption pyramid, so if they’re selling, demand for mithai, groceries, furniture and clothes likely shot up too. We’ll know for sure when the numbers come in, but so far, GST 2.0 seems to be working.\nIt had to. By slashing tax rates on most goods, govt made space for price cuts. Industry wisely passed on the rebate, and the result was a timely boost to purchasing power. For a while at least, people will feel richer and buy more. In fact, GST cut is the second such stimulus this year. The first came in April with the reworked income tax slabs that left substantially more cash in people’s hands.\nIf everything runs to script, spirited festive spending – and sustained demand thereafter – will nudge industry to hire more hands. New jobs will create more demand, and growth will finally take off. Govt’s sacrifice of direct and indirect tax revenues will then pay off handsomely for the country. But what if it doesn’t? What if this market cheer turns out to be an expression of pent-up demand from Aug-Sept that tapers off post-Diwali? There isn’t much more that govt can do to put money in people’s hands now. RBI has already lowered rates this year, and sees no point in lowering them further at this stage.\nFrankly, the easy and obvious options have been exhausted. And while one hopes they will work, it’s important to get back to the drawing board for deeper reforms. For the second consecutive year, India looks set to grow at around 6.5%, which is better than any other large economy, but well below the 8% rate experts have prescribed for years, and far removed from the 12.2% rate that Morgan Stanley has calculated to address India’s problem of underemployment. Making exports competitive, finding new markets for them, increasing innovation, tackling unemployment, fixing infrastructure – there’s so much that needs doing to make next Diwali even brighter and happier.  \n\n",
        "headline_1": "For A Happier Diwali",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/for-a-happier-diwali/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-10-2025"
    },
    {
        "full_article": "The joint appeal by six international human rights organisations to Chief Adviser Professor Muhammad Yunus—calling for an end to arbitrary arrests and detentions—deserves a proper response from the interim government. The letter urges immediate action to prevent such arrests and to review and withdraw cases deemed politically motivated or infringing on freedom of expression and other fundamental rights. It is worth recalling that the law adviser has, on multiple occasions, acknowledged that individuals have been falsely implicated in criminal cases, often as a result of political vendetta or personal disputes. He assured us that the government would review these cases and release innocent individuals. However, no significant progress has been made in this screening process, and a substantial number of people, including journalists, continue to languish in prison without due process.\nWe, therefore, fully endorse the rights groups' observation that the government should uphold press freedom and protect journalists from arbitrary arrests and detention, regardless of their perceived political affiliation. Of particular concern here is the continued detention of journalists on fabricated charges, including murder, amid scant progress in investigations conducted over the year. Charging individuals without credible evidence and repeatedly denying them bail on flimsy grounds undermine the core principle of justice that everyone has a right to be treated as innocent until proven guilty.\nThe joint letter also emphasises the need to strengthen state institutions to guarantee free and fair elections and to prevent democratic backsliding. It aptly calls for not restricting freedoms of association, assembly, and expression. These propositions are simple yet essential for holding any credible electoral process.\nIt should be mentioned that these leading rights groups have long supported the people in their struggle against autocracy and in pursuit of a just and democratic society. During the previous autocratic regime, these organisations stood in solidarity with them despite obstructions, including travel bans, surveillance of their partner organisations, and defamation. Some met Professor Yunus at home and abroad, expressed their support for his government's reform initiatives, and encouraged ensuring accountability for abuses committed by state and non-state actors both before and after the August 5 political changeover.\nTheir joint letter reiterates their support for the accountability process initiated by the interim government and calls on the military to respect the authority of the International Crimes Tribunal (ICT). It also urges security-sector reforms, including the disbanding of the Rapid Action Battalion (RAB), the exclusion of military personnel from civilian law enforcement, and the clear limitation of the DGFI's role to military intelligence with defined operational boundaries.\nWe hope the government will treat these constructive suggestions with the seriousness they warrant and critically assess its human rights performance over the past 14 months. It must also disclose the outcome of its review process and clarify how many innocent individuals, if any, have been released from wrongful detention.\n",
        "headline_1": "Persistent rights concerns demand scrutiny",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/persistent-rights-concerns-demand-scrutiny-4015596",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-10-2025"
    },
    {
        "full_article": "It is most unfortunate that the migration sector continues to be dominated by middlemen despite there being proper government channels for recruitment. According to a recent study by the Ovibashi Unnayan Karmi Programme (OKUP), workers are paying exorbitant fees as most of them migrate through informal channels. Among the 1,084 workers surveyed by OKUP in eight migration-prone districts, 56 percent relied on informal or illegal agents to facilitate their migration to the Gulf countries, while only seven percent reported using licensed recruiting agencies. This highlights the grim reality of the limited accessibility of formal recruitment channels, particularly in rural areas.\n\nWorkers have long migrated to Gulf countries under the \"free visa\" system without any job guaranteed before departure. While the government-fixed average cost for migration to the Middle East is Tk 116,224, workers with free visa have to spend around Tk 499,802 on average. And despite paying nearly five times more than the government-approved cost, 43 percent fail to find work after reaching the destination countries, while many must spend additional money to obtain work permits.\n\nReportedly, a total of 938,000 workers migrated to the Middle East in 2022. Of them, 57 percent obtained work permits upon arrival, while 21 percent, who initially failed to secure employment, spent an extra Tk 150,000 on average to acquire work permits (iqamas). The OKUP study estimated that Bangladeshi migrants in Gulf countries lost about Tk 30,000 crore in 2022 alone due to unethical and fraudulent recruitment practices under the free visa system.\n\nAnother alarming finding is that 72 percent of respondents took loans to cover migration costs, while 11 percent mortgaged their land and six percent sold it. And many of those who returned home without finding jobs were unable to recover their mortgaged land. All this is deeply concerning. Migration experts note that there is no such thing as a \"free\" visa; under ILO conventions, workers cannot be sent abroad without an employment contract. Yet, many Bangladeshi migrants go without one, leaving them vulnerable to all sorts of exploitation.\nWe urge the government to take concrete steps to make legal labour migration more accessible and protect our workers from exploitation through strict measures. The recruitment process must be transparent and accountable. Experts also emphasise the need for skill training to prepare our workers for better opportunities abroad. With Saudi Arabia's recent abolition of the Kafala system, we hope the recruitment process for that country will be easier now, while the hardships faced by our workers will be reduced.\n",
        "headline_1": "Legal labour migration for all workers is crucial",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/legal-labour-migration-all-workers-crucial-4015411",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-10-2025"
    },
    {
        "full_article": "Earlier in April this year, when the Bangladesh Investment Development Authority (BIDA) organised the Bangladesh Investment Summit 2025, people expected investment to rise overnight. But it did not quite happen. Because what BIDA did was investment promotion, not facilitation. Investors focus on three things: price, predictability, and procedure—and facilitation directly addresses these core concerns, not promotion alone.\nWhile investment promotion is about encouraging investors to come through tax holidays, special zones, or marketing, investment facilitation is about helping investors once they decide toattend summits and invest. What Bangladesh urgently needs now is investment facilitation—the support investors require. Facilitation is about solving real problems on the ground.\nGlobally, governments focus more on investment promotion than facilitation. A 2017 United Nations Conference on Trade and Development (UNCTAD) study found that between 2010 and 2016, only 20 percent of investment measures targeted facilitation, while 80 percent focused on incentives, special economic zones (SEZs), and investment promotion agencies (IPAs). Bangladesh follows a similar trend; its policies are among the most liberal in South Asia, showing strong openness to foreign capital. Yet, despite these favourable conditions, foreign direct investment (FDI) has not matched expectations. This shortfall stems not from a lack of investor interest but from persistent legal, institutional, and operational barriers.\nAnother recent study by the Centre for Policy Dialogue (CPD), based on the UNCTAD Action Menu for Investment Facilitation, highlighted that investment facilitation encompasses a wide range of measures designed to make investment processes more transparent, efficient, and predictable for both domestic and foreign investors. It identified six key aspects to assess facilitation performance: (i) regulatory transparency and predictability, (ii) electronic governance, (iii) focal point and review mechanisms, (iv) application process efficiency, (v) inter-agency cooperation, and (vi) responsible business conduct and anti-corruption enforcement.\n\nThe on-ground reality indicates a mixed and uneven investment facilitation ecosystem in Bangladesh. If we take a look at the status of investment facilitation in the country, it can be noted that regulatory transparency and predictability are not ensured across sectors. Although laws and transparency mechanisms exist, information is scattered, poorly localised, and often inaccessible. Investors face difficulty understanding procedures and identifying the correct contact points. Across sectors, policy inconsistencies, conflicting interpretations, lack of transparency, and abrupt procedural changes have created an environment of uncertainty that discourages investment.\nFor instance, in the power and energy sector, the interim government's decision to discontinue the unsolicited process, introduce open tendering, and abruptly halt projects came despite investors already receiving the \"go-ahead\" and committing resources. To ensure predictability, policies should remain consistent across regimes, with gradual, well-notified changes. Investor confidence depends heavily on perceptions and market signals; therefore, the government must consider how its decisions shape those perceptions.\nElectronic governance is at a poor to nascent stage, with partial and non-functional online systems. Most processes across sectors remain manual or only half-digitised. Investment portals, e-payment systems, and online document submissions are often incomplete or difficult to use. Websites are not user-friendly in design or functionality, reflecting a lack of understanding of user perspectives and limited institutional willingness to improve.\nDespite substantial spending, many digitisation initiatives have turned into opportunities for rent-seeking rather than reform. Consequently, investors still visit offices physically and face confusion as different authorities demand varying sets of documents. Moreover, online platforms generally lack effective grievance redress and feedback mechanisms. Thus, digital systems exist but yield little benefit for investors. Ministries managing digital platforms should actively seek user feedback and adapt systems accordingly, learning from global best practices. Recently, BIDA expanded its online One Stop Service (OSS) platform to include land registration services and introduced relationship managers from the private sector as focal points. It has also shown responsiveness to the recommendations of CPD's action guide for investment facilitation in the renewable energy sector.\n\nFocal point mechanisms are minimal and fragmented. From an investor's perspective, focal points are vital for identifying both the right organisation and the specific department or official to contact. In Bangladesh, investors often navigate multiple agencies with little guidance. Even when focal points are established, they are rarely empowered to coordinate across institutions. Without sufficient authority, accountability, and established coordination mechanisms, these arrangements become ineffective.\nA recent notable initiative is BIDA's introduction of a dedicated team of relationship managers drawn from the private sector to guide investors throughout their journey—from information-seeking to industrial setup.\nFurthermore, application processes are opaque and inconsistent across sectors. During both the business establishment and project implementation phases, investors need multiple licences and approvals. As e-governance is weak, application procedures are not user-centric. Many online forms lack features such as automatic notifications for incomplete submissions or real-time application status updates. Clear timelines are rarely stated, and inter-agency cooperation is inadequate, forcing investors to submit the same documents repeatedly to different offices. Consequently, application processes remain slow, inconsistent, and unpredictable.\nInvestors should not be left in uncertainty. Clear instructions, timelines, notifications, and regular updates on application status must be ensured. Reducing these uncertainties will make the process simpler, more predictable, and more comfortable.\nCooperation among agencies is limited and still developing. Establishing a business or project requires approvals from several authorities, ministries, regulatory bodies, and BIDA, but poor cooperation prolongs timelines and increases costs. Investors often invest in land or take loans before approvals, and delays directly affect project expenses. BIDA should serve as the central coordination mechanism and the driving force for investor facilitation, as it holds the mandate to manage investor relations and perceptions. It should lead and ensure that investors can access sector-specific guidance without redirection. Government agencies under different ministries should be service-centric and open to cooperation with BIDA and sectoral nodal agencies.\nResponsible business conduct and anti-corruption mechanisms exist but are not effectively practised. Bangladesh has ratified international conventions and aligned its legal frameworks with global standards, yet enforcement remains inconsistent. Given that the country will be under greater scrutiny in the international market, following standards and best practices is crucial to gain investor confidence.\nTo unlock the potential of foreign direct investment, Bangladesh must adopt a phased and concrete reform agenda addressing both structural and procedural bottlenecks. Reforms should be feasible within existing institutional arrangements and designed to strengthen predictability and investor trust. However, BIDA's engagement is necessary but not sufficient. Ministries and agencies responsible for different sectors must act with equal enthusiasm and coordinate closely with BIDA.\nFor reforms to succeed, a collaborative, transparent, and investor-friendly approach is critical for Bangladesh to attract foreign investment, create jobs, and advance its sustainable energy transition.\nDr Khondaker Golam Moazzem is research director at Centre for Policy Dialogue (CPD).\n\nAbrar Ahammed Bhuiyan is programme associate at CPD.\nViews expressed in this article are the authors' own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Bangladesh must shift from investment promotion to facilitation",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/bangladesh-must-shift-investment-promotion-facilitation-4015291",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 22, 2025 00:00:00  \nThe function of any regulator is to ensure that the stakeholders concerned follow the set of rules that guides their activities and does not fall afoul of it. Also, it holds those breaking the rules to account and, at the same time, ensures the overall quality of the professional output. But if the regulator becomes too bureaucratic about its job, then it turns into a barrier to, not a facilitator of, the profession in question. \nAccording to reports, that is exactly what happened in the case of the Financial Reporting Council (FRC) established under the Financial Reporting Act (FRA), 2015 and responsible for overseeing and regulating financial reporting. But of late, the FRC is learnt to have become a veritable hurdle to the auditing profession as it has been sitting on the completion and renewal process for enlistment of practitioners in the auditing profession. The delays in enlistment/ renewal of auditing firms and auditors have not only been disrupting professional careers of the practitioners, it is also affecting the entire professional ecosystem of auditing negatively. But it should not have been the case given that there are clear-cut provisions under the FRA as well as the Auditors Enlistment Rules (AER) 2022 to conduct the job. On the contrary, as alleged, enlistment of a number of chartered accountant (CA) firms as well as individual auditors has been held back as they, according to the regulator have compliance issues vis-à-vis FRC rules or that all partners of the CA firms in question are not individually enlisted. But the argument is a matter of interpretation of the rules under FRA, 2015. However, such delay in enlisting the firms embroiled in regulatory interpretations runs the risk of disrupting the continuity of the CA firms and individual operators of the profession as they have to enlist/get renewal 10 days before the end of the financial year. In the present case, they were to finish their enlistments and/or renewals before June 2025.\nBut it is already more than three months into the new financial year FY26, yet the auditing firms or individual professionals in question are still unsure about their fate. In consequence, these firms/individual practitioners are not able to conduct their work that includes appointment of auditors by the firms under scrutiny. This has a negative impact on the economy in general that it obstructs the incomes of the auditors and the auditing firms and, in consequence, the state is deprived of its revenues that it earns by imposing taxes on those firms' incomes. That's simply not done. In fact, the regulator in the present case is acting more like a traditional bureaucrat than a facilitator of the auditing profession. True, there are instances where allegations that anomalies and violations of securities rules were detected in the financial statements of business entities audited by certain CA firms with the result that the Bangladesh Securities and Exchange Commission (BSEC), which is also a regulator of auditing companies and individual auditors held them to account. In fact, according to the Securities and Commission Rules, 2020, any firm and its auditors are separately and jointly liable for anomalies identified in financial statements audited by them. \nUnderstandably, allegations of such professional misconduct by certain operators in the trade have created an atmosphere of mistrust in the profession that might have negatively impacted the outlook of the regulators including FRC. In this connection, some experts have expressed their reservation about the existence of multiple authorities to oversee the business of auditing that include, for instance, FRC, the Institute of Chartered Accountants of Bangladesh (ICAB) and BSEC, each of which has its own set of enlistment procedure. Now the government should play the role of creating a unified authority to streamline as well as speed up the enlisting and renewal process of the auditing firms and individual practitioners.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Creating unified regulatory authority for auditors",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/creating-unified-regulatory-authority-for-auditors-1761062431",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       October 22, 2025 00:00:00  \nIn the absence of studies on the performance of the social safety net programmes (SSNPs), there's a common belief that despite their inherent challenges, they play a significant role in preventing a general decline in poverty rates and supporting specific sectoral activities.\nIntroduction of SSNPs, despite their drawbacks, is a great respite for many households across the country. Although there has been effort to expand the programmes to various vulnerable groups, and no doubt, this has been achieved to some extent, there are still large segments of the eligible population not covered by the programmes. Given the existing coverage, mismanagement is commonly alleged for less than desired delivery of the programmes which, needless to say, include corruption, nepotism, absence of proper monitoring etc.\nThe previous government was quite upbeat about the success of the programme. However, little effort was visible in making it work better to reach out to the target groups. It is often alleged that wrong targeting is a major impediment to the success of the programme. One may find it strange to see government employees' pension scheme also counted as part of the SSNs. Some 27 per cent of the allocation under social safety net schemes goes for government employees' pension, meaning the true allocation for the poor is far less than what is available on paper. \nPresently, the government runs well over a hundred programmes under SSNs, but corruption and misuse of funds are reportedly plaguing the operations. Moreover, although the allocation has increased over the years, it has been found to be still far less than what it should have been in terms of standard practices followed elsewhere.\nRecent discussions highlight Bangladesh's comparatively low expenditure on SSNs as a percentage of GDP, underscoring the need for increased investment in the programme. At a seminar on social protection strategy held in the capital recently, it transpired that Bangladesh was spending less than half of what other countries spend as a percentage of their GDP. Most middle-income countries spend between 6.0 to 8.0 per cent of the GDP on social safety net programmes as against little over 2.0 per cent of GDP in Bangladesh.\nThe major social safety net programmes in Bangladesh can be divided under four broad categories: (i) employment generation programmes, (ii) programmes to cope with natural disasters and other shocks, (iii) incentives provided to parents for their children's education, and (iv) incentives provided to families to improve their health status. The SSNs can also be grouped into two types depending on whether they involve cash transfers or food transfers. Of the roughly 145 SSN programmes currently being implemented by 23 ministries, a large number suffer from overlapping in various forms, because of lack of coordination and monitoring of progress in a proper manner. Transparency and accountability thus remain the major problems. Revisiting the SSNs in order to render them time-befitting is thus crucial.\nThe interim government has, of late, decided to review once a year the benefits provided under cash-based social safety net (SSN) programmes in line with the Consumer Price Index (CPI). The decision to link benefits with inflation is thus a welcome initiative. But it must be part of a broader, sustained reform agenda that focuses on efficiency, transparency, and proper targeting. Only then can the social safety nets fulfil their promise of protecting the poor and vulnerable while advancing the country's goal of equitable growth.\nThe Centre for Policy Dialogue (CPD) at a webinar held some time ago, recommended for bringing all social safety net programmes under a single umbrella in order to move from the social safety network to social security. Given a high level of food price inflation and a rise in the living cost, the CPD suggested that the government increase the amount of allowance to Tk 1,000 and coverage by 20 lakh elderly, widows and marginalised women all over the country. The think tank also suggested that the government consider increasing the coverage of urban-based destitute people by raising the allocation targeting slum dwellers, floating people, pregnant women and similar marginalised groups. 'Digitisation of the database with national identification number or other national documents for proper targeting of the beneficiaries will reduce mistargeting and corruption and complexities,' it said. Alongside reforming the modus operandi of the SSN programmes, it has also been suggested that the government should provide additional support for subsidised credit programmes for the agriculture sector---both crop and non-crop---to incentivise production.\nMoving forward, SSNs must remain a focal point of government planning. It is crucial not only to allocate adequate funds but also to enhance programme efficiency. In so doing, it is important to prepare a detailed database of the number of people living below the poverty line, which will help the stakeholders involved in understanding the needs of different target groups and strategise result-orientated plans. Improved management of the schemes through efficient use of resources and plugging the loopholes in the distribution process is crucial to making the social safety nets more effective. It is also important to strengthen monitoring and supervision of the implementation process to make the schemes more accountable and transparent.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Reassessing social safety  net programmes",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/reassessing-social-safety-net-programmes-1761062513",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 22, 2025 00:00:00  \n\nArtificial intelligence has slipped into our lives almost unnoticed, yet it's reshaping nearly everything we do. From the moment we wake up and scroll through personalised news feeds to the moment we finish our day's work with AI-generated emails or reports, the machine is always there, quietly guiding our choices. It plans our campaigns, drafts our documents and even designs our visuals. It's efficient, tireless, and undeniably useful.\nBut beneath this comfort lies an uncomfortable question: as AI grows smarter, are we becoming less so?\nThis isn't another story about data privacy or hacking scandals. The concern runs deeper and far more personal. It's about the quiet fading of something uniquely human---our creativity.\nCreativity is messy. It thrives on mistakes, uncertainty, and the courage to try again. It's the thrill of discovery when a rough sketch suddenly turns into a great idea, or when a dozen failed drafts finally lead to one perfect line. Every artist, writer, or designer knows that struggle, it's what gives a creator's work life.\nNow, that struggle is vanishing. Instead of wrestling with ideas, we simply tell a machine what we want, and in seconds it gives us a finished product which is polished, detailed and eerily flawless. The temptation is obvious: why labour over something when a programme can do it faster? Yet the more we let AI think and create for us, the less we use the muscles that make us truly creative.\nThe old motto \"work smarter, not harder\" once meant finding clever ways to be efficient while keeping your imagination intact. Today, \"working smarter\" often means letting AI do the work entirely. Somewhere along the way, we've started confusing convenience with creativity.\nThe problem isn't technology itself rather it's our growing dependence on it. AI should be a collaborator, not a replacement. When used thoughtfully, it can expand our reach and spark new ideas. But when we let it dictate the creative process, we risk becoming spectators instead of creators.\nThe real threat isn't that AI will outsmart us. It's that we'll stop trying to outthink it. If we keep choosing convenience over curiosity, perfection over passion, and speed over soul, we'll end up living in a world that's efficient but emotionally empty. Innovation was meant to enhance humanity, not erase it. As we move further into this AI-driven future, the true challenge won't be how quickly machines can learn, but how bravely humans can still imagine. Because once we lose the desire to create with our own hands and hearts, the world may keep running; but it will feel far less alive.\nRamisa Rahman Shitu\nfreyapatterson06@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "When AI numbs human intelligence",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/when-ai-numbs-human-intelligence-1761062540",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 22, 2025 00:00:00  \n\nThe devastating fire at Hazrat Shahjalal International Airport's Cargo Village exposes a grave lack of safety measures and mismanagement in handling hazardous goods. Unlike international airports, Shahjalal's Cargo Village lacks automated fire detection and protection systems. Flammable chemicals, perfumes, sprays, spirits, and even explosives have been illegally stored with general goods in the customs warehouse for years, creating an enormous safety hazard.\nSuch dangerous materials should be kept in temperature-controlled, isolated warehouses following international standards. The slow customs clearance process has worsened the situation by causing congestion and unsafe storage practices. The fire serves as a dire warning of what can happen when negligence and outdated systems persist. Urgent action is needed to modernise the cargo handling and fire safety systems to prevent future disasters and ensure the safety of airport workers and nearby communities.\nAshikujaman Syed\nsyedashikujaman@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Enhance fire safety measures",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/enhance-fire-safety-measures-1761062563",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-10-2025"
    }
]