[
    {
        "full_article": "Judging by the statements and readouts from both sides, Chinese Foreign Minister Wang Yi’s two-day visit to India this week was extremely productive. While Mr. Wang was in Delhi at the invitation of NSA Ajit Doval for the 24th Special Representatives talk on the boundary question, he also met External Affairs Minister S. Jaishankar for bilateral talks and the normalisation process after the four-year military standoff at the Line of Actual Control. Mr. Wang was also received by Prime Minister Narendra Modi who said that he would travel to Tianjin for the Shanghai Cooperation Organisation (SCO) meeting. Mr. Modi will meet with Chinese President Xi Jinping. In Delhi, India and China agreed to resume border trade at three points, restart direct flights, expand the Kailash Manasarovar yatra slots for pilgrims and relax visas. While there were positive discussions on the lifting of export restrictions by China on fertilizers, rare earth products and boring machinery, it is unclear whether there was headway on China’s demand that India lift its scrutiny of Chinese FDI in Indian companies. The two sides agreed to expedite the process of boundary resolution of the 3,500 km India-China border. Significantly, the Modi government agreed to build on the 2005 agreement of Political Parameters and Guiding Principles for the Settlement of the India-China Boundary Question. Meanwhile, the Chinese Ambassador Xu Feihong said that China opposes the U.S.’s “bully” move of imposing 50% tariffs on India.The outcomes indicate that Delhi has decided it can now “move ahead” from the PLA transgressions, Galwan clashes and the standoff. While Mr. Doval said that the “borders have been quiet”, the government was made uncomfortably aware that even with a stable border, other long-standing problems will continue to shadow ties. Mr. Wang later left for Kabul to work with Pakistan and the Taliban on a plan to extend the BRI and China-Pakistan Economic Corridor — India is opposed to both — into Afghanistan. He then flew to Islamabad for a strategic dialogue with his Pakistani counterparts. China’s diplomatic support to Pakistan after the Pahalgam attacks and during Operation Sindoor did not come up during Mr. Wang’s visit, but provide an ominous overhang to ties, as did Ambassador Xu’s contention that Pakistan too is a victim of terrorism. While the U.S.’s attack on Indian trade and economy may be spurring New Delhi’s efforts, the reset with China must not come from a perceived position of weakness, and the next steps must be taken keeping in focus the strategic challenge.READ MORE Published - August 23, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        China\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        India-China\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Iran\n                    \n                            /                      \n                        \n                        air transport\n                    \n                            /                      \n                        \n                        religion and belief\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        fertiliser\n                    \n                            /                      \n                        \n                        rare earths\n                    \n                            /                      \n                        \n                        foreign investment\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        Belt and Road Initiative\n                    \n                            /                      \n                        \n                        Afghanistan\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025",
        "headline_1": "​A productive visit: On India-China ties",
        "headline_2": "India and China seem ready to put behind the memory of Galwan clashes",
        "link": "https://www.thehindu.com/opinion/editorial/a-productive-visit-on-india-china-ties/article69965402.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "23-08-2025"
    },
    {
        "full_article": "Mistakes and misinterpretations must not be confused with cases of malicious misinformation. The filing of FIRs against a researcher associated with Lokniti, a programme of the CSDS, and the Indian Council of Social Science Research (ICSSR)’s show cause notice to the CSDS, represent yet another troubling chapter in the recent erosion of academic freedoms in India. The trigger seems to be a post on X by Lokniti co-director Sanjay Kumar, which had erroneous data about reductions in the electoral roll in some constituencies in Maharashtra. Expressing regret, Mr. Kumar deleted the post. Yet, the BJP governments in Maharashtra and at the Centre have weaponised what is a mistake to launch broader attacks on the institution, despite the post having no connection to the Opposition’s allegations about inflated electoral roll numbers during the 2024 Maharashtra Assembly elections. The ICSSR’s insinuations about the CSDS-Lokniti’s funding arrangements echo the treatment meted out to other premier institutions. The Centre for Policy Research faced tax surveys that resulted in the cancellation of its foreign funding licence and tax-exempt status. This targeting suggests a coordinated effort to silence independent research voices rather than address administrative concerns. Such acts have led to India’s ranking falling to the bottom 20% among 179 nations in the 2024 Academic Freedom Index published by the V-Dem Institute.Institutions such as CSDS-Lokniti serve a vital democratic function by conducting empirical research that helps understand policy implications. Through its National Election Studies and comprehensive data archive, Lokniti has helped transform the study of Indian politics to one based on rigorous, large-scale empirical inquiry. Its survey on the verification documents listed by the ECI during its Special Intensive Revision exercise in Bihar, among voters across five States and one Union Territory, exemplifies this. Rather than acknowledging the finding that the availability of such documents is rather low among a large cohort of voters in India, and places onerous burdens on voters in the event of a country-wise SIR, the ICSSR has characterised this research as an attempt to malign the ECI. How can policy effectiveness be assessed without rigorous empirical investigations such as well-designed and transparent opinion surveys? The current government has also undermined its own statistical apparatus. The delayed Census and suppressed statistical surveys point to discomfort with independent and critical analysis. As India navigates complex development challenges, it desperately needs the kind of critical feedback and evidence-based analysis that institutions such as the CSDS provide. Silencing these voices through administrative harassment and funding restrictions serves neither good governance nor national interest.READ MORE Published - August 23, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        election\n                    \n                            /                      \n                        \n                        Maharashtra\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Maharashtra Assembly Elections 2024\n                    \n                            /                      \n                        \n                        research\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        population and census",
        "headline_1": "Targeting research: On the silencing of independent research voices",
        "headline_2": "Attacks on research institutions reflect India’s declining academic freedoms",
        "link": "https://www.thehindu.com/opinion/editorial/targeting-research-on-the-silencing-of-independent-research-voices/article69965733.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "23-08-2025"
    },
    {
        "full_article": "The humble audio cassette deserves a second audition\nTaylor Swift’s new album will be out on tape also. It boggles the mind. TDK, Maxell, T-Series, does anyone make cassettes anymore? And tape’s a screechy, low-quality medium. Even its inventor, the late Lou Ottens, said, “People prefer a worse quality of sound out of nostalgia.” But it seems there’s a business case for tape. Gen Zers, who’ve not grown up spooling tangled tapes with a pencil, seem to like it as a collectible, perhaps. America’s buying about half a million cassettes every year.\nOn second thoughts, it’s a good thing. Despite audiophiles’ disdain for it, tape democratised music. Countries too poor to buy turntables fell in love with the two-in-one. Some 100bn cassettes sold worldwide. Tape gave new artistes a chance – pressing a thousand LPs wasn’t viable but with tape it didn’t matter whether you recorded one or a million. Big names didn’t like it though. At a congressional hearing in 1987, the chief complaint was that 300mn blank cassettes were sold in a year, as against 344mn pre-recorded ones. Cassettes made everyone a pirate. But those same big names used tape to ideate. A Michael Jackson tape with 12 unreleased tracks turned up not so long ago. The Beatles released their last “new” single in 2023 thanks to a demo tape John Lennon left behind “For Paul”. It couldn’t have happened had Jackson and Lennon made their demos on the cloud. Imagine! The tape is a gift that keeps giving.\n\n",
        "headline_1": "Tape Measure",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/tape-measure/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-08-2025"
    },
    {
        "full_article": "How one industry shapes cities, policies, even language\nIn 2021, Algeria became the last country to stop using a notorious petrol additive called tetraethyl lead (TEL). Countries where cars were mandatorily sold with catalytic converters had started banning it decades earlier. India did in 1999. Let the record show that leaded petrol was eliminated to save car exhausts, not people, although it was known to be a problematic chemical from the day it was poured into a sputtering engine in a GM lab in 1921.\nIn his book Saving Ourselves from Big Car, David Obst looks at the many ways ‘Big Car’ – which he describes as not only the big carmakers but also “oil, insurance, media, tyre, and concrete industries” working in concert – has impacted human life, with special emphasis on the additive. \nTEL was known to cause hallucinations in workers who made it, and later research has linked it to the pre-1990s crime rate spiral in US, the country with the maximum cars clocking the maximum miles. Seemingly, exposure to TEL lowered IQ in children, and their ability to delay gratification, which increased the likelihood of committing theft, rape, murder, etc. How was Big Car complicit in this? They knew some of TEL’s worst health impacts, but since it prevented engine knocking and backfiring, and made engines “purr”, they told lies to keep selling it.\nIt was an age when doctors sold their soul to Big Tobacco for a few dollars. Thomas Midgley Jr and Robert Kehoe were scientists in this mould. Midgley demonstrated the safety of TEL by rubbing it on his hands (he was violently sick afterwards) while Kehoe testified for $100,000 – about $1.8mn today – that the chemical was as safe as water. \nBig Car has only grown more powerful with time, Obst says. “The combined wealth of this collaboration is more significant than all sovereign nations, except US and China.” That’s why no amount of environmental reporting stops the construction of four-lane highways in the hills. There’s mountains of research showing that making roads and parking lots does not solve the urban congestion problem, yet new roads and flyovers keep getting sanctioned all the time. \nYou get a better idea of Big Car’s power from its financial clout. It employs over 3mn Americans to manufacture, distribute and service cars. Obst says the US car industry uses 20% of steel and 60% of rubber in the country. Car insurance alone is worth $300bn. America’s entire public transport expenditure comes to only $80bn whereas trillions are spent on maintaining the country’s 223mn cars. Things aren’t too different in other large car producing countries.\nAnd TEL isn’t the only stain on Big Car’s reputation. It resisted the installation of seat belts “because it would lower profit margins”. SUVs are extremely dangerous for pedestrians, but Big Car wants to sell more of them. It also keeps shaping our lives in unforeseen ways. Cars created suburban living, and made garages integral to houses. They popularised shopping malls and fast food – “people wanted to get back on the road quickly,” Obst explains. They’ve even standardised dialect – Americans listening to car radios for hours daily started sounding more and more like “network English”. This process has been on for 125 years already, and with the coming of electric and autonomous cars, we’re headed into uncharted territory.\n\n",
        "headline_1": "Free Will Is A Myth, The Truth Is Big Car",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/free-will-is-a-myth-the-truth-is-big-car/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-08-2025"
    },
    {
        "full_article": "What officials must & mustn’t do after SC order on strays\nCalling the 2-judge bench order on stray dogs “too harsh”, SC’s 3-judge review bench has restored status quo ante – strays are to be sterilised, vaccinated and released back to their locality. This settles the core issue. The new order, being scientific and practical, is wholly welcome. ABC rules, recently reasserted by GOI in a parliamentary answer, blend logic and compassion. Delhi-NCR’s municipal authorities should now step up their ABC efforts, for effective control of stray dog numbers. SC did well to ask for performance reports on ABC implementation.\nFor the review bench’s order to not create further conflicts between people and to not inflict cruelty on strays, two issues need to be clear. First, there’s an existing protocol on identifying ‘aggressive’ strays, a definition centred on incidents of dog bites and on evaluating the contexts of such incidents. Authorities need to strictly follow this protocol.\nSecond, civic bodies must work on three principles when it comes to identifying feeding areas for strays. One, feeders shouldn’t be obstructed – keeping strays hungry is neither good for public safety nor in consonance with the spirit of compassion that informs ABC rules. Two, a large number of dogs can’t be herded into one feeding area. That’s, again, an unscientific solution given dogs’ territoriality. Therefore, every municipal ward will need to have numerous feeding areas, each caring for a small number of stray dogs. Municipal officials already know this, they just have to make sure this logical and humane practice continues. Three, at local levels, any dispute should be addressed by officials working with relevant NGOs, a practice that’s been tried out successfully in Faridabad. Now that SC has reaffirmed ABC rules, all stakeholders must make them work – using both head and heart.\n\n",
        "headline_1": "Well Judged",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/well-judged-3/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-08-2025"
    },
    {
        "full_article": "Nearly one in five gamers worldwide is Indian. But while 591mn people in India play, the country contributes barely 2% to global gaming revenues. That’s because India’s market isn’t built on blockbusters or studios but powered almost entirely by online money gaming (OMG).\nIn 2024, ₹27k cr ($3.2bn) of the ₹32k cr ($3.7bn) Indian market came from these high-risk, mobile-first platforms. Globally, money games account for 40% of revenues; in India, they dominate at 85%. The picture is clear: India is mobile-first, revenue-light, and mostly playing with fire.\n\nRead full opinion on TOI+\n\n",
        "headline_1": "OMG! Don’t bet on bans",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/voices/omg-dont-bet-on-bans/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-08-2025"
    },
    {
        "full_article": "Ten women vying for top positions in the upcoming Dhaka University Central Students' Union (DUCSU) election is a welcome change for women's political participation in Bangladesh. Although women, especially students, have always been at the forefront of major revolutions, including the recent July uprising, their political leadership at the national level has long been undermined by the prevailing dynastic political culture, and most top positions have been held by men. Even the last two DUCSU elections, in 2019 and 1990, saw very few or no women contesting for top posts. And in independent Bangladesh, no woman has yet held the vice-president (VP) or general secretary (GS) position. Against that backdrop, this year's DUCSU election is significant: five women are competing for the VP post, one for GS, and four for assistant general secretary.\nHowever, the overall number of female candidates in both DUCSU and the Jahangirnagar University Central Students' Union (JUCSU) polls remains low compared to male candidates, although the final lists have yet to be confirmed. So far, 402 male candidates have been cleared for 28 DUCSU posts, compared to only 60 women. Similarly, for JUCSU's 25 posts, 276 nominations have been filed, of which only 57 are women. And of them, 43 are for six reserved seats for women. What is more disappointing is that no female candidate at JUCSU is running for VP. Although registered female voters in both universities are nearly equal in number to male voters, when it comes to actual political participation, women remain sidelined. Not surprisingly, student wings of major political parties reflect their parent parties' attitude towards female representation. For instance, the panels of Jatiotabadi Chatradal, Islami Chhatra Shibir, and Islami Chhatra Andolan have not nominated any women for DUCSU's top three posts. At JUCSU, the Jatiotabadi Chatradal- and Islami Chhatra Shibir-backed slates nominated female students only for reserved seats.\nWhile these party wings have failed to create space for women leaders, other factors also discourage female participation in campus politics. This is evident from the low number of nominations from female halls at Jahangirnagar University, leaving many posts uncontested at the female dormitories. According to a report in this daily, several female leaders from last year's mass uprising are absent from the JUCSU ballot. Many of them feel undervalued post-uprising. Cyberbullying, harassment, family restrictions, and a lack of inclusive, female-friendly campuses have also contributed to this disengagement.\nDespite the obstacles, Umama Fatema, SK Tasnim Afroz Emi and their comrades in the fight for female leadership are not backing down. We applaud their resilience and hope that, if elected, they will work to fulfil their electoral promises and help build an inclusive, non-partisan, safe campus for all students.\n",
        "headline_1": "Women eyeing top DUCSU posts sparks hope",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/women-eyeing-top-ducsu-posts-sparks-hope-3968471",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-08-2025"
    },
    {
        "full_article": "After many years, student union elections are going to be held in Dhaka, Jahangirnagar, and Rajshahi universities. This is a good development, and I hope the elections will be fair and free from violence or intimidation, and the students will be able to participate in them safely. If student unions in all universities are formed through credible elections regularly, genuine young leadership will be able to emerge in the country.\nHowever, public universities are currently facing numerous problems, and their credibility has been severely diminished. Those who still opt to study in public universities often worry about session jams, campus violence, quality of education, or whether classes and exams would take place properly. The trust that these universities once commanded has eroded, creating a wide gap between public expectations and present realities. We must identify the causes of this decline and address them.\nDuring the British colonial period, Dhaka University was established in 1921 as the first public university in present-day Bangladesh. In the Pakistan era, other big public universities were established: Chittagong University, Rajshahi University, the agricultural university (now BAU), the engineering university (now BUET), and Jahangirnagar University. After independence, particularly in the past two decades, many more public universities were established. In the early 1990s, private universities first came into being. At the same time, several colleges were upgraded into universities—Jagannath College to Jagannath University, for instance. As a result, the numbers of both public and private universities has increased significantly, though this rapid expansion has created serious concerns about their quality, role, and governance.\nThe core issue here is how public universities should function: what the role of teachers should be, how student activism should run, how students' rights and safety are preserved, how education and research should get proper priority. The history of public universities shows that much of this depends on the government: how it perceives universities, what role it plays, and what it wants from universities.\nStudent union elections in Bangladesh began in the early 1970s, though the first one was marred by violence. They resumed in the late 1970s, and during the 1980s, under Ershad's autocratic rule, several elections were held as students were united against military dictatorship. But after elected governments returned in 1991, both the BNP and the Awami League, when they came to power (along with Jatiya Party and Jamaat-e-Islami), sought to seize full control of the universities. They relied on two main instruments for that: installing a spineless administration by appointing compliant and subservient teachers to various posts, and by patronising their student wings to dominate residential halls and campuses through violence.\nWhichever party came to power, its student organisation gained overwhelming dominance while all other groups were silenced or marginalised. Among many teachers, a culture of obedience and opportunism developed in the process.\nThis reached its most extreme form under the Sheikh Hasina government. Vice-chancellors were appointed based on loyalty rather than merit, and many actively facilitated corruption, tender manipulation, extortion, and violence by ruling party student organisations. Universities, especially residential halls, became places of fear, while research and academic work were neglected. Many teachers competed for favour with the authorities instead of focusing on scholarship.\nAnother serious problem has been the increasing commercialisation in public universities. Many public universities introduced weekend and evening programmes that operate like private ventures, charging high fees. Teachers also began working at private universities. While supporting the privatisation drive, the World Bank argued that private universities would create healthy competition and raise standards of both. In practice, both public and private universities have been suffering due to substandard quality. Public university teachers have been diverting their time and energy to commercial programmes and working part-time at private universities, while many private universities—operating on a profit-driven model—have been relying mostly on part-time teachers to minimise costs. Students in both systems have been left without proper academic attention.\nIn fact, a combination of neo-liberal policy and violent authoritarianism has caused a disastrous effect on university operations. As a result, the country's higher education system has become increasingly driven by money rather than scholarship. It is true that a number of teachers enjoy financial comfort from these extra income opportunities, but the quality of teaching and research has deteriorated. Students in residential halls live under the domination of partisan leaders engaging in extortion and intimidation. Teachers, meanwhile, are distracted from research and academic development, focusing instead on personal gain or appeasing the authorities. The government appears content with this arrangement, investing heavily in construction projects that often serve as vehicles for corruption rather than academic progress.\nWhat is needed instead is a return to the original mission of public universities: to serve as the centres of learning, research, and free thought, dedicated to public interest rather than the ruling parties or private profit.\nTo overcome the present crisis, student politics must be revitalised in a creative and visionary manner. Student leaders need to play a constructive and responsible role to ensure desired changes in universities, especially public ones. Elections should not be about winning power alone but about rescuing public universities from decline. Students and teachers must agree on certain principles: universities should be autonomous, free from government interference, and supported only in their academic and research functions. Appointments must be based on merit, not political loyalty. Students must not be used to engage in extortion, tender manipulation, or violence. All forms of discrimination—class, gender, religious, and ethnicity—must be opposed. Public universities must remain public in character.\nIf the upcoming student union elections can inspire this shift, they may mark the beginning of a much-needed change. Genuine reform requires not only the courage of students and teachers, but also the awareness and support of the wider society. Moreover, the approach of the government towards universities must go through a fundamental change. They should leave universities to education and research, and not use them as an instrument for extending ruling party dominance through unwanted intervention, violence, and corruption.\nAnu Muhammad is a former professor of economics at Jahangirnagar University.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Student union elections: Rescuing the universities from decline",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/student-union-elections-rescuing-the-universities-decline-3968246",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 23, 2025 00:00:00  \nThe question of women's empowerment in society is critically linked to their inclusivity in the formal financial sector. That means, they are able to make decisions both in family and workplaces about the use of finance. From that point of view, the rate at which they are using the banking services including holding of deposit accounts with banks and other financial institutions provides an insight into how far the financial sector is becoming inclusive of women in Bangladesh. Similarly, the number of women borrowing from banks is yet another indicator of their financial independence based on their increasing ability to spend the money so borrowed in meeting family-related expenses or for business purposes. \nGoing by the data provided by the Bangladesh Bank (BB), in five years between 2019 and 2024, the number of deposit accounts held in commercial banks by women rose from 33.45 million to 55.32 million. Those numbers were 30 per cent and 35 per cent respectively of the total number of deposit accounts in the banks held by individuals in 2019 and 2024. Clearly, it marks a steady growth in the number of female-held deposit accounts by about 1.0 per cent annually during the years under consideration. But a still better performance was recorded when it came to the number of female-held loan accounts which more than doubled during the period under review. Obviously, it points to their increasing ability to access bank credits, use those and repay with interests. Since opening up the bank credit facility for women has been a part of the BB's national strategy to include women in formal finance, the rate of women's participation in making use of such facility as evidenced from the above-noted records is no doubt commendable. Such interventions by the BB at the institutional (financial) as well as policy level is likely to help reduce the gender gap in the use of financial services. \nHowever, the pure number of women using certain bank services does not tell the whole story about addressing the gender gap in the use of formal finance. In fact, increase in female literacy has been playing a contributing part. Unfortunately, those in charge of sanctioning loans in banks are more prone to advancing credits to female clients who are better at the paperwork involved in obtaining a loan from the bank. But someone good at documentation does not necessarily mean she is a good entrepreneur. In truth, many unlettered women both in urban and rural contexts have been found to be gifted entrepreneurs. So, it is important that the operators of a bank or any other financial institution dealing with credit should have the motivation to help female clients who have the necessary entrepreneurial skill but lack the literacy to do the required paperwork. To assess the creditworthiness of their less privileged female clients, the bank officials in question will be required to communicate with such customers with an open and unprejudiced mind. \nIt is evidently a welcome development that the central bank has already established dedicated desks styled Women Entrepreneurs Development Units (WEDUs) and Women Entrepreneurs Dedicated Desks (WEDDs) at different banks and financial institutions. What is more, the said, units are learnt to be playing a facilitating role for the potential female entrepreneurs. As many such female borrowers are engaged in the micro, small and medium enterprises (MSMEs), they would require collateral-free loans as well as opportunity for refinancing and quota privilege for wider access to formal credit. It is reassuring that the said facilities are already available at the bank desks in question. It is expected that dedicated efforts will also be in place to overcome the existing social, cultural and institutional barriers to make formal credit more inclusive for scaling up female entrepreneurship to a sustainable level.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Inclusive credit for women in small trade",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/inclusive-credit-for-women-in-small-trade-1755876009",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       August 23, 2025 00:00:00  \n\nBy now, we have all seen the sickening images coming out of various tourist attractions in Sylhet and are appalled at the wholesale plunder of Nature. The once-beautiful white stones, sand dunes and green hills in the iconic Shadapathor and other areas are gone. What remains are scarred, barren landscapes. It is as if a wicked enemy has attacked and robbed the land and abandoned it to emptiness. This is a tragic sight in every sense. But what makes this destruction even more painful is that the plunderers are not foreign invaders or outsiders. They are the very people who live off the land and depend on it, yet they did not hesitate to strip it bare at the first chance. \nMultiple media reports have exposed how those responsible for systematically extracting stones, sand and levelling hills operated with impunity right under the administration's nose. These individuals are not only politically connected but also hold positions in rival parties while posturing as community leaders. With theirapparent bitter rivalry behind, they joined hands in stealing stones. Their unity in this criminal enterprise, even amid fierce partisan rivalry and a ban on one party's activities after the July 2024 uprising, reinforces the widespread belief that criminals and thugs make strange bed fellows in politics. The fact that these aspiring leaders, some of whom are preparing to contest the upcoming February elections, are looting national wealth is a grim warning for the country. It also speaks volumes about the kind of leadership political parties cultivate when such men are allowed to climb the ranks. \nWhen questioned about how this plunder occurred, environment, forest and climate change adviser Syeda Rizwana Hasan rightly noted that such large-scale looting could not have happened without the involvement of the local administration. If not actively complicit, they were undoubtedly silent accomplices, turning a blind eye as hundreds of boats carried away stolen resources day and night right before their very eyes. While her assessment of the local administration's activities is correct, her office cannot escape blame. This theft occurred on her government's watch. They had the authority to stop it and failed to act. In the aftermath of a mass uprising fuelled by demands for change, this continued collusion between political parties and local authorities is nothing less than a bitter betrayal. When the guardians of the law become partners in crime, what hope is left for ordinary citizens? This creates a system of impunity where a powerful few can operate above the law and do whatever they want. \nOn social media, some have attempted to rationalise this plunder by arguing that people must eat and survival is more important than preserving Nature. Needless to say, this line of reasoning is both shallow and dangerous. This destruction was never a case of a few desperate individuals taking a little to get by. It was an organised operation that has destroyed several natural heritage sites forever. Even if we were to accept the claim that hunger motivated this looting, it would be like burning down one's home for a single night's warmth, with no thought for tomorrow's shelter. The profit from selling those stones will vanish quickly. What will they eat then, when the natural beauty is gone, the tourists stop coming and the very land that sustained them lie in ruins? \nUnfortunately, this prioritisation of selfish gain over collective need is not confined to the brazen plunder of Sylhet alone. It is mirrored in the smaller, everyday crimes we have come to tolerate. Take, for example, the stealing of manhole lids. Their sole purpose is to keep people safe from falling in, yet across the country these heavy iron covers are pried off and sold for scrap. Each stolen cover fetches only a pittance, but the open holes become death traps. Even the thief's own mother or child could fall into the open manhole and die. In the pursuit of petty profit, they become willing to endanger the very people they love.\nThis mindset has spread far beyond our streets and is now staining our image abroad. Travel vlogger \"Nadir On The Go\" recently noted that Bangladeshi passport holders are being denied tourist visas with increasing frequency. Why, you ask? This is because too many of our compatriots have forged documents, misused visas or overstayed illegally. A handful commit the crimes, but the stigma falls on everyone. The net result is humiliation for the entire nation.\nWhy is it that our people no longer feel any moral restraint when choosing the wrong path? How did a culture that once valued honesty become one that worships wealth, no matter how it is acquired? This moral collapse is visible in our so-called \"respectable\" people who show off luxury cars and big houses, even though their money came from corruption, fraud and exploitation. But instead of being looked down on, they are praised. Theft, if it brings vast riches, is not just overlooked but admired. A thief clever enough to evade punishment is hailed not as a criminal, but as a hero. It is this twisted logic that allows the powerful to loot rivers and hills in Sylhet with impunity, just as it drives petty thieves to steal manhole lids. \nThis is the complete opposite of what happens in societies with low corruption. In those places, a powerful sense of shame acts as the most effective social regulator. In Japan, for instance, stealing is unheard of because it is the absolute opposite of honour. In ours, though, it seems that those with the least shame are the ones who want everyone to respect them the most. \nYet, shame is not entirely gone from us. Just last May in Natore, a young housewife took her own life after her husband was caught stealing fish from a neighbour's pond. She was so overcome with embarrassment that she couldn't go on living. Tragic as her act was, it shows that the moral instinct of shame still survives in some innocent hearts. Our hope for a better society depends on nurturing this feeling, where wrongdoing in all its forms will be met with disgrace, not praise.\nshowaib434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "When plunder becomes normal",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/when-plunder-becomes-normal-1755876074",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       August 23, 2025 00:00:00  \n\nShoudamini, a student at the primary level of a renowned school in Dhaka, struggles hard to carry on her tender shoulder an overloaded bag daily. Sometimes she almost cries when it becomes too painful to carry the heavy bag and step up the stairs to reach her classroom on the third floor. On her return trip from school, she walks a few steps to avoid traffic congestion and then takes a rickshaw. She rushes to drop off her bag and jumps into bed for a rest. On some occasions, she doesn't even have the stamina to wait for a change of school uniform and wash her hands and face before lying down on the bed to give her some relief. Sadly, she is not alone. Thousands of students like her have been going through the torture of carrying overweight bags daily as if it is an essential part of the education in the country. \nNeither the government nor the school authorities have time to pay attention to this issue, although it is taking a heavy toll on the physical growth of children. Students of primary levels are the main victims of overweight bags. Though there are some alternatives to avoiding overweight bags, nobody is there to look into the matter seriously and think about the future of children who are now experiencing pain in the upper body involving their neck, shoulders and tender back. \nThe problem is not unique to Bangladesh, as school-going students in India and Pakistan are also facing a similar situation in South Asia, with the authorities in all these countries remaining indifferent to this problem. It was only five years ago that the Indian government issued 'Policy on School Bag 2020', setting age-wise weights of school bags along with an instruction that a school bag should be lightweight with two padded and adjustable straps that can squarely fit on both shoulders. The policy also outlined the duration of home tasks and the weights of printed textbooks. In Bangladesh, the High Court ordered a decade ago that the weight of a school bag must not be more than 10 per cent of the student's physical weight. There is, however, no tool to monitor how the schools are complying with the HC order. \nPhysicians have long argued that carrying heavy bags over one shoulder is a wrong practice, as it strains muscles. The spine leans to the opposite side, stressing the middle back, ribs, and lower back more on one side than the other. This muscle imbalance can cause muscle strain, muscle spasm and back pain. Medical professionals also added that one of the major reasons for cervical and lumbar pains is overloaded bags. The posture of the body is also affected, leading to unbalanced development in the long run. \nDespite knowing all these adverse effects on children's health, parents and guardians seem helpless as they are forced to abide by the conditions set by the schools to carry a number of books and exercise books. Schools are not ready to ensure safe drinking water, let alone provide lockers and cupboards for students to keep their extra books and belongings. There is no practice of sharing textbooks in classes, so all students do not need to carry all the books. Why do children have to maintain separate class rough khatas or exercise books for each subject? Why do they have to deliver home tasks every day? The reckless and unhealthy competition to achieve higher test scores has been driving students, guardians, and teachers to do the extra works.\nThen there is a commercial purpose of some vested interest groups, including exercise book sellers and school bag vendors, to keep the unacceptable and unhealthy practice of carrying overloaded bags in place. There is a nexus between school authorities and stationeries and libraries. It seems that the interim government has no time to pay attention to this issue but it is a serious one that needs to be addressed in the interest of the young ones who will take over from the older generation.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Saying 'No' to children's overweight bags",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/saying-no-to-childrens-overweight-bags-1755876141",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 23, 2025 00:00:00  \n\nThe ongoing Palestinian crisis is not just a regional tragedy; it's a test of the legitimacy of the international system. The UN was created after WWII to prevent aggression, promote self-determination and ensure full protection of civilians. Years of displacement, occupation, and outright war should demonstrate the inability or unwillingness of the UN to enforce its own resolutions.\nThere is no escaping the role of Western policy in this, particularly that of the United States. Year after year, Washington adds to its military and financial backing to Israel despite UN reports and human rights organisations repeatedly documenting violations of the international laws. The West insists on accountability in Ukraine and other conflicts, but donations to Israel continue unconditionally. The double standard fosters an embarrassment of trust in the international order and sends the message that some lives matter less than others.\nInstitutions like the International Criminal Court have demonstrated an inability and unwillingness to act in this arena. Conspicuously, the ICC is able to respond urgently in some theatres of war, but cannot act in the case of Palestine, showing a reticence to act due to foreseen political pressure. This selectivity of justice empowers the oppressor and restricts the recourse of the oppressed.\nIf the UN and its allied institutions cannot hold to the very rights for which they were established to protect, I think the international community should ask itself: what is their purpose? Palestine has become a condition of whether our framework for justice in our global system represents universal justice, or just self-serving Western interests.\nSultan Al Nahiyan Tahsin\nSBE, Undergraduate\nNorth South University\nsultan.tahsin@northsouth,edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "When the world fails Palestine",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/when-the-world-fails-palestine-1755876164",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-08-2025"
    }
]