[
    {
        "full_article": "The Lokpal’s ruling that High Court judges are amenable to its jurisdiction and the Supreme Court order staying it on its own motion raise more than a mere question of law. The issue concerns both the independence of the judiciary and its accountability. That the Court, government law officers and senior advocates found the Lokpal’s decision disturbing is understandable, as many believe that judicial independence will be undermined if judges of constitutional courts are made answerable to the Lokpal, even though they fall under the definition of ‘public servant’ under the Prevention of Corruption Act. The Lokpal view appears to be prima facie incorrect. There is nothing to suggest that superior court judges were ever considered to be under its remit. Last month, the Lokpal, headed by former Supreme Court judge, A.M. Khanwilkar, rejected a corruption complaint against a former Chief Justice of India (CJI) on the ground that the Lokpal Act, 2013, did not concern apex court judges and that its reference to “persons” who are members of any body or authority created by an Act of Parliament cannot be applied to the Supreme Court, an institution established by the Constitution. However, in respect of High Court judges, it said High Courts established by statutes creating the respective States were statutory bodies, and their judges were “persons” within the meaning of Section 14 of the Lokpal Act.The independence of the judiciary was the foremost consideration when the Court held in K. Veeraswami vs Union of India (1991) that no case can be registered against them without consulting the CJI, even though it also said judges were public servants under the Prevention of Corruption Act. Based on this principle, the Lokpal has referred the complaint to the CJI. While the Lokpal ruling is set to be reviewed, the time may have come to address the issue of accountability in the rare event of a credible corruption charge arising against a judge. The matter is now dealt with by the Court through an in-house procedure, initiated only if the Chief Justice of a High Court, or the CJI or the President receives a complaint. If the charges appear true, asking the judges concerned to resign, denying them judicial work or recommending their removal through Parliament are the options available. Some judges are transferred from one High Court to another, but whether a corruption charge is the reason is never disclosed. The Court should see if the present mechanism is enough or it needs to be expanded to include credible follow-up action such as an independent prosecution under its supervision. Both accountability and independence ought to be equally important for the judiciary. Published - February 22, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        Lokpal\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        public officials\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        corruption & bribery",
        "headline_1": "Judges’ dilemma: On the judiciary, its accountability",
        "headline_2": "Accountability and independence ought to be equally important for judges",
        "link": "https://www.thehindu.com/opinion/editorial/judges-dilemma-on-the-judiciary-its-accountability/article69247691.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "23-02-2025"
    },
    {
        "full_article": "With less than a week for the UGC’s deadline to submit feedback on its draft regulations on the appointment and promotion of university teachers and Vice-Chancellors (V-C), States ruled by parties other than the BJP have ratcheted up their opposition. At a conclave in Thiruvananthapuram, Kerala, Tamil Nadu, Telangana and Karnataka challenged the regulations, saying they would undermine the federal structure, diminish the powers of State legislatures, and weaken the autonomy of State universities. This is the second such conclave, with a previous meeting in Bengaluru including the governments of Himachal Pradesh and Jharkhand, and expressions of solidarity from Punjab. In Tamil Nadu and Kerala, the main Opposition parties are also supportive of the stances of the ruling parties there; some regional parties that belong to the BJP-led NDA have reportedly expressed their concerns in private. A key concern is the UGC’s proposal to play an enhanced role in the selection and appointment of V-Cs of State universities. Under the new regulations, the search-cum-selection committees will comprise nominees of the Chancellor (usually the Governor in State universities), the UGC Chairman, and the University syndicate or senate, neatly cutting out State Higher Education departments which were responsible for setting up these expert panels. The Chancellor will appoint the V-C from the list of three to five names shortlisted by the selection committee. UGC chairman M. Jagadesh Kumar has argued that the proposed structure “eliminates ambiguity and ensures a more transparent process”, but States oppose the centralisation of power, leaving many State universities leaderless, especially in Tamil Nadu.Apart from the allegation that the new regulations will dilute academic standards, increase commercialisation and politicisation, and reduce access to higher education for poor and disadvantaged students, the States have asked why they are being sidelined in university administration even while they continue to bear most of the financial costs for State-run higher education. Beyond higher education, there is a larger constitutional issue of Centre-State relations at stake: can delegated legislation such as the rules and regulations framed by the Union government and its agencies in the executive branch under a central law override the provisions of a plenary State law passed by a State legislature? The opposing States plan to send a high-level delegation to the Union Education Ministry and challenge the regulations in court, indicating a political and legal escalation of the issue. The UGC must not ignore this plethora of concerned voices and should remove anti-federal provisions from its draft before notifying the new regulations. Published - February 22, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        university\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Telangana\n                    \n                            /                      \n                        \n                        Karnataka\n                    \n                            /                      \n                        \n                        Himachal Pradesh\n                    \n                            /                      \n                        \n                        Jharkhand\n                    \n                            /                      \n                        \n                        National Democratic Alliance\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        higher education\n                    \n                            /                      \n                        \n                        laws",
        "headline_1": "​Southern discomfort: On UGC draft regulations",
        "headline_2": "Delegated legislation from the Centre should not override States’ plenary laws",
        "link": "https://www.thehindu.com/opinion/editorial/southern-discomfort-on-ugc-draft-regulations/article69248429.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "23-02-2025"
    },
    {
        "full_article": "Kash Patel’s not the most terrible of Trump’s choices. The real issue isn’t him. US legislature is broken. So, yet another Trump ultra-loyalist will do a job that requires non-partisanship\nIn one sense, it’s no surprise the US Senate approved Trump’s nomination of Kash Patel to be FBI director.\nThough he doesn’t have anything like the qualifications of past directors, Patel isn’t among the most questionable nominees already approved by a quiescent Republican majority.\n\nIn another sense, his approval should be a surprise, as it breaks with the traditional non-partisanship of the position, in the most recent example of the collapse of US Congress as an equal branch of govt.\nRead the full story on TOI+.\n\n",
        "headline_1": "FBI got Patelled. Now what?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/fbi-got-patelled-now-what/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-02-2025"
    },
    {
        "full_article": "Elections tomorrow in Germany will show how close AfD, yet another Western party that’s ultra-nationalist, Russia-loving and immigrant-bashing, gets to taking power in the future\nTomorrow, an important German snap election will be held amid the rise of far-right sentiments throughout Europe, Trump’s return across the Atlantic, and Elon Musk’s alleged open display of the Nazi salute.\nThe centre-left Social Democrats (SPD), led by incumbent Chancellor Olaf Scholz, and the opposition conservatives, a coalition of Christian Democrats (CDU) and their Bavarian sister party, Christian Social Union (CSU), are Germany’s two ‘big-tent’ parties.\n\nSmaller parties like the Greens and the far-right Alternative for Germany (AfD) have gained ground in recent years, while both the main parties have lost support.\nRead the full story on TOI+.\n\n",
        "headline_1": "Achtung! Many Germans aren’t far from far-right",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/achtung-many-germans-arent-far-from-far-right/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-02-2025"
    },
    {
        "full_article": "By Farida Khanam\nAs the election euphoria settles and weight of governance lands on the shoulders of the new chief minister of Delhi, people of this state have renewed hope.\nNow begins the real test of leadership.\nLeadership is not about power but about responsibility. It is amanah, trust, a duty to serve with integrity, humility, and an unwavering commitment to public welfare. The Quran discusses changing nature of political power in chapter 3, verse 26. God grants and takes away power to whomever He wills. He has control over everything.\nThis verse reminds us that leaders must approach governance with the awareness that their position is temporary and subject to Divine will.\nThe Quran describes Queen of Sheba, known as Bilqis in Yemeni and Islamic tradition and as Makeda in Ethiopian tradition, as a pragmatic and wise queen who was always considerate of her people.\nOne of her statements, mentioned in the Quran, reads: “I never decide any affair until I have conferred with you, 27:32.” It signifies that effective leadership is built on wisdom, consultation, and careful decision-making – qualities essential for both governance and personal matters. Good leadership emerges through collective wisdom and humility, avoiding rash decisions, fostering trust and unity.\n\nShe is also quoted as saying: “When mighty kings invade a country, they despoil it and humiliate its noblest inhabitants, 27:34.” This implies hostile confrontation leads to harm. It does not result in any constructive progress. True power lies in empathy that a woman naturally possesses, along with wisdom and respect for others.\nGood governance is not just performance – it is a responsibility. The Prophet said: “The leader of a people is their servant,” Tarikh Dimashq 33/313. The most effective leaders understand that public trust is earned through fairness, transparency, and accountability.\nA leader must prioritise justice and fairness and foster trust, without which democracy weakens and the gap between the govt and the governed widens, leading to disillusionment.\nToday’s citizens demand tangible change – policies that directly improve their lives. They want quality education, reliable infrastructure, accessible healthcare, employment opportunities, and a system that ensures fairness and equity.\nStates should compete constructively by benchmarking themselves against one another, creating measurable indices that track progress in these critical areas. The goal should be to restore India’s status as ‘the golden bird’, known for its prosperity, innovation, and inclusiveness.\nTherefore, the collective fortunes of a nation are directly tied to spiritual and ethical transformation of its citizens.\nHence, leadership must focus not only on external development but also on nurturing spiritual strength of individuals and instilling a sense of duty, unity, and goodwill.\nTrue leadership is rooted in service, selflessness, and a vision for the greater good. Chief ministers have the power to transform destinies.\nHow they honour people’s trust will define their legacy.\n\nThe writer is chairperson, CPS International, New Delhi\n\n",
        "headline_1": "Servant leadership: True power lies in empathy",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/servant-leadership-true-power-lies-in-empathy/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-02-2025"
    },
    {
        "full_article": "From Trump’s baseball cap to Gandhi topi\nKings had crowns, Trump has a baseball cap, as does his billionaire sidekick Musk. When supporters put it on, with MAGA insignia, it’s like their own umbilical cord with the Disruptor-in-Chief. But is Trump the first US prez with a signature head cover? Hardly.\nBack in the day the 6’4” Abraham Lincoln chose to tower over others even more with a high top hat. In more modern times, Bush Jr and Sr and Reagan have turned eyes with a Stetson. To their critics it spoke a yeehaw foreign policy agenda, to their fans a rugged, true-blue Americana. Reagan put a Stetson on Gorbachev too, and that picture at his California ranch speaks to their ending the Cold War together as much as any other. But on the side, Americans giggled, because Gorby had put the cowboy hat backwards. Why didn’t Reagan tell him, will remain one of the great unanswered questions of history. In any case, this was still cooler than Lenin’s flat cap or that fur cap with ear flaps sported by most Soviet leaders.\nNo country has the abundance of cap styles India does. Putting his head through this diversity is a must for a neta peddling his wares hither and thither. One topi does have extra special political lineage: the Gandhi cap. But it’s also a victim of changing times. If you see a lot of it at a public gathering, the material will be ‘Chinese net’, not khadi. \n\n",
        "headline_1": "Head-y politics",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/head-y-politics/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-02-2025"
    },
    {
        "full_article": "It is appalling that hazardous chemical warehouses and factories in Old Dhaka have yet to be relocated, despite repeated assurances following several devastating fires that have claimed hundreds of lives. Over the past 15 years, multiple tragic fires have erupted in Old Dhaka, causing massive property damage and affecting thousands of lives due to the presence of highly flammable substances. After each incident, authorities have promised to relocate these dangerous warehouses and factories. However, those promises remain unfulfilled, leaving residents of these congested neighbourhoods in constant fear.\nAfter the devastating Nimtoli fire in June 2010, which claimed 126 lives, the government initiated four projects to relocate the chemical, plastic, printing, and electronics industries from Old Dhaka. Fourteen years later, all but one of these projects remain incomplete, reportedly due to bureaucratic red tape and complications with land acquisition. Even the Churihatta fire in Chawkbazar, which killed at least 71 people on February 20, 2019, failed to prompt authorities to expedite the relocation process. In fact, the authorities have not even updated the list of chemical warehouses in Old Dhaka.\nA 2019 survey by the Dhaka South City Corporation (DSCC) identified 1,924 chemical warehouses in Old Dhaka, with 98 percent classified as \"moderately risky.\" However, locals believe the actual number is much higher, as many residential buildings are rented out as warehouses due to lax monitoring by the authorities. According to the Bangladesh Environment Conservation Rules of 1997, industrial units using hazardous chemicals or goods are prohibited from operating in or near residential areas. Following the Nimtoli fire, the DSCC stopped issuing new licenses and renewing old ones for chemical businesses in Old Dhaka. Then, after the Churihatta fire in 2019, the DSCC ceased all chemical trade licensing under its jurisdiction. However, these measures have had little practical impact.\nMeanwhile, chemical traders argue they cannot relocate unless the government ensures their resettlement, as outlined in a Memorandum of Understanding signed in 2017. The Bangladesh Small and Cottage Industries Corporation has made 73 percent progress in constructing a Chemical Industrial Park in Sirajdikhan, Munshiganj. Additionally, a temporary project in Shyampur, completed in June 2024, provides space for 54 warehouses. However, these efforts have made little headway in relocating chemical warehouses and factories from Old Dhaka. Similarly, the relocation of plastic and other industries has been slow, plagued by the same bureaucratic delays.\nAll of this demonstrates an unwarranted apathy on the part of our authorities, putting countless lives at risk for no reason. The fact remains that Old Dhaka is a ticking time bomb due to its congestion and the presence of highly flammable substances. And it is entirely unacceptable for the relocation of these chemical warehouses and factories to take nearly 14 years. The authorities must take immediate action to free the residents of Old Dhaka from such extreme risks.\n",
        "headline_1": "Relocate risky factories from Old Dhaka",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/relocate-risky-factories-old-dhaka-3830746",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-02-2025"
    },
    {
        "full_article": "Bangla is what we native Bangalees call the language. And so that is what it should be known as. Just like Hindi, Urdu, or Tamil. So why not use the word Bangla globally, instead of \"Bengali?\" After all it's a proper noun that can't really be translated. Besides this is not just any language. Bangla has a glorious past. In fact, to show respect to our Language Movement of 1952, the International Mother Language Day is observed on February 21 or as we call it Ekushey February. Bangla enjoys the rare distinction of being a language that gave rise to a movement that ultimately paved the way towards a liberation war. Proponents will also point out that Bengali is derived from Bengal, which itself is rooted in the British colonial era anglicisation. Surely, a language so steeped with the legacy of freedom should by all means seek to shed this burden and be known by its native name.\nThat should be the end of the debate really. But not quite.\nLanguages have their own conventions and customs. Each language has its unique way of referring to countries as well as their languages depending on how the words evolved. For instance, Türkiye (pronounced tur-key-eh, or Turkey in English) is called Turoshko in Bangla. England is Bilaat, and London we call Bilet! The language is Ingreji. We have adopted names of most other countries from the vocabulary of our colonial masters. It is always Ireland, Sweden, or Spain, never Éire, Sverige, or España. We never say Deutsch or Français, but German and, perhaps, Forashi, if not French. And yes, those wiggly things do make a huge difference in pronunciation.\nBut does this Banglicisation (or, if we insist on \"Bangla,\" should it be Bangalification?—this brings up another point that we will get to shortly) of Français make any difference to the spirit of the French Revolution? Not adopting Ruuski and sticking to the Bangla Ruush, hardly erodes the magic of Pushkin's poetry. Or does it mean we are being insensitive? Should the Swedes or the French take offence?\nOn the other hand, however, if the French were to insist we retain their native name, it would be a nightmare for most to pronounce and we have not even broached the native languages of Africa full of clicks. But if others were to tell us how we should write the names of their languages and countries in Bangla, it would certainly rub us the wrong way.\nAnd more importantly, communication would become difficult. We would not be able to convey which language or country we mean, without explanations and annotations, if one were to suddenly start referring to them by the native names deserting the customary ones.\nAnother problem that arises from foisting a word upon another language is that it will entail invention of a whole new range of vocabulary. For instance, if it is Bangla, how do I express my Bengaliness? Or would it be Bangaliness or Bangaliana? Banglicisation or Bengalification? Do we then start saying, \"O my golden Bangla\" abandoning the age-old translation \"O my golden Bengal?\" Do the Sundarban tigers then become Royal Bangla Tigers? And what of the East Bengal Regiments or, for that matter, the Bengal Lancers from the colonial era? And let's not forget the \"Bay of Bangla.\" But these are examples from the fringe. We really don't need to overthink it. So long as they call the language Bangla, we are happy, one might say.\nBut who are they? Perhaps, in our strong desire to shed the colonial anglicisation, we are rather fixated with the English terms. We are hardly bothered with what they call us in Mandarin, Kiswahili, or Russian. So long as we can set the English speakers straight and get them to say Bangla instead of Bengali, it would be considered a job well done.\nUse of \"Bangla\" is indeed gaining more currency, especially in Bangladesh, although not as much on the other side of the border—India's West Bengal, where people speak the same language but still stick to the traditional English name—Bengali.\nThe purpose of language is to communicate efficiently and towards that end, languages have a life of their own. They tend to adopt the most effective lingo as they gain currency or abandon words as they go out of fashion. So long as people speak them, languages keep evolving. There are always different forces at play. The traditional pull factors and the youthful push factors together shape the course of languages. Which is probably why, a Big Mac and a weekend are just \"le Big Mac\" and \"le weekend\" in France.\nBut that is not a reason to let up and relent. Let \"Bangla\" be our little project. We will keep pushing for it till we get everyone to say it right.\nTanim Ahmed is digital editor at The Daily Star.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Bangla or Bengali: which should be used?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/winkers-aweigh/news/bangla-or-bengali-which-should-be-used-3830696",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-02-2025"
    },
    {
        "full_article": "Clean energy solutions require a significant commitment of capital from the private sector. Bangladesh Bank's low-cost green refinance schemes, offered at interest rates of up to five percent, can enable the private sector to channel this capital towards clean energy projects. These low-cost schemes increase the viability of clean energy projects as opposed to loans offered at market rates. However, information asymmetry, lack of awareness and lengthy disbursement processes prevent the proper utilisation of these schemes.\nWith the Bangladesh government mulling a hike in gas prices and industries reeling from previous energy price spikes, the latter would need to utilise low-cost green refinancing schemes for clean energy projects to offset increasing costs. This would necessitate addressing prevailing barriers.\nThe government may raise gas tariffs for industrial processes and captive power generation by 151 percent and 145 percent, respectively, owing to expensive liquefied natural gas imports. New industrial and captive connections will have to pay Tk 75.72 per cubic metre across the board, while currently they pay Tk 30 per cubic metre for industrial processes and Tk 30.75 per cubic metre for captive power. If approved, existing industries will pay the revised tariff for consuming gas beyond the sanctioned loads, while new industries will pay the revised tariff for total consumption. Moreover, the persistent revenue shortfall in the power sector may compel the government to raise power tariffs.\nBurdened by the challenge of rising costs while trying to remain competitive in the market, operational industries will shift their focus to energy efficiency and rooftop solar. Besides, new industries will consider a \"whole-system-design\" approach to minimise their energy consumption by installing the most efficient technologies and harnessing natural light.\nAs higher energy tariffs send a strong signal for the rapid implementation of energy efficiency and renewable energy measures, the demand for low-cost green finance will soar in the country.\nBangladesh Bank launched a refinancing scheme for green products in 2009, initially known as the green refinance scheme for solar energy, biogas and Effluent Treatment Plant (ETP), with a modest funding size of Tk 200 crore. Later on, it enlarged the funding base to Tk 1000 crore and fixed the highest interest rate at five percent down from the previous 10 percent. It widened the ambit of eligible projects, including energy efficiency, green building, green industry and different renewable energy technologies.\nThe central bank also offers a low-cost Green Transformation Fund (GTF) of Tk 5,000 crore, which export and manufacturing oriented industries can obtain at up to five percent interest for green projects. The refinancing scheme for Islamic banks and financial institutions of Tk 125 crore is also suitable for clean energy projects.\nHowever, data shows that between January 2018 and September 2024, entrepreneurs had a tepid response to green refinance schemes. The highest disbursement rate of the refinance scheme for green products reached 41.6 percent during the first three quarters of 2024 while the GTF's disbursement rate was only 19.05 percent. The refinancing scheme for Islamic banks and financial institutions registered zero disbursements during January 2022-September 2024 (see Figure 1).\nGiven the funding sizes of Tk 1000 crore and Tk 5000 crore, respectively, the refinance scheme for green products and GTF can serve the growing need for clean energy projects, excluding grid-scale renewable energy plants. As the interest rate on traditional loans in the country is around 14-15 percent, these two schemes offering green finance at 5 percent interest are highly lucrative.\nAccelerating the flow of green finance\n\nThere is information asymmetry among industries that refinance schemes are costly, and the loan tenure is not appropriate for clean energy projects. They find the central bank's refinancing process lengthy, with a requirement for many documents. Industries have other concerns too. They first apply to financial institutions for loans at market rates and then financial institutions proceed to Bangladesh Bank for refinance schemes. If the central bank does not approve applications for refinance schemes, industries would need to bear the high interest rates that may render their projects unviable. Additionally, capacity development of financial institutions is necessary to accelerate the flow of green refinancing schemes.\nThe central bank should periodically organise awareness-raising events for major stakeholders to address their concerns by ensuring that the interest rate for clean energy projects is up to five percent with a flexible loan tenure (up to 10 years). It should also debunk misinformation regarding the documents and lengthy process.\nThe Sustainable and Renewable Energy Development Authority (SREDA)–the nodal agency responsible for advancing clean energy in Bangladesh–should bridge the information gap that affects the use of low-cost green funds. The Bangladesh Solar and Renewable Energy Association (BSREA) can publish periodicals with updated terms and conditions of green refinance schemes for its members and stakeholders.\nWith the utilisation rates of green funds remaining stubbornly low, Bangladesh Bank can evaluate the scope of prefinancing green projects. Together with financial institutions, it can assess project proposals at an early stage and eliminate any uncertainty industries experience with the schemes.\nFinancial institutions should have sufficient capacity to understand different clean energy projects as financing a new industry and financing an old industry for retrofitting with energy-efficient equipment requires different appraisal processes. The latter necessitates an understanding of energy audit reports and making decisions based on energy-saving potential. Similarly, bankers should know the net-metering guidelines for rooftop solar.\nBangladesh Bank, SREDA and BSREA can work together to strengthen the capacity of bankers for clean energy project evaluation and financing. This capacity development should include ways of comparing different technologies, their energy-saving potential and quantifying their financial returns.\nSoaring energy and power costs are expected to drive the demand for green finance at a faster rate than before. This demand, if met by optimally utilising existing schemes, will deliver double dividends. Not only can industries reduce their energy bills, but the country will also save money, which otherwise would be spent on fossil fuel imports.\nShafiqul Alam is lead energy analyst for Bangladesh at the Institute for Energy Economics and Financial Analysis (IEEFA).\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Driving Bangladesh Bank’s low-cost green refinance schemes",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/driving-bangladesh-banks-low-cost-green-refinance-schemes-3830486",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Boosting farm produce export",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/boosting-farm-produce-export-1740232564",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Growth to remain sluggish for a while",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/growth-to-remain-sluggish-for-a-while-1740232612",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Judicial reform urgent for timely justice",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/judicial-reform-urgent-for-timely-justice-1740232982",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Can Bangladesh build a green economy?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/can-bangladesh-build-a-green-economy-1740233003",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-02-2025"
    }
]