[
    {
        "full_article": "By holding that the judiciary cannot fetter Governors and the President to “one-size-fits-all” timetables or usurp their functions by assuming “deemed consent” of proposed Bills by States, and also clarifying that these authorities cannot resort to “prolonged and evasive inaction”, the Supreme Court’s answer to the 16th Presidential Reference appears as a constitutional balancing act. But, substantively, it is a blow to federalism as it effectively allows Governors unchecked powers to block or delay State legislation without constitutional accountability. This opinion contradicts a progressive judgment in April 2025 that had prescribed three-month timelines and used Article 142 to grant deemed assent to some Bills passed in the Tamil Nadu Assembly. The Court invoked separation of powers to reject timelines and Article 142’s use, but this empowers Governors at the cost of State rights. The judgment claims that Articles 200 and 201 prescribe no deadlines, but disregards explicit constitutional text. In Article 200, the Governor must declare his decision “as soon as possible” — the Court called it too “elastic” to support timelines, rendering constitutional text unenforceable. The Court’s assertion that Governors are not bound by the Council of Ministers’ aid and advice contradicts constitutional history. The framers explicitly removed the phrase “in his discretion” — a phrase in the Government of India Act, 1935 — from Articles 200 and 201. Even the Sarkaria Commission recommended a six-month period for Governors to decide on Bills.The Court did rule that withholding assent must be followed by returning the Bill to the Assembly. But the judgment rules that even if the Assembly passes the Bill a second time, the Governor retains the option to reserve it for the President. This kills the binding nature of the legislature’s second passage. Consequently, whether at first instance or after reconsideration, a Governor can refer a Bill to the President under Article 200. Once there, Bills can languish indefinitely as the judgment ruled that the President has no obligation to consult the Court. The Assembly has no recourse to re-pass Bills in a binding manner, and the judgment provides no guidance on when referring a Bill to the President is appropriate. While the judgment talks of a “limited mandamus” for prolonged inaction, it refuses to define what constitutes a “reasonable period of time”, forcing States into legal battles to prove delay. By removing procedural safeguards (timelines and deemed assent), extraordinary remedies (Article 142), and oversight (judicial review of actions under Article 200), the Court’s opinion has allowed the possibility of executive overreach. States have little mechanism to challenge arbitrary delays, no automatic approval after reasonable periods, and no remedy when Bills are referred to the President, even on subjects under the State List. And these are situations that have recently transpired in many Opposition-ruled States. The Court appears to have found a way to turn the letter against the spirit of the Constitution. Published - November 22, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        Governor\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        Tamil Nadu",
        "headline_1": "​Blow to States: On the Supreme Court and State Bills",
        "headline_2": "Supreme Court should have upheld timelines for Governors and President",
        "link": "https://www.thehindu.com/opinion/editorial/blow-to-states-on-the-supreme-court-and-state-bills/article70308688.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "23-11-2025"
    },
    {
        "full_article": "The introduction of the second iteration of the National Action Plan on Antimicrobial Resistance is an acknowledgement that, but for some marginal gains, implementation of version 1 was, at best, sluggish. In a welcome move, the Centre has released a further version of the policy, though the details are not yet available in the public realm, to give the nation a booster shot at trying to fix the rather humongous AMR problem that the country has had to contend with, increasing volumes to boot. In October, WHO released its Global antibiotic resistance surveillance report, which recorded that in 2023, approximately one in three bacterial infections in India were resistant to commonly-used antibiotics. Globally, it was one in six confirmed infections. It spelt out why India was disproportionately affected — factors included a high infectious disease burden, overuse and misuse of antibiotics and gaps in the surveillance and healthcare infrastructure. E.coli and Klebsiella pneumoniae have exhibited high resistance to critical antibiotics, making the very last line of drugs ineffective. But human health is not the sole footprint AMR possesses; there is scarcely a field in the food chain where its cold arms have not touched — from veterinary practices to contaminating soil and water health and, thereby, agriculture and aquaculture. This ubiquitous spread of AMR has spurred scientists to push the One Health technique — it integrates the prisms of human health, animal health and environmental health — to handle growing resistance in communities.The time is, no doubt, ripe for India to take AMR seriously and push for an enhanced, committed antibiotics stewardship programme. While the first National Action Plan played a key role in raising the profile of AMR, the actual implementation suffered. It is true that the country expanded its national surveillance programme by adding a solid laboratory network (thanks, in part, to the COVID-19 pandemic), it also scored a win with the ban on Colistin as a growth factor in the animal husbandry sector. However, the programme flailed as it failed to secure potent collaborations with States. A few States drew up their own policies, but only Kerala implemented it well enough to see a slight drop in AMR levels in the community, recently. This policy will have to tackle every aspect of AMR’s causative factors, including the rampant overuse and misuse of antibiotics. The One Health approach will have to be strengthened, and better co-ordination with States ensured. This time around, the policy will have to be the real deal and deliver, against resistance. Published - November 22, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        medicine\n                    \n                            /                      \n                        \n                        medical research\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        World Health Organization\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        disease\n                    \n                            /                      \n                        \n                        health\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        aquaculture",
        "headline_1": "​Overcoming resistance: On the National Action Plan on Antimicrobial Resistance (2025–29)",
        "headline_2": "Version 2 of the National Action Plan on Antimicrobial Resistance requires fresh commitment",
        "link": "https://www.thehindu.com/opinion/editorial/overcoming-resistance-on-the-national-action-plan-on-antimicrobial-resistance-202529/article70307950.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "23-11-2025"
    },
    {
        "full_article": "GOI’s junked archaic, anti-entrepreneurship labour laws. But mega factories need more liberal rules. States that relax provisions further will attract big investment & create jobs\nPM Modi has taken the courageous step of replacing 29 archaic labour laws, most of them predating Independence or the founding of the Republic, with four unified labour codes.\nIf there ever was a mother of all reforms, this one is it.\n\nPersonally, for this author, with dozens of op-eds, several academic articles, and multiple books making the case for the reform behind him, this is the culmination of a 25-year-long odyssey.\nRead the full story on TOI+.\n\n",
        "headline_1": "Big bang, work-in-progress",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/big-bang-work-in-progress/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-11-2025"
    },
    {
        "full_article": "To stay on in it is to keep suffering. Exit is the only wise course. You may be tempted to maintain the toxic tie out of revenge. Don’t. Just close this chapter so a nice new one may begin\nOur ancestors, long before psychology became a discipline, devised ways to read human compatibility. They turned to the stars.\nAstrological charts were not mystical curiosities but practical tools, a proxy to gauge whether two individuals’ energy fields would align.\n\nPlanetary positions at birth were believed to reflect the invisible architecture of our personalities and destinies, like a cosmic fingerprint.\nRead the full story on TOI+.\n\n",
        "headline_1": "The falling dagger: A relationship that’s no longer love",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-falling-dagger-a-relationship-thats-no-longer-love/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-11-2025"
    },
    {
        "full_article": "By Meena Om\nThe proposal to increase work hours to fourteen hours a day, six days a week, for the sake of productivity, keeps surfacing repeatedly. Gita offers better solutions – guidance.\nEmployees could inculcate the habit of offering their finest, truthfully and diligently, to the Param Chetna, Supreme Consciousness. Instead of setting targets, putting in long hours, and rushing to complete projects by hook or by crook, it is essential to perform karm to the best of our ability.\nPlants grow according to the rhythm of nature. Similarly, businesses or projects also come to fruition in time. During the growth period, one can cut through ignorance and imperfections such as indiscipline and procrastination by being true to oneself.\nMeasure output on the four scales of: truth, love, karm and light. Be truthful in your work; be ‘loveful’ – work harmoniously for the welfare of all; karm – work with all capacities, without complaint; light – study to be skilled at the task in hand and dispel doubts or misconceptions regarding it, because ‘work is worship’.\nBe a conscientious employee. Work without feeling guilty or carrying any emotional baggage or grudges against anyone, including the employer.\n\nFourteen hours of labour with two hours of rest, for instance, may not be conducive. Employers need to assess whether long work hours leading to fatigue, or fewer hours leading to greater focus, will increase productivity.\nHuman beings have already overtaxed the mind for selfish reasons. It is time to understand how effort, one’s karm, can contribute to the welfare of humanity.\nIf the golden rule of working with complete dhyan, using the mind, intellect, physical capacity, is applied, the benefits cannot be less than divine, making the remuneration a secondary consideration. Monetary gains should not be the primary consideration. Work satisfaction can accrue from sincere effort, rather than assessing monetary, commercial or material gains.\nIt is not healthy to bind anyone with hard and fast rules so that it becomes a bondage. Instead, motivate people to work willingly by applying their full capability for better productivity.\nThe joy of karm lies in being attentive towards one’s growth; experiencing satisfaction from working dutifully and rightfully, inspiring others towards collective growth and progress.\nWork should not trap one in a certain image, otherwise all energies will go into maintaining that image, limiting growth.\nWhen in samarpan ,absolute surrender, whatever comes before you, consider it godsend. Always be in gratitude and pray:‘Prabhu, you have given me so much jnan and buddhi that i am capable of doing this work with my whole being, as worship and with gratitude.’\nA pleasant workplace, fostering a respectful, cheerful and harmonious attitude, along with enthusiasm towards a common goal, is more important than long work hours generating irritation, burden, and unpleasantness, which will never produce results of the desired level.\nQuality over quantity comes with a sense of belonging. Do your best by using all faculties, without calculation, politics or mind games.\n\n",
        "headline_1": "Follow the Gita to boost workplace productivity",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/follow-the-gita-to-boost-workplace-productivity/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-11-2025"
    },
    {
        "full_article": "Tejas, despite Dubai tragedy, remains vital for IAF  \nIt was a terrible tragedy, bad optics for India, and it put a sharper focus on a critical indigenous defence project. The pilot didn’t survive the Tejas crash at Dubai Air Show. And images of India’s fighter jet tumbling to the ground at one of the world’s biggest showcases for aviation tech, have multiple implications. Accidents and crashes are not unknown at air shows. Back in Aug, a Polish Air Force pilot was killed when his F-16 jet crashed during the rehearsal for the Radom Air Show. Add to this crashes during training and routine peace-time flights – in July, a US Navy F-35, one of the most advanced fighters in the world, crashed in California. \nBut current military-geopolitical circumstances mean that Dubai’s Tejas crash attracts greater attention. Coming after Op Sindoor, which saw aerial battles with Pakistan, the crash will certainly get the rumour mills churning. That Pakistan’s China-made JF-17 was also taking part in Dubai will add masala to the narrative. This crash is, there’s no getting away from it, awful PR for India. But more substantive issues are at stake. \nThe Tejas project has been hit by massive delays in production. For example, deliveries of Tejas MK1A were to start from Feb 2024. But thanks to engine delivery delays by America’s GE and other issues with integration of electronic warfare suite and specialised munitions, deliveries will only begin next year. IAF has been poorly served by those in charge of Tejas. But indigenisation must continue despite setbacks. IAF’s squadron numbers are down, especially with the retirement of  MiG-21s. Given India’s strategic-security challenges, thanks to a China-Pakistan nexus, Tejas is absolutely vital for IAF. It’s supposed to bulk up the air force to the point where multi-theatre deployment is not an issue. Dubai is a tragic reminder of that imperative.\n\n",
        "headline_1": "Bad Optics But…",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/bad-optics-but/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 23, 2025 00:00:00  \nMiscreants gunned down a political worker reportedly belonging to the youth wing of the Bangladesh Nationalist Party (BNP), named Golam Kibria, on Monday (November 17) evening from Pallabi area in the city, unchallenged either by the watching public or any law-enforcer. Evidently, this is a tragic commentary on law and order obtaining in the city since long. Sadly though, Kibria has been just another victim in a series of similar killings taking place in the city in broad daylight passively watched by onlookers and, to all appearances, in absence of law enforcers. And in about every case of these killings, the police have been found to act after, not before, the tragedy had taken place. The CCTV footage at the scene of the murder, in most cases, helped the police to identify and track the felons.\n But since the next general election is around the corner and turf war among rival groups of different kinds increases during such times, the police are expected to be more proactive than reactive and have the necessary intelligence to prevent such killings before they happen in the first place. So, despite the police's commendable success in tracking and arresting some of the killers, the general public would like to be reassured with the knowledge thar the police force can outsmart the miscreants, not the other way around. \nThe Dhaka Metropolitan Police (DMP), in this connection, is learnt to have told the media that in the last 10 months of this year, 198 murders have occurred, which is equivalent to about 20 killings a day. Even for a megacity with such a large population like Dhaka, this is not a small figure when it comes to counting the number of felonies being committed in a day. And there is also no room for complacency either, believing that it is within the tolerable limit s as some in the police would like to think, according to some reports. In this connection, one may take into consideration the country's average of nine homicides a day as recorded last year, according to some reports, taking place across the country including the most violent days of student-led uprising during July and August. And over the last decade, countrywide, this figure ranged between nine and 10 homicides a day, going by those reports. Notably, every homicide is not a murder, since murder involves killing someone with intent. From that point of view, the capital city's daily count of murders is rather on the higher side.\n There might be more than one factor at play. Since most of the police stations in the city as elsewhere in the country were not functional as a result of widespread violence involving attacks on thanas in the wake of the July uprising, on many occasions, people went to the police stations to file cases against homicides that took place last year (2024) after things settled down in 2025. That might have led to this apparent rise in the average figure of daily homicides in the current year. But such explaining is not going to dispel fears and anxieties in the public mind about their safety in day-to-day lives. As a consequence, many are not willing to file cases with the police even after being threatened or attacked by criminals. And just watching incidents of gruesome murder happening before them without coming to the aid of the victim (s) is yet another case in point. Some experts on social psychology would like to call it a kind of withdrawal syndrome on the part of victims believing that would guarantee them safety. But the fact remains that it only emboldens criminals to commit violent crimes with impunity. The police must take responsibility and play its role to hold criminals to justice to reassure the common people about their safety.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Police should act to combat violent crime",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/police-should-act-to-combat-violent-crime-1763823580",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       November 23, 2025 00:00:00  \n\nThe financial sector in Bangladesh is at a crossroads now amid the interim government's hectic efforts towards widespread redressal of irregularities, which has been long overdue. The task is challenging, and there is no quick fix for the problems created, deliberately or otherwise, by the previous autocratic government to facilitate plundering by its cronies. The result is a gradual erosion of the financial sector's strength and stability, increase in loan defaults, and weakening of several private commercial banks. Though signals of the financial sector's increased vulnerability were evident during the last few years of the now-ousted regime of Sheikh Hasina, regulators were unable to intervene effectively. In fact, the regulatory bodies became a part of the problem, as they were headed by unscrupulous and partisan officials devoted to serving crony capitalists. Control, tacit or otherwise, exercised by the autocratic regime also made it difficult for the media to publicise a series of irregularities in the sector. Nevertheless, some media had persistently tried to reveal the gross irregularities defying the pressure from the autocratic regime. \nAfter the fall of the Hasina regime on August 5 last year in the face of a student-led mass uprising that claimed the lives of at least 1,400 people, the Yunus-led interim government has taken a number of steps to address the vulnerabilities of the financial sector. During the ousted regime of Sheikh Hasina, loan defaulters received undue concessions and bank board directors got tenure extension. All these meant to enable the ruling-party cronies to loot the banks. These two factors made the overall financial sector more vulnerable. Data manipulation, backed by the past autocratic regime, also hid many real issues of the financial sector and provided a misleading picture. \nThe Bank Company Act 1991 put a restriction on the tenure of private bank directors for six years, which was removed in 2003. In 2013, under pressure from the International Monetary Fund (IMF), the act was amended to reinstate a six-year cap on a director's tenure, coupled with allowing two members of a family on the board. In 2018, the act was amended further to extend the director's tenure to nine years and the number of family members increased to four. In this process, the cronies of the autocratic regime tightened their grip, undermining the good governance in the banks. Five years later, in an aggressive move to expand the irregularities in the banks and allow massive-scale embezzlement, the act was further amended. Under the 2023 amendment, the director's tenure was extended to 12 years. Moreover, directors already on the boards were also allowed to continue for another 12 years. In this process, directors who were on the boards before 2013 also got an opportunity to hold the positions for a consecutive 20 years until 2035. The number of family members on board increased to five, including family affiliates. \nAs an effort to remove these distortions, the central bank has recently decided to cut the number of directors from a single family and their affiliates on bank boards from five to two. It also decided to restrict the continuation of a director's term on the board from 12 to six years. The draft amendment of the bank company act includes provisions which would be helpful to restore good governance in the banks by reducing family dominance. \nThe supporters of the ousted regime are trying to spread misinformation about the instability of the country's financial sector to mislead the people. They are, however, totally silent on how the ousted regime gradually distorted the financial sector and made the banks vulnerable. \nCentral bank statistics showed that the banking sector-wide Capital to Risk-Weighted Assets Ratio (CRAR) declined to 10.64 in June 2024 from 11.64 in December 2023. It further declined to 3.08 per cent in December 2024 and increased slightly to 4.47 per cent in June this year. So, the aggregate regulatory capital of the banking sector amounted to Tk 839.46 billion at the end of FY25, reflecting a shortfall relative to the stipulated minimum requirement of Tk 1,917.09 billion. Nevertheless, the positive thing is that most banks remained compliant with regulatory capital requirements. The Quarterly Financial Stability Assessment Report (April-June 2025), released by the central bank this month, showed that out of 61 banks, 39 maintained CRAR at or above 10 per cent of the regulatory minimum requirement. The downside is that 22 banks with CRAR below 10 per cent held more than two-fifths of the banking sector's total assets and around half of the total liabilities at the end of June this year. It means the banking sector is still vulnerable. \nThe sharp rise in non-performing loans (NPL) in the banking sector is another serious concern that also makes the financial sector vulnerable. The gross NPL ratio of the banking sector was 8.80 per cent at the end of FY23 which increased to 12.56 at the end of FY24 and further jumped to 24.13 per cent at the end of March this year. As a result, a large amount of capital is locked in NPLs limiting availability of funds for investment in vital sectors. Bangladesh Bank itself asserted: \"\"The banking sector is currently at a critical juncture, with ballooning NPLs, sluggish credit growth, and capital inadequacy. Good governance and structural reforms remain the priorities in addressing these challenges.\"\" (P-25, Bangladesh Bank Quarterly, April - June, 2025).\nA number of factors are behind the rise of NPLs after the July mass uprising. Earlier, banks were forced to conceal some NPLs under political pressure, coupled with some tricky measures. No such things exist now, and real pictures of NPLs are emerging. And, big cronies of the ousted regime are on the run and not repaying the due loans as their business and commerce are also disrupted heavily. The revaluation of the assets of five recently merged banks also contributed to an increase in NPLs by Tk 700 billion alone. Four of these banks were taken over by a big crony who siphond large sums through various irregularities. \nTo streamline NPLs, the central bank issued a master circular in November last year that tightened classification rules. The rules, effective from April this year, will further enhance NPLs. Thus, the country's financial stability would also be shaken. Nevertheless, what is more important is to get an overall picture of the financial sector's vulnerabilities. Otherwise, it will not be possible to fix the sector and make it stronger in the long run. That's why the alarming but accurate data on the financial stability is a must.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Restoring stability in  the banking sector",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/restoring-stability-in-the-banking-sector-1763823705",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       November 23, 2025 00:00:00  \nThe writing has long been on the wall that a powerful earthquake is quite likely any time. Friday's 5.7-magnitude tremor, with its epicentre in Narsingdi, sent a powerful jolt through Dhaka and surrounding areas. Many described the frightening shock as unprecedented in their memory, as buildings swayed like trees. \nAlthough moderate on the Richter scale, still the quake serves as stark warning of what a potentially devastating impact a magnitude-6 or stronger earthquake might be. Analysing seismic records, experts see a strong likelihood of a more powerful earthquake and suggest that Friday's tremor may even have been a \"foreshock.\" \nThey say that the fact that this country has not experienced any major tremor during the last two hundred years is all the more reason why a disastrous seismic calamity should be expected. And a series of small quakes that have already rocked Dhaka, Sylhet and Chittgong can be seen as precursors of a massive tragedy. If that proves true, a human catastrophe looms, as the majority of buildings in Dhaka have not been constructed in compliance with the building code.\nDhaka has about 2.1 million buildings, including around six lakh buildings which are over six storeys high. Experts warn that a magnitude-7 earthquake within 100 kilometres of the capital could lead to the collapse of nearly 35 per cent of buildings, leaving one to three lakh people dead or injured.\nAfter the Rana Plaza tragedy, buildings in the garment sector underwent rigorous inspections and were categorised based on their safety. \nHowever, no such systematic assessment has been carried out for Dhaka, the world's most densely populated city. \nFriday's tremor, which lasted barely 20 seconds, exposed just how dangerously vulnerable the city's structures are. The quake caused cracks and damage to many houses and structures in Dhaka city. Some buildings have even tilted.\nGiven the callousness of many city dwellers and property owners, the chances are high that many of them will continue to live in buildings with visible cracks or structures that have become tilted. This inaction is an invitation to future disaster. Experts therefore stress the urgent need for a comprehensive inspection of every building in the capital.\nThey say that all buildings must be categorised into three groups: \"Green\" for risk-free structures, \"Yellow\" for those requiring repairs and \"Red\" for buildings that must be evacuated immediately. It is crucial to identify which buildings comply with the code, which need repair and which are hazardous.\nRana Plaza showed the catastrophic consequences of a large building collapse, and Friday's tremor brought back that painful memory. If cracks appear during a 5.7-magnitude quake, imagining the destruction a magnitude-7 could cause is not difficult.\nEarthquakes cannot be prevented, but their impact can be minimised through necessary preparedness. When a calamity is inevitable, the best we can do is limit damage through immediate rescue, relief and rehabilitation. The question is whether we have the necessary capacity. The country has experience and expertise in dealing with floods and cyclones, but not earthquakes. In the past, when a few multi-storey buildings in the city collapsed, the fire service took an inordinately long time to clear the rubble. The authorities therefore need to enhance preparation, invest in advanced rescue equipment and comprehensive emergency response training and raise public awareness. Without immediate and decisive action, a catastrophic consequence of a major earthquake remains \nan imminent threat.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ensuring  structural integrity of city buildings",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ensuring-structural-integrity-of-city-buildings-1763823731",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 23, 2025 00:00:00  \n\nNotable turning points in Bangladesh's transition to a cashless society include the development of the Interoperable Digital Transaction Platform (IDTP) and the rapid expansion of Mobile Financial Services (MFS). A closer look, however, reveals a regulatory \"Catch-22\" that could stifle the very innovation the central bank is trying to promote. As a safeguard for both consumer confidence and financial stability, Bangladesh Bank has correctly implemented a bank-led model for MFS, requiring banks to own a majority stake (51 per cent) in subsidiaries. Although this structure is essential for a new market, it frequently deters FinTech startups that are solely focused on technology and thrive on independence and agility. While the regulation was intended to protect the ecosystem, it unintentionally prevents disruptive, high-cost technological solutions from entering international markets.\nAdditionally, although the idea of a Regulatory Sandbox was created to enable the testing of novel products in a controlled setting, its full potential has yet to be realised. The market opportunity may change by the time a product passes the compliance hurdle, stifling the first-mover advantage that is crucial for FinTech success. This can occur if the Sandbox is not used promptly or efficiently. \nFirst, the central bank must establish a clear, expedited process with key performance indicators (KPIs) for product testing and deployment within the Sandbox, particularly in domains such as blockchain applications and artificial intelligence (AI)-based credit scoring. Second, for non-lending FinTech operations that are not systemically significant-such as wealth management or insurance aggregation-the government should consider implementing a tier-based licensing scheme. This could increase competition and specialisation by enabling tech-focused, non-bank organisations to operate with proportionate capital requirements. \"Safe innovation,\" not \"zero risk,\" should be the goal. \nSuraiya Fahmida Twinkle\nBachelor of Business Administration\nNorth South University \nsuraiya.twinkle@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Regulation and the FinTech 'Catch-22'",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/regulation-and-the-fintech-catch-22-1763823753",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-11-2025"
    }
]