[
    {
        "full_article": "Judging by the statements and readouts from both sides, Chinese Foreign Minister Wang Yi’s two-day visit to India this week was extremely productive. While Mr. Wang was in Delhi at the invitation of NSA Ajit Doval for the 24th Special Representatives talk on the boundary question, he also met External Affairs Minister S. Jaishankar for bilateral talks and the normalisation process after the four-year military standoff at the Line of Actual Control. Mr. Wang was also received by Prime Minister Narendra Modi who said that he would travel to Tianjin for the Shanghai Cooperation Organisation (SCO) meeting. Mr. Modi will meet with Chinese President Xi Jinping. In Delhi, India and China agreed to resume border trade at three points, restart direct flights, expand the Kailash Manasarovar yatra slots for pilgrims and relax visas. While there were positive discussions on the lifting of export restrictions by China on fertilizers, rare earth products and boring machinery, it is unclear whether there was headway on China’s demand that India lift its scrutiny of Chinese FDI in Indian companies. The two sides agreed to expedite the process of boundary resolution of the 3,500 km India-China border. Significantly, the Modi government agreed to build on the 2005 agreement of Political Parameters and Guiding Principles for the Settlement of the India-China Boundary Question. Meanwhile, the Chinese Ambassador Xu Feihong said that China opposes the U.S.’s “bully” move of imposing 50% tariffs on India.The outcomes indicate that Delhi has decided it can now “move ahead” from the PLA transgressions, Galwan clashes and the standoff. While Mr. Doval said that the “borders have been quiet”, the government was made uncomfortably aware that even with a stable border, other long-standing problems will continue to shadow ties. Mr. Wang later left for Kabul to work with Pakistan and the Taliban on a plan to extend the BRI and China-Pakistan Economic Corridor — India is opposed to both — into Afghanistan. He then flew to Islamabad for a strategic dialogue with his Pakistani counterparts. China’s diplomatic support to Pakistan after the Pahalgam attacks and during Operation Sindoor did not come up during Mr. Wang’s visit, but provide an ominous overhang to ties, as did Ambassador Xu’s contention that Pakistan too is a victim of terrorism. While the U.S.’s attack on Indian trade and economy may be spurring New Delhi’s efforts, the reset with China must not come from a perceived position of weakness, and the next steps must be taken keeping in focus the strategic challenge.READ MORE Published - August 23, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        China\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        India-China\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Iran\n                    \n                            /                      \n                        \n                        air transport\n                    \n                            /                      \n                        \n                        religion and belief\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        fertiliser\n                    \n                            /                      \n                        \n                        rare earths\n                    \n                            /                      \n                        \n                        foreign investment\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        Belt and Road Initiative\n                    \n                            /                      \n                        \n                        Afghanistan\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025",
        "headline_1": "​A productive visit: On India-China ties",
        "headline_2": "India and China seem ready to put behind the memory of Galwan clashes",
        "link": "https://www.thehindu.com/opinion/editorial/a-productive-visit-on-india-china-ties/article69965402.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-08-2025"
    },
    {
        "full_article": "Mistakes and misinterpretations must not be confused with cases of malicious misinformation. The filing of FIRs against a researcher associated with Lokniti, a programme of the CSDS, and the Indian Council of Social Science Research (ICSSR)’s show cause notice to the CSDS, represent yet another troubling chapter in the recent erosion of academic freedoms in India. The trigger seems to be a post on X by Lokniti co-director Sanjay Kumar, which had erroneous data about reductions in the electoral roll in some constituencies in Maharashtra. Expressing regret, Mr. Kumar deleted the post. Yet, the BJP governments in Maharashtra and at the Centre have weaponised what is a mistake to launch broader attacks on the institution, despite the post having no connection to the Opposition’s allegations about inflated electoral roll numbers during the 2024 Maharashtra Assembly elections. The ICSSR’s insinuations about the CSDS-Lokniti’s funding arrangements echo the treatment meted out to other premier institutions. The Centre for Policy Research faced tax surveys that resulted in the cancellation of its foreign funding licence and tax-exempt status. This targeting suggests a coordinated effort to silence independent research voices rather than address administrative concerns. Such acts have led to India’s ranking falling to the bottom 20% among 179 nations in the 2024 Academic Freedom Index published by the V-Dem Institute.Institutions such as CSDS-Lokniti serve a vital democratic function by conducting empirical research that helps understand policy implications. Through its National Election Studies and comprehensive data archive, Lokniti has helped transform the study of Indian politics to one based on rigorous, large-scale empirical inquiry. Its survey on the verification documents listed by the ECI during its Special Intensive Revision exercise in Bihar, among voters across five States and one Union Territory, exemplifies this. Rather than acknowledging the finding that the availability of such documents is rather low among a large cohort of voters in India, and places onerous burdens on voters in the event of a country-wise SIR, the ICSSR has characterised this research as an attempt to malign the ECI. How can policy effectiveness be assessed without rigorous empirical investigations such as well-designed and transparent opinion surveys? The current government has also undermined its own statistical apparatus. The delayed Census and suppressed statistical surveys point to discomfort with independent and critical analysis. As India navigates complex development challenges, it desperately needs the kind of critical feedback and evidence-based analysis that institutions such as the CSDS provide. Silencing these voices through administrative harassment and funding restrictions serves neither good governance nor national interest.READ MORE Published - August 23, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        election\n                    \n                            /                      \n                        \n                        Maharashtra\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Maharashtra Assembly Elections 2024\n                    \n                            /                      \n                        \n                        research\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        population and census",
        "headline_1": "Targeting research: On the silencing of independent research voices",
        "headline_2": "Attacks on research institutions reflect India’s declining academic freedoms",
        "link": "https://www.thehindu.com/opinion/editorial/targeting-research-on-the-silencing-of-independent-research-voices/article69965733.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-08-2025"
    },
    {
        "full_article": "They were a perfect match, on paper. Anant, 42, and Maya, 36, looked like the poster couple of Chennai’s idea of balance: modern careers with traditional roots. He loved long business trips, Carnatic music, and his curated solitude. She sparkled at social gatherings, carried family histories in her memory like a living archive, and believed love meant being part of every important moment in her partner’s life.\nIf he was giving a keynote in Bengaluru, she wanted to be there, clapping the loudest. If there was a cousin’s upanayanam (thread ceremony) in Madurai, she wanted to stand beside him in every family photo. For Maya, not being present meant not being significant. For Anant, being alone was sometimes the only way to stay sane. On paper, they were compatible. In practice, they were combustible.\nRead more on TOI+\n\n",
        "headline_1": "The filter coffee of love: Addictive but unsustainable",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-filter-coffee-of-love-addictive-but-unsustainable/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-08-2025"
    },
    {
        "full_article": "By Ezekiel Isaac Malekar\nWhat is the purpose of religion? Is it to elevate our souls and to bring us as close as possible to God? The true purpose of religion is to bring out the potentialities of everyone to create a new Garden of Eden. To this, we must maintain a high level of spirituality otherwise we will stoop to illicit means to obtain our goals.\nActs of charity, loving kindness and righteousness are outward manifestations of an interior faith. Religion is not an abstraction and selfish quest for personal satisfaction. It is a quest for the perfection of the world through deeds of kindness.\nJudaism lays a great emphasis on importance of a good moral life at every moment. Charity must be practised, and a proportion of one’s income should be earmarked for this purpose, as a visible expression of universal love. Charity also saves a man from death.\nAnd when you reap the harvest of the land, thou shall not wholly reap the harvest of the land, thou shall not wholly reap the corners of the field when thou reapest, neither shall thou gather the gleaning of thy harvest; thou shall leave them for the poor and for the stranger.\nThere are three characters among men – he who says, what is mine is mine, and what is thine is thine; he is a neutral character. He who says what is thine and what is mine is thine, is a saint. He who says what is thine is mine and what is mine is mine; is wicked. Torah says, “Happy is he who giveth to the poor,” but “Happy is he who wisely considers the poor.”\nIn Judaism, the concept of charity is called Tzedakah, a Hebrew word that means ‘righteousness’ or ‘justice’. It is a religious obligation to help others and bring fairness to the world, and it is not limited to financial donation. Tzedakah can include giving money, showing kindness, charity, good deeds, building relationships and contributing time and effort. Judaism holds anonymous giving to people who are less fortunate with compassion as the highest form of charity.\nThere are Maimonides, Eight degrees of giving, one higher than the other. He who gives grudgingly, reluctantly, or with regret. He who gives less than he should but gives graciously. He who gives before he is asked. He who gives without knowing to whom he gives although the recipient knows the identity of the donor.\nHe who gives without knowing to whom he gives, neither does the recipient know from whom he receives. He who helps a fellowman to support himself through a gift or a loan. Or by finding him employment, thus helping him become self-supporting.\nLife and death are part of the divine plan for the world. Since life is the most sacred gift of God, we are all obliged to fulfil obligation to save lives of our fellow brothers and sisters. Let us all hope that we are all able to be kind, compassionate, loving, tolerant, nonviolent so that our planet is illuminated with peace and wisdom.\n\n",
        "headline_1": "Practise tzedakah, bring fairness to world",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/practise-tzedakah-bring-fairness-to-world/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-08-2025"
    },
    {
        "full_article": "The humble audio cassette deserves a second audition\nTaylor Swift’s new album will be out on tape also. It boggles the mind. TDK, Maxell, T-Series, does anyone make cassettes anymore? And tape’s a screechy, low-quality medium. Even its inventor, the late Lou Ottens, said, “People prefer a worse quality of sound out of nostalgia.” But it seems there’s a business case for tape. Gen Zers, who’ve not grown up spooling tangled tapes with a pencil, seem to like it as a collectible, perhaps. America’s buying about half a million cassettes every year.\nOn second thoughts, it’s a good thing. Despite audiophiles’ disdain for it, tape democratised music. Countries too poor to buy turntables fell in love with the two-in-one. Some 100bn cassettes sold worldwide. Tape gave new artistes a chance – pressing a thousand LPs wasn’t viable but with tape it didn’t matter whether you recorded one or a million. Big names didn’t like it though. At a congressional hearing in 1987, the chief complaint was that 300mn blank cassettes were sold in a year, as against 344mn pre-recorded ones. Cassettes made everyone a pirate. But those same big names used tape to ideate. A Michael Jackson tape with 12 unreleased tracks turned up not so long ago. The Beatles released their last “new” single in 2023 thanks to a demo tape John Lennon left behind “For Paul”. It couldn’t have happened had Jackson and Lennon made their demos on the cloud. Imagine! The tape is a gift that keeps giving.\n\n",
        "headline_1": "Tape Measure",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/tape-measure/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-08-2025"
    },
    {
        "full_article": "How one industry shapes cities, policies, even language\nIn 2021, Algeria became the last country to stop using a notorious petrol additive called tetraethyl lead (TEL). Countries where cars were mandatorily sold with catalytic converters had started banning it decades earlier. India did in 1999. Let the record show that leaded petrol was eliminated to save car exhausts, not people, although it was known to be a problematic chemical from the day it was poured into a sputtering engine in a GM lab in 1921.\nIn his book Saving Ourselves from Big Car, David Obst looks at the many ways ‘Big Car’ – which he describes as not only the big carmakers but also “oil, insurance, media, tyre, and concrete industries” working in concert – has impacted human life, with special emphasis on the additive. \nTEL was known to cause hallucinations in workers who made it, and later research has linked it to the pre-1990s crime rate spiral in US, the country with the maximum cars clocking the maximum miles. Seemingly, exposure to TEL lowered IQ in children, and their ability to delay gratification, which increased the likelihood of committing theft, rape, murder, etc. How was Big Car complicit in this? They knew some of TEL’s worst health impacts, but since it prevented engine knocking and backfiring, and made engines “purr”, they told lies to keep selling it.\nIt was an age when doctors sold their soul to Big Tobacco for a few dollars. Thomas Midgley Jr and Robert Kehoe were scientists in this mould. Midgley demonstrated the safety of TEL by rubbing it on his hands (he was violently sick afterwards) while Kehoe testified for $100,000 – about $1.8mn today – that the chemical was as safe as water. \nBig Car has only grown more powerful with time, Obst says. “The combined wealth of this collaboration is more significant than all sovereign nations, except US and China.” That’s why no amount of environmental reporting stops the construction of four-lane highways in the hills. There’s mountains of research showing that making roads and parking lots does not solve the urban congestion problem, yet new roads and flyovers keep getting sanctioned all the time. \nYou get a better idea of Big Car’s power from its financial clout. It employs over 3mn Americans to manufacture, distribute and service cars. Obst says the US car industry uses 20% of steel and 60% of rubber in the country. Car insurance alone is worth $300bn. America’s entire public transport expenditure comes to only $80bn whereas trillions are spent on maintaining the country’s 223mn cars. Things aren’t too different in other large car producing countries.\nAnd TEL isn’t the only stain on Big Car’s reputation. It resisted the installation of seat belts “because it would lower profit margins”. SUVs are extremely dangerous for pedestrians, but Big Car wants to sell more of them. It also keeps shaping our lives in unforeseen ways. Cars created suburban living, and made garages integral to houses. They popularised shopping malls and fast food – “people wanted to get back on the road quickly,” Obst explains. They’ve even standardised dialect – Americans listening to car radios for hours daily started sounding more and more like “network English”. This process has been on for 125 years already, and with the coming of electric and autonomous cars, we’re headed into uncharted territory.\n\n",
        "headline_1": "Free Will Is A Myth, The Truth Is Big Car",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/free-will-is-a-myth-the-truth-is-big-car/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 24, 2025 00:00:00  \nThe atmosphere at Dhaka University is charged with anticipation as the long-stalled DUCSU election draws near. This is a development that carries significance far beyond campus walls. Coming in the wake of last year's July Uprising which shook the nation's political order, the election stands as one of the uprising's most tangible legacies. After years of silence, students will at last be able to choose their representatives, offering hope that campus politics can move away from domination and violence toward accountability and inclusion. \nFor too long, the absence of a functioning student union at DU has allowed the worst forms of political influence to dominate campus life. A culture of fear and impunity took hold where muscle power stifled student voices and dictated the terms of student affairs. The last DUCSU election in 2019 was marred by rampant irregularities and violence, though the victories of candidates like Nurul Haque Nur and Akhtar Hossain stood out as milestones for student activism. Still, widespread dissatisfaction with other contested results left the union dysfunctional. Since then, no election has been held that left DU students without a legitimate platform to voice their concerns. As history shows, when such a platform is absent, the university risks becoming a place of fear rather than free thought. The classroom experience, vital as it is, remains incomplete without the complementary lessons in leadership, negotiation and civic responsibility that a vibrant student union provides. The current election, therefore, offers an opportunity to reverse this decline. But for DUCSU to be truly relevant, its leadership must prioritise the real issues shaping student life. If it merely becomes an echo chamber of national politics, parroting slogans instead of solving student problems, it will only deepen the sense of stagnation and disillusionment. \nAgainst this backdrop, the upcoming election carries not only the promise of restoring representation but also of breaking new ground. That spirit of renewal is most visible in the unprecedented participation of female candidates in key leadership positions. In the six decades since the last female vice president was elected, women have been virtually absent from the union's top ranks. Now, for the first time in generations, female candidates are contesting not only for the positions of vice president but also for general secretary and assistant general secretary, alongside a range of other posts. Many of these contenders emerged from the quota reform movement and the July Uprising, carrying with them the promise of a more inclusive and representative politics. Far from being merely symbolic, this development has the potential to reshape leadership pipelines and prepare women for greater roles in national politics beginning in their student years. What remains crucial is to safeguard this shift from the corrosive practices that have long discredited student politics. \nFor this election to truly realise its transformative potential, it must be conducted with integrity, transparency and an unwavering commitment to fair play. The university administration bears the primary responsibility for ensuring a level playing field for all candidates, keeping campaigning peaceful, and guaranteeing that voting takes place free of coercion or malpractice. Political parties, which have historically influenced and often corrupted student politics, must take a step back and allow students to choose their representatives freely. Candidates and their supporters must also remember that they are students first and political activists second. Their conduct will determine whether DUCSU re-emerges as a credible institution or sinks back into irrelevance. Ultimately, the success of this election will be judged not by who wins, but by whether it sparks lasting positive change in campus culture and restores the union's role as a genuine platform for student voices.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Turning the page on campus politics",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/turning-the-page-on-campus-politics-1755959125",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       August 24, 2025 12:00:00  \nAfter a sharp decline in the two consecutive years, the import of goods in the country registered a modest growth last fiscal year (FY25). Though to all appearances it looks positive, a deeper look into the overall import trend would reveal that it is a disturbing development.\nImports, in terms of clearing and forwarding (C&F) value, stood at US$68.35 billion last fiscal year, which was $66.72 billion in FY24. In terms of free on board (FOB), the value of imports was $64.34 billion and $63.24 billion, respectively in FY25 and FY 24. On average, the FOB value of imports is around $4 billion less than the C&F value. \nUnder the C&F arrangement, the exporter bears the cost and freight from the port of shipment to the port of destination, and the importer bears the cost of insurance and all other shipping charges from the port of destination to the final destination. If the exporter also bears insurance cost, it becomes a CIF arrangement. Again, under the FoB (Free on Board) arrangement, the exporter bears the cost of delivering items to the nearest port, but then the importer is responsible for the shipping and all the other charges.\n\nFor imports valuation, the United Nations (UN) International Merchandise Trade Statistics (ITMS) use a CIF-type valuation. The Balance of Payments and International Investment Position Manual, sixth edition (BPM6) of the International Monetary Fund (IMF) opts for an FOB-type valuation for both imports and exports. That's why in the balance of payment table, values of both the exports and imports of goods are calculated in FoB terms.\n The World Trade Organization (WTO) uses CIF valuation for imports, which means transaction value plus the cost of transportation and insurance to the frontier of the importing country or territory. For export, it follows FOB valuation, meaning transaction value, including the cost of transportation and insurance to bring the merchandise to the frontier of the exporting country or territory. \nSo, Bangladesh customs applies the CIF valuation for goods imported from abroad, whereas Bangladesh Bank uses FoB for the BoP table. Nevertheless, the value of imports of goods is generally expressed in CIF or C&F terms.\nDuring the last fiscal year, the exchange rate of the Bangladesh Taka against the US dollar depreciated by 3.89 per cent, compared to the depreciation of 8.17 per cent in FY24. The moderate depreciation of local currency against the greenback made imports less costly in comparison to FY24, when sharp depreciation made exports more attractive and imports more expensive. \nThough imports registered a modest growth in the last fiscal year, statistics recorded by the customs authority showed that the imports of food grains and consumer goods posted double-digit growth. \nMetropolitan Chamber of Commerce and Industry, Dhaka (MCCI), in its 'Review of Economic Situation in Bangladesh: Q4 of FY25' said: \"The increase in imports could mostly be attributed to a significant rise in intermediate goods import, especially goods related to readymade garments (RMG), and a rise in food grains import.\"\nThe rise in food grain imports was due to a manifold jump in the import of rice in the last fiscal year. The total value of rice imports reached $682.4 million in FY25, which was only $25.4 million in FY24, and the second highest since FY18 when the country had paid $1746 million for importing the staple food. Import of wheat, however, declined by 20 per cent last fiscal year. Food ministry statistics showed that the combined output of food grains (rice and wheat) fell short of the target by 1.26 million tonnes and reached 42.96 million tonnes last fiscal year, marking a 2.60 per cent increase over FY24. Of this, rice production stood at 41.92 million tonnes, which was only 3 per cent higher than the previous fiscal year. The lower output of rice drove the surge in imports last fiscal year when the total volume of imports of food grains stood at 1.04 million tonnes, recording around 16 per cent growth in imports. \nHowever, there is a significant discrepancy in the rice output data. The agriculture ministry has consistently reported a higher rice output, a practice that gained momentum during the now-ousted Hasina regime. This was part of an effort to manufacture various economic performance indicators and establish a more positive picture of development. \nA rise in imports of consumer goods by 15 per cent last year was mainly due to a surge in imports of edible oil by 24 per cent and pulses by 34 per cent, driven by increased demand and a price hike in the international market. \nImports of overall intermediate goods increased last fiscal year, recording a modest growth of 2.80 per cent over FY24. As intermediate goods cover around 60 per cent of the total imports of goods, they are the dominant factor in setting the direction of imports in the country. Though imports of RMG-related intermediate goods increased significantly, there was a decline in imports of petroleum goods and other intermediate goods, including chemicals, fertilisers, iron, steel and other base metals. The decline indicates lower demand due to a slowdown in the production activities of these industries. Bangladesh Bank, in its monthly update of the major economic indicators, asserted: \"The upward move, especially in imports of intermediate goods, highlights a rejuvenation of economic activities across key industries during the comparative timeframe.\"\nHowever, the decline in imports of capital goods by 10 per cent last fiscal year clearly showed the sluggishness in the overall industrial activities in the country. Capital goods, having a 14 per cent share of total imports of goods, generally reflect investments in infrastructure and machinery to bolster long-term productive capacity.\nIn other words, the fall in imports of capital goods indicates that there is a slowdown in the country's investment situation. It is also reflected in the provisional statistics of the gross domestic product (GDP), released by the Bangladesh Bureau of Statistics (BBS), which showed that the investment-GDP ratio declined slightly to 30.70 per cent last fiscal year from 30.90 per cent in FY24. So, rebounding of investment in the current fiscal year is a big challenge and progress in this regard will also be reflected gradually in the rise in imports of intermediate and capital goods.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "A quick review of FY25  import scenario",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/a-quick-review-of-fy25-import-scenario-1755959177",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       August 24, 2025 00:00:00  \nThe impact of microcredit on small borrowers can be good, bad or, in some cases ugly with tragic consequences. But one thing is clear that microcredit has not sent poverty to the museum; rather, it has ensnared a majority of the poor borrowers even deeper in the trammels of poverty. Two recent suicide incidents have once again brought to light how microcredit can entrap its supposed beneficiaries in a vicious cycle of debt, ultimately leading them to commit suicide to escape this treacherous trap.\nIn a chillingly tragic incident in Paba Upazila of Rajshahi on August 15, a poor farmer, Minarul Islam (30), hanged himself after killing his wife, Monira Begum (28), their son Mahin (13) and daughter Mithila (3). In a suicide note, Minarul wrote that a crushing debt burden and grinding poverty had driven him to this desperate act. \nJust days later, in Mohanpur, Rajshahi, another farmer named Akbar Shah (50) was found hanging in his betel-leaf garden. He too was reportedly distressed over loan repayments and the low price of his crops. Police recovered loan documents from over a dozen NGOs from the homes of both farmers.\nThese are not, however, isolated incidents. Rather, they have been occurring at regular intervals for decades. A suicide epidemic caused by debt distress has also been reported in other countries, such as India, which have replicated Bangladesh's microcredit model.\nThe gravity of the situation and the prevalence of this problem can be understood from the words of a local representative in a Rajshahi upazila. In an interview with a national Bangla daily, he stated, \"About 75 per cent of the people in my upazila have taken loans from NGOs, and once the repayment begins, it never ends.\"\nYes, once people fall into this trap, few can permanently throw away this albatross around their neck. The reason is that microcredit has a self-perpetuating character. First, loans are saddled with an interest rate of about 20 per cent, which can rise to 35 per cent or even higher because of compound interest.\nCompounding the problem is the fact that repayments on loans begin from the very first week, which gives borrowers almost no time to establish an income-earning enterprise. To cover the installments of first few weeks, borrowers often have to resort to taking out a further loan from a different NGO. Thus, much of the repayment of the loan is in fact fresh loan in disguise, contracted from other agencies to pay off the old debt and save the borrower from default. Thus in many cases the recipients far from getting enriched find themselves stuck in a vicious cycle. To free themselves from this trap, many of them end up selling their cows, farmland and homestead - the very last valuable possessions they have.\nThe original objective of microcredit is to reduce rural poverty by enabling people to establish small businesses or raise livestock and poultry. However, in many cases, rural people are taking loans to meet family emergencies or to simply cover daily expenses, with some even squandering the money on online gambling. Loans are often disbursed without verifying whether the money will be used productively, if borrowers are already in debt elsewhere, or if they might require repayment rescheduling after a disaster. For many NGOs, the goal seems less about poverty alleviation and more about profiting from interest payments.\nThis is not what Dr Muhammad Yunus envisioned when he pioneered microcredit in the 1970s. He wanted to empower poor rural women, not to entrap families in a cobweb of debt. Now that Dr. Yunus is at the helm of the interim government, it is incumbent upon him to revisit and put things straight in the microcredit sector so that none can trade on poverty and exploit the poor.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Time to reform microcredit",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/time-to-reform-microcredit-1755959342",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 24, 2025 00:00:00  \n\nThe ready-made garment (RMG) sector is the backbone of our economy, accounting for around 84 per cent of total export earnings. While this industry has secured a strong position in the global apparel market, it now faces the dual challenges of climate risks and the growing international demand for sustainable production.\nBangladesh has made commendable progress in this area. According to the U.S.-based Green Building Council (USGBC), as of July 2025, the country hosted 202 LEED-certified green factories, more than 70 of which are Platinum rated - the highest number in the world. Factory owners report that eco-friendly technologies have helped reduce electricity and water usage by 30-35 per cent, while also lowering production costs.\nYet the transition is not without hurdles. Building sustainable infrastructure requires an additional USD 25-30 per square foot, and medium-sized factories often need USD 5-10 million in extra investment. For small and medium entrepreneurs, this remains a formidable barrier. Adding to the challenge, international buyers are often unwilling to share the costs of sustainable production, despite pressing suppliers to cut carbon emissions by 50 per cent and achieve zero-waste production by 2030.\nIf Bangladesh can meet these requirements, the rewards could be substantial. A McKinsey report suggests that sustainable practices could generate an additional USD 20-25 billion in apparel export earnings by 2030. To realize this potential, industry experts stress the need for government support in the form of duty exemptions on eco-friendly machinery, low-interest green loans, tax incentives for renewable energy use, skilled workforce development, and easier access to international certifications.\nSustainable and environment-friendly RMG is no longer optional, it is essential for survival. With the right mix of policy support, investment, and innovation, Bangladesh can not only safeguard its RMG sector but also strengthen its global leadership in sustainable apparel.\nSakibul Hasan\nDhaka College\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Sustainability key to RMG's growth",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/sustainability-key-to-rmgs-growth-1755959356",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-08-2025"
    }
]