[
    {
        "full_article": "When the Supreme Court of India upheld the validity of criminal defamation in Subramanian Swamy (2016), reasoning that reputation is part of the right to life, it may not have anticipated the difficulties of this position. On September 22, 2025, during criminal defamation proceedings against the Foundation for Independent Journalism, Justice M.M. Sundresh of the Court voiced his unease at the growing use of criminal defamation proceedings by private individuals and political actors as an insurance against criticism and as a means of retribution. His observation echoes a broader judicial anxiety expressed in recent proceedings against Rahul Gandhi, Shashi Tharoor and other public figures: that the law is being misused. Criminal defamation proposes imprisonment for speech that injures reputation, a remedy disproportionate to the harm caused. Unlike physical harm, reputational injury can be addressed adequately by monetary damages or injunctions. While protecting dignity may justify strong safeguards, protecting reputation seldom warrants criminal punishment. Since 2016, criminal defamation has become a tool of intimidation. Editors of The Hindu faced such cases under the Jayalalithaa government, and Mr. Gandhi over remarks about political leaders, with trial courts issuing summons that required the Court’s intervention. The tendency of the lower judiciary to issue summons without weighing the threshold of defamatory speech has aggravated the problem.The law has also become an instrument of propaganda: criminal complainants have weaponised statements taken out of context or distorted in circulation, which the law has compounded by attaching the threat of jail time to contested interpretations. In this way, criminal defamation has fostered opportunistic litigation. For example, Subramanian Swamy versus Sonia Gandhi and Mr. Gandhi (2012-14) entangled rivals in a punishing process rather than seeking timely resolution, while suits filed by Nitin Gadkari and Arun Jaitley against Arvind Kejriwal and AAP leaders kept the Delhi government from performing its duties. For journalists in towns, criminal defamation complaints from local politicians or business interests create the risk of arrest and onerous travel to distant courts, fostering self-censorship. Instead, those genuinely aggrieved can approach civil courts for damages, injunctions or retractions, which address the harm of reputational injury and strike a balance between free expression and protecting reputation. Importantly, civil proceedings also reduce the scope for misuse by the powerful to silence criticism. Many countries, including the U.K., have abolished criminal defamation because such laws are incompatible with democratic debate. It is time for India to follow suit. Published - September 24, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        crime, law and justice\n                    \n                            /                      \n                        \n                        human rights\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        Aam Aadmi Party\n                    \n                            /                      \n                        \n                        Delhi\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        Tamil Nadu",
        "headline_1": "​Penalty in proportion: On growing use of criminal defamation proceedings",
        "headline_2": "Criminal defamation is incompatible with democratic debate",
        "link": "https://www.thehindu.com/opinion/editorial/penalty-in-proportion-on-growing-use-of-criminal-defamation-proceedings/article70084730.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-09-2025"
    },
    {
        "full_article": "When the state of Israel was declared in Palestine on May 14, 1948, the U.S. recognised it in just 11 minutes. In the years since, most UN members extended recognition to the Jewish nation, which became a UN member in 1949. When the Palestine Liberation Organisation (PLO) declared a state of Palestine in 1988, much of the Global South recognised it, but powerful western nations stayed away with the position that recognition would come only as part of a negotiated two-state settlement. But this week, at the UN General Assembly, the U.K., France, Canada and Australia finally recognised Palestine, which shows their fraying ties with Israel and diminishing faith in a coercion-free diplomatic process leading to a final settlement. For Palestinians, the western recognition could be seen as a diplomatic respite but comes too late — Gaza has been devastated by Israeli forces; Jewish settlements and Israeli checkpoints have mushroomed in the West Bank; and settler violence has displaced thousands of Palestinians over the past two years. Israel’s Prime Minister Benjamin Netanyahu openly declares that there will never be a Palestinian state, and Washington offers Israel unconditional support.Recognition may not have an immediate impact on the ground. Israel’s ruling coalition is incapable of even ending the slaughter in Gaza, let alone discuss a two-state solution. Yet, this wave of recognition is not just a symbolic act. It shows cracks in the post-1948 pro-Israel consensus in the West. The U.K. played a decisive role in the establishment of the state of Israel. France armed it in its early years and helped it build nuclear weapons. These powers bear historical responsibility to find a solution to the problem they were a party to from the beginning. And Palestinians have an internationally recognised right to have their own independent, sovereign state. If Israel does not stop the war in Gaza, which should be the first step, and continues with the settlements in the West Bank, Europe should impose an arms embargo on Tel Aviv. Israel should be warned against annexing the West Bank, which should be treated as a red line. Mr. Netanyahu and his extremist Ministers, though internationally isolated, will not be persuaded. But they will not rule forever. A future Israeli leader could abandon Mr. Netanyahu’s militarism. This forever war and genocidal tag are not helping Israel’s interests either, even though it allows Mr. Netanyahu to cling on to power. The recognition of today should serve as a stepping stone for a Palestinian state tomorrow. That is the best chance for peace for Palestinians, Israelis and West Asia.\r Published - September 24, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        history\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        Palestine\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        United Nations\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        France\n                    \n                            /                      \n                        \n                        Canada\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        diplomacy",
        "headline_1": "Right to state: On growing recognition of Palestine",
        "headline_2": "Recognition of Palestine is more than just symbolic",
        "link": "https://www.thehindu.com/opinion/editorial/right-to-state-on-growing-recognition-of-palestine/article70084754.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-09-2025"
    },
    {
        "full_article": "Yes, it is time to decriminalise defamation. But will SC pick up the ball first or Parliament?\nDefamation laws drafted by British Raj in the 1830s, designed for ruling over a colonised people, continue to suppress dissent and torment free speech in the thrillingly polyphonic India of 2025. This just doesn’t make any sense. And the Supreme Court couldn’t be more right in observing that “it is time to decriminalise all this.” Yes, the court itself passed on a chance to do this a decade ago. Also yes, several times in the years since it has come to the rescue of persons oppressed by frivolous to mala fide FIRs. Its various judgments have by now concertedly built such a strong case for reforming criminal defamation that this, paradoxically, need no longer depend on SC alone. \nConsider how GOI has been on a mission to decriminalise sundry laws, to improve both the ease of doing business and ease of living. For example, the Jan Vishwas 2.0 Bill introduced in Lok Sabha in the monsoon session, which is now with the select committee, seeks to decriminalise or rationalise more offences and penalties after the first, 2023 round. In a logical sequel, Parliament should also decriminalise criminal defamation, rebadged BNS Section 356. Ironically, the reasoning is just the same as that used by the erstwhile colonialists for their 2009 reform. UK came to see the continued retention of criminal defamation as putting it in the company of the world’s most repressive regimes, where it takes bravery to criticise powerful institutions and people.\nRahul Gandhi’s disqualification from Parliament in March 2023 was a stark illustration of how criminal defamation can distort representative democracy itself. In another case, a court found criminal defamation being used as a sword against women’s rights. In multiple cases, the provision is clearly targeted at repressing journalistic expression. It should not take bravery to either exercise the public’s right to know or to satirise power or uphold the fundamental democratic value of open debate. Reputation does matter but if civil law suffices as the proportionate protection for it in other major democracies, why not in India? \n\n",
        "headline_1": "Reputationitis",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/reputationitis/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-09-2025"
    },
    {
        "full_article": "Consumers in US feel the shock waves of inflation as a result of Trumpian tariffs \nThe White House MAGAdomo, Peter Navarro, walks into the Oval Office looking harried. Donald Trump is standing before a dartboard shaped like a map of India, holding darts marked Tariffs, Sanctions, H-1B Visas. \nDonald Trump: Hiya Pete. You’re lookin’ kind a shook. Wassup? \nPeter Navarro: I’m not just shook Boss, I’m shocked. In fact, all of America’s shocked, by the prices of everything from T-shirts and TVs to shrimps and shoes. And it’s all because of your tariffs. \nDT: But my tariffs were supposed to have brought in billions and billions of dollars into the country and made everyone MAGA rich! \nPN: I think there was a small misunderstanding about how tariffs work. You thought that all those countries like India and China you hit with tariffs would foot the bill for the tariffs and pay us. \nDT: Yeah, that’s right. You tariff guys an’ they gotta pay you for being tariffed. \nPN: I’m afraid you got it a teeny-weeny bit wrong, Boss. It’s our importers of T-shirts, and TVs, and shrimps, and shoes, who have to pay the tariffs, which they pass on to consumers, who end up paying higher prices for everything. It’s called inflation. \nDT: Heck! You mean to say Americans are payin’ my tariffs? Why didn’t you tell me how tariffs work? Aren’t you an econolomist or sumthin’? \nPN: I am an economist, but when I was doing Economics 101, I must have missed the lecture on Tariffs.\nDT: I know what we’ll do. We’ll just get our Treasury guys to print up lots and lots more dollars which we’ll hand out to people so that they can pay the higher prices an’ get those supermarket trolleys full again. \nPN: Sure, but it’ll get them full not of T-shirts and TVs; it’ll get them full of cash because it’ll take a trolley-load of dollars to buy a single loaf of bread. It’s called hyper-inflation… \n\n",
        "headline_1": "What price America?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/what-price-america/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-09-2025"
    },
    {
        "full_article": "It takes much to build a brand but not much to tarnish it. A good brand can even survive market reversal\nAbout 5,000 years ago, Kushim was the administrator of a silo in what is now Iraq. Barley accounts on clay tablets were considered credible only when he stamped his name under them. That’s how we know Kushim – the oldest recorded name in history. But Kushim’s story also answers Juliet’s question: “What’s in a name?” A lot, because a name isn’t just a word out of the dictionary. Applied to an adult – whether human or corporate – it is shorthand for their many traits. Which is why Swedish automaker Volvo fought for 30 years to bar an Indian towel maker from using its name, and won the case recently.\nIt’s not the first case of trademark infringement in India. BMW vs DMW e-rickshaw, Facebook vs Facebake cake shop, and Starbucks vs Sardarbuksh Coffee, are just some of many examples. These court battles might seem pointless because the infringing party is tiny and incapable of stealing market share. But the issue here is reputation. Premium brands like Volvo and BMW don’t want to be cheapened in the eyes of their prospective buyers. They also don’t want to be mired in controversies arising from the actions of copycats. \nIn business, brands are everything. They grow when the groundwork – quality, reliability, etc – is solid. Ancient Japan laid down its first advertising code in 701CE, mandating every shop to display its name, and products like swords, spears, saddles or lacquerware to bear the maker’s name. There was no hiding behind anonymity, which probably led to Japan’s quality-conscious culture. Because brands are built with care, they take years to mature. And if the fundamentals remain sound, they can survive market reversals. Kodak’s core photographic film business has shrunk to around 5% of its peak, but its brand value remains strong. It earned $20mn last year just from licensing arrangements for apparel, etc.\nCountries are brands too. Afghanistan and N Korea don’t tempt tourists like Switzerland, for a reason. US is the strongest brand among nations, but Trump’s attacked it with a wrecking ball over the past eight months. There’s a lesson and an opportunity for other nations, including India, in this.\n\n",
        "headline_1": "Plenty in a name",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/plenty-in-a-name/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-09-2025"
    },
    {
        "full_article": "Kamala and Trump agree on H-IB-hit Indian men\nKamala is always irritated when I step out of the house on a Sunday: “You’re constantly chatting with the neighbours, or walking aimlessly around the area like these middle-aged uncles with no clear goal in life. Can’t you find something to do at home?”\nSo I plonked myself on the sofa and began reading the newspaper for the nth time. I had only left the obituary columns untouched. Several people started to look vaguely familiar on that page and so I read out the interesting ones aloud to Kamala just to clarify that we had not missed any deaths among family and friends. “You are the most morbid man in the world – nobody reads the obituaries with as much relish as you!” But like Gen Z checks social media to see what’s happening in their friends’ lives, Gen X scans these columns for life-changing events. Literally doom scrolling.\nThe front page had equally depressing news of some US visa fees being hiked yugely. To be or not to be H-1B, Shakespeare might have said if he was around. By the time a clarification was later issued that this was not an annual fee, panic and anxiety had already spread across the Indian diaspora. “It’s like raising GST and then lowering it again in an attempt to undo the damage,” Kamala said cynically, snacking on her cheaper caramel popcorn. Our neighbour NRI Naresha has cancelled his son’s wedding next week because of the uncertainty. Many of our friends are worrying that their kids won’t visit them this Diwali or Christmas.\nBut how about looking at this sunny side up? With Trump’s hefty visa fees adding a double whammy to his trade tariffs, Indians abroad now have a fresh chance to demonstrate their patriotism and love for their country – in their country.\nIn fact, like other Indian men on a Sunday, the story of the lives of non-resident Indians abroad trapped in geo-political storms beyond their control, can now be summarised in Raj Kapoor’s song from Jis Desh Mein Ganga Behti Hai – “Aa Ab Laut Chalein”, or Let us now return.  They also have the option of expressing their feelings by singing a version of the John Denver classic: “Country roads take me home. To the land I belong. Mera India.” And this may even be the subliminal message in India’s official entry for the Oscars this year. It’s serendipitously titled, Homebound.\n\n",
        "headline_1": "Homebound best be",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/homebound-best-be/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 24, 2025 00:00:00  \nThat the government is lately attaching due importance to the expeditious recovery of a huge amount of defaulted bank loans stuck in court cases is a piece of good news. The move initiated by the Financial Institution Division (FID) of the Ministry of Finance has been long overdue. It also coincides with the Supreme Court's formal request to the Ministry of Law to create specialised commercial courts to help speedy disposal of cases involving trade and finance issues. At a recent meeting, the FID reportedly discussed ways to expedite lawsuits long pending with Money Loan Courts (MLCs) filed by lenders and followed it up by initiating a coordinated drive to speedily settle 100 such cases involving around Tk 380 billion. \nNow, with the defaulters filing writ petitions with higher courts, the lenders often fail to recover the loans even after getting order from MLCs. When the banks, for instance, take steps to sell mortgaged properties against the defaulted loans, the habitual defaulters, many of whom being basically financial criminals, file fresh cases in the lower or higher courts to stop the sale or transfer of the mortgaged property forcing the lending banks or other financial institutions to wait for years to recover their loans. Small wonder that staggering sums of unrecovered loans are held up in tens of thousands of lawsuits with different courts including MLCs in the country. In this connection, a task force on economic reforms reported in early 2025 that more than Tk1.78 trillion was held up in over 72,500 court cases as of February 2024. The report further said that backlogs under the Money Loan Court Act and Bankruptcy Act remain a major obstacle to loan recovery. Structural flaws in the Money Loan Court Act 2003, low judge-to-population ratio, insufficient courtroom facilities, etc., come in the way of resolving NPL-related cases, the report added.\nIn this connection, of special concern are the multiple writ petitions filed by loan defaulters to stymie auction procedures called 'auction publication in newspapers'. But there are reports of delinquent borrowers who approach the higher court for judicial review of the auction publication of properties. The delinquent defaulting borrowers by such practices escape legal action by banks to realise bad loans. Interestingly, even the arrest warrants issued by MLCs are also often found to remain unenforced. Clearly, a criminal nexus is at work to help the fraudulent bank defaulters. So, the situation calls for required support from higher authorities in the home department so the arrest warrants issued from the MLCs are duly executed. So, for the latest move by the finance ministry to recover default loans to succeed, supports from all quarters including ministries, the attorney general's office as well as deputy commissioners to deal particularly with land-related cases will be required. In fact, as suggested during the deliberations at the FID meeting, when the court proceedings of cases are ongoing, presence of a representative of the lender that filed the case including from banks or other institutions in question, would be a useful part of monitoring to ensure that lawyers dealing with the cases of the lending institutions duly attend the court hearings. \nHopefully, the present novel approach adopted by the FID, particularly where multiple departments of the government would be simultaneously engaged to recover bad loans, might be able to make some headway in recovering a significant portion of the defaulted loans. Given the staggering sum of the non-performing loans (NPLs), the challenge before the FID is no doubt enormous. Admittedly, many default loan cases could not be settled and money recovered in time due to different factors including lack of proper monitoring. So, more proactive role on the part of all concerned will be necessary to meet the challenge of holding the notorious loan defaulters accountable to the law.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Expeditious disposal  of bank loan cases",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/expeditious-disposal-of-bank-loan-cases-1758639384",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       September 24, 2025 00:00:00  \nBangladesh once stood out as a development success story, celebrated for its laudable performance in lifting millions out of poverty. Today, that narrative is fast unravelling. For the first time in decades, poverty rates are climbing rather than falling. The irony is bitter: the economy is still growing, but the growth is not producing jobs or broad-based prosperity. Instead, it is deepening inequality, entrenching vulnerabilities and pushing families back into hardship.\nThis reversal was a stark message from a recent dialogue hosted by the Power and Participation Research Centre (PPRC), which brought together some of the country's respected economists and policy thinkers. Their findings should disrupt any complacency in policymaking circles. Poverty, they warned, has risen by nearly 10 percentage points since 2022. One in four citizens is now poor. One in ten is trapped in extreme poverty. Another 18 per cent-the \"vulnerable non-poor\"-are barely hanging on just above the poverty line, exposed to every shock.\nIt is a grim picture. The core problem is obvious: Bangladesh is running an economic model that celebrates GDP expansion while ignoring the most basic measure of development-jobs.\nThe phrase \"jobless growth\" has long been dismissed by policymakers as academic jargon. \nBut the evidence is now undeniable. Despite a decade of robust GDP numbers, unemployment stands at 2.73 million, with youth unemployment and underemployment at crisis levels. More than 40 per cent of young people are classified as NEET-not in employment, education or training. \nGrowth has not been translated into employment. Worse, inequality has widened, slowing poverty reduction. If joblessness defines one side of the poverty reversal, broken education and health systems define the other. Around 15.5 per cent of children between five and 18 are not in school, largely because their families cannot afford it. With households covering about 70 per cent of education costs, poor families are being priced out of opportunity.\nIn the dialogue, PPRC Chairman Dr Hossain Zillur Rahman calls it \"risk of generational poverty.\" Children denied schooling today are condemned to poor job or income prospects, creating a vicious cycle. When families cannot access health services or cope with chronic illness, the slide into debt and poverty accelerates. \nThe reversal is even more severe in rural Bangladesh. Agricultural growth is slowing, real wages for farm workers are eroding and rural non-farm income-a lifeline that accounts for 60 per cent of household earnings-is shrinking.\nIf the government truly wants to halt poverty, rural policy deserves urgent attention with a view to improving agricultural productivity, protecting workers' real wages, expanding rural employment, and pumping capital into the non-farm economy. Anything less will mean widening disparity between rural and urban Bangladesh.\nWhat makes this reversal particularly damning is that it was avoidable. Private investment has been stuck at 23-24 per cent of GDP for over a decade, while foreign direct investment has limped along below 1.0 per cent. These stagnant figures tell the story of an economy unwilling to expand opportunity.\nMeanwhile, the social protection system-the very safety net designed to catch the vulnerable-is fragmented, outdated, and shockingly inadequate. There are some 20 overlapping schemes, none of them delivering effectively.\nPoverty reduction in Bangladesh has meant nudging people just above the line, without ensuring a sustainable escape. The result is a population always staying one crisis away from collapse. Covid-19, inflation, and political turmoil have only exposed how fragile the model really is.\nThe problem is not just economic-it is political. For years, successive governments have basked in the glow of GDP numbers, ignoring the cracks beneath. Poverty reduction is no longer at the centre of the reform agenda. Job creation is treated as a side effect, not the main goal. Education and health remain heavily privatised, forcing poor families to pay what they cannot afford.\nThe way forward is not difficult to discern. Experts laid it out with clarity:\n• Put employment generation at the core of economic planning.\n• Reinvest in public education and healthcare to break the intergenerational poverty trap.\n• Address rural decline by supporting farm productivity and non-farm livelihoods.\n• Overhaul social protection into a shock-responsive, inclusive and data-driven system.\n• Remove bottlenecks to private and foreign investment to expand opportunities.\n Above all, policymakers must abandon the illusion that GDP growth alone will carry the poor forward. It will not. Bangladesh must now confront the hard truth: poverty reduction has stalled because growth has been hollow. Bangladesh's poverty reduction journey was once built on bold choices-empowering women through microfinance, expanding primary education, leveraging garments for jobs. \nThose choices worked because they were people-centric. The current reversal is a test of whether today's policymakers will take the bold steps needed to rescue millions from sliding back? \nThe answer will determine whether Bangladesh's future is one of shared prosperity-or widening exclusion embedded in jobless growth.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Jobless growth and the  return of poverty",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/jobless-growth-and-the-return-of-poverty-1758639570",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 24, 2025 00:00:00  \nDhaka is a city where millions of people walk every day. In such a busy urban environment, footpaths should be safe, wide and accessible to everyone. Sadly, most footpaths in Dhaka are anything but pedestrian-friendly.\nMany are broken, narrow, or blocked by shops, street vendors and parked vehicles, forcing pedestrians onto the busy roads-an invitation to accidents amid heavy traffic. Footpaths are often littered with garbage, construction materials, and even open manholes. At night, poor lighting makes them particularly unsafe, especially for women, children, and the elderly. The combination of physical hazards and inadequate lighting makes walking not only inconvenient but also dangerous.\nThe neglect of footpaths reflects a broader urban management problem. Public space is being compromised, and citizens' safety is frequently overlooked in planning and development. If the government takes steps to clear illegal stalls, repair broken pathways, and install proper lighting, Dhaka could become a far safer and more pedestrian-friendly city. Walking would be easier and more enjoyable, traffic congestion could improve, and the city would appear more organised, welcoming and liveable.\nFootpaths are meant for pedestrians-not for encroachment or neglect. It is high time the authorities prioritise the safety and accessibility of these essential public spaces. By creating a system where pedestrians are protected and public walkways are respected, Dhaka can move closer to becoming a modern city where mobility, safety, and convenience are available to all.\nArshie Akter Sunny, \nDhaka\narshieakter205@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Footpaths - not for pedestrians",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/footpaths-not-for-pedestrians-1758639602",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 24, 2025 00:00:00  \nDhaka has become synonymous with traffic congestion. For millions of residents, commuting is not just a routine day-to-day hassle, but also it drains time, energy and health. \nAccording to the Bangladesh Jatri Kalyan Samity, the city loses nearly 3.2 million working hours daily due to traffic jams, resulting in an annual economic loss of around Tk 980 billion. Inefficient fuel consumption adds another Tk 110 billion per year.\nThe roots of the problem lie in overpopulation and the failure of policymakers to prioritise sustainable transport planning. Public transport, which should be the backbone of the city, is neglected. Commuters endure unsafe, uncomfortable buses, while the affluent increasingly rely on private cars, worsening gridlock.\nThere are some hopeful steps. BUET professors recommended bringing the city's buses under a single management system to streamline services and improve safety. If implemented sincerely, this reform could mark a turning point. Yet buses alone cannot solve Dhaka's transport nightmare.\nOutdated traffic control systems, illegal parking, and occupied footpaths add layers of dysfunction. Hawkers must be resettled to designated areas to balance livelihoods and city mobility.\nTraffic congestion has serious consequences beyond inconvenience. Prolonged exposure to traffic pollution and stress harms public health, increases the risk of heart disease and respiratory problems, and affects children's development.\nSolutions lie not just in buses or metro lines, but in a well-planned, multimodal public transport system. Integrating buses, metro rail, circular rail, and river transport, along with decentralising economic activity and modernising traffic management, is essential.\nDhaka can no longer afford the economic and social costs of tailback. \nTransport reform is no longer optional-it is a national necessity. Policymakers must act decisively to create a city that is efficient, liveable and full of opportunity, rather than one defined by frustration, lost productivity and public suffering.\nSharmin Akter Swarna\nStudent, \nIslamic University, \nBangladesh\nswarnasharmin87@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Overhauling Dhaka's public transport",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/overhauling-dhakas-public-transport-1758639633",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-09-2025"
    }
]