[
    {
        "full_article": "The results of the bye-elections in five Assembly constituencies — Kadi (SC) and Visavadar in Gujarat, Nilambur in Kerala, Ludhiana West in Punjab and Kaliganj in West Bengal — indicate the factors at play at the local and regional levels. The Congress-led United Democratic Front candidate Aryadan Shoukath won the Nilambur seat. P.V. Anvar, who had won in 2021 as a Left-backed independent, vacated the seat after a spat with the ruling coalition, contested as a Trinamool Congress (TMC) candidate (which was rejected) and then stood as an independent. The seat falls in the Wayanad Lok Sabha constituency represented by Congress leader Priyanka Gandhi. The Bharatiya Janata Party (BJP) candidate performed poorly. The outcome could impact the tone of the campaigning for the Kerala Assembly elections due next year. The alignment of communities and relative power of parties in both Fronts will be affected by the Nilambur result. In the Kaliganj constituency in Nadia district, the ruling TMC’s candidate Alifa Ahmed won by a margin of over 50,000 votes. Her father’s death had led to the by-poll. Counting day was marred by the death of a child in a crude bomb explosion, a sign of the continuing and disturbing role of violence in the State. Assembly elections in West Bengal will take place next year.The Aam Aadmi Party (AAP)’s wins in Visavadar and Ludhiana West are significant for a party that lost power in Delhi, its original stronghold, in February. Its MLA in Visavadar had defected to the BJP, and the renewed mandate helps AAP retain its stake in State politics. Its former State president Gopal Italia is the winner. AAP’s former Rajya Sabha Member of Parliament and industrialist Sanjeev Arora won the Ludhiana West seat in a State it rules. The BJP retained Kadi. The by-polls were also notable for the new initiatives by the Election Commission of India (ECI) to reinforce the integrity of the electoral process and make it more accessible. These include mobile deposit facility for the electors at all polling stations, upgraded voter turnout sharing process resulting in faster updating of the approximate polling trends, and most significantly, webcasting at 100% of polling stations. The issues of disputes over heavy polling in sensitive booths in the concluding hours of voting and transparency related to video records of booth activities remain, and the ECI must continue to take proactive measures to not only be fair but also to be seen so.\r Published - June 24, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Assembly Elections\n                    \n                            /                      \n                        \n                        Gujarat\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        Punjab\n                    \n                            /                      \n                        \n                        West Bengal\n                    \n                            /                      \n                        \n                        United Democratic Front\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        All India Trinamool Congress\n                    \n                            /                      \n                        \n                        Left Democratic Front\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Aam Aadmi Party\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        technology (general)",
        "headline_1": "Polls and processes: On Assembly bye-elections, the ECI",
        "headline_2": "The Election Commission of India is taking some proactive steps towards transparency",
        "link": "https://www.thehindu.com/opinion/editorial/polls-and-processes-on-assembly-by-elections-the-eci/article69727937.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-06-2025"
    },
    {
        "full_article": "Kerala Governor Rajendra Vishwanath Arlekar’s obstinate use of contentious political iconography has shattered the veneer of harmony with the State government that marked his early months in office. Over the last fortnight, two Kerala Ministers have protested and boycotted official events held at the Raj Bhavan, taking strong exception to a garlanded portrait of Bharat Mata — Mother India — in front of a lion and holding a saffron flag against what appears to be a map of Akhand Bharat (undivided India). Leaders of the ruling Left Democratic Front decried the imagery, condemning it as a ploy to inject a Hindu nationalist agenda into the constitutional office of the Governor. Mr. Arlekar nonchalantly ascribed the idea to the spirit of nationalism and patriotism. The rift has since spilled over into the streets, leading to confrontations between workers of the Communist Party of India (Marxist) and the Bharatiya Janata Party across the State. The Mother India motif traces its origins to the late 19th century work, Anandamath, by Bankim Chandra Chattopadhyay, which personified the country as an oppressed Hindu goddess with a glorious past aspiring to regain her enormous might. It featured ‘Vande Mataram’, which became hugely popular and accepted as India’s national song. With the nationalist movement taking shape, the image found countless iterations across forms of cultural and political expression. In the early 20th century, artist Abanindranath Tagore depicted Bharat Mata as a four-armed goddess holding a piece of white cloth, sheaves of paddy, a book and a string of beads. While Anandamath came under criticism for its perceived communal undertones, with the image being appropriated by Hindu religious nationalists, Abanindranath’s image was seen as a ‘humanisation’ of the divine mother. If painter Amrita Shergill poignantly pictured Mother India as a pining mother staring into an uncertain future, political and cultural portrayals of Mother India relied on the metaphor of a woman who was a divine, benevolent custodian of customs and traditions, with the imagery drawing heavily from Hindu iconography. Her flag changed between the tricolour and saffron, depending on who portrayed the image. Calendar art pinned up many iterations in drawing rooms. While films such as Mother India cemented the stereotype, Satyajit Ray’s Devi called out the deification of women as a patriarchal tool of subjugation.But religious nationalists continued to weaponise the symbolism, imaginatively blending the visual of a decked-up Hindu goddess with a united Hindu Rashtra. Secularists such as M.F. Husain, too, were drawn to the idea of the nation as a woman and it got deeply etched in the collective psyche of the people. Given the lack of a standard depiction of the metaphor of Mother India, the present controversy was avoidable. Governors would do well to desist from employing a Hindu majoritarian version of a multilayered iconic image for political expediency.\r Published - June 24, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Kerala\n                    \n                            /                      \n                        \n                        Governor\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Left Democratic Front\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Communist Party of India -Marxist\n                    \n                            /                      \n                        \n                        painting\n                    \n                            /                      \n                        \n                        culture (general)\n                    \n                            /                      \n                        \n                        gender",
        "headline_1": "One idea, many images",
        "headline_2": "Governors should not play up divisive images in official functions",
        "link": "https://www.thehindu.com/opinion/editorial/one-idea-many-images/article69727190.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-06-2025"
    },
    {
        "full_article": "Key questions about the success of Trump’s Iran bombing and its objectives need answers\nA huge bomb blew up a network of tunnels, and hours later Trump crowed: “very successful job”. Only, it wasn’t Fordow in Iran but Nangarhar, Afghanistan. The year was 2017, and the bomb, MOAB – mother of all bombs – not GBU-57. It was used for the first time, and billed as a game-changer, but four years later US beat a hasty retreat from Afghanistan. So, now that the dust and hype raised by GBU-57 ‘bunker busters’ and Tomahawk cruise missiles have settled over Fordow, Isfahan and Natanz, it’s time to ask – did they change America’s game in Iran? Trump declared on Sunday that “Iran’s key nuclear enrichment facilities have been completely and totally obliterated,” but his deputies have been more circumspect. Defence secretary Hegseth has assessed “severe damage and destruction”. Vance expects “conversations with the Iranians” about doing “something with that fuel”. \nThere’s a tacit acknowledgement among the Americans that at least 400kg of Iran’s uranium, refined to 60% purity – not far from the 90% purity bombs need – was stashed away from the bombed sites. Israelis, who were goading Trump to bomb Fordow last week, are now painting bull’s-eyes on other sites. It certainly suits them to make Trump play whack-a-mole in Iran, but before dispatching his B-2s again, Trump must weigh the evidence from Sunday’s strikes.\nSo far, there’s no spike in radioactivity, which may mean the contents of Fordow’s tunnels – if not moved out – are safe. Satellite images of trucks at the site suggest nuclear fuel was removed in anticipation of US strikes. And while everybody’s attention was fixed on Fordow, it turns out Isfahan, which has 60% of Iran’s enriched uranium and even deeper tunnels, was not hit with GBU-57s at all. So, Iran possibly has plenty of uranium left over to keep its bomb hopes alive. Meanwhile Trump has run through 14 of his 20 GBU-57s in one raid. Should he go back with the last six, when it’s not clear whether they made any difference at all? \nOn Sunday, Trump’s staff described the strikes as a “limited” intervention, and White House labelled them a “display of peace through strength”. Iran, for all its tough talk, might swallow the first provocation and return for talks, but a second strike would be impossible for it to ignore. So, Trump should plan his next move against Iran carefully. He has the means, of course, but does America need this fight?\n\n",
        "headline_1": "Mission implausible?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/mission-implausible/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-06-2025"
    },
    {
        "full_article": "DGCA waking up to aviation safety won’t change much unless audit is unsparing & findings are made public\nNothing shows more starkly why nothing should be taken for granted than aviation regulator DGCA’s ‘comprehensive safety audit’ – a 360-degree evaluation of the sector’s safety, ops and regulatory compliance. Flyers assume such a periodic 360-degree audit and assessments are at the core of DGCA’s raison d’etre. Apparently not. Airlines’ and chopper operators’ audits have been carried out in silos. And compliance of aviation’s safety rules have been hostage to airlines’ cutting corners to keep losses in check and profits intact, coupled with a crippling shortage of suitably trained inspectors at DGCA’s multiple operations’ wings. Plus, allround graft, including in the running of flying training schools. \nCommercial flying is a multitude of operations demanding high skill, high training and plenty of rest – it is only when every small part works in unison can flight safety be guaranteed. Take something as routine as oxygen on board. A Lok Sabha response mentioned a Nov 2022 Air India  B737 Bombay-Bengaluru-San Francisco flight that was fined ₹1.10cr for insufficient oxygen on board. The penalty order came a year later on Jan 24, 2024. On July 9, 2024, in a “serious scheduling incident” on a Delhi-Riyadh flight, a trainee first officer was paired with a non-trainer pilot, against basic norms – AI was fined ₹90L. It’s not a moment too soon that three AI senior officials were removed from their posts for a series of lapses. \nA constant stream  of ‘accidents’ – from unlawful entry into the cockpit to under-trained and fatigued pilots, from poor maintenance to inspection staff shortage – has the aviation sector glitching. There have been calls that DGCA may want to bring in third party auditors since a key operational audit would be to identify the safety watchdog’s own weaknesses and gaps in protocol, staffing and service. Finally, findings of the audit must be made public – to reassure those who actually buy air tickets and keep the business running.\n\n",
        "headline_1": "No more hot air",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/no-more-hot-air/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-06-2025"
    },
    {
        "full_article": "UK’s assisted dying bill is a momentous law. The conversation must start in India \nThird time lucky. After rejecting versions of the bill in 1997 and 2015, UK lower house voted for a law to allow assisted dying in England and Wales. This means patients terminally ill, as defined in law, and likely to die within six months, can apply for an exit. The legislation will have to be set in motion within four years (2029). If delayed in the Lords – it’s highly contested and the lower house win was by just 23 votes – the bill will lapse. It may not be done and dusted yet, but a historic social change has begun. Exhaustive debates and tweaks to the bill included dropping provision of a judge having to sign off on the decision. Importantly, no other person is ‘obliged’ to take part. Patients will have to administer the drugs, whatever is decided, themselves, so it’s a first step to active euthanasia. Reportedly, UK govt estimates there may be 4,000 such patients.   \nTo legislate on assisted dying is never a straight road in any country. Fears and concerns are real that vulnerable, disabled and older people risk being coerced to use the law, to reduce the financial and care burden on the family. UK bill’s penalty for coercion is a 15-year jail. While such fears have been voiced to reject assisted dying, the Indian reality is that terminally ill people and families are often left to fend for themselves as a result of lack of access to treatment and/or unaffordability of care. At the privileged end of affordability/access, there is little policy or regulations to limit life-sustaining interventions inappropriate at end-of-life stage. The Supreme Court upheld advanced directives, the right to refuse treatment: passive euthanasia. UK’s bill is an opportunity to take further the conversation around a 360-degree end-of-life care that includes palliative care and covers assisted dying for the terminally ill. \n\n",
        "headline_1": "Coding for the end",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/coding-for-the-end/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-06-2025"
    },
    {
        "full_article": "What really are the positives, even for US, after it hit Iran? The possible negatives are plenty, though\nFordow is gone, Trump posted on Truth Social early on Sunday, even before experts had time to analyse the aftermath of the raid. In his telling, “Iran’s key nuclear enrichment facilities have been completely and totally obliterated.” If that’s true, Israel is the lone, undisputed nuclear power in West Asia now, and the war must stop. For, eradicating Iran’s bomb-making infra was the stated aim of Israel’s June 13 strikes. Trump has also said, “Our objective was the destruction of Iran’s nuclear enrichment capacity.” \nBut you can’t hold Trump to his word. As late as June 10, he said he would like to avoid a conflict. Yet, on June 13, after Israel’s airstrikes, he admitted: “We knew everything.” And on Saturday, when he lamented he wouldn’t get a peace Nobel, “no matter what I do”, his fleet of B-2 bombers was already on its way to hit nuclear facilities at Fordow, Isfahan and Natanz. \nTrump, the consummate dealmaker, perhaps reckons that a humbled Iran will sue for peace. But this isn’t business. Here’s a regime fighting with its back to the wall. Isolated and sanctioned for 46 years, it derives legitimacy from strength, or a semblance of it. It cannot cower before Trump’s “if peace does not come quickly” threat. And Iran has not run out of moves yet. Although it shouldn’t, it can attack military bases in the region that house 40,000 US troops. Iran can also inflict pain globally – as it threatened on Sunday – by shutting off the Strait of Hormuz, through which 20% of the world’s oil passes. So, wittingly or otherwise, Trump has walked America and his MAGA voters into another West Asia swamp after vowing not to do so.\nFor what? As experts point out, Iran – world’s number one state sponsor of terror, in Trump’s words – didn’t have planes or missiles to hit America. US friends in the neighbourhood – Oman, Qatar, Iraq – disapprove of the strikes. Even the Saudis, for the second time in 10 days, have “condemned and denounced the violation of the sovereignty of the Islamic Republic of Iran”. Whose war is Trump fighting then, and what will it achieve, besides steeling Iran’s resolve to build its nuclear deterrent, like N Korea? Each GBU-57 that Trump’s B-2s dropped shook the international order on Sunday. Global treaties like NPT, and principles of engagement are under a cloud now. And with Pakistan in Trump’s embrace, India should be very watchful.\n\n",
        "headline_1": "Bombastic",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/bombastic/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-06-2025"
    },
    {
        "full_article": "We are deeply concerned by the growing culture of mob violence that has almost become a norm in recent times. The latest incident occurred on June 22, when former Chief Election Commissioner KM Nurul Huda was assaulted by a mob prior to his arrest in a case filed by the BNP, accusing him and 23 others of electoral irregularities. A video that went viral on social media showed Huda standing with a garland of shoes around his neck, surrounded by a group of individuals. At one point, a bearded man struck him twice in the face with a shoe while others chanted slogans. Moments later, a police officer took Huda by the hand and led him away.\nThis kind of public harassment and mob trial before any legal proceedings have taken place is totally unacceptable. It poses a serious threat to the rule of law and undermines the legal rights of the accused. The question is: why did the police not take adequate precautions before attempting the arrest? Were they unaware of the risk of such an incident occurring, especially in such a high-profile case?\nAmong those accused in the BNP case are three AL-time CECs—KM Nurul Huda, Kazi Rakibuddin Ahmad, and Kazi Habibul Awal—and 10 election commissioners. Ahmad and Awal oversaw the national elections of 2014 and 2024 respectively, while Huda oversaw the 2018 election amid widespread allegations of ballot-box stuffing on the eve of polling. Nurul Huda, along with others involved in these controversial elections that enabled a fascist regime, must face legal proceedings. However, any mob assault prior to legal action, or at any stage of the trial, serves only to raise question marks about their chances of getting justice.\nOver the past 10 months, there has been a disturbing surge in incidents of mob justice where violent groups have taken the law into their own hands. Sometimes top leaders of Awami League, accused in various cases including those related to the July brutalities, faced assaults even on court premises. Alarmingly, in most instances, the government has remained silent, and the law enforcement authorities have failed to take action against the perpetrators.\nThis time, while the government has issued a statement assuring that law enforcement agencies will identify those responsible for the incident, as of writing this editorial, no action has been taken yet. We urge the government to identify the perpetrators through available video footage and bring them to book. By arresting them, it can send a strong message to the public that mob justice is unacceptable and will not be tolerated any more.\n",
        "headline_1": "Why can’t the govt stop mob violence?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/why-cant-the-govt-stop-mob-violence-3923861",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-06-2025"
    },
    {
        "full_article": "Certain months linger longer than others, etched not on calendars but in the collective muscle memory of a people. They arrive quietly, but leave behind echoes. For most of us, July 2024 was one of those months. I do not want to talk about July. I do not want to remember it, but July never asks. It arrives like a wound that never quite closes, splitting open with chants, posters, and polished speeches. And every time it does, I feel sick because what July became is not what it was. What it meant to so many of us has been stolen, sold, and politicised beyond recognition. The grief was ours. The horror was real. But the narrative? The narrative is a betrayal.\nI remember July came without political banners or party flags. Many of us were not even politically active before July; rather, ordinary people who had finally been pushed to the edge by years of institutional violence and state-sponsored silence. The kind of silence that watches a young boy get picked up at night and never return. The kind that sees students being shot in broad daylight. There was nothing heroic about July. There were just people. People who wanted to live. People who had exams coming up. People who had siblings waiting at home. Some were dreaming about university, some about cricket, some about holding their mother's hand as they crossed the street. And then they were gone. Their lives extinguished, their futures sacrificed—not in the name of some grand ideology, but for the most basic right to live and do so with free will. Now they are called martyrs, and rightly so—their names boxed in slogans and press releases. Now they are branded and labelled depending on who is speaking and what audience they are speaking to. But in July, none of that mattered. In July, they were simply humans. And in refusing to see them that way now, we have not only betrayed them but also betrayed ourselves.\nWhen I think of July, I remember the silence. Not the kind that settles over a nation out of respect, but the kind that suffocates. I remember refreshing my feed over and over again, trying to find some proof that my friends were okay. I remember the sleepless nights, the internet blackout that made everything worse, the anxiety that clenched my chest. I remember feeling like the sky itself had cracked open, spilling fear into every home, every heart. And yet, amid all that, there was something sacred. There was a shared grief, a collective mourning that transcended belief, background, and political alignment. It was the kind of unity that nations spend centuries trying to build. And we felt it, albeit for a brief, heartbreaking moment. We cried together. We raged together. We remembered those faces not as numbers or political pawns, but as people who should have been here. But that unity did not last. They did not survive in a country where grief is currency and memory is up for auction. Within months, the narrative began to shift, and just like that, the sacredness of our grief was desecrated. July was no longer a shared wound but a political territory.\nWhen the government fell, it was not because we had a new leader who inspired the people. It was because the people made it clear they would no longer be ruled by fear. And that moment—chaotic, painful and uncertain—held a kind of purity we had not felt in years. It was not perfect. But it was real. And it felt like, for the first time in generations, Bangladesh might finally be turning a page. And now, that same July is being rewritten. Political parties are back in the driver's seat, speaking in the name of the movement, ready to hijack the grief of a nation to demand elections, as though democracy begins and ends at the ballot box. As though the people did not rise against a system of voting without justice. As though a change in government is all we needed, and not a change in the very way power operates. Violence is once again the language of politics. And fear is creeping back in, disguised as righteous anger.\nKazi Raimul Islam, who lost one of his legs during the July uprising, recently wrote: \"Bangladesh is not worthy of sacrifice. The biggest dream of a Bangladeshi should be leaving Bangladesh.\" Do we understand what it takes for someone who almost died for his country to say that? Do we understand the magnitude of that heartbreak? That is not bitterness. That is someone realising that the country he risked his life for is now being carved up by those who treat suffering as a strategy. We lost so many people. Not just to bullets and batons, but to despair. To burnout. To the unbearable burden of trying to fix something that does not want to be fixed. We failed them. Because we used their miseries, and because we let July become about power, not about people.\nEvery time I see someone claim July, I feel that old helplessness crawl back in me. And I wonder if they remember the eyes. I remember looking into the eyes of mothers who had just buried their sons. I remember the haunting stillness of faces that had run out of tears. You cannot slogan your way past that. You cannot politicise it without erasing what was real.\nMy screen time has gone up again. I have been scrolling more, even though there is nothing new to see. I refresh the same two apps. Read the same headlines repackaged. Watch clips of people arguing, protesting, counter-protesting, and screaming. Then I lock my phone, wait five minutes, and do it again. In July, this same habit felt different. Urgent. Purposeful. Every update, every disappearance, every sudden internet blackout—it felt like being a witness to something real, something that might finally shift the weight we have all been carrying in silence for years. But now, I just scroll. Passively. Detached. The things that once made my heart race now barely register. It is not because I stopped caring. It is because what July stood for feels like it is slipping away. It was messy, yes. But it was ours. And now, watching political parties stamp their flags over the memory of it feels wrong.\nSo no, I no longer want to talk about July. But I must, because silence is what allowed this betrayal to fester. I must talk about it—not in celebration, not in nationalism, not in party loyalty, but in mourning. I must talk about it as someone who lived through it. Not as a tool for someone else's agenda, but as a witness to something we should have held sacred and instead sold off. I am tired of seeing July used as a weapon. I am tired of the narrative being rewritten by the victors while the victims are left behind, forgotten. If we must remember July, let us remember it honestly. Let us remember that it was not a revolution. It was not an uprising. It was a desperate, terrified cry for life. And we turned it into a brand.\nMaisha Islam Monamee is a student at the Institute of Business Administration (IBA), University of Dhaka, and a contributor at The Daily Star.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The afterlife of an uprising",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-afterlife-uprising-3923691",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-06-2025"
    },
    {
        "full_article": "It is alarming to learn of the incidents of rape victims being married off to their rapists, thus putting them at risk of continued abuse. Reportedly, accused rapists often seek to marry survivors as a means to evade legal consequences. While cases filed under the Women and Children Repression Prevention Act—including rape—cannot legally be settled outside court, such arrangements are frequently made across the country through village arbitration or family negotiations. Girls who are married to their alleged rapists through these informal settlements are often subjected to further abuse, divorce, or unstable marriages. The question is: why are such marriages taking place? Are we not, in effect, granting impunity to rapists through these arrangements?\n\nBetween 2002 and 2011, Prothom Alo said it had reported at least 20 cases in which rape survivors were married off to their accused rapists. Of these, 11 marriages ended due to physical and mental abuse, among other factors. In one case, the marriage continued, but the girl was subjected to ongoing violence. The remaining eight cases could not be tracked further. Additionally, over the past four years, Prothom Alo spoke with eight survivors and their families who had been married to their accused rapists. It was revealed that none of them were able to sustain a family life. Moreover, they struggled to obtain legal recognition for children born as a result of rape. In one tragic instance, a survivor was murdered after the marriage.\n\nSome families said they agreed to such arrangements out of fear of social stigma. Some parents of adolescent and young girls who became pregnant due to rape said there was \"no option but marriage.\" In some instances, these marriages were even formalised in court, with magistrates present. The recent incident of singer Mainul Ahsan Noble is a case in point. Noble, who was arrested in a rape case last month, married the victim on June 20 with court permission.\n\nThese incidents are not only shocking but also unacceptable. Rape is a criminal offence, and rapists must face due punishment under the law—not be rewarded with marriage. Sadly, our legal system is failing not only to convict rapists but also to protect survivors from further abuse and harassment through such marriages. Under no circumstances can forcing or coercing a survivor to marry their rapist be considered a solution. The state must take urgent steps to prevent such marriages and protect survivors from further trauma, injustice, and cruelty.\n",
        "headline_1": "Marriage as a cover-up for rape is not justice",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/marriage-cover-rape-not-justice-3923671",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-06-2025"
    },
    {
        "full_article": "We are dismayed and baffled by the arrest of Mahmudul Haque, an assistant professor of journalism at Begum Rokeya University in Rangpur, who is well known for marching alongside students and the general public during the July uprising in Rangpur. He was also vocal in demanding justice for the killing of Abu Sayed, a martyr of the July uprising. Mahmudul has been accused in a murder case involving the death of Samesh Uddin, a grocery shop owner in Rangpur, along with 53 others, including ousted Prime Minister Sheikh Hasina and Awami League General Secretary Obaidul Quader. Samesh died on August 2, and a report in this paper cites residents of the area saying he died of a heart attack while fleeing from his shop after police attempted to arrest a local Jamaat leader. Samesh's son has confirmed that his father had a heart condition.\nMahmudul has become a victim of the spree of false cases against people over the July-August killings by the Sheikh Hasina regime. This paper has extensively reported on and published editorials about the dangerous trend of murder cases (related to the July uprising killings) against hundreds of people. In June this year, Md Selim, a grocer, was listed as the deceased victim in a murder case over the July uprising killings. A report in this daily found that Md Selim was alive, and that he had been declared \"dead\" as part of a conspiracy by his brothers over an inheritance issue. Thus, murder cases are being filed, and sometimes the accused are imprisoned on flimsy and false grounds.\nIn many of these cases, the accused are from the hometown (not Dhaka) of the victims, even though the killings in question occurred in Dhaka. These false cases are filed not to seek justice, but rather due to personal vendettas. In most cases, those who have filed the case, usually a relative of the murdered victim, do not even know those they have accused—with the names being supplied by others.\nWe are disappointed that, despite the law adviser's assurance that no innocent persons accused in these cases would be arrested, this has continued, with Mahmudul's arrest being one of the latest examples. This indiscriminate filing of murder cases against individuals on such tenuous grounds must stop.\nApart from the trauma experienced by the accused, this trend will also hamper the legal process of securing justice for the actual victims of the July uprising killings. The government must immediately take action to ensure that nobody can file a false murder case, and that the police personnel who register such cases are held accountable. The interim government must ensure that each of these cases is assessed to determine whether it is plausible and not filed in order to settle personal scores.\n",
        "headline_1": "Identify and reject false murder cases",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/identify-and-reject-false-murder-cases-3922281",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 24, 2025 00:00:00  \nWhen the developed nations are yet to get the priorities in terms of global warming right, countries like Bangladesh are not expected to have enviable records on such issues. But much as such countries may be the least contributor to environmental pollution leading to worsening climate, their stake is higher than that of the rich and more pollutant nations. Thus Bangladesh is the seventh most climate-vulnerable country in the world. Usually, the vulnerability indices of the smaller, least developed, and developing countries have prompted them to look more for external climate funds than domestic resources. Now domestic mobilisation of fund is also important because no one else will bear the brunt of increasing and unpredictable natural calamities. The country will definitely claim its share of the rightful green climate fund (GCF) created under the UN framework convention, but it also has to do its homework for judicious utilisation of this fund and its domestic allocation for the purpose. \nAccording to a report carried in the FE on Sunday last, the moderate domestic allocation of fund hardly finds its rational and proper use. Climate is a vast subject and it is not same everywhere on the planet. This deltaic land may have some similarities with its big neighbour India but still this lower riparian nation has its special problems which are quite different from that upper riparian land. So this country has to identify the causes of its climate-related vulnerabilities on its own. This climate emergency points to the fact that continuous and extensive research is the key to pinpointing the causes and nature of vulnerability arising out of global warming. To the credit of the Sunday's report, it has pointed out the paucity of research and knowledge management in relation to climate vulnerability or lack of resilience. In a country of limited research base, though, this is not quite surprising. \nHowever, the fact is that indifference to climate-related research can be self-defeating in the end. Under the six broad categories of climate funding by 25 ministries, this particular research field has been the least recipient of allocation of fund, according to the report. This has to change urgently because the less than 5.0 per cent ---roughly 3.0 per cent --- allocation for research and knowledge creation and implementation will not help the country to build a model of resilience to climate vulnerability. The Bangladesh Rice Research Institute (BRRI) and the Bangladesh Agriculture University have been an exception to the general lack of research culture in the country. Now there is a complaint that the salinity-drought- and flood-tolerant paddies developed by the BRRI have failed to reach farmers at the grassroots level because of lack of government promotion and patronage. \nSuch inaction on the part of government agencies act as a disincentive for research. Academic knowledge gets authenticated by research and experiment but unless the outputs of such efforts are taken out of the laboratory for implementation at the field level to the benefit of the end users, the overall ambience of knowledge creation through research and experiments shrinks. Given the country's vulnerabilities to an increasingly hostile climate, the jaded outlook must change for developing its own robust research base in order to take care of the special kinds of problems confronting it.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Research, knowledge for climate resilience",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/research-knowledge-for-climate-resilience-1750693197",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       June 24, 2025 12:00:00  \n\nWith the next national elections likely in February next year, public focus has sharply turned to the capacity and readiness of the Bangladesh Police. Can the force -- long criticised for being politicised, misuse of power, and erosion in professionalism --regain the trust necessary to play its central role in ensuring law and order during the electoral process?\nFree, fair, and credible elections require more than just voter turnout and ballot boxes. They demand an environment where citizens can exercise their democratic rights without fear or coercion. And for that, law enforcement -- especially the police -- plays a pivotal role.\nYes, auxiliary forces such as the Border Guard Bangladesh (BGB), Ansar, and the Village Defence Party (VDP) will be deployed. The army may also be kept in reserve as a striking force. But the frontline responsibility lies with the police force. It is the police that will guard polling stations, oversee rallies and public meetings, control political processions, and respond first to any breaches of peace. Whether they can carry out their duty impartially and professionally is the question we must ask now -- before it's too late.\nThe act of widespread politicisation of police in Bangladesh, particularly during the last autocratic regime, has severely compromised the credibility of the force. During that period, police were not seen as public servants but rather as agents of the ruling party. Recruitment, promotion, and postings were often based on loyalty, not merit. This politicisation nearly destroyed the police as an institution, turned many officers into tools of repression rather than guardians of the law.\n\nWhen the previous regime fell, many expected a thorough institutional cleansing and rebuilding. The opportunity was there to revitalise the police and restore public faith in them. Indeed, a Police Reform Commission was formed. But the real question remains: has the momentum been sustained?\nThe Police Reform Commission submitted a far-reaching and comprehensive report containing 108 recommendations to transform the police into a transparent, accountable, and impartial institution. This is not just another bureaucratic document -- it is a blueprint for salvaging a force that has veered far from its constitutional role.\nAmong its key recommendations include: Revising outdated colonial-era laws such as the 1861 Police Act, the 1898 Criminal Procedure Code, and the 1943 Bengal Police Regulations; Establishing an Independent Police Commission with representation from both ruling and opposition parties; Introducing modern tools and practices, such as GPS tracking, body cameras, and standardised crowd-control protocols; Strict accountability mechanisms, including disciplinary action against officers involved in excessive use of force or filing false cases; Immediate adherence to Supreme Court directives regarding arrests and interrogation practices.\nThis reform package is not utopian; it's practical, divided into short, medium, and long-term plans, with an emphasis on both accountability and capacity building.\nSeveral proposals from the Commission deserve specific mention. \nOn human rights protection it recommends that interrogations of female suspects must be done with dignity and in the presence of female officers. Each station should have a dedicated female desk to handle gender-sensitive cases. A hotline for reporting illegal searches or wrongful seizures has also been suggested.\nAccording to the recommendations, arrests should be made only under legal provisions, especially when a person's name is not in the First Information Report (FIR). The outdated British-era practice of arbitrary arrest must end.\nFor case management and career planning it suggests that a specialized criminal investigation team should be developed, with career incentives tied to investigation quality -- not political allegiance.\nOne innovative recommendation is to form multi-party committees at each police station or upazila to monitor corruption and misconduct locally. These grassroots mechanisms would add a new layer of transparency.\nThe report advocates adopting European crowd-control models and stresses restraint, particularly in light of the police's controversial role in suppressing student protests during July and August 2020.\nThe commission suggests creating helplines not just for emergency police aid, but also for reporting misconduct and seeking protection from police abuse -- a lifeline for ordinary citizens.\nDespite such a thorough and promising roadmap, the reality on the ground remains deeply disappointing. There has been no meaningful implementation of these reforms. Not a single major recommendation has been enacted.\nThe much-needed Independent Police Commission -- the very heart of the reform effort -- is still a proposal gathering dust. Meanwhile, arbitrary transfers, political favoritism, and bureaucratic inertia are allegedly continuing unabated.\nOne must ask: what is holding back progress? Why is there no political will to professionalize this vital state institution? Is it because a truly independent and empowered police force would threaten vested interests who benefit from a compliant and politically motivated law enforcement?\nTime is no longer on our side. With the possibility of elections in February or April next year, the window to implement even the short-term reforms is closing rapidly. If immediate actions are not taken -- at least on the administrative and operational fronts -- the police will once again face the elections burdened by their past, unprepared for the future.\nEven basic steps, such as training officers on crowd control and use-of-force guidelines, introducing internal monitoring mechanisms, and ensuring the impartial application of law, can bring tangible improvements in the months ahead. But that requires urgent, coordinated action from the Ministry of Home Affairs, the Police Headquarters, and above all, the political leadership.\nAt the end of the day, the performance of police during elections will be judged not by internal memos or press conferences but by the public's trust and perception. Will citizens feel safe going to vote? Will opposition candidates be able to campaign without harassment? Will protestors be dispersed with tear gas and batons or through dialogue and de-escalation?\nIf these questions are not answered affirmatively, the legitimacy of the election itself will be questioned. And the damage to the country's democratic journey could be profound.\nThe road ahead is difficult but not impossible. Here are a few urgent steps that can still be taken:\nBangladesh stands at a democratic crossroads. Whether we move forward or fall backward will largely depend on the actions taken today -- not only by political leaders, but by institutions tasked with upholding the rule of law.\nThe Bangladesh Police, with all its flaws and all its potential, must rise to the occasion. Elections are not merely a day of voting; they are a test of the state's commitment to its people. A reformed, professional, and people-oriented police force is not just desirable -- it is indispensable.\nIf we fail to act now, the dream of a peaceful, fair election and a truly democratic future may remain just that -- a dream.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Next national polls: Are  our police ready?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/next-national-polls-are-our-police-ready-1750693377",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       June 24, 2025 00:00:00  \n\nThe interim government's Finance Adviser, Dr Salehuddin Ahmed, in response to criticism of the just-approved budget for FY 2025-26 that it followed an 'old road', came out forcefully saying that it was rather a 'highway born out of the old road'. The argument he produced to answer his critics is more rhetorical than substantive. Obviously, the expectation from the critiquing economists was that the budget would reflect the revolutionary transformation that the nation underwent through the July upheaval of 2024. Or in other words, the first budget of this government of change would be somewhat reformist, if not revolutionary, and not at all a traditional one, the critics expected. \nBudgets are essentially the financial statement of a government's anticipated revenue incomes and planned expenditures for a particular financial year. Anti-people governments like the one ousted in August last year, are characterised by the way they allocated the nation's resources in the budget. The rich and the section of the population that the government of the time represented naturally got the lion's share of the budgeted amount. The rich paid less in terms of income tax, while the people in the lower income bracket paid more. The local economic think tank, the Centre for Policy Dialogue (CPD), for instance, criticised the proposed changes in the pattern of levying income tax in the new budget. It said, the budget disproportionately raised tax burden on the low and middle income earners over the next two fiscal years. \"From a distributional perspective this (budget) structure is not balanced. A key objective of the national budget is to reduce inequality, and this structure doesn't align with that goal\", said Dr Fahmida Khatun, the think tank's Executive Director. \nThe past governments, fascistic or otherwise, were known for their yearly budgets that favoured the privileged sections of society at the expense of the rest of the population. Those were the traditional budgets. So, where does the present budget prepared under the leadership of the incumbent finance adviser depart from the traditional ones? True, his is not, as the Finance Adviser would like to describe, a 'dream budget' .But dream is too fanciful a metaphor for the government's present annual financial plan which is ordinary and lacks imagination. No doubt, the decision of not to go for any new large-scale infrastructure projects in the coming year is commendable. Scrapping of the dormant or underperforming projects as part of rationalising the Annual Development Programme (ADP), too, is admittedly a step in the right direction. Similarly, allocation of Tk 912.97 billion which exceeds the allocation proposed initially by Tk.100 billion for the Social Safety Net (SSN) programme to protect the poor and the vulnerable, is a piece of good news for the intended beneficiaries of the programme. Started by the past government as a sop for the needy, the question about how far the genuine candidates for the allowances are being benefitted remains. For there were allegations galore in the past about the SSN allowances being misappropriated by fake recipients linked to local ruling party goons. It is not clear, if the interim government has developed a sound database of actual beneficiaries so the money is not wasted. However, It would make a real difference if the budget planners could conceive of a set of income generating projects with the SSN fund where the targeted beneficiaries would be involved according to their abilities. That would provide a better opportunity for the poor and the vulnerable to work and earn income with dignity rather than being mere recipients of dole. And such a programme would be more imaginative or dreamlike as the adviser might like to put it. \nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Not a budget of dream!",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/not-a-budget-of-dream-1750693441",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 24, 2025 00:00:00  \n\nYoung entrepreneurs are often praised at various conferences both online and offline. But behind the applause, many entrepreneurs are quietly struggling. The problem isn't a lack of ambition or creativity. It's the absence of tangible, practical support.\nYoung people across Bangladesh are launching startups with minimal resources, often relying on social media to market, innovate, and scale. Yet they face obstacles at nearly every turn: outdated regulations, excessive bureaucracy, and limited access to capital. Securing a loan is especially difficult for those outside Dhaka or for founders without influential networks. At the same time, tax structures are unclear, and licensing procedures are needlessly complicated-factors that not only slow progress but actively discourage entrepreneurship.\nIf we are serious about nurturing the next generation of innovators, we must go beyond applause and slogans. Real support means improving access to finance, introducing startup-friendly tax policies, and establishing one-stop service centres that eliminate bureaucratic hurdles.\nCelebrating ambition is important. But without meaningful policy reform and institutional backing, that ambition risks turning into frustration-or finding a future in another country.\nShaera Yousuf\nStudent\nNorth South University\nshaera.yousuf@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Entrepreneurs need support, not just praise",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/entrepreneurs-need-support-not-just-praise-1750693767",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-06-2025"
    }
]