[
    {
        "full_article": "The impressive gathering in Chennai, on March 22, 2025, which brought together leaders from several States — including four Chief Ministers — for the inaugural meeting of the Joint Action Committee (JAC) on Fair Delimitation, sent a clear message: any delimitation exercise based solely on the current population figures is unacceptable. The meeting’s primary demand — to extend the freeze on the number of parliamentary constituencies based on the 1971 Census for another 25 years — echoes a similar resolution passed at a recent meeting of parties in Tamil Nadu, which proposed a 30-year extension. This concept of a freeze is not new; it was implemented through the 42nd Amendment (until 2000) and extended again via the 84th Amendment (until 2026). Rightly, the JAC emphasised that States which have successfully implemented family planning should not be penalised with reduced parliamentary representation. This concern, which is particularly prominent in the South, should not be dismissed as a regional issue, despite the strong southern presence at the meeting, which was hosted by Tamil Nadu Chief Minister M.K. Stalin and attended by Kerala Chief Minister Pinarayi Vijayan, Telangana Chief Minister Revanth Reddy, and Karnataka Deputy Chief Minister D.K. Shivakumar. The meeting also saw participation from outside the South, including Punjab Chief Minister Bhagwant Mann and Odisha’s former Chief Minister Naveen Patnaik, who, in an online address, reinforced the message against punishing States for effective population control measures. It is after a long time that parties across regions and ideologies are uniting on a substantive issue — representative democracy — rather than forming opportunistic electoral coalitions that lack policy coherence.The Bharat Rashtra Samithi’s working president, K.T. Rama Rao, proposed considering a State’s fiscal contribution as a parameter in the delimitation process — an idea that may help address the concerns of the southern States. But it might not make sense to predicate decisions with long-term consequences such as delimitation on factors that change from one year to another. In any case, the Union government must act without delay to begin nationwide consultations involving a wide range of parties. Before initiating the Delimitation Commission, it should facilitate inclusive dialogue, regardless of when the next Census — an essential prerequisite — is conducted. So far, statements from Union Ministers have failed to provide clarity. The Centre must recognise the importance of transparency and consultation on this inexplicable delay. Inexplicable, unless petty political calculations are factored in. Published - March 24, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Delimitation\n                    \n                            /                      \n                        \n                        Chennai\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        population and census\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        Telangana\n                    \n                            /                      \n                        \n                        Karnataka\n                    \n                            /                      \n                        \n                        Punjab\n                    \n                            /                      \n                        \n                        Orissa\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        Bharat Rashtra Samithi\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        family planning",
        "headline_1": "Petty politics: On the delimitation issue, the Census",
        "headline_2": "Delaying the Census aids politicisation of delimitation issue",
        "link": "https://www.thehindu.com/opinion/editorial/petty-politics-on-the-delimitation-issue-the-census/article69365303.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-03-2025"
    },
    {
        "full_article": "In two operations in Bastar, Chhattisgarh on Thursday (March 20, 2025), 30 alleged “Maoists” were gunned down taking the number of Maoists killed in operations, according to security forces, to over 100 this year. In its 20-plus years of existence as a unified political force, the Communist Party of India (Maoist) finds itself in its most challenging period. The insurgency had peaked in the mid- to late-2000s, when the then government termed it as the “greatest security threat” to the nation, and has since then been restricted to the forested areas of southern Chhattisgarh and contiguous areas. This weakening was never in doubt — the Maoists profess an anachronistic political strategy of adopting violent means to achieve their goals, and in the long war of attrition against the Indian state, have subjugated their “mass” work to militarism. This has resulted in the erosion of support bases in places that were built where and when the agencies of the Indian state were weak. With successive central governments seeking to address the development lacunae in governance in such tribal areas and adopting a take-no-prisoners approach to tackle the Maoists’ guerilla warfare, their threat has been significantly whittled down. In the anti-insurgency strategy, however, the police and paramilitary agencies have made errors — the Salwa Judum campaign is one example and it is still not clear whether the anti-Maoist operations that have led to claims of many casualties among the insurgents include tribals caught in the crossfire.If the Indian state — the Union and State governments — believes that the Maoist threat can be extinguished using a purely militaristic approach, then this is not borne out from experiences elsewhere against similar insurgencies. Ideologies such as Maoism, even if anachronistic and misplaced in the current socio-political milieu, tend to take deeper roots when repressions peak and a purely militaristic solution that envisages a violent end to the insurgency has the possibility of causing disenchantment among tribals. A better solution would be to involve civil society in working out a truce and sending a clear message for the Maoists to give up their violent path with incentives for rehabilitation. The Maoists have shown little inclination in doing so, being stubborn in upholding their flawed understanding of the Indian state and the people. The loss of lives, that includes tribals either coerced into the violence due to repression that they face or simply caught in the crossfire, should compel them to change tack, if they are truly concerned about the lot of the tribal people they claim to stand up for. The experience of the Revolutionary Armed Forces of Colombia (FARC) or that of the Nepali Maoists, who gave up their insurgent campaigns, suggests that such a pathway is possible. Published - March 24, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Chhattisgarh\n                    \n                            /                      \n                        \n                        security measures\n                    \n                            /                      \n                        \n                        forests\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        tribals\n                    \n                            /                      \n                        \n                        police\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Nepal",
        "headline_1": "​Not the only path: On acting against the Maoists",
        "headline_2": "A purely militaristic solution against the Maoists can also lead to tribal repression",
        "link": "https://www.thehindu.com/opinion/editorial/not-the-only-path-on-acting-against-the-maoists/article69365872.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-03-2025"
    },
    {
        "full_article": "Price caps fetch you so much more than they say\nThis summer, get ready for an epic action and drama feature that will keep you on the edge of your seats – or maybe out of the seat altogether. From the makers of ‘Price Caps on Cab Prices and Price Caps on Movie Tickets: Part 1’, comes this entertaining sequel. Local hero, Karnataka govt’s bleeding heart couldn’t endure people paying high prices for their entertainment, so he’s decided to step up and fight against the evil market forces. Move over invisible hand, govt’s visible hand will be issuing tickets at a mere ₹200. \nThis summer blockbuster will have something for everyone. First, the thriller – lower prices will spike demand, leading to suspense over whether you will get a seat. Then, the horror – parking and popcorn prices will hit the roof. With capped prices, multiplexes will recoup the losses elsewhere – ‘Do you want popcorn and a cola with your ₹200 ticket? That’ll be half a kidney, please!’\n\nNext, the period drama – because you’ll be transported back in time. With multiplexes cutting costs, bid goodbye to premium offerings. Recliner seats, superior sound systems, IMAX and 4D? Who needs those when you can have a nostalgic trip and watch movies the way your grandparents did – with loud audio (but barely discernible dialogue) and bed bugs for company on the seats. Further, customers will have to bear stinking toilets, reduced security, fewer attendants, and badly maintained interiors.\n\nTo satiate the adventure lover, there’s now the thrill of buying movie tickets in black from touts, a forgotten phenomenon in the age of online booking and dynamic pricing. Or the multiplexes themselves might get innovative – ₹200 for the ticket and their ₹400 convenience fee.\n\nIndependent filmmakers, who normally struggle to find screens, will particularly love this policy. They will have to play the role of underdog and compete for screen time in cinema halls desperate to book only guaranteed blockbusters, to maximise quantity at the fixed price. The critically acclaimed small-budget indie film won’t match the economics of ‘Hero Beats Up Bad Guys – Part 7’, now with more action, more car chases and more sleaze.\n\nIn the grand finale of unintended consequences, the number of moviegoers might reduce, given the reduced choice and the joy of finding all the hidden costs. All this drama for just ₹200. Undeniable entertainment value.\n\n",
        "headline_1": "Smokescreen",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/smokescreen/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-03-2025"
    },
    {
        "full_article": "Judicial in-house inquiries against judges don’t have a great record. Will this time be different? \nLast week’s report of firefighters finding a large stash of cash at a high court judge’s home in the nation’s capital, was highly unusual. It was also disputed, both by the judge and senior personnel of the fire department itself. Then, the Supreme Court did something even more unusual. It uploaded on its website the photos and video showing what was found. This means amidst contradictory accounts, people can see for themselves that the found articles did indeed include currency notes. Big public interest in this developing story is very understandable. Ancient Greeks put it best: it is in justice that the ordering of society is centred. This order in turn hinges on judicial rectitude. Every murmur of dishonesty runs a tremor through the whole edifice.\nPer procedure, CJI Sanjiv Khanna has constituted a committee to conduct an inquiry into the corruption allegations. It’s made up of the chief justices of Punjab & Haryana HC and Himachal Pradesh HC and a Karnataka HC judge. The person they have to investigate is Justice Yashwant Varma, sitting judge of Delhi HC, who is scheduled to retire not before 2031. Nothing speaks the seriousness of their assignment more than that no HC or SC judge has ever been impeached – one judge quit midway through parliamentary debate on his conduct – or convicted for corruption in India. Are in-house judicial procedures better? Constituted in 1999, this procedure aims to preserve the independence of the judiciary as well as public faith in it.\nA Jan report of the International Commission of Jurists has found this in-house procedure “insular” and even “ineffective”. The claim is underlined by noting that in 2022, the Union law minister told Parliament there were more than 1,600 complaints against HC and SC judges but no official information as to action taken on these complaints. This is of course on top of the opacity in selection of judges. Rajya Sabha chairman Jagdeep Dhankhar is just one of many who are once again arguing that the National Judicial Appointments Commission (NJAC) struck down as unconstitutional by SC in 2015, provided for judicial accountability more rigorously. \nIn its unprecedented sharing of documents related to the current case, SC has indicated a broader approach to public disclosures. As the in-house committee probes the case, it should remember that the aphorism justice must not only be done but must also be seen to be done is popular because it is profound.\n\n",
        "headline_1": "Justices and justice",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/justices-and-justice/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-03-2025"
    },
    {
        "full_article": "There’s an opportunity for India-Canada ties to improve. A G7 invite for Modi will be a first step\nA week can be a long time in international relations. A month, an eternity. With a new PM in Canada, there is already fledgling optimism that its ties with India can be mended. Those ties had frozen under the Trudeau administration because of Ottawa’s perceived support for Khalistani elements in Canada. Trudeau had blamed Indian govt agents for the death of Khalistani separatist Hardeep Singh Nijjar without credible evidence. New Delhi reacted strongly, resulting in mutual expulsion of diplomats.\nBut today Canada is in a different place with new premier Mark Carney – a career technocrat who has previously served as central bank head in both Canada and UK. Carney has said he wants to improve ties with India, and New Delhi has indicated it is open to burying the hatchet. And the catalyst here is pretty clear – Trump. With the new White House administration upending US relations with Canada and weaponsing tariffs against both rivals and allies, New Delhi and Ottawa find themselves navigating similar choppy waters. Canada is now determined to chart a new, less US-dependent course for itself, and India wants to insulate itself from the fallout of Trump tariffs. Therefore, reviving negotiations on a bilateral trade deal – Canada is a natural resources powerhouse – will be mutually beneficial. \nPlus, given that a strategic scramble for thawing Arctic resources is already underway, Canada has a front seat to this geopolitical play that India too will be interested in. Canada also hosts the G7 summit in a couple of months. Modi has been invited to every G7 summit since 2019. But an invite to the upcoming one is yet to be extended. Should it come, along with reappointment of high commissioners at New Delhi and Ottawa, it would mean ties are once again moving in the right direction. Positive India-Canada relations are necessary insurance in a Trumpian world. \n\n",
        "headline_1": "Chinar & Maple",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/chinar-maple/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-03-2025"
    },
    {
        "full_article": "A loose global alliance that hates eggheads & loves ‘tradition’\nSix authors (Rita Abrahamsen, Jean-Francois Drolet, Michael C Williams, Srdjan Vucetic, Karin Narita and Alexandra Gheciu) set out to understand today’s most dominant political idea globally. The result is World of the Right: Radical Conservatism and Global Order, a book nine years in the making.\nSome of the analyses, though rooted in events in the last decade, help make sense of current news. When the authors talk of Steve Bannon’s 2017 declaration that a Trump 1.0 goal was “to deconstruct the administrative state”, DOGE pops into mind. When they explain New Right’s global alliance in defence of the “natural family” the logic behind Trump 2.0’s crackdown on DEI is clearer.\nWhat drives New Right? Disdain for experts and anti-intellectualism. It promotes a vague anti-elite discourse that includes praise for ‘tradition’. Its main enemy, of course, is Liberal International Order, LIO, which is pro-globalisation & liberalisation. New Right wants to capture universities, publishers and think tanks, LIO haunts thus far.\nLeftwing politics couldn’t build an internationalism, the book says, but its failure gave rise to a radical global Right, interconnected via a “distinct international dimension to their nationalist populist agendas”. Appearances at global meets are critical for New Right politicians, especially those marginalised in home countries. CPAC conferences, in 1970s, were small meetings of American conservatives. That idea is now everywhere from Australia to Japan, South Korea to Latin America, and also Europe.\nWho goes to these conferences? Bolsonaro, Milei, Orban, Farage, Bannon, Ted Cruz, Tucker Carlson, Ben Shapiro…In 2022, Vance attended Israel’s first CPAC. Japan CPAC “pledged support…within Quad” via an “Asia Pacific Conservative Union”. An AfriForum represents White Afrikaner minority in South Africa. A Madrid Charter seeks Iberosphere: a pan-Hispanic trans-Atlantic identity of Catholic faith. New Right strenuously displays closeness with Netanyahu, the book says, to shelter from accusations of anti-semitism.\nNew Right leaders revel in demonstrating friendships in highly mediatised spectacles – hugs & clasped hands. There isn’t unity, but commonality, which generates “energy and commitment”. So, different, but not disconnected.\nConservatism isn’t a school of thought. So New Right thinkers borrow. Marxist egghead Gramsci has been, the authors show, effectively appropriated. New Right reckons it’s a counter-hegemonic struggle against liberal thought, aka Elite Power. It poses as a pal of “forgotten working classes”. It mobilises groups marginalised by national/international processes of globalisation – economic dislocation, inequality and cultural resentment. This is the Common Cause.\nVagueness is a precondition to building political meaning, articulated in common language of tradition, people, nation, civilisation – similar struggles, different contexts. New Right’s free from Left’s anti-capitalism but it isn’t anti-elite. It wants to create a new elite in its own image.\nLIO’s “managerial elite” is the class of experts and bureaucrats in multilateral organisations – guys who oversee rules-based international order. A class unmoored from cultures, argues New Right, and interested in more globalisation and liberalisation. Therefore, the “struggle” to overturn the “woke-industrial complex”.\nThe book devotes a lot of pages to New Right’s battle against “transformation of culture”. This is code for the modern language of rights: disability, LGBTQ, right to choose, right to die, etc. Rights are seen as destroying cultural distinctiveness. New Right would rather legitimise new forms of exclusion.\nJust like radical chic Left, the personal is political – but for New Right, also geopolitical.\n\n",
        "headline_1": "What’s new about the newly powerful right?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/whats-new-about-the-newly-powerful-right/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-03-2025"
    },
    {
        "full_article": "The popular uprising that led to the downfall of the former regime has left law and order in a state of decline. Reports indicate an increase in mob violence, extortion, and the rise of unruly factions. The police force, previously aligned with the regime, largely withdrew from its duties following the uprising as a result of widespread public resentment and retaliatory actions against law enforcement personnel.\nThe key challenge now is how to restore the police force's effectiveness while also exploring alternative measures to address the law enforcement gap.\nPublic dissatisfaction and fear of retribution have prevented many police officers from returning to duty, particularly those who were directly involved in state-led repression. The first step in addressing this crisis is to rebuild police confidence by ensuring that law-abiding officers are not held accountable for the actions of a few.\nDirect engagement with the police force is essential for restoring morale and encouraging participation. Organising interactive, day-long workshops at all sub-district police stations and district headquarters—attended by senior officials, political leaders, and representatives of professional bodies and the community—can facilitate dialogue, provide a platform for police personnel to express concerns, and foster trust between law enforcement and the public.\nHistorically, rural Bangladesh has relied on self-organised crime prevention mechanisms. Chowkidars (watchmen) patrolled villages, with residents often taking turns to monitor security. This informal system, rooted in communal responsibility, ensured safety in areas with limited police presence.\nOver time, modern governance has weakened these traditional structures. However, the concept of community-based defence remains deeply ingrained in our culture. Following August 5, citizens quickly mobilised to protect their neighbourhoods, including guarding Hindu temples during Durga Puja to prevent attacks. This underscores the untapped potential of community-driven security initiatives. Strengthening these efforts through structured programmes can help bridge the law enforcement gap.\nCommunity policing and civilian-led defence strategies are not merely theoretical—they have been successfully implemented in countries like the US, UK, and Australia. International examples from conflict zones further illustrate their effectiveness. During Egypt's 2011 revolution, police abandonment led to the emergence of \"popular committees,\" volunteer neighbourhood watch groups that stepped in to prevent looting. Similarly, in Nigeria, the Civilian Joint Task Force (CJTF) mobilised over 26,000 community members to assist the military against Boko Haram, providing intelligence and securing towns.\nIn Bangladesh, when the regular police force collapsed, Ansar units safeguarded key sites, including police stations, traffic junctions, and Dhaka's international airport. In rural areas, VDP volunteers protected religious minorities from communal violence. Additionally, student-led community networks played a crucial role in maintaining order, stepping in as traffic controllers and night patrols to prevent looting.\nThese civic initiatives underscore that, with proper motivation and organisation, community members can effectively uphold basic law and order, at least temporarily, preventing anarchy in times of instability. They highlight how community-driven security efforts can reduce crime, protect neighbourhoods, and support overstretched official forces. By leveraging local knowledge and trust, these initiatives respond swiftly and adaptively to security threats at the grassroots level.\nIn Bangladesh, community policing structures exist but remain largely ineffective due to insufficient government support. The Gram Police Act of 2006 integrated Chowkidars into the Union Parishad as Gram Police, yet their role has been limited by inadequate resources and oversight. In contrast, the Ansar and Village Defence Party (VDP)—a well-trained paramilitary force specialising in both urban and rural security—has proven its effectiveness during crises.\nA community-driven law enforcement strategy can benefit all key institutions if properly structured. The police, seeking to restore public trust, can enhance their legitimacy through community partnerships. Ansar-VDP, already embedded in local communities, is eager for greater empowerment. The military supports any initiative that stabilises the nation without requiring prolonged deployment. Coordinating their roles—police providing legal oversight, Ansar-VDP handling grassroots security, and the military serving as an emergency strike force—will be essential.\nTo ensure smooth collaboration, the interim government must clearly define responsibilities—community volunteers and Ansar-VDP should manage neighbourhood watch and basic security, the police should focus on investigations and enforcement, and the military should remain on standby for exceptional threats. Currently, the military is engaged in routine patrols and guard duties—tasks that do not require specialised training and risk overextending personnel. A more effective approach would delegate these duties to civil defence units, allowing the military to focus on rapid-response operations.\nFormation of civil defence units: Comprising Village Police, VDP, BNCC, and local volunteers, these units can be stationed in key areas like markets and residential neighbourhoods.\nRegular patrolling: Lightly armed Ansar and police personnel can conduct patrols along highways and transport routes to deter crime and ensure safe passage.\nRapid response teams: Military units, special police forces, and armed Ansar battalions can be positioned strategically to intervene swiftly based on intelligence from patrol teams.\nThis multi-layered security model would restore stability, enhance public confidence, and reduce the military's burden, allowing it to focus on strategic operations rather than routine law enforcement. This clarity will prevent inter-agency friction and ensure institutional support.\nBangladesh's deeply polarised political landscape presents a major challenge. Political factions may oppose community policing, fearing it could be leveraged against them. Additionally, there is a risk that local political groups could exploit community defence forces to target rivals under the pretext of security. Maintaining strict non-partisanship through transparent oversight and independent monitoring is crucial to preventing the formation of party-affiliated militias.\nGlobally, civilian involvement in law enforcement has sometimes resulted in mob justice. For instance, Nigeria's CJTF, despite its effectiveness, faced allegations of extrajudicial killings and abuse of power. Continuous monitoring, strict regulations, and immediate enforcement are essential. Community initiatives must be closely supervised, and any misconduct should be swiftly addressed through transparent reporting. The media plays a crucial role in documenting and exposing violations to ensure accountability.\nFor this strategy to succeed, widespread community involvement and backing from non-partisan civil organisations are vital. A well-organised civil defence system can help restore law and order, enhance public safety, and promote collaboration between law enforcement and local communities. A community-driven security model is not merely a necessity but an opportunity to create a more accountable, transparent, and effective law enforcement system that serves the people. It can be equally effective during peacetime, times of crisis, and electoral periods.\nSaifur Rahman is a senior IT specialist and certified professional.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "A community-driven approach to restoring law and order",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/community-driven-approach-restoring-law-and-order-3856056",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-03-2025"
    },
    {
        "full_article": "Ever since the July uprising, the nation has been rocked by wave after wave of protests, both online and offline, over various issues and developments. While this is but a natural consequence of the heightened exposure to, and awareness of, long-festering injustices and divisions, the recent flare-up over the question of Awami League's rehabilitation following alleged exchanges between some leaders of the National Citizen Party (NCP) and the army chief has the potential to plunge the country into fresh chaos, if not properly addressed. The explosiveness of the situation owes as much to the alleged content of said exchanges, and the manner in which they were revealed, as to the sway involved parties hold over the post-uprising society.\nOn the assumption that these developments are known to all, we are not delving into details. To sum up, in a Facebook post on Friday, NCP leader Hasnat Abdullah claimed that he had been presented with an \"Indian plan\" at the cantonment to rehabilitate Awami League. It involves a \"refined\" version of the party, led by leaders without questionable reputations, which would publicly renounce Sheikh Hasina's legacy and pledge to restore the ideals of \"Bangabandhu's Awami League.\" In exchange, Hasnat wrote, politicians who endorse this new faction would receive parliamentary seats and other concessions. The justification for the move, he added, was that \"it is better to have several opposition parties, including a weak Awami League, than just one party in opposition.\"\n\nAfter the post went viral, it prompted heated debate and demonstrations. Later, the veracity of Hasnat's version of the event was contested by his NCP colleague Sarjis Alam, who accompanied him during the meeting with army chief General Waqar-uz-Zaman, while another, Nasiruddin Patwary, called the post \"inappropriate\". Meanwhile, the army called it \"laughable\" and \"immature\" in a statement shared with the Netra News. However, what's clear from these statements is that a meeting did take place, whether pre-planned or not, and Awami League's rehabilitation did get a mention, even if its intent and other relevant details remain disputed.\nAfter the post went viral, it prompted heated debate and demonstrations. Later, the veracity of Hasnat's version of the event was contested by his NCP colleague Sarjis Alam, who accompanied him during the meeting with army chief General Waqar-uz-Zaman, while another, Nasiruddin Patwary, called the post \"inappropriate\". Meanwhile, the army called it \"laughable\" and \"immature\" in a statement shared with the Netra News. However, what's clear from these statements is that a meeting did take place, whether pre-planned or not, and Awami League's rehabilitation did get a mention, even if its intent and other relevant details remain disputed. This development brings to the fore the critical importance of transparency in any process involving the future of Awami League to prevent confusion, foul play, or political exploitation. It also reaffirms the need for Sheikh Hasina and other leaders to be held accountable for the atrocities they committed. The longer this takes, the greater the risk of chaos.\nWe need to keep in mind that people are still grappling with the consequences of the authoritarian rule of the ousted regime that has left deep scars in society. The last thing we need now is further instability. We agree with the NCP that political decisions should be left to the political entities. But the need for broader consensus in such matters cannot be ruled out either. At the same time, we must be careful that the army is not pulled into any matters that do not concern it. The chief adviser has already said that the interim government had no plan to ban the AL—that doesn't mean AL's future is decided. As the trial process for its crimes continues, politicians may, and should, continue to engage in discussions about it but this must not lead to further turmoil. All stakeholders of the July uprising must act with greater caution and restraint.\n",
        "headline_1": "Questions over Awami League’s future must not lead to fresh chaos",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/questions-over-awami-leagues-future-must-not-lead-fresh-chaos-3855941",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-03-2025"
    },
    {
        "full_article": "There is no denying the fact that the greatest wealth of a nation is neither its geographical size nor its natural resources, but its skilled human resources. This is even truer in a highly populated, natural resource-scarce country like Bangladesh. Labour and entrepreneurship are two critically important ingredients of economic activities. But simple labour or half-hearted entrepreneurship cannot make economic activities dynamic—one needs human resources and innovative and creative entrepreneurship for that purpose. In other words, labour must become human capital.\nThere are three distinctive ways in which the human resources of a country contribute to its economic development. First, the skills and capabilities of humans can effectively and successfully utilise other means of production. In the absence of human resources, the mere presence of land, machinery, and raw materials is nothing but a collection of innate things. Second, in the development process, the impact and contributions of technologies are crucial. But one requires appropriate human resources to properly use those technologies. In today's world of technological and digital revolutions, capable and relevant human resources are a must. Third, in the process of human civilisation, the inventive power, creativity, and innovation of humans have played a major role. When the labour force of a country acquires these traits, it transforms itself into relevant human capital.\nIn developed countries, labour, due to higher labour productivity, enjoys a larger share of national income. For example, in the US, the share of labour income in the country's national income is 62 percent. On the other hand, in Mexico, a developing country, the share of labour income in total national income is only 35 percent—the underlying reason being lower labour productivity. Viewed from yet another angle, in developed countries, labour has been transformed into human capital, while in the developing world, labour is yet to become human resources.\n\nThe digital revolution has changed the world of work, creating new demand for newer skills. In recent times, knowledge-intensive commodity trade accounts for nearly 50 percent of the total global commodity trade. Therefore, people with the skills and resources to use technology and create value can thrive in today's digital world. Globally, 133 million new high-skill jobs have emerged by 2024, but 75 million jobs might have been displaced by automation and new technologies. Among the new roles expected to experience increasing demand are data scientists and analysts, e-commerce and social media specialists, training and development experts, innovation managers, AI and machine learning specialists, big data specialists, information security analysts, and process automation experts. There is no doubt that in the future world of work, new forms of human resources will be needed.\nWith that reality in mind, different countries have been remodelling their entire education systems. They are refining their academic programmes, syllabuses, and teaching and learning methods—emphasising science, technology, engineering, and medicine-based education (STEM). In China, 40 percent of graduates are in STEM fields. The relevant figure for India is 30 percent. In the contemporary world, human resource development emphasises five Cs—cognitive skill, communication, connectivity, collaboration, and coordination.\nIt goes without saying that in the context of the future world of work and the necessary skills for that world, this perspective is extremely important and relevant for Bangladesh. What is the Bangladesh scenario in these contexts? In global comparison, Bangladesh ranked 113th out of 141 countries in the Global Knowledge Index 2024. In the Global Innovation Index, it ranked 106th out of 133 countries. The top five skills rising in demand in Bangladesh are teamwork and leadership skills (93 percent), analytical skills (89 percent), technological literacy (81 percent), critical thinking and problem-solving skills (70 percent), and creative thinking (63 percent).\n\nToday, the youth labour force in Bangladesh is about 27 million, representing 36 percent of the total labour force of the country. About 2 million young people are unemployed, accounting for 79 percent of the total unemployed population. The unemployment rate among the youth is about 7 percent. About 8 million young people are not in education, employment, or training (NEET)—a lost potential for the country. Joblessness among university graduates is on the rise—from 0.25 million in 2013 to 0.90 million in 2023, a more than three-fold increase. By levels of education, the unemployment rate is the highest among university graduates—the joblessness rate among them is 13 percent.\nIn tomorrow's world, Bangladeshi youths will have to compete not only with their peers inside the country but also with youths from the outside world. Therefore, with that objective in mind, the following issues must be stressed.\nFirst, an assessment profile must be prepared regarding what kinds of skills are currently being developed in Bangladesh, identifying both opportunities and deficits. In preparing such a report, the ongoing and upcoming human resource demands of domestic entrepreneurs must be kept in mind. Combining these two, a human resource plan for the country should be formulated and aligned with the overall national plan.\nSecond, a comprehensive list of future job opportunities that may arise in the outside world needs to be prepared. In that context, the impact of digital evolution must be considered. Along with this, it should be identified what kinds of skills would be needed for those job opportunities.\nThird, an evaluation must be conducted on the country's educational structure—academic programmes, syllabuses, teaching and learning methods, physical and educational facilities, and so on. The objective of this assessment would be to determine whether the current educational system can meet the country's human resource demand as outlined in the human resource plan. In light of this, the entire educational system must be overhauled, incorporating information technology as well as artificial intelligence. In developing such an educational structure, on the one hand, focus should be placed on the history, culture, and heritage of Bangladesh, while on the other, lessons should be drawn from the experiences and achievements of other countries.\nFourth, to make human resource development effective, necessary training must be pursued continuously to ensure that knowledge acquired through education and skills built so far are up-to-date, modern, timely, and relevant. Such training is necessary not only for those in jobs but also for teachers and trainers. In education, academic programmes, teaching methods, and educational tools have been rapidly changing. Therefore, knowledge and experiences from the outside world can play an effective role in these areas.\nFifth, specific programmes may be undertaken to improve skills. These include strengthening industry-academic partnerships, developing on-the-job mentorship, organising affordable in-house training, offering skill-based incentives and bonuses, providing language training programmes, utilising government skill development initiatives, and partnering with local NGOs and training providers.\nSixth, the above framework for human resource development requires regular monitoring, close assessments, and objective evaluations. Based on the results obtained, the human resource development framework needs periodic reviews. Such a review may lead to changes, extensions, and refinements of the framework.\nSeventh, over the past 25 years, the education budget of Bangladesh has always been less than 2 percent of GDP, and in 2025, it stands at 1.7 percent of GDP. Similarly, during the same period, the health budget has always been less than 1 percent of GDP. In contrast, India spends 5 percent of its GDP on education and 4 percent on health. In Vietnam, the education expenditure-to-GDP ratio is 4 percent, while the health expenditure-to-GDP ratio is 5 percent. Bangladesh should spend 4-6 percent of its GDP on education and 5-7 percent on health.\nThe world is changing, and so are societies and humans. Changes have also been occurring in human aspirations and expectations. As a result, the demands for human resources and their supply have also been evolving. Bangladesh must be prepared to effectively utilise its one and only unique wealth—its human resources, which holds the key to our future progress, achievements, and development.\nSelim Jahan is former director of the Human Development Report Office under the United Nations Development Programme (UNDP) and lead author of the Human Development Report.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "The future of work: Challenges and opportunities for youth employment",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-future-work-challenges-and-opportunities-youth-employment-3855251",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Taking a hard look at sugar mills' liabilities",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/taking-a-hard-look-at-sugar-mills-liabilities-1742744138",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Water conservation is key",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/water-conservation-is-key-1742744194",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Loss of glaciers threatens life on the planet",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/loss-of-glaciers-threatens-life-on-the-planet-1742744237",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Counterfeit goods — a threat to RMG sector",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/counterfeit-goods-a-threat-to-rmg-sector-1742744274",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-03-2025"
    }
]