[
    {
        "full_article": "Artificial Intelligence (AI)-generated deepfakes, or synthetically generated images and videos, have been proliferating on social media ever since generative AI made photorealistic content as easy as typing a description of a given scene. As this technology developed rapidly over 2024, concerns were raised over electoral integrity and disinformation amplified with the aid of such AI-generated content. While those concerns did not reach the peaks of the feared outcomes, AI “slop” has become pervasive, from low-budget advertisements to high-budget political caricatures. In this context, the Union government’s move to propose mandatory labelling of AI-generated content with an amendment to the IT Rules, 2021, advances the global conversation somewhat in navigating this phenomenon. It is unclear how big the problem of being unable to identify AI slop is for Internet users in India — also the world’s second largest AI user base. Two key factors tilt the scales in favour of acting: as with pre-AI disinformation and misinformation, lies and misleading content may at any time explode into virality, granting them a disproportionate place in the democratic setup; and the technology to create photorealistic content that deceives many people is improving every week. Public personalities have frequently complained, sometimes in court, of the usurpation of their likenesses in the service of unscrupulous projects.Unlike mandatory smoking warnings at the cinema and on OTT streaming services, an intervention that had little industry buy-in before being imposed on entertainment producers and consumers alike with nothing to reliably show for impact, labelling has been offered up by large social media and AI firms from the very beginning of synthetic content’s increasing accessibility. Meta, Inc. decided last year to label AI-generated content on Facebook, while the Coalition for Content Provenance and Authenticity (C2PA) has brought industry players together for working on “digital provenance” issues, borrowing a concept from the art appraisal world. Subordinate legislation may not have been the ideal instrument to effect this change — the IT Rules already regulate streaming services, social media content removals and the now-prohibited real money gaming industry, all without being tested in Parliament. At some point, these rules need to be explicitly considered by people’s representatives. Technology policymakers have mused throughout the Internet-era that regulation lags behind innovation. The government must be willing to dynamically follow up this proposal with agile action both in terms of relaxing rules that have outlived their utility, and introducing new ones according to requirement. Published - October 24, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Artificial Intelligence\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        internet\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        cinema\n                    \n                            /                      \n                        \n                        media\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        artificial intelligence\n                    \n                            /                      \n                        \n                        information technology and computer science\n                    \n                            /                      \n                        \n                        technology and engineering\n                    \n                            /                      \n                        \n                        science and technology\n                    \n                            /                      \n                        \n                        arts, culture, entertainment and media\n                    \n                            /                      \n                        \n                        mass media\n                    \n                            /                      \n                        \n                        election",
        "headline_1": "Synthetic media: On labelling of AI-generated content",
        "headline_2": "The requirement of labelling AI-generated imagery is a good start",
        "link": "https://www.thehindu.com/opinion/editorial/synthetic-media-on-labelling-of-ai-generated-content/article70194342.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-10-2025"
    },
    {
        "full_article": "Small, incremental steps are what set a flywheel in motion. As far as labour laws go, the Tamil Nadu government’s proposal to allow women to be employed in about 20 operations listed as ‘dangerous’, and from which they were prohibited from being employed in so far, is progressive. The government has proposed amendments to the Tamil Nadu Factories Rules, 1950, to allow women to take up even jobs titled hazardous or dangerous, when these Rules come into practice; only pregnant women and young persons will be barred from these jobs. Earlier, the government had amended the Rules to allow women to be deployed on the night shift in factories, changing the historic practice of keeping them out. In this recent amendment, which was hosted in the public realm for feedback in September, factories are also required to get the woman’s consent in writing for the night shift. These are changes that have come literally, rule by rule, but in effect, the government has shrugged off its patriarchal stance here, freeing up women from the perception that they are vulnerable and weak and will have to be protected by the State. The operations which are set to be opened for women include electrolytic process, glass manufacture, manufacture and treatment of lead, generation of gas and petroleum, blasting, liming and tanning of raw hides and skins, graphite powdering, manufacture of dichromates and carcinogenic dye intermediates, fireworks and match factories, manufacture of manganese, dangerous pesticides, use of benzene, and operations involving high noise and vibration levels.Removing legal barriers is the first step toward implementing progressive measures that will facilitate more equitable workplaces. However crucial this first step is in rectifying age-old patriarchy-reinforced assigned gender roles in society and industry, it is not enough. This should be followed up by provision of adequate amenities and facilities for women, including separate toilets, changing rooms, and closed areas for conducting medical checks which are mandated for such industries, besides drop home facilities in places that have hitherto had no women workers at all. This will clearly require some investment, close involvement of the management, and at least initially, active monitoring by State labour authorities. The government must also take care to ensure that women who are in circumstances that might not enable their participation in these jobs are not forced into them, or penalised for not opting for these tasks. Without this being set in place, any progressive measure to dismantle the barriers that keep Indian society from being a more equitable job market will turn out to be a damp squib. Published - October 24, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        labour legislation\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        manufacturing and engineering\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        employee benefits\n                    \n                            /                      \n                        \n                        employee\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "​Good job: On Tamil Nadu and women in hazardous jobs",
        "headline_2": "Factories must provide facilities for women employed in hazardous jobs",
        "link": "https://www.thehindu.com/opinion/editorial/good-job-on-tamil-nadu-and-women-in-hazardous-jobs/article70194321.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-10-2025"
    },
    {
        "full_article": "The numerous add-ons to our daily diet have many benefits for us – and for others \nBunny and I have started taking a daily supplement. Not one of those freebies like the Delhi Times that come along with TOI, the supplement we take is a dietary supplement in the form of a 200mg tablet of magnesium which, far from being free, comes with a sizeable price tag. \nA chemical element, magnesium is an essential mineral which according to Google “is vital for the human body to function properly, playing a key role in muscle and nerve function, blood sugar control and bone health”. \nBeing a workaholic, magnesium doesn’t rest on its laurels after doing all this, but goes on to carry out “hundreds of enzymatic reactions in the body, promotes protein synthesis, and DNA formation, and helps maintain a normal heart rhythm”. \nWhile foods such as spinach, and other green leafy veggies, almonds, cashews, beans, dals, and whole grains are rich sources of magnesium, to be on the safe side adults are advised to take a daily dose of up to 350mg as a dietary supplement. \nBunny and I have been magnesiumising like billy-o for a few weeks and, whether it’s psychological or for real, we find we’re sleeping better and don’t suffer from fatigue-induced cramps or muscle aches.  \nMagnesium apart, there are other dietary essentials such as vitamins, ranging all the way from A to K. Medical science might well unearth more and more vitamins till it runs out of letters of the alphabet. \nWhen I was a boy, nobody seemed to know much about things like magnesium and supplements. The general body of nutritional knowledge was encapsulated in the saying, “An apple a day keeps the doctor away.” \nOur ignorance must have been bliss, for we appear to have got through more or less unscathed, unmagnesiumised enzymatic reactions notwithstanding. \nThose days are long gone, and the dietary order of today are supplements that not only ensure our physical health, but by supplementing its profits also benefit Big Pharma’s financial health. \n\n",
        "headline_1": "Super supplements",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/super-supplements/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-10-2025"
    },
    {
        "full_article": "Google’s chip has brought quantum computing to the frontier of usability. GOI & India Inc must wake up\nLast Dec, Google claimed its quantum computing chip, Willow, had achieved ‘quantum supremacy’. It could do in five minutes what the most powerful conventional supercomputer couldn’t in 10 million-billion-billion years. Experts pointed out the problem Willow had cracked wasn’t a real-world problem. So 10 months on, Willow is back in the news after computing the structure of a molecule 13,000 times faster than a top-tier supercomputer.\nIt’s the moment of ‘quantum advantage’, defined as a point where a quantum computer edges past conventional computers in terms of accuracy, cost, or efficiency. As late as July, IBM scientists were predicting this moment by end-2026, but it’s here already, and quantum computers could be used as tools within five years. This is a very big deal. When – it’s no longer if – quantum computers become available to scientists in fields like vaccine development and nuclear fusion, results will be life-changing. Equally, their use for weapons development could be cataclysmic.\nSo, away from media glare, Big Tech, startups, and govts have been investing to win this race. IBM and Microsoft are among other known names in the field. Chinese govt has committed $15.2bn to quantum computing research, and its best chip, Zuchongzhi 3.0, is said to have 105 qubits or information units – same as Willow, although it’s slower. For perspective, the first quantum computer tested at Los Alamos National Laboratory in US, in 1998, had only 3 qubits. That means, in 27 years the ‘computational space’ on the best chips has doubled 102 times. If you doubled a rupee that many times you’d have 5,071 billion-billion-billion rupees!\nWhere is India in this race? In April, our best quantum computer, made by a startup, was at 25 qubits. Our National Quantum Mission is targeting 50 cubits within five years. That’s slow but unavoidable, given our low investment in R&D – NQM has a seven-year budget of $0.7bn, and India’s overall R&D spend comes to hardly 0.65% of GDP, to which the private sector contributes less than 40%. To remain in the quantum race – which we must – more investment is needed, and it can only happen if the private sector steps up.\n\n",
        "headline_1": "Qubit By Qubit",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/qubit-by-qubit/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-10-2025"
    },
    {
        "full_article": "Its drastically cut population shows we are inhumanly unthankful for millennia of service\nIf it was happening to humans, you would call it genocide. The latest available census data for Madhya Pradesh shows that it’s left with only 3052 donkeys, an awful 94% decline since 1997. This ‘animalcide’, however, is not limited to one state or country. Two major factors (urbanisation+mechanisation and Chinese traditional medicine market) are severing the worldwide man-donkey relationship, which goes back 7000 years. That far from grieving this loss, we are not even noticing it, reflects our fundamental alienation, from plants and animals, air and earth. To mourn is to begin to heal. And begin to do the work of saving what we have been killing mindlessly.\nIt’s true that excepting regions like sub-Saharan Africa, socio-economic factors are deleting donkeys’ traditional roles in agriculture and transport. Even if this was the only explanation for the drastic shrinking of their population, it shows us to be a hideously thankless species. How swiftly we are forgetting how deeply our ancestors – artisans to merchants to administrators – depended on them. Until just a few generations ago they powered the caravans that linked cities, and in more ancient stories they ferried our prophets and gods. There’s a second, more unconscionable cruelty. Ejiao, or donkey hide gelatine, is not new to traditional Chinese medicine and beauty products. But demand’s shot up on the back of the country’s prosperity, a 2011 period drama, Empresses in the Palace, and an ageing population. Even so, it wouldn’t be decimating donkey populations across other countries if those were putting up meaningful defences.\nA 2021 comparative analysis of donkey and mule populations by Stuart L Norris et al finds that between 1997-2018 India’s decline at 74% has actually been worse than China’s 72%. One country’s actions seem active, the other’s passive. But the end result being the same, obviously neither can take the moral high ground. And guess who’s taking it along with the donkey? Poorer communities. Across the developing world, there are folk badly hit by the sudden surge in donkey prices. Often this translates into a painfully increased workload for poor women and girls. Who cares, say the rest.\n\n",
        "headline_1": "Death Of The Donkey",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/death-of-the-donkey/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-10-2025"
    },
    {
        "full_article": "Nah, now it’s more motorcycle diarrhea\nMobikes to left of us, \nMobikes to right of us,\nMobikes massed in front of us\nVolley and thunder.\nCharge out like bats from hell\nBoldly they ride in a swell,\nInto the jaws of pothole Death\nRide the three million.\n– Charge of the Blight Brigade (Sorry, Tennyson)\nThis Dhanteras, Mumbai registered a scant 7% more cars than last year – but  63% more two-wheelers. This spiral was aided and abetted by last month’s 10% cut in GST. God Save Traffic. And us.\nForget urban naxals, I want to crush two-wheeler urban axles. Terror grips me when, each festival, I read about their risen number. Because they all seem to be vrooming on my daily routes, and dense forests of them are rooted on my once-road-now-lane. \nTrue, several other encroachments narrow every stretch beyond pampered SoBo’s cordon sanitaire. But, in an Archimedesian subversion, the mass of bikes much reduces the carriageway, thus increasing the volume of traffic jams and pedestrians displaced.  \nThe official reason for slashing GST from 28% to 18% was to increase ‘youth mobility’. But what about the rest of us roadies? \nElitist? Me? Nevver! Mother-swear I’m all for aspiration and uplifting the  downtrodden. Nakkich, you must throw chai-samosa party for getting own bike and freeing yourself from brutal public transport. But getting private vehicle means road becomes your private property, or wot? Bhaiya, you must obey rules, no? \nNo! Listen, Hi-fly Madam-ji, stop your griping. Instead of griping, grip your seat and admire our daredevil feats. Marvel at the way we zig-zag through peak-hour traffic, not caring for lanes, gravity, or life and limb. Gape at our ability to squeeeeze through the narrowest space to your left. Arrey, what’s a ripped-off rear-view mirror compared to our awesome expertise of zooming past your right?  \nYou should applaud two-wheelers for having breached the three-million mark even before this spike. Mumbai’s critical traffic and lung congestion? What’s that?\n                                             ***\nAlec Smart said: “The most valuable rare earth is Earth.”  \n\n",
        "headline_1": "Motorcycle Diaries?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/motorcycle-diaries-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-10-2025"
    },
    {
        "full_article": "It is deeply concerning that road accidents remain one of the leading causes of injury-related deaths across all age groups in the country. According to a recent government survey, the annual number of road crash fatalities is 24,233, meaning that 66 people die from road traffic injuries every day. In addition, more than 30 lakh people suffer non-fatal injuries in such crashes each year, among them 38,028 left permanently disabled. The survey, carried out between May 2023 and February 2024, came up with these findings after analysing data from 4.43 lakh participants. Three other leading causes of mortality include suicide, accounting for 20,505 fatalities annually; followed by drowning, with 18,268 deaths; and falls, with 14,167 deaths. The survey thus highlights the increasing number of injury-related deaths in the country.\n\nThese findings come at a time when our transport sector remains in complete disarray. According to an estimate by Bangladesh Jatri Kalyan Samity, at least 116,726 people were killed and 165,021 injured in 67,890 road crashes over the last 12 years. While corruption and flawed policies of successive governments are largely to blame for this, the situation has not improved under the interim government either. A large number of unfit vehicles continue to plague our roads. The shortage of skilled drivers, sharp rise in motorcycles, unsupervised operation of battery-run rickshaws and slow-moving vehicles, and poor enforcement of traffic laws also serve as major barriers. Unfortunately, the Road Transport Act 2018 has failed to address the prevailing indiscipline in the sector, as it remains largely unimplemented. Influential transport associations continue to make the rules on our roads. The interim government's failure to enforce its directive to withdraw date-expired vehicles from operation is a case in point. This situation must change.\n\nThe increasing number of injury-related deaths also highlights a public health crisis that demands urgent response. Going forward, the government must prioritise injury prevention by implementing the survey's recommendations, such as developing and executing an injury prevention strategy, forming a national committee for necessary interventions, and building capacity for on-site injury prevention. As road crashes remain a major cause of deaths and injuries, it is crucial that all political parties commit to prioritising road safety and modernising public transport systems before the next election to ensure safer roads for all.\n",
        "headline_1": "Reduce preventable deaths and injuries",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/reduce-preventable-deaths-and-injuries-4016161",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-10-2025"
    },
    {
        "full_article": "It is most unfortunate that the migration sector continues to be dominated by middlemen despite there being proper government channels for recruitment. According to a recent study by the Ovibashi Unnayan Karmi Programme (OKUP), workers are paying exorbitant fees as most of them migrate through informal channels. Among the 1,084 workers surveyed by OKUP in eight migration-prone districts, 56 percent relied on informal or illegal agents to facilitate their migration to the Gulf countries, while only seven percent reported using licensed recruiting agencies. This highlights the grim reality of the limited accessibility of formal recruitment channels, particularly in rural areas.\n\nWorkers have long migrated to Gulf countries under the \"free visa\" system without any job guaranteed before departure. While the government-fixed average cost for migration to the Middle East is Tk 116,224, workers with free visa have to spend around Tk 499,802 on average. And despite paying nearly five times more than the government-approved cost, 43 percent fail to find work after reaching the destination countries, while many must spend additional money to obtain work permits.\n\nReportedly, a total of 938,000 workers migrated to the Middle East in 2022. Of them, 57 percent obtained work permits upon arrival, while 21 percent, who initially failed to secure employment, spent an extra Tk 150,000 on average to acquire work permits (iqamas). The OKUP study estimated that Bangladeshi migrants in Gulf countries lost about Tk 30,000 crore in 2022 alone due to unethical and fraudulent recruitment practices under the free visa system.\n\nAnother alarming finding is that 72 percent of respondents took loans to cover migration costs, while 11 percent mortgaged their land and six percent sold it. And many of those who returned home without finding jobs were unable to recover their mortgaged land. All this is deeply concerning. Migration experts note that there is no such thing as a \"free\" visa; under ILO conventions, workers cannot be sent abroad without an employment contract. Yet, many Bangladeshi migrants go without one, leaving them vulnerable to all sorts of exploitation.\nWe urge the government to take concrete steps to make legal labour migration more accessible and protect our workers from exploitation through strict measures. The recruitment process must be transparent and accountable. Experts also emphasise the need for skill training to prepare our workers for better opportunities abroad. With Saudi Arabia's recent abolition of the Kafala system, we hope the recruitment process for that country will be easier now, while the hardships faced by our workers will be reduced.\n",
        "headline_1": "Legal labour migration for all workers is crucial",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/legal-labour-migration-all-workers-crucial-4015411",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 24, 2025 00:00:00  \nBangladesh's once-thriving shrimp- and frozen fish-export sector is now gasping for survival. Already reeling from an unfavourable international market, the industry has been pushed deeper into crisis by the government's prolonged inaction. Exporters are caught in a severe liquidity trap, unable to sustain overseas trade because of the government's failure to release long-overdue cash incentives --- funds that serve as lifelines for an industry under stress.\nAccording to a report carried in The Financial Express, which is based on the Bangladesh Frozen Foods Exporters Association's (BFFEA's) claim, arrears amounting to Tk 1.74 billion remain stuck with the authorities. This non-disbursement has crippled exporters' operational capacity, jeopardising their ability to honour export commitments and retain a foothold in key markets. In a recent letter to the government, the BFFEA lamented that the arrears have been pending with Bangladesh Bank since September 2025. The association made it clear that the export incentive is not a mere \"bonus\" but a policy tool essential for sustaining foreign exchange earnings and protecting livelihoods of coastal communities. The shrimp and fish export industry, a vital contributor to the economy for over five decades, directly and indirectly employs thousands -- many of them impoverished farmers from vulnerable coastal belts. Industry insiders say disbursement of incentives has remained suspended for nearly a year owing to unresolved audit objections. Although those objections were reportedly cleared by September 2024, no subsequent payments have been made. This bureaucratic inertia has left exporters in limbo, their working capital depleted and their confidence in policy support severely eroded. Many warn that further delay could inflict lasting damage to the sector, which is already struggling to stay afloat in a turbulent global market.\nShrimp exports have been on a steady decline for years, with slide steepening in recent times. Demand for Bangladesh's premium black tiger shrimp has fallen sharply in traditional markets such as the European Union and the United States, which together absorb around 80 per cent of the country's shipments. Persistent recessionary pressures in the West, coupled with aggressive pricing from lower-cost producers in Southeast Asia and Latin America, have eroded Bangladesh's competitiveness. Once the country's major foreign exchange earner after garments and jute, the shrimp sector is now a shadow of its former self. Despite its renowned quality and distinct flavour, Bangladeshi shrimp is losing ground amid global oversupply and buyers' price sensitivity. Export earnings from shrimp and frozen fish fell by 4.26 per cent in the last fiscal year --- a reflection of the mounting challenges and policy neglect confronting the industry.\nAt this critical juncture, releasing the outstanding cash assistance would provide at least a temporary reprieve. While it may not reverse the long-term export slump, timely disbursement could restore liquidity and enable exporters to meet commitments, and support investment in quality and compliance. The government must act with urgency and clarity. Failure to do so risks not just the collapse of a traditional export pillar but also the livelihoods of thousands who depend on it.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Easing problems facing shrimp and fish export",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/easing-problems-facing-shrimp-and-fish-export-1761230056",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       October 24, 2025 00:00:00  \nAccusing fingers were raised from some quarters at the three devastating fire incidents at Shialbari, Mirpur, Chittagong Export Process Zone (CEPZ) and the cargo village of Hazrat Shahjalal International Airport (HSIA) within a span of just five days. They found the bogey of sabotage. Such premature conclusion without ever going deep into the origin of the three incidents of fire acts as a naive attempt at shifting the focus from the endemic problems of violation of rules and laws and the general ill preparation for such disasters. \nAt no point was the four-storey garment factory in Mirpur responsible for the tragic fire that claimed lives of its 16 workers. It was the illegal chemical warehouse adjacent to the RMG factory that made a perfect setting for a tragedy of this order. So noxious were some stored chemicals that the vicious smell emitting from the godown could be felt after three days! This defies any sabotage theory. \nThe CEPZ disaster was also the RMG factory's own making. Not only did it reportedly violate the building code but also dilly-dallied with the procurement of the fire safety certificate. When factories and industries circumvent key legal provisions in order to maximise profits, such disasters are most likely to happen. \nIf these two incidents of fire take place in private industrial facilities, the cargo village fire at the prime international airport of the country exposes the mindless arrangement of temporary storage of sensitive and inflammable substances such as chemicals. That a disaster did not happen much earlier is itself a bit of luck. When the governing motive ought to be effective and efficient cargo control in order to sustain the supply chain in this globalised trade regime, the HSIA has been negligent of equipping the cargo storing facilities irrespective of export or import with advanced and high sensory devices. \nHigh-resolution X-ray scanners, explosive detection system and spectral technique help detect threats fast and precisely. Even a more advanced combined imaging technique called fast neutron and gamma ray radiography (FNGR) has been introduced to state-of-the-art airports for scanning air cargo. At a time when commodities cross continents quickly, delay in handling at HSIA cargo terminals has its domino effects not only on the production and delivery systems of local factories and industries but also on the global trade. The importers of high-value raw materials are also the exporters of finished goods to Western markets. So any estimate of the losses incurred by importers of raw materials for use as ingredients for their products will fall short of the overall negative impacts. \nThe temporary web portal opened by the Bangladesh Garment Manufacturers and Exporters Association (BGMEA) has received responses from 1,300 members by Tuesday. They claim damages to the tune of $7.5 million which amount is sure to rise with more respondents presenting the amount of losses they suffered. Now that the section reserved for imported goods at the cargo village has been completely gutted, a small space of the export section is used to store imported goods. But the 550 tonnes of cargo that arrive daily is beyond accommodation at that designated space. So the importers are forced to halt their import and priority consignments are now stuck at Dubai and Singapore airports. \nThis is double whammy for factory owners and industrialists. First, their imported goods have been destroyed by the fire and now they cannot take delivery of their consignments because of space constraints. Its impact will be felt on the production and supply lines. The pharmaceutical industry, according to the Bangladesh Association of Pharmaceutical Industries (BAPI), is likely to face an impact of $40 billion because of the destruction of active pharmaceutical ingredients (API) at the cargo village and the delay in arrival of fresh consignments. It is quite revealing that 97 per cent of drugs are produced by the local pharmaceutical industry but 90 per cent of APIs have to be imported from abroad, mostly China and India. \nThe National API and Laboratory Reagents Production and Export Policy was introduced in 2018 with the aim of achieving self-sufficiency in API. A slew of incentives such as fiscal and financial benefits like tax holidays and exemptions, export-oriented support in the form of cash incentives and subsidies and operational advantages covering preferential land access and extended loan terms was declared. But little progress was made in API production at the industrial park in Munshiganj. Only one drug company could go into limited operation and two others were waiting for approval as of 2024. In 2025, the 216-acre industrial park could not add anything to its credit. \nHad the API industrial estate maintained its schedule, there would be no such disruption of the supply chain with drastic fall in import. The colossal losses incurred by importers were certainly avoidable. There is a national tendency of unlearning the proverbial principle that a stitch in time saves nine. But here is more at stake. The safety and security issues have never been high on the agenda. This is exactly why the premier airport of the country can overlook the need for storing chemical and other inflammable materials in separate chambers after inspection with advanced devices. The raw materials for pharmaceutical industry even demand cooling ecosystem of minus temperatures. A comprehensive outlook of infrastructure development at the API industrial park against the backdrop of the 90 per cent import could kick-start production at the facility. In the absence of gas supply and other problems the industrial park could not turn into an API hub. An 11-member committee was formed and charged with the responsibility of suggesting recommendations aimed at developing the API industry. But the committee has failed to submit its report even after a month beyond the deadline. This shows how the tunnel vision of policymakers makes matters complicated. If the mismatch, irregularities and outright violation of laws in the industrial sector are not addressed and opportunities for developing local industries such as the API seized, this country will continue to pay heavy prices for the lapses.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "How short-sightedness bedevils industrial development",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/how-short-sightedness-bedevils-industrial-development-1761230090",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       October 24, 2025 00:00:00  \nThe invention of antibiotics was a milestone in the history of modern medicine and those were hailed as miracle drugs for their ability to prevent infections. These lifesaving drugs are now losing their effectiveness globally, much to the concern of health experts. The situation is particularly alarming in Bangladesh. A recent World Health Organization (WHO) report has revealed a shocking truth --- several of the commonly used antibiotics in the country have lost up to 97 per cent of their efficacy. Why is it happening? There are many reasons behind it -- unregulated sales, over-prescription, self-medication by patients and incomplete dosages.\nAccording to media reports, physicians are finding that once-reliable antibiotics are not working the way they are supposed to. Infections which were easily treatable a decade ago now linger on or recur, compelling physicians to increase doses or change drug brands.\n This phenomenon, technically called antimicrobial resistance, threatens to undermine the very foundation of healthcare. Let alone major surgeries, childbirth and even minor infections can become life-threatening if antibiotics do not work properly.\nThe problem of antibiotic resistance begins with drug distribution and use in Bangladesh. Here antibiotics are sold over the counter at almost every pharmacy, without any doctor's prescription. Anyone can walk into a medicine store and buy antibiotics as per his/her wish or as per the advice of an untrained salesperson. Another problem is that many patients do not complete their full course of antibiotics thanks to ignorance of its impact. Stopping use of antibiotics halfway leaves behind the bacteria that have survived to develop resistance. When such patients get infected again, the same antibiotic no longer works. Experts say incomplete dose is one of the most dangerous contributors to the rise of resistant bacteria.\nOver-prescription also plays a major role in antibiotic resistance. Many doctors prescribe antibiotics as a precautionary measure rather than a necessity while many patients expect doctors to prescribe the drugs for quick relief. The problem is further aggravated by the extensive use of antibiotics in livestock and aquaculture. Antibiotics are mixed into animal and fish feed to promote growth and prevent disease outbreaks, even when it was not necessary. These antibiotics eventually enter the human food chain through consumption of meat, eggs, and fish, as well as through contamination of soil and water. This way bacteria in humans and animals exchange resistance genes over time.\nBangladesh has laws and regulations in place to check indiscriminate use of antibiotics. Drugs Act of 1940 and its subsequent amendments require antibiotics to be sold only on prescription while a High Court verdict ordered the government to control the sale and use of antibiotics. Still the situation is getting worse with every day passing due to their lax enforcement.\nNow the question is how we can combat the antibiotic resistance catastrophe. There is no easy way or shortcut to fight the phenomenon. We need to take a holistic approach to this. The government must effectively enforce existing laws, shutting down unlicensed pharmacies and penalising unauthorised sales of antibiotics where necessary. Pharmacists should be properly trained to prevent over-the-counter sale of such drugs. Doctors have a major role here. They need to strictly follow guidelines, prescribing antibiotics only when absolutely necessary while the use of antibiotics in animal farming must be regulated strictly.\nPublic awareness is most crucial to tackling improper use of antibiotics. Schools, health facilities and media outlets should launch campaigns against indiscriminate use of antibiotics so that people become aware of the dangers of the drugs' misuse. People must understand that taking antibiotics unnecessarily or not completing a prescribed course can endanger everyone.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The danger of antibiotic resistance",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-danger-of-antibiotic-resistance-1761230138",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 24, 2025 00:00:00  \n\nOver the past two months, the price of gold has been surging continuously, reaching unprecedented levels. The rise has been so sharp that middle-income consumers around the world are hesitant to purchase gold under the current circumstances. This sudden surge in the gold price has prompted economists to delve deeper into the underlying factors.\nThough the sudden rise in gold prices is staggering, it is not an unconventional phenomenon. In 1979-1980, gold prices soared amid the oil crisis and inflation shock. Again, during the 2008-2011 global financial crisis, gold prices surged due to worldwide banking instability. More recently, the Covid-19 pandemic in 2020 led to a surge following clashes in global markets. Likewise, economists now attribute the 2025 rally in gold prices to ongoing global economic uncertainty.\nThere can be multiple key factors behind the recent surge in gold demand, driving its price to record highs. While there are expectations of interest rate cuts from the U.S. Federal Reserve, gold does not produce interest, which makes it more attractive. Moreover, escalating tensions in U.S-China relations over trade policies have weakened global growth, prompting investors to turn towards safe havens like gold. Central banks are also increasing their gold holdings to diversify away from the US dollar and counterbalance currency risk. Another robust inflow has been observed in gold-backed exchange-traded funds (ETFs), which provide investors with easier access to gold exposure. At the same time, several countries are actively reducing their dependence on the US dollar in international trade, boosting gold's relative appeal.\nAlthough gold has been rallying recently due to these economic factors, it also has some caveats. If the Federal Reserve backs off from rate cuts, it could slow gold's momentum. Moreover, following sharp gains, the gold market may consolidate. Therefore, whether the gold price surge continues depends heavily on central bank reserve policies, currency dynamics, and how geopolitical uncertainty evolves.\nMD. Ashfaque Islam\nDepartment of Finance and Accounting\nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Gold price and global economic uncertainty",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/gold-price-and-global-economic-uncertainty-1761230166",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-10-2025"
    }
]