[
    {
        "full_article": "The composition of the newly sworn-in Council of Ministers in Bihar, and the distribution of portfolios, reflect the ongoing realignment of power between the BJP and the JD(U). JD(U) supremo Nitish Kumar retains the post of Chief Minister, even though his party finished second to the BJP in the Assembly election. However, for the first time in his nearly 20 years as Chief Minister, he is not in charge of the Home Department. Samrat Choudhary, one of the two BJP Deputy Chief Ministers, now controls this administratively powerful ministry. Vijay Kumar Sinha, the other Deputy Chief Minister, has been assigned revenue, land reforms, mines and geology, further consolidating the BJP’s control over critical administrative levers. The BJP holds 14 of the 26 ministerial berths and controls key departments including health, law, road construction, urban development, and agriculture. The BJP has effectively taken a decisive step in formally inverting the hierarchy of its alliance with the JD(U) in its favour. While the BJP was the larger party even in 2020, Nitish Kumar retained crucial ministries. The social justice plank and the composition of the previous Assembly gave the JD(U) room to keep an alliance with the RJD open. But the overwhelming sweep of the National Democratic Alliance this time has not only placed the BJP firmly on top but has also made any exploration of alternatives by the JD(U) difficult, if not impossible.Nitish Kumar is battling ill-health; while he remains indispensable for the BJP, the party is also carefully planning its long-term path. It has built a wide and deep caste coalition, seeking to reach communities that have traditionally viewed the JD(U) as their platform. The induction of Ram Kripal Yadav, a former Lalu Yadav loyalist who joined the BJP, signals that Yadavs too can have a place in the party. Through clever social engineering and administrative manoeuvring, the BJP has now positioned itself at the pole position of Bihar politics. But the real challenge ahead is good governance. The BJP may claim that its repeat victory is a popular endorsement of its previous government, but the State remains behind on many development indicators. The true test for the new Council will be whether it can pull Bihar forward. Bihar is home to nearly a tenth of India’s population, and the State’s development can positively influence the entire country. The Council should confront the substantial governance deficit honestly and work to address it with active support from the Centre. Published - November 24, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Bihar\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Janata Dal (United)\n                    \n                            /                      \n                        \n                        health\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        National Democratic Alliance\n                    \n                            /                      \n                        \n                        Caste\n                    \n                            /                      \n                        \n                        population\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "​The Council of BJP: On the Bihar Council of Ministers",
        "headline_2": "Nitish Kumar and JD(U) are no longer in command in Bihar",
        "link": "https://www.thehindu.com/opinion/editorial/the-council-of-bjp-on-the-bihar-council-of-ministers/article70314360.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-11-2025"
    },
    {
        "full_article": "The Trump administration’s draft peace proposal for Ukraine has triggered predictable unease in Kyiv. President Volodymyr Zelenskyy has warned that Ukraine now faces a “very difficult choice”, risking the loss of its dignity or a key partner. U.S. President Donald Trump has urged him to accept the proposal by Thanksgiving (November 27). Ukraine’s apprehensions are understandable. According to the leaked draft of Mr. Trump’s 28-point plan, Kyiv would be required to cede territory in Donetsk and recognise Crimea, Donetsk and Luhansk as de facto Russian. In the other two oblasts annexed by Russia (Kherson and Zaporizhzhia), the conflict would be frozen along the line of contact, effectively allowing Moscow to retain the areas it has seized. Russia would withdraw from the territories it has captured outside the five oblasts and pledge not to attack neighbouring countries again. The plan also demands Ukraine cap its armed forces at 6,00,000 personnel and formally renounce its bid to join NATO. The bloc’s eastward expansion would be halted, sanctions on Russia lifted, while Ukraine would receive “reliable security guarantees”. The plan does not elaborate on these guarantees, but U.S. media said that the Trump administration has circulated a separate three-point plan, promising NATO-style security assurances to Kyiv. Russian President Vladimir Putin has positively responded to the proposal, but Ukraine and its European partners are scrambling to craft an alternative proposal to achieve what they call “peace with dignity”.Several elements of the Trump plan mirror Russia’s long-standing demands, including the halt of NATO’s eastward expansion. On the other hand, the proposal that Ukraine cede territory is not going to be easy for any Ukrainian leader to implement. This makes it enormously difficult for any mediator to craft a peace blueprint that provides genuine common ground for the warring parties. Any meaningful push for peace must take into account at least three dimensions. First, the reality on the battlefield; second, Ukraine’s need for credible and lasting security assurances; and third, the creation of a new security framework in Europe. The military balance currently favours Russia, which now controls over 20% of pre-2014 Ukraine. Mr. Zelenskyy’s regime, on the other hand, is grappling with corruption scandals. The tragedy of Ukraine is that it is trapped in the great power rivalry between the West and Russia. Trust has evaporated, and the post-Cold War European security order lies in tatters. A peace deal must address this lack of trust and seek to build a new security equilibrium in the region, addressing Europe’s fears and Russia’s concerns. None of these goals can be achieved through an open-ended war. Mr. Trump’s plan, though imperfect, at least offers a structured framework for dialogue, involving the U.S., Europe, NATO, Ukraine and Russia. Published - November 24, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        Ukraine\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        armed Forces\n                    \n                            /                      \n                        \n                        NATO\n                    \n                            /                      \n                        \n                        Europe\n                    \n                            /                      \n                        \n                        peace negotiations\n                    \n                            /                      \n                        \n                        Donald Trump",
        "headline_1": "​Difficult choices: On Trump administration’s draft peace proposal for Ukraine",
        "headline_2": "Ukraine and its allies must seek to build on Donald Trump’s proposals",
        "link": "https://www.thehindu.com/opinion/editorial/difficult-choices-on-trump-administrations-draft-peace-proposal-for-ukraine/article70314231.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-11-2025"
    },
    {
        "full_article": "Thanks to SIR, bhooth-capturing may become a thing of the past\nIf indeed the 65L names deleted from the records by the Special Intensive Revision (SIR) were of bona fide living residents of Bihar whom the ruling dispensation in the state (and the Centre) allegedly wanted to disenfranchise, there should have been a huge outcry at the polling booths. But there was none. So the inescapable conclusion is that many, if not most, of the electoral rolls in India are haunted – full of ghosts of people long gone.\nAs by their very nature they lack form, these spirits could be persuaded to spectrally arise from the rolls to take on the guise of whoever the ruling dispensation wants at election time. And for decades, the relevant authorities were apparently happy to accommodate these obliging disembodied beings in the rambunctious festival of democracy that we Indians call elections. This eidolic cohort could be called, to coin a phrase, poll bhooths.\nThey came in especially handy for that peculiarly Indian poll-time activity called bhooth-capturing, which was how some political parties facilitated desirable election results. Lakhs of ghostly voters mysteriously cast their ballots without being seen, often leading to improbable victories or victory margins. Those who did not believe in this supernatural adult franchise, of course, had a more mundane name for this phenomenon: scientific rigging.  \nCultivating this phantasmal constituency has its advantages too. They do not have any demands, given their disembodied state. For much the same reason, they also do not have any political loyalties; arguably they can be roped in to bolster the electoral chances of anyone resourceful enough to ‘capture’ these bhooths. But SIR has proved to be a ghostbuster par excellence. Thus, the political bhavishya (future) of these bhooths of elections past appears dim.\nGhosts do not have discernible voices, alas. So even if they still want to rally behind any political party’s ‘vote chori’ clarion call in the future to demand their right to resume or continue participating from the afterlife, they cannot be heard. Even if they became audible somehow, electoral rules debar them as such rights end with, well, death. Poll bhooths have to reconcile themselves to the fact that their incorporeal participation in Indian elections is over. \n\n",
        "headline_1": "Bhooth-proof elections",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/cultural-chromosomes/bhooth-proof-elections/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-11-2025"
    },
    {
        "full_article": "As the Trump-Mamdani meet goes viral, remember fun political theatre is often nothing more than fun\nOpposites attract. Enemies become lovers. Friday’s Trump-Mamdani meet at the White House saw them cosplaying all kinds of bromance tropes. And that left all kinds of people picking up their jaws from the floor. They both command strong fan bases, but from opposite ends of the ideological spectrum. Trump’s called Mamdani “100% communist lunatic”. Mamdani has sold his “progressive, Muslim immigrant” character as “despot” Trump’s “worst nightmare”. So both their fans expected tense times at a White House known for raking visitors over the coals. While the touchy-feely jokey-wokey tryst that they got instead has attracted sundry explanations, the most convincing is the classical one.\nDesis have found Mamdani’s polite smile, respectful head tilt and general mollifying of Trump kick in a very particular muscle memory – of tactical deference to Aunties and Uncles whose lectures they actually have zero intention of obeying. Dems are anxious their new hero is signing a deal with the devil. Republicans are worried about how much Trump’s penchant for crushing on celebrity weakens him. Shashi Tharoor sees the whole thing as democracy working beautifully – candidates fighting like hell during an election but then working together afterwards. What the earnestness of all these theories gets wrong is how much politics is a form of theatrical performance. \nThis dates back to politics’ roots. Recall that great figures of the late Roman republic – Caesar, Pompey, Cato – were sort of actors playing roles on the public stage, crafting personae (the word itself means ‘mask’) that embodied particular virtues or political positions. And there’s something especially theatrical about  a ‘strange bedfellows’ moment. Reagan-Gorbachev in Reykjavik or Vajpayee-Sharif in Lahore are high-order examples of such staging. Often, though, there is simply no grand civilisational purpose. Just two sharp political players deeply skilled in dialogue and visuals that can go viral. That’s an end in itself.\nBut in thinking about ancient Rome, it also becomes obvious that the blurring of line between genuine political action and staged spectacle is not at all a modern invention. This is worth thinking about seriously. Often we rank what is enacted before an audience as less important than what’s conducted behind closed doors. Or whatever we imagine that to be. If we instead understand politics as operating according to theatrical logic, then image, performance, and spectacle are not less in substance. Whatever all may divide Trump and Mamdani, they both really, really get this. You are reading their body language? They jolly well plan on that.\n\n",
        "headline_1": "Sighted: Bromance",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/sighted-bromance/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-11-2025"
    },
    {
        "full_article": "Govt must upgrade auto safety norms more than it’s planning to do\nFinally, stricter norms are to be rolled out for automobile safety in the next phase of Bharat NCAP starting Oct 2027. Cars will need to undergo five crash tests, compared with the current three. The new regime will add full frontal and rear crash tests to the existing offset (frontal), side, and side-pole impact tests. In short, getting a five-star safety rating for automakers will get tougher. For a country that has the dubious distinction of recording the highest road accident deaths in the world, any effort to improve road safety – both for motorists and pedestrians – should be welcomed. \nBharat NCAP was launched in 2023 as a voluntary crash testing and safety rating system, compelling car manufacturers to meet certain safety standards by leveraging consumers’ desire for better automobile safety features. However, over the last couple of years, experts have pointed out the perceptible gap between Bharat NCAP and other international crash testing programmes such as Global NCAP and Euro NCAP. For example, Bharat NCAP currently lacks pedestrian safety tests, while Global, Latin, Asean and Euro variants have them. Second, Bharat NCAP was marketed as a cost-effective model for automakers. But this was essentially due to absence of certain safety tests that are standard in other NCAPs. Case in point Euro NCAP, in addition to crash safety, evaluates additional aspects such as Autonomous Emergency Braking and Driver Attention Monitoring Systems. \nOf course, cost is a major consideration in a price-sensitive market such as India. This is precisely why the number of passenger vehicles in India with six airbags has been so low – 12-13% in India compared to 98% in US in 2023. However, Maruti Suzuki made six airbags standard in the majority of its models this year. Bharat NCAP 2.0 will help shore up this trend. India, with 11% of the world’s road accidents, certainly needs this shift towards safety. \n\n",
        "headline_1": "Car & Sarkar",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/car-sarkar/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-11-2025"
    },
    {
        "full_article": "Man is basically a hunter; he is not by nature vegetarian. First, he became a hunter, and for thousands of years he was just a meat-eater… All of that is carried in the unconscious of humanity, says OSHO\nTerrorism has many undercurrents. One is that because of the creation of nuclear weapons, the nations are pouring their energies into that field, thinking that the old weapons are out of date.\nThey are out of date, but individuals can start using them. And you cannot use nuclear weapons against individuals — that would be simply tenuous. If an individual terrorist throws a bomb, it does not justify that a nuclear missile should be sent. The nuclear weapon has given individual people a certain freedom to use old weapons, which was not possible in the old days because governments were also using the same weapons.\nMy understanding is that the way he has lived, man needs a war every ten to twelve years. He accumulates so much anger, so much rage, so much violence, that nothing short of a war will give him release. So, there is war after war, with a gap of only ten to 15 years.\nThat gap is a kind of relaxation. But again you start accumulating, because the same psychology is working… Man is basically a hunter; he is not by nature vegetarian. First, he became a hunter, and for thousands of years he was just a meat-eater… All of that is carried in the unconscious of humanity. Religions have imposed things superficially on man; his unconscious is not in agreement. Every man is living in a disagreement with himself. So whenever he can find a chance for a beautiful cause — freedom, democracy, socialism — any beautiful word can become an umbrella to hide his ugly unconscious, which enjoys destruction.\nTerrorism simply means that what was being done on a social scale now has to be done individually. It will grow. It can only be prevented if we change the very base of human understanding — which is a Himalayan task; more so because these same people whom you want to change will fight you, they won’t allow you to change them easily. In fact, they love bloodshed; they don’t have the courage to say so… Until we change the basic grounds of humanity, terrorism is going to become everyday affair. It will happen in the airplanes; it will happen in the buses. It will start happening in the cars. It will start happening to strangers.\nSomebody will suddenly come and shoot you — not that you have done anything to him, but just the hunter is back.\nThe hunter was satisfied in war. Now war has stopped and perhaps there is no possibility for it. The hunter is back; now we cannot fight collectively. Each individual has to do something to release his own steam. Things are interconnected. The first thing that has to be changed is that man should be made more rejoicing – something which all religions have killed. The real criminals are not caught. These terrorists and other criminals are the victims. All religions are real criminals because they have destroyed all possibilities of rejoicing. They have destroyed the possibility of enjoying the small things of life; they have condemned everything that nature provides you to make you feel, pleasant.\nThey have taken everything away; and if they have not been able to take away a few things because they are so ingrained in your biology – like sex – they have at least been able to poison them.\n\n",
        "headline_1": "Undercurrents of terrorism",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/undercurrents-of-terrorism/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 24, 2025 00:00:00  \nIt is indeed an affront to Bangladesh that hundreds of its citizens, deceived by false promises of jobs abroad, end up on battlefields in Ukraine, get trapped in brothels in India, suffer sexual abuse in Middle-East countries or meet a tragic death in the Mediterranean. Such incidents, occurring with disturbing regularity, are not only a crime against humanity but also a profound embarrassment for any nation that has an iota of self-respect. It is a reflection of the sad truth that the country could not ensure the basic needs and dignity of its people even after 55 years of independence. Tall claims by successive governments about socio-economic progress ring hollow when grinding poverty, lack of jobs and social repression drive hapless poor people into the traffickers' trap out of sheer desperation.\nIn 2012, the government enacted the Prevention and Suppression of Human Trafficking Act to combat human trafficking, introducing even the death penalty as a deterrent. It was hoped that such a stringent law would at least curb its prevalence, if not completely eliminate the crime. But in reality it did not, mainly because of the delayed justice delivery system and extremely low conviction rate. The latest government report for January-June 2025 exposes how justice remains painfully slow for thousands of victims. As of June 2025, a staggering 1,529 cases were still under investigation and when previously filed cases are included, the total backlog of cases under investigation or judicial process rises to 3,128. \nThe most troubling figure, however, is the conviction rate. Despite the scale of the crime, only 28 individuals have been convicted in just nine cases. Overall, conviction rate in human trafficking case is reportedly as low as 1.5 per cent. It is alleged that corrupt investigating officers take bribes from both the victims and the accused, deliberately delay investigations and often help members of powerful trafficking rings to escape punishment. This outrageous disregard for the rule of law has virtually rendered the laws against human trafficking toothless. The low conviction rate, coupled with the slow pace of justice, not only emboldens traffickers but also erodes victims' trust in the justice system.\nTo effectively combat human trafficking, it is essential to address the root causes of the crime, raise public awareness and ensure the speedy prosecution of trafficking offences. Law enforcement agencies must demonstrate sincere commitment to bringing traffickers to justice. It must be ensured that traffickers who are caught and tried receive the punishment they deserve. Human trafficking is not merely a law-and-order issue; it is a profound human rights crisis. The country owes its socially and economically vulnerable citizens an effective justice delivery system. It owes them protection, dignity and some sort of rehabilitation mechanism. The victims of trafficking must be brought under the government's social welfare schemes. While a number of NGOs are working in this area, they are not in a position to meet the challenge of catering to such a large number of victims. The government must accelerate its efforts to this end if it does not want Bangladesh to be seen as a nation indifferent to human rights.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Delayed justice is disservice to trafficking victims",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/delayed-justice-is-disservice-to-trafficking-victims-1763917400",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       November 24, 2025 00:00:00  \nWhether it is fire, or storm, earthquake or flood, what the magnitude of devastation it would cause depends both on pre-calamity preparedness and post-calamity reaction of the population stricken by any disaster. The destruction in question is not just about deaths, injuries and loss of property. However, in our materialistic outlook, after deaths, collapse of buildings and other physical infrastructure gets the most attention. Attention to the victims of physical injury comes next. Unfortunately, in our society, victims of post-disaster psychological injury get the least attention. Nowadays, with the advent of social media, the psychological harm caused to the disaster victims has amplified due to information overload, misinformation and rumour. A research article published in the prestigious British science journal, Nature, in its July 27, 2024 issue stated that the widespread dissemination of negative online information might generate cyber violence or lead to serious adverse psychological outcomes. \nThe finding was the outcome of a study that considered a natural disaster event involving avoidable deaths and child casualties as an example to identify emotional contagion and simulation interventions. The data according to the study was derived from the aftermath of a flash flood in the Loncaogou Scenic Area, Sichuan Province, China. The analysis found that negative emotions were more persistent and contagious than positive emotions. That negative emotions spread and impact the audience, here the victims in a post-disaster dispensation, faster and deeper than positive emotions, we know from our everyday experience. Especially, rumours and fake reports about the fallouts from a disaster is a common experience in the present-day world. Except those deliberately involved in causing psychological trauma in a populace following a natural calamity, those behind such misinformation as well as disinformation are, often, unaware of the fact that the rumours and fake pictures of damage on the social media may cause widespread anxiety, depression, Post traumatic Disorder (PTSD) and other forms of fatal consequences. Such conditions including panic reaction among the disaster victims may even obstruct relief operation and their efforts to seek safety measures. \nConsider the deluge of rumours and fake news that followed November 21 (Friday)'s earthquake in Bangladesh of which the epicentre was (at Narsingdi) not far from the capital city of Dhaka. Considering the actual number of deaths and damage to infrastructures so far reported since last Friday morning, the earthquake caused more psychological damage to the people across the country than physical harm. However, this is not meant to anyway belittle the casualties of the tremor so far reported. Every death counts and the families affected by such deaths know that whatever the reason behind the deaths, road accidents or earthquakes. But here we are concerned more about how social-media-created rumours following sudden disaster like earthquake might negatively impact the direct victims of the calamity or those who just listen to or read about those on the social media. \nA fact check conducted by a local media house, for example, found that a picture was spreading on the social media to the effect an eight-storey building had collapsed in Dhaka following Friday's tremor. But a reverse search found that the image of the collapsed building doing the rounds on the social media bore some similarity to that of the Lafayette building of the Detroit city in the USA. The building is learnt to have been demolished in 2010. However, some difference in the image of the taken down Lafayette building which was a 14-storey (with one floor as basement) one, while the one in picture passing for the damaged building in Dhaka, was showing 11 storeys over the ground.\n The fake picture about the so-called 'destroyed Dhaka building' had other points of difference with surroundings of the demolished Lafyette building in that the latter had high-rise structures around it. But the fake 'Dhaka building' did not have images of high-rise buildings surrounding it. However, the search to find if it (the fake collapsed Dhaka building) was created with the help of AI could finally come up with an answer. It was indeed done with help of AI. Similarly, there were also pictures of some leaning buildings among which was a two-storey one with a big crack in the middle, while other parts of the building showing as unaffected. Its picture was spreading on the facebook. The picture also had a poetic caption that said how helpless humans were before the forces of nature. However, reverse image search proved futile as no similar source image could be found. But analysis of websites containing AI-generated pictures of buildings provided some clues to the pictures spreading on the social media. Clearly, the picture of the part-bifurcated two-storey building has no copy in the real world. Also, take the fake video of the collapsed flyover at Diabari in the capital city. The fake video-link of the collapsed flyover was also spread to some Indian news media. The fake report was briefly carried by some news media in Dhaka. Analysis reached the conclusion that the picture of the collapsed flyover was hundred per cent AI-generated. Interestingly, some news media even circulated report of the tilted building of the Chief Adviser at Tejgaon. Though the media houses deleted the reports and regretted to have broadcasted those, it was circulating on the social media all the same. But the misinformed public, all of whom may not be educated enough to tell the real from the fake images, might be unduly panicked by such pictures or videos. \nMany people, just out of fear, have already left Dhaka city to neighbouring districts with fewer buildings and more open spaces. Maybe those areas are safer in case of a devastating tremor striking the city. But if the city is the source of their livelihood, how long can they stay away from their work? For no one can predict when the next jolt will come -- it may be the next moment, the next week or a century later. Worse, no place on earth can guarantee one ultimate safety. Moreover, the earthquake-related fear arises mainly from the public's unfamiliarity with this kind of danger. But when it comes to familiar circumstances but with dangers lurking around there, people do not show signs of much fear. Consider, for instance, a bus travel in Bangladesh. Will the fear of a possible road accident leading to even death, which is a common experience in this country, stop a person from travelling? \nSo, what is important is to increase public awareness about the danger of earthquake or about any kind of disaster including fires, floods, storms or tsunamis. But the worst public enemies are fearmongers who use the social media to spread fake reports and pictures of deaths and devastations that did never happen. \nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Peddlers of fear on  social media",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/peddlers-of-fear-on-social-media-1763917528",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       November 24, 2025 00:00:00  \nThe arrest of a journalist and a cell phone trader at midnight, Wednesday and small hours of the same night from their residences by the Detective Branch (DB) police brings back the ugly memory of similar infringements during the immediate past regime. The raid is both a violation of human rights and an infringement on the right to privacy. When people started thinking that the untimely raid of homes of journalists, political leaders of the opposition camps, activists or any citizen is a thing of the past, the culture of police/executive overreach shows no sign of ceasing to be. \nIn this case, the journalist was picked up at around 12 pm and the trader at 0.3 am from their homes. Even false cases filed against journalists are reported from time to time. Attacks and killings of reporters are not uncommon in this country. Powerful quarters make journalists a target when their illegal and anti-social activities are exposed by the media. Journalism as a profession is facing serious challenges because of the elements inimical to the country's interests. But when the security and law enforcement agencies themselves abuse their power to harass, humiliate or abduct innocent people for their involuntary disappearance, a kind of Orwellian regime overshadows the rule of law and fear psychosis pervades society at large. The immediate past regime was quite infamous for this state-sponsored criminality. \nNow the important point here is, why should this foreboding sense of fear return to a country that has rejected this barbaric practice of demonic order through an uprising? There is no reason to think that the DB team that carried out the nightly invasion did so on their own. Someone superior ordered them to carry out the illegal operation. On his release from the DB custody the next morning, the journalist hinted at an adviser in the Muhammad Yunus cabinet. This is indeed a serious charge and it deserves an independent probe so that the man behind the machination is identified and punished according to the law of the land. \nIf the adage that power corrupts and absolute power corrupts absolutely is applicable to an authoritarian rule, an interim government should be miles away from any show of power. The police have suffered a trauma and were expected to learn a lesson from the setback. Even if it is assumed that old habits die hard, the police hierarchy should think twice before they raid a journalist's residence without a warrant. \nThe victim has pointed accusing fingers at an adviser. This should not be taken lightly because no adviser is vested with such outrageous power. Well, the adviser has denied his/her involvement in the matter. Now that the issue has become contentious and the DB has claimed that the whole episode is a matter of a misunderstanding, it needs clarification. This argument, however, is flimsy. As a security force, it knows well enough that the naïve argument does not make the matter transparent. Such misadventure either exposes their high-handedness or naivety. The truth in this matter must prevail. In the interest of justice and professional integrity of the parties concerned, a judicial probe has to be instituted in order to indentify who are responsible for the arrests. Notably, the journalist was allowed to return home after 10 hours but not the cell-phone trader. \nEvery individual's human rights are inviolable and sacrosanct. Unless one commits a crime or is suspected to have done so, the security forces have no right to infringe on those rights. The row over a scheduled press conference of the mobile business community of Bangladesh (MBCB) on national equipment identification registrar (NEIR) allegedly led to the arrest of the journalist and the trader. Serving some coterie interests as against free trade was the contentious issue, the journalist complains. The purpose was to stop the press conference scheduled to be held at the office of the Dhaka Reporters Unity (DRU), he adds. \nIf the complaint is substantial, these arrests are not a result of the mistaken identity nor a case of misunderstanding. A thorough probe will reveal the truth. Those who orchestrated the move against the journalist and the trader must be identified and awarded the punishment they deserve for subjecting the victims to harassment and humiliation. This has to be done in the interest of fairness and justice. No journalist should be victimised thus in the future. \nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Arrest of a journalist is no  case of misunderstanding",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/arrest-of-a-journalist-is-no-case-of-misunderstanding-1763917561",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 24, 2025 00:00:00  \n\nThe preparation of Bangladesh's national budget is exposing a structural weakness: non-discretionary liabilities are gradually displacing the vital resources for development, posing a significant challenge to attaining rapid and sustainable growth. Operating expenses and interest payments on both domestic and international debt now account for a sizable amount of the annual budget. Although managing this debt is inevitable, the enormous amount needed for these purposes --- typically one of the largest in the budget --- severely limits the amount of money available for important discretionary investments in the Annual Development Programme (ADP). Because of this structural rigidity, rather than austerity in operating expenses, any new economic shock or revenue deficit directly results in cuts to development programmes. \nThe appalling execution of the ADP is a clear indication of the repercussions. According to recent sources, the last fiscal year's ADP implementation fell to a record low of 67.85 per cent, the lowest in 20 years. This underutilisation of allotted development funds is an economic paralysis rather than merely an administrative error. The country suffers losses on two fronts when investing in important initiatives in areas like health and education: first, the immediate costs of project delays and cost overruns, and second, the depletion of human capital and long-term productive capability. \nRadical revenue reform must take precedence over expenditure management in order to address this. The government is forced to rely significantly on borrowing due to the ongoing substantial shortfall in NBR revenue collection, which frequently misses targets by enormous margins. This creates a negative feedback cycle that further increases the burden of interest payments. Expanding the revenue base and enforcing tax compliance through extensive institutional and digital transformation is the only viable course of action. The government can finally recapture the fiscal space required to finance important development initiatives and ensure a resilient economic future by obtaining a higher, stable, and predictable revenue stream.\nSuraiya Fahmida Twinkle\nBachelor of Business Administration\nNorth South University \nsuraiya.twinkle@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Budgetary constraints stifling development",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/budgetary-constraints-stifling-development-1763917584",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-11-2025"
    }
]