[
    {
        "full_article": "After a 12-day intense missile barrage and air attacks following Israel’s illegal aerial attacks on Iran, the two countries finally announced a ceasefire on Tuesday (June 24, 2025). Ostensibly conducted as a “pre-emptive” strike on Iran’s nuclear facilities, the Israeli attacks graduated into a full-fledged war that also involved U.S. strikes on Iranian nuclear installations. These attacks, in blithely ignoring the dangers of radioactive leakage, and their subsequent responses, point to the stark nature of a fragile international order now threatened by escalating nuclear risks from West Asia to Ukraine and even the Indian subcontinent. The attacks on Iran might have damaged its nuclear installations and, in particular, its uranium enrichment capabilities. Yet, this naked aggression was against a signatory to the Nuclear Non-Proliferation Treaty (NPT) and a country that had willingly subjected its facilities to international scrutiny. Iran had also signed the Joint Comprehensive Plan of Action with the P5+1 (nuclear-armed states plus Germany) to ensure that its nuclear capabilities remained peaceful, only for it to be rendered meaningless after the U.S. withdrew from it during President Donald Trump’s first term. These attacks now create a new dynamic, wherein Iran is compelled to seek nuclear weapons by withdrawing from its commitments — its parliament is now mulling a bill to exit the NPT — and use them as a deterrent. Meanwhile, any step Iran takes to do so could be used to justify further aggression by Israel and the U.S., thereby rejecting international laws and the NPT’s nonproliferation norm.Israel’s hypocrisy is stark. It remains a non-signatory to the NPT and refuses any oversight of its undeclared, but known, arsenal. This raises the possibility that it values nuclear weapons not for deterrence but for their destructive potential. U.S. protection emboldens it to pursue destructive policies in Gaza and illegal wars in West Asia. Combined with the Russian threat to use nuclear weapons to deter conventional aggression by NATO following its Ukraine invasion, these actions reveal how the renewed “competition among the great powers” and their cynical understanding of deterrence are dismantling global stability. The idea of nuclear disarmament is in tatters as the nuclear-weapon states continue to expand and modernise their arsenals, while non-proliferation is under threat as other countries turn to nuclear weapons to safeguard themselves. Without a renewed diplomatic impetus to re-establish international norms on conflict, a stronger push for disarmament among all nuclear-armed states, and a firm commitment to uphold the NPT, the world risks sliding into a new era of nuclear brinkmanship that could prove more dangerous than the Cold War’s darkest moments. Published - June 25, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Iran\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        nuclear power\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Ukraine\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        NATO\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis",
        "headline_1": "​Nuclear spectre: On the risk of an era of nuclear brinkmanship",
        "headline_2": "Israeli and U.S. actions against Iran amount to nuclear brinkmanship",
        "link": "https://www.thehindu.com/opinion/editorial/nuclear-spectre-on-the-risk-of-an-era-of-nuclear-brinkmanship/article69732902.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "25-06-2025"
    },
    {
        "full_article": "The first African and the first woman head of the largest, most powerful sporting organisation on the planet, Kirsty Coventry, 41, broke new ground in more ways than one when she formally took charge of the International Olympic Committee (IOC) on Monday (June 23, 2025). Also the youngest president since Pierre de Coubertin, the founding father of the modern Olympic Games, and hand-picked by outgoing IOC president Thomas Bach, Kirsty was largely seen as a symbol of continuity with Bach, now IOC honorary president for life, remaining the power centre. But in the last three months since her election, the handover period, those working with her at the IOC headquarters in Lausanne shared the belief that she was her own person. While there is likely to be continuity in some areas, Kirsty’s experiences, as a white woman athlete in racially tense Zimbabwe under Robert Mugabe and a Minister in Emmerson Mnangagwa’s cabinet, indicate that she is likely to be a lot more consensual and humane when compared to the strict Bach. It means that she is unlikely to rush into decisions on complex issues be it protecting female athletes, transgenders in women’s sports, the scourge of doping, the relevance of the Olympic movement, attracting new sponsors and maintaining a balance between traditional competitive sports and experimenting to bring in new audiences, something that has not always worked, as evident with breakdancing in Paris.Off the field, it will be an eventful eight years for one of Africa’s most decorated Olympians. There will be big decisions to make including the possible return of Russia to the Olympic fold. In the run-up to the 2028 Olympics in Los Angeles, she will have to deal with U.S. President Donald Trump a lot more. The political uncertainties and global conflicts will force her to do a lot more than administering only world sports. The Russia-Ukraine war and growing hostilities in West Asia could have a bearing on the hosting rights for the 2036 Olympics, something that also brings Indian interests into the equation. On Monday, IOC member Nita Ambani was among the closest allies of Kirsty during and after the formal ceremony. A two-day closed-door session with IOC members to exchange ideas and opinions will be crucial to gauge initial impressions. The political situation, in the immediate context, may also have a bearing on the possible bids by Qatar and Saudi Arabia, two countries with deeper pockets than any and with growing interest to host the Games. With little experience in navigating the complex administrative labyrinth of world sports, Kirsty would be hoping to make a splash with her dive into the deep end. Published - June 25, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Olympics\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        transgender\n                    \n                            /                      \n                        \n                        narcotics & drug trafficking\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Qatar\n                    \n                            /                      \n                        \n                        Saudi Arabia",
        "headline_1": "Woman at the helm: On the new IOC president Kirsty Coventry",
        "headline_2": "The new IOC president will have to navigate the labyrinth of world sports",
        "link": "https://www.thehindu.com/opinion/editorial/woman-at-the-helm-on-the-new-ioc-president-kirsty-coventry/article69732177.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "25-06-2025"
    },
    {
        "full_article": "Did you know killer whales — also called orcas — might be using kelp (a type of seaweed) like a loofah to scrub and clean each other? That’s right! Scientists just discovered something amazing: orcas have been seen making grooming tools out of kelp to help each other feel clean and calm. This is the first time ever that a sea mammal has been seen using something as a tool — like how we use a brush or sponge!\nThe scientists call it “allokelping.” It’s like a whale spa day under the sea.\nBut this discovery is about more than just orcas liking to get scrubbed. It shows how little we actually know about animals. Orcas are super smart. They rub each other not just with kelp but with their fins and bodies too — kind of like a big underwater hug. Scientists think this helps them build friendships and feel less stressed. Just like how a hug or a pat on the back can make you feel better!\nWhat’s really surprising is how shocked humans are every time we learn something new about animals. A scientist named Karen Bakker says that’s because people often think “if we can’t hear it or see it, it must not be happening.” For example, for a long time, we thought whales didn’t “talk” because we couldn’t hear them. But now, thanks to better technology, we know orcas have special ways of talking, even different “languages” in different family groups!\nThere’s even talk that AI (artificial intelligence) might help us understand what animals are saying. Imagine a computer that could translate dolphin-speak or bird songs into human language! If we could really hear and understand animals, maybe we’d treat them better and stop hurting or killing so many of them.\nSo next time you see a whale or a dolphin, remember — they might be chatting with their friends, giving each other a seaweed scrub, and living lives just as interesting as ours.\n\n",
        "headline_1": "Whale of a Story",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/whale-of-a-story/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-06-2025"
    },
    {
        "full_article": "Some people think that having nuclear bombs can protect a country from being attacked. But real-life events show that having a strong economy and a good regular army might actually be more helpful in a war.\nRecently, there was fighting between Israel and Iran. Both sides said the other had attacked. The United States also got involved and bombed places in Iran where it believed nuclear work was going on. Iran says its nuclear program is peaceful, even though in 2023, scientists found uranium that was almost as pure as what was used in the nuclear bomb dropped on Hiroshima in World War II. Iran said this was just an accident or someone trying to make them look bad.\nLet’s say Israel and the U.S. are right, and Iran really is trying to build a nuclear bomb. Why would they want one? Probably to scare other countries so they won’t attack Iran — that’s called “nuclear deterrence.” Many countries like the U.S., Russia, China, India, and North Korea already have nuclear weapons, and the idea has been popular for 80 years.\nBut here’s the thing: a study of 348 fights over land between countries showed that having nuclear weapons didn’t actually help. A professor named David Barash even wrote that the U.S., even with all its nuclear weapons, couldn’t stop revolutions or wars in places like China, Cuba, Vietnam, Iraq, and Afghanistan. Russia (which used to be part of the Soviet Union) had the same problem in Afghanistan.\nEven during the Cold War — when the U.S. and the Soviet Union didn’t trust each other and both had tons of nukes — they never actually fought a war. So maybe nuclear weapons weren’t what kept the peace.\nToday, bombs and missiles are so smart and accurate that they could destroy a country’s nukes before they even launch. So, having nukes may not be such great protection after all.\nIran, whether it was building bombs or not, has suffered a lot. It’s under heavy sanctions — meaning other countries don’t trade with it much — so its economy has stayed weak. In 1979, Iran and Saudi Arabia were at the same economic level. Now, Iran’s economy is only about 40% the size of Saudi Arabia’s. Also, in this short war, Iran’s weak air force and defenses made a big difference.\nIn the end, while some leaders chase nuclear weapons hoping to stay safe, it looks like having a strong economy and good military might be a smarter choice.\n\n",
        "headline_1": "The Truth About Nuclear Bombs",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/the-truth-about-nuclear-bombs/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-06-2025"
    },
    {
        "full_article": "With its summer weather taken from other places, Britain blows hot and cold \n It is the end of June and it has to be hot in Gurgaon, where I live. The problem is that I’m not in Gurgaon, but in London, and the temperature today is going to be 34°C, making it hotter than Gurgaon with its pre-monsoon showers.\nBritain has long been in climate change denial of its own climate. It persists in thinking of itself as a cold country. And it is a cold country for most of the year.\nBut then, all of a sudden, the sun will burst through the grey skies, temperatures will soar, and the tabloid headlines will go into a frenzy about how it’s going to be hotter than Spain, and the south of France, and Sicily.\nAnd the nanny state will exhort people to carry water with them, and get off the bus, or the Tube if they feel faint, and everyone who’s been moaning and grumbling about the wet and cold, will now moan and grumble about the horrid heat.\nIt happens every year, regular as a Swiss clock. But by common consensus, Britain believes itself to be a cold country or at least a temperate one. Hot? No fear, not us. We don’t do heat.\nSo when the heat wave does strike, everyone’s caught unprepared. Homes don’t have ceiling fans. Bars, restaurants, and most public transport lack air conditioning. And people get bowled over as much by astonishment as by the heat, like ninepins in a game of skittles.\nBritain’s denial of being a hot country, even temporarily, is both understandable and factually correct. Britain is not a hot country; the extreme heat waves it regularly endures are all borrowed from foreign shores.\nWhat the weather reports describe as a ‘plume of hot air’ will come whooshing in from North Africa, or some such outlandish place, and smite the country with sunstroke.\nBritain’s borrowed heat from distant climes is analogous to the wealth it euphemistically borrowed in a fit of absent-mindedness from its former colonies and forgot to return. British heat? ’Course not. It’s only borrowed. Like the Kohinoor.\n\n",
        "headline_1": "Britain on the boil",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/britain-on-the-boil/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-06-2025"
    },
    {
        "full_article": "New research on orcas points to an old human error: we assume what we can’t perceive doesn’t exist\nDo you loofah? It’s an efficient delivery of cleaning, soothing, shining pleasures to your skin. Turns out orcas, aka killer whales, the largest members of the dolphin family, are also really into it. The current issue of Current Biology reports observations where orcas were seen to refashion kelp to exfoliate each other. This is the first recorded instance of ‘allokelping’. Actually, it is the first recorded instance of any marine mammal making a tool out of some object, let alone a grooming tool. How little we know about all the other species that cohabit earth with us, never mind how much we hurt them.\nScientists are finding things out bit by slow bit. In orcas, besides allogrooming, they have observed other rubbing behaviours. The hypothesis is that just as touch helps build relationships and moderate stress among humans, so it is when orcas rub each other with their bodies and fins – and the kelp enhances this experience. But what’s really revealing is that every such scientific discovery feels like a big surprise. That’s about how hubristic humans are. As conservationist Karen Bakker says, we tend to believe that what we cannot perceive does not exist. Until a wave of new projects and tech started revealing orcas’ complex vocalisations and pod-specific dialects, we assumed whales weren’t talking to each other, because we weren’t hearing them.\nEven the fierce debate about AI ignores how it might transform our relationship to the non-human world. Right now we can see a mother orca and child orca grooming each other and talking to each other. What Bakker wonders is whether AI could help ‘decode’ what they are actually saying to each other. Maybe if we ‘heard’ animals better, we would extinct them less. Imagine if it was technology that finally got us to understand that animals speak, and live, meaningfully.\n\n",
        "headline_1": "Whale Of A Story",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/whale-of-a-story-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-06-2025"
    },
    {
        "full_article": "There is no denying that Israel, having started the war based on a false claim that Iran was on the verge of acquiring nuclear weapons, bears primary responsibility for ending it. Not only did it impose the war unilaterally, but it also manipulated the US into joining it. What followed then—with US bombers dropping 30,000-pound bunker-buster bombs on three Iranian nuclear facilities, and Iran responding by threatening to close the Strait of Hormuz and carrying out strikes on a US military base—had the world sitting on the edge of its seat. The dramatic announcement of a ceasefire early Tuesday only underscored how dangerously close the world came to a wider, multi-front, and far more impactful war.\nDonald Trump, despite having lost any credibility to be a moral voice in this crisis, has urged both sides not to violate the truce. Well, both sides certainly cannot be held to the same standards of responsibility. Still, given the deaths, destruction, and disruptions the war has already caused, we do hope both will exercise the restraint now expected of them. Israel, with a perpetually battle-ready leadership, may be on the lookout for any excuse, real or manufactured, to derail the peace effort. Early signs show how fragile it can be. Soon after the ceasefire announcement, Israel's military accused Iran of breaking the truce by launching two ballistic missiles—an allegation the latter denied. But the Zionist state still vowed to retaliate.\nSo, while we welcome the ceasefire initiative that both sides had agreed to, we must acknowledge the persistent lack of trust and goodwill that may undermine any chance of peace. We don't need to remind anyone of the wider risks and costs associated with the war, not just in the countries it is being fought. Since June 13, Israeli attacks killed 606 people and wounded 5,332 in Iran as of Monday. Israel had far fewer but still significant losses.\nBut as we have noted in these columns before, the war has already left a trail of uncertainty across the global oil markets and supply chains which, should armed hostilities persist, would continue to ripple far beyond the Middle East, reaching even Bangladesh. Bangladesh's energy sector may come under significant threat if the war escalates and Iran follows through on its threat to block the Strait of Hormuz. Already, our LPG shipments have been reported to be stalled. Most developing countries will be similarly affected if the war continues.\nThere is no alternative to a permanent ceasefire then. This unjust war that two hegemonistic, nuclear-armed states have imposed on a non-nuclear Iran must stop, and civilians and the world in general must be shielded from its effects. The onus lies on Israel, and its enablers, to ensure the ceasefire remains firmly in place.\n",
        "headline_1": "A strong Israel-Iran ceasefire is the only way forward",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/strong-israel-iran-ceasefire-the-only-way-forward-3924596",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-06-2025"
    },
    {
        "full_article": "In recent years, climate anxiety has taken over many Western governments and most international organisations. The result has been ruinous policies that help little but undermine future prosperity needed to deal with a host of other problems. Fortunately, Bangladesh can avoid repeating their mistakes.\nClimate change is a man-made problem, but campaigners and irresponsible politicians have blown this out of proportion and call it an existential threat that could eradicate humanity. No further action on climate will result in a problem, but it would not be the end of the world.\nThe incessant scare stories have driven some Western governments to enact immensely costly policies. The UK has gone further in climate policies over the past two decades than nearly any other country. As a result, the inflation-adjusted electricity price, weighted across households and industry, has increased significantly from 2003 to 2023. By comparison, the US electricity price has remained almost unchanged over the same period.\nAt the same time, the rich world is increasingly realising that it faces many other expensive challenges, including an ageing population bringing higher pension and healthcare costs, crumbling infrastructure, poor educational outcomes and a need for larger defence spending. Yet the EU has committed itself to climate goals which will cost it severely.\nBangladesh should not repeat the mistakes made by Western countries by diving headlong into ineffective climate policies. It has a record of huge achievements, vast potential, and—like every other country—a myriad of complex challenges. Bangladesh must get the balance right between the challenges and opportunities in front of it.  A considered, balanced response to climate change means rolling out solar and wind in the areas where that is sensible, while realising that the longer-term solution to climate change must be innovation.\nIn 1970, when hunger stalked the developing world, the answer was not to make the whole world eat less to redistribute food. Innovation through the Green Revolution dramatically increased yields and brought better varieties and more fertiliser. Likewise, we will not solve climate change by being poorer, colder and with less power. Instead, the leading industrial nations that are responsible for the majority of carbon emissions need to ramp up innovation in future generations of low-carbon energy. Once they innovate clean energy to be cheaper than fossil fuels, everyone will be able to switch.\nAdaptation is another vital climate change response. Farmers across Bangladesh know this already: they adapt to suit changes in the climate. In cities, we know that adaptive infrastructure like green areas, more reflective surfaces, and water features helps keep temperatures cooler. Adaptation can avoid a large part of the climate problem.\nFinally, poverty alleviation is a crucial part of the response to climate change. Lifting people out of poverty reduces their vulnerability to climate shocks like heat waves or hurricanes. Moreover, wealthier, more prosperous societies can afford better protection from the elements, along with better nutrition, healthcare and social protection. Wealthy countries can spend more on environmental protection, and all other good things.\nBeing smart about climate change also means that governments will have more resources to invest in solving other important challenges.\nOne such investment: we should boost maternal and newborn health through a simple package of basic emergency obstetric care and more family planning. Globally, this could save the lives of many mothers and newborns every year. Another phenomenal investment: agricultural research and development to help Bangladesh's farmers become more efficient.\nBangladesh has immense possibilities if it can seize the opportunity to invest wisely and judiciously. It should avoid the singular climate focus of some Western countries and invest based on rigorous economic science in areas where it can make the most impact and the greatest progress.\nBjorn Lomborg is president of the Copenhagen Consensus, visiting fellow at Stanford University's Hoover Institution, and author of False Alarm and Best Things First.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Bangladesh should not follow the West's example on climate change",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/bangladesh-should-not-follow-the-wests-example-climate-change-3924486",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-06-2025"
    },
    {
        "full_article": "When the position of vice-chancellor falls vacant at a public university in Bangladesh, it is often followed by a flurry of lobbying among faculty members eager to secure the role. This jostling reaches a fever pitch when the vacancy is at Dhaka University, a post laden with prestige, access to administrative power, and, for some, a shortcut to wealth and influence.\nYet in this scramble, rare figures stand apart—those who resist the lure of power to preserve their principles. Professor Emeritus Serajul Islam Choudhury is one such figure. He famously declined the post of vice-chancellor at Dhaka University, choosing instead to remain independent, continue his scholarly work, and uphold the respect he had earned through decades of teaching and writing.\nFor years, concerns have been raised about university teachers drifting away from their central duty—teaching. Absenteeism and a lack of classroom commitment are frequently cited. But once again, Choudhury is the exception.\nAt the Department of English in Dhaka University, where he taught for decades, students seldom questioned his dedication. His commitment was perhaps most poignantly displayed on the day of his greatest personal loss, when he showed up to teach on the very morning his wife passed away.\nIn a 2017 tribute, one of his former students, Abu Jar M Akkas, now deputy editor at daily New Age, wrote: \"One incident in his life caused a stir among us when we were his students. The day his wife, Najma Jesmin Choudhury, whom he married in 1962, died of cancer in 1989, he went to take the class scheduled for that morning; we mustered up the courage to send him back home.\"\nAkkas had interviewed Choudhury a decade earlier, in 2007, and asked him why he had come to class that day. Choudhury replied: \"Duty has always been important to me…I knew my wife was being treated and there were people around her to look after. I also needed to discharge my duty.\"\nIn recent decades, many academics and intellectuals in Bangladesh have aligned themselves with political factions, sometimes choosing silence over truth in the face of misrule from their preferred quarters. Choudhury, however, remained an unflinching voice of dissent and clarity.\nHe consistently spoke out against environmental degradation and cultural erosion, even when doing so drew lawsuits and hostility. He was a prominent voice in protests against the cutting of trees at Osmani Udyan in 1998, commercial construction at the Lalon Shah shrine compound in 2000, and the proposed airport project at Arial Beel in 2011, which threatened fertile agricultural land. A legal case related to the Arial Beel protest still remains pending.\nIn October 2022, yet another complaint was filed against him in a Chattogram court, accusing Choudhury and two others of defaming Bangabandhu Sheikh Mujibur Rahman in an article. The case stemmed from an essay titled Sheikh Mujiber Gopon Shatru (\"The Hidden Enemy of Sheikh Mujib\"), published by Chattogram Academy the previous year. Amid public backlash, the case was eventually withdrawn.\nThat unwavering sense of duty has defined his life, whether teaching in classrooms, writing with fierce clarity, or standing beside the oppressed in public struggles. He took part in movements and raised his voice against social injustice.\nFor any educator, true pride lies not in titles or awards, but in the legacy carried forward by their students. In this regard, Choudhury—affectionately known as SIC among his pupils—can rest assured that he has shaped generations of thinkers and doers.\nDr Azfar Hussain, professor of Interdisciplinary Studies and director of the Graduate Programme in Social Innovation at Grand Valley State University in Michigan, wrote on June 23: \"A direct teacher of mine in the English Department at Dhaka University, Choudhury shaped my intellectual formation in more ways than I can count.\" \"But beyond the personal, he continues to serve as a committed thinker and writer rooted in the people's struggles, offering a steady stream of critical interventions across literature, culture, history, and politics, all while persistently aligning himself with those cast to the margins—peasants, workers, women, indigenous communities, and the oppressed in all their forms,\" Azfar went on to say.\nProfessor Serajul Islam Choudhury, one of Bangladesh's most enduring public intellectuals, turned 90 on June 23. The occasion calls not just for celebration, but also for reflection, emulation, and a renewed commitment to upholding his legacy, at a time when so many voices have faded in the face of authority.\nWe salute not just a man of letters, but a man of conviction—whose classroom extended beyond the university gates into the broader struggles of a nation still seeking dignity and equity.\nHappy 90th birthday, sir. May your light continue to guide us.\nMohiuddin Alamgir is a journalist at The Daily Star.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "The unmatched legacy of Professor Serajul Islam Choudhury",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-unmatched-legacy-professor-serajul-islam-choudhury-3924421",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-06-2025"
    },
    {
        "full_article": "We are concerned to learn of the findings of the latest survey by Bangladesh Bureau of Statistics (BBS) that paints a troubling picture of public service delivery in the country. The survey period covered both the tail end of the now-ousted Awami League regime and the first few months of the interim government, thus requiring its findings to be read with nuance. But the fact that 31.67 percent of respondents, or nearly one in three, reported having to pay bribes for essential services is a stark reminder of how entrenched corruption remains. The massive sample size—with 84,807 respondents from 45,888 households interviewed—also makes the data a fair representation of the experience of ordinary citizens. Although by now we would have appreciated a survey exclusively focused on the interim period, what has emerged still makes a case for why we should worry.\nFor that, we just need to look at some of the details. For instance, according to the BBS data, the worst offender among public service agencies was the Bangladesh Road Transport Authority (BRTA), where 63.29 percent of citizens reported being forced to pay bribes, followed closely by law enforcement agencies (61.94 percent), the Department of Immigration and Passports (57.45 percent), and the Directorate of Registration (54.92 percent). These institutions have long been synonymous with corruption, and the latest data suggests that the situation has not improved significantly despite the change in government. Another sector with a notable incidence of corruption is education where, as noted by the planning adviser at the BBS ceremony, the bribery rate for transfers is very high.\nThese findings more or less align that of other reports on corruption in Bangladesh. We may recall a December 2024 assessment of the Transparency International Bangladesh (TIB)—based on six household surveys conducted between 2010 and 2023—that an estimated Tk 1.46 lakh crore was paid in bribes for services during the rule of Awami League. According to the most recent of those surveys, covering the period between May 2023 and April 2024, some 70.9 percent of respondents had collectively paid Tk 10,902 crore in bribes while seeking services. It is no surprise that the same institutions flagged by TIB as most corruption-prone have also been named by BBS. Clearly, things have changed little.\nThe level of access and affordability in public services may have improved of late, but the quality and timeliness of service delivery still leave much to be desired. Just over half of the BBS survey respondents have expressed satisfaction with how long services take to process. While the interim government has taken some notable steps in recent weeks, such as replacing the BRTA chairman and conducting anti-corruption raids at BRTA offices, these actions are not enough to curb corruption unless systemic reforms are undertaken to support full automation of services, elimination of middlemen, de-politicisation, and rigorous trials and punishment of corrupt officials. Corruption must be confronted not with token measures but with genuine political will and long-overdue institutional changes.\n",
        "headline_1": "Governments come and go, but bribery stays on",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/governments-come-and-go-bribery-stays-3922636",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 25, 2025 00:00:00  \nIn about every instance of the government's attempt at increasing revenue income from businesses, the burden ultimately falls on the common consumers. The general public, the overwhelming majority of whom are people in the low and middle income bracket, are law-abiding citizens and hence not willing to fall afoul of the law. But that is hardly the case with some business entities which are prone to evade tax and pass the buck to the general consumers. Some 152 items, majority of which belonging to the category of essential commodities such as rice, wheat, edible oils, etc., according to a report published in this paper on June 23, are going to see a price hike with the budget for FY 2025-26 taking effect from July 1 next. \nThe general consumer will have to spend extra money because the revenue authority will impose Advance Income Tax (AIT) at 2.0 per cent rate at the import stage of many of those commodities. Notably, the items under consideration are exempted from such kind of taxes in the current budget (for FY2024-25). Essentially, the measure aims to gradually phase out exemptions from the tax regime and enhance tax compliance among all the members of the business community and at the same time boost the government's revenue earning. AIT is expected to bring the usual tax-dodgers under the tax net, because they would like to be reimbursed against AIT paid before. Whether such hope of the revenue department would be finally realised remains to be seen. \nThe tax authority's target is, as could be gathered, to increase revenue collection by around Tk20 billion. But the sectors' targeted for such exemption phase-out include critical raw materials for the country's garment sector such as cotton and manmade fibres. The essential food items include potato, onion, lentil, chickpea, soybean, maize and so on. Also, fertilisers, crude edible oil, sugar, various medical implements, computers, printers, even aircraft and buses will be affected by the new tax regime. It is worthwhile to note that each of the mentioned items to be brought under the phase-out programme is going to affect common consumers. But how is the exemption phase-out measure by the revenue authority affect the average taxpaying citizens? In the case of essential commodities, for instance, traders who import those essential items would avoid submission of tax returns. In consequence, they won't get the opportunity to be reimbursed by the tax authority against AIT they were supposed to pay at the beginning. But to make up for the loss, the only option before them will be to punish the general consumers by hiking up commodity prices. Price hike of essential commodities means a concomitant rise in inflation rate, though the Bangladesh Bank expects that the inflation will remain within the range of 7.0 to 8.0 per cent. But once the impact of AIT on the previously tax-exempted items start to affect the commodities market by pushing up prices, the projection that the inflation rate would at a point decline to 5.0 per cent by the end 2025 may not materialise. \nSo, any fall in prices of commodities and energy in the next fiscal may turn out to be a pipe dream. Such pessimism is not entirely attributable to the developments at home. Bangladesh being highly dependent on the external markets for its imports as well as exports, any instability in the international market is going to affect not only the economy, but also life in general here. Any disruptions in the energy supply chain arising, for instance, from the ongoing Middle-Eastern conflicts would spell disaster locally. The government's policies ought to be geared to making life easier for common people by reducing additional tax or any other forms of burden.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Reducing impacts of indirect tax on public",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/reducing-impacts-of-indirect-tax-on-public-1750778861",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       June 25, 2025 00:00:00  \n\nThere is growing concern about the likely scarcity of foreign funding for non-green development projects in the immediate future. Reports from various sources, including leading multinational financiers, confirm a marked shift in the global project funding landscape, prompted by international treaties aimed at mitigating the impacts of climate change. Foreign funding -- a crucial driver of development in countries like Bangladesh -- is now aligning more closely with climate commitments under agreements such as the Paris Accord.\nKey institutions such as the Asian Development Bank (ADB), the World Bank Group (WBG), and the European Investment Bank (EIB) have already pledged to follow the 'Direct Investment Lending Operation' (DILO) framework consistent with the Paris Agreement. This commitment signals a definitive preference for investments that are environmentally sustainable, pushing countries to restructure their development strategies around green objectives.\nInfrastructure specialists warn that financing for coal, oil, and other fossil-fuel-based projects may soon disappear altogether. Although Bangladesh is not a significant emitter of greenhouse gases (GHGs), it nonetheless faces pressure to decarbonise its economy. This entails adopting expensive technologies like carbon capture and storage -- an investment challenge for a developing country. Multilateral lenders are reportedly maintaining updated lists of activities they consider compatible or incompatible with a low-carbon trajectory. As a result, any project that does not prioritise emissions reduction or energy efficiency will likely find it difficult to secure international financing.\nThis raises an urgent question: what does this new financing climate mean for Bangladesh's development ambitions? Fully grasping the implications of the Paris Agreement's guidelines on foreign investment will take time. Bangladesh, despite contributing minimally to global emissions, is among the most vulnerable countries to climate change. Recognising this, the government has already laid out emission reduction targets across multiple sectors, signalling a proactive stance towards transitioning to a low-carbon economy.\nAccording to Bangladesh's revised Nationally Determined Contributions (NDCs), submitted in August 2021, the country intends to cut GHG emissions by 27.56 million tonnes of carbon dioxide by 2030 through unconditional measures, with an additional 61.9 million tonnes to be reduced conditionally -- subject to foreign support. Realising these ambitious targets requires an estimated $175 billion in investment. More broadly, Bangladesh needs roughly $10 billion annually to finance development initiatives in energy, transport, urban infrastructure and more.\nLocal experts stress that decarbonisation and emission reduction must now be embedded in the core of all development planning. For instance, projects in the energy and manufacturing sectors should now aim for greater reliance on renewable energy, efficient hydropower systems, and modern heating and cooling technologies that minimise GHG emissions.\nThe DILO framework under the Paris Agreement outlines a list of eligible activities aligned with climate mitigation goals. These include water supply and sanitation, sustainable construction, information technology and environmental research. Conversely, funding is now explicitly restricted to projects involving thermal coal mining and coal-based power generation. The Paris Agreement, adopted in 2016, set a global goal of limiting average temperature rise to well below 2°c -- and ideally to 1.5°c -- above pre-industrial levels.\nBangladesh's Planning Commission and other government bodies reportedly view this shift in funding priorities positively. They believe it will drive better alignment between development projects and sustainable environmental goals. Future project design and approval will likely incorporate more rigorous environmental screening and compliance requirements. However, while the intentions behind these changes are positive, their implementation poses practical challenges. Multilateral financiers have expressed willingness to continue supporting Bangladesh, but their decisions will increasingly depend on whether proposed projects demonstrate measurable contributions to climate goals. This means that future proposals must be underpinned by robust environmental assessments, carbon impact studies, and clear mitigation strategies.\nEnsuring access to foreign funding under these stricter guidelines calls for meticulous planning. Incorporating energy transition measures -- such as replacing fossil fuels with renewable energy -- in development projects will not only make them more fundable but also help address the long-term challenge of climate change.\nAdmittedly, the shift towards green development may slow or complicate certain traditional growth strategies. Yet, it also presents an opportunity, a chance for Bangladesh to build its development trajectory on sustainable, environmentally responsible foundations. But to do this effectively, the country will require significant capacity building in institutions, workforce skills, and technical knowledge.\nTransitioning to green energy and low-carbon infrastructure demands extensive investment in research and innovation. Bangladesh must also upgrade its technical training and education systems to equip the workforce for new jobs in the renewable energy and clean technology sectors.\nThe shift will have socio-economic ramifications. Industries heavily dependent on fossil fuels may face disruption, potentially causing job losses or economic dislocation. Policymakers must, therefore, design inclusive transition strategies to cushion vulnerable communities and sectors. Social protection, retraining programmes and job creation in green sectors will be crucial components of a just transition.\nAt the same time, investing in green infrastructure can bring multiple benefits. Reduced reliance on imported fossil fuels will enhance energy security and insulate the economy from global price shocks. Cleaner air, lower pollution levels, and improved public health outcomes are additional dividends of a green transition. This makes the environmental imperative a public health and economic priority as well.\nMoreover, the emphasis on sustainable projects can spur innovation and entrepreneurship. Sectors such as renewable energy, sustainable agriculture, and eco-tourism could experience rapid growth. Bangladesh's natural resources, biodiversity and geographical location have considerable potential for green economic initiatives -- provided they are well managed and supported.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Decarbonisation is prerequisite for foreign funding",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/decarbonisation-is-prerequisite-for-foreign-funding-1750778940",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 25, 2025 00:00:00  \n\n\"Don't put all your eggs in one basket\" - this timeless advice has never been more relevant for Bangladesh as it prepares to graduate from Least Developed Country (LDC) status. While the ready-made garments (RMG) sector has long been the backbone of our export economy, contributing more than 80 per cent of total export earnings, such dependence on a single product line leaves the economy highly vulnerable to external shocks, shifting global demands and sector-specific disruptions.\nThe 2021 UNCTAD report rightly notes that \"a diversified export base is the best insurance policy against external shocks.\" As global markets evolve and competition intensifies, Bangladesh must embrace export diversification not as an option, but as a strategic necessity. Expanding such sectors as pharmaceuticals, information and communication technology (ICT), agro-processing, shipbuilding, and leather can create new revenue streams, generate skilled employment, and strengthen our global trade position.\nMoreover, diversification will be crucial in offsetting potential challenges of post-LDC graduation, including the eventual loss of preferential trade facilities. A broader export base would allow Bangladesh to adapt more swiftly to global market fluctuations and changing trade policies. However, this transition demands proactive policy support, improved infrastructure, investment in innovation, and targeted incentives for emerging sectors.\nIf approached with commitment and long-term planning, export diversification could serve as a transformative tactic to ensure resilience, economic stability and sustainable growth. Otherwise, our aspirations for a robust and inclusive economy may fall short, jeopardised by overdependence and unpreparedness.\nAbjana Shamu \nStudent \nBachelor of Business Administration \nNorth South University \nabjana.shamu@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Export diversification for sustaining growth",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/export-diversification-for-sustaining-growth-1750778965",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 25, 2025 00:00:00  \n\nWhat's happening in the realm of Bangladesh's civil service nowadays has deeply been concerning. Civil servants are supposed to uphold personal integrity, empathy, and trustworthiness to earn faith and confidence from society when discharging their assigned responsibilities. They receive various training programmes to enhance their level of efficiency so that they can serve the people and the nation. \nHowever, it seems, many of them have not been sufficiently motivated by the objectives of these trainings, or the institutions themselves may lack the capacity to properly equip the target groups. At best, in field administration, the nation has yet to witness any notable examples of their dealings, behavioural patterns, generosity, or citizen-friendly interactions that reflect training outcomes.\nTraining providers ought to reconsider the modality, content, and post-training performance evaluation to determine whether the field administration system is navigating the right path. A socio-economic study could be conducted to explore why the values, attitudes and moralities of civil servants are steadily declining.\nIt is regrettable that a newspaper recently reported that, in the past twelve years, eight Deputy Commissioners were allegedly involved in sexual scandals, yet no exemplary punishment was handed down. Moreover, some Upazila Nirbahi Officers (UNO) and Assistant Commissioners were also reportedly engaged in such immoral acts and tactically escaped accountability.\nAs a result, wrongdoing and dishonest activities in administration have spread rapidly, eroding public trust in government management systems. The culture of impunity that has taken root over time has encouraged repeat offences. Therefore, strong management with zero tolerance for any sexual misconduct must ensure serious punishment without delay-neither withdrawal nor appointment as OSD (Officer on Special Duty) should be an option.\nIt is hoped that the government will take prompt and exemplary action regarding the recent scandal involving the DC of Shariatpur so that further misdeeds are prevented.\nMd. Refatul Hossain\nAdditional Director (retd.)\nDepartment of Agricultural Extension (DAE)\nFaridpur Region\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Upholding values of civil service",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/upholding-values-of-civil-service-1750778989",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-06-2025"
    }
]