[
    {
        "full_article": "In ordering an in-house inquiry by a three-judge panel, the Chief Justice of India, Sanjiv Khanna, has demonstrated a welcome element of transparency and quelled speculation that the institution may not act decisively on issues of accountability among constitutional court judges. The action taken so far, in the wake of allegations that burnt currency notes were found while a fire was being doused at the residence of Justice Yashwant Varma of the Delhi High Court, is multi-pronged. A preliminary report from the Chief Justice of the Delhi High Court, Justice D.K. Upadhyaya, along with a response from the judge concerned, was obtained; it has been decided not to allocate judicial work to Justice Varma; a proposal had already been initiated to send him back to his parent High Court, the Allahabad High Court. The inquiry will be conducted by the Chief Justices of the Punjab and Haryana High Court, and the Himachal Pradesh High Court, and a judge of the Karnataka High Court. It is clear that the CJI wants to get to the bottom of the issue, despite Justice Varma’s categorical denial that the cash had anything to do with him; and his assertion that it is improbable that someone would store a large amount of cash in a virtually unused, unlocked out-house store room that is accessible from both the front and back gates and frequented by residential and government staff.By posting photographs and a video clip showing wads of burnt notes, as well as Justice Upadhyaya’s report and the reply given by Justice Varma, on the Supreme Court of India’s website, the institution has demonstrated rare transparency. This augurs well as there is reason to believe that the in-house inquiry’s findings may also be made public. However, there are some doubts about the efficacy of the probe mechanism, especially if it turns out to be a conspiracy to implicate the judge by setting fire to the store room in his absence. A regular police investigation may have been better to ascertain the facts, such as the cause of the fire and whether anyone removed the burnt notes from the site. There was also a mysterious claim by a Fire Services official that no currency notes were found, but it was subsequently denied. Ever since the Court held that no first information report can be registered against a superior court judge without consulting the CJI, the police rarely initiate any inquiry into complaints against judges, and an internal mechanism became inevitable. While the judiciary does its work, the government should not be over-zealous in this matter, lest it be seen as the mastermind trying to trigger wider public demands for a robust accountability mechanism and a new appointment system for judges. If there is a lesson to be drawn from this murky episode, it is that the independence of the judiciary is not protected by insulation from regular investigative processes, but by making it fully accountable and transparent in its functioning. Published - March 25, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        judge\n                    \n                            /                      \n                        \n                        investigation\n                    \n                            /                      \n                        \n                        inquiry\n                    \n                            /                      \n                        \n                        online",
        "headline_1": "​Truth and transparency: On the judiciary",
        "headline_2": "Openness shown in ordering probe against judge should result in accountability too",
        "link": "https://www.thehindu.com/opinion/editorial/truth-and-transparency-on-the-judiciary/article69368214.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "25-03-2025"
    },
    {
        "full_article": "A new broom sweeps clean, but reckless change serves little purpose. After targeting health care — pulling the United States out of the World Health Organization and paralysing USAID — U.S. President Donald Trump has turned to another cornerstone of the state: education, whose long-term significance to any nation is indisputable. Last week, he signed an executive order to “begin eliminating” the federal Department of Education (DoE), vowing to shut it down “as quickly as possible”. Established in 1979, the DoE administers federal student loans for college and university students, and provides targeted support for disadvantaged groups, including students from low-income families and those with disabilities. As in India, public K-12 schools in the U.S. are primarily managed at the State level, with only a fraction of their funding coming from the federal government. Yet the DoE plays a critical role in ensuring a baseline of equity. White House Press Secretary Karoline Leavitt defended the executive order by citing decades of “failing test scores” and low student performance, despite over $3 trillion in federal spending. “What has been the return on that investment for the American taxpayer?” she asked. But demanding a measurable return on investment on public welfare is not just misguided — it borders on malevolence. It targets the most vulnerable students and risks stripping away their only path out of adversity.The Department of Education has long been in the cross hairs of Conservatives; since the Reagan era, abolishing it has been a Republican aspiration. But no one has come closer to realising that goal than Mr. Trump. Even before signing this order, the department’s workforce had been nearly halved, with abrupt terminations issued under the Elon Musk-led Department of Government Efficiency — now a hallmark of the new administration’s approach. Critics have denounced the move, arguing that if student outcomes are truly the concern, efforts should first focus on reforming and strengthening the system, and not dismantling it. Crucially, the executive order cannot take full effect without Congressional approval — and it remains to be seen whether Mr. Trump’s political will can carry it through. Already, lawsuits are being filed in federal courts, challenging the order’s legality. The future of millions of disadvantaged students hangs in the balance. It is up to the rest of the U.S. to ensure that a lifeline is not pulled out.\r Published - March 25, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        government departments\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        school\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        personal income\n                    \n                            /                      \n                        \n                        disabled\n                    \n                            /                      \n                        \n                        students\n                    \n                            /                      \n                        \n                        universities and colleges\n                    \n                            /                      \n                        \n                        education loans",
        "headline_1": "​Lessons not learnt: On Trump and the Department of Education",
        "headline_2": "Trump’s move to shut Department of Education is irresponsible",
        "link": "https://www.thehindu.com/opinion/editorial/lessons-not-learnt-on-trump-and-the-department-of-education/article69368224.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "25-03-2025"
    },
    {
        "full_article": "Another Maha local govt violates SC ruling on demolitions. Top court must take suo motu notice\nOn Monday, Nagpur municipal corporation demolished the house of a key accused in the communal violence that rocked the city on March 17. On March 20, surveyors declared the accused’s premises illegal. Bulldozers razed it on March 24 – in complete violation of Supreme Court’s Nov 2024 order, which laid out binding directives on razing buildings, including unauthorised constructions, applicable pan-India. There is nothing ambiguous in that SC order: “No demolition should be carried out without prior show cause notice returnable either in accordance with the time provided by local municipal laws or within 15 days’ time from the date of service of such notice, whichever is later.” It’s just been a week since the Nagpur violence, and the building was razed within four days of being declared illegal. Bombay HC’s Nagpur bench ordered a stay late Monday on the demolition of another accused’s property, calling authority’s action “high-handedness”. Alas, too late for the two-storey building razed hours ago.\nAlso on Monday, SC issued notice to Malvan authorities on a plea that the Maharashtra municipal body had violated SC’s Nov 2024 order. The Malvan demolition of a scrap dealer’s shop came after locals harassed his son and family for backing Team Pakistan in a Champions Trophy match on Feb 23. SC has given Malvan four weeks to respond – too long, it may be argued. For, SC itself had noted the “lawlessness” of such insta-justice in its Nov order, in response to pleas of arbitrary state action of razing structures, witnessed in UP, MP, Rajasthan, Assam, Gujarat, Jharkhand and Delhi. SC had said:“The chilling sight of a bulldozer demolishing a building…reminds one of a lawless state of affairs, where might was right.” Using its extraordinary powers under Article 142 of the Constitution, its 95-page judgment fixed accountability of public officials. The directives also gave owners/occupants time to challenge the local authority’s action.\nTwo cases within weeks of one another, barely four months after SC’s important order and strong words, show that local govts continue to believe they will get away with bulldozer action. Govt machinery clearly has no fear of SC’s directives that include contempt action against officials responsible, and their prosecution. SC also said officials would be personally liable for restitution of demolished property. Therefore, the top court must take suo motu notice of the Nagpur violation on Monday – and make an example out of those responsible for violating SC directives. Ordinary Indians can’t afford to have their rights so casually crushed under earthmovers by local govts.\n\n",
        "headline_1": "Bulldozing justice",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/bulldozing-justice/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-03-2025"
    },
    {
        "full_article": "Who’s respecting free speech when cops file defamation case after a comedy riff on a neta?\nWhen the going gets funny, the funny get going, goes a stand-up comic witticism. Politics is always fertile material for comics. In open democracies across the globe, people are all having a laugh at their public servants. But many, or almost all, of our politicians are extra touchy when the joke’s on them, especially when a comic riff on them has audiences guffawing extra loud. Assume, though, that someone thinks Kunal Kamra’s latest jokes are not funny but absolute rubbish. So what? The point is that Article 19(1)(a) of our Constitution guarantees all citizens freedom of speech and expression, with ‘reasonable restrictions’. UBT Sena sees the logic of Kamra’s joke while Shinde Sena doesn’t. Fine. Everyone else also gets to make up their mind for themselves.\nExpressing disagreements with speech via speech is the bedrock of modern society. The understanding and expectation that disagreement expressed via violence will be punished by state institutions is the bedrock of lawful coexistence. True, police have booked Shinde Sena personnel for ransacking the studio where Kamra filmed his jokes. But simultaneously, they have booked him too. First, under BNS Sections 353(1)b and 353(2) against ‘statements conducing to public mischief’, a much-abused provision dating back to the 1860 IPC. Second, under 356(2), criminal defamation. Aside from the problems with criminal defamation law as well as the vagueness inherent in defining ‘public mischief’, why are cops filing these cases? That should be the business of persons who feel wrongly targeted. And if third persons find the jokes offensive, say ‘classist’ or ‘elitist’, again why would cops carry their cudgels?\nBut it’s not just cops, even courts sometimes seem to side less with the spirit of the Constitution’s free speech protection. In the Allahbadia case the SC observed at one point that, “If you can try to attain cheap publicity by saying these kind of things, there might be others also who might want to get cheap publicity by making threats.” This is a false equivalence. Free speech may offend some but unless it’s judicially determined as falling foul of ‘reasonable restrictions’, neither police/govts nor mobs have a role to play.\n\n",
        "headline_1": "Joke’s on us",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/jokes-on-us/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-03-2025"
    },
    {
        "full_article": "Price caps fetch you so much more than they say\nThis summer, get ready for an epic action and drama feature that will keep you on the edge of your seats – or maybe out of the seat altogether. From the makers of ‘Price Caps on Cab Prices and Price Caps on Movie Tickets: Part 1’, comes this entertaining sequel. Local hero, Karnataka govt’s bleeding heart couldn’t endure people paying high prices for their entertainment, so he’s decided to step up and fight against the evil market forces. Move over invisible hand, govt’s visible hand will be issuing tickets at a mere ₹200. \nThis summer blockbuster will have something for everyone. First, the thriller – lower prices will spike demand, leading to suspense over whether you will get a seat. Then, the horror – parking and popcorn prices will hit the roof. With capped prices, multiplexes will recoup the losses elsewhere – ‘Do you want popcorn and a cola with your ₹200 ticket? That’ll be half a kidney, please!’\n\nNext, the period drama – because you’ll be transported back in time. With multiplexes cutting costs, bid goodbye to premium offerings. Recliner seats, superior sound systems, IMAX and 4D? Who needs those when you can have a nostalgic trip and watch movies the way your grandparents did – with loud audio (but barely discernible dialogue) and bed bugs for company on the seats. Further, customers will have to bear stinking toilets, reduced security, fewer attendants, and badly maintained interiors.\n\nTo satiate the adventure lover, there’s now the thrill of buying movie tickets in black from touts, a forgotten phenomenon in the age of online booking and dynamic pricing. Or the multiplexes themselves might get innovative – ₹200 for the ticket and their ₹400 convenience fee.\n\nIndependent filmmakers, who normally struggle to find screens, will particularly love this policy. They will have to play the role of underdog and compete for screen time in cinema halls desperate to book only guaranteed blockbusters, to maximise quantity at the fixed price. The critically acclaimed small-budget indie film won’t match the economics of ‘Hero Beats Up Bad Guys – Part 7’, now with more action, more car chases and more sleaze.\n\nIn the grand finale of unintended consequences, the number of moviegoers might reduce, given the reduced choice and the joy of finding all the hidden costs. All this drama for just ₹200. Undeniable entertainment value.\n\n",
        "headline_1": "Smokescreen",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/smokescreen/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-03-2025"
    },
    {
        "full_article": "Judicial in-house inquiries against judges don’t have a great record. Will this time be different? \nLast week’s report of firefighters finding a large stash of cash at a high court judge’s home in the nation’s capital, was highly unusual. It was also disputed, both by the judge and senior personnel of the fire department itself. Then, the Supreme Court did something even more unusual. It uploaded on its website the photos and video showing what was found. This means amidst contradictory accounts, people can see for themselves that the found articles did indeed include currency notes. Big public interest in this developing story is very understandable. Ancient Greeks put it best: it is in justice that the ordering of society is centred. This order in turn hinges on judicial rectitude. Every murmur of dishonesty runs a tremor through the whole edifice.\nPer procedure, CJI Sanjiv Khanna has constituted a committee to conduct an inquiry into the corruption allegations. It’s made up of the chief justices of Punjab & Haryana HC and Himachal Pradesh HC and a Karnataka HC judge. The person they have to investigate is Justice Yashwant Varma, sitting judge of Delhi HC, who is scheduled to retire not before 2031. Nothing speaks the seriousness of their assignment more than that no HC or SC judge has ever been impeached – one judge quit midway through parliamentary debate on his conduct – or convicted for corruption in India. Are in-house judicial procedures better? Constituted in 1999, this procedure aims to preserve the independence of the judiciary as well as public faith in it.\nA Jan report of the International Commission of Jurists has found this in-house procedure “insular” and even “ineffective”. The claim is underlined by noting that in 2022, the Union law minister told Parliament there were more than 1,600 complaints against HC and SC judges but no official information as to action taken on these complaints. This is of course on top of the opacity in selection of judges. Rajya Sabha chairman Jagdeep Dhankhar is just one of many who are once again arguing that the National Judicial Appointments Commission (NJAC) struck down as unconstitutional by SC in 2015, provided for judicial accountability more rigorously. \nIn its unprecedented sharing of documents related to the current case, SC has indicated a broader approach to public disclosures. As the in-house committee probes the case, it should remember that the aphorism justice must not only be done but must also be seen to be done is popular because it is profound.\n\n",
        "headline_1": "Justices and justice",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/justices-and-justice/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-03-2025"
    },
    {
        "full_article": "With over 15 political parties submitting written feedback on state reform proposals so far, the second phase of the reform drive can be said to be reaching a definitive point. Some of the parties have been vocal about various aspects of the drive in recent months, but this marks their first official response, which in time will be used as a basis for agreement on implementable reforms by the National Consensus Commission. Among the parties, BNP and the National Citizen Party (NCP) submitted their feedback on Sunday, while Bangladesh Jamaat-e-Islami submitted theirs on Thursday—with their appraisals initially covering key proposals by five reform commissions. We value their respective stances which we hope will leave room for compromise so that the desired consensus can be reached.\nThat said, certain aspects of these political appraisals, especially those relating to constitutional amendments and electoral system, deserve scrutiny given their potential impact. In particular, a preliminary reading of BNP's feedback shows that while the party leaves the door open for some radical changes—including a bicameral legislature with a 400-seat lower house and a 105-seat upper house—it appears less accommodating of other changes that may institute better checks and balances or limit exploitation of power using parliamentary majority. For instance, BNP does not deem it necessary to form a National Constitutional Council to handle appointments to the Anti-Corruption Commission and Election Commission. It also rejects the idea of holding the EC accountable to a parliamentary standing committee. Regarding the prime minister's tenure, it does not support the proposal that an individual cannot be PM more than twice, seemingly contradicting its own stance in its 31-point charter. It also disagrees with the proposal that one cannot be PM, leader of house, and chief of a political party at the same time. \"Imposing constitutional restrictions on political parties is contrary to the core essence of parliamentary democracy,\" it says.\n\nThe message we get from these positions is that BNP remains hesitant to embrace institutional mechanisms that would prevent the excessive centralisation of power. But a key lesson from the history of past elected governments is that no party can be entrusted with absolute parliamentary authority, which, if unchecked, can lead to parliamentary dictatorship. Any reluctance to subject constitutional bodies to stronger oversight or to limit the authority of those in power is thus concerning.\nThe message we get from these positions is that BNP remains hesitant to embrace institutional mechanisms that would prevent the excessive centralisation of power. But a key lesson from the history of past elected governments is that no party can be entrusted with absolute parliamentary authority, which, if unchecked, can lead to parliamentary dictatorship. Any reluctance to subject constitutional bodies to stronger oversight or to limit the authority of those in power is thus concerning. While BNP supports certain aspects of constitutional reform, its insistence that these matters be decided by elected MPs again reflects a preference for parliamentary majoritarianism. It may be good in theory, but not so in practical experience.\nWe think a key question moving forward is whether political parties can rise above their immediate strategic calculations and prioritise long-term national stability. Faith in parliamentary democracy is not granted automatically; it is earned through responsible governance. The overwhelming public support for structural changes after the fall of Sheikh Hasina's government is a testament to their demand for a more accountable system. Politicians must not squander this opportunity.\n",
        "headline_1": "Checks and balances are key to the success of reforms",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/checks-and-balances-are-key-the-success-reforms-3856446",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-03-2025"
    },
    {
        "full_article": "Going solely by its public statements, an interesting aspect of BNP's activities since the July uprising has been its search for—and interaction with—new adversaries, in the absence of the one it fought against for so long. As new forces emerge on the scene, BNP, driven partly by post-uprising realities and partly by an abiding sense of victimhood, has increasingly found itself at odds with former allies, new parties, student leaders, the chief adviser and his cabinet colleagues, and even media houses critical of its unruly activists. And it has sought to use these conflicts to come out stronger. What's interesting about it is how unchanged BNP's manner of engagement has remained despite the political changeover in August, often adopting an adversarial tone that feels too eager at times.\nIn his seminal work on the politics of enemies, Canadian historian Michael Ignatieff explains that when politicians target their adversaries using inflammatory rhetoric, it is not necessarily true that they are merely representing their constituents' feelings or responding to injustices and societal divisions. \"The truth may be darker: it may be a language game not to represent grievance, but to create it, and to polarise for the sake of political advantage.\" However, as the largest party at present—and one many expect to win the next national election—BNP's adversarial politics hurts more because it was expected to lead a new culture of politics, with a new political language that seeks mediation rather than confrontation.\nBe that as it may, where it gets particularly disturbing is when BNP brings its combative approach to the state reform drive, which the nation hopes will be the catalyst for transformational change in the country. BNP's stance on reforms has long been one of confusion and mixed messages. On March 16, however, it seemed to take it a step too far. Speaking at an iftar programme at Dhaka Medical College, senior BNP leader Mirza Abbas said, rather ominously, \"We will not easily accept any reforms dictated by their [interim government's] hands or pens. If they carry out reforms, we will make corrections. BNP, in collaboration with other political parties, will determine those corrections and present them to the nation. We will not accept the so-called reforms led by the so-called intellectuals who are not even citizens of this country.\"\n\nBNP must recognise that, besides electoral changes, there are other reforms that are of equal priority. Our painful history of political violence and corruption demands that some key changes be made—at least in the judiciary and police force—to ensure Bangladesh doesn't return to the pre-July status quo after elections. The idea that this may not happen is both naïve and dangerous.\nThis statement is striking for two reasons. First, it outright dismisses the proposals from various reform commissions which, by the way, are with the political parties for review. Second, it openly questions the legitimacy of those who prepared the proposals and are in talks with stakeholders, including the BNP, to achieve consensus on the nature and extent of reforms. But if this is how BNP wants to navigate this crucial phase—by pre-emptively rejecting expert proposals, disparaging those involved, or accusing the \"unelected\" government of trying to favour certain parties—what was the point of all the efforts over the last seven months? The non-citizen jibe, likely aimed at the National Consensus Commission Vice-Chairman Ali Riaz, who also heads the Constitution Reform Commission, was particularly insensitive. Despite BNP being very much on the inside and having the ability to impact outcome through the ongoing dialogue, such public outbursts create confusion about what it truly wants.\nYes, not everything said to rally party loyalists should be taken at face value. But BNP's reaction cycle—from insisting that elections and reforms should progress in tandem to demanding no reforms beyond those related to elections—is well-documented. The party has itself complained that its commitment to reforms is being unfairly questioned, but stopped short of considering whether it is somehow contributing to this perception. Instead, it appears more interested in its own 31-point charter, which largely consists of broad visions. All this suggests BNP's growing alienation from the aspirations for structural change through the ongoing reform drive. While acting chairman Tarique Rahman's statement on Wednesday—warning that extremists and fascists could again \"bury democracy\" and expressing BNP's commitment to maintaining the country's secular character—is laudable, it's the grunt work of reform-making where its commitment, and support, are most needed. Right now, its critical stance isn't helping. Ali Riaz appeared to hint as much on Thursday when he stated that both internal and external forces are trying to \"obstruct the reform process.\"\nBNP must recognise that, besides electoral changes, there are other reforms that are of equal priority. Our painful history of political violence and corruption demands that some key changes be made—at least in the judiciary and police force—to ensure Bangladesh doesn't return to the pre-July status quo after elections. The idea that this may not happen is both naïve and dangerous. To expect a political government to honour its commitment to reforms is like expecting it to honour its election manifesto, and we all know how faithful past ruling parties were to their manifestos. There must be at least some binding mechanisms or safeguards in place to ensure that the reform drive does not derail after elections. One way, as suggested by a columnist in this daily, would be for political parties to \"thrash out a common minimum reform programme (CMRP)—a set of core reforms based on the max-min principle, where the maximum number of parties agree on a minimum set of urgent measures.\" This is precisely what the National Consensus Commission can help achieve, if given proper support.\nIf the BNP really wants to be seen as a pro-reform force, it should engage in these discussions with greater sincerity, sending an undiluted message of solidarity with whatever outcome this process yields. At the same time, it should balance its political aspirations with the broader national interest. That goes for all other parties as well. Any attempt to politicise the reform drive—whether by questioning and obstructing the process or by selectively endorsing reforms that suit their interests—will serve neither the parties nor the country in the long run.\nBadiuzzaman Bay is assistant editor at The Daily Star. He can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The more BNP talks about reforms, the less convincing it sounds",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/magic-madness/news/the-more-bnp-talks-about-reforms-the-less-convincing-it-sounds-3855976",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-03-2025"
    },
    {
        "full_article": "When Bangladesh defeated Pakistan on 16 December 1971, one could be forgiven for assuming that the international community automatically recognised Bangladesh's independence. However, my current research into how Western states responded reveals that this assumption could not be further from the truth.\nA brief history of recognition practices\nThe fact that Bangladesh gained international recognition at all is remarkable. In modern times, it is rare for a secessionist state to achieve international legitimacy without the assent of the home state. In fact, it has happened only twice in the past three hundred years: Belgium, which began its secessionist movement in 1830, waited nine years for recognition, and Ireland, which began its independence war from the UK in 1919 but was not recognised as a republic until 1949. Generally, unilateral acts of secession without support from the home state result in international silence if not explicit condemnation.\nWhy is it so difficult for secessionist movements to gain international recognition?\n\nThe main reason is states fear setting a precedent for other disgruntled minority groups within their midst to declare independence. Globally, states are comprised of multi-ethnic populations, some of which have made claims for secession. From Quebec in Canada to Transnistria in Moldova, such calls for independence undermine state authority. It is therefore in the interests of governments to dissuade independence movements as they pose an existential threat.\nThere are other, more practical, reasons to deny statehood to secessionist groups. Economic factors loom large. As was the case with East Timor, home states can use the presence of natural resources as a bargaining chip to secure international support. The international community oftentimes expresses concern that supporting one secessionist group could trigger regional conflicts and undo accepted international borders, as is the case with Kurdistan.\nLegally, the issue of international recognition of breakaway states is unclear. The United Nations (UN) is often lauded for spearheading decolonisation. This is true. But what is also true is that the UN applies a \"decolonisation only once\" principle. Comprised of (and funded by) states, the UN has a vested interest in protecting the existing territorial borders of its members. Furthermore, in international law there is no agreed-upon mechanism under which state recognition must occur, nor is there any widely accepted legal definition of statehood.\nIn short, the act of state recognition is a political behaviour rather than an impartial legal decision. The decision if and when to recognise a newly formed state is driven primarily by self-interest and cost-benefit analysis. The lofty ideals of freedom and self-determination rarely rate a mention.\nDespite its ambiguous process, the decision to recognise a secessionist state does matter. It has been said that without international recognition, a declaration of independence by a breakaway territory is like one hand clapping: it is pointless. International recognition has the power to turn an isolated, emerging nation into a fully-fledged member of the international community and all the benefits that it entails: including access to trade agreements, establishment of diplomatic missions, freedom of movement across international borders, and access to membership of global and regional organisations.\nTimeline of recognition\n\nAs is well-known, India and its ally Bhutan recognised Bangladesh before the Liberation War ended. But for the rest of the international community, recognition was not considered a viable option until Bangabandhu Sheikh Mujibur Rahman was released from Pakistani custody. The next bloc of countries to recognise Bangladesh came from communist Europe: East Germany, Poland and Bulgaria. Australian diplomatic cables state that these communist states were used as \"Soviet pathfinders to recognition\". That is, Moscow ordered these states to recognise Bangladesh early to assess the reaction of Pakistan.\nOnce the USSR was satisfied that Pakistan's threats of retaliation were hollow, it recognised Bangladesh on 25 January, followed the next day by Czechoslovakia and Hungary. Diplomatic cables document why Communist Europe was keen to recognise Bangladesh early. Legitimising the young nation offered the communists a \"propaganda win\" by \"beating the west\", and marginalising Maoism in the region.\nOn the surface, this timeline suggests that the western world was slow to recognise Bangladesh. However, Australian archival evidence indicates a more complicated story.\nIt is true that the United States, under the leadership of Richard Nixon, delayed recognition of Bangladesh until April, if only to punish India for a perceived lack of gratitude for American aid. At the same time, the Nixon Administration was planning its historic visit to the People's Republic of China in February 1972 to normalise relations between the two adversaries. Pakistan was a crucial intermediary in this process and the US was loth to insult its ally so close to the Beijing trip.\nThe other great power, the UK, was torn on multiple fronts: it feared that recognising Bangladesh may trigger Pakistan to withdraw from the Commonwealth yet failure to recognise Bangladesh could jeopardise access to a profitable trading partner. With memories of British imperialism still fresh, the UK government was reluctant to intervene in its former colony. Moreover, in 1971 the UK was focused on gaining admission to the European Community (EC) and had famously withdrawn its troops \"east of Suez\" in 1971.\nWith the US preoccupied and the UK uncertain how to act, a vacuum was left for so-called middle powers such as Australia to fill the void.\nAustralia leading the West\nAlthough Australia formally recognised Bangladesh on 31 January—as the first Western nation to do so, along with allies New Zealand and Fiji—Australian diplomats had been actively advocating for Bangladesh's recognition behind the scenes since 24 December, eight days after the ceasefire.\nEven before the war commenced on 25 March 1971, the Australian Department of Foreign Affairs (DFA) began preparing staff for the disintegration of Pakistan. Then, on 24 April 1971, Vice President of the Bangladesh government-in-exile, Syed Nazrul Islam, wrote to the Australian government. In his letter, Nazrul Islam attached the Bangladeshi Proclamation of Independence and asserted, \"the people of Bangladesh, by their heroism, bravery and revolutionary fervour have established effective control over the territories of Bangladesh\". The Australian government did not respond to this letter as it would have been deemed inappropriate to communicate directly with the government-in-exile. However, unofficially, as early as June 1971 the Australian Prime Minister William McMahon lobbied for the release of Mujib from Pakistani custody as a first step to a political solution to the conflict and a step towards autonomy.\nBy December 1971, it was clear to Australians that a ceasefire was imminent, and they needed to determine their allegiance: to recognise Bangladesh early and risk a severance of diplomatic relations with Pakistan, or to acquiesce to Pakistani demands and refrain from formal recognition of Bangladesh.\nFor many western and Asian nations, the second option was most appealing as it offered the least risk in the short-term. Figure 2 shows the positions of the UK, Singapore, New Zealand, Malaysia and Canada. All Commonwealth countries shared the same characteristic of risk-aversion, even if that meant stymieing the possibility of Bangladesh to stabilise and prosper in the post-Liberation War period.\nThe Australian position was markedly different from its western and Asian allies. Arguably, Australian diplomats had been preparing for an independent Bangladesh throughout 1971, even if they never publicly declared it. With few exceptions, the Australian government sided with Bangladesh's aspirations for statehood. On 11 December 1971, Australian High Commissioner to India, Patrick Shaw, cabled to DFA:\nAs for your fears that \"premature recognition would have adverse effects on Australian relations in Islamabad\", it is more important to consider Australian relations with Dhaka and with New Delhi.\nLeading Australian diplomat Sir James Plimsoll concurred, stating \"I agree with Shaw too that we should not create obstacles to our establishing some relationship with Bangladesh before too long\". These opinions informed the position of the DFA, which urged the Australian Foreign Minister Nigel Bowen on 13 December: \"Australia should move to recognise Bangladesh as soon as practicable after the installation of a new government in Dhaka\".\nWith the ceasefire on 16 December, Australian deliberations shifted from whether to how to recognise Bangladesh. The Australian government employed multilateral diplomacy to persuade like-minded nations to join Australia and recognise Bangladeshi independence quickly and as a bloc. The reasons for wanting to recognise Bangladesh collectively were based on practical advantages. Oftentimes, acts of contemporaneous state recognition create momentum and stimulate other nations to follow suit. When a group of nations act simultaneously, it bestows greater legitimacy on the country being recognised.\nFrom 24 December, Australian diplomats across the globe were instructed by the DFA to \"sound out\" western and Asian governments on their willingness to recognise Bangladesh. While the response was positive, none was ready to act.\nAfter the release of Mujib from Pakistani custody on 8 January 1972 and his arrival in Dhaka on 10 January, the Australian government commenced a second round of negotiations. From 11 to 17 January, Australian diplomats sought to persuade other governments to recognise collectively on 19 January. Although Bangladesh had demonstrated it fulfilled all criteria for recognition, some states were still hesitant. Typically, each state that Australia approached may have supported in principle recognition of Bangladesh yet opposed to acting early for fear of retaliation from Pakistan or offending Muslims in the Middle East. Indeed, in January Saudi Arabia warned the international community that recognition of Bangladesh would be viewed as a \"hostile act\", a threat that spooked Western Europe.\nLike its December effort, Australia's endeavour in mid-January to secure a coalition to recognise Bangladesh was unsuccessful. But the Australian government remained undeterred and continued negotiations through January. Socialist Yugoslavia proved an unlikely ally, and in the end it recognised Bangladesh on 22 January, before Australia. In the third round of negotiations, Australia continued to lobby south-east Asian nations, Japan, Canada and western European states. Australian diplomats in Latin America contacted their counterparts in Argentina and Mexico, although these approaches failed completely.\nIn the final week of January, Western European governments agreed they would recognise Bangladesh at some point. But by now, the Australian government was unwilling to wait, having had their plans thwarted twice within four weeks. In the end, Australia recognised Bangladesh on 31 January, one week after Australian Cabinet approval and five weeks since Australian diplomats began mobilising western support for recognition. . On 14 April 1972, the Australian government accredited Hossain Ali as Bangladesh's High Commissioner—the first OECD country to open a diplomatic mission. See Figures 3 and 4.\nAustralia's position on recognition of Bangladesh was unusual in that it was not entirely focused on self-interest, such as trade implications. Australian diplomats believed that early recognition was important to \"help Bangladesh get on its feet\" and show \"that the communists are not its only friends\". Numerous Australian diplomats argued that early recognition was vital to cement the leadership of Mujib and foster moderate politics. Peculiarly, Australian diplomats viewed Bangladesh as a Southeast Asian nation. While geographically inaccurate, the fact that they situated Bangladesh within Australia's neighbourhood reveals an imagined closeness between the two nations.\nThat Australia was the first Western nation to recognise Bangladesh, and that its diplomats lobbied both Western and Asian governments to do the same, represents a rare moment in Australian foreign policy that was independent of the UK. It also demonstrates the potential of middle-power diplomacy to offset American obstinance, offering a pathway to help Bangladesh realise its aspirations of independence.\nRachel Stevens  is a Lecturer in History at the Institute for Humanities and Social Sciences, Australian Catholic University in Melbourne.\n\n",
        "headline_1": "How Bangladesh gained global legitimacy",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/focus/news/how-bangladesh-gained-global-legitimacy-3856236",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Independent media, safety, security of journalists",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/independent-media-safety-security-of-journalists-1742833015",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Can Bangkok Summit  revamp BIMSTEC?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/can-bangkok-summit-revamp-bimstec-1742833068",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Transport operators won't listen to reason",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/transport-operators-wont-listen-to-reason-1742839227",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Overuse of pesticides concerning",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/overuse-of-pesticides-concerning-1742833129",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-03-2025"
    }
]