[
    {
        "full_article": "In a blow to the outlawed Communist Party of India (Maoist), its general secretary was killed in security operations in Chhattisgarh on Wednesday (May 21, 2025). The elimination of Namballa Keshav Rao, alias Basavaraju, is perhaps the biggest blow to the insurgents since the death of Cherukuri Rajkumar, the then CPI (Maoist) spokesperson in 2010, also in a security operation. Basavaraju, who had been the head of the party’s central military commission before becoming the general secretary in 2018, had masterminded several attacks against paramilitary and police forces. His rise within the CPI (Maoist) marked the insurgents’ reiteration of its militarist strategy, to continue their “protracted peoples’ war” as against the alternative of political struggle and agitations to achieve their aims. His death — a number of Maoist personnel have been killed in the last couple of years — represents the failure of this strategy. Home Minister Amit Shah has been on record to say that the government is keen to overcome the Maoist threat by 2026 and Basavaraju’s killing would suggest a major win. The fact that the Maoists had reportedly sought peace talks, even while continuing their armed struggle, calls into question whether the Maoist leaders and activists could have been apprehended rather than eliminated. The surrender of Maoist cadres in recent days is also a case in point. But it is also well understood that the senior Maoist cadre, with roots in the People’s War naxalite movement in united Andhra Pradesh, have shown little inclination to give up their armed struggle and such “encounters” are perhaps inevitable.In recent years, and according to the Maoists’ own admission, there has been a significant reduction in recruitment by the insurgents, with flagging support from the tribal population in south Chhattisgarh. Tribal youth, many of whom have experienced enormous suffering in the decades-long insurgency, are no longer inclined to adhere to the radical agenda of the Maoists. The group’s poor understanding of the Indian state and its complete rejection of the electoral process as a “mere facade” have found fewer takers in the forested areas that were hitherto inaccessible to the Indian government. With the government’s increased tribal welfare measures and outreach and its redoubled emphasis on defeating the guerilla warfare, the Maoists have seen an erosion of their limited military and support bases. With the death of senior leaders, the Maoist movement is surely gasping for survival, but the intensive security operations have also resulted in scores of tribal youth being killed. The government should use this situation to renew its call for peace talks to pressure the Maoists to abandon their armed struggle rather than continue the policy of “annihilation” as that could only engender fresh resentment among the tribal people.\r Published - May 24, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        security measures\n                    \n                            /                      \n                        \n                        tribals\n                    \n                            /                      \n                        \n                        Chhattisgarh\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        welfare",
        "headline_1": "​Decisive moment: On Chhattisgarh anti-Maoist operation",
        "headline_2": "Basavaraju’s killing could defang Maoists and serve as chance for peace",
        "link": "https://www.thehindu.com/opinion/editorial/decisive-moment-on-chhattisgarh-anti-naxal-operation/article69611465.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "25-05-2025"
    },
    {
        "full_article": "Civic life in the United States stands on multiple, strong and independent institutions in different fields. These institutions, whether constitutionality mandated or not, have a continuity, life and standing of their own, beyond particular individuals. They enable diversity and pluralism, and provide protection against arbitrary decisions by those in power. Ironically enough, U.S. President Donald Trump is intent on damaging its oldest and wealthiest educational institution — Harvard. After harassing the institution with investigations, orders to turn over records, and freezing funds and grants running to hundreds of millions of dollars, the U.S. government has said that Harvard cannot enrol foreign students in 2025-26. Some 6,800 international students, including more than 750 from India, constitute more than 27% of its current student strength. They will have to transfer to other institutions within the U.S. or leave, as per the government, which does not want any new international student there in 2025-26 either. The U.S. government has said that the student visa programme is a privilege that it has granted and Harvard “relies heavily” on foreign students to “build and maintain their substantial endowment”, which is said to run to over $55 billion. And it sees foreign student visas and tax-exempt status as weapons in its arsenal against Harvard.Across the world, the authoritarian’s playbook for pluralistic societies is to identify an enemy against whom a campaign is unleashed based on real and imagined grievances. The campaign keeps the “enemy” in a state of disarray, even turmoil, with long-term damage and a chilling effect. Though sullied by unsavoury links, from the Salem witch trials to Enron, Harvard attracts some of the brightest talent from across the world and trains them for leadership roles in their chosen fields. It represents liberalism and knowledge creation that advances globalisation. Mr. Trump’s working and middle class support base looks at Harvard as one among elitist vehicles of globalisation that have excluded them while promoting affirmative action for minorities, especially African-Americans. While lineage and family background of prospective students are a factor for Harvard, an extensive scholarship programme seeks to balance that. Harvard has said that it will go to court against the government’s move just as it sued the Trump administration for freezing government funds. While the courts may well stay the ban, the damage has been done not just to Harvard but also to the image of American higher education and democratic principles. It is damage that cannot be easily remedied. Published - May 24, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        university\n                    \n                            /                      \n                        \n                        higher education\n                    \n                            /                      \n                        \n                        students\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        democracy",
        "headline_1": "​Permanent damage: On the Trump administration and Harvard",
        "headline_2": "Trump administration’s attack on Harvard will have long-term impact",
        "link": "https://www.thehindu.com/opinion/editorial/permanent-damage-on-the-trump-administration-and-harvard/article69611442.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "25-05-2025"
    },
    {
        "full_article": "Harvard sued and got a temporary stay on the Trump administration’s latest ruling – disallowing the university from enrolling foreign students. Calling enrolment of foreign students a “privilege not a right…to help pad multibillion-dollar endowments”, what homeland secretary Kristi Noem said bears repeating. “This administration is holding Harvard accountable for fostering violence, antisemitism, and coordinating with the Chinese Communist Party on its campus.”\nRead full story on TOI+\n\n",
        "headline_1": "Trump spots red star over Harvard",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/trump-spots-red-star-over-harvard/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-05-2025"
    },
    {
        "full_article": "Recently, a parliamentary committee proposed that the age criteria for Ayushman Bharat Vay Vandana Card, the health insurance scheme for elders, be reduced from 70 to 60 years of age, and coverage doubled from Rs 5L to Rs 10L.\nWhether or not that suggestion is implemented, it points to the importance of the demographic transition in India.\n \nRead full story on TOI+\n\n",
        "headline_1": "Silver can be the new swag",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/silver-can-be-the-new-swag/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-05-2025"
    },
    {
        "full_article": "By- Stuti Malhotra\nIn a world that glorifies memory – remembering every detail, event, hurt – it might seem unusual to suggest that forgetting can be a gift. But the truth is, the ability to forget can be a powerful tool for peace and freedom. Letting go of past grudges, painful experiences, and unnecessary worries allows us to live more fully in the present. Those who master the art of forgetting – not out of weakness, but out of wisdom – often lead the most fulfilled lives.\n\n\nTake the example of Nelson Mandela, one of the most iconic figures of the 20th century. After spending 27 years in prison under South Africa’s apartheid regime, Mandela emerged not bitter or vengeful but with willingness to forgive. Upon his release, instead of seeking revenge against those who had oppressed him, Mandela chose the path of reconciliation. His ability to ‘forget’ the personal pain for the sake of a greater cause – unity and peace – transformed a nation.\nMandela famously said, “As I walked out the door toward the gate that would lead to my freedom, I knew if I didn’t leave my bitterness and hatred behind, I’d still be in prison.” His wisdom reminds us that holding onto grudges only keeps us trapped. Forgetting, in the right context, is not about denying what happened but choosing not to let it control our future.\n\nIf Mandela – after decades of injustice – could let go, surely, we can practise the same in our daily lives. Whether it’s a misunderstanding with a friend or a family dispute, releasing that resentment frees us far more than it affects the other person.\n\nBeyond emotional pain, forgetting plays a crucial role in easing mental stress. Our minds are constantly processing news, responsibilities, and relationships. If we remembered everything then the mental space would become unbearably cluttered. Forgetting helps us filter out the noise and focus on what matters.\nThe ancient Greek philosopher Epicurus understood this well. He believed that peace of mind comes not from clinging to every thought or experience but from ataraxia – a state of tranquillity achieved by letting go of distressing memories. By choosing to forget trivial grievances, we create room for joy and mental freedom.\nAcross numerous spiritual traditions, the power to forget is regarded as a divine blessing. These faiths gently teach us that not everything is meant to linger; some burdens are destined to fade away. We are not obliged to bear every sorrow or anxiety forever.\n\nForgetting doesn’t mean erasing – it means making peace with the past so it doesn’t control our present. The next time you find yourself replaying an old hurt or clinging to a worry, ask yourself: Is this helping me live a better life? If the answer is no, consider letting it go. Because forgetting, when done wisely, isn’t weakness. It’s a profound strength. It’s a gift that allows us to live with open hearts, clear minds, and a sense of peace. So, let us forget and forgive.\n\n",
        "headline_1": "The art of forgetting: A gift for life",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-art-of-forgetting-a-gift-for-life/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-05-2025"
    },
    {
        "full_article": "English serves India well in diplomacy & beyond\nOn a Sept night in 1983, the world almost came to an end. At a Soviet monitoring station 100km from Moscow, supercomputers flashed warnings about five incoming US ICBMs. It was a false alarm triggered by satellites misinterpreting reflected sunlight as missile flashes. But one man, Stanislov Petrov, kept his head and prevented MAD – mutually assured destruction. That incident, more than anything else, shows the dangers of misunderstandings.\nWhile Petrov was up against code, misunderstandings can arise even among same-language speakers, as happened at the battle of Imjin River near Seoul in 1951. British Brigadier Tom Brodie reported, “Things are a bit sticky, sir.” His American superior, Gen Robert H Soule, thought it was nothing serious and didn’t send reinforcements. Over 500 of the 600 British troops were captured.\nNew Diplomacy | It’s to avoid misunderstandings of any kind that India has formed delegations of experienced and articulate leaders from all parties for its post-Op Sindoor global outreach – GOI is earnest about this. The intent is to draw global attention to Pak-sponsored terrorism, and the first of these meetings happened in Japan and UAE on Thursday. Altogether 33 countries will be covered. After a display of India’s new security doctrine, this is a glimpse of its new diplomacy.\nRight Words | On a whirlwind tour of this magnitude, it’s important to get the messaging right the first time. That’s where the experience of delegates counts. What counts no less is the language employed. It has to be one with the least chance of being misunderstood globally. And while some Indian leaders will publicly disagree, everybody knows only English has that capacity – we must be earnest about promoting English. Modi himself switched to English in Madhubani, when he declared India’s intent to punish the perpetrators of Pahalgam.\nLingua Franca | There’s no disputing English’s paramountcy. True, within Europe, it’s only the sixth most common native language behind Russian, German, French, Turkish and Italian. Globally, it has 380mn native speakers – only 35mn more than Hindi. But 1.5bn people speak English worldwide, more than any other language. That means 1.1bn have made an effort to learn it as a second or third language. No other language comes close. Why? Because English’s so useful. It’s an official language in at least 55 countries; second placed French only in 29. It’s the lingua franca of diplomacy and business.\nSoft Power | But English’s soft power extends beyond its speakers. At the recently concluded Eurovision, Austria’s JJ won with an English song, Wasted Love. In the first 63 years of the contest, English songs won 46% of the time although a Briton has won only five times. Countries like Netherlands and Germany have very high English proficiency scores for a reason.\nTime For Inglish | Per the 2011 Census, over 10% of Indians spoke English. Even if the percentage hasn’t increased, that’s 140mn English speakers – twice the British population. It’s a strength we need to recognise, be proud of, and build further. By becoming a nation of confident English speakers, we won’t become any less Indian, just as English-speaking Germans aren’t less German. Language learning is not a zero-sum game. There’s much to gain by learning English, and nothing to lose.\n\n",
        "headline_1": "The importance of being earnest",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-importance-of-being-earnest/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-05-2025"
    },
    {
        "full_article": "After years of criticism and chronic inefficiencies, the authorities finally seem poised to restructure the social safety net system in the FY2025-26 budget expected to be unveiled in early June, as per a report by this daily. We welcome this shift, as it shows some intent to address long-standing concerns about the system's inflated numbers, overlapping schemes, and misdirected allocations. But good intentions alone are not enough. The redesign must result in a more targeted and impactful intervention that genuinely supports the poor.\nAccording to finance ministry officials, the number of schemes under the social safety net will be trimmed from 140 to fewer than 100, while 38 programmes will be grouped as \"pro-poor\" targeting the most vulnerable. The total allocation is expected to be Tk 95,908 crore—up from Tk 90,468 crore in the current budget—covering an additional 10 lakh beneficiaries. Small increases in monthly allowances are also expected across key cash assistance programmes like allowances for old age, the widow, deserted and destitute women, the physically challenged, mother and child benefits, etc. While these increases seem modest at the individual level, the real challenge lies in ensuring proper selection and enforcement so that any assistance reaches the most deserved beneficiaries.\nFor too long, our social safety net system has been weighed down by misclassification, corruption, and inefficiency. As we highlighted on various occasions in the past, especially during the tenure of the ousted Awami League government, the inclusion of retirement benefits and interest payments on savings certificates in the social safety budget inflated its total allocation, creating a misleading picture of state commitments to the poor. These expenditures accounted for 30 percent of the total allocation for FY2023-24, as per an assessment by CPD last year. The think tank also assessed that the share of \"compatible\" programmes under the social safety net bracket declined from 62.2 percent in FY2009-10 to 29.2 percent in FY2023-24.\nThe planned restructuring, therefore, must reverse this state of affairs. Merely shaving off irrelevant schemes is not enough. What we need is a fundamental restructuring of how these programmes are designed and implemented. Beneficiary selection must be transparent, data-driven, and insulated from political interference. Leakages must be plugged through digitisation and stronger oversight. And above all, allocations must be large enough to actually support families and individuals facing economic hardship.\nWith the FY2026 budget around the corner, the government has an opportunity to make the system fit for purpose as a support structure for the vulnerable segments, with the goal of making them eventually self-reliant. Only then can the safety net serve its purpose of poverty alleviation. To that end, we urge the government to consult experts and build on previous research, including the findings of its own taskforce submitted in January, before finalising reform decisions.\n",
        "headline_1": "Overhaul the social safety net for real impact",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/overhaul-the-social-safety-net-real-impact-3902401",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-05-2025"
    },
    {
        "full_article": "In the heart of Bangladesh's rural belt, a silent revolution is underway. While global leaders debate climate action, 1.65 crore Bangladeshi farm households are already battling its impact in the forms of flash floods, prolonged droughts, salinisation, and invasive pests. Between 2000 and 2023, climate-related disasters caused over Tk 1,200 crore in agricultural losses. Yet, amid this turmoil, farmers are pioneering grassroots solutions: floating gardens in flood-prone haors; drought-resistant crops in Rajshahi; and saline-tolerant rice in coastal Satkhira. These innovations—low-cost, climate-smart, and scalable—are quietly transforming survival into resilience. Farmlands in this country are becoming global classrooms for adaptation in a warming world.\nClimate volatility has transformed Bangladesh from a fertile delta to a battleground for survival. According to the World Bank'sGroundswell Report (2021), nearly 1.33 crore Bangladeshis may be displaced by climate-induced stress by 2050, most of them in rural areas. Agriculture, which employs over 40 percent of the workforce and contributes 11.2 percent to GDP (BBS, 2023), bears the brunt.\nCyclones Sidr (2007), Aila (2009), and Amphan (2020) alone caused combined agricultural losses exceeding Tk 150 crore. Salinity intrusion, now affecting over 10 lakh hectares in the coastal belt (Soil Resource Development Institute, 2022), is pushing farmers out of traditional rice production. In the northwestern Barind Tract, rainfall variability has reduced monsoon intensity, undermining rainfed farming.\n\nEven more troubling is the collapse of seasonal predictability. Crop calendars that once guided sowing and harvesting have become irrelevant now, making traditional farming knowledge less reliable with each passing year.\nYet, this is not a tale of despair; it is one of ingenuity. Across Bangladesh, farmers are transforming adversity into opportunity through grassroots innovations. In Satkhira, Rahima Begum, once unable to grow rice due to salinity, now cultivates BRRI Dhan67, a salt-tolerant rice variety developed by the Bangladesh Rice Research Institute (BRRI). This variety tolerates up to eight dS/m salinity and yields 4.5 tonnes per hectare, a lifeline for over 250,000 coastal farmers (BRRI Annual Report, 2022).\nIn haor (wetland) areas of Kishoreganj and Sunamganj, floating agriculture is making a comeback. Revived with modern composting techniques, these bamboo-based dhap platforms, first documented in the 17th century, are enabling year-round vegetable cultivation on floodwaters. A pilot project by FAO in 2021 found that floating gardens increased household nutrition scores by 35 percent and provided women-led income streams.\nIn the dry zones of Rajshahi, alternate wetting and drying (AWD) methods, promoted by the International Rice Research Institute (IRRI), are helping conserve water by 25-30 percent while maintaining yield. In these drought-prone areas, where groundwater tables are falling by three to four centimetres annually (Barind Multipurpose Development Authority, 2023), AWD adoption is a game changer.\nSimilarly, farmers are switching to short-duration varieties like BINA Dhan-7 and BINA Dhan-17, which mature in 100-105 days, helping them harvest before floods. Integrated Pest Management (IPM), using pheromone traps and biopesticides, is reducing pesticide costs by 40 percent in pilot districts like Jashore and Natore (Department of Agricultural Extension, 2022).\nWomen play a critical but under-recognised role in climate adaptation. According to a 2024 study by the International Food Policy Research Institute (IFPRI), farms managed or co-managed by women in Bangladesh show 28 percent more crop diversity and 20 percent higher adoption of adaptive techniques.\nIn Khulna, Fatema Khatun and her group of 35 women farmers transitioned to saline-tolerant vegetables and crab-fattening units. In the north, women-led nurseries and vermicomposting units are diversifying household incomes and ensuring seed availability at local levels. These initiatives often outperform top-down interventions due to their contextual knowledge and community trust.\n\nHowever, access barriers persist. Only 3.5 percent of women own agricultural land (BBS Gender Statistics, 2023), and fewer than 10 percent receive formal agricultural training. Addressing these gaps is essential to unlocking their full potential in climate resilience.\nWhat Bangladesh's farmers are pioneering are not isolated tactics; they are scalable, cost-effective models for climate adaptation. Floating farms, saline-resistant crops, and community-based irrigation are being studied by global platforms like the CGIAR Initiative on Climate Resilience and FAO's Scaling-Up Agroecology Initiative.\nThe IPCC Sixth Assessment Report 2022 cites Bangladesh's adaptive agricultural strategies as case studies in successful local adaptation. These strategies align with principles of agroecology, ecosystem-based adaptation, and low-emission development, all vital for meeting the Paris Agreement targets.\nBangladesh's updated National Adaptation Plan (NAP 2023-2050) recognises these innovations, calling for Tk 850 crore in investments in climate-resilient agriculture, research, and early warning systems. The roadmap exists. What's needed now is execution.\nThree priority areas demand immediate action. First, climate finance must reach the grassroots, yet as of 2023, only eight percent of international climate funds in Bangladesh reached local communities, according to Climate Finance Transparency Initiative. Second, gender-responsive investments are critical: women farmers must gain access to land rights, finance, and training to scale their contributions. Finally, research and extension services need urgent revitalisation. Institutions like BRRI, Bangladesh Institute of Nuclear Agriculture (BINA), and Department of Agricultural Extension (DAE) require consistent investment to develop and deliver climate-smart technologies that can safeguard livelihoods and secure future harvests.\nAs the world waits for COP30 in November, Bangladesh offers not just dire warnings but grounded wisdom. Its farmers, living on the frontlines of climate disruption, are pioneering solutions that are shaping a new blueprint for survival. These innovations are not theories from labs, but tested tools from the soil: resilient, scalable, and deeply rooted in lived reality.\nThis is not a story of despair but of determination. Adaptation is already happening in fields, not forums. But to grow this momentum, global leaders must act where it matters most. Because the future of climate resilience won't be built in air-conditioned halls; it will be grown, seed by seed, in fields.\nDr Shahrina Akhtar is specialist (technical) and research adviser at Krishi Gobeshona Foundation. She can be reached at [email protected].\n\nViews expressed in this article are the authors' own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Our farmers are leading the fight against climate change",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/our-farmers-are-leading-the-fight-against-climate-change-3902056",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-05-2025"
    },
    {
        "full_article": "Corporal punishment still remains the most common and socially accepted form of violence against children. According to UNICEF, 1.6 billion children (two in three) regularly face violent punishment at home worldwide; more than two-thirds are subjected to both physical punishment and psychological aggression.\nIn Bangladesh, the situation is alarming. The 2019 Multiple Indicator Cluster Survey, conducted jointly by the Bangladesh Bureau of Statistics and UNICEF, found that 88.8 percent of children aged 1-14 had experienced physical punishment in the month prior to the survey. Moreover, 35 percent of parents/caregivers believed that punishing children is necessary. While the Ministry of Education issued a circular in 2011 banning corporal punishment in educational institutions, children continue to face beatings and humiliation from teachers. Punishment also occurs at home, in institutions, and in workplaces.\nCorporal punishment comprises any punishment in which physical force is used and intended to cause some degree of pain or discomfort, however light, as well as other non-physical forms of punishment that are also cruel and degrading. Corporal punishment violates children's human dignity and physical integrity, and is a blatant violation of their rights under the United Nations Convention on the Rights of the Child.\nThe widespread social acceptance of corporal punishment reveals how violence has become normalised in child-rearing. It reinforces children's subordinate status and paves the way for other forms of abuse. A 2021 report by the Global Partnership to End Violence Against Children reviewed over 300 studies linking punishment to a host of adverse outcomes. Not a single study identified any benefits.\nDaily acts of punishment cause thousands of injuries and deaths among children each year. Corporal punishment has been linked to numerous negative consequences, including harm to children's physical and mental health, lower cognitive development and academic achievement, and it also contributes to school drop-out. Children who experience violent discipline are more likely to exhibit aggressive or bullying behaviour and may engage in criminal or anti-social behaviour later in life. Experiencing corporal punishment makes children sad, and it affects parent-child relationships.\nChildren place immense trust in their parents and teachers. When those in positions of trust resort to punishment, children begin to normalise violence in close relationships. This can lead to a cycle in which they grow up to either perpetrate or tolerate violence themselves. Without ending the practice of punishing children, we cannot hope to break the broader cycle of violence in society.\nAround 40 years ago, Sweden and Finland had laws banning corporal punishment of children. Today, 68 countries have enacted laws to prohibit it in all settings—home, school, childcare centres, and institutions—to uphold children's rights and protect their dignity. Bangladesh is not yet on this list.\nIn my work on child rights across diverse contexts—including in Bangladesh, Papua New Guinea, and Liberia—I have repeatedly seen how efforts to legally prohibit corporal punishment are often met with resistance. Many parents, teachers, community leaders, and policymakers argue that physical discipline is part of long-standing cultural practices. But no tradition, however deeply rooted, can justify the infliction of harm on a child. Some keep making excuses that parents and teachers are under stress, and that is why they punish children. In many cases, parents and teachers do need more support, but that does not mean hitting or humiliating a child is justified. We never justify hitting an adult when we are stressed out. Why do we vent our frustrations on children?\nMany parents and teachers in Bangladesh mistakenly believe that punishment helps children behave better. When adults hit or scold children in the name of teaching, the latter often learn only to avoid punishment, not to understand or internalise appropriate behaviour. This often leads to repetition of the same actions. Rather than resorting to punishment, parents should provide age-appropriate guidance rooted in care and compassion. This approach supports children's learning and development in meaningful ways. Educators, too, should adopt positive discipline strategies in their interactions with students.\nPeople often stay silent even when witnessing a child being punished in public places, as it is socially accepted in Bangladesh. On social media, some parents even joke about punishing their children. People who are otherwise vocal about justice and human rights often remain indifferent when it comes to violence against children. Isn't this a serious contradiction?\nHowever, legal reforms around the world have shown promise. Countries such as Sweden, Finland, Germany, New Zealand, Poland, and Romania have all seen a decline in public acceptance of corporal punishment following legislative action. The evidence is clear: we can shift societal attitudes and individual behaviours by enacting laws, promoting positive parenting, changing social norms, and ending violent discipline in schools.\nChildren have the same right as adults to be protected by law from violence. And this includes protection from violent punishment. In 2015, the world made a commitment to end violence against children by 2030. Every country signed up to SDG target 16.2, pledging to end exploitation, trafficking, torture, and all forms of violence against children.\nWe need urgent steps to fulfil this promise by 2030. Ending corporal punishment is essential in creating peaceful societies. In Bangladesh, it is vital to enact a new law that bans corporal punishment of children in all settings, including homes, schools, workplaces, and childcare institutions; to support the law through policies, programmes, and public awareness campaigns, and ensure its implementation is effectively monitored; to enforce and monitor the Ministry of Education's directive banning corporal punishment in educational institutions; to strengthen the capacity of parents and teachers to raise and guide children without using punishment; to include SDG indicator 16.2.1 at the national level to track progress; and to respect children's opinions and ensure their voices are heard in efforts to eliminate punishment.\nWhen people and policymakers are discussing the reform agenda in various sectors, are we considering the legal reform required to ensure children are protected from violence? Are we ready to be child-sensitive and bring changes in our attitudes and behaviours towards them to ensure their growth and realise their full potential?\nLaila Khondkar is an international development worker.\n\nViews expressed in this article are the authors' own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "We must end corporal punishment of children",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/we-must-end-corporal-punishment-children-3902031",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-05-2025"
    },
    {
        "full_article": "We are concerned about the rising incidents of bird strikes at Dhaka's Hazrat Shahjalal International Airport (HSIA) that have often resulted in flight cancellations, aircraft damage, and even crash landings. On May 20, a Turkish Airlines flight was forced to make an emergency landing after a bird strike ignited its second engine shortly after takeoff. Thankfully, all 11 crew members and 280 passengers aboard the Istanbul-bound flight remained unharmed. Reportedly, the dense bushes in the airport area are good habitats for grasshoppers and butterflies, which attract different types of birds. The presence of waste collection centres and landfills near the airport also attracts birds, particularly black kites, posing significant risks to flight safety.\nUnfortunately, while flight safety officials from various airlines have called on the authorities to take proper action to address the threat, the latter have been unable to do so effectively. Bird strikes are a common phenomenon at airports around the world, but HSIA seems particularly prone to it. In 2023, a Biman Bangladesh Airlines flight on the Dhaka-Bangkok route had to abandon takeoff after a bird strike caused one of its tyres to burst. The same year, a Fly Dubai flight aborted takeoff after a bird strike on its left engine damaged three propeller blades.\n\nSuch incidents continue to happen. According to a research paper presented at a recent workshop, 10 major bird strike incidents occurred at HSIA between May 2023 and May 2024. International Air Transport Association data shows that from January 2023 to October 2024, HSIA recorded 1.73 bird strikes per 1,000 flights, compared to just 0.5 at other international airports.\nSuch incidents continue to happen. According to a research paper presented at a recent workshop, 10 major bird strike incidents occurred at HSIA between May 2023 and May 2024. International Air Transport Association data shows that from January 2023 to October 2024, HSIA recorded 1.73 bird strikes per 1,000 flights, compared to just 0.5 at other international airports. The situation is clearly concerning, and must be addressed before a major accident occurs.\nWe urge the authorities to take all necessary measures to deter birds in and around the airport. Airports across the globe use both modern and conventional technologies to drive birds away from key aviation installations. Our airport authorities must learn from their experiences. Reportedly, HSIA has two bird shooters and some equipment—machines that emit certain frequencies to deter birds, as well as gas cannons—which should be properly utilised. Most importantly, the hundreds of open garbage spots surrounding the airport must be removed. Airport authorities must coordinate with relevant agencies to encourage birds to seek alternative nesting and feeding grounds to ensure flight safety.\n",
        "headline_1": "CAAB must prevent bird strikes to ensure flight safety",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/caab-must-prevent-bird-strikes-ensure-flight-safety-3900631",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 25, 2025 00:00:00  \nIt is encouraging for the economy that the first week following Bangladesh's transition to a market-driven floating currency rate went by without major instability. The taka traded at 122-123 against the dollar in the banking sector, a rate much in line with pre-transition levels. This indicates that the currency was not severely misaligned and that the timing of the transition was reasonable. Unlike the volatile experiences of other emerging economies where official and market rates diverged sharply when they transitioned, Bangladesh appears to have avoided significant initial disruption. While the move to embrace the floating regime may have been partly influenced by the need to meet IMF conditions for loan disbursements, the smooth adjustment confirms the practicality of the decision.\nA floating currency rate, while offering flexibility, is not without its share of challenges and remains susceptible to market manipulation. Bangladesh Bank Governor Dr. Ahsan H. Mansur's recent warning against dollar hoarding at a roundtable discussion identifies this critical vulnerability, as deliberate withholding of foreign currency by aggregators could artificially inflate prices and disrupt market equilibrium. Such practices threaten to erode confidence in the new system as well. The Governor has also appealed to expatriate workers to refrain from delaying remittances in anticipation of further depreciation. Remittances serve as a lifeline for the economy and their steady flow is essential to maintaining exchange rate stability. For the floating system to work, all stakeholders including banks, financial institutions and individuals must resist short-term opportunism in favour of long-term macroeconomic stability.\nAlthough the exchange rate is now officially governed by market forces, its sustainability is compromised by the country's inadequate foreign currency reserves. The current reserves of around $25 billion, though slightly improved from previous lows, are still insufficient to inspire durable market confidence. It is worth recalling that as recently as August 2021, the foreign exchange reserves stood at $48 billion, a figure that demonstrates both the capacity to accumulate reserves and the dramatic erosion that has occurred since. A realistic and strategic target should be to raise the existing reserves to $50 billion, a level that would provide over six months of import cover and serve as a buffer against external shocks such as global commodity price surges or supply chain disruptions. More importantly, it would give Bangladesh Bank the room to manage temporary volatility without having to fall back on restrictive interventions. A sizable reserve is what transforms a floating regime from an aspiration into a stable functioning system. However, building these reserves cannot happen automatically and requires deliberate policy actions. For example, this will require boosting remittances through official channels and ensuring timely repatriation of export earnings, among other measures. \nBangladesh's adoption of a floating exchange rate is undoubtedly a progressive step, a move that, from the standpoint of economic rationality, was bound to happen at some point. Given the current international conditions with declining fuel prices and falling costs of key commodities, the timing appears favourable. While the current reserve position is less than ideal, strong remittance inflows since August 2023 offer a foundation to build upon. This momentum must be maintained through consistent policy support. Moving forward, Bangladesh Bank should intervene only when absolutely necessary, such as natural disasters or large, unanticipated financial shocks. Furthermore, ensuring strong coordination between monetary and fiscal policies will be crucial to mitigating exchange rate risks. If managed prudently, this new chapter in Bangladesh's economic policy could mark a turning point toward greater economic stability and sustainable growth.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Smooth start for floating rate",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/smooth-start-for-floating-rate-1748099463",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       May 25, 2025 00:00:00  \nDespite persistent efforts, bilateral trade does not always take place smoothly as barriers to trade increase or emerge in new forms for various reasons. Geo-political tension casts a shadow on trade relations disrupting trade. The bilateral dispute also makes things bad, leading to restrictions on trade. The cost of trade disruption or restriction is usually high for both partners. It is, however, higher for countries that used to face trade imbalances. It is also not always easy to remove the restrictions or recover from the disruptions through negotiations, mainly when trade barriers originate in the geo-political dispute. The latest round of Bangladesh-India bilateral trade tension or dispute needs to be reviewed in this perspective. \nLast week, India imposed restrictions on imports of certain products from Bangladesh, mainly to the north-eastern states of India through land routes. Under the newly issued order by the Indian government, import of readymade garments (RMG) from Bangladesh will be allowed to enter India only using the country's Nhava Sheva port in Mumbai (western India) and Kolkata port in West Bengal (eastern India). It means, from now on Bangladeshi RMG exporters cannot use any land port to send their consignments to any part of India.\nThe order, issued by the Directorate General of Foreign Trade (DGFT), also bars the imports of fruits, fruit-flavoured beverages, soft drinks, processed foods, plastic products, yarn, yarn byproducts, and furniture from Bangladesh to the Indian states of Assam, Meghalaya, Tripura, and Mizoram via any land port or land customs station of these states. The restriction also applies to Changrabandha and Fulbari customs stations in West Bengal. So, suppose Bangladeshi manufacturers want to export the items mentioned above to north-east India. In that case, they must send it via Beanpole land port or any other land port or customs station situated on the western border adjoining West Bengal. \nOnly one (Teknaf) of Bangladesh's two dozen land ports and customs stations is on the Myanmar border; all others are on the Indian border. The DGFT order, however, does not restrict Bangladeshi exports to Nepal and Bhutan transiting through Indian territory. \nThe recent decision to limit the entry points of Bangladeshi products is a significant bilateral non-tariff barrier (NTB) imposed by India. The Global Trade Research Initiative (GTRI), based in New Delhi, estimated that India has restricted 42 per cent of imports from Bangladesh, affecting over $770 million worth of goods. While India does not outright ban or impose wholesale restrictions on the imports of the above-mentioned goods from Bangladesh, the requirement to use only limited points and long routes significantly increases the cost of exporting to India from Bangladesh. \nIt is clear that the NTBs will have a significant negative impact on Bangladesh's export earnings if the barrier persists. The exports will be affected negatively in two ways, potentially leading to a substantial economic loss. \nFirst, readymade garments (RMG) exports to India will also face a serious setback as around two-thirds of the exports were shipped through various land ports. Around 500 industrial units of Bangladesh exported RMG worth $555.7 million to India in FY24, many of which are small and medium enterprises (SMEs). The SMEs will be unable to bear the high shipment cost via sea ports.\n\nSecondly, Bangladesh is at risk of losing a dedicated market that has developed over the decades in the north-eastern states of India. Most of the exporters are SMEs, and it will not be feasible for them to supply the products crossing over a thousand extra miles. The Indian imports based in the northeast, the so-called seven sisters, will also not be interested in paying a high price to cover the additional cost. This potential loss is a cause for concern. \nThough India's imposition of these NTBs is fuelled by a number of factors, as mentioned by many, including Indian media, the core thing lies behind the ouster of the Hasina regime August last. The fall of the Hasina regime, strongly backed by New Delhi over the years, was a big upset for the Indian establishment. The anti-discrimination movement, launched by students, turned into a mass uprising against the oppressive regime of Hasina. To curb the rebellion, the fallen regime resorted to brutal force, killing 1,400 people in less than three weeks. More than 20,000 people were injured also. Nevertheless, Hasian was forced to resign on August 5 last year and flee to New Delhi for shelter. \nSince then, India has yet to fully recognise the changed reality in Bangladesh, which is reflected in a series of moves and steps taken by the Indians and also intensified anti-India sentiment in Bangladesh. To put pressure on the Yunus-led interim government in Bangladesh, which the Modi regime branded as friendly towards Pakistan and China, it (India) has also started to use trade-related tools. Last month, India cancelled the transhipment facility given to Bangladesh for third-country export using the Indian sea and airports. As an apparent counter-move, Bangladesh banned yarn imports through the Benapole, Bhomra, Banglabandha, Burimari, and Sonamasjid land ports. Thus, yarn from India can now be imported through seaports. As India has been supplying around 80 per cent of Bangladesh's annual demand for yarn for the export-oriented garment industries, the restriction makes the import time-consuming and costly. \nThis scribe in this column last month noted: \"Equipped with a number of tools in hand to make the international trade of Bangladesh costlier, New Delhi is better positioned to exert pressure on the Yunus-led government further. So, it is not unlikely that Bangladesh will face more trade restrictions from India in the coming days.\" (Rising risk of Indo-Bangla trade retaliations: The Financial Express, April 20, 2025). The latest move by India shows that things are going in the predicted direction. \nUsing trade as a weapon to exert pressure on other countries to express discontent or anger is not unique to India. For India, it is also not a new thing. Around six years ago, India imposed a ban on imports of palm oil from Malaysia after Kuala Lumpur had criticised New Delhi's oppressive move against Kashmir and Indian Muslims. At that time, India also increased imports from Indonesia. Although the dispute was resolved later, India found that through trade restrictions, it could effectively manoeuvre its geo-political interest. \nSo, will the latest trade restrictions be effective in putting pressure on Bangladesh? There is no simple answer despite the fact that the direct impact of the NTBs is costly for Bangladesh. Moreover, bilateral relation may deteriorate further which will be also troubling for both the countries in the long run. Reviving the effort to minimise the trade restrictions is thus necessary no matter how difficult it is.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "India weaponising trade against Bangladesh",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/india-weaponising-trade-against-bangladesh-1748099545",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       May 25, 2025 00:00:00  \nArticle 17 of the Constitution of Bangladesh mandates that the state shall establish a uniform, mass-oriented, and universal system of education, providing free and compulsory education to all children up to a level determined by law. The Primary Education (Compulsory) Act of 1990 makes education up to Class V both free and mandatory, while the National Education Policy 2010 extends this mandate up to Class VIII. In reality, however, education in Bangladesh is becoming increasingly costly-both financially and socially.\nAccording to the Annual Primary School Census (APSC) 2023, approximately 19.7 million children are enrolled in primary education across the country. Of these, nearly 11 million attend government-run institutions. The remaining 44 per cent study in private institutions, kindergartens, and madrasas-where education comes at a price. Despite constitutional and legal commitments, the state's provision of free education remains insufficient and, for many, unattractive-especially in urban centers.\nDhaka paints a particularly troubling picture. Only 19.6 per cent of primary-level students in the capital are enrolled in government schools. This means that over 80 per cent of children in Dhaka are receiving their primary education from private institutions.\nWhy is education-promised to be free and universal-becoming increasingly expensive? The answer lies in the inadequacy and declining performance of government schools, which has paved the way for the unchecked expansion of private institutions.\nGovernment primary schools in Dhaka largely serve children from the poorest families-those who have no other options. These schools often lack even the most basic amenities: clean drinking water, functional toilets, adequate classrooms, and sufficient staff. Many classrooms are overcrowded and poorly lit. Some school premises have even been illegally occupied by powerful local actors. This is more than administrative failure-it is a violation of children's constitutional rights.\nLet us confront an uncomfortable truth: if government primary schools served the children of the upper and middle classes, would their conditions be allowed to deteriorate? Certainly not. If the children of influential families attended these schools, the government would rush to upgrade facilities, appoint quality staff, and implement real reform. But because these schools primarily serve disadvantaged communities, their dismal condition has become both politically and socially tolerated.\nAs a result, more and more parents are turning to private schools in the hope of securing better future for their children. Access to quality education-a right enshrined in the Constitution-is increasingly being determined by wealth. With soaring tuition fees, the rising cost of textbooks and school supplies, and an ever-growing reliance on private coaching, quality education is becoming a luxury many families can no longer afford.\nThis has led to a disturbing trend: a child's access to education is now dictated more by the financial status of their parents than by the child's potential or merit. When poverty becomes a barrier to education, it entrenches cycles of disadvantage and denies generations of children the chance to improve their socio-economic standing. This not only deepens inequality but also undermines national progress. Ensuring equal access to quality education is essential for building an equitable, inclusive, and prosperous Bangladesh.\nTo change course, bold and decisive action is needed-starting with Dhaka. At least one well-equipped model government school should be established in each ward of the city. These schools should have better infrastructure and facilities, employ qualified and motivated teachers, and offer a modern, engaging curriculum. Once these schools begin producing strong academic results, they will help restore public confidence in government education and encourage greater enrollment. It would offer great relief to low- and middle-income families who are struggling with the rising costs of private schooling.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Free primary education:  a false promise?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/free-primary-education-a-false-promise-1748099597",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 25, 2025 00:00:00  \n\nAs a country with many rivers, Bangladesh relies heavily on its waterways for transportation. In many cases, passengers find travelling by launch more comfortable than by bus or train. However, this sense of comfort often comes with a host of irregularities and challenges.\nWhile short-distance trips tend to be relatively hassle-free, passengers travelling longer routes-such as to Barishal or Bhola-frequently face serious difficulties. During these extended journeys, passengers often have no choice but to buy food from the canteens and shops inside the launches. This is where the problems begin. Most canteens serve unhygienic food, which can lead to illnesses such as diarrhoea, dysentery, typhoid, ulcers, heart disease, and hepatitis. Passengers often fall ill mid-journey, far from medical help, placing them in a dangerous and uncomfortable situation.\nIn addition to the poor quality of food, many onboard shops sell date-expired products. I personally experienced this. After purchasing a packet of biscuits from a shop on a launch, I discovered in my cabin that it had expired six months earlier. Unfortunately, selling such expired and unsafe food has become commonplace.\nWhen passengers attempt to protest, they often face intimidation from organised syndicates operating within the system. This is deeply troubling, especially considering that the right to food is one of the five fundamental rights of every citizen. Ensuring access to safe food is an essential part of that right. While food is necessary for survival, safe food is even more critical, as health and nutrition go hand in hand. Sustainable living and good health are impossible without access to safe and nutritious food. Unhygienic food remains a major threat to public health.\nIn light of this alarming reality, I believe it is imperative for relevant authorities to take strict and proactive measures. Regular monitoring and enforcement, coupled with responsible behaviour from passengers, are essential steps towards ensuring food safety on launches.\nHasan Mahmud Shuvo\nMBBS student\nInternational Medical College Hospital, Gazipur\nhasanmahamudshovo9005@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "A hidden health crisis for river travellers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/a-hidden-health-crisis-for-river-travellers-1748099609",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-05-2025"
    }
]