[
    {
        "full_article": "The pharmacy of the global South is facing a crisis of reputation. After cough syrups made by pharmaceutical companies based in India, which had unacceptable amounts of diethylene glycol and/or ethylene glycol, killed 66 children in the Gambia, 65 children in Uzbekistan in 2022, and 12 children in Cameroon in 2023, and India-made eye drops contaminated by drug-resistant bacteria killed three persons and blinded eight in the U.S., again in 2023, the spotlight is back on Indian drug companies for all the wrong reasons. A BBC Eye investigation has brought to light the criminal actions of Aveo Pharmaceuticals, a Maharashtra-based company, which was manufacturing and exporting unapproved, highly addictive opioid drug combinations to West Africa. The “medicines” contain tapentadol, a powerful opioid, and carisoprodol, a highly addictive muscle relaxant. While the Indian drug regulator has approved tapentadol and carisoprodol as standalone drugs, the combination has no clearance. Even if the company’s claim that the drug combination has been approved by the State drug authority turns out to be correct, it is still illegal as only the Central Drugs Standard Control Organization (CDSCO) can approve any novel fixed dose combination (FDC) drugs for safety and efficacy. It is only after this approval that State drug authorities can issue a manufacturing licence. The Health Ministry routinely banning FDCs is only because the State drug authorities ignore this provision in the law with impunity.India questioned and denied the World Health Organization’s report about the lethal cough syrup sent to Gambia, but in the latest case, CDSCO and the State regulatory authority swung into action even in the absence of any complaint by West African countries. The reason: the BBC investigation’s irrefutable video evidence that the company was in the “business” of manufacturing and exporting the dangerous combination drug despite knowing the harmful effects. The seizure of nearly 13 million “medicines” and 26 batches of active pharmaceutical ingredients of tapentadol and carisoprodol are clinching evidence for taking criminal action against the company. While the moves by the authorities — to issue a ‘ stop activity’ order, withdraw the manufacturing licence and permission to export the drugs by any company, and a show cause notice — inspire some confidence, only stringent punishment can serve as a deterrent. Indian pharmaceutical companies are known in the global South for their high-quality generic drugs. It is for the drug regulator to ensure that India continues to be famous for this and not gain notoriety for producing and exporting deadly synthetic opioids as drugs. Manufacturing synthetic opioid drugs cannot be any pharmaceutical company’s “business”. Published - February 25, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        pharmaceutical\n                    \n                            /                      \n                        \n                        prescription drugs\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        health\n                    \n                            /                      \n                        \n                        African Union\n                    \n                            /                      \n                        \n                        crime\n                    \n                            /                      \n                        \n                        exports",
        "headline_1": "​Not business as usual: On upholding India’s reputation for quality  drugs",
        "headline_2": "India’s reputation for high-quality generic drugs should not be put at risk",
        "link": "https://www.thehindu.com/opinion/editorial/not-business-as-usual-on-upholding-indias-reputation-for-quality-drugs/article69258308.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "25-02-2025"
    },
    {
        "full_article": "When Germans went to vote on Sunday (February 23, 2025), in one of the most consequential elections in the country’s post-reunification history, there was little doubt about the outcome. The Olaf Scholz-led three-party coalition had collapsed months earlier and his centrist Social Democratic Party (SPD) was hugely unpopular. Germany, once hailed as a model country, was in its third year of economic contraction and the far-right Alternative for Germany (AfD), with neo-Nazi roots, was surging ahead with its anti-establishment and anti-immigrant campaign. In the results, the conservative Christian Democratic Union (CDU) and its Bavarian sister party, Christian Social Union, led by Friedrich Merz, emerged as the largest bloc, with 28.5% votes, while the AfD doubled its vote share to 20.8%. The Social Democrats got a 16.1% share, one of its worst performances since the 19th century, while the Greens won 11.6%. The left-wing Die Linke saw rising popularity, with 8.8% of the vote. Mr. Merz had asked voters for a strong mandate to fix Germany’s problems. While the CDU’s performance is weaker than expected, its strong lead puts it on the path toward power. He will now kick off a complicated process of coalition talks.Mr. Merz has already ruled out any alliance with the AfD, which would be allocated 152 seats. In the 630-member Bundestag, a coalition needs at least 316 seats to form a government. So, it is likely that Mr. Merz, whose bloc has 208 seats, would form a two-party coalition government with the Social Democrats, with its 120 seats. But government formation would be the least of his challenges. He must reboot a contracting economy, which has barely grown since the pre-COVID years, tackle the immigration problem, which was exploited by the far-right, and formulate foreign policy that addresses both the Ukraine war and Europe’s security challenges. As Germany joined western allies in imposing sanctions on Russia, it effectively lost access to cheap Russian gas. The country is today grappling with a deep recession and deindustrialisation. And as the crisis deepened, the German elites’ bid to weaken the AfD through a political ‘firewall’ ceased working. But Mr. Merz has the advantage of leading a new government on a new mandate. He should look at the U.S. reset with Russia to begin afresh rather than as an impediment to furthering the old policies that have backfired. His focus should be on bringing the Ukraine war to a quick and just end and rebuilding the economy. He should also drive a new, hard bargain with Russia for security and stability in Europe. Only a peaceful Europe can guarantee Germany’s continued rise as the continent’s economic and political engine. Published - February 25, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Germany\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        natural gas\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        economic sanction",
        "headline_1": "New direction: On the German poll results, Russia relations",
        "headline_2": "Germany needs to talk to Russia to drive a hard bargain for Europe",
        "link": "https://www.thehindu.com/opinion/editorial/new-direction-on-the-german-poll-results-russia-relations/article69258324.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "25-02-2025"
    },
    {
        "full_article": "Poll results in Western countries hold lessons for politicians everywhere, including India\nGerman voters didn’t surprise in Sunday’s election. Since no party has a clear majority, long coalition talks lie ahead, but far-right AfD will remain out of govt even though it has over a fifth of the vote, exactly double its 2021 share. When the far-right or a Trump-like leader surges, it means voters are hurting. And Germany’s economic troubles are well-known. After shrinking for two straight years, the economy is back at its 2019 level. Low unemployment and moderate fiscal deficit are virtues ordinarily, but not when voters wake up feeling poorer every day. And voter pessimism certainly isn’t conducive to re-election – ask Kamala Harris and Rishi Sunak.\nSunak called an early election counting on British economy’s unexpected growth last year. Inflation was cooling finally, so were interest rates. But as far as voters were concerned, prices were about 20% too high and their EMIs had ballooned. A survey found only one in five Britons thought the economy was in good shape. The same popular mood ousted Democrats in US. Before the Nov election, about half of US voters said they were worse off than they had been at the end of Trump’s first term, even though inflation had slumped from 9% in 2022 to around 2% by late last year. China, despite its one-party dictatorship, is also worried about public mood. A survey by Harvard-Stanford academics in 2023 showed less than 30% of Chinese felt they were better off than they had been five years earlier – a huge fall from 75% in 2014. China’s trying everything to fire up the economy, with sub-5% growth predicted for 2025 and 2026.\nIt’s time Indian leaders also paid heed to the public mood. Their increasing reliance on doles and direct benefit transfers to win polls is bad economics, even if it wins polls in the short-term. As state after state, from Himachal to Punjab, Maharashtra and Karnataka, has realised, delivering freebies – whatever form it takes – and generous cash handouts is hard to maintain. Maharashtra’s 50% fare concession to women and senior citizens, for instance, is costing the state transport corporation Rs 3cr a day. Besides, doles don’t address voters’ need to feel better off over a longer period of time. A cash transfer generates a small amount of feel-good. It doesn’t buy economic security. Only rapid economic growth plus good jobs can deliver that.\n\n",
        "headline_1": "Ballot points",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/ballot-points/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-02-2025"
    },
    {
        "full_article": "On keeping calm through a digital arrest\nIt started with an innocuous phone call and in no time I was face-to-face with a fearsome man on my laptop screen. “You are under digital arrest,” he said.\nNot one to run away from trouble, I collected my thoughts and replied that, not just me, everybody is under digital arrest. They have been for years. You talk to people, but they hem and haw, their eyes glued to their screens. Even young lovers sit together looking at their phones. Not just them, car drivers, traffic cops, walkers, sellers who should be looking out for customers, they are all under digital arrest. Nobody does a thing these days except that!\nThe man looked agitated. “You don’t understand. This is far more serious than you think.” Overcome by a wave of honesty, I admitted that I cannot go to sleep until I down two episodes of my ongoing series – neat, as in without a break or ads. The man shook his head and threw up his hands in the air. “You have no idea what you are talking about, and the trouble you are in,” he said.\nThen he reached out for a piece of paper and read out that I had laundered money on foreign trips. That made me think. It seems on my recent trip to London and its neighbouring cities, supported by my generous wife, I had been under his watch. Even though I had avoided the pubs and taverns, perhaps I had made some errors of judgement. I had admired a few houses, and clean, quiet neighbourhoods like St John’s Wood and Hampstead, but was that a crime? I had gambled a little at the pier and laid a few bets, so what? But I could be wrong. My knowledge of lawful actions could be outdated.\nAs he rattled off the gravity of my crime, I realised I had always been afraid of the authorities. Wasn’t I aware of what went on in police stations? Which ordinary citizen in their right minds would want to have anything to do with any govt department? I would be bankrupt, paying legal fees to rich lawyers, or be behind bars in this just and fair country.\nI paid up, and praised the govt. He said I was off the hook. Relieved, I at once switched on the TV to watch my favourite show and erase the memory of the arrest.\n\n",
        "headline_1": "Screen test",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/screen-test/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-02-2025"
    },
    {
        "full_article": "In many countries, people vote for their leaders, and recent elections show that voters are unhappy with their governments.\nIn Germany, no single party won enough votes to rule alone, so different parties must now work together. A far-right party, AfD, got a lot more votes than before but won’t be part of the government. Why? Because many Germans feel their economy isn’t doing well. Prices are high, and even though most people have jobs, they don’t feel richer.\nIn Britain, then Prime Minister Rishi Sunak called an early election because the economy had improved a little. But voters still felt that prices were too high and loans were expensive. Many thought the economy was in bad shape, so Sunak may lose.\nIn the United States, people removed Democrats from power in some places because they felt worse off financially than during Donald Trump’s time as president, even though inflation (rising prices) had slowed down.\nEven in China, where elections don’t happen like in democratic countries, the government is worried. Fewer people feel their lives are better than five years ago, so China is trying to boost its economy.\nWhat about India?\nIndian leaders should also listen to the people. Right now, many politicians give away free things (like cash and discounts) to win votes. But this can’t last forever. For example, in Maharashtra, giving women and senior citizens cheaper bus tickets costs ₹3 crore every day!\nInstead of short-term gifts, leaders should focus on making the economy grow fast and creating more jobs. That’s the only way people will feel truly secure about their future.\n\n",
        "headline_1": "What elections around the world teach us",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/what-elections-around-the-world-teach-us/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-02-2025"
    },
    {
        "full_article": "India’s weak drug regulation is spreading a problem from Africa to America. Reputational damage can be big\nIndia’s drug regulators have been caught napping once again. Various pills made by Maharashtra-based Aveo Pharmaceuticals have been linked to the opioid mayhem in Ghana, Nigeria and Côte d’Ivoire. But it took a BBC documentary for the state and central regulators to conduct a raid, then announce manufacturing and export curbs. These, however, hardly amount to the systemic overhaul that experts have been crying for, in the face of one regulatory fiasco after another. Remember that Indian cough syrups have also led to children’s deaths in Gambia, Uzbekistan and Cameroon. At this rate, the days when India actually earned vast goodwill in Africa, by saving lives with cheap generics against AIDS, will soon become a distant memory.\nThe opioid story also risks putting India directly in Trumpian crosshairs. US has found Indian companies trafficking precursor chemicals for fentanyl, which ultimately kills Americans and devastates their communities. On the Africa front, Indian authorities have often taken the position that importing countries need to toughen regulations. But Indian regulators themselves have been shown up as incompetent at best, and compromised at worst, by US FDA. Even keeping aside the ethics, or business effects, of exporting substandard, even dangerous, drugs, the idea that the domestic market can be firewalled from such doctoring, is silly.\nA Haridwar lab supplies govt hospitals antibiotics that turn out to be just talcum powder mixed with starch, patients fear buying medicines from any but trusted pharmacies, significant proportions of officially tested samples are found to be substandard, repeatedly. As for fentanyl, with China taking US complaints on this more seriously, drug mafia will have extra incentive to source illegal precursors from India. Weaker governance here won’t increase addiction in US alone. Proactive, as opposed to reactive, regulation, which needs better coordination between central and state agencies, is urgently needed to prevent fentanyl addiction from getting to Indians as well.\n\n",
        "headline_1": "Opioid warning",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/opioid-warning/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-02-2025"
    },
    {
        "full_article": "Tamam na sud or 'Not the end'! There could not have been a better ending of a captivating romantic novel like Shabnami. These three words at the end of the book ignite a plethora of emotions in the mind of the reader as they start to identify themselves as one of the two protagonists – Shabnam or Majnun and even start to imagine a sequel that will not end in a heart-wrenching tragedy. This way the readers embark on an ever-lasting journey with the book.\nSyed Mujtaba Ali did not venture into fiction writing much. Despite producing a huge body of work, he had only three novels to his name, Obissasyo (1955), Shabnam (1960) and Tulonaheena (1972). Of the three, Shabnam stands out to be the most powerful one in terms of its story outline, the building of the characters, the ending and the philosophical quest of the two protagonists—a feisty independent young Afghan woman and an erudite Bengali teacher teaching in Kabul.\n\nOn another count Shabnam can be seen as groundbreaking in Bangla literature. There are only a few Bangla novels written by men where women are cast as the central figures. Even though there were two protagonists in Shabnam, Ali did not hesitate to put Shabnam in the lead.\nThe love tragedy between Shabnam and Majnun unfolded in the backdrop of a tribal rebellion against the modernizing king Amanullah that set of an unimaginable degree of lawlessness and chaos in Afghanistan at the end of the 1920s. But that history did not encroach on the story unnecessarily; it came only as much it was needed. Mujtaba Ali himself lived through that turbulent time in Kabul and nearly died there starving.  His memoir of the period became his first book—Deshe Bidesheii (1948-49). There is an oblique reference to the book in Shabnam too.\nOn another count Shabnam can be seen as groundbreaking in Bangla literature. There are only a few Bangla novels written by men where women are cast as the central figures. Even though there were two protagonists in Shabnam, Ali did not hesitate to put Shabnam in the lead. Shabnam is poetry personified, as she is aware of Sufi mysticism. She is hopelessly in love with the 'foreigner' Majnun but she is not the demure damsel. She is the one who initiates the romantic liaison and then she takes it to the next level by visiting his home alone. Even when there was looting and lawlessness all around, she did not stop visiting him. She was ready to take a few lives to do that, \"I would have killed every devil. Any number—if needed. I held the revolver ready under the burka. If anyone stood in front, I would have shot him. No questions asked. I would have walked over their dead bodies to come to meet you.\"iii She is the one who kisses Majnun first and she decides to arrange an instant marriage with him fearing that the political pandemonium would linger. She floats in the clouds of poetry yet she expresses her strongest opinion on how to change the society, \"Is society a tiger or a lion that we have to confront it with pistols and guns? Society is like a spirited stallion. Feed it and then mount. If it misbehaves, poke it with the spike of your boots. Whip it if it becomes worse. When it becomes unmanageable, then use the pistol. Buy a new horse—create a new society.\"iv\nMy tryst with Shabnam started, long before I took up its translation, in the transition year of my teenage into adulthood. At that delicate age, one tends to expect a happy ending of such an intense love story that revolves around only two characters who engage in poetry, aesthetics and philosophy all through. As this unlikely love flowered breaking the barriers of culture and language when Afghanistan was hurtling towards anarchy. The tragic ending created such a sadness and hollowness in me as a reader that I could not read that book for another decade or so.\nI laid my hands on Shabnam for the first time possibly a year after I read Ali's magnum opus Deshe Bideshe, that established him as one of the most important and charismatic writers of Bangla literature in the second half of the twentieth century. So the backdrop of Shabnam was already known to me. I did not have to struggle to understand the social and political milieu against which Shabnam was written. But the reading of Deshe Bideshe before taking up Shabnam also raised a question: was that an autobiographical novel?\n\nThe story of Shabnam did not happen in Ali's life for sure but what if he had seen or heard about a love story where one of the lovers simply disappeared like Shabnam as my friend commented from his own life experience? I would say that was most likely the case. \nReaders of Deshe Bideshe and Shabnam would always find uncanny similarities between Ali himself and Majnun – the male protagonist he created. Like Ali, Majnun came to teach in Kabul from the district of Sylhet in East Bengal in undivided India. One of the central figures of Deshe Bideshe is Abdur Rahman – Ali's most trusted servant, his \"major domo, chef-de-cuisine and handyman – three in one\"v who apparently would \"do all the bidding for you, from polishing your shoes to killing your enemies\"vi. Abdur Rahman became \"my Harfan-Moula, my Jack of all trades\"vii. In Shabnam, Majnun's servant too is called Abdur Rahman who was undertaking similar tasks!\nIn Shabnam Ali created another trusted aide to Shabnam, Topol Khan who happened to be Abdur Rahman's cousin. These two, Abdur Rahman and Topol Khan, became the go between the two lovers and help them in their assignations. They also agreed to be the happy witnesses to their instant secret marriage in the house of Majnun while the city of Kabul was descending into a chaos.\nHence, the Bengali readers always speculated if Shabnam was actually an autobiographical novel. The readers liked to believe that Ali had a romantic liaison with an Afghan woman while living in Kabul between 1927 and 1929. But Ali did not leave any suggestions of such a relationship in any of his writing. If we take Deshe Bideshe as a true and authentic eye-witness account and a chronicle of a crucial juncture of modern Afghan history, then as readers, we are left with the only conclusion that Shabnam is indeed a work of pure fiction. Ali's nephew and former Bangladeshi senior diplomat, Syed Muazzem Ali told me that he had asked his uncle if someone akin to Shabnam ever existed during his time in Kabul. In his reply Ali had said, 'Nephew, try to stretch your imagination!' In relation to this speculation, Ali himself wrote in one of his pieces that during his stay in Kabul, his had regular interactions only with two women – one used to supply milk to his house and the other was the laundress and both were above sixty.\nAfter my translation of Shabnam came out in 2024, a close Afghan friend wrote the following to me after reading it, 'Finished the book but had an unstoppable feeling throughout that this had happened during my life time because so many people disappeared and never returned including two people in my extended family and many more known to me.' This comment by my friend suddenly sowed the seed of an idea in my mind about the genesis of the story of Shabnam.\nMost readers of Ali would know that he was a master at picking up nuggets of stories around him and finessing them as highly readable and outstanding tales that germinated from real-life experiences. Stories from Chacha Kahini, or other stories like Tuni Mem, Nona Pani, Nona Jol and many such pieces are testaments of this genre of his writing.\nThe story of Shabnam did not happen in Ali's life for sure but what if he had seen or heard about a love story where one of the lovers simply disappeared like Shabnam as my friend commented from his own life experience? I would say that was most likely the case.\nBy reading Deshe Bideshe, we know how deeply Ali bonded with the elite class in Kabul and even befriended many from a number of diplomatic missions. Some of these friends and their exploits found mentions in Deshe Bideshe. We even read how his Pashtun colleague-turned-friend Dost Muhammad simply left the city leaving a letter for him saying he had picked up the gun and was going to fight the bandit leader Bacha-e-Saqao on behalf of his king Amanullah. Ali never heard of him after that. Ali wrote about Dost Muhammad's charm and witticism, especially among the women in the diplomatic circles. So, could Dost Muhammad be one of the lovers who disappeared? Or any other person whom Ali got to know during his stay but never mentioned them in Deshe Bideshe? Such a possibility is highly likely.\nThere may be another lens through which Shabnam can be read. One could take it that Ali decided to tell the story of a country, that he fell in love with, through allegory. His fondness, deep empathy and endless love for Afghanistan was evident in every chapter of Deshe Bideshe and also in Shabnam. Could he have painted the picture of Afghanistan as Shabnam – a most beautiful woman (he repeatedly talked about the beauty of Afghanistan in his writing) who was fiercely independent (as Afghanistan is)? He lamented so many times that how Afghanistan had been searching for peace that had been eluding her for centuries. Ali himself was there in Kabul when there were glimmers of hope, but that vanished into thin air in no time. Ali did not go back to Afghanistan after his stay there for a year and a half. He remained estranged with the country he loves so much. Hence, in a way he might have taken the role of Majnun and depicted Afghanistan as Shabnam and continued searching for her, in vain, for the rest of his life.\nNotes:\ni Translated by Nazes Afroz, published by Speaking Tiger books, India in 2024\nii Translated by Nazes Afroz titled In a Land Far from Home/A Bengali in Afghanistan published by Speaking Tiger Books in 2015\niii P 100: P 103: Shabnam (2024) Speaking Tiger Books\niv  P: 74: Shabnam (2024) Speaking Tiger Books\nv P 103: In a Land Far from Home/A Bengali in Afghanistan (2015) Speaking Tiger Books\nvi  P 101: In a Land Far from Home/A Bengali in Afghanistan (2015) Speaking Tiger Books\nvii  P 101: In a Land Far from Home/A Bengali in Afghanistan (2015) Speaking Tiger Books\nNazes Afroz has worked as a journalist for more than four decades in print and broadcast media,\n\n18 of which for the BBC, covering current affairs spanning South, Central and West Asia in the capacity of a producer and later as a senior editor. Currently based in Kolkata, he writes in Bangla and English for a number of newspapers and websites. Apart from co-authoring a cultural guidebook on Afghanistan, Afroz has translated Syed Mujtaba\nAli's Deshe Bideshe into English under the title In a Land Far from Home: A Bengali in Afghanistan (2015) Joley Dangay under the title Tales of a Voyager (2023) and Shabnam (2024), all published by Speaking Tiger Books in India. \nAs a passionate documentary photographer Nazes has held several exhibitions in countries across three continents from 2015 including his work on the Kabuliwalas of Kolkata.\n",
        "headline_1": "Tamam Na Sud",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/focus/news/tamam-na-sud-3832896",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-02-2025"
    },
    {
        "full_article": "We are quite worried about the deteriorating law and order situation in Dhaka and across the country. The severity of the crisis was evident on Sunday night when multiple serious crimes were reported in different parts of the capital within just a few hours. In recent times, there has been a noticeable increase in criminal activities in the city, prompting public outrage both online and offline. The situation outside Dhaka is equally dire. All this has created an environment of fear where citizens no longer feel safe going out alone.\nSunday night's incidents justified this growing insecurity. For example, a 43-year-old jewellery shop owner was attacked right in front of his house by miscreants who shot him in both legs when he tried to stop them from snatching away his belongings. Elsewhere, muggers robbed two women on a rickshaw just after midnight, the video footage of which went viral.\nNaturally, public outrage is mounting, and most of it is directed at the home adviser now. The measures he has taken to improve security seem to have largely failed. Even the much-publicised Operation Devil Hunt—resulting in 8,664 arrests in 16 days—has not made a noticeable difference. Against this backdrop, the home adviser called a sudden press conference at three in the morning on Monday, where he claimed that the law and order situation had \"largely improved\" since he assumed office, and would continue to do so. He also alleged that cohorts of the ousted Awami League were behind the present security crisis.\nHowever, while his warning about Awami League is one shared by many, his optimistic assessment about law and order does not reflect reality. We are also baffled by his decision to hold a press conference in the middle of the night—an unprecedented move—just to offer routine assurances without providing any concrete plans for tackling crime. This came across as particularly tone-deaf given that, just hours earlier, hundreds of protesters at Dhaka University were demanding his resignation for his failure to ensure public safety. Even on Monday, protesters demanding the same staged a sit-in in front of Shikkha Bhaban after police blocked their march towards the home ministry.\nRather than addressing these concerns with transparency and accountability—which the interim government vowed to uphold when it first took over—the adviser instead put all eggs in the basket of faceless conspirators. This does little to inspire public confidence. Perhaps it is time for a performance evaluation of top government officials. If Awami League's cohorts are indeed behind rising crime, this is not just a law and order issue but a political one as well. The government should deal with it accordingly, along with its political stakeholders. But at the same time, it must take more effective steps to curb crime in Dhaka and elsewhere.\n",
        "headline_1": "Real action needed to curb crime in Bangladesh",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/real-action-needed-curb-crime-bangladesh-3832636",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-02-2025"
    },
    {
        "full_article": "Ah, the British. Inventors of bureaucracy, afternoon tea, and apparently, moral panic over bilingual signs. Whitechapel Underground Station, nestled in the heart of London's East End, had dared to put up in 2022, a Bangla translation of its name—yes, just the name, not the entire London Underground map. After three years, suddenly the country is in \"crisis\" over it. If you didn't know better, you'd think the Union Jack was being swapped out for a shari.\nRupert Lowe, a British MP whose Google search history likely includes \"Why isn't England England anymore?\", took to social media in a state of distress. \"This is London—the station name should be in English, and English only,\" he declared, as if a single line of Bangla script had personally threatened the monarchy. And because this world operates on a very specific brand of absurdity, none other than Elon Musk—billionaire, space enthusiast, and now, self-appointed linguistic gatekeeper—chimed in with a simple, \"Yes.\"\nAt this point, one has to ask: is this really about a tube station sign, or are we witnessing Britain's ongoing existential crisis unfold in real-time? Because, honestly, if the biggest threat to British identity is a few Bangla letters under Whitechapel, then someone should probably remind them about colonialism. You know that tiny historical event where the British spent almost two centuries plastering their language across half the world, including—drumroll, please—Bengal.\nLet's get something straight: Whitechapel isn't exactly the last stronghold of old-school Britishness. This is a neighbourhood where samosas outnumber scones, where the air smells like kebabs rather than Yorkshire pudding, and where shop signs in Sylheti and Arabic have existed long before Rupert Lowe discovered Twitter. The Bangladeshi community has been here for decades, working, building, and feeding a city that often pretends they don't exist—except, of course, when it's time to take credit for a good curry.\nBut sure, let's panic over a sign. Let's pretend this is about \"preserving tradition\" and not about deeply ingrained xenophobia dressed up as concern for public order. Let's act as if London hasn't always been a city of immigrants, that English itself hasn't absorbed half its vocabulary from foreign languages (bungalow, loot, pyjamas—ring any bells?), and that a second line of text is somehow an existential threat.\nFrom Dhaka, this entire debate feels hilariously ironic. The British, who once forced English upon their colonies with missionary zeal, are now losing their minds over the appearance of another language on their land. Colonialism, meet karma.\nMeanwhile, across the border, West Bengal's Mamata Banerjee is overjoyed. She called the Bangla signage a moment of \"global recognition.\" Lovely sentiment, Mamata-di, but let's not pretend that the British woke up one day and thought, \"You know what we need? More Bangla!\" No, this was the work of the Tower Hamlets council, home to the largest Bangladeshi community in the UK, trying to reflect the people who actually live and work there.\nBut back to the outrage brigade. If Lowe and Musk are really looking for something to be upset about, I have suggestions. The UK has a cost-of-living crisis, a National Health Service (NHS) on life support, and a housing market so dire that most Londoners consider running away to the Bangladeshi countryside as a viable retirement plan. But no, let's all clutch our pearls over some letters on a tube sign.\nFor those concerned about a slippery slope where London becomes unrecognisable, let me reassure you: no one is coming for Buckingham Palace with a Bangla dictionary. No one is translating \"God Save the King\" in Bangla and demanding a redo. And I promise, you won't wake up one day and find your fish and chips labeled \"machh ar chips.\"\nAt the end of the day, this isn't about a sign. It's about an old empire grappling with its new reality. The British once reshaped the world in their image, and now, as the world leaves its imprint on Britain, some are struggling to cope.\nSo, here's a suggestion, dear England: take a deep breath, have a cup of tea, and move on. Or, if you're really committed to linguistic purity, start by renaming Whitechapel itself—it was never exactly a British name to begin with.\nBarrister Noshin Nawal is an activist, feminist, and a columnist for The Daily Star. She can be reached at: [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Whitechapel, Bengal, and the great British identity crisis",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/whitechapel-bengal-and-the-great-british-identity-crisis-3832431",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "No logic behind  hiking gas tariff",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/no-logic-behind-hiking-gas-tariff-1740410007",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-02-2025"
    },
    {
        "full_article": "Bandits robbed a bus and a microbus by felling trees on the road in Naogaon on 22 February 2025 —Photo UNB ",
        "headline_1": "Highway robbers  on the prowl",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/highway-robbers-on-the-prowl-1740410118",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Dying mother tongues, cultures",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/dying-mother-tongues-cultures-1740410249",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Automobile industry under stress",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/automobile-industry-under-stress-1740410262",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-02-2025"
    }
]