[
    {
        "full_article": "The Trump administration has imposed fresh sanctions on Russia as punitive measures relating to Moscow’s refusal to strike a ceasefire agreement to bring the war in Ukraine to a halt, with Washington targeting Russian oil giants Rosneft and Lukoil. Russia’s use of the oil trade to finance war has been a bone of contention for NATO members since the early days of Russia’s incursion into and attacks on Ukraine, an indirect dimension of the conflict that has pulled Asian powers India and China into the fray. Over the summer, Mr. Trump sought to up the ante in this regard by slapping India with an additional 25% tariff for importing Russian oil, over and above the basic 25% rate imposed on other countries as well, even though China, as a top importer of Russian seaborne crude, was spared this levy. Now, the latest round of sanctions appeared to have penalised both trading partners of Moscow significantly, with reports suggesting that at least four major state-owned Chinese oil companies have suspended purchases from Russia and that at least one private and three state-owned Indian refinery companies are planning for “recalibration of Russian oil imports” including the possibility of a “massive cut” over time.At the heart of the White House move is the seething frustration of Mr. Trump over failed attempts to not only bring Russian President Vladimir Putin to the negotiating table — a feat achieved in Alaska in August and a second summit agreed in Budapest before it was postponed following the collapse of ceasefire talks — but also to nudge the Kremlin towards at least a short-term arrangement that might lead to a cessation of hostilities as a precursor to a broader treaty on territorial and institutional agreements. It is possible that the latest sanctions may lead to a genuine tightening of options for Mr. Putin on ending the war, especially as Washington will now be joining the European Union that has adopted its 19th sanctions package against Moscow, specifically focusing on technology supply chains, energy revenues, and financial networks. Nevertheless, it may be premature to applaud their potential impact on the Kremlin’s strategic calculus. Ultimately, whether sanctions have teeth or not depends on the consistency of their enforcement, including shutting down the inevitable loopholes and workarounds that Moscow will seek to exploit to continue selling oil abroad, possibly at even sharper discounts. Mr. Trump may find that he has travelled full circle to arrive at the same sticky negotiating points between Moscow and Kiev that his predecessor faced — an early end to ground hostilities, control of Donbas, and the permissible extent of NATO influence in the region. Only if sanctions can break Russian strategic will on at least one of these points will the prospects for peace brighten considerably. Published - October 25, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Russia\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        economic sanction\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        imports\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        NATO",
        "headline_1": "Sanctioning Russia: On the Trump administration’s fresh sanctions on Russia",
        "headline_2": "Trump is seeking to bring Putin to talks by breaking his strategic will",
        "link": "https://www.thehindu.com/opinion/editorial/sanctioning-russia-on-the-trump-administrations-fresh-sanctions-on-russia/article70198083.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "25-10-2025"
    },
    {
        "full_article": "Biharis who migrate for work remain embedded in caste, class networks of home. Parties tailor their messaging accordingly. And whether a migrant votes depends on his/her ability to absorb income loss from work foregone. And here, whether parties compensate for lost earnings is a crucial factor\nCandidate nominations for the final phase of Bihar polls ended yesterday. Almost every candidate who clears scrutiny will, aside from working local caste networks, keep a sharp eye on migrant voters. Bihar’s five million migrants, many local pundits say, are key to the outcome of the political contest.\nRead full story on TOI+ \n\n",
        "headline_1": "Bihar: The migrant vote",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/bihar-the-migrant-vote/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-10-2025"
    },
    {
        "full_article": "Union commerce minister argues India’s trade pact with Switzerland, Norway, Iceland, and Liechtenstein is a game changer in terms of attracting foreign capital \nIndia has unlocked another gateway to prosperity, signing an innovative trade agreement with a wealthy bloc of European countries that has a per capita income of over $100,000. This opens a lucrative market for Indian farmers, fishermen and MSMEs, and accelerates PM Modi’s Viksit Bharat 2047 mission.\nRead full story on TOI + \n \n\n",
        "headline_1": "‘$100bn investment over 15 yrs…creating 1mn direct jobs’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/100bn-investment-over-15-yrscreating-1mn-direct-jobs/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-10-2025"
    },
    {
        "full_article": "Vir Singh\nLight is all-pervading. The cosmos is a lumenosphere, home to light. With the gist of infinitism, light creates an infinite home – cosmos. Everything in the universe is subject to change, which is thanks to light. Thus, evolution itself is a kernel of light. No light, no change, no evolution. Everything is bound within the framework of time. Everything dies after completing a certain range of time, even stars. Not everything is eternal because everything exists only within its time limits. Only light that is eternal.\nLight is not a thing; it is a non-thing. And this non-thing is everything. It is neither created nor destroyed but changes from one form to another. Every cosmic creativity is enacted by light. The matter cannot participate in creativity. It is the energy that makes matter participate in creativity. Light is the original form of cosmic energy. All forms of energy on Earth originate from light.\nAstro-physical stabilisation process struck by light has been unceasingly going on since the Big Bang. This cosmic-scale creativity of light extended to a planet, evolving it into a living planet: the Earth. Life is the second stroke of all-creative light.\n\nBiological evolution triggered, shaped, and constantly enriched life. Light transforms itself into life through photosynthesis. Biological evolution, beginning with the origin of primordial microbes, and passing through photosynthetic cyanobacteria, eukaryotes, multicellular organisms, green plants, and animals, wrote the story of the biosphere. The entire fascinating biodiversity of life is a living avatar of light.\nIn all living organisms – microorganisms, plants, and animals – light functions as their soul. Soul is the living light that enters life through its own synthesis – photosynthesis. The third primaeval creativity stroke of light was the origin and evolution of the human species.\nHumans evolved with a stupendous mind, astonishing intellectual power, and unique consciousness, which is undoubtedly the most outstanding and robust story of the creativity of light. Now, most of the evolutionary changes being witnessed by the world are driven by living light functioning within humans.\nThe fourth stroke of light represents the evolution of art, which added immense beauty to human life. The evolution of fine literature (epics, dramas, novels, and poetry), dance, singing, oratory, sculptures, and architecture are various dimensions of this evolution. The fifth stroke of light’s creativity is the evolution of symbols emanating from religion and culture. Religion has shaped, reshaped, and transcended human behaviour to a significant extent. Such a theosophical evolution is determining the pathways to our future.\nThe sixth stroke of light led to the evolution of wisdom – the intellectual understanding at its depth. The seventh stroke of the living light represents the evolution of symbols that generate technological power.\nPhotosynthesis, logosynthesis, and theosynthesis are all actions of light. Geographical diversity, biodiversity, and cultural diversity are manifestations of benevolent light. All evolved human virtues – altruism, ethics, aesthetics, and spirituality are implanted, developed, and honed by light.\n\n",
        "headline_1": "Let there be light: Original cosmic energy",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/let-there-be-light-original-cosmic-energy/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-10-2025"
    },
    {
        "full_article": "The numerous add-ons to our daily diet have many benefits for us – and for others \nBunny and I have started taking a daily supplement. Not one of those freebies like the Delhi Times that come along with TOI, the supplement we take is a dietary supplement in the form of a 200mg tablet of magnesium which, far from being free, comes with a sizeable price tag. \nA chemical element, magnesium is an essential mineral which according to Google “is vital for the human body to function properly, playing a key role in muscle and nerve function, blood sugar control and bone health”. \nBeing a workaholic, magnesium doesn’t rest on its laurels after doing all this, but goes on to carry out “hundreds of enzymatic reactions in the body, promotes protein synthesis, and DNA formation, and helps maintain a normal heart rhythm”. \nWhile foods such as spinach, and other green leafy veggies, almonds, cashews, beans, dals, and whole grains are rich sources of magnesium, to be on the safe side adults are advised to take a daily dose of up to 350mg as a dietary supplement. \nBunny and I have been magnesiumising like billy-o for a few weeks and, whether it’s psychological or for real, we find we’re sleeping better and don’t suffer from fatigue-induced cramps or muscle aches.  \nMagnesium apart, there are other dietary essentials such as vitamins, ranging all the way from A to K. Medical science might well unearth more and more vitamins till it runs out of letters of the alphabet. \nWhen I was a boy, nobody seemed to know much about things like magnesium and supplements. The general body of nutritional knowledge was encapsulated in the saying, “An apple a day keeps the doctor away.” \nOur ignorance must have been bliss, for we appear to have got through more or less unscathed, unmagnesiumised enzymatic reactions notwithstanding. \nThose days are long gone, and the dietary order of today are supplements that not only ensure our physical health, but by supplementing its profits also benefit Big Pharma’s financial health. \n\n",
        "headline_1": "Super supplements",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/super-supplements/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 25, 2025 00:00:00  \nThe move is on to bring an end to the legacy of bureaucratic control of and political interference in the central bank of Bangladesh. It is difficult to predict the final outcome. However, the Bangladesh Bank Board through approving the draft amendment to the Bangladesh Bank Ordinance 2025, which is now awaiting final nod of approval by the Advisory Council of the interim government, has made a strong bid in favour of the central bank's autonomy. \n The BB's move has already been appreciated different quarters. It is important to note at this point that the urgency of the issue was also appreciated at a recently organised roundtable, titled, 'The Imperative for Central Bank Independence', where among others, Mr Amir Khasru Mahmud Chowdhury, former commerce minister and a stalwart of the Bangladesh Nationalist Party (BNP), has also stressed the central bank's independence as 'very vital for the country's macroeconomic sustainability'. It is gratifying to observe the support coming from the leader of a very potential power contender to the reform initiatives for the BB. This is because the governing political parties, including the immediate past autocratic one, used the central bank to protect the loan sharks belonging to their respective clans. \nHowever, assurances from political leaders apart, the central bank's autonomy would finally depend on the academic excellence, expertise, and, most importantly, the personal integrity of the person in charge of banking regulator. Instances of academically very bright people at the steering wheel of very vital and sensitive organs of the state including the central bank bowing easily to political pressures, abound. In the case of the past autocratic regime, the central bank authority was too pliant to follow the dictates of the government so much so that it framed its monetary policy to meet short-term goals like providing economic stimulus or resorting to deficit financing. Without leaving the bank lending rate or exchange rate of taka to the forces of market, it kept the lending rate capped for a considerable period of time and the exchange rate was kept unchanged to suit the interests of the powers that be. \nSo, with the granting of full autonomy, it is expected that the central bank would play its role as regulator and leader of the banking system as 'bank for banks' and would be able to do its main job of managing the country's currency and monetary policy efficiently, with the primary objective of taming inflation and stabilising consumer price. Again, it would also fix interest rates to influence borrowing and spending in the economy as well as controlling the supply of money and reserves. In this connection, some experts at the roundtable expressed the view that the country should have a clearly-defined monetary policy role with explicit legal provision to stop government lending and that the central bank should be able to prepare its own budget. Such functions should patently fall within the purview of a truly independent central bank. While all these issues will be open to discussions and recommendations from pundits in the field in question, the final say, however, lie with the political power in office and its good will. Hopefully, the country's central bank will be able to exercise the power granted to it once its full autonomy is granted.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Full autonomy to empower central bank",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/full-autonomy-to-empower-central-bank-1761319553",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       October 25, 2025 00:00:00  \nAn old joke tells of an African minister who once visited his Asian friend's huge mansion and asked how he could afford it on a government salary. The Asian smiled and gestured to a half-finished bridge and a new highway outside his window. \"10 per cent from each,\" he said. A year later, the visit was returned. This time, the Asian was the one marvelling at his African friend's even grander home and asked the same question. The African pointed to an empty field where a highway was supposed to be. \"100 per cent,\" he replied with a wide smile. \nThis joke is funny because the Asian side of the story feels uncomfortably familiar and has its parallels in Bangladesh. A perfect example of it is the Bus Rapid Transit (BRT) project between Dhaka airport and Gazipur, which was cancelled even after 97 per cent of the work was completed. It took the authorities over a decade and a whopping Tk 42.68 billion to finally realise that this nearly finished project had become an unsolvable problem. \nThe entire experience of the project has been dreadful from the very beginning. Conceived in 2012 as a quick fix for the crippling congestion on the Dhaka-Mymensingh Highway, the BRT was meant to run from Hazrat Shahjalal International Airport to Shib Bari of Gazipur. The plan promised dedicated lanes for modern buses departing every thirty seconds, cutting the journey to under forty minutes. The initial four-year timeline came and went without completion. After that, the government granted three more extensions, yet the work kept dragging on. Throughout this prolonged process, construction zones became death traps and the highway a perilous obstacle course, causing multiple fatalities and countless accidents. Construction firms, shielded by political influence, operated with impunity and avoided accountability at every turn. The government kept revising the plans and budgets and each amendment only drove up costs without correcting the fundamental design flaws. In the end, the project became an economic burden and political embarrassment until it could no longer be considered a viable transport solution and was quietly shelved. \nThe project was doomed from the start by a serious design flaw that any transport expert or even a regular commuter of the highway could have predicted. It involved the planners' decision to reserve the middle lanes exclusively for the new BRT buses, forcing all other traffic such as long-haul trucks, buses, cars from 25 districts and local rickshaws and vans to be compressed into the already saturated side lanes. Even on paper, that arrangement was absurd and unworkable. The planners ignored the highway's real traffic patterns and the chaos that would inevitably ensue in the side lanes once the centre was closed. Furthermore, the design disregarded basic operational practicality of running buses on the roads. Regular buses in Bangladesh have doors on the left, but the BRT stations were built in the middle of the road, meaning the new buses had to have doors on the right against the norm. It is hard to imagine how such a fundamental mismatch slipped past engineers, consultants and officials alike. \nRight from its outset, the BRT project seemed set to frustrate commuters. In Uttara, the very first or the last BRT station, depending on how you look at it, makes the busy airport road narrower at a spot that could easily have been widened to add four more lanes. Because of this one bad decision, traffic now gets stuck there every single day. While the nine flyovers provide some relief overhead, the areas underneath them look like abandoned ruins, with pools of dirty water and piles of debris. It seems the authorities approached this as a mere construction endeavour rather than a real transport solution. The stations themselves, with their huge pillars, escalators and stairs, took over the entire footpath leaving no safe space for pedestrians and forcing everyone onto the busy road. Officials promised to fix the sidewalks later by acquiring more land, but after 12 years of empty assurances, no one is holding their breath. In fact, if any project deserved a medal for trying the public's patience, this one would win hands down.\nAccording to experts, prolonged delays of the BRT project have cost the country around $123 million every year in lost productivity and fuel. Over eight years, that adds up to nearly a billion dollars. Just imagine how many better roads or metro lines could have been built with that money. Instead, it disappeared into the quicksand of inefficiency and corruption. The government has now abandoned the project, with reports indicating that top officials have lost faith and are thinking of scrapping it completely. It's a stunning waste. After all that time and money, we are left with a nearly finished, utterly useless system unlikely to carry a single passenger.\nWhich brings us to the most pressing question that the project's quiet and unceremonious shelving tries to avoid. Who is accountable for this mess? Thus far, no one has been held responsible for the massive waste of public funds or the suffering it caused ordinary citizens. When costs more than double, when deadlines are endlessly extended and when people endure years of hardship only to see the project scrapped, those in charge owe the public answers. The officials who designed and oversaw this doomed scheme must be called to account. We must ask why such a fundamentally flawed design was ever approved and who benefited from decisions that defied all common sense. Billions of dollars in foreign debt were poured into a futile endeavour precisely because of these reckless choices, leaving taxpayers to foot the bill for years to come. \nWith the project now abandoned, the government is now obligated to come up with a credible alternative to tackle traffic crisis on this crucial route. People did not endure years of dust, endless hours trapped in traffic, detours and danger for nothing. They deserve better. At the very least, they are owed a credible, actionable plan to deliver tangible solutions.\nshowaib434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "How to waste Tk 42.68 billion!",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/how-to-waste-tk-4268-billion-1761319595",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       October 25, 2025 00:00:00  \nEngaging in harmful activities, casually or carelessly, is being seen as a normal practice in the country. Over the years, attempting to curb or even minimise such acts has become difficult because a growing number of people do not find anything wrong with their actions that negatively affect others. Even in many cases, the wrongdoers, backed by political forces, become aggressive and attack those who try to resist or protest their actions. As a result, social cohesion has also been eroding, which will trigger severe negative consequences in the near future. The slow change in the moral landscape due to various socio-economic dynamics is a key reason in this connection. What was once categorically recognised as wrong is now being redefined and rebranded, even celebrated as 'not so wrong'. This often leads to the acceptance of 'wrong' as 'right'.\nWhen people set out from home and start to walk on the streets in Dhaka, they encounter various obstacles and odds within a couple of minutes. Vendors occupy the footpaths on both sides of the streets, making it difficult for vehicles to move smoothly, and walking becomes challenging. After crossing the vendor's hassle, the walkers have to cover their face to avoid the bad smell of open urination from the roadside. By overcoming the disgusting moment, the pedestrian confronts motor bikers blocking space on the footpath for movement. Finally, when people get ready to cross the road battery-run rickshaws in a large number will rush in from the wrong direction.\nAll the above-mentioned things are either wrongdoing or misdeed. Nevertheless, all these have become normal in the country as people have accepted as normal things. So it has also become challenging to protest or resist these wrongdoers. If anyone asks the street vendor to give space for walking, the vendor would show them how to walk in the middle of the street. Someone trying to protest a motorbiker riding on a footpath has to face backlash and is likely to be harassed by a group of bikers. By rebuking battery-run rickshaw pullers for driving in the wrong direction, one has to face verbal abuse from them. \nThe wrongdoers have some flimsy excuse to justify their actions. One is the 'everyone does it' approach, which is not acceptable at all in the real world, 'everyone does not do it.' So, comes the wrong justification that 'many people do it' and this is true, but again not acceptable, as many people also do not do it.' Another excuse is 'nobody opposes it' as if the wrongdoers or offenders pay heed to the dissent and keep them restrained from doing the misdeed. Instead, in most cases, they do not care about any protest or opposition and continue their transgressions.\nAgain, the normalisation of wrongs or acceptance of misdeeds as the normal course of society is not limited to Bangladesh. Almost every country has been experiencing various levels of the normalisation of harmful activities. It, however, does not mean that there is no need to address the growing problem in Bangladesh on the plea that it is a global phenomenon. Such an approach itself is a move to accept the wrongs and allow those to spread. \nSo, what to do? For the pessimists, there is no way to reverse the course of wrongdoing and the situation will be worse in the days to come. For the optimists, it is still possible to correct the course by collectively eschewing the acts of wrongdoing.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Looking at acts of wrongdoing",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/looking-at-acts-of-wrongdoing-1761319632",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 25, 2025 00:00:00  \nTea is more than just a drink, it is woven into our lives, memories and culture. Every cup carries stories of people, time and emotions. When we sip tea, we connect to the hills where it grows, to the hands that carefully pick the leaves and to everyone who makes it possible for it to reach our tables. In Bangladesh, tea is part of our daily rhythm, the morning cup that wakes us up, the roadside \"cha-er adda\" where friends gather and the shared pot that accompanies long conversations, laughter and even moments of sadness.\nTea has a history that stretches far beyond our borders. Its journey began in the forests of Asia and eventually reached the Sylhet and Chattogram hills through trade and time. Those green hills tell stories of generations who laboured to make tea an integral part of our economy and identity. Tea is not just a product; it is a piece of our heritage.\nHowever, behind every cup, challenges exist. People who grow and harvest the leaves often earn very little and the industry faces threats like climate change and fluctuating prices. Protecting our tea culture means supporting fair wages, sustainable farming and safer working conditions for these workers.\nTea also requires balance for our own health. While it is comforting and beneficial, too much caffeine can lead to sleeplessness or unease. Balance here means choosing lighter teas if you drink often, and savoring a cup at your own pace if you drink less. But tea is not about quantity: it is about sharing moments of peace and joy.\nLet us cherish this heritage by protecting the lands that produce it, honouring the labour that sustains it and passing down its rituals and stories to future generations. \nWhen we sit for tea, let it be a moment not just to drink, but to remember, to listen, and to imagine fairer practices for those who made it possible. Every invitation to \"cha\" can be an invitation to care: for workers, the land, and the quiet dignity of shared time. In every cup lies a story: of origins and change, of community and care. May we drink with gratitude, act thoughtfully and keep this gentle tradition alive for generations to come.\nSangida Jahan Ripa\nStudent \nDepartment of Accounting and Finance \nNorth South University\nsangida.ripa@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The human story of tea",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-human-story-of-tea-1761319660",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-10-2025"
    }
]