[
    {
        "full_article": "That unity in diversity is India’s strength might sound clichéd, but it is as true as ever. Prime Minister Narendra Modi, while speaking at the Rising North East Investors Summit 2025 last week, cited the diversity of India’s northeastern region to underscore the vast diversity of the country. The northeast is rich in its cultural diversity and natural resources, and its location, topography and complex histories make it a unique space. But its numerous linguistic, tribal and cultural affinities can be a source of conflict within the Indian state. At times, these conflicts can be violent as the one in Manipur, which erupted on May 3, 2023, and is still simmering between the Kuki and Meiti communities. The Modi government and State governments in the region have sought to turn the region into an attractive destination for investors and tourists. The Sela Tunnel in Arunachal Pradesh, the Bhupen Hazarika bridge in Assam, the construction of 11,000 kilometres of highways, extensive new rail lines, more airports, the development of waterways on the Brahmaputra and Barak rivers, the expansion of mobile telephony, and a 1,600-km-long Northeast Gas Grid are examples of the new dynamism of the region. The Modi government has built on the initiatives of its predecessor United Progressive Alliance governments.Mr. Modi has also sought to settle many a conflict in the region in the last decade. The Framework Agreement with the NSCN (Isak-Muivah) in August 2015, although nebulous now, the Bodo Peace Accord and the Bru refugee settlement (both in January 2020), and the rollback of the Armed Forces (Special Powers) Act from a larger part of the region have been some of the steps signalling the Centre’s intent. The change in perception about the northeast and its green cover has led to a surge in tourism and attracted investments, headlined by the Tata Group’s ₹27,000-crore semiconductor plant coming up in Assam. But the challenges remain. Apart from Manipur, there is the perception in Nagaland that the Centre has lost interest in the peace process. Inter-State border disputes also continue to haunt the region, although Assam has partially resolved its issues with Arunachal Pradesh and Meghalaya. The investments have increased the demand for power and the focus on hydroelectric projects, most in Arunachal Pradesh, has triggered local protests fearing displacement and environmental damage in a region that is prone to natural disasters. Increased rhetoric by the Bharatiya Janata Party about immigrants from Bangladesh and Myanmar has heightened social tensions. If India has to meaningfully pursue its Act East policy, by integrating the northeast more closely with the east Asian economies, then its policies within the borders and toward the neighbouring countries should be in alignment. Published - May 26, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Arunachal Pradesh\n                    \n                            /                      \n                        \n                        Assam\n                    \n                            /                      \n                        \n                        Manipur\n                    \n                            /                      \n                        \n                        Meghalaya\n                    \n                            /                      \n                        \n                        Mizoram\n                    \n                            /                      \n                        \n                        Nagaland\n                    \n                            /                      \n                        \n                        Tripura\n                    \n                            /                      \n                        \n                        Sikkim\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        investments\n                    \n                            /                      \n                        \n                        tourism\n                    \n                            /                      \n                        \n                        rivers\n                    \n                            /                      \n                        \n                        waterway and maritime transport\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        United Progressive Alliance\n                    \n                            /                      \n                        \n                        natural disasters\n                    \n                            /                      \n                        \n                        Bangladesh\n                    \n                            /                      \n                        \n                        Myanmar\n                    \n                            /                      \n                        \n                        immigration",
        "headline_1": "​Frontier of progress: On the potential of the northeast",
        "headline_2": "India must recognise the northeast’s diversity to tap its potential",
        "link": "https://www.thehindu.com/opinion/editorial/frontier-of-progress-on-the-potential-of-the-northeast/article69617841.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "26-05-2025"
    },
    {
        "full_article": "The U.S. capital was rocked by the murder of a young couple who served there as Israeli embassy staff. The assailant, who raised slogans to “Free Palestine” following his arrest shortly after the violent act, was named by authorities as Elias Rodriguez. He has been charged with two counts of first-degree murder, the murder of foreign officials, causing death with a firearm, and discharging a firearm in a crime of violence. According to reports, his social media accounts have indicated his close involvement with the pro-Palestinian protest movement. The victims, Yaron Lischinsky (30) and Sarah Lynn Milgrim (26), had plans to get married and had warm personal and professional ties with Israel and Palestine, reports noted. U.S. President Donald Trump’s post on the social media platform, Truth Social, said, “These horrible D.C. killings, based obviously on antisemitism, must end, now!” Israel Prime Minister Benjamin Netanyahu said he was “outraged by the horrifying antisemitic murder”, adding that the deaths were caused by “anti-Israeli incitement”. He also linked the attack to actions by the leaders of the U.K., France and Canada, who had signed a candid joint letter recently, condemning Israel’s actions in Gaza. Mr. Netanyahu has accused them of “emboldening Hamas to continue fighting forever” by calling on Israel to end the war there.If one thing is clear, it is that the Israel-Gaza conflict has firmly entrenched itself in the public discourse in the U.S., with policy implications as well. Soon after kicking off its second term in office, the Trump administration waded into the issue, controversially and unapologetically, when it began conducting immigration raids across U.S. universities, targeting any foreign student who had participated in protests for human rights in Gaza with detention and deportation. Similarly, Mr. Trump made it clear that he was not pulling his punches when the White House announced recently that it would follow up its drastic funding cuts and other restrictions on top-tier universities — it has accused them of not doing enough to prevent anti-Semitism on their campuses — with a ban on the enrolment of international students at Harvard. Although Harvard has received temporary respite — a block has been issued by a U.S. District Court in its favour — the risk of institutions of graduate learning facing “immediate and irreparable injury” remains high at this time. It is important for the international community to be able to criticise Israel’s brutal war in Gaza and rein in Mr. Netanyahu without being seen as anti-Semitic or supportive of Hamas. But violence against Israelis has no place in the efforts to highlight the plight of the Palestinians. Published - May 26, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        murder\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        Palestine\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        France\n                    \n                            /                      \n                        \n                        Canada\n                    \n                            /                      \n                        \n                        university\n                    \n                            /                      \n                        \n                        students\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict",
        "headline_1": "Violent act: On the Washington shooting, the Palestine cause",
        "headline_2": "Violence against Israelis has no place in efforts to highlight Palestinian cause",
        "link": "https://www.thehindu.com/opinion/editorial/violent-act-on-the-washington-shooting-the-palestine-cause/article69617505.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "26-05-2025"
    },
    {
        "full_article": "Across the chimneys of Sistine Chapel and ships\nStudying the colour of smoke from the chimney of the Sistine Chapel has an interesting marine parallel. For a very different reason, marine engineers too are keen observers of the colour of smoke, from the funnel of their ship. It is their chimney, their chapel.\nThe engine room of a ship is a complex, compact space packed to the brim with a vast array of machinery systems. Giant propulsion engines as tall as double-storey buildings, power plants and boilers sufficient to meet the needs of a small township, air-conditioning systems, sewage treatment and desalination plants – the ship has got it all. Marine engineers are the jack and master of all this. And the last thing they want is a breakdown of critical machinery in the middle of the ocean, thousands of miles from help. \nI was once a serving marine engineer on large merchant ships. As chief engineer, one begins to lose the gut instinct developed by proximity to machinery. The chief is usually buried in paperwork. This is why they watch smoke, which has an uncanny knack of revealing the health of the engines and boilers.\nEvery evening after dinner, I walked the length of the main deck, frequently looking up at the funnel to study the colour of smoke. Black means poor combustion, indicating engine problems; white, water ingress into the combustion space; and blue implies excessive consumption of lubricating oil. Sparks from the funnel? Time to don the boiler suit. Near-colourless smoke was the holy grail – rarely seen, but always aspired to.\nOn one occasion, I observed thick black smoke, which sadly culminated in the immobilisation of our ship for nearly 24 hours, while we replaced a piston weighing over a tonne – in the middle of a raging Atlantic storm. Our fully loaded 50,000-tonne vessel was flung about like a piece of flotsam. I’ll never forget how helpless we felt that night.\nAnd so, just as the colour of smoke is interpreted by the faithful gathered in St Peter’s Square as a sign to humanity, the colour of smoke at the funnel is also a portent of what lies ahead. Whether generated from the holy precincts of the Sistine Chapel, or from the internal combustion engines of a ship, the smoke is not just exhaust – but something weighed in hope, peace of mind, and certitude.\n\n",
        "headline_1": "The Weight of Smoke",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-weight-of-smoke/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-05-2025"
    },
    {
        "full_article": "Monsoon’s here early, IMD’s predicted rain surplus, food stocks are good, but there’s much to watch out for\nOn Saturday, Niti Aayog announced India’s become a $4tn economy, edging past Japan to take fourth place. And monsoon arrived in Kerala eight days early, beating IMD’s Sunday forecast. This is the earliest monsoon has touched mainland India since 2009, and it bodes well for economic growth. An early monsoon, combined with IMD’s projections of above-normal rainfall, would likely lead to a bumper kharif harvest, essential for keeping food prices and inflation in check. FY 2025-26 has anyway started with abundant grain stocks, so much so that GOI wants states to lift three months’ rations of wheat and rice to clear warehouses for the incoming wheat crop.\nMonsoon matters in all this because India’s crop yields remain heavily rain-dependent. In MP, half of the acreage is rain-fed. Maharashtra’s agriculture is 80% rain-fed. So, both quantum and distribution of rainfall are important. Last year, for example, monsoon ended with a rain surplus overall, but Punjab, UP, Bihar – major agrarian states – had a rain deficit. On the other hand, Rajasthan and Gujarat had a problem of plenty. While drought and flood can be averaged out on paper, that doesn’t happen in the field. And any shortfall in production jeopardises schemes like PMGKAY, under which more than 81cr people are provided free grains. In 2022, Centre had to reduce wheat allocation under the scheme for two years, due to lower output.\nAnother sobering thought: early monsoons, like child prodigies, don’t always live up to their promise. The 2009 season turned out to be India’s third driest since 1901. Forecasting has improved since then, but still, a lot can happen between Sept and now. What’s certain, though, is that good monsoon or bad, cities, where 35% of Indians live, will bear its brunt. \nWhile below-average rain will leave taps dry, and plunge the water table further, leading to secondary effects like ground subsidence, the dangers of excessive rain are well-known. What Bengaluru went through last week – and last year, when it got 111mm of rain on June 2 – is partly a result of old infra that can’t cope with the new pattern of torrential rain. But more than that, it’s a sign of the complete abandonment of planning in urban extensions. So, it’s time officials stop complaining about “unseasonal” and “excessive” rain – which is the new normal – and start building urban infra to cope with it.\n\n",
        "headline_1": "Cloud computing",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/cloud-computing/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-05-2025"
    },
    {
        "full_article": "Teenagers having consensual sex is basic human design. This must be decriminalised by GOI\nThere are countless ways in which adults fail to understand teenagers and let them down. But when a systemic orthodoxy is causing them clear injustice, at least then the adult approaches must be reformed without delay. In the case of Protection of Children from Sexual Offences Act, 2012, court reports have been showing for years that blanket criminalisation of teenage sexual activity is deeply oppressive. Now, the Supreme Court has issued notice to GOI to give its views on amici curiae’s suggestions regarding POCSO, whose rigid application in cases of adolescent relationships is found to lead to traumatically unjust outcomes.\nAn analysis of all judgments passed in a case involving rape in Delhi’s district courts in 2013 found that around one-third involved couples who had chosen to be together. Their parents pursued the police action. Police often sympathises with the girl’s father, families often punish her with a severe beating. He gets jail and a rape conviction. Because her age of consent is 18. The defence is that these families and cops’ morality cannot be changed simply by changing the law.  It’s an untenable defence. Their private morality is immaterial. The issue is adolescents’ entitlement to a private life, to coming of age, on their own terms, in perfectly healthy and natural ways.\nRefusing to uphold adolescent agency to consent is in a continuum of injustice that wives also suffer. In this context, the phrase ‘women and children’ rings cruelly apt. GOI has been opposing the criminalisation of marital rape citing concern for “social and family structure”.  Consent, though, is the bedrock of human dignity. By wrenching it away from intimate relationships, lawmakers are enabling a legion of personal torments, and encouraging the worst instincts of adult busybodies. Reform the law, recognise consent, that’s where both private and public good lie.\n\n",
        "headline_1": "Yes means yes",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/yes-means-yes/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-05-2025"
    },
    {
        "full_article": "Harvard sued and got a temporary stay on the Trump administration’s latest ruling – disallowing the university from enrolling foreign students. Calling enrolment of foreign students a “privilege not a right…to help pad multibillion-dollar endowments”, what homeland secretary Kristi Noem said bears repeating. “This administration is holding Harvard accountable for fostering violence, antisemitism, and coordinating with the Chinese Communist Party on its campus.”\nRead full story on TOI+\n\n",
        "headline_1": "Trump spots red star over Harvard",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/trump-spots-red-star-over-harvard/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-05-2025"
    },
    {
        "full_article": "When Zainul Abedin left Calcutta (now Kolkata) in 1947, as India and Pakistan negotiated a partition-ridden freedom from the British Empire, he was one of the city's most acclaimed artists. By the early 1940s, Abedin had become the youngest and beloved teacher at the Government School of Art. His stark sketches of hunger and death in the city's streets had captured the catastrophic, man-made Bengal famine of 1943, which was killing and displacing millions in Bengal, as the Allied army fought Japan on the eastern frontiers of the Second World War. His works fascinated artists, critics, journalists, activists, and a late-colonial public alike, who saw the very meaning of beauty and national form transformed in the artist's sharp, expressionistic realism.\nIn January and February 1945, Abedin featured on the cover of People's War, the national organ of the Communist Party of India (CPI) (Figure 1). His famine art was introduced in this issue by the party's iconic artist-cadre, Chittaprosad, as the CPI organised the first exhibition of Abedin's works. In 1944, Abedin had also illustrated the activist-journalist Ela Sen's Darkening Days: Being a Narrative of Famine-Stricken Bengal in May 1944. When the now-renowned artist Somnath Hore, then a young novice in the early 1940s, was identified by CPI leadership, he was placed under Abedin's mentorship at the art school in 1945. By 1946, Hore would begin his dedicated career of documenting popular resistance, experimenting with socially committed modernist art, and continuing, perhaps, Abedin's very own legacy in post-Partition, independent India.\n\nRealism was a cornerstone in Abedin's art practice, as a vision and even as a conservatism that he would hold on to, while he dedicated himself to shaping artistic taste and pedagogy as Principal of Dhaka's art institute, formed earlier, in 1948-49.\nAbedin's return to Dhaka, the capital of the eastern wing of a newly formed Pakistan, sprawled on both sides of India, was forced – even as he himself hailed from this former East Bengal's Mymensingh district. As Abedin, along with his fellow-artists from Calcutta – Safiuddin Amhad, Qamrul Hasan, and Anwarul Hasan – chose to leave a polarised, genocidal milieu of a communal riot-torn Calcutta, he had to confront deep professional and personal insecurity. Rebuilding artistic foundations in the new capital of Pakistan's eastern wing, Dhaka, was challenging.\nAbedin would go on to become a foundational figure – an artist, pedagogue and cultural bureaucrat – central to the formation of an artistic sphere in East Pakistan, active also in the federal centre in the west. It took imagination, labour, and persistent negotiations with the federal government in West Pakistan. And even as East Pakistani artists like Abedin visited and thrived in the west, the asymmetries in artistic infrastructure between the two wings remained. Partition had marked the stories of artistic modernism in the sub-continent in ways lived and felt, but often invisible to history writing.\nZainul Abedin's artistic practice – from his early years as a migrant art school student in colonial Calcutta in the 1930s to his stature as Silpacharya – the most celebrated artist-pedagogue of post-liberation Bangladesh in the 1970s, carries these lived shadow-lines of 20th-century decolonisation in the sub-continent. Still more, and critically so, Abedin symbolises, along with his many other fellow artist-pedagogues across the decolonising worlds in Asia, Africa and the Middle East, this artistic legacy of shaping how freedom itself could be visualised in young nations undergoing often-turbulent postcolonial transitions. This allegorical weight that Abedin has had to shoulder – in life as much as in the afterlives of his legacy – has often also been heavy. Can we return to this heavy iconicity of a 'national artist', to draw his lines and lineages differently?\nAs a young entrant into Calcutta's art worlds in the 1930s, Abedin, along with fellow students from the Government School of Art, sought to generate new space for artistic realism. The art school's syllabus as well as the city's art discourse had been dominated hitherto by the idyllic \"Indian-style\" wash paintings of the Bengal School, pioneered in the early-1900s by Abanindranath Tagore, and institutionalised by his followers. In the 1930s, the Bengal School was still following idealistic mythological subjects and had partly morphed into a dynamic yet still-idealistic ruralist earthiness at Kala Bhavan, the art school of the experimental 'global' university of Visva-Bharati at rural Santiniketan, established in 1919 by Rabindranath Tagore. For Abedin and his fellow realist painters like Abani Sen or Gobardhan Ash, this idealism was inadequate to capture what contemporary society and landscape itself looked like. Against all odds, they would exhibit their works, and by the late-1930s critics were noticing. Reviewing their 1936 show, for instance, the critic Jaminikanta Sen had written that such works carried a new satyabodh – a \"sensibility of truth\" and a \"new nationalism\" that could visualise the nation via the harsh \"truths of contemporary reality\", marked by industrialisation, famished villagers, and their actual living conditions.\nThe famine pushed this realist sensibility to new extremes, as Abedin's art turned to a minimalist expressionism that transformed realism from the often-critiqued sterility of academic naturalist \"colonial\" style art, to a dynamic yet challenging form of modernist realism that questioned the very foundation of artistic truth and beauty. Abedin's famished rural refugees in Calcutta's street corners, battling crows and dogs for morsels of food were more than an index of art's social commitment or the art of the famine – they were, indeed, the aesthetics of late-imperialism and the paradoxes of anti-fascist war in imperial colonies of the Allied army itself. As Abedin, then an impoverished migrant artist himself, drew his ink sketches of hunger-ridden pavements, with dry brush and ink on cheap brown wrapping paper, walking these streets on his way to the art school, a new shape of artistic roles in the shadow of empire, was emerging. He himself probed these possibilities, as he joined the Anti-Fascist Writers' and Artists' Association, and other collectives of progressive art already in the early 1940s, steered increasingly by a cultural movement shaped by the Communist Party of India.\nRealism was born in the streets of Calcutta, the noted art critic of postcolonial Bangladesh, Burhanuddin Khan Jahangir would write of Abedin's famine works, in his biography of Zainul Abedin in the 1990s. Abedin's famine drawings were to stay with him all along his post-1947 career in East Pakistan, exhibited in his shows as he travelled across the world in the 1950s and 1960s, and held close as he fled an invading Pakistani army during the liberation war in 1971 that gave birth, through another genocide, to today's Bangladesh from East Pakistan. Realism was a cornerstone in Abedin's art practice, as a vision and even as a conservatism that he would hold on to, while he dedicated himself to shaping artistic taste and pedagogy as Principal of Dhaka's art institute, formed earlier, in 1948-49. Yet Abedin's realism carried many lines, as it shaped what the social – and via that, the political – could mean in art. From the 1930s itself, this sense of the social, for Abedin, was heavily mediated by rural lives – whether in his early forays into painting rural labour in 1930s Dumka, or the rural displaced in the wartime famine, or increasingly in post-independence East Pakistan, the unchanging rhythms of a rural everyday, between struggle and resilience, labour and leisure.\nThere is in Abedin's practice, a dialogue between the rural and the social, and modernist form-making itself that would inform his pedagogy and legacy – and indeed, its allegorical weight for East Pakistan and Bangladesh that he carried as Silpacharya. This same dialogue also shapes Abedin's significance our understanding of how integrating (social) realism with modernism, and the figurative with the abstract, were critical cornerstones in the artistic imaginations of the decolonial transformations of the 1940s-80s. This has implications for pushing art historical thinking beyond the artificial oppositions between figurative and abstract art planted globally by an Americanised art discourse via the cultural politics of the Cold War.\nAbedin himself was a postcolonial traveller in this global cultural Cold War. By the mid-1950s, he was a highly mobile artist travelling across the USA, Europe, the Middle East, Central and East Asia, the Soviet Union, on various fellowships like the Commonwealth, the Rockefeller grants, and on commissions from the Pakistani government. In September 1951, he made his first trip to London on a Commonwealth scholarship to study art pedagogy. Abedin studied at the Slade School and exhibited across London. In 1952, he attended the UNESCO conference held during the Venice Biennale, where ideas of cultural freedom, artistic exchange, new aesthetic standards of modern art and post-1945 cultural reconstruction were being discussed. In the 1960s, Abedin was invited by the Soviet Union where he was awarded a gold medal, and later by the Arab League to visit and sketch the Palestinian guerrillas and refugees.  He was, in fact, a typical, artist-diplomat of the period of decolonisation and Cold War who would be serially invited by the United States and the Soviet Union, countries of the Eastern Bloc as well as Japan in a muted contest over the cultural imagination of the 'Third World'.\nAbedin's journeys marked his artistic trajectory in the styles he experimented with, though his subjects remained the same – labour, struggle, and the rural everyday. For instance, after he returned from his first spell in the UK, Europe, and Turkey between 1952-53, his style would change, though mildly and for a short span. He began experimenting in linear simplifications, breaking up the image, trying out semi-Cubistic figurations, while remaining committed to building art's foundations in a public culture. Throughout the 1950s, Abedin made conscious efforts to integrate art with the people – whether in projecting the image of the common man in art or promoting public access and participation in art-making. Over the 1960s, Abedin tied himself more to the collection and documentation of folk art, a substantial part of which formed the core of the Sonargaon museum in post-liberation Bangladesh. This was, at the same time, his self-fashioning as a patron and preserver of folk art, and also increasingly, his retreat into the identity of a pedagogue rather than that of a modernist artist.\n1970 appears as a culmination of Abedin's artistic trajectory. In spring he made the scroll Nabanna, a celebration of the harvest festival where he created what can be seen as an allegory of the incipient nation – from the displacements of the 1940s, through growing rhythms of everydayness, to labour and leisure that have built the social fabric of his nation. In the summer of 1970, Abedin visited Palestinian refugee camps along the Jordan river as part of his tour across the Arab world (Figure 2). He wanted to head back, and organise another exhibition, the profits of which he intended to donate to the Palestinian cause. He was unable to return, and the works he left behind in Cairo were also lost. Returning to Dhaka in that summer, Abedin was to be overtaken by a growing political resistance at home, one that would lead to a genocidal liberation war, giving birth to Bangladesh. In November 1970 when the tidal wave in Monpura killed and ravaged millions, Abedin toured the destruction on a helicopter and returned with notes. Much later, he would paint Monpura '70 – as his wife Jahanara Abedin noted – in one sitting, with rapid movements.\nMonpura'70 (Figure 3) is a harking back to the famine of 1943, as much as an encounter with the immensity of death, once again in the shadow of liberation struggle. So was Nabanna at the start of 1970. The Palestinian experience sits in the middle as a radical return to art's encounter with displacement, a battle itself perhaps, with the demand of artistic form in the shadow of dehumanisation. The dialectical tension between art's formal and socio-political pulls both shines and challenges how this aesthetics of 20th century decolonisation could be understood. Abedin the artist, his epic scrolls, his persisting returns to a rebel bull or rural fragments of labour and repose stand as possibilities – to read art as archives for understanding how the historical time of 20th century decolonisation was lived, imagined, remembered, and challenged, despite the ways our individual nation-states narrate fragmented pasts.\nSanjukta Sunderason is an Associate Professor of Art History at the Department of Arts and Culture, University of Amsterdam.\n\n",
        "headline_1": "Art and decolonisation, with Zainul Abedin",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/focus/news/art-and-decolonisation-zainul-abedin-3903446",
        "news_paper_name": "The Daily Star",
        "publish_date": "26-05-2025"
    },
    {
        "full_article": "We are relieved that the chief adviser has not followed through on his desire to resign. All major political parties have reaffirmed their support to the chief adviser and expressed that they do not want him to step down. Thankfully, a national crisis has been averted.\nAt the same time, we are wondering what else, other than the chief adviser's decision to resign being reversed, has been achieved. We are waiting, for instance, to hear the chief adviser and his cabinet's response regarding the issues of contention brought forward by the BNP, Jamaat-e-Islami, and NCP. BNP has said it has placed its demands, and the chief adviser has listened. But the issues have not been resolved. The party reiterated its demand for a general election to be held by December this year and the resignation of two student representatives in the advisory council as well as the CA's national security adviser. Jamaat has demanded a timeline for the election and another for reforms and trials of Awami League leaders for their alleged role in mass killings during the July uprising. Meanwhile, the NCP has demanded reconstitution of the Election Commission, local government polls before the general election, and roadmaps to July killing trials, political reforms, and plans for parliamentary and constituent assembly polls. It also added another demand: that all national and local elections during the Sheikh Hasina regime be declared \"invalid.\"\nThus, we are back to square one, with no visible consensus between the government and the political parties. Meanwhile, protests and lockdowns continue. Yesterday, employees of the Bangladesh Secretariat staged demonstrations inside the office premises protesting the government's initiative to amend the Government Service Act, 2018 by introducing stricter penalties. The Dhaka South Nagar Bhaban has again been padlocked by protesters who demand BNP leader Ishraque Hossain to be sworn in as the mayor following a court verdict. The NBR is in deep crisis with disgruntled employees continuing to protest, demanding the chairman's removal and the repeal of a new ordinance that splits the tax authority. Customs clearance and business operations have been hampered due to the protests. The result has been total chaos and disruption in regular public services and businesses, as well as paralysis of the city.\nBut, ultimately, the interim government and its chief are responsible for maintaining stability—both within the country and within the government. It must find ways to negotiate with all the political and non-political stakeholders and come to some points of convergence. The government has identified three main priorities: election, reform, and trial (of the accused in the July uprising killings). But in order to allay all uncertainties and curb the barrage of constant protests, the interim government must provide clarity regarding an election roadmap and the reforms it is undertaking.\n",
        "headline_1": "A major national crisis averted, but what’s next?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/major-national-crisis-averted-whats-next-3903136",
        "news_paper_name": "The Daily Star",
        "publish_date": "26-05-2025"
    },
    {
        "full_article": "In 1913, the German scientist Fritz Haber successfully synthesised ammonia from atmospheric nitrogen—a breakthrough that laid the foundation for modern chemical fertilisers. Since then, scientists have continually developed new technologies to meet the growing food demands. The most recent and notable addition to this progress is nano-urea, hailed as a groundbreaking advancement in the agricultural sector.\nBangladesh, with its predominantly agrarian economy, relies heavily on fertilisers to meet food demands. To cope with the growing population, climate change, and environmental challenges, scientifically sound and sustainable technologies must be adopted in agriculture. Experts believe that the integration of nanotechnology in agriculture will play a transformative role in ensuring food security and promoting sustainable development.\nAmidst global urea shortages, the demand for and necessity of nano-urea is immense. The Bangladesh Chemical Industries Corporation (BCIC) oversees several fertiliser plants, with a combined annual urea production capacity of approximately 2.3 million metric tonnes as of FY 2024–25. In the FY 2023–24, Bangladesh Chemical Industries Corporation (BCIC) produced about 527,271 metric tonnes of urea, necessitating the import of 1.66 million metric tonnes to meet the total demand. Despite efforts to boost domestic production, Bangladesh still relies heavily on imports. In this context, nano-urea offers a promising solution to tackle present and future challenges in fertiliser supply and sustainability.\nThe use of fertilisers dates back to ancient times, with early civilisations like the Egyptians, Babylonians, and Romans applying natural substances to enrich soil. Scientific approaches emerged in the 18th century with crop rotation and gypsum use. In the 19th century, Justus von Liebig popularised the Law of the Minimum which states that a single and essential resource restricts plant growth even if other resources are abundant, while John Bennet Lawes founded first chemical fertiliser factory. The 20th century brought major advances, including the Haber-Bosch process in 1913, which enabled industrial-scale ammonia production and transformed global agronomy. This legacy of innovation continues today with the advent of nano-urea—a promising frontier in sustainable agriculture.\nUrea is an essential nutrient for plant growth. Like food for humans, fertilisers nourish plants. For healthy and balanced growth, plants require a specific set of nutrients, without which their development is impaired. The three primary macronutrients in fertilisers are nitrogen (N), phosphorus (P), and potassium (K). Urea, chemically known as carbamide contains about 46 percent nitrogen, a key component of proteins crucial for vegetative growth. It is highly water-soluble and stable, enhancing the growth of leaves, stems, and overall productivity of the plant.\nHowever, a major drawback of conventional fertilisers is the loss of nutrients after soil application, due to factors like rainwater runoff and evaporation. As a result, plants are often deprived of their required nourishment.\nIn contrast to conventional urea, the nanotechnology-based fertiliser uses ultrafine particles (20–50 nanometres) and requires up to 80 percent less volume with equal or better yields. A single 500 ml bottle of nano-urea can replace a 45-kg bag of traditional urea. Applied as a foliar spray, nano-urea is directly absorbed by plant leaves, minimising nutrient loss. It delivers nitrogen gradually, ensuring sustained nutrition and reduced environmental harm. As a result, nano-urea is eco-friendly, efficient in smaller quantities, and economically viable—emerging as a promising tool for the future of sustainable agriculture.\nCurrently, India is leading the production and marketing of nano-urea. Indian Farmers Fertiliser Cooperative Limited (IFFCO) launched the world's first nao-urea in June 2021, marking a breakthrough in sustainable agriculture. IFFCO now has the capacity to produce approximately 200,000 bottles daily. By the end of 2024, the company aims to scale up annual production to three billion bottles, equivalent to 13.5 million tonnes of conventional urea. Nano-urea is already being exported to more than 25 countries, including the United States, Brazil, Mexico, Sri Lanka, and Kenya.\nBangladesh has also begun research on nano-urea as part of agricultural extension efforts. In a recent article, Dr Md Roushon Jamal highlighted the growing importance of nano-urea in the country. Although the use of nanotechnology for urea production is still in its early stages in Bangladesh, institutions like Bangladesh University of Engineering and Technology (BUET), Bangladesh Agricultural University (BAU), and Gazipur Agricultural University (GAU) have initiated exploratory research in this field. Notably, Prof Dr Md Jabed Hossain Khan, a professor of the Department of Chemical Engineering at Jashore University of Science and Technology (JUST), has made a significant breakthrough by successfully developing a locally produced nano-urea fertiliser. According to his findings, cultivating one bigha of land would require only Tk 230 worth of nano-urea—a stark contrast to the current cost of around Tk 4,200, suggesting a potential cost reduction of approximately 82 percent. However, extensive research is still needed to fully understand the effects of nano-urea due to its unique composition and nanoscale properties.\nFrom early dependence on organic fertilisers to the chemical revolution introduced by conventional urea, agriculture is now entering a new era with the advent of advanced nano-urea. To build a resilient agricultural future, Bangladesh must adopt a holistic strategy that promotes research and development, enhances logistics and infrastructure, supports farmer training programmes, ensures the production of nano-urea that meets global standards, and encourages its field-level application. With these measures in place, Bangladesh holds the potential to build a green, sustainable, agriculture-based economy. And nano-urea could be a key driving force in realising that vision.\nDr Md. Wasikur Rahman is professor at the Department of Chemical Engineering, Jashore University of Science and Technology and assistant research scientist at the Department of Mechanical Engineering at the University of Texas Rio Grande Valley. He can be reached at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Research into nano-urea can transform our agricultural sector",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/research-nano-urea-can-transform-our-agricultural-sector-3902906",
        "news_paper_name": "The Daily Star",
        "publish_date": "26-05-2025"
    },
    {
        "full_article": "At a time when chaos and uncertainty are gripping the nation—thanks to wave after wave of protests, ever-widening political divides, and, to cap it all off, striking reports of a potential resignation by a \"frustrated\" Dr Yunus—it may be tempting to dismiss their cumulative effects on citizens as mere trivia in the bigger scheme of things. But this is precisely where we must turn our attention, for ultimately, it is the only thing that truly matters. It is also the only reality that is clear amid the thickening smog of confusion that envelops us. True, we need to find a way to ensure that the aspirations of a new Bangladesh are preserved at all costs. But treating citizens' daily well-being as collateral damage in the pursuit of that future would not only be short-sighted, but also counterproductive.\nThis is what comes to mind after seeing Dhaka residents suffer through yet another agonising day on Thursday. From morning till late afternoon, large parts of the city including Shahbagh, Kakrail, Matsya Bhaban, Purana Paltan, Gulistan, Motijheel, Jatrabari, and other connected streets were choked with traffic, bringing life to a near standstill. This was largely due to various protests and political demonstrations, including by groups affiliated with BNP. The problem was further compounded by poor traffic management, waterlogging from scattered bouts of rainfall, dug-up roads left unrepaired by utility agencies, VIP movements, etc. As traffic stood still for hours, thousands were forced to walk through sludge-filled roads and broken pavements. Some, while talking to this daily, described the situation as a \"trap,\" with no way forward, backward, or out.\nIn recent days, the frequency of such protest-induced blockades at peak hours has left commuters quite exasperated, especially as rain and summer heat coalesced to increase their sufferings. The sufferings of the elderly and women, particularly those travelling alone or with children, have been even more severe. This situation can no longer be justified by paying homage to the right to protest, which, while an inalienable democratic right, cannot be allowed to infringe on the rights of so many others: the right to freedom of movement, right to access healthcare, right to work and livelihood, right to public safety, right to education, etc. Any protest, therefore, must be exercised responsibly, without turning citizens into hostages of political agendas and group interests.\nAfter about nine months of living in such a charged atmosphere, the question is no longer how we in Dhaka got here, but how much longer this can continue. Clearly, citizens have had enough of such disruptions. They need a break from the continued street chaos. We urge the government, political parties, and all other stakeholders of the July uprising to urgently collaborate to ensure that basic civic life is not held hostage by the unchecked protest politics.\n",
        "headline_1": "This is not how a city can survive",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/not-how-city-can-survive-3901516",
        "news_paper_name": "The Daily Star",
        "publish_date": "26-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 26, 2025 12:00:00  \nThe price of rice, the staple food of Bangladesh, has long been an overriding concern for the general public, as it significantly affects living expenses of a majority of the people due to their limited incomes. Unlike other consumer goods, where consumption can be reduced in response to price hikes, rice is a non-negotiable necessity. As the rice price continues to rise steadily, low-income families are forced to spend a disproportionate share of their income on rice alone, cutting back on fish, meat, and other essential sources of protein. Rice price, therefore, is a particularly sensitive and politically charged issue. Yet the rice market continues to be dominated by a handful of large millers and traders who, through hoarding, artificial shortages, and exploitation of farmers, manipulate the market for windfall profits. This monopolistic market regime, enabled by weak regulation and lack of transparency, puts both consumers and producers at a severe disadvantage.\nSince the interim government assumed office, it has undertaken a range of measures to curb inflation, including adoption of a tight monetary policy, waiver on import duties, and increased market surveillance. Those have a reflection on prices of some essential commodities in recent months. But rice remains an exception. The government removed import duties and permitted over 200 private companies to import rice so far. Despite substantial imports, rice prices have remained stubbornly high. A modest decline has only been observed recently, thanks largely to the Boro harvesting season and a bumper yield. However, this relief may be short-lived. The Special Branch (SB) has already warned of potential instability in the rice market once the post-harvest period ends. The market remains highly vulnerable to manipulation by powerful interest groups.\nThe intelligence report shared with the Ministry of Commerce points to intensifying competition among rice millers and affiliated traders to acquire paddy in bulk, which is an early sign of syndicate-driven stockpiling that has historically led to artificial price surges. Without strict regulation, such practices can distort the market. So, the SB has recommended that the Department of Agricultural Marketing (DAM) take urgent steps to monitor and curb illegal hoarding and market manipulation. It has also advised that the government directly purchase paddy from farmers early in the season, which would not only boost government grain reserves but also ensure fair prices for producers.\nNext, boosting the Trading Corporation of Bangladesh's (TCB) open market sales at affordable prices is essential for stabilising the rice market. Symbolic efforts alone are not enough. Long queues of people before TCB trucks speak volumes for the public's desperation in a time of high inflation. The TCB must be empowered with adequate resource, logistics and manpower to carry out regular, large-scale sales of rice to low-income populations in order to have a meaningful impact on the market. At the same time, firm action should be taken against syndicates. The government must not only monitor market activity more closely but also prosecute those involved in illegal stockpiling and price manipulation. Equally important is to ensure that policy decisions are made on accurate and timely data. Verifying actual rice production figures will allow the government to make evidence-based decisions on domestic procurement and import planning. The Ministries of Agriculture and Food can play a proactive role in this regard. With the right policies, strong regulation, and a commitment to ensure a transparent supply chain, the government can streamline the rice market and protect the interests of both farmers and consumers.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Warning over rice market instability",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/warning-over-rice-market-instability-1748188971",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       May 26, 2025 00:00:00  \n\nThe interim government in the upcoming national budget for the FY 2025-26, is reportedly going to restructure the Social Safety Net Programme (SSNP) by reducing the number of beneficiary schemes while at the same time increasing total monetary allocation as well as the number of beneficiaries. \nThe reasons for the inflated sizes of the current and previous SSNP budgets are that they had overlap of schemes and included other expenditures such as payments against pension for public servants and interest payments against savings certificates, etc., though the whole purpose of the SSNP is to alleviate poverty. Under the ongoing budget of SSNP for FY2024-25, for instance, the number of schemes is 140. In the FY 26, one third of the existing schemes would be cut bringing the total to around 100. But the total allocation would be increased from the present Tk 904.68 billion to Tk959.08 billion, which would be 12.5 per cent of the outlay for the national budget for FY26. But under the current fiscal (FY25), the allocation for SSNP is 11.35 per cent of the budget. The increment of the mentioned figures relating to the SSNP in the next budget is no doubt well-intentioned. However, improving the condition of the targeted beneficiaries, as always, will depend on efficiency of the mechanism to reach the actual beneficiaries. \nIn fact, even under the previous autocratic government, the budget for SSNP or the number of targeted beneficiaries saw similar enhancements with the arrangements for transferring the allowances digitally through mobile financial service (MFS). But the problems creep in through various flaws in the system. Firstly, problem lies with local representatives who decide the identities of the beneficiaries. The 2022's Household Income and Expenditure Survey (HIES) showed that 53.9 per cent of the poor and vulnerable families were excluded from social protection schemes simply because there were exclusion errors, while 62 per cent of the non-poor and non-vulnerable households received some forms of benefit due to inclusion errors. In this connection, to address such shortcomings of the SSNP, in the National Social Security Strategy (NSSS) of 2015, a life-cycle approach was adopted. The focus of the approach was to take into consideration the vulnerabilities and needs the people are exposed to at different stages of their lives, say, from childhood to old age. \nBut the taskforce the interim government created in September 2024, in a report submitted last February found that most social safety net schemes failed to align themselves with their core objectives of addressing poverty. Essentially, the absence of robust income support measures left a critical gap in tackling both moderate and extreme forms of poverty. For instance, according to the Bangladesh Bureau of Statistics (BBS), between 2010 and 2022, the poverty rate fell from 31.5 per cent to 18.7 per cent. It marked an annual decrease in moderate poverty by 1.07 percentage points. Similarly, the extreme poverty dropped from 17.6 per cent to 5.6 per cent. That means, over the period, average annual rate of decline in extreme poverty was by 1.0 percentage point. In absolute terms, the number of people in poverty declined from 45.4 million in 2010 to 30.9 million in 2022. Similarly, people in extreme poverty fell from 25.3 million to 9.3 million. By correcting inclusion errors and reallocating resources, the results could be further improved. For instance, it could increase the percentage of decline in extreme poverty by 1.3 percentage points and that of moderate poverty by 2.5 percentage points, according to the said taskforce report. \nThe problem is, poverty research and its statistics are essentially based on samples and questionnaires to have a notion about the number of the poor and the level of poverty and dole out some allowances in cash and kinds accordingly. This cannot go to the heat of the issue. That is the main reason why poverty reduction through approaches such as SSNP will remain just a palliative care, not a cure, of the social disease called poverty. It does not mean that such programmes are useless. In absence of income generation activities for the poor, these can be stopgap measures. But in the long term, the goal should be building a society that can look after every member made vulnerable either by poverty or abandonment or illness or age. Among women, widowed or abandoned, one could fare better in their fight against poverty if the money they get in the form of periodical allowance were only sizeable enough to start an income generating activity. Even disabled and old people could be rendered productive if their special abilities or life experiences could be exploited through innovative income generating schemes tailored to their respective abilities. In fact, all human beings want to be useful for society. But for them to be able to contribute, society needs to come forward. Consider the amount being earmarked for SSNP, which is over Tk 959 billion. It is a humongous sum of money. If contribution from philanthropists, cheap bank finance and other forms of social resources could be added to that, targeted income generation (IG) schemes for different categories of the extreme and moderate poor and vulnerable groups could be designed and financed from that fund. With the help of AI, IG schemes for even every single individual could be conceived of. People so served by the IG schemes would become self-reliant and proud members of society. If only a nationwide enumeration of people in extreme poverty through a census and a database based on it could be developed and updated regularly, a better approach to remove poverty was possible to devise. \nUntil that happens, the recasting of the SSN schemes, regrouping 38 schemes, as suggested by the European Union and other development partners, under a pro-poor section, increasing cash assistance for an individual beneficiary by amounts ranging from Tk50 to Tk100 and so on are no mean measures. Moreover, a more transparent and streamlined SSNP with increased beneficiary coverage will definitely serve the intended beneficiaries better than before.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Streamlining pro-poor  safety net schemes",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/streamlining-pro-poor-safety-net-schemes-1748189060",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       May 26, 2025 00:00:00  \n\nHighway robberies have ever remained a problem in this country. A number of rape incidents on running buses added a new dimension to the highway crimes. Of late, both robbery and sexual violence against women passengers on moving buses made some screaming headlines. But the administration has not set in motion its forces with a sense of urgency either to protect passengers in vehicles on move on highways or nab the criminals who have already committed such crimes. This lax attitude on the part of the authorities sends a wrong message to the perpetrators of crimes. \nNow comes the disturbing news that an ambulance carrying the body of a cancer patient and the mourning members of his family accompanying it released from a Dhaka hospital was attacked by dacoits at Nasirnagar, Brahmanbaria on way to a village under Purbabhag Union of the district. Not only were the members of the family of the deceased assaulted because they did not carry more than Tk 50,000 in cash and valuables other than nine cell phones, but also struck the corpse with indigenous weapons. \nThat an ambulance carrying a dead human body can be attacked for looting valuables is unimaginable. It defies the minimum sense of respect for the dead, religious customs and tradition irrespective of faiths and the barest consideration for the grieving people who have just lost one so close to them. This is sacrilege at its worst when even the deceased is struck with a stick or any weapon. Every religion, society and culture considers this an act of desecration or profanity. \nRobbers are not expected to be guided by reasons, religious teachings and laws but they are after all human beings. Sure enough, not all of them are cruel and hardened criminals. There are instances where a group of robbers or its leader looted from the rich to help the poor. A representative of the Robin Hood archetype was bandit Veerappan who had his hideouts in the dense forests of Tamil Nadu, Karnataka and Kerala. Even some small acts of generosity by robbers or muggers in the past proved that not all of them sold their souls to the devil. For example, when these anti-social elements discovered after robbing their victims of their money and valuables that the latter had nothing left, they returned back money equivalent to the transport fare to the destinations. \n Since the July-August uprising, the robbers and muggers seem to have turned more ruthless and violent in their treatment of their victims. The anger at and hatred for common people they find under their control are visceral. They unleash cruelty and violence on their victims indiscriminately. An epidemic of social antagonism seems to have influenced their behaviour. True, social inequality and a lack of employment together with termination of more and more workers have pushed some to such desperation. If violence breeds violence, so does the breach of social contract such as sacking of workers or employees at short notice. When they find no alternative jobs or self employment, some are likely to grow desperate. There were reports of such fired employees taking their own lives. In a few tragic cases, the couples killed their children before bringing an end to their own lives. \nOn the other side of the story, some joined gangs of thieves, muggers and robbers in order to eke out a living. Clearly, the hopes and aspirations of such people have been dashed. Many of them joined the uprising hoping for a change in their abject living conditions but nothing changed. Only the professional and organised groups pressed for their coterie interests---some successfully others failing miserably. Either way, it is those common and innocent people at the bottom rung of society who have no organisation and no nuisance value on the city streets are further discriminated against at a time when the country is in an economic turmoil.\n \nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Desecration of human body at its worst",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/desecration-of-human-body-at-its-worst-1748189102",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 26, 2025 00:00:00  \n\nA large section of Bangladeshi investors, particularly middle-income and retail investors, stay away from conventional investment instruments for religious reasons. Conventional mutual funds, bonds, or savings instruments may carry interest (riba) or may get invested in non-sharia-compliant sectors like alcohol or gambling. A vast pool of savings, therefore, goes untapped or invested in the off-book system. An injection of additional Shariah-compliant instruments like Islamic mutual funds, Sukuk (Islamic bonds), or Halal equity portfolios can mobilise this idle capital into the formal sector. Additionally, there is tremendous potential in mobilising the Bangladeshi diaspora, especially in the Middle East. Since billions of dollars are remitted to the country annually, offering these workers shariah-compliant, faith-based investment in their native country can tap formal investment.\nHowever, there are some problems to be addressed. There are very few certified Shariah-compliant asset management products in the market as of today. Regulatory support is minimal, and investors are still not familiar with Islamic finance. There is also a lack of a centralised Shariah board to advise and certify investment products.\nIn order to create this environment, Bangladesh must have an overall strategy. First, regulators such as the Bangladesh Securities and Exchange Commission (BSEC) must sit with Islamic scholars and financiers to develop clear guidelines and a Shariah governance structure. Second, financial institutions must be encouraged to introduce innovative Islamic investment products to the market, either through tax concessions or regulatory ease. Third, awareness and education campaigns must be launched in order to create confidence and awareness among prospective investors.\nMalaysia and Indonesia have demonstrated that, with appropriate policies, Shariah-compliant finance can draw both domestic and international investors. Bangladesh possesses the demographic, cultural, and economic basis to emulate their example. By adopting Islamic asset management, Bangladesh can render its financial system more inclusive, ethical, and investor-friendly.\nAtikur Rahman\nStudent\nBBA Department\nNorth South University\natikur.rahman.nsuf@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Future of Shariah-based investment",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/future-of-shariah-based-investment-1748189121",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-05-2025"
    }
]