[
    {
        "full_article": "Addressing the two-day All India Speakers’ Conference in New Delhi on August 24, 2025, Union Home Minister Shah called attention to the frequent disruptions that have paralysed deliberations in Assemblies and Parliament. His point that “debate must take place in a democracy” is beyond any debate. But when one goes beyond the truism, a picture of India’s representative democracy in distress emerges. Bitterness between the government and the Opposition has erased the scope for any common ground, and Parliament has been reduced to a theatre of mutual diatribe. His remarks followed soon after the Opposition’s protests, demanding a debate on the Special Intensive Revision of electoral rolls in Bihar, that led to repeated adjournments. Most of the legislative business was carried out with little or no debate. In a session with 21 sittings spread out over 32 days, 15 Bills were passed. According to PRS Legislative Research’s analysis, the Lok Sabha functioned for 29% of its scheduled time, and the Rajya Sabha for 34% — the lowest functioning seen during the 18th Lok Sabha. Two-thirds of the planned time was lost to repeated adjournments. In the Lower House, only 8% of starred questions received an oral reply, while it was 5% in the Upper House. On 12 days in the Rajya Sabha and on seven in the Lok Sabha, no questions were answered orally over the 21 days. Question Hour, an instrument of executive accountability, has been rendered ineffective.The dysfunction of legislatures is linked to concentration of power in the chief executive, the Prime Minister and Chief Ministers. According to the Annual Review of State Laws 2024 by PRS Legislative Research, State Assemblies met for an average of just 20 days in 2024, down from 28 in 2017. Larger States such as Uttar Pradesh and Madhya Pradesh recorded only 16 sitting days, while Odisha and Kerala led with 42 and 38 days, respectively. More than half the Bills were passed on the same day, with little debate. Eight Assemblies do not have a Deputy Speaker; the Lok Sabha has not had a Deputy Speaker since June 2019. Parliamentary committees that used to be a platform for more deliberative and less acrimonious debates have also become vulnerable to partisanship. It is propitious that Mr. Shah thinks that there should be more debate in legislatures, but it will be meaningful only when the government translates that view into action by engaging with the Opposition. A starting point can be a consensus election of an Opposition leader as the Deputy Speaker of the Lok Sabha.READ MORE Published - August 26, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        parliament\n                    \n                            /                      \n                        \n                        Parliament proceedings\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        Lok Sabha\n                    \n                            /                      \n                        \n                        Rajya Sabha\n                    \n                            /                      \n                        \n                        Uttar Pradesh\n                    \n                            /                      \n                        \n                        Madhya Pradesh\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        political parties",
        "headline_1": "​Beyond debate: On debate and India’s democracy",
        "headline_2": "Dysfunction of legislatures is due to concentration of power in the executive",
        "link": "https://www.thehindu.com/opinion/editorial/beyond-debate-on-debate-and-indias-democracy/article69976155.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "26-08-2025"
    },
    {
        "full_article": "In the first such visit in 13 years, Pakistan’s Foreign Minister Ishaq Dar travelled to Dhaka over the weekend to meet with members of the Bangladeshi interim government, headed by Muhammad Yunus, and hold talks with his counterpart, Touhid Hossain. Ties had been tense since 2009, when Sheikh Hasina came to power, and under strain over the prosecution of those who colluded with Pakistan during the 1971 liberation war — and the assassination of her father Sheikh Mujibur Rahman and most of her family in 1975. In 2015, Bangladesh demanded the expulsion of a Pakistani diplomat over links to a terror group and recalled its High Commissioner to Islamabad after Pakistan protested the hanging in Bangladesh of those found guilty of collusion in 1971. Although the two nations subsequently restored envoys, they began to repair ties after Ms. Hasina’s ouster last August. The process was also nudged by China, which convened a trilateral mechanism with Bangladesh and Pakistani officials in Kunming. In Dhaka, there was agreement to restore visa facilitation for diplomats, have direct flights, grant scholarships for Bangladeshi students and ways to enhance trade from current lows of less than a billion dollars. However, the Yunus government has refused to move on decades-old Bangladeshi demands for reparations from Pakistan. These include a formal apology for the genocide in 1971 perpetrated by Pakistani forces, financial compensations and the repatriation of thousands of “Stranded Pakistanis” or Urdu-speaking Muhajirs who had migrated there after Partition and still held allegiance to West Pakistan. While meeting Mr. Dar, Mr. Yunus also called for strengthening regional cooperation, including a revival of the SAARC process. India has eyed the thaw in Islamabad-Dhaka ties with some suspicion, given reports that Pakistani diplomats supported Jamaat-e-Islaami student activists during the anti-Hasina protests last year. Of greater concern has been military and intelligence contacts.While there is no question that New Delhi has cause to feel cut out and bruised by the new-found bonhomie between an erstwhile ally and a long-time foe, it is time that South Block adopts a more realistic prism. Pakistan is stepping into the breach caused by the strain in India-Bangladesh ties. Although Mr. Modi met Mr. Yunus in April and External Affairs Minister S. Jaishankar met Mr. Hossain on the side-lines of other international events, neither has contemplated a visit, nor has Mr. Yunus been invited. With the announcement of elections in Bangladesh, in February, New Delhi must also broaden its political engagement with political parties there, even as it nudges the Yunus government to a more inclusive process. In the absence of a stronger regional South Asian grouping, New Delhi has a difficult task in holding sway over bilateral ties between any of its neighbours, especially Bangladesh and Pakistan.READ MORE Published - August 26, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Bangladesh\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        war\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        air transport\n                    \n                            /                      \n                        \n                        students\n                    \n                            /                      \n                        \n                        SAARC\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        ministers (government)",
        "headline_1": "​Friends and foes: On Bangladesh-Pakistan ties",
        "headline_2": "Pakistan is filling the void created by the alienation of India from Bangladesh",
        "link": "https://www.thehindu.com/opinion/editorial/friends-and-foes-on-bangladesh-pakistan-ties/article69976130.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "26-08-2025"
    },
    {
        "full_article": "The Supreme Court told people in Bihar who were wrongly removed from voter lists to use their Aadhaar card to re-enroll. But just using Aadhaar won’t fix all the problems. To get back on the voter list, people have to fill a form called Form 6. It asks for your Aadhaar number, and if you don’t have one, you have to tick a box saying so. Aadhaar is also used to prove your age and where you live. This is confusing because the Election Commission (EC) isn’t always clear about whether Aadhaar is required.\nThe confusion is worse because the EC has arguments with political parties, who are important in running elections. Sometimes the EC says parties haven’t raised enough claims about voters being wrongly removed, but the parties say it’s hard because each voter needs a separate form. With 65 lakh (6.5 million) people removed, it’s almost impossible to fix quickly.\nThe EC also seems impatient with political parties, even though it’s the Commission’s job to make sure everyone can vote. Many people are busy with farming or dealing with floods, so they can’t always check the voter lists. By August 25, only about 1.4 lakh (140,000) claims had been received, and only 14,000 sorted out. Political parties have warned that rushing the voter list is a bad idea, especially before big elections.\nIn times like these, the EC’s job is very important. It needs to focus on making fair and accurate voter lists, not arguing with political parties.\n\n",
        "headline_1": "The 65 Lakh Question",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/the-65-lakh-question/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-08-2025"
    },
    {
        "full_article": "Sometimes when people build too much without thinking, things go wrong. That’s what happened in China with a company called Evergrande. It borrowed a huge amount of money (about $300 billion!) and quickly became the biggest builder in the country. For a while, everything looked great — the boss even became the richest man in Asia.\nBut here’s the problem: Evergrande and other builders kept making more and more houses, even when people didn’t need them. China ended up with empty apartments — enough to house three times its population! Eventually, the company couldn’t pay back its loans. The housing market crashed, prices fell, and people lost jobs. China’s economy slowed down too.\nIndia should pay attention. Right now, real estate (houses and buildings) is a smaller part of India’s economy. But already, big cities have over a million unsold homes, many of them super expensive. New towers are being built, but lots of apartments stay dark at night because nobody lives there.\nIf India keeps building homes that people can’t afford, the same kind of “bubble” could burst here too. And when bubbles burst, it hurts everyone — families, workers, and the economy.\nLesson: Build what people actually need, not just shiny empty towers.\n\n",
        "headline_1": "Evergrande’s Big Fall: A Lesson for India",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/evergrandes-big-fall-a-lesson-for-india/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-08-2025"
    },
    {
        "full_article": "PM’s announcement of next-gen GST reforms by Diwali has generated immense optimism in business, and been cheered by markets. In his Independence Day speech, Modi had said GST reforms “will bring down tax burden on the common man. It will be a Diwali gift for you.”\nSoon after, the finance ministry said it had recommended a two-tier system placing the vast majority of items under ‘standard’ and ‘merit’ categories, doing away with the 12% and 28% slabs, and the group of ministers (GoM) on GST rate rationalisation has already accepted this proposal.\n\nRead more on TOI+ \n\n",
        "headline_1": "5 ideas for blockbuster GST reforms",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/5-ideas-for-blockbuster-gst-reforms/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-08-2025"
    },
    {
        "full_article": "How much polarisation can a democracy bear before it breaks? India may be about to find out.\nWe, the people of India, have always argued, sometimes disagreed, yet we resisted the temptation to let differences divide us beyond repair. Our unity was never uniformity, it was a conscious choice we made together.\nThat fragile art of coexistence is now under strain.\nIndia is a union of states bound by shared destiny. Federalism is not a concession but the very grammar of our Republic, written into the Constitution. India is not a single note; she is an orchestra. The Constitution conducts this diversity, each state an instrument, each voice essential to the harmony. The Centre, like a conductor’s hand, must remain steady and impartial. When centralisation drowns out this music, the Republic loses not just its melodious anthem but its spirit.\n\nRead more on TOI+\n\n",
        "headline_1": "‘Centrism isn’t nostalgia, it is survival’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/centrism-isnt-nostalgia-it-is-survival/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-08-2025"
    },
    {
        "full_article": "Ten women vying for top positions in the upcoming Dhaka University Central Students' Union (DUCSU) election is a welcome change for women's political participation in Bangladesh. Although women, especially students, have always been at the forefront of major revolutions, including the recent July uprising, their political leadership at the national level has long been undermined by the prevailing dynastic political culture, and most top positions have been held by men. Even the last two DUCSU elections, in 2019 and 1990, saw very few or no women contesting for top posts. And in independent Bangladesh, no woman has yet held the vice-president (VP) or general secretary (GS) position. Against that backdrop, this year's DUCSU election is significant: five women are competing for the VP post, one for GS, and four for assistant general secretary.\nHowever, the overall number of female candidates in both DUCSU and the Jahangirnagar University Central Students' Union (JUCSU) polls remains low compared to male candidates, although the final lists have yet to be confirmed. So far, 402 male candidates have been cleared for 28 DUCSU posts, compared to only 60 women. Similarly, for JUCSU's 25 posts, 276 nominations have been filed, of which only 57 are women. And of them, 43 are for six reserved seats for women. What is more disappointing is that no female candidate at JUCSU is running for VP. Although registered female voters in both universities are nearly equal in number to male voters, when it comes to actual political participation, women remain sidelined. Not surprisingly, student wings of major political parties reflect their parent parties' attitude towards female representation. For instance, the panels of Jatiotabadi Chatradal, Islami Chhatra Shibir, and Islami Chhatra Andolan have not nominated any women for DUCSU's top three posts. At JUCSU, the Jatiotabadi Chatradal- and Islami Chhatra Shibir-backed slates nominated female students only for reserved seats.\nWhile these party wings have failed to create space for women leaders, other factors also discourage female participation in campus politics. This is evident from the low number of nominations from female halls at Jahangirnagar University, leaving many posts uncontested at the female dormitories. According to a report in this daily, several female leaders from last year's mass uprising are absent from the JUCSU ballot. Many of them feel undervalued post-uprising. Cyberbullying, harassment, family restrictions, and a lack of inclusive, female-friendly campuses have also contributed to this disengagement.\nDespite the obstacles, Umama Fatema, SK Tasnim Afroz Emi and their comrades in the fight for female leadership are not backing down. We applaud their resilience and hope that, if elected, they will work to fulfil their electoral promises and help build an inclusive, non-partisan, safe campus for all students.\n",
        "headline_1": "Women eyeing top DUCSU posts sparks hope",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/women-eyeing-top-ducsu-posts-sparks-hope-3968471",
        "news_paper_name": "The Daily Star",
        "publish_date": "26-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 26, 2025 00:00:00  \nBangladesh had long tried to be a lucrative investment destination for foreign countries and companies. The result was mix. But at a time when Donald Trump's reciprocal tariff has upset the world order of trade and commerce, an unexpected window of opportunity has opened before Bangladesh against all odds. This is the Chinese firms' interests in investment or relocation of their manufacturing units in this South Asian neighbour. That the country Trump considered its rival may have suddenly found a mutually beneficial investment climate here is quite logical. Actually, the clinching factor was the last-minute diplomatic foray which succeeded to negotiate -- no matter with some clauses reserved for non-disclosure -- a reduction of reciprocal tariff from 35 to 20 per cent. Already, a number of Chinese companies have signed deals with the Bangladesh Export Processing Zones Authority (BEPZA) and more are likely to follow suit soon. Even a South Korean firm has also signed a deal for investment of $8.06 million in Mongla Export Processing Zone (EPZ).\nHowever, China has come forward in a big way with 45 of its companies committing over $1.0 billion in investment. Five of those industries have started commercial operation, another five are well set to start operation soon and 22 factories are under construction. But the number does not speak the full story. The manufacturing Chinese firms that are entering Bangladesh are of diverse nature -- not limited to readymade garment (RMG). From footwear to household products and bags to lingerie and undergarments in which Chinese companies have ruled the roost the production and export basket here will receive expansion and diversity. Even the Korean firm has added an unconventional dimension to the export basket by taking up production of tents and tent-related accessories, camping chairs, trekking gears, arrows and pet furniture. All such initiatives add diversity to Bangladesh's production range and export basket.\nYet another immediate benefit is the likely creation of 19,000 jobs for the nationals of the host country. But where the industrial sector is likely to get the greatest boost is the introduction of advanced and economical factories and industries with their cutting-edge technology. All the units which have started operation so far and clinched the deals with the BEPZA will use water economically and have solar panels along with the arrangement for harvesting rain water. Bangladesh may thus have a paradigm shift in manufacturing mechanism and investment order. Other countries vastly affected by Trump's tariff may as well find Bangladesh a lucrative destination for investment.\nWhile all this goes in favour of Bangladesh, there are some restrictive clauses in the bilateral agreement with America. This was disclosed during the agreement reached between Vietnam and the USA. For example, components originating in other countries or having foreign copyright -- primarily meaning China here -- will not fall under the concessionary tariff negotiation. It is not unlikely to be any different for Bangladesh. How the Chinese firms and the BEPZA tide over the critical issue will be of importance. However, in case of exporting goods from manufacturing plants of foreign origin to European market, there should be no such problem. The authorities concerned in Bangladesh and China will have to apply their diplomatic and commercial acumen at its best in this regard.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bangladesh as a lucrative investment destination",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bangladesh-as-a-lucrative-investment-destination-1756137761",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       August 26, 2025 00:00:00  \n\nBangladesh stands at a defining moment in its political journey. The fall of authoritarian rule opened an unprecedented window for change -- a chance to reshape the country's political culture and set it firmly on the path of democratic accountability, citizen-oriented governance, and the rule of law. Yet, the reality unfolding in recent months paints a far more troubling picture. Instead of capitalising on this historic opportunity, sections of leaders and activists across the political spectrum seem to have embraced an attitude of \"now it's our turn,\" using power not as a tool for service but as a license for abuse.\nThis mindset is being manifested in ways that are not only harmful but deeply corrosive to the ideals of democracy. Extortion, land grabbing, looting of state resources, trading in lawsuits, arrests and bail, abuse of political tags, violent clashes for party dominance -- all of these are becoming disturbingly common. The very culture that people wanted to end seems to be reemerging, only with different actors. It is as if the fall of one authoritarian structure has created opportunities for many of the same characteristics to emerge and engage in a battle to establish their respective influence and control. \nThe democratic promise of a \"New Bangladesh\" is being undermined from within. When authoritarian regime fell, there was widespread optimism that the country would witness the growth of inclusive politics and institutions rooted in accountability and fairness. But instead of nurturing this opening, some factions within influential political parties have chosen to mimic the excesses of the very regime they opposed.\nWhat makes this trend especially alarming is such excesses are seen as normal happenings. Over the past year, activities that were once considered clear violations of political ethics have quietly become routine. Factionalism has intensified. Party positions are openly traded as commodities. Local disputes are settled not by dialogue but by show of force. Intra-party violence has escalated to the point where hartals -- a tactic long associated with national-level confrontations -- are being called even for local disputes.\nWorse still, some fallen political forces, despite being dislodged from power, are complicit or indifferent. Their silence or quiet participation in this culture of criminalised politics signals that the lessons of authoritarian excess have not been internalised. Instead, politics is increasingly seen as an arena of transactional gain rather than public service.\nThe situation is further complicated by the involvement of groups outside the mainstream. Certain religion-based parties, opportunistic local influencers, and vested economic interests are exploiting the fluidity of the current political landscape. Under the pretence of mass mobilisation or \"mob democracy,\" fundamental rights are being trampled. Minorities, indigenous communities, women's rights groups, and other marginalised segments are increasingly finding themselves at the receiving end of intimidation and violence. Cultural and traditional spaces, which should be sources of unity and pride, have become targets of attack.\nSuch developments are more than isolated incidents. They erode public trust. And, also they send a dangerous message: that the promises of democracy and equality were little more than campaign slogans, and that power, once gained, is just another opportunity to dominate. For a society that endured enormous sacrifices to free itself from authoritarianism, this is not just disappointing -- it is demoralising.\nTo be fair, there have been some expressions of concern from party leadership. Warnings have been issued. Some organisational measures have been taken. Yet these steps remain sporadic and insufficient. Law enforcement agencies and administrative bodies, already weakened by years of politicisation, have largely failed to assert control. Worse, in some cases, they have acted as enablers, offering protection to politically connected wrongdoers.\nThe absence of a clear, consistent strategy for reform is glaring. Political parties that campaigned on the promise of a new political order have allowed local-level leaders to indulge in the very behaviours they once condemned. From district headquarters to union councils, extortion and power grabs are not exceptions -- they are becoming norms.\nThis breakdown of accountability is not just a failure of systems; it is a failure of will. If political parties cannot police their own members, if the state cannot restrain its own institutions, then democratic rhetoric rings hollow. A culture of impunity is the fertile ground in which authoritarianism takes root again, even if dressed in new clothes.\nEven political parties born out of anti-discrimination and anti-authoritarian movements are not immune. Despite their rhetoric of transparency and good governance, some of these new forces are already showing signs of the same rot. A portion of their leaders and activists have been implicated in extortion and irregularities, effectively adopting the worst habits of established parties.\nThis is perhaps the most sobering reality of all: that without internal checks, even the most idealistic movements can lose their way. The promise of a \"New Bangladesh\" risks becoming indistinguishable from the politics of the old if the culture of dominance remains unchecked.\nThe question now is not whether Bangladesh can build a democratic culture -- it is whether its political forces have the courage to do so. Political parties must ask themselves some hard questions. Did they fight to topple authoritarianism only to replicate its patterns? Are they prepared to betray the sacrifices of those who struggled, bled, and died for change?\nThe answers to these questions must be found not in words but in actions. The first step is internal reform. Political parties must treat themselves as democratic institutions, not as private clubs for the powerful. They must strengthen internal governance, enforce codes of ethics, and make accountability a non-negotiable principle.\nSecond, they must prioritise the interests of citizens over factional gains. Dialogue, transparency, and respect for dissent must become part of political culture, not exceptions to it. The politics of dominance thrives where dialogue fails. To restore public trust, parties must actively include marginalised voices and protect vulnerable communities from violence and exclusion.\nThird, law enforcement and administrative bodies must be depoliticised and strengthened to act as neutral guardians of order. Their complicity in criminalised politics is both a cause and effect of the current malaise. Without independent institutions, even the best political intentions collapse under the weight of opportunism.\nFinally, political forces must be willing to cooperate across party lines on fundamental democratic reforms. Rivalries will remain -- that is the nature of politics -- but the shared commitment to fair play, accountability, and integrity must transcend narrow interests.\nIf the current trajectory continues, the dream of a \"New Bangladesh\" will remain just that -- a dream. The sacrifices of the July uprising, the hopes of millions who demanded change, will fade into another cycle of disappointment. Public frustration will deepen, and cynicism will harden into disengagement. When citizens stop believing that politics can deliver justice, the space is opened for new forms of authoritarianism to emerge, often harsher and more cynical than before.\nThe time to act is now. Political parties must abandon the culture of dominance, extortion, and impunity. They must return to the core ideals that animated the struggle against authoritarianism: equality, accountability, and service. Only then can the dream of a \"New Bangladesh\" take shape -- not as a slogan, but as a lived reality for its citizens.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "In quest of a new political culture",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/in-quest-of-a-new-political-culture-1756137826",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       August 26, 2025 00:00:00  \n\nWorld Bank (WB) estimates say, some 646 tons of plastic waste are collected in a day in Dhaka. This amount of waste plastic is only about 10 per cent of the total waste generated in the country. However, there are other estimates which vary widely depending on their sources. But what happens to the plastic and other solid wastes produced in the city in such large amounts? There are arrangements through which the city corporations send door-to-door garbage collectors to the city's residential complexes to collect all types of solid waste, not just plastic waste and the local operators of the garbage collection chains charge the residents certain amounts of money for the service they render. One may also come across garbage pickers from underprivileged and vulnerable segments of the population roaming the city streets in search of plastic or other forms of garbage. But the proud residents of the city have no respect for these poor boys and girls scavenging plastic bottle and food wrappers, polythene bags, you name it, from the garbage dumps or the pavements where people carelessly discard plastic containers of foods and water, soft drinks, shopping bags etc.\nIf truth be told, the city people, or for that matter the entire population of the country regardless of their social and economic background, have little awareness about the wastes accumulating every day in the cities and their devastating impacts on the environment. Many of them, however, are theoretically aware of, for instance, the plastic waste and may impress you with their knowledge of how plastics pollute the world's rivers, lakes, oceans and how microplastics have invaded the food chains of humans and other members of the animal kingdom. But you would perhaps draw a blank, if such persons lecturing on plastic waste is asked how they are themselves working to manage their own household wastes or those of their neughbours. \nIt cannot also be said that the government is also doing very well with its umpteen garbage management policies and plans adopted from time to time. Those include the Jute packaging Act of 2010, the Solid Waste Management Rules of 2021, initiatives in collaboration with the Global Plastic Action Partnership (GAAP) to develop multi-stakeholder platforms and work for a circular economy. These high-sounding programmes are good to hear at donor-funded seminars and workshops. But not unlike other such initiatives and researches as on poverty, they often end up on a whimper. \nNo doubt, the plans aim to reduce the cities' plastic waste and recycle those in significant amounts, but the entire effort often comes up against the challenges like poor waste segregation regimes, lack of modern disposal systems, lack of or limited recycling infrastructural facilities and low level of public awareness leading to mismanaged waste flowing into canals, drains and the sea. \nWhen it comes to public awareness about plastic waste, it cannot happen in isolation. That means awareness and participation of the public in managing their community's waste should go hand in hand. The public also needs to hold the poor garbage-pickers of the city with some esteem, if only because they are doing such a great job without being asked to do it. \nHowever, the city of Ambikapur in the central Indian state of Chhatisgarh has hit upon a novel way of honouring the traditional rag pickers who now collect plastic wastes from the city's streets and dumping grounds and get a hot hearty meal of rice and two vegetable curries, or roti (flour chapati), dal (lentils soup), salad and pickles. And all the waste pickers need to do to get the meal is to bring one kilogram of plastic waste to the so-called 'Garbage cafes' of Ambikapur city run by the local local government bodies, the city corporations. The garbage pickers can still have a breakfast like samosas or vada pav, potato fritter served inside a bread roll, if the garbage they bring amounts to half a kilogram.\nIt cannot however be said that the incentive of food to the street garbage pickers is the best solution to the problem of plastic garbage or any garbage whatsoever. But it can least inspire the population to volunteer to manage their own waste in the community.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Providing incentives to garbage pickers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/providing-incentives-to-garbage-pickers-1756137881",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 26, 2025 00:00:00  \nInternet data has become essential for people to manage their daily activities, cutting across all groups of society. However, setting a validity period after purchasing data creates serious difficulties, particularly for low-income people and students. If the validity period expires before the full data is consumed, the remaining balance is taken away by mobile operators, which is unfair and burdensome.\nStudents depend heavily on internet access for academic purposes, while low-income people, who spend most of their day outside for work, also struggle to manage with limited data. For many, spending Tk. 300-400 per month on internet data is already a significant challenge. Not everyone can afford to purchase large data packages repeatedly.\nMobile operators in many countries do not impose a validity period on internet data; the balance remains available until fully used. I urge the SIM companies in Bangladesh to adopt similar practices for the benefit of their customers.\nSamin Yeasar\nStudent, East West University\nBachelor of Business Administration\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "No expiry on Internet data",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/no-expiry-on-internet-data-1756137909",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-08-2025"
    }
]