[
    {
        "full_article": "The violent reaction to comedian Kunal Kamra’s satirical remark about Maharashtra Deputy Chief Minister Eknath Shinde is not merely a sign of rising intolerance — it also highlights how such intolerance can escalate beyond police cases into acts of vandalism and open intimidation, aimed at asserting political dominance. Mr. Kamra’s use of the word ‘gaddar (traitor’) in a parody of a Hindi film song, seemingly targeting an unnamed politician’s rise, has reportedly offended Mr. Shinde’s supporters and other Shiv Sena members. In a bizarre act of misplaced retaliation, a group attacked ‘Habitat’, the studio where Mr. Kamra had performed — an attempt to impose vicarious liability on the venue instead of the artist. The Mumbai police booked Mr. Kamra under provisions of the Bharatiya Nyaya Sanhita (BNS) related to promoting enmity and causing public mischief, as well as defamation. However, it is well-established that defamation charges can only be initiated by the aggrieved party, and not by the police. In a now-familiar display of power being weaponised, the Brihanmumbai Municipal Corporation (BMC) conveniently discovered unauthorised structures outside the venue and demolished them, continuing to probe for further “irregularities”. The first information report against Mr. Kamra appears to be a clear misuse of laws meant to address divisive speech. It essentially criminalises satire directed at a public figure’s political actions. Politicians being labelled as traitors or turncoats after switching parties is hardly new — ironically, Ajit Pawar of the Nationalist Congress Party, who once used the same term, now serves alongside Mr. Shinde as Deputy Chief Minister.The Maharashtra government is now demanding a public apology from Mr. Kamra, which he has refused, though he has expressed his willingness to cooperate with any lawful investigation. It is incumbent upon the State government to ensure its actions remain within legal bounds and not appear as arbitrary retaliations. While it is commendable that a few Shiv Sena members have been booked for the vandalism, the case must be pursued to its logical end. The invocation of “hurt sentiments” to justify violent loyalty has gone too far. Increasingly, such claims are being used to legitimise mob attacks, undermining the free and open space essential for democratic discourse. Published - March 26, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        politics\n                    \n                            /                      \n                        \n                        Maharashtra\n                    \n                            /                      \n                        \n                        police\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        Nationalist Congress Party\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        democracy",
        "headline_1": "​No country for comedy: On Kunal Kamra and Maharashtra",
        "headline_2": "India’s politicians are showing intolerance of satire",
        "link": "https://www.thehindu.com/opinion/editorial/no-country-for-comedy-on-stand-up-comedian-and-maharashtra/article69373546.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "26-03-2025"
    },
    {
        "full_article": "State crackdowns on political opposition are hardly new in President Recep Tayyip Erdoğan’s Türkiye. Since coming to power in 2003 as Prime Minister, and later assuming the presidency under a revised Constitution, Mr. Erdoğan and his ruling Justice and Development Party (AKP) have shown little tolerance for dissent. His government has systematically targeted political opponents, journalists, activists and critics. Yet, even by Türkiye’s troubled democratic standards, the arrest of Istanbul Mayor Ekrem İmamoğlu marks a troubling escalation. He was detained on March 19, 2025 on charges of corruption and alleged ties to terrorism — accusations largely stemming from his association with pro-Kurdish political groups. His arrest came just days before he was expected to be officially named the presidential candidate of the main opposition Republican People’s Party (CHP). On March 23, an Istanbul court ordered his formal arrest, and he was swiftly removed from office by the Interior Ministry. He is the fifth CHP mayor to be dismissed by the government in recent months.The move has sparked massive protests. In a show of public defiance, the CHP held a primary open to the general electorate — not just party members — in which it claimed the participation of 15 million voters, choosing Mr. İmamoğlu as their presidential nominee. Mr. Erdoğan has dismissed the protests, but the motive behind this orchestrated campaign is clear. With his presidential term set to end in 2028, he is constitutionally barred from running again — unless early elections are called, or the Constitution is amended. But Parliament may trigger snap elections, paving the way for his seeking another term, particularly as he lacks a clear successor within the AKP. Mr. İmamoğlu, meanwhile, has emerged as the most potent opposition figure in years. Since winning the Istanbul mayoralty in 2019, he has helped revive the CHP’s national prospects. In last year’s local elections, the party secured its strongest result since the 1970s, even outpolling the AKP nationwide. While Mr. Erdoğan’s popularity has declined amid rampant inflation, economic stagnation, and a plunging lira — eroding the appeal of his once-successful blend of Islamic conservatism and pro-business policies — Mr. İmamoğlu, a self-proclaimed social democrat, has offered a progressive alternative that is focused on expanded social services and inclusive growth. The massive voter turnout in the CHP primary and the scale of the protests underscore his enduring appeal. If he is barred from contesting future elections, Mr. Erdoğan may eliminate his most formidable rival, but at the cost of deepening political divisions and further eroding public faith in democratic institutions. At 71, Mr. Erdoğan would do well to heed the voices in the streets, abandon the persecution of political challengers, and focus on addressing the economic crisis that his policies have helped create. Türkiye’s future hinges not just on who governs, but on whether its democracy can still offer a fair and open contest for power. Published - March 26, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Turkey\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        arrest\n                    \n                            /                      \n                        \n                        corruption & bribery\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        inflation and deflation\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        currency values\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        democracy",
        "headline_1": "Eliminating opponents: On Erdoğan and Türkiye’s future",
        "headline_2": "Erdoğan is jeopardising Türkiye’s future for his political career",
        "link": "https://www.thehindu.com/opinion/editorial/eliminating-opponents-on-erdo%C4%9Fan-and-t%C3%BCrkiyes-future/article69373572.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "26-03-2025"
    },
    {
        "full_article": "By cracking down on opposition supporters Erdogan reinforces his image as an electoral autocrat\nErdogan is once again proving why Türkiye often gets described as an electoral autocracy. Although presidential elections in Türkiye are a couple of years away – there’s chatter about early polls – the long-time Turkish leader appears to be putting obstacles in the path of his potential political opponent. And that challenger is the hugely popular Istanbul mayor Ekrem Imamoglu from the opposition Republican People’s Party. Imamoglu was detained and arrested last week over alleged corruption charges – which he describes as fabricated – leading to days of widespread protests. Turkish authorities have detained 1,133 people since March 19, making these the largest demonstrations since the 2013 Gezi uprising.\nBut such crackdowns have taken place periodically under Erdogan’s two-decade-old leadership that has been marked by the vilification of opposition – whom Erdogan has often equated with terrorists – purges of critics, and malleability of democratic institutions. Even in the last Turkish presidential polls in 2023, Erdogan employed divisive rhetoric and labelled his then main rival Kemal Kilicdaroglu as being pro-LGBTQ and hand in glove with terrorists.\nAll of these are classic tactics of an electoral autocrat for whom winning polls by any means necessary is more important than upholding the values and sanctity of democratic institutions. But in Imamoglu – who has been nominated as his party’s presidential candidate – Erdogan may face his toughest challenge yet. There are clear parallels between the two – Erdogan was also once Istanbul mayor before being arrested and then going on to dominate Turkish national politics. But years of anti-incumbency may finally be crystallising against Erdogan and he may not be able to leverage Türkiye’s crucial geopolitical position to ward off international proscription. That may explain his recent surprising outreach to the Kurds – long victims of Ankara’s policies. All of this also means that Erdogan fears being out of power, a hallmark of electoral autocrats. \n\n",
        "headline_1": "No Turkish delight",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/no-turkish-delight/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-03-2025"
    },
    {
        "full_article": "Funding cash handouts, especially the rash of schemes for women, is a recipe for fiscal emergency for states\nPresenting her debut budget, Delhi CM Rekha Gupta allocated Rs 5,100cr to fund women’s cash scheme Rs 2,500 per month – a poll promise. This is less than half of what may be required to service beneficiaries of the scheme, estimated at 38L if beneficiaries are women whose household income is less than Rs 3L per annum. The budget already shows the strain of financing freebies – it includes dipping into small savings (NSSF) to the tune of Rs 15k cr. Last year, Union finance ministry had frowned upon such practice, saying it disrupts the broader borrowing framework. Kejriwal had proposed it in order to continue AAP govt’s welfare schemes of free electricity etc.\nFact is, all states with similar cash transfers to women are under severe financial strain. From Maharashtra’s BJP-led govt to Karnataka and Telangana’s Congress govts, and former AAP govt in Delhi, finances of the richest states are stressed over polltime’s unrestrained largesse. It’s not about breaking promises – if poll promises were kept, India would’ve been ‘developed’ by now. The issue is far more grave – freebie culture has no winners. Funding freebies will eventually make the state broke; not servicing the promise may have electoral fallout. In Maharashtra, since June 2024, fiscal deficit has nearly doubled from Rs 1.1L cr to Rs 2.2L cr. The state spent Rs 87k cr more than budget estimates 2024-25 – much of it to fund earlier Mahayuti govt’s poll year sops. Both the women’s handout scheme and the monthly stipend for jobless youth are costly affairs – but just placebos to dull the pain of jobless youth and destitute women.\nTelangana CM Revanth Reddy has admitted his state’s financial crunch, that after paying salaries, pensions, debt and interest, most of the rest of the money – Rs 5k cr – goes to ‘welfare’. The state is left with almost nothing to spend on capex. RBI has cautioned that spend on sops could crowd out resources critical for social and economic infra. States don’t have money to invest in creating public goods. Private investment is not an answer. GOI’s capex levels are down. India can’t upgrade unless its states invest in creating enabling economic conditions.\nKharge has called for state units to make only financially viable promises. Reddy recently called for all political parties to deliberate and arrive at a national consensus on such guarantees/freebies, in a bid to rationalise, move away from the ill-conceived practice. It is the need of the hour.\n\n",
        "headline_1": "Delhi & elsewhere",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/delhi-elsewhere/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-03-2025"
    },
    {
        "full_article": "Tamil Nadu’s replacing the rupee symbol with ‘ru’ could lead to a Babel-like verbal battlefield\nDoes the rupee by another name have the same nominal value? That’s the linguistic, if not the economic, question posed by Tamil Nadu’s DMK govt having used the initial letter of the Tamil word for rupee, which is ‘rubaai’ or ‘ru’, instead of the Devanagari-based rupee symbol in its presentation of the state budget’s logo.\nThe symbolic move is reportedly a retaliatory response to what is seen by Tamil Nadu to be the BJP-led central govt’s attempt to foist Hindi as the lingual currency of the country onto the state through the three-language formula of the National Educational Policy.\nThe hoisting of the flag of linguistic revolt has provoked a sharp reaction from the Centre, with the finance minister, Nirmala Sitharaman, decrying it as a “completely avoidable example of language and regional chauvinism”.\nHowever, it’s not just Tamil Nadu and other southern states that see Hindi as a stalking horse of the Centre in its bid to gain lingual dominance at the expense of regional autonomy as expressed through speech and script.\nWhat is increasingly seen as a forcible ‘Hindification’ of the country is viewed with suspicion by the other states, such as Bengal, which are justly proud of their rich linguistic heritage.\nThe Newtonian principle that every action has an equal and opposite reaction is applicable not only in the realm of physics, but also in the domain of cultural identity as expressed in the written and spoken word.\nIn the Bible story, a humankind united by a common language began building a Tower of Babel to reach heaven, a project which irked God who confounded humans by making them speak a multiplicity of tongues and thereby scattering them across the face of the Earth.\nThanks not to the Almighty, but to the lesser god of language politics, are we creating our own lingual Babel to sunder our unity?\nAs a preventive stratagem we might adopt a one-language formula based on a single, region-neutral, politics-neutral lingua franca. Esperanto?\n\n",
        "headline_1": "War of words",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/war-of-words/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-03-2025"
    },
    {
        "full_article": "Grok, a chatbot developed by Elon Musk’s company xAI, means “to understand intuitively or by empathy, to establish rapport with.” However, its usage of Hindi slang, unfiltered language and controversial remarks to Indian users have gone viral. It’s curious as to why Grok and many other AI chatbots sometimes use offensive language and occasionally put out contentious responses.\nRead full story on TOI+\n\n",
        "headline_1": "To Grok is human",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/to-grok-is-human/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-03-2025"
    },
    {
        "full_article": "Bangladesh's failure to fully utilise the zero-duty trade benefits it enjoys from China is quite disappointing. Despite gaining this duty holiday in 2020, we have not been able to increase our exports to China compared to our imports from the country of 1.4 billion people. Initially, duty-free access to Chinese markets was offered to 8,547 Bangladeshi products; later, 100 percent duty-free access was given to all products from Bangladesh. Yet, during the July-December period of the current fiscal year, Bangladesh only exported $0.46 billion worth of goods to China while importing $8.89 billion worth of goods. In the last six fiscal years, trade differences with China, in fact, went up.\nIn the past, we received zero-tariff benefits from India. There too, we failed to take full advantage of the benefit, and our trade imbalance with the country remained high. Both these instances point to our lack of productivity, failure to increase industrial capacity, and inability to attract investment in our export-oriented businesses (other than ready-made garments). Interestingly, Bangladesh's main export to China is garments, even though China itself is the world's largest apparel exporter. According to a report in this daily, Bangladesh does not have much scope to increase apparel exports to China beyond what is currently being done. This shows a lack of vision regarding product diversification, with the export sector largely remaining stuck in RMG.\nExperts told this daily that we should have pursued Chinese investments in products such as man-made fibre, leather, leather goods, solar panels, semiconductors, and microchips, which could be exported back to China. However, our policies often lack comprehensive implementation plans. Moreover, corruption and negligence often derail implementation. Inconsistent policies, high energy prices, and lack of political stability also drive away foreign investors.\nAs Chief Adviser Prof Muhammad Yunus is set to visit China, we must assess our performance in taking comprehensive steps to increase our export basket and attract Chinese investment. US President Donald Trump's trade war against several countries, including China, has opened some doors of opportunity for Bangladesh. Chinese investors are showing interest, and we must hit the iron while it's hot. We cannot let this opportunity slip because of our internal problems, low productivity, and lack of political consensus needed for urgent reforms that can support a trade-conducive and investment-friendly environment.\n",
        "headline_1": "Holistic policies necessary to address trade imbalances",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/holistic-policies-necessary-address-trade-imbalances-3857791",
        "news_paper_name": "The Daily Star",
        "publish_date": "26-03-2025"
    },
    {
        "full_article": "Back in our school days, we learnt about history and many historical landmarks in the classroom from our textbooks. There used to be beautiful pictures of historical places like Egypt's pyramids or the Roman Colosseum. We often wondered what it would feel like if we could walk through those places and see them in reality. But cost and distance made such visits unattainable for most of us. These historic wonders remained confined to our imaginations and the printed pages, leaving us to dream of a reality beyond our reach. Once bound by imagination, these childhood dreams are now much closer to reality through the wonders of virtual reality (VR). Students today can explore these historical landmarks as if they were physically there.\nVR creates an immersive three-dimensional environment. It was conceptualised in 1965 with a visionary idea—\"The Ultimate Display\"—by Ivan Sutherland, and the term \"virtual reality\" was coined in 1987 by Jaron Lanier, who is often considered the father of VR.\nThe technology is no longer confined to virtual tours of historical landmarks. Its application is rapidly expanding across diverse fields of education, transforming the learning experience like never before. I believe this is an invention comparable to the mobile phone. Mobile phones were initially invented to enable people to communicate over long distances without any wired connection—a true revolution. But now, what isn't there in a mobile phone? People are getting countless benefits from it in various forms. Similarly, VR is no longer just about immersive environments, its scope has expanded across many fields.\nVR provides innovative solutions to the challenges in traditional education. One of the most notable advancements is the rise of virtual labs. These labs are now used in schools worldwide, enabling students to conduct practical experiments without physical lab equipment. Nowadays, complex experiments in physics and chemistry can be simulated using VR. Students can now visualise molecular structures with it. Another significant advantage is that chemical reactions can be simulated in a safe virtual environment, enabling students to learn without risks. Architecture students can now create and visualise 3D structures using tools like Autodesk VR. Additionally, universities around the world are easily using VR to show their students notable architectural landmarks, along with their construction techniques and designs.\nA significant use of VR has also emerged in the medical sector. Anatomy is being taught through VR by showing 3D models. A risk-free immersive environment is being created using virtual reality to develop surgical skills of medical professionals and to provide training for complex operations.\nMany schools take their students to museums and historical places using VR. Westminster Law School in the UK introduced a virtual reality game back in 2016 to teach students criminal law by allowing them to experience murder scenes through VR. During the pandemic, a professor at the University of North Carolina sent VR headsets to students and built a virtual classroom to conduct classes.\nThe University of Rhode Island's College of Pharmacy has developed a VR lab for high school students to conduct virtual experiments on medicinal plants. On the other hand, online platforms like VRLab Academy provide hundreds of science experiments for VR users.\nMany universities in Bangladesh are also incorporating VR into education, particularly in fields like architecture and history. Some institutions have established specialised VR labs to support research, while companies like Nerdiz have introduced VR kits in schools, enabling students to explore historical sites virtually.\nBeyond higher education, VR can bridge the urban-rural education gap by bringing virtual science labs, historical site tours, and vocational training to schools and training institutes. Affordable VR kits, public-private partnerships, and government-backed initiatives can ensure that students, regardless of location, have access to these advanced learning tools. Mobile VR classrooms could also be deployed to underserved regions, providing equal learning opportunities across the country.\nTo make VR a reality in Bangladesh's education system, localised content development and strategic collaborations with edtech startups, universities, and global tech firms are essential. The government and private sectors must invest in infrastructure and training to integrate VR into classrooms effectively.\nVirtual reality is no longer a futuristic dream; it is here, revolutionising education across the world, and Bangladesh must not stay behind. The question is no longer if we should embrace VR in education, but how soon we can make it a reality.\nMd Rakib Hasan is director of IT (additional charge) at Southeast University. He can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "How VR is transforming education through immersive learning",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/how-vr-transforming-education-through-immersive-learning-3857126",
        "news_paper_name": "The Daily Star",
        "publish_date": "26-03-2025"
    },
    {
        "full_article": "Henry Kissinger, one of the most influential yet controversial political figures of the 20th century, passed away in 2023, leaving behind a legacy that continues to spark heated debates. Lauded by some as a master of diplomacy and realpolitik, he remains, in the eyes of others, a war criminal who should have been held accountable for his actions. In The Trial of Henry Kissinger, Christopher Hitchens meticulously builds a case against Kissinger, arguing that his policies and decisions—from his role in extending the Vietnam War to his backing of right-wing coups, complicity in genocide, and orchestration of covert operations—led to mass suffering across the globe. The Bangladesh chapter of the book is particularly damning, exposing the cold indifference and realpolitik calculations that led to one of the most horrifying atrocities of the 20th century.\nIn December 1970, the people of East Pakistan (now Bangladesh) overwhelmingly voted for self-rule under the leadership of Sheikh Mujibur Rahman and the Awami League. However, instead of honouring the democratic mandate, the Pakistani military, led by General Yahya Khan, launched Operation Searchlight on March 25, 1971. What followed was an unrelenting campaign of mass killings, systematic sexual violence, and forced displacement. Conservative estimates place the death toll at 300,000, though many argue the real number was closer to three million.\nAs reports of massacres spread, one of the earliest and most powerful condemnations came from Archer Kent Blood, the US Consul General in Dhaka. Blood and his team sent a series of telegrams to Washington detailing the atrocities being committed by the Pakistani military. In the telegrams, they pleaded the US to take a stand against the Pakistani government. The message read:\n\"Our government has failed to denounce the suppression of democracy. Our government has failed to denounce atrocities…Our government has evidenced what many will consider moral bankruptcy...\"\nThis was signed by dozens of diplomats, making it the strongest internal protest ever recorded within the US State Department. Yet, Nixon and Kissinger dismissed it outright. Kissinger, obsessed with using Pakistan as a backchannel to China, saw Yahya Khan as an indispensable ally. Instead of acting against genocide, Kissinger chose silence and complicity. In fact, the US government, under Kissinger's guidance, actively supported the Pakistani military by supplying them with weapons.\nKissinger also made a callous remark in a private conversation, referring to Bangladesh as a \"basket case,\" illustrating his dismissive attitude toward the country's plight and people. Between March and December 1971, the Pakistani military conducted some of the most gruesome acts of ethnic and political cleansing of the 20th century. Bangalee intellectuals were specifically targeted and executed, Hindu minorities were slaughtered, and millions of women were subjected to rape as a weapon of war. While the world condemned the atrocities, Nixon and Kissinger continued to stand by Pakistan.\nHis secret conversations with Nixon reveal racist and derogatory remarks about Bangalees and Indians, showing his complete disregard for human lives. Even when the then US Ambassador Kenneth Keating urged the administration to publicly condemn Pakistan's brutality, Nixon said to Kissinger that Keating had been \"taken over by the Indians.\" Kissinger, for his part, at the height of the genocide in late April sent Yahya a message praising him for \"delicacy and tact.\"\nAs the crisis deepened, India, overwhelmed by millions of Bangalee refugees, prepared to intervene militarily. On December 3, 1971, India officially entered the war to assist the Mukti Bahini. In response, Kissinger orchestrated a dangerous and reckless move. He deployed the aircraft carrier USS Enterprise into the Bay of Bengal. This was meant to intimidate India and deter its intervention, but it failed.\nMukti Bahini with help from India swiftly defeated Pakistan, leading to the creation of an independent Bangladesh on December 16, 1971. But Kissinger's hostility toward Bangladesh did not end there.\nWhen Mujib sought international recognition and aid for the war-ravaged country, the US remained distant. Kissinger saw Mujib's government as an embarrassment, resenting the exposure of US complicity in genocide. In November 1974, Kissinger made a brief eight-hour visit to Dhaka, where he refused to acknowledge the role of the US in Pakistan's actions.\nHitchens' book meticulously builds a case against Kissinger, arguing that his actions in Bangladesh, Chile, Vietnam, and East Timor amount to war crimes. Kissinger's secret involvement in overthrowing democratically elected leaders, his orchestration of military coups, and his support for genocidal regimes paint the picture of a man who viewed human lives as collateral damage in his grand strategy. As Bangladesh continues to push for global recognition of the 1971 genocide, the question remains: will history hold Kissinger accountable, or will his crimes fade into the shadows of realpolitik?\nKollol Kibria is an advocate, human rights activist, and political analyst. He can be reached at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Henry Kissinger’s role in 1971",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/henry-kissingers-role-1971-3857056",
        "news_paper_name": "The Daily Star",
        "publish_date": "26-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Nation looks forward to a new dawn",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/nation-looks-forward-to-a-new-dawn-1742918066",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Strategic growth for thriving cottage industry",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/strategic-growth-for-thriving-cottage-industry-1742918136",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "AI driving a new era in business",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ai-driving-a-new-era-in-business-1742918158",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Grand narrative of July uprising",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/grand-narrative-of-july-uprising-1742918177",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-03-2025"
    }
]