[
    {
        "full_article": "The diplomatic actions against Pakistan taken on Wednesday (April 23, 2025) by India’s Cabinet Committee on Security in reaction to the Pahalgam terror attack are a measured set of responses that indicate a larger escalation could follow. The decisions such as to cancel visas given to Pakistani nationals, suspend consular operations, and to close the Attari border Integrated Check Post (ICP) carry New Delhi’s message that it does not wish to engage with Pakistan above the absolute minimum levels required. Some of these measures had followed previous attacks including Pulwama (2019). The decision to put the Indus Waters Treaty (IWT) in abeyance until Pakistan acts “credibly” against terror groups means that India will enforce its earlier decision to suspend all meetings of the Permanent Commission that oversees implementation of the treaty, end site visits by Pakistani water teams to India and continue with hydropower and desilting projects along the tributaries — measures to which Pakistan had raised objections. Pakistan’s response is an attempt to mirror Indian measures, without even trying to address the anguish in India. Nor does it indicate it is willing to track down the perpetrators, despite the fact that The Resistance Force (TRF), which claimed responsibility for the attack, is a front for the Pakistan-based LeT. Islamabad has also cancelled visas, cut mission strength and has shut down all trade. Pakistan has threatened to suspend other bilateral agreements including the practically defunct 1972 Simla Agreement, which had most notably converted the ceasefire line into the Line of Control and abjured third party mediation on Kashmir. It also suggested that India’s suspension of the IWT would be seen as an “Act of War” if it meant water flows to Pakistan are reduced, and threatened tit for tat strikes if India conducts military operations that harm Pakistani citizens.All signs indicate the stage is being set for further escalation in tensions and a possible military standoff. Prime Minister Narendra Modi’s message from a rally in Bihar is the threat of punishment “beyond imagination”. New Delhi is reaching out to countries around the world, Foreign Secretary Vikram Misri is briefing foreign envoys, while senior Ministers have briefed Opposition leaders on the cross-border links. Given geopolitical currents, revulsion at such targeting of innocent tourists, and a broad understanding of India’s stand on the issue of cross-border terrorism, it is unlikely that other countries such as the U.S. will press New Delhi to restrain its next steps. The government must continue to take all stakeholders, especially the Jammu-Kashmir government into confidence. Pakistan could benefit from reconsidering its disadvantageous position, and even now, show that it is willing to work against terror groups, and avert the impending escalation. Published - April 26, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Pulwama attack 2019\n                    \n                            /                      \n                        \n                        rivers\n                    \n                            /                      \n                        \n                        act of terror\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        USA",
        "headline_1": "​A gathering storm: On India’s diplomatic actions against Pakistan",
        "headline_2": "Pakistan must eliminate the terror groups working on its soil",
        "link": "https://www.thehindu.com/opinion/editorial/a-gathering-storm-on-indias-diplomatic-actions-against-pakistan/article69491676.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "26-04-2025"
    },
    {
        "full_article": "The U.S. and Iran are currently engaged in rare high-stakes diplomacy. They have held two rounds of talks, in Muscat and in Rome, with Oman as the mediator, about Tehran’s nuclear programme. A third technical round has been confirmed for the coming days. However, tensions still remain high between the Trump administration and the Islamic Republic. It was Donald Trump, during his first term, who sabotaged a functioning multilateral agreement that had significantly curtailed Iran’s nuclear programme. Ever since, Iran has accelerated its nuclear activities. While it has not yet decided to build a nuclear bomb, most assessments agree that it has the capability to do so within weeks. At the same time, Iran’s regional influence stands diminished as a result of Israel’s attacks on its so-called axis of resistance and other regional shifts such as the fall of Syria’s Assad regime. Israel is pressing for an attack on Iran’s nuclear facilities, but Mr. Trump, according to American reports, has vetoed those plans, for now.\rMr. Trump has adopted a classic carrot-and-stick approach. He said he wanted a deal with Iran but with a warning that if talks failed, there would be bombing. He has also launched a massive aerial campaign against Yemen’s Iran-aligned Houthis. In addition, the U.S. has ramped up its military presence in West Asia besides moving B-2 bombers to the Indian Ocean region — all aimed at signalling to Iran that U.S. threats should be taken seriously. But despite the combined military might of the U.S. and Israel, any attack on Iran would be catastrophic for regional security and global economy. Iran’s nuclear facilities are scattered and underground, making them extremely difficult to destroy. It was precisely because there was no viable military solution to the Iran nuclear issue that world powers chose the path of diplomacy in 2015, a path Mr. Trump had abandoned in 2018 for no good reason. Nevertheless, despite the challenges and geopolitical pressure, the recent initiation of talks by Mr. Trump and Iran opens a rare window of opportunity to resolve the issue once and for all. For diplomacy to succeed, the U.S. should act as a responsible global power that is committed to preventing weaponisation of Iran’s nuclear programme, rather than as a partisan patron seeking to destroy Iran on Israel’s behalf. Iran, for its part, has signalled that it was open to scaling back its nuclear activities in exchange for the removal of sanctions and threats. The 2015 agreement, which limited Iran’s enrichment capabilities and uranium stockpile, could serve as a reference point for a deal if talks progress constructively.\r Published - April 26, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Iran\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        nuclear policy\n                    \n                            /                      \n                        \n                        Syria\n                    \n                            /                      \n                        \n                        Israel",
        "headline_1": "​Carrot and stick: On the U.S. and Iran talks",
        "headline_2": "The 2015 accord must be revived to prevent Iran going nuclear",
        "link": "https://www.thehindu.com/opinion/editorial/carrot-and-stick-on-the-us-and-iran-talks/article69490823.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "26-04-2025"
    },
    {
        "full_article": "Student scores, labour productivity dip with rising temp\nBy the end of this century, sea levels will be a foot higher than in 2000. The average person is 31 years old today, and given that global life expectancy is 73.5 years, they may be dead by 2068. So, why should we worry? Didn’t Keynes say, “The long run is a misleading guide to current affairs”?\nBut climate change is affecting us now. It has a bearing on your mood, your income, your children’s grades. University of Pennsylvania economist R Jisung Park drives home these points in his book Slow Burn. Take income first. It’s an acknowledged fact that income inequality is rising. The rich – who live, travel and work in air conditioned spaces – are getting richer, but the poor have stagnated in a hot and sweaty place. A study by University of Chicago economists found that worker productivity in India declined 2-4% for every degree Celsius rise in temperature above the comfortable level. If the “mean temperature” at the workplace crossed 25℃ – which could mean day temperature of 30℃ and night temperature of 20℃ – output fell 32%, or almost a third.\nNow, people who make bricks, weave cloth, etc, get paid per piece of product made, so while they suffer in the heat, their daily earnings drop. That’s not fair, but they can’t stop working because they aren’t qualified for white-collar work. Their children could break out with good education, but as Park shows with data, heat is making this harder.\nWhen researchers correlated 4.5mn exam results of students in New York City schools with the temperature on exam day, they found that student performance fell by 3-4 points on days when temperature exceeded 32.2℃. This is a small penalty for someone who usually scores 95%, but a setback for a child who passes with low marks. Park says “average” students are 10% less likely to pass on a hot day than on a cool day.\nNow, poorer students – children of those poor labourers – typically are at a disadvantage because their homes are crowded, noisy, lack ventilation, and get hot and stuffy. So, passing exams with good marks, and getting into good colleges with scholarships, becomes almost impossible. Heat, indirectly, stalls upward mobility.\nGenerally speaking – leaving out exceptions like Singapore and UAE – “hot” countries have 8% lower per capita income for every 1℃ rise in average temperature, Park says. Even within US, hotter municipalities tend to be poorer. That’s important for us because places like Mumbai will have 100 extra days of mean temperature over 32.2℃ by 2060, relative to the pre-industrial age.\nBeyond income and education, heat makes us more error-prone. Data from 150,000 tennis matches shows players were 7% more likely to double-fault on hotter days. Analysis of 500 helicopter crashes showed a strong correlation between temperature and human error. And a British navy experiment in the 1950s revealed that errors in reading Morse code jumped from 11-12 per hour in the 29.4-32.2℃ temperature range to 95 per hour at 40.5℃. Oh, and people start honking sooner at traffic lights on hotter days, and rates of rape and murder inch up with heat too. A warming planet clearly isn’t a good place for your average Joe, and Jane.\n\n",
        "headline_1": "Hotter planet makes social mobility harder",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/hotter-planet-makes-social-mobility-harder/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-04-2025"
    },
    {
        "full_article": "Security lapse questions need clear answers. LoC/border infra needs massive upgrade \nUndeniably, Pahalgam has been a huge blow to India’s security apparatus in J&K. Now, SOPs must be overhauled, systems reoriented, and coordination between agencies sharpened. But the revamp must begin with some tough questions. Was Baisaran Valley opened up to tourists much earlier than other years? Some reports say the area is usually open to visitors during the Amarnath Yatra, when there are stringent security arrangements. Whether or not local hoteliers and tour operators failed to inform authorities about tourist movement isn’t clear. Were arrangements  this week different to those in the last tourist season? Local tourism industry is arguing that govt didn’t provide them with any alerts ahead of the tourist influx. Clearly, vital coordination between security forces and local businesses fell through the cracks.\nBorder lacunae: Note also that the terrorists had better eyes on the situation, saw an opportunity and struck. This shows that terrorists are constantly probing for weaknesses. That’s why terrorists need to be stopped at the border/LoC itself. But there are multiple lacunae with border infra too. Govt had launched the Comprehensive Integrated Border Management System project after the 2016 Pathankot attack to upgrade border fencing with state-of-the-art surveillance systems. But it remains a work in progress, having missed two deadlines in 2018 and 2023.\nBureaucracy that kills: Plus, routine weather-related challenges with border fencing management remain. Damage to fencing due to winter snow takes months to repair because of both terrain and bureaucratic delays. Battery-operated surveillance equipment such as night-vision devices drain power quickly in the cold and can’t be charged due to lack of power at many places along the border. Repairs to sensitive surveillance radar can take weeks. Fuel for generators that run searchlights often runs low. Even electrified fencing has proved to be ineffective in some places due to lack of steady electricity supply and low voltage. These leave gaps in the border fencing that terrorists exploit.\nSmuggling-terror nexus: Arms – including weapons for Nato – are being smuggled into Punjab via drones. A similar smuggling route exists via Nepal. Nato-grade weapons have been seized from terrorists in J&K. This is happening under our noses. Why hasn’t govt been able to crack down on the influx of smuggled weapons?\nResponse failure: Former army commanders are calling Pahalgam an intelligence failure. It’s a familiar pattern, but the history of terrorist attacks this century shows the charge is misplaced. While the facts of Pahalgam are yet to be established, the Oct 7, 2023 Hamas attack, Pulwama, Uri, 26/11, and 9/11 all point to a different problem – “response failure”. There were warnings in all these cases that weren’t acted upon. America’s 9/11 Commission report summed up the problem well: “No analytic work foresaw the lightning that could connect the thundercloud to the ground.” And 9/11 was a colossal response failure. Leads about a possible attack had been coming in all summer, yet “as late as Sep 4” govt didn’t have an answer to the question, “Is al Qaeda a big deal?” Before 26/11, India received warnings of a major attack from its own sources and US. As for Pulwama, Frontline found there were at least 11 intelligence inputs between Jan 2 and Feb 13, 2019 – a day before the attack. Israel had been getting warnings of Hamas’s invasion plan since 2018. At least, its security agency, Shin Bet, has formally accepted its lapses within 18 months. In India, probes take long, and mea culpas are unheard of.\nSo, the least we expect after Pahalgam is a timely inquiry, and publication of its findings to restore people’s confidence. Govt owes it to the 26 victims of the massacre, and to Kashmir, which needs to return to normalcy.\n\n",
        "headline_1": "Post-Pahalgam",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/post-pahalgam/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-04-2025"
    },
    {
        "full_article": "Recently, something very bad happened in Pahalgam, a beautiful place in Kashmir. A group of people were attacked and sadly, 26 people died. This has made everyone ask some serious questions about safety in the area.\nWhat Went Wrong?\nUsually, there are strong security checks in places like Baisaran Valley, especially during big events like the Amarnath Yatra. But this time, tourists were allowed in earlier than usual, and it’s not clear if the local businesses told the police that so many people were coming. This caused confusion and made it easier for the attackers to strike.\nProblems at the Border\nThe attackers came from across the border. That means they crossed into India from outside. The government has been working on improving the fencing and surveillance (like cameras and sensors) at the borders, but the upgrades are taking too long. Some projects were supposed to be done in 2018 and 2023, but they’re still not finished.\nEquipment Isn’t Working Well\nIn cold places like the mountains, cameras and other equipment stop working properly. Batteries die quickly, snow damages fences, and repairs take too long because of red tape (slow government rules). Sometimes there isn’t even enough fuel or electricity to keep things running. These problems create weak spots where bad people can sneak in.\nSmuggling Weapons\nSome weapons are being smuggled into India using drones or hidden routes through other countries like Nepal. These weapons are very powerful — even the kind used by NATO (a group of powerful countries). This is dangerous, and people are wondering why the government hasn’t stopped it yet.\nWarnings Were Ignored\nMany experts are saying this attack wasn’t just about missing information — it was a “response failure.” That means some people did have warnings, but nothing was done in time to stop the attack. This has happened in the past too, like with the 9/11 attacks in the US or the Pulwama attack in India. In those cases, there were signs something bad might happen, but no one acted fast enough.\nWhat Should Happen Now?\nPeople want the government to find out exactly what went wrong and share the results with the public. That’s the only way to fix mistakes and make sure people feel safe again — especially in Kashmir, where normal life should be able to continue without fear.\n\n",
        "headline_1": "What Happened in Pahalgam and Why It Matters",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/what-happened-in-pahalgam-and-why-it-matters/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-04-2025"
    },
    {
        "full_article": "Suspension of the water treaty can upend Pak’s agri economy & water security if India can build water storage infra on Chenab & greenlight stalled projects like Tulbul. These’ll take time. The immediate impact is to open up New Delhi’s options & increase uncertainty for Islamabad\nIn a decisive shift in India’s strategic approach toward Pakistan, GOI has suspended the Indus Waters Treaty (IWT) – once hailed as a rare symbol of cooperation in a tense bilateral relationship.\n\nThis suspension, coming in the wake of the Pahalgam terror attack, reflects a broader redefinition of India’s tolerance for cross-border provocation.\nRead the full story on TOI+.\n\n",
        "headline_1": "Indus versus them",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/indus-versus-them/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-04-2025"
    },
    {
        "full_article": "The deterioration of Mayur River, once a lifeline for Khulna residents, has happened right in front of our eyes, as has the repeated failure to revive it. Over the years, we have published a number of reports on how it is being choked by encroachments of all sorts, unregulated fish farming, ill-advised dams, and unchecked pollution, with about 26 drains pouring most of Khulna city's waste into it. Against this backdrop, the excavation projects were meant to breathe new life into the river. But instead, they have further contributed to its decline.\nAccording to a recent report by this daily, two excavation projects taken up by the city corporation—one in 2014 and another in 2023—have failed to deliver any meaningful improvement. During a recent visit by our Khulna correspondent, the river was seen occupied by a makeshift bamboo dam, with sand being dumped at several points. Meanwhile, old problems persist as the river remains choked with silt, hyacinths, and waste, with no visible improvement in its water flow or quality. This raises serious questions about the planning and execution of such projects.\n\nOver the years, failed or harmful excavation efforts have been reported across the country. Unfortunately, despite river dredging being routine work, the relevant authorities often do it wrong, and in isolation, without linking it up with other interventions—such as eviction, de-cluttering, and stopping other harmful and invasive activities on rivers—necessary to make its impact lasting. In Khulna alone, such cases abound.\nOver the years, failed or harmful excavation efforts have been reported across the country. Unfortunately, despite river dredging being routine work, the relevant authorities often do it wrong, and in isolation, without linking it up with other interventions—such as eviction, de-cluttering, and stopping other harmful and invasive activities on rivers—necessary to make its impact lasting. In Khulna alone, such cases abound. For example, in 2022, we reported an initiative by the Mongla port authorities to dump the debris excavated from Pashur River on vast swathes of farmland, threatening soil fertility and the livelihoods of thousands. That same year, we also wrote about the Bhadra River, which, despite being excavated only two years ago, silted up again as dug-up earth fell back into it. This has been more or less the running theme of our dredging or de-siltation initiatives, with excavated debris invariably making it back to the river.\nThe irony here is inescapable. River excavation is supposed to solve problems like navigability, pollution, and waterlogging. Instead, it is causing them anew, or creating new ones. If we truly want to revive our dying rivers, dredging must be treated as a means, not the goal. Excavation should be preceded by proper ecological assessments, involve local communities, and include clear plans for water sourcing, encroachment removal, pollution control, and maintenance. And the relevant authorities must coordinate better and be held accountable. Otherwise, we risk repeating the same failure until our rivers are beyond saving. The Mayur River stands as a grim reminder of what such failure looks like.\n",
        "headline_1": "River excavation must be done right",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/river-excavation-must-be-done-right-3879956",
        "news_paper_name": "The Daily Star",
        "publish_date": "26-04-2025"
    },
    {
        "full_article": "A new World Bank report has rightly sounded the alarm about a potential rise in poverty and inequality in Bangladesh—warnings that policymakers can ill afford to ignore. According to the report, persistent inflation, job losses, and a slowing economy may further erode household welfare, intensifying our already pressing economic challenges.\nThe national poverty rate is projected to rise to 22.9 percent in 2025, up from 18.7 percent in 2022. Meanwhile, the share of people living in extreme poverty—defined as those earning less than $2.15 a day—is expected to nearly double to 9.3 percent, pushing an additional three million people into this category. In the latter half of 2024 alone, nearly 4 percent of workers reportedly lost their jobs, while wages declined by 2 percent for low-skilled workers and by 0.5 percent for high-skilled workers. The labour market, in short, is showing clear signs of distress. Notably, the labour force participation rate has dropped from 60.9 percent to 59.2 percent, driven largely by a sharp decline in female participation, from 41.6 percent to 38.9 percent.\nExacerbating the crisis is the prolonged spell of high food inflation, a key driver of poverty that has continued to squeeze household budgets. Real wages have been in decline for over 40 months now, as nominal wage growth consistently lags behind soaring prices. The Gini index, a key measure of income inequality, is also projected to rise from 33.4 in 2022 to 36.1 in 2025, with experts pointing to the weak and informal nature of the labour market as a primary cause.\nA lack of quality employment opportunities has left a vast segment of the population engaged in low-productivity, self-employed work, with limited earning potential. What makes this situation even more troubling is that GDP growth has been slowing in recent years—driven by falling investment, policy uncertainty, high borrowing costs, and political unrest—resulting in fewer jobs and lower confidence in the economy. In light of these trends, it is imperative that policymakers, political parties, and other stakeholders come together and take decisive steps to reduce uncertainty and improve the investment climate.\nTo this end, it is crucial to undertake necessary structural reforms urgently. This includes urgent banking and fiscal reforms aimed at restoring investor confidence and accelerating economic recovery. Frequent policy shifts and uncertainties that deter businesses from investing and expanding must also be addressed head-on. The government, in consultation with political parties, must also provide clarity on the timing of the next elections and work towards a consensus that reassures both domestic and foreign investors that Bangladesh will not remain trapped in political uncertainty indefinitely.\n",
        "headline_1": "Rising economic risks demand better interventions ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/rising-economic-risks-demand-better-interventions-3879771",
        "news_paper_name": "The Daily Star",
        "publish_date": "26-04-2025"
    },
    {
        "full_article": "Amid persistent economic struggles as well as efforts to remove barriers deterring businesses from investing and expanding in the country, there is no alternative to ensuring a smooth take-off of the much-anticipated third terminal of the Hazrat Shahjalal International Airport in Dhaka. Built at a cost of over Tk 21,300 crore, the terminal is being touted as a milestone for Bangladesh's aviation sector, with the planning adviser recently underscoring its potential to make the airport a regional hub. For this promise to materialise, we must ensure the project doesn't falter on operational readiness, particularly with regard to customs and cargo handling.\nWith over 99.5 percent of the construction work already completed, the terminal is technically close to the finish line. However, a recent letter from the Customs House Dhaka to the Civil Aviation Authority of Bangladesh (CAAB) has raised concerns about a number of issues related to its infrastructure, security, and operational aspects, according to a report by this daily. For example, a key concern raised by the inspectors involves the customs hall, which they say is too narrow with a low ceiling and a capacity of only 300, despite an expected influx of 7,000 to 8,000 passengers at peak hours. This may result in heavy congestion, slow clearance, and poor ventilation. After the terminal's full-scale opening, expected in early 2026, it is estimated that the annual passenger handling capacity of the airport will rise to 2.4 crore from 80 lakh at present.\n\nA key concern raised by the inspectors involves the customs hall, which they say is too narrow with a low ceiling and a capacity of only 300, despite an expected influx of 7,000 to 8,000 passengers at peak hours. This may result in heavy congestion, slow clearance, and poor ventilation. After the terminal's full-scale opening, expected in early 2026, it is estimated that the annual passenger handling capacity of the airport will rise to 2.4 crore from 80 lakh at present.\nCustoms officials have also flagged several issues related to cargo handling. Among them is the lack of designated warehousing for seized or high-value goods, which poses risks of theft, misuse, and smuggling. The placement of the duty-free shop immediately after immigration, without adequate surveillance or access control, also risks revenue leakage. Moreover, the lack of designated space for scanners, physical examination of baggage and consignments, and diversion routes for high-risk baggage may emerge as another big problem, especially given the expected doubling of cargo throughput once the terminal goes live. These and other such inadequacies could further contribute to security risks, unnecessary delays, and even tax evasion.\nWhile acknowledging these shortcomings, the relevant authorities have said that it is not possible to alter the existing infrastructure now, so they are focusing on workarounds as alternative solutions. But the need for resolving these issues cannot be stressed enough either, especially for the sake of a safe, uninterrupted operation of the terminal. We, therefore, urge the authorities to seriously consider the recommendations given by customs inspectors and find ways to implement them.\n",
        "headline_1": "Take steps to ensure smooth take-off of the third terminal ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/take-steps-ensure-smooth-take-the-third-terminal-3879496",
        "news_paper_name": "The Daily Star",
        "publish_date": "26-04-2025"
    },
    {
        "full_article": "The recommendations outlined in the Labour Reform Commission's report, submitted to the chief adviser on Monday, could bring about a welcome change for Bangladesh's eight crore working people—provided the proposals are accepted by all, implemented effectively, and enforced regularly.\nOne of the most notable recommendations is having a national minimum wage that ensures a dignified living standard for all workers and self-employed individuals regardless of industry, sector, specialised labour region, type of work, or nature of business. However, enforcing such a proposal in a country where 87.2 percent of the working population is engaged in the informal sector poses an enormous challenge. On the positive side, thanks to information technology, workers can at least become aware of their rights and use this knowledge to demand fair remuneration. Meanwhile, sector-specific minimum wages will continue to exist, as per the recommendation, but they cannot be lower than the national minimum.\nThe commission also recommended significantly reforming existing labour laws—or enacting one or more new, integrated labour laws—to bring workers of all sectors, industries, and profit/non-profit organisations under legal protection. To support this, they proposed the creation of a National Labour Force Registration System and Information Repository, as well as increasing the number of labour courts.\nOther recommendations include simplifying the process of trade union registration and creating a government emergency and contingency fund to help businesses sustain operations and pay workers even during international or domestic crises. The commission also proposed that two white papers be published—one on the former government's actions, investigations, trials, compensations, etc, in relation to notable workplace accidents such as Rana Plaza and Tazreen Fashions; and the other on the utilisation of the Sramik Kalyan Foundation Fund. While the commission did not specify which recommendations can be executed immediately, the chief adviser has asked for a list of those that can be implemented in the short term. We believe that work on the two white papers can and should start without delay.\nReportedly, the commission's recommendations will soon be presented to political parties for their feedback. While there appears to be no reason for any party to oppose these proposals, which aim to ensure workers' rights and protection, trusting political parties to properly implement them is difficult given their past records, especially while in power. Historically, most political parties have prioritised the interests of businesses and employers at the cost of labour rights. We can only hope that they along with businesses and employers, in line with the aspirations of the July uprising for real change, will support the delivery of pro-worker reforms this time.\n",
        "headline_1": "Let’s prioritise workers' interests for a change",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/lets-prioritise-workers-interests-change-3877591",
        "news_paper_name": "The Daily Star",
        "publish_date": "26-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 26, 2025 00:00:00  \nThe maintenance of the nation's main communication artery for cargo-laden trucks, the Dhaka-Chattogram Highway, is getting costlier. The reason is that the multi-axle, multi-wheel cargo-laden trucks reportedly carry disproportionately more load than their permissible limits. The result is that the highway has been subjected to more pressure than it can withstand according to its design. Strangely though, rather than strictly monitoring and penalising overloading, the Roads and Highway Department (RHD) during the previous autocratic government bowed to the irrational demands of the transport owners and the so-called transport workers' union leaders. In consequence, the load limits for trucks with different types of axle were increased violating the norm. \nThus, the RHD allowed 2-axle trucks with 15-tonne capacity to carry 22 tonnes. Similarly, the load limits for 3-axle, 4-axle and higher-axle tucks were also exceeded in contravention of international standards. However, the authorities of that time tried to justify their decision of raising load limits for trucks under consideration with the strange argument that it saved fuel, reduced the number of vehicles to carry the same amount of load and helped ease traffic tangles, saved time, etc. They even did come up with some figures to substantiate their claim.\nNotably, a recently-conducted study by the RHD found that the magnitude of damage done to Dhaka-Chattogram Highway due to plying of overloaded trucks was estimated to be around Tk8.61 billion. The amount saved from allowing overloaded trucks to transport cargoes and their claimed use of less fuel were learnt to be deducted from the damage estimation. However, based on the data analysis of overloaded vehicles from Sitakundu Axle Load Station in FY 2023-24, the damage estimate for the entire 190-km Dhaka-Chattogram highway would grossly come to around Tk 12.31 billion. \nHowever, mere assessment of the damage caused by allowing overloaded trucks alone will not make the roads usable. Maintenance work for potholed and rutted roads need also to be carried out simultaneously. Unfortunately, the maintenance work for the highway, too, was inordinately delayed during the previous government. The RHD in 2019 undertook a maintenance project worth over Tk7.93 billion to strengthen the road and keep it operational. The project was to be completed by June 2023. But the bureaucratic procrastination in approval process caused the delay. At last, the RHD sought another Tk1.89 billion and two more years from the then-government to complete the maintenance work by June 2025. However, ouster of previous government put an end to the maintenance work. Nevertheless, uninterrupted vehicular movement and the further damage it has been inflicting on the already rutted road have only increased the urgency of completing maintenance and repair work of the country's most important economic corridor. \nNow, under no circumstance overloading of cargo trucks should be allowed. The changes in the load policy made by the previous autocratic government between 2016 and 2020 have to be reversed. For sustainability of the country's road infrastructure, axle load control is a must, experts recommend. Being a signatory to the UN treaty and UN Convention on road and motor transport 1949 and Vienna convention 2019, Bangladesh is obliged to go by these international standards.\nSince the RHD authority under the interim government is not beholden to any political quarters, transport owners and workers' union leaders, there should be no problem for it to apply the rules of load management for all vehicles without exception. This is urgent for protecting the highways from unnecessary damage.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Vehicles must comply with load limits on highways",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/vehicles-must-comply-with-load-limits-on-highways-1745592116",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       April 26, 2025 00:00:00  \nThe Women's Affairs Reforms Commission submitted its report to chief adviser Professor Muhammad Yunus on April 19, recommending measures for elimination of discrimination against women and attainment of equality with men. Although the commission's overall aims are admirable, several of its recommendations appear out of sync with Bangladesh's socio-economic and religious context that made them controversial and difficult to implement. \nFor decades, women's empowerment has been central to Bangladesh's development narrative. Quoting the Ministry of Women and Children Affairs, the report itself noted that 56 laws, policies and regulations are already in place to protect the rights of women and children. In recent years, women's workforce participation has brought about tangible economic and social progress which is widely welcomed across society. Even with these improvements, harassment and violence against women continue to occur in public, at work and at home. It was within this reality that the commission had got an opportunity to propose workable and carefully-thought-out solutions. Regrettably, the commission's report lacked the foresight to be tactful, risking being perceived as provocative by a large segment of the population and potentially dooming its recommendations before they gain traction. \nOne such contentious recommendation is the decriminalisation of sex work and its recognition as a formal profession. While the intention may be to reduce shame and abuse, the recommendation ignores the mountain of data connecting prostitution to coercion, trafficking, and severe physical and psychological harm. Most countries in the world including the USA, Russia, and China either outright ban or drastically restrict prostitution. Legalising it as a conventional profession also contradicts the report's own stance on forced sexual relations within marriage, which it classified as rape. Given that the commission acknowledges consent is important in one situation, how then can it endorse an industry where actual consent is often absent? \nEqually impractical is the commission's proposal for gender quotas in corporate boards and media outlets. Drawing on Norway's decision to gradually implement gender balance on company boards from mid-2024, the report calls for at least 40 per cent female representation in policy-making bodies of private companies, government agencies and financial institutions, along with 33 per cent representation across all levels of the mass media. Common sense dictates that the board composition of private businesses and the workforce composition of media outlets should be decided by employers. Mandating quotas for females can easily be perceived as undue interference in their operations, and the feasibility and legality of such impositions would likely be highly questionable. Imposing on Bangladesh what a single Nordic country is beginning to implement as a test case, after achieving near parity in employment rates between genders, could provoke backlash and appear more like state-enforced tokenism than organic progress.\nThe report also makes sweeping recommendations regarding political representation. It proposes a 600-seat lower house with 300 seats reserved for women, alongside equal representation in an upper house. Such a system is without precedent in any existing model, be it the Westminster, presidential or semi-presidential form of governance. Under the current arrangement, 50 parliamentary seats are reserved for women. However, these were often filled by female relatives of influential politicians, and many such MPs have made little contribution beyond reading speeches from some notes in parliament that have been a source of public amusement. Reserved seats, at best, should have been a temporary measure to encourage inclusion. Unless the female parliamentarians effectively advocate for women's rights and opportunities, which they did not, expanding these provisions would only cause an unnecessary drain on limited government resources.\nPerhaps the most divisive recommendation in the report is the call for a uniform family code to ensure equal rights for women in marriage, divorce, guardianship and inheritance across all religious communities. As a rationale for this proposed code, the commission briefly asserted that religious doctrines are inherently discriminatory and must be amended. Although the commission suggests the code would initially be optional, the underlying perspective adopted by the commission puts it on a direct collision course with the religiously conservative population of Bangladesh. For the overwhelming majority of Muslims, inheritance laws are based on the Holy Quran, which is regarded as the literal and unaltered word of God. The prescribed shares and rules of inheritance are thus viewed as divine mandates, and any proposal to alter this is likely to be perceived as infringements on faith. There are also socio-cultural dimensions to consider. Sons receiving a double share of assets often bear increased responsibilities as they are traditionally expected to care for elderly parents, an expectation not typically placed on daughters. Any change in this delicate arrangement must originate from within communities, not imposed from above. Forcing the issue through legislation before public opinion sees it as a matter of injustice would be premature and counterproductive. \nThere are, however, some sensible recommendations in the report that deserve serious attention. These include establishing day-care centres, building hostels for working women, forming sexual harassment prevention committees, digitising registration of marriage and divorce, and providing psycho-social counselling services in educational institutions. These measures address practical barriers that could meaningfully improve women's safety and mobility. \nHowever, there is a significant risk that these valuable recommendations aimed at genuinely empowering women will be overshadowed and ultimately buried under the weight of the controversy generated by the more contentious proposals. Predictably, the report has already faced pushback from religious and conservative groups.\nThis outcome could have been avoided had the commission focused more squarely on practical, actionable reforms grounded in the everyday realities of women's lives. Not every battle needs to be fought at once, and lasting progress often comes through gradual, strategic steps. The Women's Affairs Reforms Commission was uniquely positioned to deliver a blueprint for progress, one that could have secured tangible gains for women. By overreaching and ignoring societal realities, it may have undermined even its most reasonable proposals. Should this report fail to translate into action, the blame therefore will lie less with those who resisted change and more with those who failed to recognise what was politically possible.\nshoeb434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Women's commission report: Right ideas, wrong approach",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/womens-commission-report-right-ideas-wrong-approach-1745592183",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       April 26, 2025 00:00:00  \nHow a society treats its women and children is a measure of how civilised it is. The less caring a society is for these vulnerable members, the less civilised it is. Mahatma Gandhi once said \"The true measure of any society can be found in how it treats its most vulnerable members.\" If we accept this notion, Bangladesh's performance is very poor on the civilisation measurement scale. The country has failed to ensure minimum protection for its children against abuse and cruelty. Incidents of infanticide, filicide, child homicide, and violence against and cruelty to children have become so frequent and common that they do not shock people anymore. In a very short span of time recently, several incidents of child murders and cruelty took place. In the first case, a mother stabbed her two children to death at Tongi on the outskirts of capital Dhaka, in the second case, a boy dies when three others pumped air into his rectum in Dhaka's Mirpur and in the third case, a boy abducted six months ago by a family acquaintance from Pabna was rescued in Khulna begging with his fingers broken, nails pulled off and body shattered in torture to win sympathy from strangers. There may be more such cases of which society and law enforcers are completely in the dark. \nCruelty to and abuse of children are deep rooted in our society. It was not long ago when most of the parents would mercilessly beat their children over trifle matters and encourage teachers to discipline students by caning. Physical and psychological punishment in domestic and education institutional settings was so normal that it would be no exaggeration to say that such punishment for the so-called sake of education was a part of our culture. Bangladesh was not alone to tolerate child abuse; many countries, particularly those from the Third Word, was indifferent to this societal ill, prompting the international community to came up with initiatives to stop it and all other forms of child abuse.\nThe United Nations General Assembly adopted the Convention on the Rights of the Child (CRC) in 1989, setting forth the legal and moral obligations of governments to protect and promote the rights of children, including protection from all forms of violence. Bangladesh, as a signatory to the Convention, has enacted and enforced, like many other countries, a law to this end and its impact has been visible, but the ground reality is still far from what was expected. According to the UNICEF, nine out of 10 children aged 1-14 years in Bangladesh experience violent discipline at home every month, affecting over 45 million children nationwide. The state of children in street situations is worse than others. A 2022 survey found that 83 per cent of street children face abuse or harassment by pedestrians, while nearly half experience violence at their workplaces. Child abuse takes place in multiple forms, including physical, emotional and sexual abuse and even through neglect.\nCruelty to and abuse of children in Bangladesh is a big concern that requires sustained action to reverse the situation. Concerted efforts from government agencies, civil society, non-government organisations, media and the international community can help the cause. By recognising the severity of the problem, strengthening of legal protections further and fostering a culture of zero tolerance to abuse, the country can pave the way for a safer and more nurturing environment for its young citizens.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Stop cruelty to children",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/stop-cruelty-to-children-1745592433",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 26, 2025 00:00:00  \n\nFacing intensifying cyclones, rising sea levels, and saline intrusion that imperil its coastal areas, Bangladesh has emerged as a global pioneer in mobilising innovative financing mechanisms for climate adaptation and in leveraging its maritime assets to promote sustainable economic growth.\nSince issuing its inaugural sovereign green bond worth US$ 500 million in 2021, Dhaka has accessed international climate finance-including the Green Climate Fund and the Adaptation Fund-securing over US$ 1.2 billion. These funds have supported critical initiatives such as fortifying coastal embankments, upgrading cyclone shelters, and piloting salt-tolerant rice varieties alongside shrimp-rice rotational farming systems. At the same time, blended-finance models are attracting private investment for large-scale mangrove restoration, community-based early warning systems, and solar-powered irrigation projects.\nComplementing these resilient efforts is Bangladesh's Blue Economy strategy, which is centred around the fisheries and aquaculture sector-contributing 3.5 per cent to GDP and employing over 1.6 million people. This strategy envisions sustainable port development in Chattogram and Payra, streamlined maritime logistics under the BBIN (Bangladesh-Bhutan-India-Nepal) framework, and feasibility studies for harnessing offshore wind and tidal power.\nBangladesh is also advancing innovative financial instruments such as parametric insurance, where payouts are automatically triggered by cyclone wind-speed indices, reducing bureaucratic delays in disaster response. Additionally, by channelling diaspora remittances through digital platforms into coastal microfinance and SME incubation programmes, the country is enhancing the adaptive capacity of vulnerable communities.\nThrough these multidimensional approaches, Bangladesh is not only strengthening its resilience to climate variability but also laying the foundation for a robust blue-green growth model-one that aligns ecological sustainability with inclusive economic development.\nFatema Jannat \nStudent\nNorth South University\nfatema.jannat05@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Climate adaptation financing",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/climate-adaptation-financing-1745592456",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-04-2025"
    }
]