[
    {
        "full_article": "On November 24, the Delhi government confronted a small and peaceful crowd near India Gate, that had gathered to express its concern about the city’s air quality index hovering near 400, with a heavy police presence. The question practically wrote itself: was the threat being managed here public safety or political embarrassment? Air quality in North India in winter is often discussed as a Delhi issue, yet monitoring stations have revealed a continuous zone of foul air from around Islamabad to Bihar. Emissions from industry, power generation, transport and agriculture circulate in this shared airshed. This is why the India Gate protests are politically significant. Delhi’s middle class has usually responded with air purifiers, closed windows, vacations and private dissatisfaction — but apparently not anymore. And the state has responded by policing rather than engagement. Deploying Rapid Action Force units shows that the government treats these gatherings as a law-and-order rather than a governance problem. North India’s winter smog is the most visible part of a wider national crisis. Long-term analyses of particulate pollution, such as the Air Quality Life Index, have shown that unsafe air is now the norm for most of India — and that present regulation, monitoring, and enforcement arrangements are insufficient across States and sectors. Treating the problem as a seasonal emergency, in the face of evidence pointing to a permanent condition demanding permanent institutions, has encouraged only bursts of action. The airshed is the primary unit of governance.Today, authority is split among central ministries, State departments, municipal bodies and specialised regulators, each with partial jurisdiction and mixed incentives. The Commission for Air Quality Management was created to address this fragmentation and is empowered to direct emissions control, coordinate among States and agencies, and impose sanctions. Yet, its interventions have not matched the scale or persistence of the problem. Its task now is to use its mandate to require time-bound sectoral plans from governments and major emitters, track compliance through continuous monitoring, and ensure data is in public. Governments should also abandon technical quick fixes. These measures consume public funds and administrative bandwidth while leaving the main sources of emissions intact. The focus should be on interventions in power, industry, transport, construction and agriculture, with tighter norms and real enforcement, time-bound retirement or retrofitting of polluting plants, support for cleaner fuels and technologies and credible alternatives for farmers burning crop residue. These solutions will take time to manifest but only they will lead to lasting changes. And they need to be backed by a courageous political vision rather than heavy-handedness. Published - November 26, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        government\n                    \n                            /                      \n                        \n                        New Delhi\n                    \n                            /                      \n                        \n                        air pollution\n                    \n                            /                      \n                        \n                        weather science\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        government departments\n                    \n                            /                      \n                        \n                        local authority\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        transport\n                    \n                            /                      \n                        \n                        heavy construction\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        green technologies\n                    \n                            /                      \n                        \n                        politics",
        "headline_1": "Losing the plot: On North India’s air quality issue",
        "headline_2": "The air quality issue requires engagement with citizens, not intimidation",
        "link": "https://www.thehindu.com/opinion/editorial/losing-the-plot-on-north-indias-air-quality-issue/article70322131.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "26-11-2025"
    },
    {
        "full_article": "For Indian badminton, 2025 has been a tough year. Successes have been fleeting, top players’ form has undulated and serious questions have been asked of not just the established but also the young and upcoming. But for Satwiksairaj Rankireddy and Chirag Shetty’s doubles bronze at the World Championships in Paris in August, there has been precious little. Against this backdrop, Lakshya Sen’s triumph at the Australian Open on Sunday has come like a breath of fresh air. It was not the toughest of fields and the tournament — a BWF Super 500, third in the sport’s hierarchy after Super 1000 and 750 — is not pedigreed. But it was no low-hanging fruit either, for Lakshya had to spend long hours on court, including in the come-from-behind semi-final victory over World No. 6 Chou Tien Chen. The title was the 24-year-old’s first since the Syed Modi International Super 300 last December, and the first outside India since the Canada Open Super 500 in July 2023. Ever since the disappointment of losing the 2024 Paris Olympics bronze medal match from a dominant position, Lakshya has endured difficult times. Injuries and a spate of early exits — 11 in the first round this year alone — had sent him tumbling down. But a trophy in his last act of 2025 should give him the required fillip.Whether this acts as a springboard for other Indians in 2026 remains to be seen. Apart from Satwiksairaj and Chirag, no other Indian is ranked in the top 10 of any badminton discipline. Since July 2022, P.V. Sindhu has just one Tour title to show — the Syed Modi International last December. H.S. Prannoy, who bagged a men’s singles bronze at the 2023 Worlds and soared to No. 6, is now down to 35. Worryingly, the supply line of stars appears to have undergone a rupture. Ayush Shetty, 20, winning the U.S. Open Super 300, and Tanvi Sharma, 16, finishing with a silver medal in girls’ singles at the World Junior Championships, are noteworthy achievements indeed. But no junior has stormed the scene and plugged the gap seamlessly like how Sindhu once did after Saina Nehwal. The Badminton Association of India appears to be mindful of this, as seen from the setting up of the National Centre of Excellence in Guwahati to train the next generation. India is also betting big on hosting international competitions of repute to burnish its credentials as an elite badminton nation. After the 2025 World Juniors in Guwahati, the 2026 World Championships is scheduled to be held in Delhi. If India can assemble a battery of medal challengers, it would be akin to a resurrection. Published - November 26, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        badminton\n                    \n                            /                      \n                        \n                        France\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        Canada\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Assam",
        "headline_1": "Drop shot in Sydney: On Indian badminton",
        "headline_2": "Lakshya Sen’s win also draws attention to the gaps in India’s supply line of stars",
        "link": "https://www.thehindu.com/opinion/editorial/drop-shot-in-sydney-on-indian-badminton/article70322173.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "26-11-2025"
    },
    {
        "full_article": "Volcanoes don’t just disrupt airline schedules. They had a hand in birthing humans & shaping what they did\nAfter at least 12,000 years of silence, Ethiopia’s Hayli Gubbi volcano let out a shout on Sunday, and a day later flight schedules went awry in Delhi, over 4,000km away. Incredible? Well, volcanoes can pack quite a punch. Relatively speaking, Hayli Gubbi, which shot ash 14km into the atmosphere, is a lightweight – the Tonga eruption of Jan 2022 released as much energy as a magnitude 8.4 quake. But it was nothing compared with Krakatoa, whose eruption in 1883 threw 21 cubic km of earth 80km high into the atmosphere, and produced a sound that was heard 5,000km away.\nMillions of tonnes of volcanic dust floating in the upper reaches of the atmosphere is kryptonite for plane engines. If too much gets inside them, they can stall. In 1982, all four engines of a British Airways plane shut down as it passed through a volcanic cloud. Luckily, pilots were able to revive three of them after gliding for 15 minutes. That’s why airlines have to be cautious after an eruption. The 2010 aviation nightmare resulting from the eruption of Iceland’s Eyjafjallajökull volcano is a fading memory now, but it cost airlines £130mn a day for a week.\nDwelling over flight delays, however, trivialises the role of volcanoes. We know they had a hand in the creation of continents. Scientists also believe the 600,000-year-long continuous eruption of the Deccan Traps released so much carbon dioxide that Earth warmed up, dinosaurs were wiped out, and other species took over – hence, later, the appearance of humans. They have shaped human history also, as when the eruption of Vesuvius buried Pompeii and its 10,000 residents under ash and rock in 79CE. Modern Europe, and the world, may have looked very different without the 1783 eruption of Laki in Iceland, which disrupted rain patterns across Europe, worsened France’s food poverty, and became the invisible hand behind the French Revolution. Three decades later, the explosion of Tambora in Indonesia changed the world’s climate for years, caused widespread rain in Europe, and was a factor in Napoleon’s final defeat on the rain-soaked field of Waterloo. Our lava affair continues. \n\n",
        "headline_1": "Our Lava Affair",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/our-lava-affair/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-11-2025"
    },
    {
        "full_article": "The scope has to broaden. Too many courts & much police action do the opposite, as SC has noted \nCJI Surya Kant’s observations on free speech put the focus back on twin questions courts often explore – how to protect the right to free speech and protect free speech from ‘abuse’. Free speech, in India, is subject to  ‘reasonable restrictions’. But which restrictions are reasonable and what constitutes ‘abuse’ – that’s the nub of it. Courts have not always been consistent, nor have they always defined free speech broadly. Do some social media handles, which viciously target specific groups, stretch free speech rights intolerably, as opposed to caricaturists and standups, who use humour to critique the powerful? The logical answer is yes. But police seem to think the answer is no, given who their FIR targets are.\nThe point about reasonable restrictions is they need to be clearly reasonable. HCs are known to err on the side of excessive caution. Karnataka HC noted in the case of Kamal Hassan – hauled to court for suggesting Kannada was an offshoot of Tamil – that he could “not hurt sentiments of the masses”. Far too many cartoonists, standups, activists, journalists, artists and poets are arrested only to be punished via the arduous police-court-trial process. Such cases fall apart during appeals in SC, which maintains that for one, standard for free speech cannot rest on “insecurity” of those in power or because certain views are “disliked” by large sections and second, speech in poor taste is not a crime. SC has said of itself, too, that judges should take criticism on their chin, and politicians be thick-skinned. Mocking religion may be pushing limits in this country, lampooning netas is not.\nMorality and decency is another undefinable ‘restriction’ – and therefore ever vulnerable to both litigious moral busybodies and all kinds of court rulings. In podcaster Allahbadia’s case, SC painfully, but not helpfully, separated ‘vulgarity’ from ‘obscenity’. Even more court time is spent on art gallery displays. Even works by modern artists. FN Souza, Akbar Padamsee, MF Husain, have wound up being subjects of litigation. Why? Because someone thought they fell inside the scope of ‘reasonable restrictions’ centered on morality/decency. It took 14 years for Milind Soman-Madhu Sapre’s nudity case to be thrown out. So, yes, the definition of free speech needs work – but the work is to broaden the scope of what we mean by free speech. \n\n",
        "headline_1": "Free Up Free Speech",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/free-up-free-speech/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-11-2025"
    },
    {
        "full_article": "Whatever you think your birth sign is, you’ve got it wrong by 2,000 years\nSceptics have long regarded predicting the future, and defining an individual’s personality using the signs of the zodiac as mumbo-jumbo. \nNow the mumbo has become more jumbo with the discovery that the positions of the constellations on which the signs of the zodiac are based in western astrology have shifted in relation to the Sun and the Earth in the 2,000 years since the ancient Babylonians observed their positions in the sky. \nA reason for this is that, like a spinning top as it loses motion, the Earth ‘wobbles’, causing an ‘axial precession’ that leads to one degree of difference every 72 years in our view of the stars in relation to the Sun.\nMoreover, the Babylonians did not, for reasons unknown, include in their  calculations the presence of a 13th constellation called Ophiuchus, meaning ‘Snake bearer’.\nThe result is that western astrology is literally wobbly when it comes to determining your zodiac sign, also known as a Sun sign, based on your date of birth. \nSo if you were led to believe that your zodiac or Sun sign is Aries, you’re actually a Piscean, and if you think you’re a Piscean you’re really an Aquarian. \nScorpios are now deemed Librans, and Sagittarians can be either Scorpios (from Nov 23 to Nov 30) or Ophiuchusians (Dec 1 to Dec 18). \nThese findings throw a major spanner in the works of zodiac-based matchmaking, which pairs Aries with Leo, Taurus with Capricorn, Gemini with Aquarius as being compatible, with Cancer and Aries deemed incompatible. \nIf I remain starry-eyed about the future because my Sun sign tells me to be so, I might be headed for a solar eclipse, metaphorically speaking. \n“The fault, dear Brutus, is not in our stars, but in ourselves that we are underlings,” says Cassius to Brutus in Shakespeare’s Julius Caesar. The fault is indeed in us if we continue to remain underlings to the hocus-pocus of the occult art best described as ass-trology.  \n\n",
        "headline_1": "Zodiacal mix-up",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/zodiacal-mix-up/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-11-2025"
    },
    {
        "full_article": "Asim Munir’s power grab in Pakistan makes South Asia a more dangerous neighbourhood. The Pak military is no longer a state within a state. It is the state\nYesterday’s attack on the Peshawar headquarters of Pakistan’s Federal Constabulary that killed three security personnel exemplifies the chaos engulfing that country.\nBut the Pakistani leadership appears keen to pour fuel on the fire.\n\nEarlier this month, Pakistan crossed a perilous threshold when its parliament rubberstamped a constitutional amendment that re-engineers the country’s civil-military equation to give untrammelled power to one man: Field Marshal Asim Munir.\nRead the full story on TOI+.\n\n",
        "headline_1": "Dictator next door",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/dictator-next-door/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-11-2025"
    },
    {
        "full_article": "When the ground shook violently on November 21, the city's seismic assessment system was, quite literally, locked. For 16 months, the Urban Safety and Resilience Institute (USRI) in Mohakhali has stood as a 10-storey monument to waste. Completed in June 2024 and funded by the World Bank, the Tk 250 crore facility was meant to be the capital's seismic sentinel. Yet, while the fault lines have been active, the bureaucracy has remained comatose.\nThe problem is not a lack of expertise, but the absence of paperwork. Rajdhani Unnayan Kartripakkha (Rajuk), the capital's development authority, claims it has been waiting for ministry approval to operationalise a \"deed of trust.\" Only after last weekend's triple shock did Rajuk hurriedly send the necessary files to the housing and public works ministry, as this newspaper reports. It is a classic case of administrative reflex: a flurry of paper-pushing that begins only after the crisis has arrived.\n\nIn geology, stasis is usually reassuring. In governance, it is dangerous. Dhaka's residents were reminded of this on Friday, when a magnitude 5.7 earthquake struck Madhabdi, just outside the teeming capital. It was the strongest tremor in decades—cracking walls, claiming at least 10 lives, and sending lakhs into the streets. But the earth had more to say. Over the next 32 hours, two additional tremors followed, including a magnitude 3.7 jolt in Badda, a dense neighbourhood at the city's core.\nNerves are frayed. Yet, the nation's earthquake preparedness remains stuck in the shivering inaction that paralyses USRI, the very institution designed to safeguard the public. Inside the building sits a laboratory stocked with European gadgetry—terrestrial laser scanners, ground-penetrating radar, tri-axial testing systems. These machines can peer into concrete beams and count rebar without scratching the paint. They are the difference between knowing a building will stand and simply hoping it will. The timing makes the negligence even starker. Dhaka's sprawling periphery rests on soft alluvial soil that amplifies seismic waves; it is a vertical city built on hope and, too often, dubious concrete. A pilot assessment under the project examined some 3,250 schools and hospitals, identifying 42 buildings needing immediate demolition and 200 requiring retrofitting. Extrapolate that across a metropolis of over two crore people—where rapid urbanisation has easily outpaced regulation—and the scale of vulnerability becomes painfully clear. Leaving these diagnostic tools unused at USRI while the ground moves beneath us is both negligent and dangerous.\n\nHigh-tech equipment atrophies when idle. The sensors and scanners at USRI have already missed a year of maintenance. Still, the Rajuk chairman insists he is \"very positive\" that the institute will launch now that the paperwork is moving. One hopes so. But earthquakes do not wait for bureaucrats to approve deeds of trust. If we want to survive the \"big one,\" we must understand that resilience requires more than constructing a building or purchasing expensive equipment; it demands that the equipment is switched on.\n",
        "headline_1": "Quake defences delayed by red tape",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/quake-defences-delayed-red-tape-4042541",
        "news_paper_name": "The Daily Star",
        "publish_date": "26-11-2025"
    },
    {
        "full_article": "The latest revelations about Chattogram's earthquake vulnerability should alarm city authorities and policymakers alike. While the city's location makes it vulnerable to severe earthquakes, unplanned urbanisation, widespread building code violations, and years of weak monitoring and regulatory negligence have added to the risks. Experts warn that at least 70 percent of the city's multi-storey buildings could collapse if a major quake of magnitude 7 or higher strikes. Last Friday's 5.7-magnitude tremor, during which a previously tilted six-storey building in Mansurabad leaned further towards a neighbouring structure, clearly showed how precarious the situation has become.\nRapid and unplanned growth has turned Chattogram city into a concrete jungle where safety is often ignored. According to the Chattogram Development Authority (CDA), the city has around 4.11 lakh buildings of varying heights, and many taller structures were built in violation of building codes. In coastal areas like Chattogram, building materials deteriorate faster, while narrow roads would make rescue operations extremely difficult during an earthquake. Oversight is also weak, and many buildings are constructed without proper expert supervision. Additionally, unchecked groundwater extraction has weakened the soil beneath the high-rises. If these issues persist, a strong earthquake could cause large-scale damage and casualties.\nHowever, the lack of preparedness among city authorities is deeply worrying. Reportedly, many buildings, which were damaged and tilted during previous earthquakes, still stand today. CDA says that it can only identify unsafe buildings and that demolition work falls under the Chattogram City Corporation (CCC). If so, why has the CCC not demolished these risky buildings yet? This reflects poor coordination among city authorities. CDA's lack of a structural and design cell and severe manpower shortages worsen the problem.\nTo reduce earthquake risks in Chattogram, authorities must take immediate and coordinated action. CDA needs to increase its manpower to properly monitor construction practices and stop irregularities. Vulnerable buildings should be identified and strengthened using modern retrofitting methods, while very old and unsafe structures should be demolished without delay. Residents must follow building codes strictly when constructing new buildings. Additionally, groundwater extraction should be reduced to protect the soil's stability. Government agencies must also enforce building-code compliance and ensure that new structures include proper emergency entry and exit routes. While building fully earthquake-proof structures may be costly, making them earthquake-tolerant can significantly reduce casualties in future disasters.\n",
        "headline_1": "A looming disaster in Chattogram",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/looming-disaster-chattogram-4041846",
        "news_paper_name": "The Daily Star",
        "publish_date": "26-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 26, 2025 00:00:00  \nIn today's world of ever-shifting balance of power, global trade and economy are getting fragmented and, in some cases, protectionist and regionalised, while supply chains are facing disruptions. Amid these developments, the economies of countries so far bracketed as Least Developed Countries (LDCs) are confronting new realities. Bangladesh being one such economy and now poised to graduate to a developing one, faces, among others, the challenge of providing its growing number of youths--- about two millions joining the workforce every year --- with jobs. As the manufacturing sector of the economy is becoming the backbone of industry, the job-seeking youths are required to be trained in skills that can meet the manufacturing sector's demand. But as the existing model of education is failing to generate such skills, industries in the country are often compelled to meet their need by hiring skilled hands from abroad. This is unfortunate especially when, according to the Bangladesh Bureau of Statistics (BBS)' Labour Force Survey for 2024, the country had close to 900,000 unemployed graduate youths representing a rate of 13.5 per cent unemployment among tertiary-level graduates. \nWorse still, failing to secure any job at home, many graduates along with other unemployed youths are trying their luck overseas, sometimes risking their lives. Obviously, this is creating an explosive situation in society that the policymakers are failing to comprehend, far less resolve. A glaring example is the recent experience of July uprising of 2024, where the disgruntled youths without any political leadership had overthrown the previous regime that turned violently oppressive. Clearly, the situation is portent of something more disruptive in the future unless urgent steps are taken to create enough job opportunities at home through overhauling the education system.\nThese issues, reportedly, came under the spotlight at a recent discussion, which was part of a broader event styled, 'Bay of Bengal Conversation 2025'organised by a local think tank, Centre for Governance Studies (CGS). At the discussion session business leaders and experts underscored the need for bringing in a qualitative change in the curricular design of Bangladesh's education system. Especially, the focus was laid on developing technical skills, rather than the prevailing generalist, certificate-based education where the openings have been narrowed down to a few government jobs under the Bangladesh Civil Service (BCS) and the banking sector. So, stress has been laid on developing a large pool of industrial engineers and technical specialists. Emerging digital technologies like Artificial Intelligence (AI) needs also to be duly accommodated in the educational curricula. All the curricular changes should start from the secondary level of education so that the youths can orient their career paths from an early stage of their educational lives. \nGoing abroad is yet another option where the destination is invariably the West. But with the global centre of gravity for economy and trade shifting eastward, especially to Asia, a change in the outlook of the job-seeking youth is desirable. Quite rightly, experts at the aforementioned discussion event, reportedly described Bangladesh as a critical 'battleground of ideas'. To adjust to the tectonic shifts taking place in every sphere of human endeavour, policymakers need to come out of their traditional 'elite-centred' mindset and embrace the unfolding vision of the future. That includes getting out of the legacy of the old-styled ideas of, for instance, GDP-centred growth paradigm. Since the concept of rule-based governance is also coming under challenge, a geopolitical vacuum has been created. So, these emerging realities demand that the policymakers need to gradually wean away from external advice and grow more expertise at home.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Recalibration of education for skill development",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/recalibration-of-education-for-skill-development-1764077376",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       November 26, 2025 00:00:00  \nThe recent findings about the Leather Industrial Park in Savar by the Implementation Monitoring and Evaluation Division (IMED) have once again brought Bangladesh's struggle with industrial governance, environmental compliance and export competitiveness into sharp focus. What was once envisioned as a modern, environmentally responsible industrial cluster-capable of lifting Bangladesh's leather sector into the league of globally compliant exporters-has instead emerged as a textbook example of how systemic inefficiencies can derail even the most ambitious national projects.\n The IMED's report, which lays bare an array of operational, structural, and environmental failures, underscores a deeper malaise: the absence of sustained oversight and institutional commitment in the country's major industrial undertakings. The project fell short in virtually every area that mattered-budget discipline, construction quality, timeline adherence, regulatory compliance, and environmental responsibility. The cumulative impact is not only staggering in monetary terms but reputationally debilitating for a sector that holds immense promise.\n When the Leather Industrial Park was approved in the early 2000s, it symbolised a transformational shift. The relocation of tanneries from Hazaribagh-then one of the world's most polluted industrial zones-was intended to protect Dhaka's environment while building a globally competitive leather-processing hub in Savar. The project's original budget of Tk 1.76 billion and three-year timeline were modest considering the key activities to be undertaken -- a Central Effluent Treatment Plant (CETP), integrated industrial infrastructure, waste management facilities, and a clean environment that would finally allow Bangladeshi leather goods to enter premium Western markets.\n Nearly two decades later, the project has ended up costing more than five times its initial budget and taking over six times longer than planned. This increase in cost and time over-run would have been tolerable, had the end result achieved its objectives. Instead, the CETP, the centre-piece of the entire project, remains noncompliant with both international benchmarks and even the government's own environmental standards. Effluent samples collected by both IMED and the Department of Environment reveal dangerously elevated levels of total suspended solids, chromium, chloride, and biochemical-oxygen demand. These indicators paint a troubling picture -- a facility that not only fails to treat industrial waste effectively but also continues to pose real threats to local rivers, ecology and human communities.\n The consequences are far from environmental alone. Because the CETP does not meet international standards, leather factories in Savar are unable to procure the Leather Working Group (LWG) certification-now a global prerequisite for accessing high-value markets in the EU, USA, Australia, Russia, and beyond. The lack of certification forces exporters to divert their products to low-end markets such as China, where returns are 50-60 percent lower. Experts estimate that Bangladesh is losing over $500 million in potential export earnings each year due to this certification gap.\n\n Beyond environmental compliance, the governance failures exposed in the project are equally alarming. Over the 18.5 years of implementation, the project saw 17 project directors, 12 of whom were part-time. Such a high turnover undermined continuity, accountability, and strategic direction. In industrial development projects, especially those involving complex infrastructure and environmental safeguards, consistent leadership is essential. Instead, the Savar leather park was left adrift, steered by revolving-door leadership with little ability to take long-term ownership of outcomes.\n The IMED's inspection also uncovered glaring construction-related lapses. Cracks in roof slabs, exposed reinforcement in cable drains, inadequate waterproofing, and substandard casting point to serious oversights by contractors and weak monitoring by public agencies. For a project of such national importance, these structural flaws reflect not just poor workmanship but a broader negligence to public investment and industrial safety.\n Adding to the operational challenges is the lack of essential supporting services within the leather estate. Absence of banks, insurance offices, and postal facilities may seem minor, but for tannery owners, these omissions translate into daily operational difficulties.\n What emerges from the IMED review is a disturbing image of a project caught between ambition and apathy, between promises made and promises unfulfilled. The High Court's directives in 2017, which mandated proper operation of the CETP and broader environmental safeguards, remain largely unimplemented. Such institutional disregard not only weakens environmental governance but erodes public confidence in the government's ability to enforce the rule of law.\n The leather sector in Bangladesh still holds significant potential. With the global market for sustainable and ethically produced leather expansion, Bangladesh could seize tremendous opportunities-if only the compliance bottleneck was resolved. The IMED has rightly warned that unless the Ministry of Industries immediately operationalises the CETP at international standard, enforces strict environmental regulations, and accelerates LWG certification for factories, Bangladesh will continue losing ground in premium leather markets.\n The story of the Savar Leather Industrial Park is ultimately a cautionary tale: that infrastructure alone is not enough, that environmental responsibility cannot be an afterthought, and that governance-above all-matters. Without institutional reform, transparent oversight, and a culture of accountability, even the most well-funded industrial projects risk becoming monuments to missed opportunities.\n Now that the IMED has come up with its findings on the appalling state of the CETP project, it remains to be seen whether it becomes merely another example of squandered potential, or is there any decisive action for the government to resuscitate it. \nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why Savar leather park cannot go global",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-savar-leather-park-cannot-go-global-1764077470",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 26, 2025 00:00:00  \n\nThe absence of English language clubs has become a major factor behind students' weakness in English in many educational institutions across the country. Students often struggle to express themselves in English despite learning it from the start of their academic journey. Classrooms, confined to textbooks and exam-based teaching, rarely provide opportunities for practical communication. Consequently, students complete their education without ever practising speaking freely.\nWhile students can improve reading and writing through self-study or enhance listening by watching English movies, dramas, or speeches, consistent practice in speaking remains a challenge. A dedicated language club can bridge this gap, offering an interactive platform for students to communicate, learn and enjoy together.\nIn today's globalised world, language skills are no longer optional; they are essential locally and internationally. English language clubs foster not only linguistic abilities but also cultural awareness. Through literature discussions, drama, poetry recitations and multilingual events, students explore diverse perspectives, nurturing empathy and broadening their worldview.\nSuch clubs also cultivate leadership and teamwork. By taking roles as organisers, presenters or hosts, students learn management skills, decision-making, and responsibility-valuable qualities for their future careers.\nEstablishing an English language club should therefore be prioritised at every institution-not as an extra facility, but as a necessity. These clubs empower students to become confident communicators, thoughtful individuals and future-ready leaders. Supporting their creation is an investment in both academic excellence and holistic development.\nAbu Sakib Md Nazmul Hoque\nPresident, Language Club of English Department (LCED)\nFeni Government College\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Establish English language clubs",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/establish-english-language-clubs-1764077491",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 26, 2025 00:00:00  \n\nThe rapid pace of modern civilisation, propelled by information technology, has transformed the way we communicate, learn and entertain ourselves. Social media, in particular, have become central to the lives of Bangladesh's youth, with platforms like Facebook, YouTube, Instagram, TikTok, WhatsApp and Snapchat occupying hours of their daily lives. Consequently, these platforms are shaping the mindset, behaviour and expectations of the young generation. Social media have become an \"invisible dwelling\" where youth both learn and, at times, lose themselves.\nThe primary drivers of social media addiction are psychological and biological. The release of dopamine when receiving a 'like' or comment provides temporary pleasure, creating a compulsion to repeat the behaviour. The number of followers, likes, and comments can give a false sense of social acceptance and self-worth. Fear of missing out (FOMO), exposure to rapidly changing content and easy accessibility further reinforce excessive usage. Often, families remain unaware of the extent of this dependence.\nExcessive use of social media has significant consequences. Concentration and academic performance decline as the brain becomes accustomed to instant gratification. Constant comparison with curated online lives can cause frustration, low self-esteem or depression. Real-life relationships suffer, loneliness rises, and the risk of cybercrime, online fraud, and exposure to inappropriate content increases. Health problems such as sleep disturbance, headaches, eye strain, and obesity are emerging as \"digital diseases.\"\nOnce, youth spent leisure time playing outdoors, reading, debating, or socialising face-to-face, forging deep and sincere connections. Today, screen-based interaction dominates: online games replace fields, YouTube replaces books, and virtual filters replace real-life experiences. While social media have brought convenience, those have also weakened human connection and behavioural maturity.\nHowever, social media also have positive aspects. Those allows quick access to news, educational resources, skill development, and engagement in global movements such as climate change awareness. Many have even created successful careers online. The key lies in balance. Used wisely, social media can enrich lives; misused, it can become a trap.\nSadia Islam Kasfia \nStudent\nJagannath University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Social media and behaviour of young generation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/social-media-and-behaviour-of-young-generation-1764077503",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-11-2025"
    }
]