[
    {
        "full_article": "The Trump administration has imposed fresh sanctions on Russia as punitive measures relating to Moscow’s refusal to strike a ceasefire agreement to bring the war in Ukraine to a halt, with Washington targeting Russian oil giants Rosneft and Lukoil. Russia’s use of the oil trade to finance war has been a bone of contention for NATO members since the early days of Russia’s incursion into and attacks on Ukraine, an indirect dimension of the conflict that has pulled Asian powers India and China into the fray. Over the summer, Mr. Trump sought to up the ante in this regard by slapping India with an additional 25% tariff for importing Russian oil, over and above the basic 25% rate imposed on other countries as well, even though China, as a top importer of Russian seaborne crude, was spared this levy. Now, the latest round of sanctions appeared to have penalised both trading partners of Moscow significantly, with reports suggesting that at least four major state-owned Chinese oil companies have suspended purchases from Russia and that at least one private and three state-owned Indian refinery companies are planning for “recalibration of Russian oil imports” including the possibility of a “massive cut” over time.At the heart of the White House move is the seething frustration of Mr. Trump over failed attempts to not only bring Russian President Vladimir Putin to the negotiating table — a feat achieved in Alaska in August and a second summit agreed in Budapest before it was postponed following the collapse of ceasefire talks — but also to nudge the Kremlin towards at least a short-term arrangement that might lead to a cessation of hostilities as a precursor to a broader treaty on territorial and institutional agreements. It is possible that the latest sanctions may lead to a genuine tightening of options for Mr. Putin on ending the war, especially as Washington will now be joining the European Union that has adopted its 19th sanctions package against Moscow, specifically focusing on technology supply chains, energy revenues, and financial networks. Nevertheless, it may be premature to applaud their potential impact on the Kremlin’s strategic calculus. Ultimately, whether sanctions have teeth or not depends on the consistency of their enforcement, including shutting down the inevitable loopholes and workarounds that Moscow will seek to exploit to continue selling oil abroad, possibly at even sharper discounts. Mr. Trump may find that he has travelled full circle to arrive at the same sticky negotiating points between Moscow and Kiev that his predecessor faced — an early end to ground hostilities, control of Donbas, and the permissible extent of NATO influence in the region. Only if sanctions can break Russian strategic will on at least one of these points will the prospects for peace brighten considerably. Published - October 25, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Russia\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        economic sanction\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        imports\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        NATO",
        "headline_1": "Sanctioning Russia: On the Trump administration’s fresh sanctions on Russia",
        "headline_2": "Trump is seeking to bring Putin to talks by breaking his strategic will",
        "link": "https://www.thehindu.com/opinion/editorial/sanctioning-russia-on-the-trump-administrations-fresh-sanctions-on-russia/article70198083.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "26-10-2025"
    },
    {
        "full_article": "Biharis who migrate for work remain embedded in caste, class networks of home. Parties tailor their messaging accordingly. And whether a migrant votes depends on his/her ability to absorb income loss from work foregone. And here, whether parties compensate for lost earnings is a crucial factor\nCandidate nominations for the final phase of Bihar polls ended yesterday. Almost every candidate who clears scrutiny will, aside from working local caste networks, keep a sharp eye on migrant voters. Bihar’s five million migrants, many local pundits say, are key to the outcome of the political contest.\nRead full story on TOI+ \n\n",
        "headline_1": "Bihar: The migrant vote",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/bihar-the-migrant-vote/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-10-2025"
    },
    {
        "full_article": "Union commerce minister argues India’s trade pact with Switzerland, Norway, Iceland, and Liechtenstein is a game changer in terms of attracting foreign capital \nIndia has unlocked another gateway to prosperity, signing an innovative trade agreement with a wealthy bloc of European countries that has a per capita income of over $100,000. This opens a lucrative market for Indian farmers, fishermen and MSMEs, and accelerates PM Modi’s Viksit Bharat 2047 mission.\nRead full story on TOI + \n \n\n",
        "headline_1": "‘$100bn investment over 15 yrs…creating 1mn direct jobs’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/100bn-investment-over-15-yrscreating-1mn-direct-jobs/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-10-2025"
    },
    {
        "full_article": "Vir Singh\nLight is all-pervading. The cosmos is a lumenosphere, home to light. With the gist of infinitism, light creates an infinite home – cosmos. Everything in the universe is subject to change, which is thanks to light. Thus, evolution itself is a kernel of light. No light, no change, no evolution. Everything is bound within the framework of time. Everything dies after completing a certain range of time, even stars. Not everything is eternal because everything exists only within its time limits. Only light that is eternal.\nLight is not a thing; it is a non-thing. And this non-thing is everything. It is neither created nor destroyed but changes from one form to another. Every cosmic creativity is enacted by light. The matter cannot participate in creativity. It is the energy that makes matter participate in creativity. Light is the original form of cosmic energy. All forms of energy on Earth originate from light.\nAstro-physical stabilisation process struck by light has been unceasingly going on since the Big Bang. This cosmic-scale creativity of light extended to a planet, evolving it into a living planet: the Earth. Life is the second stroke of all-creative light.\n\nBiological evolution triggered, shaped, and constantly enriched life. Light transforms itself into life through photosynthesis. Biological evolution, beginning with the origin of primordial microbes, and passing through photosynthetic cyanobacteria, eukaryotes, multicellular organisms, green plants, and animals, wrote the story of the biosphere. The entire fascinating biodiversity of life is a living avatar of light.\nIn all living organisms – microorganisms, plants, and animals – light functions as their soul. Soul is the living light that enters life through its own synthesis – photosynthesis. The third primaeval creativity stroke of light was the origin and evolution of the human species.\nHumans evolved with a stupendous mind, astonishing intellectual power, and unique consciousness, which is undoubtedly the most outstanding and robust story of the creativity of light. Now, most of the evolutionary changes being witnessed by the world are driven by living light functioning within humans.\nThe fourth stroke of light represents the evolution of art, which added immense beauty to human life. The evolution of fine literature (epics, dramas, novels, and poetry), dance, singing, oratory, sculptures, and architecture are various dimensions of this evolution. The fifth stroke of light’s creativity is the evolution of symbols emanating from religion and culture. Religion has shaped, reshaped, and transcended human behaviour to a significant extent. Such a theosophical evolution is determining the pathways to our future.\nThe sixth stroke of light led to the evolution of wisdom – the intellectual understanding at its depth. The seventh stroke of the living light represents the evolution of symbols that generate technological power.\nPhotosynthesis, logosynthesis, and theosynthesis are all actions of light. Geographical diversity, biodiversity, and cultural diversity are manifestations of benevolent light. All evolved human virtues – altruism, ethics, aesthetics, and spirituality are implanted, developed, and honed by light.\n\n",
        "headline_1": "Let there be light: Original cosmic energy",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/let-there-be-light-original-cosmic-energy/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-10-2025"
    },
    {
        "full_article": "The numerous add-ons to our daily diet have many benefits for us – and for others \nBunny and I have started taking a daily supplement. Not one of those freebies like the Delhi Times that come along with TOI, the supplement we take is a dietary supplement in the form of a 200mg tablet of magnesium which, far from being free, comes with a sizeable price tag. \nA chemical element, magnesium is an essential mineral which according to Google “is vital for the human body to function properly, playing a key role in muscle and nerve function, blood sugar control and bone health”. \nBeing a workaholic, magnesium doesn’t rest on its laurels after doing all this, but goes on to carry out “hundreds of enzymatic reactions in the body, promotes protein synthesis, and DNA formation, and helps maintain a normal heart rhythm”. \nWhile foods such as spinach, and other green leafy veggies, almonds, cashews, beans, dals, and whole grains are rich sources of magnesium, to be on the safe side adults are advised to take a daily dose of up to 350mg as a dietary supplement. \nBunny and I have been magnesiumising like billy-o for a few weeks and, whether it’s psychological or for real, we find we’re sleeping better and don’t suffer from fatigue-induced cramps or muscle aches.  \nMagnesium apart, there are other dietary essentials such as vitamins, ranging all the way from A to K. Medical science might well unearth more and more vitamins till it runs out of letters of the alphabet. \nWhen I was a boy, nobody seemed to know much about things like magnesium and supplements. The general body of nutritional knowledge was encapsulated in the saying, “An apple a day keeps the doctor away.” \nOur ignorance must have been bliss, for we appear to have got through more or less unscathed, unmagnesiumised enzymatic reactions notwithstanding. \nThose days are long gone, and the dietary order of today are supplements that not only ensure our physical health, but by supplementing its profits also benefit Big Pharma’s financial health. \n\n",
        "headline_1": "Super supplements",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/super-supplements/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 26, 2025 00:00:00  \nThe government's plan for a Tk 6.89 billion project to dredge Kaptai Lake and its surrounding rivers is a massive engineering challenge born from an even greater necessity. For decades, silt accumulation in the Chattogram Hill Tracts' waterways has severely hampered transport and disrupted livelihoods, necessitating an immediate and comprehensive response. To address this, the Bangladesh Water Development Board (BWDB) is set to start a four-year project in 2025, encompassing the dredging of 65.7 km of river routes, fortification of 11.75 km of eroding riverbanks and re-excavation of 25.85 km of canals. The origins of this crisis trace back to the construction of the Kaptai dam for hydroelectric power in the 1960s. While the dam successfully fulfilled its primary goal of supplying electricity to the national grid, it simultaneously triggered an ecological chain reaction. Heavy siltation gradually choked the life from tributaries and linked rivers. The lake bed's continuous filling with sediment has reduced Kaptai Lake's water-holding capacity by 25 per cent in the last 30 years, forming obstructive submerged and visible chars. Consequently, sediment build-up and reduced inflows have impaired boat transport in remote Rangamati upazilas, cutting off communities from vital markets and services. \nThe long-term silt build-up in Kaptai Lake is taking a severe toll on environment as well. It devastates fish populations by depleting oxygen and smothering critical breeding grounds, leading to a sharp loss of biodiversity. Pollution from diesel boats worsens these impacts. Furthermore, the altered water flow from the dam has intensified flash floods and monsoon landslides, accelerating erosion and environmental damage. The project, therefore, holds the promise of protecting the region's unique environmental heritage while easing communication for local communities and boosting local economies, making its urgency and benefits undeniable. \nHowever, its success hinges critically on correcting the flawed dredging and management practices that plagued previous dredging efforts in other rivers. A persistent problem, widely reported and condemned, is the dumping of excavated sediment in close proximity to the riverbanks. Whether this is due to poor oversight or is a deliberate way to create need for future dredging contracts, this negligence defeats the entire goal of the restoration. The piled-up material is simply washed back into the river during the next monsoon rains, wasting the investment and leaving the channel as clogged as before. Such mismanagement of public funds and ecological resources cannot be tolerated in a project of this magnitude, which is directly tied to the infrastructure and livelihood of a historically marginalised region. Success should not be measured by how much is initially dredged, but by how long the channels stay clear. This demands a total break from these failed and costly past methods. It is imperative that all dredging contracts include a scientifically sound sediment disposal plan, one that explicitly prohibits dredged material from being dumped on riverbanks that invites wash-back. \nCrucially, Kaptai Lake's problems are exacerbated by intense land use in its upstream catchment area. Unchecked deforestation and harmful jhum cultivation technique accelerate soil erosion, dramatically increasing the silt that enters the river system. Any solution must therefore address the root cause through an integrated river basin management approach that rehabilitates the surrounding hills and promotes sustainable agriculture. Just as critically, the project must operate with strong, independent oversight. This requires actively involving local communities, environmental scientists and civil society groups in the monitoring process. Their continuous engagement is the best guarantee that transparency and accountability will prevail over the potential for corruption, securing a true and lasting restoration for Kaptai Lake and its surrounding rivers.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The high stakes of dredging Kaptai Lake",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-high-stakes-of-dredging-kaptai-lake-1761404652",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       October 26, 2025 12:00:00  \nThe modest surge in the disbursement of industrial credit in the last fiscal year may be considered as a sign of a rebound in the industrial activities in the country, as well as overall economic growth. Although many other economic indicators are already available, the central bank released the annual figure for industrial term loans only last week. Bangladesh Bank statistics showed that the disbursement of industrial term loan credit increased by around 9.50 per cent in the previous fiscal year (FY25) after a drop of 6.75 per cent in the last fiscal year (FY24). It would be better to tally the credit growth and trend with those indicators to get the big picture. Moreover, focusing on the decade-long trend of the disbursement and recovery of the industrial term loans will also provide some insight into the investment in industrial activities. \nUsually, banks and financial institutions provide advances for industrial activities as term loans and working capital financing. At present, shares of these two types of advances are almost equal, with the ratio of term loans slightly higher. In addition to these, financial institutions provide term loans for factoring, though the amount is relatively low. Short, medium, and long-term loans are available for the industry, with more than two-thirds of the total term loans being long-term. Two-fifth or 40 per cent of the total bank advances is disbursed as industrial credit. In other words, 20 per cent of the total bank advances is industrial term loans, and the remaining 20 per cent is working capital financing for the industry. So, the improvement or deterioration of the banking sector's total loan portfolio is significantly dependent on the movement of the industrial credit, underscoring the crucial role of the banking sector in industrial development.\nA look at the trend of disbursement and recovery of the industrial term loans for the last decade gives some interesting scenarios. First, the annual average growth of term loan disbursement was 9.0 per cent, whereas the recovery growth rate stood at 10.85 per cent. Second, disbursement of the term loans dropped in four fiscal years between FY15 and FY25. Those were: FY16, FY20, FY21 and FY24. Third, industrial credit disbursement witnessed double-digit growth in five fiscal years during the last decade. Recovery of the term loans declined in three fiscal years, namely FY20, FY21 and FY24. Fifth, recovery of the industrial credit exceeded the disbursement in the last three fiscal years.\n\nThere is a fluctuating trend in industrial credit disbursement, which is not abnormal. Due to the COVID-19 pandemic, industrial and manufacturing activities were heavily disrupted. So, the demand for credit also declined during the period, which is widely reflected in the decline in term loans disbursement in FY20 and FY21 by 8.15 per cent and 7.40 per cent, respectively. Recovery of the loans also dropped simultaneously in the same fiscal years, as it was difficult for the manufacturers to repay the loans on time. The pandemic forced many of them to cut down or even shut down their industrial operations. Gross Domestic Product (GDP) of the industry sector posted a moderate 3.61 per cent growth in FY20 after reaching 11.63 per cent in FY19. It, however, rebounded in FY21 by recording 10.30 per cent growth. \nBoth the disbursement and recovery dropped in FY24 when the controversial 12th parliamentary election took place in the country under the autocratic regime of Sheikh Hasina. Election-centric uncertainty, coupled with post-election dissatisfaction among the masses due to their inability to exercise voting rights, created an unfavourable environment for investment. Though the autocratic regime continued to suppress people's anger by brutal force, it was unable to boost economic activities. Overall GDP growth declined to 4.22 per cent in FY24, whereas the growth of industry GDP also dropped to 6.66 per cent from 8.37 per cent in FY23. \nWhile the double-digit growth in industrial term loan disbursement over the last decade may be interpreted as a sign of robust manufacturing activities and increased investment demand, caution is advised. It's crucial to note that some of these loans were not directed towards productive activities and were misappropriated. Cronies of the Hasina regime reportedly influenced banks to disburse a significant amount of money, a portion of which was neither utilized properly nor returned to the banks. This caution is necessary to ensure a clear understanding of the sector's dynamics. \nThe decade-long trend also showed that, though the average growth rate of loan recovery is slightly higher than disbursement, actual double-digit growth of recovery was recorded in five fiscal years. \nIt's intriguing to note that the recovery of industrial term loans exceeded the disbursement in the last three consecutive fiscal years. The recovery crossed the Tk 1 trillion mark in FY23, reaching Tk 1064 billion (or Tk 1.06 trillion) and then dropped to Tk 941.48 billion in FY24. It increased by around 14 per cent to Tk 1073 billion in FY24. This trend raises questions about what drives the higher recovery of term loans, inviting further investigation and analysis. \nAs mentioned at the beginning of the article, a rise in disbursement and recovery of industrial credit in the FY25 is a development for obvious reasons. Bangladesh Bank statistics showed that the disbursement of industrial term loan credit increased by around 9.50 per cent in the last fiscal year (FY25) after a drop of 6.75 per cent in the previous fiscal year (FY24). The first quarter of the last fiscal year was marked by the student-led mass uprising that finally compelled autocratic Sheikh Hasina to step down and flee to India for shelter on August 5. Industrial activities, along with overall economic activities, were limited in the first quarter of the last fiscal year, but regained slightly in the second quarter and gained moderate momentum in the third and fourth quarters. Thus, demand for credit also increased, which is reflected in the higher disbursement of the term loans. \nNevertheless, when compared with FY23, the disbursed amount of term loans was only 2 per cent higher in the last fiscal year. It means the rise in the industrial credit in the last fiscal year was not as robust as it appeared. Moreover, if adjusted for the inflation rate, the growth of term loan disbursement would be estimated to be negative. The average rate of inflation stood at 10 per cent in the last fiscal year. \nQuarterly disaggregation of the term loan disbursement also showed significant fluctuations, as it increased by 40 per cent in the second quarter of FY25, declined by 37 per cent in the third quarter, and finally jumped by 24 per cent in the last quarter. Tight monetary stance kept the interest rate high and increased the borrowing cost in the last fiscal year. Weak law and order discouraged manufacturers from making significant investments and production. International trade uncertainty due to Trump's tariff blitz made things worse. So, under the influence of all the negative internal and external factors, there has been little room for strong growth of ndustrial activities and, consequently, of credit in the economy.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Factors affecting growth of industrial credit",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/factors-affecting-growth-of-industrial-credit-1761404864",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       October 26, 2025 00:00:00  \nTo align Bangladesh's labour laws with international standards, enhance workers' rights, and strengthen workplace safety and protections, the interim government on Thursday approved the draft ordinance of the Labour Law. Among major changes, the draft law recognises domestic helps as worker, relaxes rules for forming trade unions and mandates the establishment of provident fund or pension schemes for all workers. It also prohibits the blacklisting of workers, a practice reportedly common in the garment sector, where dismissed workers are denied employment in other factories. In addition, the amendment introduces strict provisions to address sexual harassment and significantly increases maternity welfare benefits. It also bans gender-based wage discrimination. \nThe proposed amendments have been hailed by rights activists as a major step towards improving labour rights and ensuring safer workplaces. Industrialists, however, have voiced concern over the significant reduction in the number of workers required to form a trade union. \nAt present, forming a trade union requires the support of at least 20 per cent of the workforce. Under the new provision, however, the requirement will vary depending on the size of the enterprise. In companies employing up to 300 workers, a union must have at least 20 members. The threshold will increase to 40 members for factories with 301 to 500 workers, gradually increasing with the size of the enterprise, and in companies with more than 3,000 employees, at least 400 members will be required to form a union.\nIndustrialists have opposed the lowering of these thresholds, arguing that it could disrupt operations in large factories and lead to increased labour unrest.\nThe amendment to the Labour Law follows the interim government's ratification of three ILO conventions concerning occupational safety and health, the promotional framework for workplace safety, and the prevention of violence and harassment. Implementing these reforms is also crucial as Bangladesh seeks to secure the extension of Generalised System of Preferences (GSP) facilities in the European Union after its graduation from the Least Developed Country (LDC) status.\nFormation of trade unions is not only a fundamental right of workers but also a stabilising factor in industrial relations when unions genuinely advocate for workers' rights. A note of caution, however, is that the relaxation of rules for forming unions could lead to formation of multiple trade unions within a single factory. If these unions are backed by rival political parties or guided by ulterior motives, there is a real risk of conflict erupting at the workplace, undermining the stability and industrial growth.\nTherefore, the trade union registration process must be transparent. It should be ensured that only genuine workers participate in the CBA elections and that real workers have the opportunity to form unions, and they are advocating for the rights and wellbeing of the workers, not by vested interests or quarters driven by political motives.\nThe labour law should therefore be implemented in a well-coordinated manner to guarantee three fundamental issues-workers' right to organise, the right to collective bargaining, and the promotion of sound industrial relations. \nBesides, the proposed labour law ordinance provides for alternative dispute resolution (ADR) methods like negotiation, mediation and arbitration as a mandatory first step to resolve labour disputes. Crimes like murder, rape and suchlike are dealt with in accordance with the law of the land and the established norms and practices. But labour issues such as maternity leave, overtime, payment of wages, minimum wages etcetera fall into a different category, many of which are simply misunderstandings, are possible to resolve out of court to the mutual satisfaction of all the disputants. \nA Conciliation-cum-Arbitration Committee (CAC) already exists under the Bangladesh Garment Manufacturers and Exporters Association (BGMEA). Dispute resolution centres should be established and allowed to run independently in major industrial belts so that it can rapidly resolve the grievances of the owners and the workers, allowing no time for ill-feelings to develop and fester. Only then it will keep production uninterrupted and promote harmonious industrial relations.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "A stride towards recognizing workers' rights",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/a-stride-towards-recognizing-workers-rights-1761404953",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 26, 2025 00:00:00  \n\nThe yarn market in Bangladesh has been facing a prolonged crisis in recent years. Despite having a textile industry valued at approximately USD 23 billion, import dependency is gradually increasing due to price competitiveness compared with local procurement. As a result, local spinning industries are struggling to generate sufficient revenue. In many cases, they are compelled to sell yarn at break-even prices just to ease cash flow crises.\nCurrently, local manufacturers sell yarn at a price roughly USD 0.30 per kg higher than imported alternatives. For instance, the import price of 30-count yarn is around USD 2.65-2.70 per kg, while the local price ranges from USD 2.95-3.00 per kg. This price gap significantly affects the cost of goods sold (COGS) for garment manufacturers, prompting them to prefer imported yarn over locally sourced products.\nIn India, several initiatives have strengthened the yarn industry, such as reducing utility costs through subsidies and offering cash incentives to promote growth. In contrast, the situation in Bangladesh is quite adverse. The cash incentive has been reduced from 4 per cent to 1 per cent, while a 2 per cent advance income tax (AIT) has been imposed on raw cotton imports, alongside a 67 per cent value-added tax (VAT) on locally produced yarn. Consequently, the local yarn industry is losing competitiveness, and rising utility costs are further exacerbating manufacturing challenges.\nTo ensure sustainability and cost efficiency, the ready-made garments (RMG) sector is increasingly sourcing yarn from India. This has resulted in a large stockpile of unsold yarn in local warehouses, creating serious storage challenges. Many local manufacturers are thus forced to sell yarn at break-even prices-or even at a loss.\nAdditionally, many spinning mills are currently unable to access Export Development Fund (EDF) facilities, putting their bank borrowings at significant risk due to potential repayment difficulties.\nGiven the critical linkage between the yarn and RMG sectors-the latter being the most vibrant source of foreign currency earnings for Bangladesh-positive policy interventions are urgently needed. Measures such as utility subsidies, reduced bank interest rates, and VAT waivers could provide the breathing space required for the sector to regain global competitiveness.\nKawsik Azad Pronoy\nBanker and Business analyst\nkawsik.azad@dutchbanglabank.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Urgent steps needed to protect yarn industry",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/urgent-steps-needed-to-protect-yarn-industry-1761404983",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-10-2025"
    }
]