[
    {
        "full_article": "Prime Minister Narendra Modi’s exhortation to the Chief Ministers gathered at the 10th Governing Council Meeting of NITI Aayog over the weekend, in New Delhi, that the Centre and States should come together as “Team India” to propel the country forward, is a good sentiment; but, it belies reality. The Centre-States relationship right now is a one-way street, with the Centre resorting to the stick, and, occasionally, to the carrot method, to make the States comply with its wishes. The States are finding it increasingly difficult to voice their often genuine and serious grievances at the national level since federal bodies such as the NITI Aayog Governing Council or the Goods and Services Tax (GST) Council do not meet often. Meeting once a year is not nearly enough for the Governing Council of a body whose very first objective is to develop a “shared vision of national development priorities”. The GST Council, too, has not met in more than five months, when regulations say it should meet at least once a quarter. So, when the States do get a chance to speak at the national level, as they did on Saturday, most have no choice but to focus on their individual problems or achievements rather than on a collaborative ‘Team India’ approach. There were, however, some notable deviations where Chief Ministers looked beyond their States’ borders in an attempt to drive national growth. One was Andhra Pradesh Chief Minister N. Chandrababu Naidu’s proposal for the creation of three sub-groups of States to focus attention on the issues of GDP growth and investments, leveraging India’s demographic bounty, and using technology to drive governance. Sub-groups are a good way for the Centre to bring States on board, if it finds a body comprising all States to be too unwieldy.The most notable pan-India suggestion was probably Tamil Nadu Chief Minister M.K. Stalin’s call for the Centre to share 50% of its tax revenue with the States, up from the current formula of 41%. This is an issue that certainly requires more discussion. The implicit condition behind the Centre providing States compensation for any losses arising out of GST for five years was that the States would use this time to bolster their own tax revenues. While progress on this has been patchy — with some States doing far better than others — it has nevertheless been significant. The States’ combined own tax revenues as a percentage of Gross State Domestic Product (GSDP) grew from 6.6% in 2017-18 to 7.2% in 2024-25. On the other hand, GST has failed to live up to its potential, with net revenues only recently surpassing pre-GST indirect tax levels. Since GST subsumed many of the States’ levies, it seems only fair that the Centre seriously consider their demand for a bigger share in central taxes. Published - May 27, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        Andhra Pradesh\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        government",
        "headline_1": "Greater share: On States and central taxes",
        "headline_2": "States deserve a bigger share of central taxes in post-GST era",
        "link": "https://www.thehindu.com/opinion/editorial/greater-share-on-states-and-central-taxes/article69621223.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-05-2025"
    },
    {
        "full_article": "In the cyclical nature of cricket, India is stepping into a new era in Tests. The appointment of Shubman Gill as captain in the game’s longest format hints at a break from the past and new beginnings. At 25, Gill is part of the young turks within the squad, while K.L. Rahul and Jasprit Bumrah, at ages 33 and 31 respectively, remain the senior duo with previous captaincy stints. But in picking Gill as the leader, the selectors, especially chairman Ajit Agarkar, have loudly proclaimed that they are looking at the long road into the future, and not a short-term replacement. The retirements of regular skipper Rohit Sharma and talisman Virat Kohli in quick succession meant that big gaps had to be filled both in terms of leadership chutzpah and batting acumen. Gill, with all the high potential through which he stepped into the game at all levels, be it under-19, Punjab and later the national unit, seems a good fit. He is also leading Gujarat Titans in the Indian Premier League and is clued into the art of captaincy. Men younger than him have led India in the past, notably Mansur Ali Khan Pataudi, and Gill, with Rishabh Pant as his deputy, will learn more on the job starting with the five Tests commencing in England in June. He will have the freedom and responsibility to shape the team he leads.Besides Rahul and Bumrah, Gill has to contend with other seniors, including Ravindra Jadeja, who, at 36, is closer to the finish line. It is what Mohammad Azharuddin dealt with while having Kapil Dev, Dilip Vengsarkar, K. Srikkanth and Ravi Shastri in the ranks. M.S. Dhoni too had a similar task as Sachin Tendulkar, Sourav Ganguly, Rahul Dravid, V.V.S. Laxman and Virender Sehwag reported to him. Gill has the respect of the dressing room, being marked for greatness as he climbed the rungs. With 1893 Test runs averaging 35.05, his numbers seem underwhelming but there is no mistaking his talent, and captaincy may well goad him to temper his glorious stroke play with some caution. Leadership caused a surge in Kohli’s run-making ability, and the expectation is that Gill too may reap some benefits. India will also miss R. Ashwin when it embarks on the tour of the Old Blighty, and Gill has to helm this transition well. That hope is intrinsic to this unit is evident as Karun Nair makes a comeback after last turning up for India in 2017. He has been prolific in the domestic circuit besides doing well in county cricket over the previous few seasons, and the last bit should help him acclimatise to English conditions, faster.\r Published - May 27, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Test  cricket\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        cricket\n                    \n                            /                      \n                        \n                        Indian Premier League\n                    \n                            /                      \n                        \n                        United Kingdom",
        "headline_1": "​Testing times: On India’s new Test Captain",
        "headline_2": "Shubman Gill is in charge of a Test team in transition",
        "link": "https://www.thehindu.com/opinion/editorial/testing-times-on-indias-new-test-captain/article69621237.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-05-2025"
    },
    {
        "full_article": "A ship sinks near Cochin port, reminds India that preventing oils spills is easier than cleanups\nDebris has begun to wash ashore Kerala’s coast, after a Liberian-flagged cargo ship capsized just 27km away on Sunday. Warnings have been issued, rightly, that people shouldn’t get close and touchy with the beached containers. Besides hazardous cargo, oil spill is the other danger. The ship’s tanks were carrying over 450 metric tonnes of diesel and furnace oil. India’s coast guard and navy did a good job rescuing the crew, but fighting damage to coastal ecosystems and fishing livelihoods may prove a much greater challenge.\nRecent central govt EnviStats patted Kerala’s beaches for having the least polluted waters in the country. Unless the oil spill threat proves punier than feared, all possible resources – including international ones – need to be mobilised to preserve this healthy shoreline. Standard global solutions range from skimming oil from the water surface by various means, using chemical dispersants to break up an oil slick into smaller concentrations, booms to slow its spread, and bioremediation.\nOne disheartening thing is that technological progress on this front leaves a lot to be desired. For example, the fraction of oil spill recovered after the 2010 Deepwater Horizon disaster in the Gulf of Mexico was not much higher than after the Exxon Valdez oil spill off Alaska three decades earlier. These were both high visibility events that drew billions in cleanup dollars. But environment experts point to optics and efficacy being completely different yardsticks. Bombarding the DP spill with the trademarked Corexit dispersant produced a vast, cloudy suspension. It looked like it was helping. But actually, it only spread the oil further, reaching even more marine life at different depths.\nData indicates that not only is removing oil spills from the sea challenging, it is ineffective even in calm waters. So while keeping our fingers crossed that Kerala doesn’t have a big tragedy on its hands this time, it is lessons in prevention that would be of real help in the future. For example, could MSC ELSA 3 have been towed away from India when it started listing? At 28 years of age, was this feeder vessel un-portworthy? At 640 containers, was it overweight? Analysing such issues thoroughly is key to lifting the country’s trade by sea while protecting it from the dangers ships can visit upon us.  \n\n",
        "headline_1": "Coast guarding",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/coast-guarding/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-05-2025"
    },
    {
        "full_article": "He had such presence and then it went so downhill\nHe was some sort of a father figure. Shoulder length hair, dressed in an ethnic short kurta, faded jeans and leather sandals. He had aged well. He walked into the plane alone, getting many admiring glances as he took the front row aisle seat of the economy class cabin, adjacent to me but separated by the aisle. He could have been anyone – an economist, a poet, or simply a man of learning. I called him the magus, perhaps a real-life avatar of the fictional Maurice Conchis.\nThe man kept his reserve in a cabin full of talkative Indians like me on their way to Hong Kong. He even switched on the overhead light to read, the mark of an erudite man. I was conscious that Indians had marked themselves out as not the best-behaved passengers, especially with a few drinks inside them. Men like him who conducted themselves with dignity undid the damage done to our reputation. These were my thoughts as I watched him.\nThe plane’s flight soon dulled into the long-haul mode, and a boredom took over which was broken at the sight of the drinks trolley. Being partial to an inflight drink, I got myself a glass of wine and observed him. He didn’t seem to be keen to have a free drink, which elevated him further in my esteem.\nThen I overheard, ‘What are you serving to business class passengers?’ He was coming into his own. Alcohol, even when in a bottle, has that power. He was provided a list, from which he chose an expensive whiskey not on the economy class menu. He had six or seven drinks, each making him louder and, slowly, uncouth. ‘You don’t know who I am,’ he uttered the oft-heard line. An air hostess stopped serving others as she made repeated trips for him, requesting him to calm down. When food was served, he asked for the food menu, and had Chinese, continental, Indian, and Thai food, all from business class. At the height of his power, he now played cupid and tried to get a group of boys introduced to the air hostesses, who politely fought him off. When I changed my seat to find some peace, he was still reigning.\nI last saw him in the baggage claim area. He was in a wheelchair, with all the drink and food getting the better of him. He still had someone – a bell boy – running around for him. ‘Not that one, didn’t you hear me? Get that blue suitcase.’\n\n",
        "headline_1": "Meeting Magus",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/meeting-magus/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-05-2025"
    },
    {
        "full_article": "Death of 16 racehorses in Jabalpur and Hyderabad shows the appalling state of animal care in India\nThe horse is a marvel of nature. Powerful yet graceful, man’s companion in war and peace for 5,500 years. It was central to the idea of empire in ancient India – Ashvamedha – and key to the growth of megacities. London had 50,000 horses for transportation alone in 1900, NYC more than 100,000. Now, it has disappeared from modern cities, barring their racecourses, and news from the paddock isn’t good. \nEight racehorses, out of work after the collapse of an alleged racing and betting league, have died in Jabalpur, MP. Reports say 57 such horses were transported from Hyderabad – where eight others died at Hyderabad Race Club last year – by road at the height of summer. As blood tests have not confirmed any infection, officials suspect heat, malnutrition and lack of veterinary care killed them. If true, this is criminal and must not go unpunished. Animals are never stakeholders in any human enterprise, be it a racecourse, dairy or zoo. Whether it succeeds or fails, they should be taken care of. Yet, too many animal owners in India don’t get this. Dry cows abandoned by dairies, dogs dumped post-pandemic, and now this. \nHorse racing is not a humane sport. Adolescent horses are put on the track, and peak by the age of 4.5 years, before they attain full skeletal maturity. Injuries are common and still almost impossible to heal. Death can come mid-race via a collapsed heart or bleeding lungs. Horses with broken legs used to be shot, now there are lethal injections. In US, the industry is estimated to kill six horses every day. All the beauty and poetry in a horse race is in the beholder’s eye. The galloping horse, in Browning’s words, takes a dim view: “And one eye’s black intelligence – ever that glance o’er its white edge at me, his own master, askance!”\n\n",
        "headline_1": "Cruelty on two legs",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/cruelty-on-two-legs/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-05-2025"
    },
    {
        "full_article": "Op Sindoor has delivered a hard lesson to Pakistan. Ceasefire firmly in place, it’s time to 1) set the right global narrative about Kashmir, and 2) have a strategy to deal with Pakistan.\nFor the narrative — in an era where narrative is as important, if not more, than reality — an all-party delegation is flying around the world as you read this.\nIn terms of future strategy, here’s a different perspective. In the final scene of The Social Network, Zuckerberg is in a conference room with a legal intern. He’s facing multiple lawsuits — from the Winklevoss twins, who claim he stole their idea, to co-founder Eduardo Saverin, who accuses him of deceitfully diluting his stake.\nRead full story on TOI+\n\n",
        "headline_1": "Why fighting Islamabad isn’t worth New Delhi’s time",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/The-underage-optimist/why-fighting-islamabad-isnt-worth-new-delhis-time/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-05-2025"
    },
    {
        "full_article": "Given the current political situation, wherein the call for an election roadmap has become louder than ever, it is important that the interim government only carry out some essential and practical reforms that can be backed by political consensus.\nSince taking office on August 8 last year, the interim government has formed 11 commissions to reform the constitution, judiciary, election commission, police, public administration, local government, anti-corruption, health, women's affairs, mass media, and labour. All of them have submitted their reports, with many proposing more than 100 recommendations. Since March 20, the National Consensus Commission (NCC) has been holding talks with various political parties and other stakeholders to reach a common ground on the recommendations. While it is understandable that an agreement will not be reached on every single recommendation, some can be left behind for consideration at a later time by an elected government. In fact, during their dialogue with NCC members on May 25, civil society members urged the interim government to refrain from amending the constitution and leave the task to elected representatives. There are other such reform recommendations that are best addressed by a parliament rather than an interim administration, since such action may be viewed as crossing a constitutional boundary.\nThe interim government should also consider, while selecting recommendations, what is feasible within its tenure. For example, the police commission's report urges immediate implementation of a Supreme Court directive regarding arrests, searches, and questioning. This kind of recommendation can easily be implemented in the short term. Therefore, the government should carry out such reforms if doing so helps with holding a free and fair election. When the NCC was formed on February 12, its tenure was fixed for six months; in other words, we can expect the NCC to complete the discussions and deliver a summary of agreed-upon recommendations by August/September. If the election is going to be held anytime between December 2025 and June 2026, there may not be sufficient time left to implement even all the agreed-upon recommendations.\nWith that in mind, the interim government should prioritise recommendations that will make the return to democracy and a parliamentary system smoother. As such, the focus should be on the reports of the election, police, judiciary, public administration, and local government reform commissions. However, the government must be careful not to leave out key stakeholders in their attempt to implement the reforms. While the consensus of political parties is crucial, there are groups who will be impacted by the reforms, and they must be consulted as well. Ultimately, we hope all stakeholders will rise above their individual concerns and prioritise greater national and democratic interests in reaching an agreement on the necessary reforms.\n",
        "headline_1": "Implement only essential reforms",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/implement-only-essential-reforms-3904026",
        "news_paper_name": "The Daily Star",
        "publish_date": "27-05-2025"
    },
    {
        "full_article": "A decade ago, I attended a conference in Delhi focused on technology-driven education. As I listened to the keynote speakers, I noticed a common thread in their presentations: most of them sounded like enthusiastic promoters of educational technology, almost like evangelists. Some seemed like representatives of multinational companies, advocating the use of specific tools and platforms. They spoke in glowing terms about how technology would transform education for the better, but their repetitive rhetoric made the audience visibly bored.\nAmidst this stream of tech-positivity, a chemistry professor from IIT Delhi broke the flow with a bold, contrarian view. He challenged the prevailing narrative. At first, his comments drew laughter, perhaps because they seemed outdated. But as he continued, the room quieted as his message gradually appeared to be thought-provoking. He firmly argued that using technology beyond chalk and board in classrooms was a mistake. According to him, technology was making teachers lazy and eroding their creativity. Many teachers were downloading PowerPoint slides and using them in class without preparation or explanation, resulting in students struggling to follow along. He urged educators to abandon this tech-driven approach, which he believed was leading education down the wrong path. Anything that destroys a teacher's creativity, he said, should have no place in the classroom.\nAt the time, I partially agreed with him, based on my own classroom experiences. But like many, I moved on, caught up in the daily pressures of academic life. Recently, however, an encounter brought his words back to me with renewed clarity. One day, I visited a friend's house and found his daughter watching a lecture by a foreign professor on her mobile phone using the loudspeaker. The video ended quickly. Out of curiosity, I asked, \"Is your college closed today?\" She replied, surprised, \"No, it's open.\" I then asked why she skipped class. Her answer struck a chord: \"I don't enjoy the lectures.\" When I probed further, she said, \"The teacher just runs slides without any explanation. It's hard to concentrate. I feel completely disconnected in class.\"\nHer words reminded me of that IIT professor's powerful observation: technology, if misused, can make teaching monotonous and ineffective. Students lose interest when educators rely solely on downloaded slides. It becomes harder for them to stay engaged, and over time, they drift away from learning. That professor's insights were not mere opinions—they now reflect a growing reality. Today's students are tech-savvy, but they are still human. They respond best to teachers who connect with them personally—teachers who explain face-to-face, who make classrooms feel alive. Slides and videos can never replace that connection. Education is not just about transferring information; it is about fostering understanding, inspiring curiosity, and encouraging critical thinking through interaction.\nI am not suggesting a complete ban on technology in the classroom. That would be impractical and counterproductive. Rather, I strongly advocate for the careful use of technology—tools that complement, not replace, human interaction. Technology should assist in teaching, not dominate it. Teachers should not become slaves to screens. Instead, they should use technology to enhance their teaching and make learning more human-centred and engaging.\nIn recent years, the Government of Bangladesh has introduced various initiatives to promote the use of technology in education. Many schools and colleges have been equipped with digital infrastructure. But despite these efforts, no comprehensive evaluation has been conducted to assess the effectiveness of these technologies in improving educational quality. Consequently, we do not yet know whether this increased use of technology is having a truly positive impact. Moreover, as class time has become more constrained, a growing number of students are turning to private coaching centres. Despite government attempts to regulate this \"coaching industry\", these efforts have not been entirely successful. In reality, wherever there is demand, a market will emerge—that's the basic law of economics. The pressing question remains: why are students opting out of classrooms and going to coaching centres? Few have seriously investigated this fundamental issue. Until we conduct a deep analysis, we won't be able to solve the root problem.\nAt the college level, student participation in classroom learning is visibly declining. Even those who attend class are often not mentally engaged. Some may ask, \"Aren't these students studying?\" Of course they are—but mostly through private coaching or tuition. This raises another question: are classroom teachers not teaching effectively? Or are they unable to make their lessons engaging enough for students?\nTo answer these questions, we must think differently. In today's world, almost every student owns a smartphone and knows how to use it efficiently. Teachers, too, are now digitally equipped. If we stop seeing this reality as a weakness and instead use it as a strength, might we bring about a positive transformation in our college classrooms?\nThis brings us to a modern and promising concept—the \"flipped classroom.\" A flipped classroom turns the traditional model of instruction on its head. Instead of introducing new material in class, the teacher shares it with students beforehand via WhatsApp, Messenger, or other platforms. Students study the material at home and come to class with questions and thoughts. The classroom then becomes a lively space for discussion, clarification, and deeper engagement. This model isn't limited to printed material. Teachers can record brief video lectures and share them in advance. If these videos are interesting and aligned with the subject matter, they can boost student interest. Some teachers may even create their own YouTube channels and upload content for broader access. In addition, PowerPoint slides and other resources can be shared to support learning. These methods foster a culture of self-study and independence among students. Instead of memorising facts, they begin to understand concepts, think critically, and engage meaningfully with the material. As a result, they are more likely to participate actively in class, making the classroom a dynamic and interactive learning environment for both students and teachers.\nIn short, the flipped classroom can be an effective way to bridge the growing gap between students and teachers in this digital age. With just a little effort, it is possible to rekindle students' interest in learning and significantly increase their classroom engagement. It's not about rejecting technology, but about using it wisely and purposefully to enrich the educational experience.\nLet us not forget: education is not merely about data delivery—it's about connection, communication, and transformation. A teacher's role is not just to provide information but to guide, inspire, and spark curiosity. As we move forward in this technology-driven era, let us strive to make our classrooms not silent, but vibrant—with dialogue, understanding, and mutual respect at the heart of every lesson.\nDr Md. Mizanoor Rahman is assistant professor at the Bangladesh Open University. He can be reached at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Technology should assist in teaching, not dominate it",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/technology-should-assist-teaching-not-dominate-it-3903056",
        "news_paper_name": "The Daily Star",
        "publish_date": "27-05-2025"
    },
    {
        "full_article": "In Bangladesh, seeking healthcare services is marked by profound challenges that stem from a complex interplay of demand- and supply-side barriers. On the demand side, pervasive low health literacy severely limits individuals' ability to make informed decisions about their well-being. Sociocultural norms, often deeply entrenched, discourage proactive engagement with healthcare systems. At the same time, misconceptions about medical care, such as equating medicine with treatment, or assuming that costly interventions guarantee superior outcomes, further complicate the issue. Affordability remains a significant hurdle as many families struggle to access even basic services. Additionally, the readiness of public health facilities is often inadequate, undermining trust and discouraging utilisation. On the supply side, the healthcare system is a fragmented, pluralistic mix of providers, ranging from trained allopathic practitioners to unregulated traditional healers. This diversity, coupled with weak regulatory oversight, results in inconsistent care quality and frequent instances of inappropriate treatment.\nFor decades, efforts to address these issues have centred on behaviour change communication (BCC) campaigns, which aim to educate communities and shift attitudes towards healthier practices. While these initiatives have achieved some success in raising awareness, their impact is often fleeting. Top-down messaging struggles to resonate with our diverse population, failing to account for regional, cultural, or socioeconomic variations. Moreover, these campaigns rarely address deeper systemic issues, such as widespread mistrust in public health services or the absence of robust regulatory frameworks. As a result, the gains from such interventions tend to dissipate quickly, leaving communities vulnerable to the same barriers. To break this cycle, Bangladesh requires a transformative, community-driven solution, one that harnesses the potential of its youngest citizens to lead a paradigm shift in health literacy and behaviour.\nImagine a classroom in a rural Bangladeshi village where third-graders are not only learning foundational subjects like mathematics and language but also absorbing critical lessons about hygiene, the importance of vaccinations, and the value of clean water. Picture high school students stepping into leadership roles, organising health fairs to dispel myths about generic medicines or teaching their parents how to recognise early symptoms of common illnesses. This vision forms the core of an innovative proposal to train students from classes 3-12 as health ambassadors, equipping them with the knowledge, skills, and confidence to drive meaningful change in their families, peer groups, and broader communities.\nStudents are uniquely positioned to act as catalysts for transformation. As trusted members of their households, especially in rural areas, school-going children have a remarkable ability to share knowledge in ways that resonate deeply, often bypassing the resistance that external campaigns encounter. A young girl explaining the importance of antenatal care to her mother might inspire timely visits to a clinic, improving maternal and child health outcomes. A teenage boy challenging myths about traditional healers in his village could shift community perceptions, encouraging reliance on qualified providers. Through their peer networks, students can amplify these messages, normalising behaviours such as seeking care from licensed practitioners or prioritising preventive measures like regular check-ups. In communities where scepticism towards public health services runs high, students can serve as bridges, rebuilding trust by sharing evidence-based information about the benefits of government-run clinics and programmes.\nThe proposed approach is both practical and adaptable to the developmental stages of students. Children in classes 1-5 would focus on foundational health concepts, such as the importance of handwashing, safe drinking water, and balanced nutrition. These lessons would be integrated into their existing curriculum, making them accessible and engaging through interactive activities like storytelling or games. Older students, in classes 6-12, would tackle more complex topics, including maternal and child health, the management of non-communicable diseases like diabetes, and the dangers of self-medication or reliance on informal providers. To deliver this education, schools would establish well-being clubs—student-led groups supported by trained teachers. These clubs would serve as platforms for peer learning, fostering a sense of ownership and responsibility among participants.\nBeyond the classroom, students would engage in hands-on, community-oriented activities designed to translate knowledge into action. Peer health clubs would encourage students to share what they have learnt with friends, creating a ripple effect of awareness. Community outreach initiatives, such as health fairs or door-to-door campaigns, would allow students to directly engage with neighbours, promoting local health services and addressing common misconceptions.\nThis strategy offers a sustainable, cost-effective alternative to traditional campaigns. By leveraging existing school infrastructure, the programme minimises the need for additional resources while maximising reach. Teachers, already embedded in the education system, can be trained to deliver health lessons, ensuring consistency and scalability. Local health workers can complement these efforts by providing technical support, such as guest lectures or materials for student-led campaigns. The ripple effect of this approach is profound: a single child educating their family can spark generational change, while peer-to-peer sharing builds a network of informed advocates. Over time, these efforts can reshape community norms, fostering a culture of accountability where citizens demand quality care and providers are incentivised to deliver it.\nEvidence from similar initiatives underscores the potential for success. In India, school-based health education programmes have significantly improved hygiene practices, leading to measurable reductions in waterborne diseases. In sub-Saharan Africa, youth-led campaigns have increased awareness of HIV/AIDS, driving higher rates of testing and treatment adherence. These examples demonstrate that young people, when equipped with the right tools, can affect meaningful change. In Bangladesh, implementation would begin with the development of a tailored curriculum, designed in collaboration with health and education experts to align with national priorities. Teachers and students would undergo training to ensure effective delivery, while partnerships with local health offices would provide logistical support. Successful pilots could be scaled up through integration into national education policies, with backing from government agencies and development partners.\nThe challenges facing Bangladesh's healthcare system are formidable, but they are not insurmountable. By investing in students as health ambassadors, the country can cultivate a generation of informed, empowered leaders who redefine how communities engage with healthcare. This approach taps into the energy, creativity, and influence of young people, transforming them into agents of change. As students share knowledge, challenge misconceptions, and advocate for better care, they lay the foundation for a healthier, more equitable society. The voices of confident, knowledgeable young ambassadors could ignite a healthcare revolution, ensuring that every citizen has the tools to seek, demand, and access quality care. Through this innovative strategy, Bangladesh has the opportunity to not only address its immediate health challenges but also build a resilient, informed population capable of sustaining progress for generations to come.\nDr Syed Abdul Hamid is professor at the Institute of Health Economics of Dhaka University and convener at Alliance for Health Reforms Bangladesh (AHRB).\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "How young citizens of Bangladesh can transform the future of its healthcare",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/how-our-young-citizens-can-transform-the-future-bangladesh-healthcare-3903706",
        "news_paper_name": "The Daily Star",
        "publish_date": "27-05-2025"
    },
    {
        "full_article": "A troubling development has recently come to light, highlighting the culture of impunity that flourished under the Awami League regime. According to a report by Prothom Alo, two contractors—Toma Construction and Messrs Hasan International—were fined Tk 50 crore by the Department of Environment (DoE) in early 2021 (or late 2020) for illegally cutting hills in Chattogram during the construction of the Dohazari-Cox's Bazar railway project. However, the companies were exempted from paying the fine in June 2022 allegedly by the then secretary of the Ministry of Environment, Forests and Climate Change, who also chaired the ministry's appeal authority at the time. This points to a serious abuse of power, with strong indications that the waiver was due to the secretary's ties with the companies involved.\nAs per an earlier report, the above-mentioned companies excavated 2.22 crore cubic feet of earth from hills in the Rangapahar area of Lohagara upazila, far exceeding the approved limit. While the government authorised the excavation of 37 hills—an act that is itself questionable—the companies cut an additional 16 without permission. According to a DoE official, the environmental damage caused by Toma Construction, a company of questionable repute, was estimated at around Tk 2,000 crore! Because of the sheer scale of the damage, the matter was allegedly hushed up to avoid further scrutiny.\nIn November 2021—nine months or so after the levying of the initial fine of Tk 50 crore, which was exempted at a later stage—the Chattogram DoE filed a case against the two companies with the Environment Court, which delivered its verdict on February 26 last year. Messrs Hasan International reportedly admitted its offence and was fined Tk 120,000, while Toma Construction was fined only Tk 50,000. Such nominal penalties for such grave violations raise serious concerns about the effectiveness of our justice system and environmental safeguards.\nOver the past decades, illegal hill-cutting has become rampant across the country despite being prohibited by law, precisely because of the complicity of relevant officials and the political connections of offenders. Chattogram city alone has lost 120 hills over the last 40 years to real estate developments, road construction, and other projects. Alarmingly, this destructive trend has continued even after the political transition in August last year. Given the aspirations of the new Bangladesh we are trying to build, the authorities must take decisive steps to halt further destruction of hills and hold all responsible parties—regardless of their connections or influence—fully accountable. Our environment cannot afford another chapter of negligence and impunity.\n",
        "headline_1": "Don’t let hill destroyers get away unpunished",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/dont-let-hill-destroyers-get-away-unpunished-3901851",
        "news_paper_name": "The Daily Star",
        "publish_date": "27-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 27, 2025 00:00:00  \nWhen a set revenue target looks unachievable, the reasons may be either it is too lofty to achieve or inefficiency on the part of taxmen or some unavoidable setback encountered at some point of the fiscal period. In case of Bangladesh, the general trend of mismatch between the revenue target and the actual earning is a combination of the first two. The fiscal year 2024-25 had also to bear the brunt of the third in the form of July-August uprising and its ripple effects throughout the year. If all this was not enough, the latest pen-down programme observed by the officials of the National Board of Revenue (NBR) following the ordinance on its bifurcation has proved to be the last straw on the camel's back. The consequence has been what it ought to be: by April, the government's revenue income will miss the downsized target by Tk 715 billion.\nThere was no guarantee that the tax department would have achieved the target if it did not go for the pen-down strike. But the disruption caused due to the protest programme, particularly at this late and crucial stage, is expected not only to miss the target by a bigger margin but may also decelerate the process of garnering revenue during the current and the final months of the outgoing financial year. Move to split the NBR was not only ill-timed but also the process of doing so caused dissent among the tax people. Sure enough, there was a need for reaching a consensus through extensive consultation with NBR officials before going for its bifurcation. Some experts have questioned the merit of placing the bifurcated organs of the NBR under the finance ministry because bureaucratic supervision will largely be responsible for compromising whatever autonomy the unified organisation enjoys. Evidently, such imposition of the decision could well be avoided and so too the self-inflicting harm. At a time when the country needs as much tax revenues as it can generate, smooth and better coordination was in demand.\nMobilisation of only Tk3.58 trillion in domestic revenue during the past 10 months of this fiscal and that too at a decelerated growth rate of 3.24 per cent compared to the previous fiscal still has a large gap to cover. Even the revenue officials have expressed their doubt that they cannot close the gap. This is certainly not good news for the interim government. In whichever form the NBR operates next until it is in power, it will have to carry the legacy of the past, this current fiscal year in particular. \nAt a time when the NBR was supposed to be invigorated to put in a robust performance in tax collection, any change in its organogram had to be brought about rationally and the timing of it had also to be perfect without negatively affecting its revenue mobilisation process. Taking care of the overriding need for clearing the augean stables was more important than any other programme. After all, the bottom line is to expand the tax net and eliminate the collusion between a segment of dishonest tax officials and tax payers that either unlawfully exempts some from submitting tax return or helps pay a radically sliced amount in place of the actual tax return they needed to submit.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Missing revenue target",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/missing-revenue-target-1748274501",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       May 27, 2025 00:00:00  \n\nThere was a time when the Modhupur forest, also known as the Modhupur Sal forest, was a vibrant ecosystem teeming with wildlife. For those who grew up near its edges, the memories of deer grazing freely, birdsong echoing through thick canopies, and the subtle rustle of Sal leaves in the wind are indelible. But today, these sounds are fading, and the forest is shrinking before our eyes. What was once a vast stretch of 45,000 acres of Sal-dominated wilderness has now been reduced to mere 10,000 acres. The culprit: unchecked deforestation, illegal encroachment, and unregulated agricultural activities.\nThe decline of Modhupur Forest situated in Tangail district, is not just a local tragedy -- it is a national crisis. Many environmentalists and scientists fear that this 22,000-year-old natural treasure might vanish within the next ten years if we fail to act decisively. The forest's destruction would not only erase a critical biodiversity hotspot but also dismantle an ecological system that supports water regulation, carbon storage, and soil conservation in central Bangladesh.\nAgainst this alarming backdrop, the recent initiative by the Government of Bangladesh to restore the degraded Sal forest through a community-based approach is both commendable and urgently needed. It represents a crucial shift in forest management -- one that acknowledges that forests cannot be saved by fences and enforcement alone, but by involving the very people who live alongside them.\nAccording to officials from the Forest Department, the restoration efforts in Modhupur rest on several vital pillars. The backbone of this initiative is the replanting of native Sal trees in degraded zones. This move is essential for reviving the forest's original character and biodiversity. \nThe inclusion of local communities in the restoration process is key. By turning forest dwellers into stewards of the environment, the initiative aims to build sustainable, long-term conservation practices.\nDemarcation and reclamation of forestlands are also crucial under which a significant portion of forestland will be officially demarcated to protect it from illegal occupation. Forest areas already encroached upon are being reclaimed and reforested.\n The government is also embracing a data-driven model. With tools such as an ODK-based dashboard, forest officials are now equipped to undertake precise, site-specific planning for restoration.\nThis comprehensive approach -- rooted in ecology, technology, and community partnership -- marks a new chapter in Bangladesh's environmental conservation journey.\nThe restoration of the Sal forest carries implications far beyond the boundaries of Modhupur. First and foremost, Sal forests are critical for biodiversity conservation. They are home to many native species of plants, birds, and animals that are now facing the threat of extinction due to habitat loss.\nSecond, these forests provide vital ecosystem services -- they regulate water cycles, sequester carbon, and help conserve the soil. Their disappearance would exacerbate climate vulnerability in the region, increasing risks like flooding, drought, and land degradation.\nThird, Sal forests offer livelihoods to many indigenous and local communities, particularly the Garo people, who have historically relied on forest products, farming, and cultural practices tied to the land.\nLastly, Sal forests play an essential role in maintaining the ecological balance of central Bangladesh. Their continued degradation would have cascading effects on weather patterns, agricultural productivity, and human health in the broader region.\nDespite the promising framework of the restoration initiative, its success will depend on a few critical factors like ensuring clear demarcation and legal protection.\nBoundary demarcation is essential. Without clear physical boundaries -- marked by durable boundary pillars -- the forest will remain vulnerable to encroachment. These legal protections must be upheld without exception, and regular monitoring should be conducted to prevent further illegal activities.\nThe government's decision to plant only native Sal trees and allow a mix of 70 per cent Sal and 30 per cent companion species is ecologically sound. Foreign and invasive species have no place in a restoration effort of this kind, as they can disrupt local ecosystems and outcompete native flora.\nA major concern lies in the use of pesticides and chemical hormones in pineapple and banana cultivation by members of the Garo community and other settlers within the forest. These practices not only degrade the forest soil but also poison water sources and threaten wildlife. Alternatives must be provided -- such as organic farming training, sustainable land use planning, and economic incentives -- to ensure that livelihoods are not sacrificed in the name of conservation.\nNo part of the forest -- regardless of the socio-economic background of the claimant --should be allocated for private use. Forestland is not a political commodity; it is a national ecological asset. Landless and river erosion-affected people must be rehabilitated on khas land, not inside forest areas.\nSteps need to be taken for protecting the rights of indigenous communities.\nWhile illegal encroachment must be addressed firmly, it is equally important that the traditional rights of forest-dwelling communities are recognised and preserved. \"No harassment of local communities\" should be more than a policy slogan -- it must be a guiding principle in all enforcement actions. Forest-friendly livelihoods, participatory forest management, and educational initiatives must be undertaken to bring communities into the fold of forest protection.\nA collective responsibility is also essential. It is naive to expect the Forest Department alone to safeguard Modhupur. Protecting this ancient forest demands collaboration -- from government agencies, NGOs, indigenous leaders, environmental experts, and ordinary citizens. Schools, media, and local governments all have a role to play in raising awareness and fostering a sense of shared responsibility.\nTime is running out for Modhupur. The forest that once defined the landscape of central Bangladesh -- rich with Sal trees, medicinal plants, and elusive wildlife -- is on the verge of extinction. But the story of Modhupur does not have to end in tragedy. With the right vision, political will, and community engagement, we can still reverse the tide of destruction.\nLet this not be another tale of what we lost. Let it be a story of what we saved -- together. The restoration of Modhupur is not just about trees; it is about healing the relationship between people and nature. It is about ensuring that future generations can walk beneath the Sal canopy and hear the forest breathe again.\nIf we fail to act now, we risk losing not just a forest, but a living chapter of our environmental and cultural heritage. The time to save Modhupur is now.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Saving the Modhupur Forest  a race against time",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/saving-the-modhupur-forest-a-race-against-time-1748274585",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       May 27, 2025 00:00:00  \n\nDuring its emergence as an independent nation more than half a century back, agriculture was the mainstay of the economy with 85 per cent of the population dependent on it. And agriculture's share of the GDP was 80 per cent. With increase in productivity through irrigation, introduction of high yielding varieties of crops including intermediate crops, better inputs and mechanisation, employment in the sector has gradually declined and now 45 per cent of the population still depends on agriculture for work. With simultaneous developments in the industrial and the service sectors, agriculture's contribution to GDP has come down to around 11 per cent, according to official statistics. Actually, due to increased productivity, agriculture's share of the GDP should be higher and, unofficially, it is believed that it is around 17-18 per cent.\nFragmentation of land due to inheritance and ever-shrinking area of arable land thanks to urbanisation, now per capita land available is around 0.67 acres. This is too small for commercial agriculture (which requires at least 300 to 500acres) to expand. So, self-sufficiency in food will be confined to mere political slogans, while food security remaining an unresolved issue. So to make the most of whatever we have, optimal use of technology and improved management techniques can still play their roles. Agricultural startups (agri-tech startups) are emerging globally to meet growing demand for food. Bangladesh is no exception. Bangladeshi agri-tech startups are offering financial solutions to farmers, helping with marketing linkages as well as providing information and technology services. However, to enable farmers to utllise the agri-tech services, there should be a government programme to increase digital literacy among farmers. \nAt the same time, cheap credit should be available among small and medium scale farmers, so they might use the services being provided by the startups. Similarly, for the agri-tech startups to be able to expand and widen their services, the government would also be required to play its facilitating role through extending policy and other types of support to them. It is worthwhile to note here that with the advancement of technologies such as AI and IoT (Internet of Things-physical objects embedded with software, sensors and other technologies so they might connect and exchange data with each other over the internet) and big data analytics to influence future agticultural practices everywhere sooner or later, a wave of new opportunities for the startups are being created. The emerging trends and the promises the technologies offer include, for instance, precision agriculture, AI-driven crop management, IoT integration, robotics and automation, blockchain for traceability and transparency, and lastly, sustainability and climate resilience. Together these trends make up what is known as smart farming. \nThe first-noted precision agriculture is about the use of data to leverage farming techniques. This helps the farmer to assess production factors like soil, water and crop health. Making use of satellite imaging, GPS and sensory technology, the farmer can apply water, fertilisers and pesticides correctly enhancing productivity and minimizing wastage. In traditional farming, the same treatment is applied to the entire field. But in precision agriculture, inputs are tailored to real-time data helping farmers to monitor soil health, know about changing weather patterns and decide on when to go for planting or harvesting. As noted in the foregoing, key technologies used in precision farming include GPS (Global Positioning System) and GIS (Geographical Information System). \nThese technologies help farmers to create detailed maps of their fields so they can identify variations in soil fertility, moisture levels and crop growth. IoT sensors collect data on soil moisture, temperature and plant health, while drones take real-time images of pest attack and nutrient deficiencies, etc. Automation driven by AI, on the other hand, helps tractors, seeders and harvesters cut labour costs and ensure precise application of inputs. Variable Rate Technology (VRT) is another aspect of precision agriculture that helps decide the amounts of water, fertilisers and pesticides based on the conditions at different spots of the same field. All the technologies which are part of precision agriculture can help farmers to be economical, precise and less wasteful in applying the inputs. However, agri-tech startups will be there to assist farmers to use the technologies.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Smart farming to  help farmers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/smart-farming-to-help-farmers-1748274661",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 27, 2025 00:00:00  \n\nThe Dhaka Stock Exchange (DSE) and Chittagong Stock Exchange (CSE) are critical pillars of Bangladesh's financial system. Yet, both markets have increasingly become unstable, causing significant financial losses for ordinary investors. This erosion of investor confidence stems from a range of persistent issues, including a lack of transparency, insider trading, weak regulatory enforcement, and poor corporate governance.\nThese markets, ideally meant to facilitate economic and investment opportunities, are now widely viewed as risky and unreliable. Many idealistic and small-scale investors fall prey to market manipulation and misinformation, leaving them financially and emotionally devastated.\nIt is imperative that we implement urgent reforms to restore faith in our capital markets. Regulatory bodies must take proactive steps-ensuring stricter supervision, penalising market manipulators, and enforcing timely and accurate disclosures from listed companies.\nFurthermore, public awareness campaigns should be launched nationwide to educate potential investors. Only through informed participation can people protect themselves from loss and contribute to a more stable investment environment.\nRebuilding integrity and transparency within the DSE and CSE is not just about protecting individual investors-it is about laying the foundation for a robust, sustainable financial system that supports national economic growth.\nMd Maun Khan Ami\nDepartment of Marketing\nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Rebuilding investor confidence",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/rebuilding-investor-confidence-1748274685",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-05-2025"
    }
]