[
    {
        "full_article": "The India-United Kingdom Comprehensive Economic and Trade Agreement (CETA), signed by the two countries on Thursday, is a good example of the give and take between two large economies of comparable size. While the U.K. has agreed to provide India duty-free access to about 99% of its tariff lines, it has been more conservative when it comes to the movement of professionals. It has set an annual quota of just 1,800 visas for niche professional roles such as yoga instructors and classical musicians, and the agreement falls short of making commitments on broader visa categories such as business visitors or IT professionals. This was something India had been keen on. On the other hand, while India has opened about 90% of its tariff lines for duty-free import from the U.K., it has kept key agricultural products such as dairy products, apples, oats, and edible oils out of the deal — key demands of the U.K. Similarly, while India has committed to reducing duties on automobile imports by a substantial 100 percentage points over time, these are subject to a graded quota over the next decade, which gives the domestic industry time to adjust. A sign of a good deal is when both sides walk away happy but not satisfied. In any case, such bilateral deals should not be viewed as a zero-sum game where one side’s loss is another’s gain. Enhancing bilateral trade is in both countries’ interests, especially at a time when the world’s biggest trading powers are raising tariff and non-tariff barriers.The U.K. is a relatively small trading partner for India, but therein lies ample scope for growth. While at a macro scale the gains might initially be limited, the sector-wise increases have the potential to be significant. Sectors such as agriculture, textiles, leather and chemicals are all set to see quick gains. There is potential for longer term benefits too. The U.K. is a major gateway to Europe, which is a much bigger trading partner of India’s. Goods destined for Europe could be routed through the U.K., and the duty-free arrangement will likely enhance this flow. Companies in other countries that already export to the U.K. will also start viewing India more favourably as an investment destination so as to take advantage of the duty-free access. It is now up to the government to help Indian exporters scale up and compete internationally. Another important consideration is that such a deal sets the template for future ones. The general trend is that the bigger the economy being negotiated with, the bigger the concessions given. The United States and the European Union will now want more from India than what it has conceded to the U.K. Published - July 26, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        trade agreements\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        imported cars\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        Europe\n                    \n                            /                      \n                        \n                        investments\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        European Union",
        "headline_1": "​Promising compromise: on the India-United Kingdom Comprehensive Economic and Trade Agreement",
        "headline_2": "India-U.K. trade deal may set the template for the EU and U.S. deals",
        "link": "https://www.thehindu.com/opinion/editorial/promising-compromise-on-the-india-united-kingdom-comprehensive-economic-and-trade-agreement/article69855013.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-07-2025"
    },
    {
        "full_article": "The imposition of President’s Rule, once a frequent and politically motivated tool of the Centre, has declined considerably since the 1990s. This welcome shift is a consequence of S.R. Bommai, the landmark judgment, the rising influence of regional parties in national politics, and public revulsion to its misuse. In recent years, its application has become rare, reserved for genuine constitutional breakdown or severe internal security challenges, such as in Manipur. On Friday, President’s Rule was extended there by another six months, from August 13. But few would contest the extension, as the Centre is struggling to find a durable solution to the ethnic conflict. Following the resignation of N. Biren Singh and the fall of the BJP government, there has been a discernible but fragile calm. A crackdown on militant groups that had operated with impunity has reduced open violence, and some families displaced since May 2023 have begun to return home. However, these positive developments are overshadowed by the unbridged and deep-seated ethnic schism between the Kuki-Zo and Meitei communities. The landscape of Manipur is still carved up by buffer zones, rigidly segregating communities. The political chasm is just as stark: Kuki-Zo groups are resolute in their demand for a separate administration, while hardline Meitei organisations persist with a narrative that brands fellow citizens as “outsiders”.Administrative steps, particularly those that reiterate de-weaponisation and a defanging of militant groups acting for ethnic interests, must continue. They not only break the aura of impunity with which these groups function but will also encourage moderates to raise their voices for reconciliation. During Mr. Singh’s tenure, prominent civil society activists seeking to halt the conflict by critiquing the biased nature of governance were hounded. But the administrative measures to improve the rule of law must be supplemented by political gestures. The BJP enjoyed support in the valley and the hills when it was elected, but has been unable to bridge the ethnic hostility. This is largely because the party’s national leadership has shown little inclination to treat the issue urgently, leaving it to civil servants and security forces to tackle the problem. While the continuation of President’s Rule might seem inevitable in Manipur, its success should not be measured by the absence of violence alone. The Centre’s responsibility is to foster political conditions to bridge the ethnic divide, but that responsibility must be shared. Political parties and civil society groups must defy the hardliners and begin the painstaking work of reconciliation. The future of a peaceful Manipur will be written by the initiative of committed political actors willing to transcend ethnic divisions and work toward the genuine healing of their fractured society.\r Published - July 26, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Manipur\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        national or ethnic minority\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party",
        "headline_1": "Healing Manipur: on Manipur and President’s Rule",
        "headline_2": "Fragile peace demands political actors pursue genuine reconciliation",
        "link": "https://www.thehindu.com/opinion/editorial/healing-manipur-on-manipur-and-presidents-rule/article69855597.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-07-2025"
    },
    {
        "full_article": "The absence of disclosure and restraint policies  in companies is a legal and cultural liability\nA fleeting moment at a Coldplay concert, projected on a stadium screen, has since pulled an entire organisation into public scrutiny. The CEO and Chief People Officer (CPO) of a tech company appeared in an embrace, unexpected and unguarded. The footage circulated widely. The CEO stepped down. The CPO was placed on leave. The institution responded, but the questions that emerged won’t be resolved by formal exits alone.\nIn my work advising organisations on workplace safety and institutional integrity, I’ve seen how culture is shaped less by what leaders say, and more by what they let stand unquestioned. It’s not the bold failures that destabilise trust, it’s the quiet, tolerated ones.\nThe discomfort here isn’t about the existence of a personal relationship. It’s about the roles involved, and the silence that surrounded them. When a CEO and CPO are in an undisclosed association, the impact goes beyond appearances. The CPO is not simply another leader: they sit at the helm of grievance systems, compliance functions, and cultural tone. When that proximity goes unexamined, it undermines the very idea of internal accountability.\n\nOrganisations like to imagine that incidents like this are anomalies. But power rarely moves in isolation. If boundaries at the top are porous, they often reflect what’s been long normalised beneath. If one case surfaces, others likely remain submerged. That’s not cynicism, it’s pattern recognition. And ignoring that pattern is what keeps companies reactive, not prepared.\nI’ve sat across employees who knew something felt off, but could not find language for it. Who adjusted themselves daily, not because they were told to, but because they had learned what it meant to stay on the right side of an unspoken hierarchy. The emotional labour of navigating such proximity, watching it influence access, tone, decisions, rarely finds its way into policy discussions. But it lives in culture, in lowered trust, and in the silent resignation of those who choose not to challenge it.\nIf the other individual involved in this case had been a business head, or someone unrelated to internal oversight, the impact might still have been serious, but not structurally compromising. The fact that this relationship involved the CPO makes the breach systemic. It renders HR’s neutrality open to suspicion, and with it, the legitimacy of every internal resolution taken during that period.\nThis also reflects the unique and often gendered burden placed on HR leaders, particularly women. In many companies, the CPO is expected to carry culture, resolve conflict, manage risk, and remain emotionally available, often while moving in lockstep with executive leadership. When the lines blur, the professional is judged through a personal lens. Yet rarely do we ask: who built the conditions for that erosion?\nCompanies must stop treating these moments as communications challenges and start recognising them as compliance failures. In the absence of formal restraint policies, governing romantic or close associations between individuals in hierarchically linked roles, organisations are leaving themselves exposed to enormous liability. What appears consensual today can, under scrutiny or hindsight, fall squarely within the definition of sexual harassment, especially when a power imbalance is involved. Without policy safeguards, this is not just a cultural oversight, it’s a lawsuit waiting to happen.\nCulture audits alone are insufficient, especially when commissioned by those at the centre of concern. Organisations must decentralise the guardianship of ethics. Oversight cannot be the privilege of a few. Disclosure mechanisms, third party reviews, and independent board-led action must be the norm, not crisis, time improvisations.\nHR, in particular, must be protected as a function, not politically, but structurally. It cannot enforce boundaries if it is not allowed to hold them internally. Organisations must make space for HR to act independently, not just in appearance, but in design.\nAnd while we speak of formal responses, we must also speak of memory. These incidents often leave no trace once they exit the news cycle. But inside the organisation, the memory stays, with those who bore its weight quietly. When we move on without repair, we don’t just abandon them, we teach them that ethics are optional if influence is high enough.\nThis incident, though now fading from headlines, should continue to provoke inquiry. Not because of who was involved, but because of what it revealed about how easily institutional safeguards can be made irrelevant by the people meant to uphold them.\nAnd this must come with a hope. A hope that the lessons drawn from this moment become case studies in transparency, not manuals in discretion. Yes, there were personal failings, and those belong to the individuals and their private lives. But in the workplace, the consequences of concealed influence are never private. They become precedent. They shape how others learn to navigate power. And they leave behind a culture where trust becomes a risk, not a foundation.\nCulture is not what we write. It is what we permit. And what we permit at the top is what we eventually teach everyone else to live with.\n\n",
        "headline_1": "Coldplay controversy: How the behaviour of leaders trickles down",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/coldplay-controversy-how-the-behaviour-of-leaders-trickles-down/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-07-2025"
    },
    {
        "full_article": "What can make up for the 19 years that were taken away from 12 men convicted in the 2006 Mumbai blasts whose acquittal order has now been stayed by the Supreme Court? What can we offer the families of the 187 people killed and the 824 people injured who spent decades waiting for a verdict that has left them with more questions than answers? While acquitting all 12 accused, the Bombay high court dismantled the shocking investigation carried out in the 7/11 bomb blasts case. The manipulation and incompetence that marked the probe and the prosecution demonstrate a complete lack of respect for the suffering of victims and their families. It is unimaginably cruel that no one will ever explain to these people what went wrong. And will anyone even bother with bringing the real perpetrators to justice?\nOn the face of it, the case had everything — eyewitnesses who placed the accused on trains bound for Churchgate; others who testified to them assembling and placing the bombs; they were picked out of police line‑ups; there were recorded confessions and recoveries of RDX, detonators, and circuit boards. All this made for compelling drama that played out in the media, and the accompanying narrative suggested that the guilt of the accused was a done deal. But as the high court has now revealed, the investigation rested on a foundation so brittle — with coerced confessions, fabricated links, unreliable eyewitness testimony, and a lack of forensic proof — that it collapsed under the slightest scrutiny. That the Special MCOCA court deemed such evidence sufficient for convictions and death sentences speaks volumes about the standard of scrutiny in terror trials.\n\nWhich forces us to confront some fundamental questions: Why is such poor-quality evidence so readily accepted in terror trials? And this is not an exception. Systematic assessments of terror investigations have shown that this is a broader pattern. This can’t merely be viewed as ineffective and callous work. The entrenched prejudice, custodial violence, and the expectation of impunity that lie at the heart of such investigations must also be acknowledged. As in the 7/11 investigation, agencies often display exaggerated confidence about having ‘cracked’ the case. Exposing the brittle foundations of these probes, if at all, is a long and difficult process. The routine destruction of lives seems to be an acceptable consequence. NCRB data shows that UAPA cases had a 72% acquittal rate between 2014-22. These numbers don’t reflect the long years of suffering inflicted on the accused and their families as their cases crawled through the justice system. The intentional lethargy of our criminal justice system is not the only concern. It is also the failure of judicial institutions to apply basic scrutiny to foundational procedural protections and questions of evidence. When it comes to terror offences, we seem to be playing by different rules. The ever-growing clamour for ‘exceptions’ in criminal law to deal with terror offences cloaks prejudice and impunity in the language of legality.\nIn cases involving the death sentence, data over a 20-year period shows that for every 100 such sentences handed out by trial courts, nearly 40% result in acquittals by appellate courts. Between 2021-24, the Supreme Court acquitted 40% of all death row prisoners whose criminal appeals it decided. It must shock us that our trial courts are sentencing so many people to death on evidence that is not good enough to sustain even a conviction. The Supreme Court has a very good sense of the extent of the problem but is reluctant to find solutions. In May 2014, while acquitting all six persons sentenced to death in the Akshardham case, it explicitly observed that the accused were framed. However, when the exonerated individuals approached the SC for compensation, their petition was denied with the observation that the Court did not want to open the ‘floodgates’. It’s a remarkable admission of the volume of wrongful conviction cases that deserve compensation. Similarly, while acquitting Kattavellai @ Devakar from death row in July 2025, the SC again highlighted the deeply flawed investigation in the murder and rape case and expressed surprise that two courts had deemed it sufficient for a conviction and a death sentence. Acknowledging Devakar’s suffering for 14 years in prison and the frequency of such cases, the Court asked Parliament to consider legislation for compensation in cases of wrongful prosecution.\nIn a 2017 opinion study with 60 former judges of the Supreme Court, there was widespread acknowledgement of the use of torture, planting of evidence, and routine violation of due process protections. There is no real contestation about this crisis, but we have no qualms in using such a system without any conversation on wrongful convictions. In terror investigations and trials, the fault lines in our system are weaponised to perpetuate violence and prejudice with impunity.\n\n",
        "headline_1": "Beyond lethargy: What the 7/11 case reveals about flawed terror trials",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/beyond-lethargy-what-the-7-11-case-reveals-about-flawed-terror-trials/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-07-2025"
    },
    {
        "full_article": "Vacationers need new places to holiday in \nPushback against ‘over-tourism’ is gathering pace. Maui, Hawaiian archipelago’s second-largest island, is set to can vacation rentals to meet a housing shortage made worse after a wildfire destroyed neighbourhoods. Reportedly, over a fifth of Maui’s housing is built for tourists. Last month, Spaniards turned water guns on unsuspecting vacationers in Barcelona and Mallorca. They were protesting mass tourism that’s ‘fuelling a housing crunch and erasing their hometowns’ character.’ Protests in Italy, Greece, Belgium and Bhutan have forced authorities to tweak policies that promote tourism unchecked at the cost of upending a destination’s living costs, draining its water, altering its character and degrading the environment. World’s most-sought spots are in ecologically fragile areas – or have turned vulnerable after tourism’s push. Think: 75% of solid waste in J&K’s Pahalgam is courtesy visitors.  \nIndia’s groaning with car-choked roads, dry water sources and shaky mountains across Himalaya’s favourite spots. Landour’s population is less than 4,000. Mussoorie’s is 30k-35k. In 2024, the two had about 20L holiday-makers. A growing pain for locals are off-season crowds – post-Covid, tourism’s a year-round affair. Climate change meets OTT-tourist infra to deal a double whammy: a landslide in Sikkim stranded 1,600 tourists this June. Who’s thinking solutions? Limiting numbers was attempted in some hill stations. But little has moved on dispersing the travelling hordes to new cool-climate spots, or building satellite destinations around hotspots. Tourist masses need new destinations.\n\n",
        "headline_1": "Where do you go?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/where-do-you-go/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-07-2025"
    },
    {
        "full_article": "Was US’s serial killer wave a result of industrial pollution?\nIn the age of true crime fandom, books about serial killers have big appeal. Murderland: Crime and Bloodlust in the Time of Serial Killers by Pulitzer-winning Caroline Fraser reminds us how stomach-churning this hobby can be. There are more women being killed on a page, in one terrible way after another, than men in the entire book.\nWhat the book investigates is why so many serial killers were roaming America in the 1970s and 80s. At the time, all this “mindless violence” was blamed on political turmoil, dissolution of the family, on television. On black people, even though the superpredators were mostly white males.\nThe book offers a dramatically different answer. It was toxins that made the men toxic. Sulfur oxides wafted up the furnaces spread across the Pacific Northwest, alongside lead and arsenic. Many neighbourhoods felt like Dante’s inferno. Sometimes when men got into a bathtub after smelting work, the water turned green.\nBut ASARCO, which operated many smelters (plus copper, zinc, asbestos mines) kept fighting off the citizens who wanted pollution controls and the scientists who worried about carcinogens. This was also the business of Rockefellers and Guggenheims. It took two great American family fortunes to build a city of serial killers, Tacoma, the book says.\nIt creates a sinister parallel between how all the anti-pollution objections were swept aside for decades, and how many rape-murders the serial killers were able to get away with.\nFraser completely reframes the time and space otherwise associated with baby boomers, Americana and Archie. She also enmeshes herself into this rebranding. She extends out the map of her childhood neighbourhood, centres it on Tacoma, and finds Ted Bundy and Gary Ridgway also growing up near her, and Charles Manson imprisoned. In addition to the many serial killers she tracks through the book, she muses on her own father’s random cruelties to his wife and children: “I should have killed him while I had the chance.”\nIf the Tacoma of that time is comparable to the wasteland landscape of Dune, it’s because Frank Herbert indeed drew his desert vision from the city and its smelter, which made the air “so thick you can chew it”.\nThe book highlights research connecting the functional derangements caused by lead to men repeatedly beating, raping, strangling, stabbing and smothering women and children, as if compelled by some force as implacable as gravity. This fever only breaks around 1992, after regulators stop dragging their feet, leaded gasoline is phased out, and lead levels in American children and adults start declining rapidly.\nMRI scans measuring adult brain volumes show that lead exposure in childhood causes very notable abnormalities in men, leading to high levels of psychopathy. Greatest volume loss is found in the anterior cingulate cortex, which helps in regulating behaviour. In scans of female subjects, red areas are relatively minor.\nChange happened when everyone breathing a lot of lead shifted towards complaining about it. And when technology stepped up. In 1975, there was a newfangled experiment, instructing a computer to cross-check multiple lists of suspects, such as traffic violations near areas where women disappeared and classmates of victims. To catch Ted, that was the turning point.\nAn X-ray of his skull showed “nonunion of coronal suture”. Something was literally broken in his head.\n\n",
        "headline_1": "Toxins thicken the air, killers walk the streets",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/253596/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-07-2025"
    },
    {
        "full_article": "Lalon, the mystic bard of Bengal, has little prominence in mainstream academic discussions about the body and the ways we experience it (i.e. embodiment theory) despite his profound philosophical contribution to the subject. Lalon provided us with a profound understanding of the body and its central role in shaping our spiritual and political realities centuries before postmodernists and feminists began making the \"body\" a central theme in social studies. Mainstream academic discussions, heavily dominated by Eurocentric philosophies, rarely refer to Lalon's theories on embodiment, despite the poet-mystic leaving a rich body of work on the topic.\nEmbodiment is a theoretical tradition that stresses the importance of the body in making sense of our lived realities. Embodiment theorists, many of whom are renowned philosophers from the West, criticise the preference for disembodied (nonphysical) explanations of our natural and social worlds and instead offer a way of knowing the world through our bodily senses. According to this theory, our bodies provide us with clues about what is happening around us and are integral in conditioning us to exhibit particular social actions. \nModern European theorists like Foucault and Nietzsche brought the body back into social theory by critiquing the mind-body duality (where the mind is thought to be separate and superior to the body). However, our very own Lalon made the body an explicit canvas for social theorisation centuries before these modernists centred the body as the ultimate reality for imagining the world and our place in it. Lalon's dehotattya, literally translated as \"body-theory,\" is a sophisticated collection of dialogues on how the body can be used to make sense of the world and establish empowering political actions. Lalon honoured the body and recognised its significance in shaping our worldview. His songs acknowledged the inherent divinity of the body and its role in helping individuals transcend class and communal divides. Class is enacted and experienced through our bodies. Therefore, it is half-hearted to attempt to understand social injustices without considering how different bodies experience social oppression differently. \nLalon did not express his ideas using the conventional academic style of writing. He communicated his thoughts through songs and poems. In academia, the use of songs is often seen as an inadequate medium for credible theory-building. However, the point of decolonisation in academia (the process of undoing the effects of colonialism in literary theory) is to accept oral traditions (knowledge passed through songs or speeches over generations) as legitimate academic discourses. \nIt is also unfair to dismiss Lalon as a mere musician simply because he heavily engaged with the spiritual and religious realms of thought. Notable academics in the Western tradition also drew their arguments by engaging with Christian theology, yet were not categorised solely as spiritual gurus. Aristotle, Nietzsche, Freud, Jung, and Hobbes all extensively explored the spiritual. Yet, their discourses were accepted as credible theories for formal academic thought. It is rather colonial to discard Lalon, given the spiritual anchoring of his knowledge claims. I argue that Lalon is as important to embodiment theory as Spinoza, Nietzsche, Descartes, Simone de Beauvoir, and Judith Butler. Knowledge claims are nested within power hierarchies where only Euro-American philosophers are considered entirely legitimate. The goal of decolonisation is to smash this hierarchy and bring the margins of knowledge production to the centre. \nLalon's messages on the body could also be a potent source of theorisation for Southern feminism. Feminists have always critiqued the masculinist theory of knowledge, which discards women's bodily experiences as legitimate grounds for knowledge-building. Lalon's song valorises the female body to the point of reverence, inverting traditional gender hierarchy. According to Lalon, spiritual reunification with one's \"moner manush\" is only possible by embodying the feminine essence. In Lalon mysticism, \"shadhona\" (the bodily path towards enlightenment) can only be practised through sacred companionship with the female and the feminine. \nFeminists have often criticised big thinkers like Karl Marx and Aristotle for treating women's bodies as either invisible or all the same. They routinely criticise Marx for his inability to account for the female body's labour. Aristotle was also critiqued for his deep-rooted gender bias. Compared to these Western scholars, Lalon, with no formal education and limited global exposure, broke the gender hierarchy and produced sophisticated knowledge claims centring the body, its gender duality, and its ability to transcend gender. He spoke of the socialised nature of our bodies and the ability of our bodies to transcend complex power structures. Michel Foucault showed us how formal institutions socialise bodies to accept oppressive power structures. Lalon showed us how bodies can also be socially and spiritually reproduced to defy oppressive, dominant social arrangements. Yet his discussions are sparsely included in mainstream feminist and embodiment theories.\nLalon's theories on embodiment could be a potent force in further decolonising social studies from the dominance of European and American philosophers. His theories on the body are as relevant, modern, sophisticated, and prolific as those proposed by prominent Western theorists. Lalon remains integral to understanding the body's role in bringing about desired social change. The time has now come to make Lalon go global!\nAvia Nahreen is a PhD student at Syracuse University, US. Her areas of focus include feminist geography, postcolonial urbanism, and political ecology.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Making Lalon go mainstream",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/making-lalon-go-mainstream-3948106",
        "news_paper_name": "The Daily Star",
        "publish_date": "27-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 27, 2025 00:00:00  \nThe decision to sharply increase tariffs at Chittagong port, Bangladesh's primary gateway for external trade, could hardly have come at a worse time. Amid an economic downturn, falling export demand and the looming threat of a 35 per cent additional duty on Bangladeshi goods entering the United Statesm, this sweeping hike in port charges threatens to push already beleaguered export-oriented businesses to the brink. According to the newly approved tariff structure, charges on more than 50 categories of services including pilotage, berthing, mooring, loading and unloading, crane use, diving, dredging and entry fees are set to rise significantly, some of them by more than tenfold. Port dues, for example, will jump by over 25 per cent, while the cost of fire-fighting tugboat is set to soar to levels many times higher than before. Charges for loading or unloading containers will climb by nearly 60 per cent across all sizes. Even basic gate pass fees for vehicles and individuals will quadruple. \nThis escalation, reportedly based on recommendations from a foreign consultancy firm, is being marketed as a step towards aligning with international standards and improving service efficiency. A tariff structure that was created four decades ago is undoubtedly out of date for a contemporary maritime economy, and while it makes sense to rationalise fees to reflect growing operational costs and modernisation needs, such changes must take into consideration the ground realities. Chittagong port remains far from world-class in terms of turnaround time, automation, digital tracking and labour productivity. Crucially, no tangible improvements in infrastructure, service quality or operational efficiency have preceded this hike. Yet, businesses are being asked to pay more for the same subpar services at a time when their profit margins are already under intense pressure. All things considered, this is perhaps the worst possible time to demand premium prices for substandard services. \nConcern is mounting among exporters that the increased port charges will seriously erode Bangladesh's competitiveness, particularly in the readymade garments sector which brings in over 80 per cent of the country's export earnings. Global buyers are already shifting orders due to rising production costs, intensified competition and labour unrest. In this context, any additional increase in shipment expenses could be the final nail in the coffin for many exporters. Since logistics costs are either passed on to consumers or absorbed by exporters, the new tariffs will likely translate into higher domestic prices for imported goods. On the export side, this may lead to more factory closures, lost jobs and a decline in foreign earnings. There is also growing apprehension that international shipping lines may seize this opportunity to raise freight charges, further driving up the cost of essentials such as food, fuel and industrial inputs, thereby worsening the inflationary burden on ordinary citizens. \nIt's also hard not to question the motive and the timing behind this decision. If successive governments postponed tariff reforms for nearly four decades, why has this interim administration chosen to impose them now, in the midst of a crisis? The government must understand that timing matters and this is certainly not the time to increase trade-related costs. If tariff updates are necessary, they must follow wide-ranging consultation with stakeholders and be tied to measurable improvements in service delivery. Increases in port charges should not come ahead of visible gains in efficiency, digitisation and turnaround time. Until the time when the domestic economy recovers and external conditions stabilise, policies must prioritise resilience over revenue. \nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Poor timing for port fee hike",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/poor-timing-for-port-fee-hike-1753537824",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       July 27, 2025 00:00:00  \nDespite various efforts and initiatives, the quality of the country's national statistics remains a matter of grave concern and controversy. It is disheartening to note that a significant portion of the statistics provided by the national statistical agency, the Bangladesh Bureau of Statistics (BBS), in particular, lacks adequate trustworthiness. Several factors contribute to the disappointing situation regarding national data and statistics. \nOver the decades, successive governments have undertaken several measures to improve the data collection and data processing system to generate a reliable national statistics. Nevertheless, in many cases, such measures were insufficient and inefficient, resulting in a compromise in the quality of data and statistics. A lack of proper budget and trained human resources, coupled with flawed planning and bureaucratic tangles, are the main reasons for such compromises. \nMoreover, there is always an allegation that governments often do not want to provide quality statistics that may expose the gap between real and claimed socio-economic progress of the country. Data manipulation to portray a more favourable picture of development has been common practice among most governments. The situation, however, was aggravated during the now-ousted Hasina regime, when some key features of national statistics were distorted. For instance, the then planning minister, AHM Mustafa Kamal, decided to disclose inflation statistics quarterly in 2017, deviating from the long-standing tradition of monthly data release. The move sparked criticism as economists, experts, and journalists questioned the motive behind such a decision. Although the autocratic regime initially rejected the criticism, it later resumed the practice of releasing monthly inflation statistics. \nIt is worth noting that BBS was established in 1974 by merging four separate statistical offices in the country. Those were the Bureau of Statistics under the Ministry of Planning, the Agricultural Statistics Bureau and the Agricultural Census Commission under the Ministry of Agriculture, and the Population Census Commission under the Ministry of Home Affairs. In 1975, the Statistics Division was established under the Ministry of Planning. However, in 2002, the division was dissolved, and a sub-division was formed. In 2010, the division was re-established, and in 2012, it was renamed as the Statistics and Informatics Division under the planning ministry. Thus, BBS came under the Statistics and Informatics Division. BBS has statistical offices in eight divisional cities, 64 district statistical offices, and 492 upazila statistical offices across the country. \nDuring its journey of five decades, BBS has gone through a series of challenges and has been unable to overcome some of those, compelling the national statistical agency to deliver output that is not optimal in many cases. \nThe Statistical Capacity Index, prepared using World Bank data, showed that Bangladesh scored 70.8 against a global average of 73.5, indicating that the availability of economic resources in the country's national statistics office is good. Nevertheless, the country's data quality is poor due to poor economic governance. In 2014, again, Bangladesh scored 80 out of 100 in the Statistical Capacity Indicator, prepared by the World Bank. The score, however, declined to 62 in 2018 and further to 60 in 2020, reflecting a fall in data quality.\nAgainst the backdrop, in May of this year, the Yunus-led interim government established an eight-member expert Task Force on Strengthening BBS Data Quality, Transparency, and Access. The formation of a task force is a welcome step as it is an initiative responding to the growing national and international demand for credible, accessible, and high-quality statistics to guide policymaking, investment, and development planning. Dr Hossain Zillur Rahman, Executive Chairman of PPRC, is leading the task force. \nThe task force has already held several consultations with BBS staff and various stakeholders to identify the structural weaknesses and obstacles, as well as the expected outputs. A significant problem, already identified, is that the bureau is suffering from a lack of necessary human resources, as around 50 per cent of the posts are still vacant. The national budget for FY26 doesn't provide any special attention in this connection. \nThe budgetary allocation for BBS has declined in FY26 compared to FY25, both in the proposed and revised terms. The allocated budget for the Statistics and Informatics Division was Tk 6.62 billion in FY25, increasing to Tk 7.03 billion in the revised budget for the year. In FY26, the proposed budget for the division came down to Tk 4.67 billion. Almost the entire amount allocated for the division is for BBS. Reasons behind the lower allocation may be a lack of capacity to utilise the allocated resource on time or misappropriation of budget in some cases. \nA lack of proper budgeting leads the BBS to undertake project-based works, deviating it from its core functions. The dependence on donor funding makes many important surveys irregular, and donor agencies have additional access to complete data on the particular areas. Although some projects are government-funded, the project-based approach discourages the long-term sustainability of the work. Those who work on the projects receive additional remuneration in addition to their regular salaries. Therefore, it sometimes creates an unhealthy competition among BBS staffers to be involved in a project. Therefore, what is necessary is to enhance budgetary allocation and gradually reduce project-based work. \nAlthough BBS has a vast amount of data, it is not accessible to all due to data security concerns. Nevertheless, a significant portion is open to the public, although the data sharing mechanism is still not efficient. For researchers, business professionals, journalists, teachers, and students, obtaining the desired data can be challenging. Therefore, it is necessary to enhance the current BBS website using various online tools, such as Datawrapper, to extract data efficiently. Synchronisation of data with other national organisations, like the Bangladesh Bank, is also necessary. \nThe list of tasks to strengthen data quality, transparency, and access is long, and it requires strong and continuous support from the government without any political or bureaucratic intervention. Unfortunately, political governments in the past did not show a strong willingness to enhance the quality of national statistics. They also paid less attention to developing BBS as an effective autonomous body of statisticians and relevant professionals for the greater interests of the country. \nBBS can be a unique organisation for those engaged in data-related professions who want to develop their career paths, as data will become an increasingly critical instrument in the coming days. The nations will engage in a stiff competition to access the data of others, enriching their own data storage and generating a good quality of comprehensive statistics. Bangladesh needs to start work in this direction by reforming the national statistical agency.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "In quest for quality statistics",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/in-quest-for-quality-statistics-1753537956",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       July 27, 2025 00:00:00  \nUrban planners on Friday called for gradual relocation of all the crowd-gathering structures, including the Milestone School campus, from the flying approach zone (FAZ) of the Hazrat Shahjalal International Airport. Otherwise, as they warned, similar mishaps like the Milestone tragedy might occur again.\nAccording to Bangladesh Institute of Planners (BIP), the Milestone School is located within the inner approach zone of Hazrat Shahjalal International Airport, posing risks to public safety and health. Though the CAAB (Civil Aviation Authority of Bangladesh) regulates building height under Obstacle Limitation Surfaces (OLS), there are no clear land use restrictions for sensitive structures within the flying zone. Neither Dhaka Metropolitan Development Plan (DMDP) nor Detailed Area Plan (DAP) provides specific guidelines for the use of lands in these high-risk areas.\nGlobally, facilities with large public gatherings--such as schools and hospitals--are discouraged in such zones while such practices are not followed in Bangladesh, according to BIP. In urban planning, the flight trajectory of any aircraft must always be kept safe, which is folllowed in developed countries, where airports are usually located at a considerable distance from city centers, with buffer zones in between. Although Dhaka Airport was originally built away from the city, rapidly expanding city has grown closer to it over time. It was essential to investigate whether all the buildings of the institution had proper approvals from RAJUK and CAAB.\nThroughout the year, residents of Dhaka face a myriad of civic nuisances. In the sweltering summer months, Dhaka transforms into a heat island, taking a heavy toll on public health, labour productivity and the economy. Monsoon season brings its own set of woes, with waterlogged and pothole-ridden roads bringing the city to a standstill. Furthermore, the onset of winter brings a surge in air pollution, shrouding the city in a thick haze of smog. It is because of the manifestation of one adversity after another in each season, compounded by the perennial issue of traffic congestion, outbreak of mosquito-borne diseases and overburdened utility services, Dhaka is rapidly becoming a mess and increasingly uninhabitable.\nRunaway population growth in the city is putting tremendous pressure on its open spaces and wetlands. Parks, fields, and open spaces have disappeared or are disappearing. We are left with fewer playgrounds. Water bodies disappeared long ago. And now even the rivers are dying due to pollution and encroachment. Apparently, it never dawned on the decision-makers that disappearance of greeneries and wetlands would have a disastrous impact on the environment of the city. Only some experts and environmentalists opposed this suicidal tendency of pursuing 'development' at the cost of environment.\nIdeally, a city should have at least 15 per cent green space and 10-12 per cent wetlands. But a study by BIP found that green space in central Dhaka has shrunk to a mere 7.09 per cent, while wetlands cover a meager 2.9 per cent of the city's area. That being so, effective measures must be taken with urgency to ensure properly planned urbanisation. Strict monitoring and vigilance of RAJUK and city corporations is a must to stop unplanned and haphazard urbanisation. Development without proper planning is counterintuitive. No development project should be implemented that harms the environment unless we want to expose ourselves to environmental degradation. \nThe Milestone incident should serve as a wake-up call. It is time to revisit our development priorities and reframe our policies with a future-oriented vision that puts human safety, environmental integrity, and urban functionality at the core. If lessons are not learned now, the cost of inaction will be far greater.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Unplanned urbanisation: Will lessons be learned?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/unplanned-urbanisation-will-lessons-be-learned-1753538073",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 27, 2025 00:00:00  \n\nDengue has become a recurring terror in Bangladesh, especially during the monsoon season. The year 2025 is no exception, with daily reports of children being hospitalised or even dying from the mosquito-borne disease. This raises an urgent question: how prepared are we to fight dengue, and how proactive are families in protecting their children?\nWhen a child falls ill with dengue, the family is thrown into crisis. Yet, in many cases, preventive measures are not taken beforehand. Homes often lack effective mosquito control; stagnant water is left to collect, creating breeding grounds for Aedes mosquitoes. Children are rarely made to sleep under mosquito nets or use repellents while playing. Studies show that nearly 70 per cent of Aedes breeding occurs within or around the home.\nExperts stress that family awareness is the strongest line of defence against dengue. While local authorities and health departments play a vital role, no initiative can succeed without active family participation. For school-going children, wearing protective clothing, using mosquito repellent, and regularly washing school bags and uniforms are essential. Equally important is maintaining cleanliness at home - covering or emptying water containers and destroying breeding sites.\nAs of 19 July 2025, over 16,700 dengue patients have been hospitalised, and 62 have died. With rising cases in June and July, the situation may worsen without urgent community action.\nSo, the message is clear: the first battle against dengue must be fought at home. Families must take responsibility, raise awareness among children without instilling fear, and commit to daily preventive practices. Protecting children's lives is primarily a family duty - and only through collective efforts can we hope to build a dengue-free society.\nMohammad Shamim Mia\nStudent, Fulchhari Government College\nGaibandha\nshamim.writer2025@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "First line of defence against Dengue",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/first-line-of-defence-against-dengue-1753538163",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-07-2025"
    }
]