[
    {
        "full_article": "India’s decision to exempt import duties on 35 capital goods used in the manufacture of electric vehicle (EV) batteries and 28 items used in the making of mobile phone batteries is a welcome step toward boosting domestic manufacturing and clean technology adoption. Proposed by Finance Minister Nirmala Sitharaman in the Union Budget 2025-26 and formalised through the Finance Bill 2025 passed in Parliament on Tuesday, this signals a strategic policy shift. Earlier in March, Chinese EV giant BYD unveiled its “Super E-platform”, capable of giving a vehicle a 500-kilometre range with just five minutes of charging — a major leap toward alleviating range anxiety, which is a key barrier to EV adoption. This innovation directly challenges the convenience of conventional vehicles and could accelerate the global EV transition if scaled and deployed with the same ubiquity as traditional fuel stations. Batteries remain the most expensive component in an EV, comprising roughly 40% of the vehicle’s cost. This cost burden has slowed EV adoption in lower-income countries, despite the long-term advantage of reducing oil import dependence, which is especially relevant for India. Another critical barrier is the lack of indigenous technological capability in battery manufacturing. China currently dominates this sector, producing over 70% of all EV batteries globally, according to the International Energy Agency. The lithium-iron-phosphate (LFP) battery has emerged as the industry standard over the past five years due to its lower cost, higher energy density, and better thermal management.\rWhile EVs made up 45% of all car registrations in China in 2024, they accounted for just 2% of India’s passenger car market. However, electric two-wheelers (e2w) have seen notable momentum in India, with 1.14 million units sold in 2024, making up about 60% of total EV sales. Though India’s duty exemptions are partially aimed at strengthening bilateral trade ties with the United States and avoiding reciprocal tariffs, the broader strategic objective should be to decarbonise its transport sector. To achieve this, India must integrate into both the upstream (mining and refining) and downstream (manufacturing and assembly) segments of the global EV battery value chain. This would not only help lower battery costs through technology transfer but also position India as a reliable alternative to China in the eyes of developed nations seeking supply chain diversification. India’s long-term success in the EV space will depend on its ability to leverage favourable trade policies, invest in research and development, and secure a strong foothold in the global battery ecosystem.\r Published - March 27, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        Electric vehicles\n                    \n                            /                      \n                        \n                        Union Budget\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        research\n                    \n                            /                      \n                        \n                        emerging technologies",
        "headline_1": "​Going electric: On India and the electric vehicle space",
        "headline_2": "India must be a reliable trade partner to compete in the EV space",
        "link": "https://www.thehindu.com/opinion/editorial/going-electric-on-india-and-the-electric-vehicle-space/article69377547.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-03-2025"
    },
    {
        "full_article": "The “sudden” meeting between All India Anna Dravida Munnetra Kazhagam (AIADMK) General Secretary Edappadi K. Palaniswami and Union Home Minister Amit Shah in New Delhi on March 25 has once again underscored the enduring principle of expediency in Indian electoral politics. While Mr. Palaniswami denied that the meeting had anything to do with a renewed alliance between his party and the Bharatiya Janata Party (BJP) — its former ally — Mr. Shah’s social media post after the meeting hinted otherwise. Mr. Shah expressed hope that the National Democratic Alliance (NDA) would form the government in Tamil Nadu next year, fuelling speculation of a revival of the AIADMK-BJP alliance ahead of the 2026 Assembly elections. The urgency for rapprochement became evident after the 2024 general election results. Having been in an alliance in the 2019 general and 2021 Assembly elections, the AIADMK and the BJP went their separate ways before the 2024 general election. The AIADMK cited repeated provocations by BJP Tamil Nadu President K. Annamalai, who was accused of insulting its party icons. Hoping to regain support among significant sections of Muslim and Christian voters, the AIADMK opted to face the electorate alone. However, the outcome was sobering. The DMK-led alliance swept all 39 seats in Tamil Nadu, while the coalitions led by the AIADMK and BJP, contesting separately, ended up splitting votes in at least 13 constituencies, damaging each other’s prospects. Worse, the AIADMK suffered the ignominy of forfeiting deposits in seven constituencies — a historic low for a party that has governed the State for 30 of the past 47 years. Yet, Mr. Palaniswami continued to assert that his party would not align with the BJP in 2026, a stance he maintained after the formal break in 2023.Beyond electoral arithmetic, political circumstances have gradually nudged both the AIADMK and the BJP toward reconciliation. The DMK-led coalition appears stable, with no visible signs of internal turbulence. Meanwhile, actor Vijay’s newly launched Tamilaga Vettri Kazhagam and Seeman’s Naam Tamilar Katchi have shown no inclination of aligning with the AIADMK, leaving it politically isolated. In this context, both the AIADMK and the BJP see strategic value in rekindling their partnership. For the AIADMK, the immediate objective is to regain power. For the BJP, an alliance with the AIADMK remains the most viable route to expanding its footprint in Tamil Nadu, where its independent presence remains limited. However, alliances forged on expediency rarely result in policies focused on public welfare. Both parties need to do much more to boost public confidence that they would defy this distressing pattern. Published - March 27, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        All India Anna Dravida Munnetra Kazhagam\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        National Democratic Alliance\n                    \n                            /                      \n                        \n                        Assembly Elections\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Dravida Munnetra Kazhagam\n                    \n                            /                      \n                        \n                        Tamilaga Vettri Kazhagam\n                    \n                            /                      \n                        \n                        Naam Tamilar Katchi\n                    \n                            /                      \n                        \n                        welfare\n                    \n                            /                      \n                        \n                        voting",
        "headline_1": "A political gambit: On the AIADMK and the BJP-NDA",
        "headline_2": "AIADMK appears keen to return to the NDA fold",
        "link": "https://www.thehindu.com/opinion/editorial/a-political-gambit-on-the-aiadmk-and-the-bjp-nda/article69377887.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-03-2025"
    },
    {
        "full_article": "State and central Report card\nMaha CM Devendra Fadnavis set an ambitious target for the next 100 days of his govt, with catchy stuff like education minister visiting 100 schools, health mantri 100 hospitals, etc. NCP headmistress Mrs Supriya Sule (nee Pawar) has expectedly failed his govt on its first-100-days performance. On her dissenting ‘Report card’, the only high-scoring subject is Crime. In which case, should police be sent Home?\nWhether Sule Ma’am’s undue harshness was due to her existential problem or a congenital feud with the BJP headmaster is outside this week’s syllabus. Instead, your columnist seeks permission to issue her own Report card. It could apply across the board, and even to the central university.\nGeography: 45%. Some CMs hit bouncers over boundaries, refusing to implement the delimitation course. They fear that it’s merely central board’s tactic to curtail their influence.\nHistory: 35%/95%. An anomaly easily explained. States will score abysmally if tested on the entire gamut of Indian history; they will be toppers if performance is marked only on a slashed, self-serving version. Thanks to our newfound place as ‘world’s fastest growing economy’, derogatory ‘Hindu rate of growth’ is history. Replaced by era-excising ‘Hindutva rate of glory’.\nGeometry: 30%/90%, depending on one’s views on the old geometry box. How much has one community been set-squarely against another? How vital is moral compass? And/or omnipotent ruler?\nArithmetic: Some score 100%; others risk being thrown out of school for failing in three, consecutive grading cycles. Former have mastered electoral math; latter never seem to add up to anything.\nChemistry: 14.2%. This being Muslim share in India’s 1.7bn population. It’s highest outside Muslim-majority countries but our polity has a unique way of levelling the field; actually, ‘razing the stakes’.\nScience: 100%. Every discovery/invention hijacked by West has been correctly restored to its original Vedic age.\nLiterature: 110% since authorised texts are all fiction.\n***\nAlec Smart said: “Netas – rhino hides vis-à-vis serious complaints; paper-thin skin vis-à-vis comedy.”\n\n",
        "headline_1": "100-day sarkar",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/100-day-sarkar/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-03-2025"
    },
    {
        "full_article": "SC, thankfully, paused a disturbing HC order in attempt to rape case. But such orders are distressingly frequent\nIt would have been disturbing enough in a district court, of which there are 688. But that it happened in a high court, of which there are only 25 and which are outranked only by the Supreme Court, almost makes one hopeless about how much the scales of justice continue to tilt against women across our country. Two men giving a ride to a minor to her home stopped their motorcycle, started grabbing her breasts, tried to drag her beneath a “culvert” and broke the string of her “pyjami”. Her cries brought help and the accused fled. Yet, Allahabad HC ruled that this was not an “attempt to rape”.\nIt even penned a disturbing legal fiction that would make it harder to gain rape convictions in the future, declaring that “the difference between preparation and actual attempt to commit an offence consists chiefly in the greater degree of determination.” This byzantine precedent would have been manna for defence lawyers. Thankfully, SC stepped in to stay the HC’s order yesterday, finding some of it “totally unknown to the tenets of law” and depicting “total insensitivity and inhuman approach”. But SC has been here before. In 2021, for example, it had handed out a checklist against the wide canvas of “entrenched paternalistic and misogynistic attitudes” in judicial orders and judgments. And while constitutional courts’ chauvinistic judgments gain the most attention, what’s going on in the lower courts is quantitatively much worse and, reportedly, qualitatively too.\nMarriage continues to be offered as redressal in rape cases. Past sexual history of women continues to make for slanted cross-examinations. Their own testimony continues to be judged by set notions of how rape survivors should process their “shame”. Last year SC had to remind Allahabad HC of something as basic as that no court should be granting bail to persons facing rape charges without hearing the survivor or her parents/guardians. Whatever “gender sensitisation” has been done, has obviously been utterly inadequate. Yes, judges are also products of their society. But that’s no excuse for subjecting women to appalling sexism, and perpetuating injustice.\n\n",
        "headline_1": "Courting sexism",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/courting-sexism/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-03-2025"
    },
    {
        "full_article": "Trump will find out how complex & controversial voter roll changes can be. India can teach him a few things\nTrump’s executive order to ‘protect’ American elections is centred on defining ‘citizenship’. The order requires prospective voters to list documents – a US passport or IDs such as military ID or govt photo ID – as proof of citizenship. The list doesn’t include birth certificates, presumably because Trump cancelled birthright citizenship. This is a double whammy for many US-born migrants. Millions, per US press reports, are set to be disenfranchised if courts don’t intervene.\nAt present, federal forms – it’s unclear if state forms are included – need a driving licence, state ID or social security number and self-attestation. This means those applicants swear they’re eligible to vote. False registration is rare – in the latest instance of high-decibel accusations in Georgia of “voter fraud”, the state’s election official found 20 of 8.2mn voters were not US citizens. Trump’s order also gives access to DOGE, among other central agencies, to voter rolls to check “eligibility”. States can see such federal govt overhang on voter rolls is counter to federalism – lawsuits are expected. Voter rolls are state infra – reforms are carried out via legislation, not presidential fiat.\nTrump mentioned India’s “tying” voter rolls with biometrics. India’s only biometric database is Aadhaar, not considered proof of citizenship. To circle back, the issue isn’t about biometrics really. It is about how Trump’s US would define a citizen – a narrow demographic or wider canvas of peoples. The challenge of “purges” or “sanitising” voter rolls, whether in US or India, carries within it a high risk that ill-maintained databases can disenfranchise legitimate voters. Voters rolls are a complex issue – as Trump will soon find out. India, which manages its elections better, is currently in the middle of a political row over ‘expanded voter rolls’, with opposition arguing EC isn’t giving a satisfying explanation. While we wait for EC to give its side of the argument, let’s note that every stakeholder must be satisfied about every aspect of the electoral process – that’s the bottom line for electoral democracy. It’s also something Trump should keep in mind.\n\n",
        "headline_1": "Who gets to vote?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/who-gets-to-vote/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-03-2025"
    },
    {
        "full_article": "Trump’s policy of reciprocal tariffs kicks in from April 2. The big question for India is how to navigate this tariff turbulence…Can India make a win-win of it? Answer’s yes, if India smartly plays its cards. Agriculture will be slightly difficult to tackle, but even here, India can drive a bargain. How does India do this?\nRead full story on TOI+\n\n",
        "headline_1": "How to bake a pie with Washington Apple",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/voices/how-to-bake-a-pie-with-washington-apple/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-03-2025"
    },
    {
        "full_article": "Chief Adviser Prof Muhammad Yunus's tour to China marks a pivotal moment in Bangladesh-China bilateral relations, coinciding with the 50th anniversary of diplomatic ties between the two countries. China is currently Bangladesh's largest trading and defence partner, reflecting the robust and multifaceted nature of their bilateral ties.\nAccording to Chinese Ambassador to Bangladesh Yao Wen, the chief adviser's visit is expected to be \"successful\" and \"productive,\" with \"some announcements\" anticipated. While the specifics of these announcements remain unclear, Bangladesh Foreign Affairs Adviser M Touhid Hossain has indicated that the visit is unlikely to result in any formal agreements. However, several memoranda of understanding (MoUs)—non-binding but formal agreements—may be signed. This visit is expected to serve as a foundation for the recalibration of Bangladesh-China relations. Therefore, some areas require focused attention and action to yield tangible outcomes.\nAlthough China is Bangladesh's largest trading partner, Bangladeshi exports to China remain low. In the last fiscal year, the trade deficit marginally increased by over one percent, reaching $16.45 billion. While China has granted 100 percent duty-free access for Bangladeshi products, this has not translated into a significant increase in exports due to a limited range of exportable goods, stringent value addition requirements, and a lack of competitiveness in key sectors.\nYunus's visit should prioritise strategies to diversify Bangladesh's exports to China and improve market access for Bangladeshi goods. In this regard, the Bangladesh Embassy to China can play a proactive role by organising exhibitions of Bangladeshi products in major Chinese cities to attract local consumers and businesses.\nRegarding investments, China has made substantial contributions to Bangladesh's infrastructure and energy sectors through the Belt and Road Initiative (BRI). However, there remains potential to attract more investments, particularly in high-end manufacturing industries. The chief adviser's visit could facilitate discussions on encouraging Chinese companies to relocate their factories to Bangladesh—particularly the Chinese sunset industries. As China faces increasing trade barriers on the global stage, the sunset companies can bypass restrictions in Bangladesh while creating jobs and fostering industrial growth here.\nThe interim government of Bangladesh has also been negotiating with China to reduce the interest rates on existing loans from two to three percent to one percent and to extend the repayment period from 20 to 30 years. If successful, these adjustments would provide significant relief to Bangladesh's forex reserves and alleviate pressure on the economy.\nThe chief adviser's visit could also provide an opportunity to strengthen cooperation in the defence sector by exploring possibilities for defence technology transfer and the establishment of joint manufacturing capabilities. This would boost Bangladesh's domestic defence industry and enhance its military capabilities.\nAffordable and high-quality healthcare remains limited in Bangladesh. China can take the opportunity to invest in Bangladesh's healthcare sector by building specialised hospital chains, training medical professionals, and providing advanced medical technologies. It can also position itself as an alternative destination for medical treatment by easing visa policies for Bangladeshi patients and reducing flight costs.\nAnother key area that warrants attention during the visit is the Teesta River Comprehensive Management Project. China remains willing to engage in the project, and this visit provides an opportunity for Bangladesh to further analyse the prospect of China contributing to the management of the river, which may benefit both countries.\nThe Rohingya refugee crisis continues to be one of Bangladesh's most pressing diplomatic challenges, with more than 1.2 million refugees living at the refugee camps in Cox's Bazar. The international community has largely sidelined the crisis, and humanitarian assistance has been reduced.\nGiven China's significant influence over Myanmar, it could play a crucial role in mediating the repatriation process. The ongoing control of the Arakan Army in most of Rakhine state presents an opportunity for China to leverage its influence over the group to help resolve the crisis. The chief adviser's China tour could mark a significant step in facilitating a peaceful solution to the Rohingya issue, further consolidating China's position as a key diplomatic player in the region.\nHowever, this visit also brings challenges, and Bangladesh must navigate a delicate balancing act in its foreign policy decisions. While fostering closer ties with China, Bangladesh must retain its strategic autonomy and avoid becoming a pawn in larger geopolitical games by pursuing policies that align with national interests.\nDr M Jashim Uddin is director of the Center for Peace Studies (CPS) at North South University (NSU).\n\nKazi Fahim Ahmed has a master's in security studies from the Department of International Relations at the University of Dhaka.\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Yunus’s China visit can open many doors",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/yunuss-china-visit-can-open-many-doors-3858161",
        "news_paper_name": "The Daily Star",
        "publish_date": "27-03-2025"
    },
    {
        "full_article": "Recently, I went on a business trip to Cox's Bazar, where I had to attend several meetings virtually. Unfortunately, I could not complete any of those meetings due to weak internet connectivity there. A few months earlier, I was visiting the Sundarbans area where I wanted to connect with friends and family, but there was no connection. In Bangladesh, while urban regions enjoy relatively good internet and mobile network coverage, vast parts of the country, especially in rural, hilly and coastal areas, struggle with limited or no connectivity, with some places still relying on 2G networks only. The prohibitive cost and complexity of building mobile phone towers and other infrastructure in sparsely populated regions make it difficult to improve coverage in these areas. According to the preliminary report of the Population and Housing Census 2022, approximately 6.5 crore people aged 18 and above in Bangladesh do not have internet access. This indicates a significant digital divide in the country.\nTo address the connectivity issue, the efforts to bring Non-Geostationary Satellite Orbit (NGSO) networks, such as Starlink, in Bangladesh is a bold step by the government. Starlink, the satellite internet service developed by SpaceX, is becoming increasingly popular across the globe for providing connectivity, especially in remote or underserved regions where traditional ground-based networks are not available. Starlink, with its constellation of low Earth orbit (LEO) satellites, can provide internet connectivity directly to users in these areas without relying on ground-based infrastructure. It is kind of a plug and play kit that includes a dish (user terminal) and a router. The dish connects to the Starlink satellites while the router connects to the dish and provides wi-fi in a home, community facility or business.\n\nIn regions with hilly or mountainous terrain, laying cables is difficult and expensive, as transporting construction equipment to remote sites can be challenging. Meanwhile, coastal regions and low-lying areas are vulnerable to flooding, and underground cables there need frequent maintenance and repair. In such areas, Starlink can provide a cost-effective satellite backhaul, ensuring that mobile networks stay connected. Through satellite backhaul, mobile operators can expand their network reach and provide better services in remote areas. Starlink can partner with telecom operators in Bangladesh to provide satellite backhaul for mobile towers.\nWe remember what happened when Cyclone Remal struck Bangladesh's southern coastal regions in May 2024. The cyclone's impact was particularly severe on the nation's telecommunications infrastructure. As the storm approached, power outages became widespread, with the Bangladesh Power Development Board (BPDB) reducing electricity generation by more than half to prevent accidents during the cyclone. This led to at least 10,000 mobile towers, or base transceiver stations (BTS), to go out of service. Millions of people were affected by this disruption in mobile and internet services. The widespread loss of connectivity severely hampered communication and coordination efforts during the disaster response. Relief operations faced challenges in reaching the affected communities, and people struggled to contact emergency services or inform relatives of their safety.\nThis situation underscored the vulnerability of essential communication infrastructure to natural disasters and highlighted the need for more resilient systems to ensure continuous connectivity during emergencies. In such circumstances, Starlink could play a critical role in mitigating communication disruptions as it doesn't rely on ground-based infrastructure and could continue to provide internet access even if local mobile towers or fibre connections were down. Starlink terminals can be quickly set up and deployed in emergency response zones as they are portable and can be activated with minimal effort.\n\nThe Internet of Things (IoT) is gradually gaining importance in Bangladesh, with applications in agriculture, healthcare, and smart city development. However, the coverage of IoT networks largely depends on the existing 3G and 4G mobile infrastructure, which remains limited in rural and remote regions. Expanding IoT applications requires better connectivity, especially outside urban areas. Mobile phone networks and NGSOs can work together to offer reliable connectivity for IoT devices in Bangladesh. While mobile networks are ideal for dense, urban environments, Starlink can provide connectivity for IoT devices in remote or rural areas.\nHowever, Starlink networks face several technical challenges that include latency and handover. More importantly, the cost of Starlink service is a significant barrier for widespread adoption in countries like Bangladesh, where economic challenges persist for many people. A Starlink kit costs around $549 to $599. The cost for the monthly internet service varies based on location and specific plan, but generally it ranges between $110 and $120 per month. This is much higher than local data and broadband costs.\nThe government needs to be proactive in eliminating this cost barrier. A business model is required to reduce the cost of initial setup and monthly subscription fee of Starlink services. One possible solution is to offer monthly rental of devices with long-term contracts. The government can also establish community-based models, where people can pool their resources to share a single Starlink connection. In some cases, businesses may subsidise the cost of Starlink internet to provide connectivity in underserved areas. This could enable affordable internet access where other solutions are economically unfeasible.\nDr Sabbir Ahmad is a researcher, mentor, and a leader in project delivery and engineering. He can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Could Starlink solve the connectivity challenges in Bangladesh?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/could-starlink-solve-the-connectivity-challenges-bangladesh-3858006",
        "news_paper_name": "The Daily Star",
        "publish_date": "27-03-2025"
    },
    {
        "full_article": "A recent report by The New Indian Express highlighted that the Indraprastha Institute of Information Technology, Delhi (IIIT-Delhi) has raised its PhD fellowship to 60,000 rupees per month, which amounts to over Tk 83,000, making it the highest PhD fellowship in India. Previously set at 50,000 rupees, this increase is a testament to India's commitment to fostering research and innovation. Additionally, PhD students at IIIT-Delhi also receive a studio apartment as part of their benefits package, further improving their standard of living.\nHowever, the financial support for researchers in India does not stop there. They are also provided 150,000 rupees for international lab visits, enabling researchers to gain global exposure and collaborate with leading experts. Furthermore, a professional development allowance (PDA) of 250,000 rupees is allocated for attending prestigious conferences and workshops, ensuring that scholars can present their work on global platforms. To further enhance research capabilities, a research contingency grant is provided to cover essential research expenses, along with a one-time laptop grant to equip researchers with the necessary tools for advanced study. Additionally, newly recruited faculty members in reputed Indian institutes such as IITs, the Indian Institute of Science (IISc), and the Indian Institute of Education and Research receive a research startup fund ranging from 25 lakh to 30 lakh rupees, equivalent to approximately Tk 35-40 lakh.\nIn stark contrast, how much do PhD students in Bangladesh receive? Most universities and the University Grants Commission (UGC) offer only Tk 15,000-25,000 per month. Even the highest PhD fellowship in the country, offered by the Noakhali Science and Technology University (NSTU) very recently, offers Tk 40,000—only half of what our neighbouring country provides to its PhD students. Meanwhile, a lecturer at a Bangladeshi university earns around Tk 35,000, and an associate professor makes approximately Tk 80,000 per month. This means that a PhD student in India now earns more than an experienced university faculty member in Bangladesh.\nBangladesh offering PhD students a mere Tk 15,000-25,000 per month raises fundamental questions about the broader academic salary structure. The current salary framework fails to recognise the academic qualifications and contributions of university faculty, leading to frustration and dissatisfaction of the community.\nA salary of Tk 20,000-50,000 is insufficient to prevent brain drain or encourage high-quality research. The purchasing power of 60,000 rupees in India is equivalent to over Tk 100,000 in Bangladesh. Meanwhile, a professor in Bangladesh—who holds a PhD, conducts research, and mentors students—earns approximately Tk 100,000 per month. An Indian postdoctoral fellow earns significantly more than a Bangladeshi professor, even before adjusting for purchasing power.\nHow can Bangladesh expect its brightest minds to remain in the country under such conditions? Low salaries may force faculty members to take up multiple part-time jobs, which inevitably affects their ability to focus on research and teaching. Many faculty members from Dhaka University (DU) and other prestigious institutions teach part-time at private universities or engage in consultancy work to supplement their income. No one willingly endures Dhaka's traffic and additional workload unless they have no other choice.\nMoreover, inadequate salaries create an environment where unethical practices can take root. Another alarming issue is the complete absence of postdoctoral research programmes in Bangladeshi universities. No institution, including DU, has a structured system for postdoctoral fellowships. This is unimaginable in today's academic world. Without such opportunities, universities cannot attract high-calibre researchers from abroad, nor can they retain homegrown talent. Competitive fellowships are essential for building a strong research ecosystem, which naturally requires an increase in faculty salaries as well.\nInvesting in higher education is investing in the future, and without competitive salaries, the country's academic institutions will struggle to maintain their relevance on the global stage.\nIf Bangladesh is serious about fostering high-quality research and world-class PhD programmes, it must provide competitive fellowships that attract both local and international scholars. PhD fellowships should be set at a minimum of Tk 70,000-80,000 per month to allow research students to dedicate themselves fully to academic excellence. In line with this, postdoctoral fellows should receive at least Tk 100,000, while an assistant professor with a PhD should earn no less than Tk 120,000. Furthermore, a full professor should not be paid less than Tk 300,000, as many private universities already offer salaries in this range. The disparity between public and private university salaries is unjustified and must be eliminated immediately.\nBangladesh needs a separate, well-structured salary scale for university teachers. Without this, the country will continue to experience brain drain, a decline in research quality, and stagnation in higher education. Recognising and addressing this issue is crucial not just for the future of academia but for the nation's overall progress in an increasingly knowledge-driven world.\nThe case for reverse brain drain is of significance for Bangladesh. Recently, top academics are returning to their countries as part of the global trend of reverse brain drain. Several top Indian scientists have left prestigious positions abroad to join leading Indian institutions. This is a sign that countries are making real progress by offering competitive research environments that attract their own intellectual diaspora.\nNow, imagine if a Bangladeshi scholar from Princeton University decided to return to the country. The likely outcome? His research career would be doomed. He might not even secure a position, and if he did, he would receive minimal research funding, making it impossible to sustain high-level research or mentor PhD and postdoctoral fellows. This tragic reality highlights the urgency of reforming Bangladesh's research ecosystem and salary structures.\nIf Bangladesh is truly committed to progress, it must act now by prioritising higher education, increasing research funding, and ensuring that academia remains a viable career path for its best and brightest minds.\nDr Kamrul Hassan Mamun is professor of physics at Dhaka University. He can be reached at [email protected].\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Why we need competitive salaries in academia",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/why-we-need-competitive-salaries-academia-3857901",
        "news_paper_name": "The Daily Star",
        "publish_date": "27-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Arresting climate-induced poverty",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/arresting-climate-induced-poverty-1743002605",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Parenting in the  digital age",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/parenting-in-the-digital-age-1743002842",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Sreemangal's tranquility is lost",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/sreemangals-tranquility-is-lost-1743002858",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "End delay in public recruitment process",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/end-delay-in-public-recruitment-process-1743002873",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-03-2025"
    }
]