[
    {
        "full_article": "The recently announced package of ₹69,725 crore, to revitalise India’s shipbuilding and maritime ecosystem, is to replace the package of 2015, which is set to expire in March 2026. In the last 10 years, while lucrative defence orders had kept some shipyards busy, only half-a-dozen small merchant ships or so were built in all of India. India’s capacity to build large merchant ships remains minuscule, which the package hopes to expand to 4.5 million gross tonnage. The plan is to upgrade shipyards for cutting-edge technology and management principles, promote new yards in clusters housing factories for shipbuilding ancillaries, and support shipowners for financing newbuilds. But key questions remain over how this package will succeed as the earlier one was largely a failure.Globally, shipbuilding has been honed into a fine art. In Korean, Japanese or even Chinese yards, component blocks of large merchant ships are prefabricated outside the actual dry dock and moved to the dry dock, using cranes of say 1,000 tonnes, where they are welded together. The yards are long enough to be assembly lines. In the past, the metric was keel-laying-to-waterborne. Today that takes just three to four months. It takes just about a year from the process of first steel to sea trials for a large merchant ship. Barring an exception or two, Indian yards are neither long enough nor have the crane capacity and space and capability to do the prefabs. Ancillaries are another bottleneck. A turnaround of about two to three years is the norm in India — or two more years of capital sunk without returns. This is a key reason for Indian shipowners not ordering new shipbuilds even if the subsidies in previous policy addressed the issue of high capex. Shipyard upgrading should address this issue. China, for instance, has thought through shipbuilding in full and set up institutions to train manpower. At this point, India will need to start small, such as ships of 500 gross tonnage and above. The bottleneck is that while terming ship newbuilds as infrastructure has brought down the cost of finance through lower interest rates and extended repayment schedules, this applies only to large vessels. Incentives to promote shipbuilding will need to include long-term offtake possibilities. Indian shipowners do not see long-term demand visibility for them to invest in newbuilds in Indian yards with cost overruns from delays. For instance, India’s green fuel production policy has seen projects to make and export green fuels through Kakinada and Kochi but without leveraging them to build green ships and do the offtake as well. Long-term shipping contracts and time charters, for imported coal from State-owned power utilities and imported crude from oil companies, will spur shipbuilding. Published - September 27, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        shipbuilding\n                    \n                            /                      \n                        \n                        waterway and maritime transport\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        South Korea\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Japan\n                    \n                            /                      \n                        \n                        green technologies\n                    \n                            /                      \n                        \n                        Kochi\n                    \n                            /                      \n                        \n                        coal\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities",
        "headline_1": "Upgrading shipyards: On strengthening India’s shipbuilding infrastructure",
        "headline_2": "Incentives for shipbuilding must include long term offtake possibilities",
        "link": "https://www.thehindu.com/opinion/editorial/upgrading-shipyards-on-strengthening-indias-shipbuilding-infrastructure/article70098292.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-09-2025"
    },
    {
        "full_article": "Three successive Sundays featuring matches involving India and Pakistan are a broadcaster’s windfall dream. This rare cricketing high will be played out when the sub-continental rivals clash in the Asia Cup final at Dubai this Sunday (September 28, 2025). Interestingly, since its inception from 1984, the continental tournament never featured an India-Pakistan summit clash. However, the latest prelude remains dull as the contests over the last two weekends lacked sporting thrills even if the political tension almost bordered on the ‘war minus the shooting’ trope. Suryakumar Yadav’s men overwhelmingly dominated the jousts, yet dimmed their glory as they remained churlish and refused the customary handshake with the opposition, a tradition innate to the willow game and other sports. The Pahalgam terror strike and the resultant Operation Sindoor are part of the backdrop, but if India felt strongly about playing against its western neighbour, then the protest could have been registered by refusing to turn up for these particular games. But walking into the park, playing the match and still refusing to respect the game’s behavioural protocols do not reflect well on the Indian unit. That there is no escaping the nationalism bandwagon and the ensuing domestic pressures was evident in the manner in which some of the Pakistani players gesticulated.Pakistani stars Sahibzada Farhan and Haris Rauf are in the dock with the former using his bat like a gun and the latter hinting at fighter planes being shot down. Meanwhile, Suryakumar’s reference to Pahalgam also came under the scanner. In all this high-strung theatre of anger, India still proved its superior mettle against all rivals, a skill-advantage that was reiterated twice against Pakistan. Opener Abhishek Sharma has been at his riveting best, and his scalding form has forced the opposition bowlers to constantly alter their tactics. His Punjab mate Shubman Gill has also flourished against the men from across the Wagah border. Among the bowlers, even if spearhead Jasprit Bumrah draws attention, spinner Kuldeep Yadav has been in his elements on the dry, abrasive surfaces under West Asian skies. The dip in quality of Indo-Pak tussles is a contrast to the 1980s and 1990s when the games were contested on an even keel. For Indian fans of a certain vintage, Javed Miandad’s last-ball six off Chetan Sharma remains a bruise that never heals. The current Asia Cup has revealed how far India has progressed while Pakistan, Bangladesh and Sri Lanka have stagnated. This Sunday, defending champion India will step in as the favourite unless Shaheen Afridi and his fellow pacers spring an ambush.\r Published - September 27, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        cricket\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Asia Cup Cricket\n                    \n                            /                      \n                        \n                        United Arab Emirates\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025",
        "headline_1": "Bloody Sundays: On cricket, the Asia Cup, India-Pakistan rivalry",
        "headline_2": "Cricket is getting overshadowed by India-Pakistan political rivalry",
        "link": "https://www.thehindu.com/opinion/editorial/bloody-sundays-on-cricket-the-asia-cup-india-pakistan-rivalry/article70098456.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-09-2025"
    },
    {
        "full_article": "GOI must engage protesters, even if they demand a lot\nExplanations for “the bloodiest day” in Ladakh remain sharply divided between govt and protesters. But one thing on which there should be consensus is what BJP leader and former Ladakh MP Jamyang Tsering Namgyal has written in his letter to the Lt Governor, “Ladakh stands at a fragile juncture.” The mood in the Himalayan desert region has darkened a lot since it became a separate Union Territory after the abrogation of Article 370. At the time, Namgyal himself gave such a passionate parliamentary speech welcoming these developments that it went viral. Engineer-innovator Sonam Wangchuk, who inspired 3 Idiots, also welcomed them heartily. Wangchuk has now been arrested, with govt linking Wednesday’s mob violence and arson to his “provocative” speeches.27\nNone of this, of course, explains why four unarmed protesters died with multiple bullet wounds that day. Even those who don’t appreciate how Wangchuk’s been talking up a Gen-Z revolution of the Nepal type in Ladakh, should recognise that over-strong police action is the opposite of a solution in this case. Yes, the big local asks of both statehood and inclusion in the Sixth Schedule are difficult to meet. With its 3L population Ladakh has zero chance of getting statehood when it’s still denied to J&K. As for the Sixth Schedule, no govt, whatever its political stripe, is likely to open this Pandora’s box. If it did, Manipur would be ahead of Ladakh in the line. But GOI has a time and tested way of walking situations back from crisis, which is to really get into engage mode.\nGovt told a parliamentary committee this year that none of the 1,275 gazetted posts in Ladakh have been filled since 2019. Wangchuk and others’ talk of Ladakh becoming another Tibet is of course utter nonsense – one is without even a fraction of persecution of the other. But Ladhakis’ fears of becoming climate refugees are connected to real environmental vulnerabilities that need to be taken very seriously. Hearing and calming by the Centre is the need of the hour.\n\n",
        "headline_1": "Listen To Ladakh",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/listen-to-ladakh-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-09-2025"
    },
    {
        "full_article": "Trump tariff on pharma is a nudge to diversify markets\nIt isn’t clear whether Trump’s 100% tariff on imported “branded or patented” drugs will affect India, but markets turned cautious on Friday. Pharma stocks fell between 1% and 5%. The tariff isn’t entirely unexpected – Trump has been talking about imposing it since April. In July, he threatened to tax imported pharmaceuticals at 200%. In Aug, he said the tariff could go up to 250%. What stumped the market was the timing, as he had earlier hinted at starting with a “small tariff” and peaking in 12 to 18 months.\nThe impact on India will depend on how “branded” is interpreted. US is India’s biggest pharma market, buying roughly $10bn worth of drugs last year. But these are largely low-cost generics, including drugs for cardiovascular and neurological disorders. Experts believe these off-patent formulations – even if shipped under a brand name – may be exempt from the new tariff. However, clarity on this point will emerge only after US issues enforcement rules.\nFor Trump, making US aatmanirbhar in medicines has been a priority since his first term. According to a White House release, US makes 40% of its finished drugs, but the share of locally made APIs is just 10%. This explains the exemption offered to pharma firms setting up plants in US. But the abruptness of Trump’s decisions – like with H-1B visas last week, and the penal tariff on India in July – is unsettling. Countries like Ireland, Switzerland, and Germany, which supply high-value branded and patented drugs, will clearly bear the brunt of his latest tariff. But if branded generics are also taxed, 40% of India’s pharma exports will be at risk. Even if Indian generics are spared for now, Trump’s sword will hang over them. So, the search for new markets should begin immediately.\n\n",
        "headline_1": "Vitamin T",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/vitamin-t/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-09-2025"
    },
    {
        "full_article": "What the life of tree teaches us on survival strategies\nHumans can brag about their ability to control nature, but the reality is we’re powerless in the face of heatwaves, floods, wildfires and natural phenomena. Survival needs collective strategies against threats – and mutual aid goes beyond the species barrier. \nThat’s what forests show us. Collaborate amid competition. Collaborate across species. But humankind, writes Laurent Tillon in Being An Oak: Life as a Tree, “resists co-evolution with the microbes that have shaped us into our species, consciously risking gradual decline in collective immunity through isolation and excessive sterilisation.”\nBut we get ahead of the story – the story of Tillon’s oak, his friend and confidant. Of discovering who the tree – at least 240 years old – is, in forest Silva, near Paris. The tree that showed Tillon the nature of nature – challenges in sourcing nutrients, the fight to grow tall, keeping the canopy safe, and competing and coexisting with a million creatures – plant, animal and microbe. It’s never easy. It’s never hopeless either. \nAn intricate lattice of stories with incredible detail shows the oak’s relationships with other trees, beetles, woodpeckers, salamanders, foragers, lizards, wolves, and humans. “Trees that live in a community make up a super organism whose powers are immeasurable”, Tillon writes.\nBy the 17th century, oaks provided wood for building boats, to meet maritime ambitions of King Louis XVI, also the first to engage in ‘forest management’. Over centuries, railways, cities, industry – all needed wood from the forest. This oak’s life was at risk from the minute it was born, around 1780, an acorn, with a plantlet and a radicle inside, organs provided by the parent oak. \nA fieldmouse grabs and runs with the acorn as it falls to the ground as winter loot – only to forget about it. A good crop of acorns means field mice eat up all the acorns, damaging them, the abundance driving them nuts. So the oaks pull back on producing acorns the next season. Rodents’ population plunges – the plant world, says the book, outwits/ fools the animal – a phenomenon called ‘masting’. That’s just one strategy. \nOnce the acorn strikes root, it is rooted for the rest of its life. Tillon’s oak can’t move at all. “This will be his calling for the rest of his life”. Roots don’t grow randomly – “the tip of each is a veritable homing device. Nothing happens by chance.” It’s not that the oak gives an order, but in chemical and electrical messages still a secret to scientists, stimuli are received for roots to head downwards and a plantlet to vie towards light. Caterpillars time their emergence from eggs when the oak is about to bud. Yet the oak’s branches too appear to hold off on budding – to make it harder for caterpillars to attack.\nThe young oak knows the approach of fungi is an act of aggression, but local “bacterial diplomacy” ensures all three strike up a relationship of nutrient and information exchange, to signal deficiency and danger, for all time to come. These early “breach in defences” only help the oak mount an efficient immune response against attacks through its life. Collaboration and a perpetual learning of strategies – relationships within competition.\nThat’s the lesson for humans.\n\n",
        "headline_1": "Oak Culture & Humans",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/oak-culture-humans/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-09-2025"
    },
    {
        "full_article": "By- Aditya Mukherjee\nLeo Tolstoy’s short story God Sees the Truth but Waits is a timeless reflection on the moral presence of God in human life. Through the tragic life of Aksionov, a man wrongfully imprisoned, Tolstoy portrays God not as an immediate deliverer from suffering but as a constant moral force, watching, guiding, and ultimately redeeming. The story suggests that divine justice operates on a scale beyond human impatience, and that faith in the Supreme’s presence gives meaning even to suffering. In this way, Tolstoy captures the paradox of divine nearness and silence, reminding readers that while human beings may despair, God remains an integral part of life’s unfolding truth.\nThis belief in the Divine’s integral presence is not unique to Tolstoy. Many writers, both Indian and Western, have echoed this conviction in their own ways. Rabindranath Tagore consistently emphasised the immanence of the Omnipotent in human existence. In Gitanjali ,Tagore writes not of a distant deity but of a God who dwells within the heart and breathes through rhythm of daily life. For the poet finds Him in human love, nature, and the silent strength that sustains a weary soul. Much like Tolstoy, Tagore portrays God as a force whose presence gives meaning even to sorrow.\n\nIn the Western tradition, William Blake’s poetry reflects this sense of God’s closeness. In Songs of Innocence and Experience , Blake explores how divine presence permeates human life, even amid oppression and pain. In ‘The Lamb’, Blake affirms God’s gentle care, while in ‘The Tyger’, he wrestles with the mystery of a creation that holds both beauty and terror.\nCloser to Tolstoy’s moral concerns is the American writer Nathaniel Hawthorne, particularly in The Scarlet Letter . Hawthorne often depicted God as the ultimate moral witness whose presence exposes hypocrisy and validates genuine repentance. While human societies may err in judgement, divine truth persists and eventually triumphs. This echoes Tolstoy’s idea that while injustice may prevail in the short term, God’s vision extends beyond the horizon of human limitations.\nIn modern Indian literature, MK Gandhi’s writings, though not fictional in nature, also highlight the centrality of Divine. For Gandhi, the Supreme was synonymous with Truth, an eternal principle guiding human action. Like Tolstoy, whom Gandhi deeply admired, he believed that holding onto faith in God sustains moral courage even when worldly justice falters.\nTaken together, these voices – Tolstoy, Tagore, Blake, Hawthorne, and Gandhi – affirm that God is not an abstract figure removed from the human condition, but a sustaining presence embedded within it. Whether as moral witness, intimate companion, creative force, or eternal truth, the Divine remains central to how humanity endures suffering, seeks justice, and finds meaning. Their writings suggest that while the Almighty may appear silent at times, He is never absent. It is in this paradox – Omnipresent both waits and watches – that literature across cultures finds a shared truth: the Divine continues to remain an integral part of human life, shaping moral and spiritual journey of humanity. As William Blake urged, we are invited to glimpse the Divine even in the smallest details of existence: To see a World in a Grain of Sand/And a Heaven in a Wildflower/Hold Infinity in the palm of your hand/And Eternity in an hour.\n\n",
        "headline_1": "God sees the truth but waits",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/god-sees-the-truth-but-waits/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 27, 2025 00:00:00  \nThe common people's expectations from the July 2024 uprising and the political change that followed were naturally high. As such, they would like to believe that with the end of autocracy, there would be meaningful changes in their lives. When the past autocratic regime's hallmarks were the absence of the rule of law, the abuse of power by those in authority, looting of state resources by the people close to power with impunity, pervasive corruption, a total lack of justice etc., the common people were reasonably hoping that finally those oppressive days would be over.\nBut if everyday experience of the public since the political changeover is any guide, then the facts on the ground tell quite a different story. In this connection, if the recent study findings of a non-government body, the 'Power and Participation Research Centre (PPRC), are to go by, then there are reasons for disillusionment. For, corruption is still pervasive, since majority of the respondents of the study reportedly said, 'nothing works without money'. In fact, 52 per cent of the households surveyed reported to have paid bribe or extortion money before August 2024. However, the good news is that during the months following July 2024, some improvements were visible. By April 2025, some 47 per cent households said they paid bribe or extortion money. Clearly, corruption was still there, though with some restraint. But with the passing of days that temporary restraint has been over as is evident from the recent reports of alarming rise in toll collection, mob justice and other forms of violence across the country. On the economic front, on the other hand, one in five households has been found to be hit by severe economic crisis. The challenges for the victim households stemmed from excessive medical expenses (some two-thirds of the families), while more than a quarter (27 per cent) of the families were in debt burden. Some eight per cent of the families reported educational costs for their children were another significant financial burden facing them. \nTo be frank, the July upsurge, which had no clear-cut political agenda nor a well-defined leadership, was not expected to effect any lasting change in society. Small wonder that lacking the required political mandate, the reform programmes undertaken by the interim government are still on paper. As expected, those have no reflection in public life. But what the previously noted household-level survey as carried out by the PPRC could find out was an attempt to just scratch the surface of the more general and a deeper malaise in society. It calls for effecting a radical change. But to that end, the country needs to have an elected democratic government with a long-term popular mandate to effect the necessary changes. Admittedly, society cannot get rid of the rampant corruption overnight that majority of the respondents of the study in question had reported. Even so, since corruption is the root cause of all ills of society including bad governance and the absence of rule of law and justice, any well-meaning government that wants start from scratch should first target corruption. As the rot sets in from the top, any government of change must start the cleaning operation from the top. \nBut sufferings of the families, especially those in the middle and low income bracket under the prevailing socio-economic conditions are beyond description. A recent World Bank report that said extreme poverty has risen by 9.3 per cent, which is equivalent to saying that an additional 3.0 million people have joined the ranks of poverty, only corroborates this view. That means these new victims of poverty cannot simply wait for better days to come in the future. They need immediate support from the government in office.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "People's expectations belied",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/peoples-expectations-belied-1758900064",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       September 27, 2025 00:00:00  \nFor many years now, remittances sent by Bangladeshis working abroad have been the single strongest pillar holding up the economy. Just as families wait for these earnings with hope, the nation relies on them with the same need. Crucially, these funds serve as an anchor of stability for the banking sector which would otherwise struggle under the weight of massive non-performing loans. By bringing in deposits, remittances help give banks the liquidity they need and keep the system stable. In a broader sense, this steady stream of money has played for Bangladesh a role not unlike what foreign direct investment once did for China and Vietnam. It fuels GDP growth, but more importantly, it breathes life into both villages and cities, connecting the fate of the individual household with the progress of the entire economy. \nBetween July and September 17 of this financial year alone, Bangladesh received US$6.66 billion in remittances, nearly 20 per cent higher than the same period last year. The month of August brought in $2.42 billion while July saw $2.47 billion. Last year was even more remarkable, setting a historic record of $30.32 billion which is the highest inflow ever in a single financial year.\nRemittances are often placed side by side with garment exports since both bring in much-needed forex. Garments do generate impressive sums, but a large share of that money is spent again on importing raw materials, machinery, chemicals and logistics. What remains as a net benefit is far less. Remittances by contrast arrive as clean money, flowing straight into households with almost no deductions. For this reason, they often stand in a better stead than exports in terms of net foreign currency even if they do not always receive equal recognition. \nThe transformative power of remittances is most vividly felt at the grassroots. To the extent that local communities have lifted themselves out of poverty, remittances have played a huge role. With the financial strength of local expatriates behind them, many families now live in houses with brick walls and concrete roofs. Their children attend better schools, healthcare has become more accessible and agriculture is steadily moving towards mechanisation. In numerical terms, this influx of capital has been responsible for elevating roughly 8.0 million families out of extreme poverty and into the lower-middle and middle classes. \nNone of this would have been possible without the vast Bangladeshi diaspora spreading across the world, which, according to the Bureau of Manpower, Employment and Training (BMET), numbers about 15.5 million. The critical importance of overseas employment becomes apparent when considering the domestic job market's limitations. Each year, 1.8 to 2.0 million new entrants join the labour force, yet the domestic economy can absorb only 0.7 to 0.8 million of them. The rest must rely on opportunities abroad. Imagining the strain on the economy if all of them had to find jobs at home is enough to reveal how frightening the situation would be. Overseas employment therefore provides not just economic relief, but protects both the economy and society from overwhelming pressure.\nYet this national comfort is built upon a foundation of individual struggle and profound sacrifice. The aggregate national benefit, however, conceals the high-risk, high-cost reality faced by many migrant workers. The migration process itself is riddled with exploitation. Many workers pay exorbitant fees only to never reach their promised destination. Those who succeed in leaving often confront wage theft, exploitative contracts and both physical and psychological abuse. Female workers face even greater risks, with cases of sexual harassment and deception tragically ending in some returning not with savings, but as corpses. \nThe reality of migrant life is far removed from the imagined mountains of gold. Many risk their lives on dangerous routes including the perilous boat journeys known as 'the game,' which is a conduit for illegal migration. Even in the glittering cities of Europe, countless Bangladeshis endure gruelling hardship to provide comfort for their families back home. They work in hotels and restaurants even on holidays and Eid, missing the joy of celebration. Theirs is a life of isolation, spent struggling with unfamiliar languages, cultures and ways of living.\nParadoxically, distance has not weakened but deepened the migrants' attachment to Bangladesh. Precisely because they live so far from home, expatriates remain closely engaged in national affairs. During times of political upheavals such as the July uprising, they strategically withheld their remittances and turned financial contributions into instruments of protest. Such gestures reveal that their role is not confined to economics alone but extends to moral and social engagement. Their persistent demand for voting rights stems from this connection, and the Election Commission's recent pledge to allow them to participate in the upcoming national elections must now be translated into reality. \nMaslow's hierarchy of needs reminds us that once basic survival is secured, people seek belonging, dignity and a sense of fulfilment. While remittances secure the former for their families, the state itself often fails to facilitate the latter for the migrants. Many of them face humiliation at airports, neglect at embassies and indifference at home even though they are the backbone of the national economy. These remittance warriors deserve better. They should be honoured as key stakeholders, not made to feel abandoned by the very state their sacrifices sustain. \nDomestically, Bangladesh faces its own challenges in managing migration and remittances. The most urgent issue demanding attention is the migration process. Safe migration is not a privilege but a responsibility the state owes to its citizens. Fulfilling this obligation requires dismantling syndicates that exploit hopeful workers, holding dishonest agents accountable and bringing the vast network of informal sub-agents under strict regulatory oversight.\nIn the end, the story of remittances is a story of people. It is a story of courage, sacrifice and quiet perseverance. If Bangladesh treats the remittance warriors with the fairness they deserve, provides meaningful opportunities for their contributions to make a real impact and recognises them as true partners in progress, the flow of remittances will not only endure but become even stronger. \nshowaib434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Recognising the value of migrant money",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/recognising-the-value-of-migrant-money-1758900167",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       September 27, 2025 00:00:00  \nAround five years ago, a study conducted by the esteemed chemistry department of the University of Dhaka found that motor vehicles powered by fossil fuels make up 50 per cent of all the contributors to air pollution in the capital city. The study also revealed that burning of straws, firewood, husks and small particles is responsible for 40 per cent of the air pollution. The use of coal in the brick kilns contributes the rest 10 per cent. \nThe situation, instead of improving during the last five years, has worsened, with motor vehicles being the major contributors. That's why it has become almost impossible to be on the roads of Dhaka for sometime without being engulfed by thick black smoke emitted by unfit buses. From dawn to dusk, thousands of these buses continue to emit black smoke, polluting the environment and causing harm to human health. On the roads and streets, buses are doing this mischief constantly with total impunity. \nGenerally, black smoke coming from motor vehicles is the outcome of incomplete combustion, often caused by faulty engine, poor fuel quality, or a malfunctioning fuel system. The emitted smoke consists of carbon particles (soot), which are harmful to both the environment and human health. The emissions contribute significantly to public health problems, including respiratory and cardiovascular diseases, while imposing substantial economic burdens on affected populations. Children and elderly people are the most vulnerable to the emissions.\nThe unfit buses are the major emitters of the thick black smoke. Nevertheless, it becomes a matter of disappointment that the emission of black smoke from the buses is growing day by day, and the authorities seem helpless to curb the pollution. Except for some occasional drives launched against the unfit vehicles, there are no effective measures to curb pollution. The influential organisations of the transport owners and workers block any strong move to address the problem. These organisations use the nationwide strike as a tool to compel the authorities to compromise and withdraw any strict steps to restrict the movement of unfit vehicles.\nThe emission of black smoke from the buses is largely linked to unfit and older vehicles. Most public buses are not well-maintained due to the owners' unwillingness to spend, coupled with a lack of enforcement of laws. Therefore, the number of unfit buses on the roads has been increasing over the years, thereby exacerbating the rampant emission of black smoke. The government has repeatedly warned that those buses that have crossed a 20-year lifespan should be removed. However, the transport owners do not pay heed to the warning. Instead, the transport associations are now demanding that the lifespan of buses be raised to 30 years. \nDuring the autocratic regime of Hasina, the transport sector became heavily criminalised with political backing and extensive extortion became a major source of income for several Awami League leaders and activists. The 'rent seekers', individuals who profit from illegal activities such as extortion, also became significant obstacles to disciplining the public transport sector and forced the authorities to allow unfit buses on the roads. After the fall of Hasina on August 5, a new group of miscreants and extortionists gradually replaced the previous ones. The chaos on public transport continues and the interim government's weak intervention has made the situation worse. \nThough there is a move to introduce electric bus service in Dhaka gradually replacing the dilapidated public buses, there is no visible progress in this regard. There was an announcement by an adviser of the interim government that e-buses would start plying the roads of Dhaka from July 1 this year. Almost three months have passed and the e-bus is still not there. The dream of clean green public transport in Dhaka city appears to be elusive. People will have to live with black smokes emitted by the ramshackle buses for many more years, it seems. \nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Rising emission of black smoke from buses",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/rising-emission-of-black-smoke-from-buses-1758900198",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 27, 2025 00:00:00  \n\nIn Bangladeshi politics, the transfer of power often feels like an endless drama. With election festivals, slogans and dazzling promises, a wave of excitement spreads across the country. People hope that their fate will truly change, that transparency and justice will prevail. Yet the reality often tells a different story. Only the names of leaders change, while long-standing problems - soaring prices, unemployment, and crises in health and education - remain unresolved. The public continue to ask - will these shifts in power open a new chapter of development, or are they simply new masks in an old game?\nThe reasons for unmet expectations are clear. Democracy in our politics has yet to take an institutional form. Once in power, parties often prioritise strengthening their own position over solving citizens' problems. Corruption and nepotism are deeply rooted, preventing the benefits of development from reaching ordinary people. A culture of vengeance has replaced principles and ideals, while ineffective policies in education, employment and public services create widespread frustration. Consequently, every power shift appears to the people as little more than a \"game of power,\" where their hopes remain confined to slogans.\nTo meet public expectations, political parties must offer not only a change of power but also a change in policy and responsibility. Fighting corruption, creating jobs and undertaking meaningful reforms in education and healthcare are essential to regain public trust. Transparent elections and accountable governance will further restore citizens' confidence.\nA transfer of power is only meaningful when it reflects the dreams and needs of the people. Leadership that brings real transformation, not just a change of parties, can be the true guiding force for national development.\nSania Tasnim Lamia\nStudent, Department of Mass Communication and Journalism\nJagannath University\ntasnimlamia539@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Power changes, expectation remains unmet",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/power-changes-expectation-remains-unmet-1758900224",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-09-2025"
    }
]