[
    {
        "full_article": "The Qingdao meeting of Defence Ministers of the Shanghai Cooperation Organisation (SCO), that ended without a joint communiqué, indicates trouble within the 10-nation grouping. Defence Minister Rajnath Singh was forced to withdraw from the joint declaration as it contained no reference to terrorism at the behest of “one nation” — a reference to Pakistan. This is understandable, given that the meeting comes just weeks after the Pahalgam attack, and Operation Sindoor, after which India’s resolve to fight terrorism has redoubled. What sounds more surprising is that not only did the draft resolution fail to mention terrorism but member-states including host China and Russia had even reportedly considered referring to “disturbances in Balochistan”, at the instance of Pakistan, while leaving out mentions of the Pahalgam attack and cross-border terrorism, that India asked for. This is stark given that the SCO’s founding Charter in 2002 focused on the need to build “mutual intraregional efforts to curb terrorism, separatism and extremism”, and the Director of SCO’s signature Regional Anti-Terrorist Structure was present. Statements by the SCO Secretariat and the Chinese Foreign Ministry stuck to anodyne statements such as “...cooperation ...on modern security challenges and threats”. All eyes will now be on the SCO Foreign Ministers’ July meet and the SCO Summit in August-September to see if India’s concerns are more appropriately addressed.New Delhi must study whether there are shortcomings in delivering its message on the three-pronged “new normal” Prime Minister Narendra Modi announced after Operation Sindoor. In particular, China’s unhelpful role as Chair on the issue is disquieting, given its recent thaw with India. Unlike the SAARC grouping, where India held sway, the SCO is more focused on the original founders China, Russia and Central Asian States. Mr. Singh’s participation followed closely on the heels of India disassociating itself from a statement on Israel’s June 13 attack on SCO member Iran as it was critical of Israel. Post-Operation Sindoor, the government sent parliamentary delegations to 32 countries, but not to any SCO member-country. It is possible that the government lost a chance to give the grouping any prominence by doing so, although External Affairs Minister S. Jaishankar chaired a meeting of the India-Central Asia forum in June. India’s decision to skip hosting an in-person Summit of the SCO during its turn in 2023 could also still rankle. Breaking with the grouping, which is an important regional forum, will simply leave an open platform for Pakistan. Instead of crying foul, the government must convince members that their interests lie in strengthening cross-regional support against terrorism. Published - June 28, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        Iran\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Afghanistan\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Israel",
        "headline_1": "​Missed opportunity: On India, the terror fight and the SCO",
        "headline_2": "India should convince Shanghai Cooperation Organisation to take a strong stance against terrorism",
        "link": "https://www.thehindu.com/opinion/editorial/missed-opportunity-on-india-the-terror-fight-and-the-sco/article69745301.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-06-2025"
    },
    {
        "full_article": "India has been ranked among the top 100 countries in the Sustainable Development Report for the first time since this data began to be published by the Sustainable Development Solutions Network (SDSN) since 2016. The SDSN is an independent body under the aegis of the UN, whose publications are tracked by policymakers and governments. In 2016, India was ranked 110th out of 157 countries, making steady progress to reach 99 this year out of an expanded basket of 167 nations with better metrics and more granular comparisons. But it is no time to rest on this laurel. India must look at why this incline, by 11 points, was not achieved any sooner and the gaps to focus on. From a developmental perspective, the SDSN ranks India as having fared better in poverty reduction (SDG 1) even as India’s poverty estimation continues to be mired in controversy due to a lack of publicly available consumption expenditure data since 2018 and the poverty line (Rangarajan line ~₹33/day rural, ₹47/day urban) not having been updated. Proxy data suggest a considerable poverty reduction, almost halving between 2012 (22% based on NSSO data) and 2023 (World Bank – 12%).But SDG 2 (zero hunger) has remained a cause for concern. It also reveals the wide disparity between income groups and rural and urban areas on access to a nutritious diet. The National Family Health Survey (NFHS) estimates that over a third of Indians (35.5%) were stunted (NFHS-5, 2019-21), only marginally better than 38.4% (NFHS-4, 2015-16). Similarly, wasting, which is low weight for height, reduced from 21.0% to 19.3%. Obesity in the working age population (15-49 years) has almost doubled between 2006 and 2021, and concentrated in wealthier urban areas. Electricity access (SDG 7) is another indicator where India has done well. While the country has achieved near universal household electrification in the past two decades, the quality of power and duration vary vastly based on regions and urban/rural fault lines. It is, however, laudable that India today ranks as the fourth largest renewables capacity deployer, mainly solar and wind. And while India has bettered its score in infrastructure provision (SDG 9), noteworthy additions being rapid mobile penetration and financial inclusion through UPI-linked digital payments gateways, COVID-19 revealed the stark difference between rural and urban Internet penetration, which must be addressed to achieve even higher educational outcomes (SDG 4). It is telling, however, that throughout the Modi years, India’s performance in governance, the rule of law, press freedom and strong and independent institutions (SDG 16) has been lagging.\r Published - June 28, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Sustainable Development Goals\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        United Nations\n                    \n                            /                      \n                        \n                        poverty\n                    \n                            /                      \n                        \n                        personal income\n                    \n                            /                      \n                        \n                        rural-urban divide\n                    \n                            /                      \n                        \n                        nutrition and diet\n                    \n                            /                      \n                        \n                        obesity\n                    \n                            /                      \n                        \n                        population\n                    \n                            /                      \n                        \n                        electricity production and distribution\n                    \n                            /                      \n                        \n                        renewable energy\n                    \n                            /                      \n                        \n                        mobile phones\n                    \n                            /                      \n                        \n                        Coronavirus",
        "headline_1": "No time to rest: On India’s ranking and the Sustainable Development Report",
        "headline_2": "India did well in climbing up SDG rankings, but falls short in governance",
        "link": "https://www.thehindu.com/opinion/editorial/no-time-to-rest-on-indias-ranking-and-the-sustainable-development-report/article69745108.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-06-2025"
    },
    {
        "full_article": "4 books, 4 vivid renderings of the country\nShah of Shahs (1982) by Ryszard Kapuscinski is a reporter’s account of the days leading up to the 1979 Islamic Revolution. It paints a vivid picture of Iran’s evolution from the rise of the Pahlavis – how a young Reza Khan, an officer in the Persian Cossack Brigade, went on to stage a coup with the help of the British and become the new Shah – through premier Mosaddegh’s burst of nationalism and democracy that was again sabotaged by Western oil interests, to finally the backlash against the throne that coalesced around Ayatollah Khomeini. \nInterestingly, a 1978 article aiming to discredit Khomeini by alluding to his foreign origins – his grandfather came from India – and casting aspersions on his mental health, was the trigger for the revolution. This history weighs heavy on Iran even today, with the struggle for “dignity” animating internal political discourse.\nReading Lolita in Tehran: A Memoir in Books (2003) by Azar Nafisi is an autobiographical account of a woman who finds herself suffocated by the arbitrary restrictions and punishments of her country. After resigning her university job, she creates, clandestinely, a classroom with more freedoms than exist outside. For two years, every Thursday, seven students gather in her home, taking off their veils, to peruse the relation between fiction and reality. They read A Thousand and One Nights and the forbidden, ‘non-revolutionary’ canon, Nabokov to Austen.\nLolita captures, for them, the texture of living in a totalitarian society. As movie houses were set on fire Ayatollah Khomeini had declared, “We are not against cinema…we are against prostitution.” Humbert rapes Lolita, robs her of childhood, and exonerates himself by implicating her, as vulgar vixen, vile slut, seducer. An illusory world makes saviour and executioner indistinguishable. \nRepublics of Myth: National Narratives and the US-Iran Conflict (2022) by Hussein Banai, Malcolm Byrne, John Tirman explores how two nations in a cold war for 40 years managed to deal on a complex issue – Iran’s nuclear programme – and then let it unravel. Crediting or criticising individuals – Obama-Rouhani or Trump – is incomplete reading. It’s the two nations’ centuries old narratives that constantly clash, and determine the relationship. Iran’s narrative is of suspicion of foreign involvement, US’s is of self-glorifying idealism. \nThese narratives, sustained by history, culture, ideology, overpower ‘strategic logic’. It took 18 years to reach an n-deal, driven by powerful state interests – existential for Iran’s regime survival, for US, a need to contain Iran. Yet, it was the stories nations tell themselves weaving history with myth that reinforced the US-Iran conflict – a fraught relationship itself became the key narrative. \nIran’s Rise and Rivalry with the US in the Middle East (2025) by Mohsen M Milani: In 1971, Iran was America’s top arms buyer, and ‘policeman of the Persian Gulf’ – a peg above Saudi – in Nixon’s eyes. Oil revenues were strong, yet the revolution that deposed the Shah and ushered in a theocracy was just eight years away. How did US, seen as a friend under Truman in the 1940s, become a foe so soon? One that Khomeini described as “the great Satan, the wounded snake”.\nIn Milani’s assessment, this rupture occurred because Iranians resent attacks on their sovereignty – which they have lost to Greeks, Arabs, Mongols, Turks and Britons over millennia. The 1953 coup – Eisenhower ganged up with Churchill to oust Mohammad Mosaddegh, patriotic Iranian PM who nationalised the Anglo-Iranian Oil Company – and continued interference since, were the deal-breakers.\n\n",
        "headline_1": "Iran: From the inside as well as outside",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/iran-from-the-inside-as-well-as-outside/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-06-2025"
    },
    {
        "full_article": "India needs a sophisticated China playbook \nSCO defence ministers’ meet showcased the Pakistan-China nexus, which mainly focused on undermining India’s stand on terrorism. The proposed joint statement was opposed by India after it was found that Pakistan, with China’s complicity, was blocking mention of the Pahalgam terror attack but was pushing for inclusion of ‘terrorist activities’ in Balochistan and the situation in Kashmir. This would have been shocking were it not part of a well-established tactic. \nBut, as familiar as it is, it should certainly inform the ongoing thaw in New Delhi-Beijing ties. Apart from aiding its ‘iron brother’ Pakistan, China itself remains a sophisticated strategic challenge for India. Therefore, utmost caution must be maintained in all dealings with Beijing. China’s United Front strategy means that any lever of the Chinese state – including private companies – can be leveraged by Beijing to further its strategic interests. Case in point, three massive tunnel boring machines for the Mumbai-Ahmedabad high-speed rail corridor remain held up at a Chinese port awaiting clearance. They were supposed to start arriving last Oct. Similarly, China is easing its urea export ban, but not for India. \nIndia needs two approaches here. It must power on with building indigenous supply chains and tech in critical sectors to reduce dependence on China. The PLI scheme for Active Pharmaceutical Ingredients has shown some results. It needs more backing. In the same vein, China’s monopoly on rare earth permanent magnet motors can be tackled through development of microelectronics. For R&D collaborations, we can reach out to Taiwan. Second, given the current geopolitical play, it’s vital to conclude the trade deal with US. This is now a strategic imperative. India needs options today. And the trade deal with US will provide New Delhi with good leverage vis-à-vis Beijing. It’s time to play smart.  \n\n",
        "headline_1": "Gaming the dragon",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/gaming-the-dragon/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-06-2025"
    },
    {
        "full_article": "Bhopal sets a new standard for weird bridges\nMake sure it’s at the right angle, architects to civil engineers to builders are wont to say. This provides safety and durability to so much construction. Like walls have to be at 90° to the floor. But throughout human history, roads have been different. They are curve-loving creatures. As are their cousins, from rail lines to bridges. So when a new bridge in the heart of Bhopal neared inauguration on June 15, and its 90° bend came to public light, it drew shocked gasps, angry questions, and fearful worries. \nBut the numerous parties, public and private, involved in the bridge’s making since its design was sanctioned in 2018, have a hardier constitution, evidently. They share it with all those who last year delivered to Mumbai a bridge with a 6-foot vertical gap with the adjacent flyover. Amul girl was left fretting, Pul ko push kaun karega? Who will make the connections? Govts are never as disconcerted as the public. They simply roll out more trucks of crores and concrete. Problem fixed. \nThe Arkadiko stone bridge in Greece has survived since 1300 BC. Once it carried chariots, today it tolerates cars. Such enduring public infra Indians do not even dream of. We have also been conditioned not to expect Golden Gate like beauty. All we now ask for is basic functionality. Instead of Ripley’s Believe It or Not horror stories.\n\n",
        "headline_1": "Right angled wrong",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/right-angled-wrong/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-06-2025"
    },
    {
        "full_article": "Is the region safer after the bombing of Iran’s nuclear facilities? No. Because Palestine, Shia-Sunni tension on streets and distrust between Gulf Sheikhs & Ayatollahs won’t go away anytime soon\nIn a matter of 12 days, several long-held red lines in West Asia were crossed – direct and intense military exchanges between Iran and Israel; the biggest US military assault on Iran since the foundation of the Islamic Republic; and massive strikes on Iranian nuclear facilities.\nHowever, just as things were looking hairy, Trump announced a ceasefire.\n\nBut the big question is: Will the truce hold? Is West Asia any safer after the latest burst of conflict? Here’s the breakdown of the current regional dynamics.\nRead the full story on TOI+.\n\n",
        "headline_1": "Wild, wild West Asia",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/wild-wild-west-asia/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-06-2025"
    },
    {
        "full_article": "We are alarmed by the high rate of domestic violence that women in the country have to endure throughout their lives. According to a recent survey by the Bangladesh Bureau of Statistics (BBS) and the United Nations Population Fund (UNFPA), about 82 percent of women in Barishal and 81 percent of women in Khulna have experienced at least one instance of physical, sexual, psychological, or economic violence by a partner or husband in their lifetime. While the rates are highest in these two divisions, women in other divisions are not in any better situation. Approximately 76 percent of women in Chattogram, 75 percent in Mymensingh, around 75 percent in Rajshahi, and 74 percent in Rangpur have also experienced such violence. In the two divisions—Dhaka and Sylhet—where such violence was found to be comparatively lower, the rate still stands at around 73 percent, highlighting how pervasive intimate partner violence has become.\nOne of the findings of the survey report—that the rate of domestic violence is higher in disaster-prone areas—deserves particular attention. According to an expert, in disaster-prone areas, men often leave home in search of work, and during their absence, women are burdened with increasing household responsibilities and caregiving duties for family members, yet their opinions are not valued in decision-making. This also increases abuse. Unfortunately, very few victims pursue legal action in such cases. For instance, although Barishal has the highest rate of domestic violence, legal action is taken in only 6 percent of the cases, as the survey reveals.\nOver the years, multiple studies have been conducted to assess the extent of domestic violence in the country, all of which came up with similarly alarming results. Data rarely seems to influence policy responses or measures. Even society in general still seems not ready to acknowledge the incidence of domestic violence and the many damaging repercussions of rising levels of physical and sexual violence—including rape—both in homes and public spaces. Only the other day, we commented on how marriage is being used as a cover-up for rape. Such practices and vulnerabilities must end so that women can live with safety and dignity. We have the necessary laws and policies in place, which should be enforced effectively. The state should also take effective steps to inform and enable women about their legal rights in such cases.\n",
        "headline_1": "We must stop the culture of domestic abuse",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/we-must-stop-the-culture-domestic-abuse-3925181",
        "news_paper_name": "The Daily Star",
        "publish_date": "28-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 28, 2025 00:00:00  \nThe UNICEF and other international bodies concerned about public health hazards caused by lead poisoning estimate that 800 million children globally have blood lead levels at above 5.0 microgram per decilitre. Worryingly, there is no safe level of lead in blood. So, the only way to avoid the danger of lead poisoning is to remove the sources of lead pollution. Bangladesh ranks fourth globally with over 36 million children dangerously affected by lead pollution. According to an AFP report published last April, 36 million children in Bangladesh are affected with elevated lead levels in their blood. Now the source of lead contamination is the Lead-Acid Battery (LAB) recycling units in the informal sector. The problem with the locally produced LAB is that unlike the foreign-made ones they are not fully recyclable. \nMillions of the discarded LABs from autorickshaws, easy bikes and various other modes of transport are polluting the environment everywhere in the country, thanks to lax regulatory oversight. According to the private organisation styled Battery-run Easy bike and Rickshaw Drivers' Movement Council, as reported in the June 25 issue of this paper, there are about 2.5 million such LAB-run vehicles operating in the capital city alone. Nationwide their number is around 5.0 million, the report adds. Another one million autorickshaws and easy bikes have been added to the existing ones with the interim government assuming office in the wake of the July uprising of 2024. In that case, the LABs, some 20 million in number, are currently in use in those battery-operated vehicles. If this estimate of the LAB number is correct, one can easily imagine the danger to the environment and public health they would pose once discarded after use. \nObviously, to have correct estimate of LAB being used currently and those already thrown away or to be done so soon will require a formal, that is, official approach to the issue. The knowledge of exactly how many of such LABs are accumulating in the city's drains, sewage networks, lakes, canals and rivers is vital for assessing the scale of the pollution and hazard to public health they pose. Lead in these used LABs dumped in the surroundings of cities as well as of the countryside are entering the food chain from the lead-polluted crop fields and aquatic life exposed to it. Since the sources of pollution of the country's environment are already too many to count, another hazardous one added to it may prove to be the last straw that broke the proverbial camel's back. But what is the way out of this environmental and public health crisis? \nSince it is already too late to rid the country of the modes of transport operated by the LABs, the best option would be to create an appropriate body and the required tools to quantitatively assess the growth of the sector. The only way to do that is to take the entire LAB-run transport sector under government control through a body dedicated to the purpose. The ministry of environment can take the responsibility and introduce regulations to ensure compliance of those manufacturing the LABs and establish at least some reasonable order in the sector. Since the LAB-run transports are a source of livelihood of millions of families across the country formalising the sector is one way of keeping tabs on its development.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Lead poisoning threatens public health",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/lead-poisoning-threatens-public-health-1751033818",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       June 28, 2025 00:00:00  \n\nHollywood is famous for making thrilling bank heist movies, several of which have earned a place among the best ever made. However, the real-life bank heists that have taken place in Bangladesh are just as astonishing, if not more. Over the past 15 years, hundreds of billions of taka have been siphoned off from multiple banks, pushing many to the brink of collapse. Powerful individuals responsible for these embezzlements have reportedly used the money to acquire luxury homes, hotels and businesses abroad, living in opulence while the banks they looted struggle to survive. For a time, the interim government made efforts to recover the lost money. But with little to show, the authorities now seem to have lost interest in the chase. \nNow, the same authorities are shifting their focus to merging some of these weak banks under the Bank Resolution Ordinance. Reports suggest that five struggling Islamic banks may soon be consolidated into a large Sharia-based bank, primarily intended to finance small and medium enterprises (SMEs). The government even plans to inject initial capital into this new entity.\nBut why is the government stepping in to rescue these failing banks, and with taxpayers' money? After all, banks are fundamentally businesses that either profit or incur losses. The key difference is that they operate with other people's money. Like any other business, banks can and do fail. This is a relatively common occurrence in Western financial systems. For instance, in the United States, 568 banks have failed since 2000, averaging 25 closures annually. The worst years were 2010 and 2009, which respectively saw 157 and 104 failures.\nGenerally, governments refrain from intervening when private banks succeed or fail, as such outcomes are considered part of the risks inherent in private enterprise. Intervention typically occurs only when a bank or financial institution is deemed too big to fail, that is, its collapse would have severe repercussions for the broader economy. A well-known example is Lehman Brothers in the United States. The government's decision not to bail it out triggered a liquidity crisis, widespread panic and a major global economic downturn. In contrast, none of the banks that Bangladesh Bank is now considering for mergers and initial capital support pose such a risk. This naturally prompts the question about the justification for pouring in public funds for their rescue. \nAmong the five banks slated for merger, four were under the control of the S Alam Group, representing a single business family. They are First Security Islami Bank, Global Islami Bank, Union Bank and Social Islami Bank. The fifth, EXIM Bank, was operated by a businessman closely aligned with the previous government. In Bangladesh, banking regulations limit single-family ownership to 10 per cent of a bank's shares. Yet these individuals found ways around to gain majority control. Once in charge, they are alleged to have siphoned off billions overseas using methods like manipulating trade values where export prices were reported lower and import prices higher than actual. \nCollectively, these banks hold Tk1.45 trillion in deposits but have loaned out Tk 2.15 trillion, covering the shortfall by borrowing from Bangladesh Bank and other sources. A large portion of these loans went to related parties. In fact, 90 per cent of Union Bank and Global Islami Bank's loan portfolios went to S. Alam Group, and are now classified as bad debts. Similarly, 70 per cent of loans at First Security Islami Bank and 20 per cent at Social Islami Bank went to the same group. Meanwhile, 10 per cent of loans at EXIM Bank are tied to businesses associated with its former chairman. Banking regulations prohibit lending more than 25 per cent of a bank's capital to a single borrower. This is a safeguard to protect against excessive risk. So, what were the regulators doing when these individuals made a mockery of that limit? How many red flags were ignored for these violations to occur? Reports suggest that S Alam used these funds to build overseas business ventures worth billions. Given the scale of this self-serving lending, the collapse of these banks was only a matter of time. \nThe current struggles of these banks are undeniably the result of failures by both banks themselves and their regulators. In the end, people reap what they sow. There is no getting around it. The same principle applies to the consequences facing the banking sector. The pressing question now is what the central bank's decision to merge five banks will actually achieve. After the merger and the injection of public funds to restore the newly formed entity, can anyone guarantee it won't once again become a target of political plunder? Have the necessary lessons been learned to prevent a repeat of past mistakes? Without fundamental reforms in the banking sector and strict enforcement of accountability, mergers alone will amount to nothing more than a temporary fix. \nThere are also serious concerns regarding Bangladesh Bank's policy guidelines on bank mergers. According to the policy, directors of a weak bank or financial institution may return to the board of the merged entity after five years, provided they meet certain conditions. These are often the same people who drove their banks into crisis, and this provision effectively grants a form of immunity by allowing their return after a brief absence. It is imperative that individuals who contributed to the plundering of banks face the consequences of their actions, rather than being given a chance to repeat them.\nTo bring about a real change, the old playbook must be discarded. Change in the banking sector demands reforms that put structural safeguards in place, mechanisms that would actively prevent violations of single borrower exposure limits or avenues for misinvoicing. Loopholes, after all, are invitations for abuse. Only when such protections are firmly established can bank mergers be expected to produce lasting, positive outcomes. Otherwise it is simply setting the stage for another collapse.\nshoeb434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "What is the purpose of  bank merger?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/what-is-the-purpose-of-bank-merger-1751033939",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       June 28, 2025 00:00:00  \n\nThree months ago, Yuval Noah Harari, a famous historian and writer, wrote a piece in the Financial Times (FT) describing Donald Trump's global vision. Harari pointed out that the president of the United States believed in the 'might is right' policy. He added that in the Trumpian vision, the weak should always surrender to the strong. Harari further mentioned that to prevent global conflicts, Trump offers a simple solution: the weak to do whatever the strong demand. \"According to this view, conflict occurs only when the weak refuse to accept reality. War is therefore always the fault of the weak,\" he continued. \nBy bombing Iran's nuclear facilities in the last week, Donald Trump proved the truth of Harari's assertion. The world has witnessed how the most mighty country bombed a weaker one violating all the international laws and norms. Not that it is the first time the US has demonstrated its power to penalise a small or weak country. Over the decades, the US attacked, occupied, bombed and ruined several countries. \n\nIt was around 80 years ago, the US dropped two atomic bombs on Hiroshima and Nagasaki, two Japanese cities that led to the unconditional surrender of Japan in 1945. It was one of the most horrific events in the history of humanity. Since then, no countries in the world have used any atomic weapon, considering the severe consequences on human lives and the environment. Nevertheless, attacks and bombings by powerful countries and forces on weaker ones have continued in various forms and on unsubstantiated pretexts. But, Trump has initiated an extended aggressiveness and a perilous trend to subjugate weaker countries to stronger ones. He has also set an example that powerful countries can defy diplomatic efforts and cheat the parties engaged in discussion to settle any dispute. The events in the last few weeks are examples of such diplomatic covertness and breaches. \nIn the name of negotiation, the US engaged Iran in discussion and secretly signalled Israel to launch pre-emptive attack on Iran. Caught off-guard Iran, however, absorbed the primary shock and started to retaliate. For the first time in 77 years of its existence, Israel faces unprecedented attacks of missiles and experienced wreckages in various parts of the country. As the war intensified, Israeli PM Netanyahu pushed the US to join the war. Trump, tempted to do something that his predecessors avoided, bombed Iran and assured Israel that the Zionist nation would continue to get American backing. \nSoon, it will be increasingly challenging for any country, especially small and vulnerable ones, to maintain trust in the US and other major nations regarding diplomatic negotiations. It is not unlikely that, following the US precedent, other major and powerful countries will start to undermine diplomatic orders and norms. Small nations will be compelled to accept many unjust and irrational demands of the powerful countries. \nAs ignoring the United Nations (UN) and other international organisations becomes a practice rather than an exception among powerful nations, the world order will collapse. Trump and like-minded rulers in the world's powerful countries will be pleased to see this. The global rules and norms of checks and balances will be seriously dysfunctional, making the small and weak nations vulnerable. Most of them have to rely on the mercy of their big and powerful neighbours. In this process, there will be a rise in a number of vassal states, though in various forms and conditions.\nThe way the US is now moving to reshape the Middle East may prompt other powerful nations to venture into reshaping their own spheres of influence. Russia has already invaded Ukraine, and the two countries have been at war for more than three years. As the US and Europe have been helping Ukraine by supplying arms and ammunition, the country has so far kept Russia in check at a high cost. The US support is, however, dwindling as Trump thinks Putin is not guilty of attacking Ukraine. \nOr, what will happen if China overruns Taiwan? The large countries are substantially powerful and their small neighbours are no match for them. The strongmen who now rule these countries and some other powerful ones also share many of the Trumpian world views.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Threats to small and  weak countries",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/threats-to-small-and-weak-countries-1751034041",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 28, 2025 00:00:00  \n\nFreelancing has gained significant popularity around the world, and Bangladesh is no exception. Approximately, 1.57 billion people, or 46.7 per cent of the global labour force, are freelancers, contributing to a market valued at $3.39 trillion, with approximately 1.0 million freelancers hailing from Bangladesh. Despite this, Bangladesh has yet to fully tap into the potential of this sector. \nFreelancing offers supplementary income across various fields, such as web development, content creation, design, digital marketing, and programming. It not only provides freelancers with flexibility in their financial expectations and scheduling but also allows them the independence to choose the projects they wish to work on. Furthermore, freelancing grants geographical freedom, enabling individuals to work from anywhere.\nFreelancing also generates foreign currency and drives economic growth, offering substantial benefits to the government. Therefore, the government should take an active role in supporting this sector by removing the stigma associated with freelancing-where it is often undervalued-training individuals with the necessary skills and providing grants and microloans to empower promising freelancers.\nTo truly unlock the potential of freelancing, the national policy must also include digital infrastructure improvements, affordable high-speed internet access, and the removal of bureaucratic barriers related to online payments and taxation. Local institutions and universities should incorporate freelancing and digital entrepreneurship into their curricula, helping students view it as a legitimate career path. Bangladesh has the potential to become a significant force in the global freelancing market, fostering innovation, creativity, and long-term economic development. The nation's hardworking and creative minds should lead this charge, with strong governmental support helping to pave the way for others to follow.\nMd. Farhan Shifat Mahi\nNorth South University\nBashundhara, Dhaka\nfarhan00sc@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Tapping the full potential of freelancing",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/tapping-the-full-potential-of-freelancing-1751034063",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-06-2025"
    }
]