[
    {
        "full_article": "The key objective of the Protection of Children from Sexual Offences (POCSO) Act, 2012 is the protection of children, but over the past few years, courts around the country and rights activists have called for some exemptions. Noticing a trend that adolescents, above 15 years but under 18, in voluntary relationships and having consensual sex were often being persecuted, the courts sought a review. In that backdrop, senior advocate Indira Jaising’s written submission to the Supreme Court that consensual sex between teenagers aged 16-18 years must not be criminalised is a welcome move. She was appointed amicus curiae and her submissions are part of a petition filed by advocate Nipun Saxena. Her brief challenged the designation of 18 years as the age of consent. She said the only solution lies in declaring that sex between consenting adolescents between the age of 16, an almost universal age of sexual maturity, and 18, is not a form of ‘abuse’. Ms. Jaising called for this exception to be read into the POCSO Act and Section 63 (sexual offences), of the Bharatiya Nyaya Sanhita (BNS). “Such an exception would preserve the protective intent of the statute while preventing its misuse against adolescent relationships that are not exploitative in nature,” she said.In a 2023 report, the Law Commission had said that it was against changing the age of consent. It advised “guided judicial discretion” instead, while sentencing in cases that involve children between 16 and 18 years in a voluntary, consensual relationship. Under the POCSO Act and under several provisions of the Indian Penal Code and the BNS, whoever commits a penetrative sexual assault on a child — who is anyone below 18 years — can face stringent punishment under Section 6 of the POCSO Act, Section 9 of the Prohibition of Child Marriage Act, 2006, and provisions of the IPC and BNS. A 16-year-old is considered a “child” under Section 2(d) of the POCSO Act and hence her consent does not matter. But caveats have to be put in place so that the broad intent of the law is adhered to, as the Madras High Court suggested in 2021, in Vijayalakshmi vs State Rep. The High Court said the age difference in consensual relationships should not be more than five years to ensure that a girl of an impressionable age is not taken advantage of by an older person. Educating adolescents about the law on sexual offences and its consequences is a must too. Criminalising normal adolescent behaviour is not the way to protect against non-consensual, exploitative sexual offences. Published - July 28, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        children\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        sex\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        crime, law and justice\n                    \n                            /                      \n                        \n                        judiciary (system of justice)",
        "headline_1": "Protection against misuse: on POCSO Act, adolescent sex",
        "headline_2": "Criminalising adolescent sex will undermine the aim of POCSO Act",
        "link": "https://www.thehindu.com/opinion/editorial/protection-against-misuse-on-pocso-act-adolescent-sex/article69861932.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-07-2025"
    },
    {
        "full_article": "France’s decision to recognise Palestinian statehood, in September, reflects President Emmanuel Macron’s deep frustration with Israeli Prime Minister Benjamin Netanyahu over the ongoing war on Gaza, as well as his willingness to adopt a more pro-active and constructive approach towards finding a durable solution. Of the 193 members of the UN, 147, including India, China and Russia, have already recognised the Palestinian state. But powerful western nations, with close ties to Israel, have always stopped short of granting official recognition even if professing support for a two-state solution. But this position began to shift after the Gaza war in October 2023, with more European countries taking formal steps towards its recognition. Last year, Spain, Ireland, Norway and Slovenia recognised Palestine’s independence. If Mr. Macron follows through, France will be the first G-7 member nation to do so. Such a move may not have an immediate, direct impact on the peace process. That more western European countries are now ready to take irreversible measures in favour of Palestinian statehood, ignoring strong opposition from Tel Aviv and Washington, marks a clear change in sentiment towards one of the modern world’s most contentious conflicts.Mr. Macron’s announcement comes at a critical juncture for the Palestinians. The war has devastated the enclave with confirmed deaths reaching 60,000 in 21 months — roughly 2.5% of its total population. In the West Bank, settler violence has displaced tens of thousands of Palestinians. Israeli Ministers have openly threatened to ethnically cleanse Gaza and annex the West Bank. Images of starving and malnourished children, which came out of Gaza last week, have jolted global conscience. Even Israel’s closest allies, including Britain, Canada and France, issued a rare joint statement, urging Mr. Netanyahu to “immediately end the humanitarian catastrophe”. Under mounting pressure, Israel has announced ‘tactical pauses’ in its attacks. But this is far from sufficient. What Gaza urgently needs is a complete end to the bombings and shelling, and the full opening of its borders to humanitarian aid. Given that pressure is the only language Israel appears to understand, and with the Donald Trump presidency showing no willingness to apply it, Europe must do more. Efforts to end the war, which in terms of mass killings, devastation and displacement is comparable to the 1948-49 Nakba, must be accompanied by initiatives to ensure that such a catastrophe is never repeated. There should be concrete measures from the international community to pursue a durable political solution, which is the two-state solution. The first step in that direction is the recognition of Palestinian independence and statehood. France has promised to join, though belatedly, most member-countries of the UN in the statehood push. Other nations in the West must follow. Published - July 28, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        France\n                    \n                            /                      \n                        \n                        Palestine\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        Europe\n                    \n                            /                      \n                        \n                        Spain\n                    \n                            /                      \n                        \n                        Ireland\n                    \n                            /                      \n                        \n                        Norway\n                    \n                            /                      \n                        \n                        Slovenia\n                    \n                            /                      \n                        \n                        G7 summit\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        Canada\n                    \n                            /                      \n                        \n                        human rights\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        United Nations\n                    \n                            /                      \n                        \n                        Israel",
        "headline_1": "State for the stateless: on France and Palestinian statehood",
        "headline_2": "The West must follow France in recognising Palestinian statehood",
        "link": "https://www.thehindu.com/opinion/editorial/state-for-the-stateless-on-france-and-palestinian-statehood/article69861945.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-07-2025"
    },
    {
        "full_article": "Israel can’t be allowed to keep weaponising food in Gaza. India must do its bit at UN conference\nOver the weekend, Tel Aviv allowed a ribbon of aid into Gaza, no doubt following a smattering of political actions last week amid growing global condemnation of its starving of Palestinians. Rising anger in France over visuals coming out of Gaza of harrowed hungry children pushed Macron to make Paris the first UNSC member that will recognise Palestinian state formally in Sept. Though he failed to get fellow G7ers Britain and Canada to back him, his announcement sparked some hopes from the July 28-30 UN conference on Israel-Palestine to be co-chaired by Riyadh and Paris. India must put its weight behind global measures towards stopping the war and settling the Palestine question. Several nations are also exploring declarations of recognition – Israeli expansion into West Bank and its unrelenting offensive in Gaza has made it hard to see Palestine become a geographical reality. As noted for months, Netanyahu’s blockades on food, fuel and medicine have made it evident that the aim was not only return of hostages, but forced displacement of Palestinian population.\nThis isn’t the first time Israel has limited entry of food into Gaza as part of its war plans. What has been stark this time around is that it has paid no heed to its own red lines – allowing basic minimum into Gaza to avoid a malnutrition catastrophe. Netanyahu with Washington’s support this time erased any such restraining line. Apart from almost 60,000 Palestinians killed, including at least 17,400 children, Palestinian health ministry says 122 died due to starvation, including 83 children. Visuals of kids in queues, skinny arms outstretched to fill plastic and aluminium bowls, crying, bawling, deadened, shoving and jostling, have left none unmoved. UN’s World Food Programme estimates 1 in 3 people in Gaza doesn’t get to eat for days at a time. There’s no normalising such war excesses as ‘collateral damage’. The world cannot afford to fail in getting Israel to stop weaponising food.\n \n\n",
        "headline_1": "Stop Starvation",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/stop-starvation/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-07-2025"
    },
    {
        "full_article": "What’s sleep divorce? Great for marriage \nSo, here I was, the other night, trying to sneak past Boss Man, with my pillow, eye drops and water bottle in tow, when he peered up at me from the top of his phone. ‘Where are you going, my lovely?’\n‘Was thinking of leaving you,’ was my mumbled reply.\n‘Really? Packed already? Carrying your meagre belongings in just a pillow cover, are you? I guess it’s easier to travel light, will be quicker and hassle free to relocate, too,’ he wisecracked.\n‘Oh, zip your mouth, will you?’ I chafed. ‘I’m just off to the next room to sleep in peace rather than listen to your discordant snores all night.’\n‘Would you like to shift to the guest bedroom altogether?’ he asked helpfully. ‘You’ve always been complaining about the peculiar smell coming from the bathroom, so then you can actually use the guest bathroom too…’ \n‘Haven’t you heard of sleep divorce?’ I asked him, a tad irritably. ‘It’s the new norm. We sleep in separate bedrooms to give each other space and then we reunite in the morning! Works well for many of my friends, so I thought I’d try it too.’\n‘Something like golf widows?’ Boss Man perked up.\n‘Finally, he’s getting it,’ I thought. But that wicked gleam in his eye told me another story.\n‘So, if sleep divorce is the new norm, how about a Wednesday and Saturday divorce, too? You think we can work that out?’\nOf course, I knew the reason why. Wednesday was a day out with the course mates and Saturday was club night. \n‘Since we will be divorced on those days you can save the bother of grilling me when I get home.’\nAs he turned back to his phone, I thought I noticed a smirk. ‘Let it go,’ I told myself. ‘One can never have too much of a good thing.’\n\n",
        "headline_1": "Bedroom fashions",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/bedroom-fashions/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-07-2025"
    },
    {
        "full_article": "Humpy and Deshmukh have just inspired a generation of Indian girls to take up chess\nFIDE Women’s World Cup final between India’s Koneru Humpy and Divya Deshmukh was a huge moment for Indian chess. Not only is this the first time that the Women’s World Cup was an all-Indian affair, it also marks the rise of Indian women’s chess. China is the dominant power in this category. The last three women world champions were from China. Half the top 10 women chess players are Chinese. Only one Indian, Humpy, is on the list. Therefore, the performance of Indian players in this edition of the Women’s World Cup is a watershed moment.\nHowever, internationally, women’s chess still lags behind the men’s game. Actually, women and men have been competing with each other at chess tournaments since the 1980s. Yet, there are still very few top internationally ranked women chess players. For example, in 2001, only 6% of internationally rated players were female. By 2020, this had risen to more than 15%. However, at the end of last year, there were only 42 women grandmasters compared to 1,804 male GMs. In India, as of May 2023, out of 85 GMs only 23 were women.\nThe gender glass ceiling in chess, like in other sports, isn’t something new. There was a time when women were considered temperamentally ill-equipped to play chess, harking back to the old nature vs nurture debate. The argument was that women being more risk-averse couldn’t be good chess players. Even greats such as Garry Kasparov once subscribed to this view. However, that perception began to change when Hungarian chess prodigy Judit Polgar beat Kasparov in 2002, becoming the first female player to beat a reigning world number 1 in a rated game. In fact, people like Polgar believe there shouldn’t be separate women’s tournaments.\nHowever, others are of the opinion that women’s tournaments encourage young girls to take up the game, providing some financial incentives. The latter is crucial for parents to encourage girls to play chess professionally. High-level chess training can be very expensive. And many parents from conservative backgrounds may be reluctant to make that investment. This is a big issue with Indian women’s chess. There is a significant difference in participation rates between boys and girls in chess, especially in Tier 2/3 cities and rural areas. Therefore, an all-Indian Women’s World Cup final where the winner is taking home $50,000 in prize money, will help motivate girls and their parents to take up the game. India is perfectly poised to host a women’s chess revolution.\n\n",
        "headline_1": "The Queens’ Gambit",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-queens-gambit/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-07-2025"
    },
    {
        "full_article": "The absence of disclosure and restraint policies  in companies is a legal and cultural liability\nA fleeting moment at a Coldplay concert, projected on a stadium screen, has since pulled an entire organisation into public scrutiny. The CEO and Chief People Officer (CPO) of a tech company appeared in an embrace, unexpected and unguarded. The footage circulated widely. The CEO stepped down. The CPO was placed on leave. The institution responded, but the questions that emerged won’t be resolved by formal exits alone.\nIn my work advising organisations on workplace safety and institutional integrity, I’ve seen how culture is shaped less by what leaders say, and more by what they let stand unquestioned. It’s not the bold failures that destabilise trust, it’s the quiet, tolerated ones.\nThe discomfort here isn’t about the existence of a personal relationship. It’s about the roles involved, and the silence that surrounded them. When a CEO and CPO are in an undisclosed association, the impact goes beyond appearances. The CPO is not simply another leader: they sit at the helm of grievance systems, compliance functions, and cultural tone. When that proximity goes unexamined, it undermines the very idea of internal accountability.\n\nOrganisations like to imagine that incidents like this are anomalies. But power rarely moves in isolation. If boundaries at the top are porous, they often reflect what’s been long normalised beneath. If one case surfaces, others likely remain submerged. That’s not cynicism, it’s pattern recognition. And ignoring that pattern is what keeps companies reactive, not prepared.\nI’ve sat across employees who knew something felt off, but could not find language for it. Who adjusted themselves daily, not because they were told to, but because they had learned what it meant to stay on the right side of an unspoken hierarchy. The emotional labour of navigating such proximity, watching it influence access, tone, decisions, rarely finds its way into policy discussions. But it lives in culture, in lowered trust, and in the silent resignation of those who choose not to challenge it.\nIf the other individual involved in this case had been a business head, or someone unrelated to internal oversight, the impact might still have been serious, but not structurally compromising. The fact that this relationship involved the CPO makes the breach systemic. It renders HR’s neutrality open to suspicion, and with it, the legitimacy of every internal resolution taken during that period.\nThis also reflects the unique and often gendered burden placed on HR leaders, particularly women. In many companies, the CPO is expected to carry culture, resolve conflict, manage risk, and remain emotionally available, often while moving in lockstep with executive leadership. When the lines blur, the professional is judged through a personal lens. Yet rarely do we ask: who built the conditions for that erosion?\nCompanies must stop treating these moments as communications challenges and start recognising them as compliance failures. In the absence of formal restraint policies, governing romantic or close associations between individuals in hierarchically linked roles, organisations are leaving themselves exposed to enormous liability. What appears consensual today can, under scrutiny or hindsight, fall squarely within the definition of sexual harassment, especially when a power imbalance is involved. Without policy safeguards, this is not just a cultural oversight, it’s a lawsuit waiting to happen.\nCulture audits alone are insufficient, especially when commissioned by those at the centre of concern. Organisations must decentralise the guardianship of ethics. Oversight cannot be the privilege of a few. Disclosure mechanisms, third party reviews, and independent board-led action must be the norm, not crisis, time improvisations.\nHR, in particular, must be protected as a function, not politically, but structurally. It cannot enforce boundaries if it is not allowed to hold them internally. Organisations must make space for HR to act independently, not just in appearance, but in design.\nAnd while we speak of formal responses, we must also speak of memory. These incidents often leave no trace once they exit the news cycle. But inside the organisation, the memory stays, with those who bore its weight quietly. When we move on without repair, we don’t just abandon them, we teach them that ethics are optional if influence is high enough.\nThis incident, though now fading from headlines, should continue to provoke inquiry. Not because of who was involved, but because of what it revealed about how easily institutional safeguards can be made irrelevant by the people meant to uphold them.\nAnd this must come with a hope. A hope that the lessons drawn from this moment become case studies in transparency, not manuals in discretion. Yes, there were personal failings, and those belong to the individuals and their private lives. But in the workplace, the consequences of concealed influence are never private. They become precedent. They shape how others learn to navigate power. And they leave behind a culture where trust becomes a risk, not a foundation.\nCulture is not what we write. It is what we permit. And what we permit at the top is what we eventually teach everyone else to live with.\n\n",
        "headline_1": "Coldplay controversy: How the behaviour of leaders trickles down",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/coldplay-controversy-how-the-behaviour-of-leaders-trickles-down/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Sahasranshu Dash   |  \n       July 28, 2025 00:00:00  \nWater, like air, is a natural heritage of every man. Treating it as a profit-making commodity is morally wrong, akin to charging people for the air they breathe in. Regrettably, in Bangladesh, drinkable water - the very essence of life - is becoming increasingly unaffordable due to the authorities' failure to protect this vital resource from profit-driven exploitation. On the one hand, public reliance on bottled drinking water is steadily increasing due to limited access to safe, potable water and the questionable quality of water supplied by the WASA. On the other hand, there is a mushroom growth of commercial ventures offering 'safe' drinking water at increasingly higher prices. Thus the ordinary citizens are left with little choice but to pay for what should be a basic necessity. The failure to check the unbridled price hike by holding the profiteers accountable raises serious concern.\nThe bottled water companies were already raking in hefty profits, as an investigation by the Bangladesh Competition Commission (BCC) revealed in 2023. In fact, the BCC filed a case against seven leading bottled water companies for colluding to collectively set unreasonably high prices, a clear violation of the Competition Act of 2012. The case is still awaiting a hearing. Reportedly, the hearing is being delayed for dubious reasons. Despite this pending legal action, these companies have mindlessly increased prices yet again, citing the flimsy reason of volatile dollar market and increase in the price of raw materials. It shows the companies' blatant disregard for regulatory efforts to hold them accountable and their profit-making tendency over public well-being. \nIn 2022, when the prices of bottled water were raised citing the same reason, the BCC launched an investigation and found that some of the companies' profit margins increased by as many as 400 per cent in the same year. The business has become so much profitable that the companies can afford giving retailers a commission of Tk 9.0 against the sale of each bottle of half liter water for Tk 20. But the consumers are shown no mercy.\nMeanwhile, the city dwellers are doubly fleeced considering that they have been paying water tax and this tax is being raised every year. Water tariff has been increased 14 times in the past 13 years. Yet, the city dwellers cannot drink the WASA supplied water, and they have to spend extra money boiling it to make it potable or purchasing a water purifier, bottled water, or jar water. In few cities of the world does a separate body for water supply exist and this is part of municipal services. But despite the ever-rising water rate WASA did almost nothing to win the confidence of city-dwellers by supplying safe drinking water. Its underground pipeline is said to be old and decaying. Then why has nothing been done all these years? Why are the people burdened with an additional expenditure on account of drinking water? Instead, the WASA too has started supplying bottled water, in line with the other commercial companies. If the WASA too becomes a bottled water supplier and makes monetary gains from it, what interest will the body have in performing its primary duty of supplying safe drinking water? Therefore, both private companies and public entities like the WASA must be held accountable. Regulatory frameworks must be prioritised and strengthened to protect this basic human right for all.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "How the thirsty are being fleeced",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/how-the-thirsty-are-being-fleeced-1753628258",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       July 28, 2025 00:00:00  \nFrench president Emmanuel Macron, in a post on X last Thursday (on July 24) announced he would recognize Palestine as a state in September at the UN Nations General Assembly.\nBefore him Ireland, Norway and Spain did also decide to recognize a Palestinian state. Giving formal recognition of statehood for Palestinians is no doubt important, but what is more urgent at this moment is to keep them alive so they can enjoy the fruits of any freedom and statehood later. Shouldn't President Macron, who is now leading the movement for this Palestinian cause in Europe, and other governments there be convinced to create pressure on Israel to withdraw the food blockade and stop murdering the helpless Palestinians by forced starvation? In fact, it is a delayed response after a lot of prevarications, play of words and twists of facts to ignore the truth, to have reached a positive decision by at least some European leaders. It is hoped they would now also take forceful steps to allow the Palestinian civilian population in Gaza unhindered supply of food, water and medicine as those are being denied to them by Israel. As if that was not enough, soldiers of the Israel Defence Force (IDF) are pounding the hungry Palestinians trying to approach food distribution points with mortar and tank shells and bombs and bullets from aircraft. It is a kind of cruelty quite unheard of in the modern civilized world. But it is not happening in secrecy, the savagery is being brazenly live streamed for the whole world to watch. So, numberless Palestinian men, women and children, are dying every day. There is no point here counting the exact numbers, because they are being deliberately and systematically murdered by using the weapons such as hunger and bullet at the same time to show the world that the perpetrators can commit such crimes against humanity with impunity in defiance of all international laws and morality. \nHowever, indiscriminate killing of Gazans by Israeli forces has been ongoing during the last 21 months and a week since the Gaza war started. Food carrying vehicles on land and by the sea dispatched by international agencies, sympathetic countries and organisations for the famished Palestinians have never been safe as those were constantly under Israeli attacks. But corralling the Palestinians like animals into a confined space and then shelling and bombing them when they are in desperate search of food is indeed a new dimension added to the Israeli atrocities and being done so with declaration since March last. A graphic description of the barbarity being committed was given to the BBC by a former US Army Special Forces officer who resigned from his role at the Israel and US-backed so-called Gaza Humanitarian Foundation (GH). He witnessed 'the shelling of aid-seeking civilians. In an interview with the BBC last Friday (July 25), Lieutenant-colonel Anthony Aguilar said he had never seen such \"brutality and use of indiscriminate and unnecessary force against a civilian, an unarmed, starving population\". \"I have never witnessed that in all the places I've been deployed to war, until I was in Gaza at the hands of the [Israeli forces] and US contractors\". \"Without question, I witnessed war crimes by the Israeli Defense Forces, without a doubt. Using artillery rounds, firing tank rounds into unarmed civilians is a war crime\". He recalled one instance in which a Markava tank fired at civilians, destroying a car as it drove away from the aid site. He also saw mortar rounds being launched into crowds \"to keep them controlled\". But despite these presentations of a glaring truth by a US army veteran, Israel continues to deny what the rest of the world says a man-made starvation being forced on Gaza. In this way, since May, the Israeli military and private contractors, basically American, have killed more than a thousand people trying to reach food at the distribution centre operated by GHF. \nClearly, it is a mockery of food distribution being enacted by the so-called food delivery centres.\nThe Western nations so vocal about any violation of human rights elsewhere in the world look quite muted when it comes to the case of Israel, and war crimes are committed against unarmed Gaza civilians. If this is not double standard, then what is?\nEven so, one would like to appreciate President Macron for his noble effort at this desperate moment. One would also like to hope that the British prime minister Kier Starmer, despite his unhinged support to whatever Israel does, could finally be convinced (by Macron) to take some steps to prevail on Israel and stop the deadly game being played in Gaza in the name of food distribution to starving human beings. \nThe only Western world leader who, perhaps, can do something in this regard is the US president Donald Trump. But so far whatever occasional efforts he has made to enforce a ceasefire in Gaza ultimately fell through. But no further move is being made from his side in this regard. The Zionist lobby in his administration appears to have had a stronger influence on him so he may not make any further move in this direction. \nBut then why is this total dependence on the West, which was actually instrumental in creating Israel and offering blind support to whatever it did and has been doing till now?\nWhat are the next door neighbours of the Gaza enclave and the West Bank like Egypt with its powerful military or those living in the Hashemite Kingdom of Jordan doing to help their blood brothers in Gaza and other Palestinians in the West Bank being massacred day in, day out by the Israeli forces as well as the Jewish settlers? What even other Arabs in the region doing to save the Palestinians being thus forced to die painful deaths by creating an artificial famine and through the cruel sport of food distribution to the victims of this unspeakable brutality? How can those in the nearby rich Arab countries even eat their sumptuous meals every day when their hapless, starving Palestinian brothers are being denied even a morsel of bread by the occupying Israeli forces engaged in a mission to carry out ethnic cleansing of Palestinian by every means imaginable?\nIt is the moral courage that is required at the moment to say no to this morbid and gory scenes being enacted in real life in world leaders' plain sight. Will they have that courage?\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Stopping real-life sinister madness in Gaza",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/stopping-real-life-sinister-madness-in-gaza-1753628431",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       July 28, 2025 00:00:00  \nBeginning as a protest against quota in government services, the July-August movement gained strength to sweep the length and breadth of this land relying on the rallying cry of making the nation discrimination-free. As many as 11 reform commissions were formed apart from a 12-member committee to prepare a white paper on the country's state of economy. But what is missing from all such exercises is the socio-economic discrimination, the core issue that attracted the working class people to participate in the movement. Strangely, the student leaders who joined the interim government as advisers were not known to press for this basic issue. One of the student advisers who resigned to advance the cause of his Jatyia Nagorik Party or National Citizen Party (NCP) and has been leading the month-long programme of march and rally titled \"July March to Build the Nation\" no longer propagates or insists on establishing this agenda. \nThat the bureaucratic and elitist mindset stands in the way of socio-economic reform allowing greater space for the poor and marginalised is indisputable. So, the incumbency of incorporating the ideals and principles, if any, into the political narratives was squarely upon the NCP leaders and their followers. Let alone the details of going about convincing the mass people of such a lofty socio-economic benchmark, the very word does not figure in political discourse. But it was the low-income working class people whose participation was the highest. Even the number of killed among this segment of people, according to reports, was 284 highest among all. The next highest victims during the uprising were students numbering 269. \nNot only has the sacrifice made by the faceless multitudes gone less recognised than they really deserved but the expectation and hope germinated during those heady days have long faded away. These are the people who are hardly interested in constitutional, judiciary or administrative reform. They simply wanted to be at ease when they go to the market for purchasing their bare minimum victuals and essentials. These people wanted security of their jobs and income levels compatible with the market prices for a modest living. They have been terribly frustrated. Instead of creation of new avenues for employment, there have been retrenchment and job losses due to closure of factories. \nContrarily, spates of market volatility have pushed them on to the brink. They have none to turn back and are therefore suffering in silence. Unsurprising, 2.6 million more people have freshly found themselves below the poverty line. Even, the social security net has been curtailed and nobody knows what awaits these hapless people. The interim government has lost precious times to act. This country has been fed up with the sermon \"social business can change the world\". After almost a year, it is not the poor of this land who have at all been beneficiaries of social business although some selective NGOs have. \nIt is against this economic hardship of the working class people, a new pay commission for government and semi-government employees has been constituted. There is indeed a limit to disdainfully treating the cause of the voiceless. Notably, the interim government made a similar attempt to restructure their salary immediately after assuming power. It backed away when there were widespread criticisms against the move. Has the situation been in favour of going ahead with the programme? Economists have made their opposition known with unreserved terms. Its impacts on market volatility are likely to be telling for the low-income people in the informal sector. Discriminations, disparities and inequalities are far too lofty issues to be addressed, now the working class people are unable to pursue the bare minimum survival strategy they somehow did before.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The missing agenda from reform narratives",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-missing-agenda-from-reform-narratives-1753628483",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 28, 2025 00:00:00  \n\nIt has been a year since the streets of Dhaka and other cities erupted in protest, leading to the political shake-up now known as the July uprising, in the days that followed, a wave of hope swept across the country with the appointment of Dr. Muhammad Yunus as head of the interim government. Many believed real change was on the horizon, especially for the struggling economy. But one year later, the results for Bangladesh's business sector are far from clear. The impact has been, at best, a mixed bag.\nForeign investors pulled back sharply during the months of unrest. Foreign direct investment (FDI) dropped by over 70 per cent between July and September 2024 compared to the same period the last year. The workers and owners got worried about what would come next watching the sudden stop. But things started to change by early 2025. Foreign investment in the first few months more than doubled, compared to last year, bringing a sense of hope, though investors are still keeping a close eye on how things unfold.\nBusiness sentiment remains divided. A recent survey showed that while many owners believe profits could rise if inflation slows and banking reforms continue, more than two-thirds are still fearful of political instability and weak law enforcement. Confidence in institutions like the army and judiciary has improved, but trust in the central bank and anti-corruption bodies has eroded.\nMeanwhile, the government's restructuring of the National Board of Revenue sparked strikes and disrupted trade, highlighting that reform, while necessary, is never painless. Even readymade garment sector felt the impact. Big brands like H&M and Zara being worried of interruption in supplies temporarily moved their orders to other countries. Some have come back since, but the warning is clear: Bangladesh can't depend on cheap prices alone anymore.\nThe business world did not collapse after one year of uprising, but it didn't bounce back either. Real progress won't come from promises or headlines. Building confidence needs consistent effort, calmness, and guidance over time. The business community finds itself at a crossroads now. Hopeful indicator is that things are starting to improve, constant political concerns and deep-rooted problems continue to progress slowly. Businesses in Bangladesh may not be thriving yet, but they're holding their ground and slowly moving forward.\nMiftahul Jannat Noushin\nBBA (Marketing)\nNorth South University\nmiftahuljannatnoushin@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Is business recovering or retreating?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/is-business-recovering-or-retreating-1753628498",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-07-2025"
    }
]