[
    {
        "full_article": "In the backdrop of a rising trend of decimation of rights for people who do not fit into the binary of male and female, led by the U.S. administration, a recent U.K. Supreme Court ruling has further polarised the gender debate. In an 88-page judgment, five judges unanimously ruled that only biological women and not transwomen meet the definition of a woman under Britain’s Equality Act 2010. In its limited scope of deliberation, it provided a “statutory interpretation” that the terms ‘woman’ and ‘sex’ in the Act refer only to a biological woman and the biological sex. A transwoman who has undergone a gender reassignment and has a gender recognition certificate as a woman for all purposes would lose the right to be treated as a biological woman. While the appellants in the case, For Women Scotland, funded in part by gender-critical writer J.K. Rowling, celebrated the verdict saying they had been vindicated, trans supporters and campaigners felt it was a setback for trans inclusion. There has been a considerable change in the resolve of the original respondents, The Scottish Ministers, too with the resignation of Scottish National Party leader Nicola Sturgeon in 2023. She had led the fight to change gender laws so that those with gender recognition certificates could be entitled to the same protections as biological women. But there was a backlash against gender recognition reforms after a trans woman, who had raped two women while she was a man, was initially sent to an all-female prison.The ruling made the point that the Gender Recognition Act 2004 gives legal recognition to the rights of transgender people on marriage, pensions, retirement and social security, and that the equality law protects them against discrimination. Kishwer Falkner, the chair of the U.K.’s Equality and Human Rights Commission (EHRC), said the court’s “clarity” means only “biological women could use single-sex changing rooms and women’s toilets, or participate in women-only sporting events and teams, or be placed in women’s wards in hospitals”. But as the judges counselled against reading the judgment as a triumph for one or more groups in society at the expense of another, the EHRC should also ensure that unisex or neutral spaces are earmarked for trans people when it issues new guidelines. That holds true for all institutions, offices, hospitals and schools, planning restrictions. The ruling will have an impact on the sporting arena where athletics, cycling and aquatics have already banned transgender women from participating in women’s events. As the experience with India’s Transgender Persons (Protection of Rights) Act 2019 shows, any changes in the legal framework must factor in the trans people’s basic rights or else they will face more strictures. Published - April 28, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        gender\n                    \n                            /                      \n                        \n                        human rights\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        transgender\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Scotland",
        "headline_1": "​Gender and space: On trans people’s basic rights",
        "headline_2": "​Legal changes must factor in rights of trans people",
        "link": "https://www.thehindu.com/opinion/editorial/gender-and-space-on-trans-peoples-basic-rights/article69497420.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-04-2025"
    },
    {
        "full_article": "On Pahalgam and the West’s ‘militant’ bias\nWords matter. The progressive liberati tell us they matter so much that your survival as a decent human being depends on being sensitive enough to correctly gender a houseplant on social media. Nouns, adjectives and pronouns must be treated with the reverence accorded to ancient artifacts found at an archaeological dig. You would imagine that when Hindus are hunted down and murdered in Pahalgam, Kashmir – murdered for the crime of existing – then NYT would deploy that same obsessive precision. Surely, they would reach for a familiar, correct word, the word they use for the perpetrators of 9/11. You know, terrorists.\nBut no. When Hindus die, the term that gently floats down is ‘militant’ – a word so gloriously beige that it sounds like someone got a bit rowdy at a PTA meeting. ‘Militant’ – not a monster, not a butcher – just a spirited political activist with poor anger management. Makes you wonder if the target of their attack were soldiers and tanks…or families on vacation. Spoiler: it was families.\nJacques Derrida – patron saint of people who quote books they’ve never finished – taught us that language encodes hidden power structures. Well, here’s an easy one: when Western media call terrorists ‘militants’, it’s because Hindus, in their worldview, can never be victims. Hindus are cast as permanent oppressors, with violence against them cast as ‘punching up’. No different than storming the Bastille – violence, sure, but to be seen in the larger context of historical justice, or, wait, there is a word for it, karma. \nThere is a side-show of clowns that enable this, pushing a pseudo-academic thread of messaging, namely that Hinduphobia isn’t real. It’s a ‘constructed term’, they say, from the comfort of panel discussions that smell faintly of Sauvignon Blanc and moral cowardice, used by Hindu fascists to protest when the chickens come home to roost – or militants come to do their ‘militanty’ things.\nTerror exists. All religions are targeted where they are in the minority. Some groups, though, get murdered twice: first by bullets and again by the slow suffocation of their truth. Meanwhile, their killers get to keep their moral alibi, polished and gleaming, courtesy of Western media houses.\nYes, words matter, especially when they come from organisations of influence. It’s long past time we used the right words. And called out those who do not.\n\n",
        "headline_1": "The right word: Terrorist",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/just-another-blog/the-right-word-terrorist/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-04-2025"
    },
    {
        "full_article": "A fridge fished out of a Bengaluru lake tells us what’s in store as upgrades replace repairs in consumer culture \nIt’s true, Bengaluru’s lakes sometimes catch fire. Because there’s so much garbage that it simply overwhelms the water. This sight, if not the fires, at least not so far, is a familiar one at water bodies across the country. What feels even more overwhelming is how every cleanup points to the need for bigger and better efforts. At Madiwala lake, which suffers a severe water hyacinth infestation, an airboat called Jaldost, designed by the National Aerospace Laboratories, has already pulled out over 20 tonnes of waste. But what all makes up this waste? \nNot just weeds. Not just plastic bags. But also mugs, books, pens, steel vessels. Both at home and at work, our dustbins are growing larger and larger. The detritus of modern life overflows. The garbage mounds lining our highways and railway tracks and culverts that we are constantly photoshopping out of our selfies, are the result of govts slacking. They have totally fallen out of step with how much, how fast today’s Indians consume and create waste. Once, we used to marvel at bicycles being discarded into Amsterdam’s canals. Today, Jaldost has fished out a refrigerator from Madiwala lake. \nWe haven’t embraced DIY culture with nearly the same enthusiasm. In India it’s still possible to comfortably find someone to repair a shoe or an air-conditioner, to reupholster the family sofa, to appreciate a hand-me-down silk sari or door or carpet or book. Our neighbourhoods still have carpenters, cobblers, tailors, mechanics, carrying forward our reuse and recycle heritage. Of course the less it’s patronised the faster it will die, and as that Madiwala fridge tells us, so will our lakes and forests. Imagine all our refuse and rubbish invading all our surroundings like relentless water hyacinth. Have a rethink. Choose repairing over replacing. \n\n",
        "headline_1": "Use & throw nightmare",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/use-throw-nightmare/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-04-2025"
    },
    {
        "full_article": "Trump’s willingness to switch track on policies is a good thing. All leaders should take note\nYou can disagree with Trump’s ideology, if he has one, and you can frown upon his methods, but you can’t deny the man can pivot. Like he did on Saturday at the Pope’s funeral. Having told off Zelenskyy at their last face-to-face on Feb 28 – “you’ve done a lot of talking…you’re not winning this…you’re gambling with WW-III” – he sat down again with the Ukrainian leader inside St Peter’s Basilica. Videos show three chairs were hurriedly placed but only Trump and Zelenskyy sat, drawing closer into what psychologists would describe as a sub-4-foot “friendly” range. \nWhat Trump said afterwards about Putin was the real surprise. He’s been accusing Zelenskyy of starting the war, even when Russian strikes killed over 30 Ukrainians in Sumy on April 13. And again last Wednesday – “It’s inflammatory statements like Zelenskyy’s that makes it so difficult to settle this War.” But after Saturday’s meeting, Trump sounded doubtful about Putin’s intentions – “maybe he doesn’t want to stop the war, he’s just tapping me along, and has to be dealt with differently”. \nIt’s a clear shift, and Trump has rapidly changed position on other matters too in recent days. For instance, he’s become less strident on the China tariff issue. Last Tuesday, he said tariffs will “come down substantially. But it won’t be zero”. He’s already backed off from his threat to fire Federal Reserve chair Jerome Powell. For now, his department of Homeland Security has also paused the campaign to deport foreign students. Altogether, some would say, Trump isn’t looking like the strong and decisive leader his MAGA voters wanted. Yet, flexibility might be his greatest strength. After all, he was elected to deliver, not sink under the weight of his bluster.\nIf tariffs are backfiring, there’s no point persisting with them while American firms and consumers suffer. Brexit, for instance, was a huge mistake – UK’s per capita GDP has risen just 4% over the 2016 level, as against 8% across the eurozone – but the country’s been too proud to change course. Trump is smarter that way, and other leaders shouldn’t become hostage to their own rhetoric either. While Indian leaders spoke hot words after Pahalgam, and rightly so, India’s actions should be governed by cold self-interest. Unlike Pakistan, India has a global stature and a promising future. There’s no point in jeopardising both with rash actions.\n\n",
        "headline_1": "It pays to pivot",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/it-pays-to-pivot/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-04-2025"
    },
    {
        "full_article": "Only a kinetic response from India will raise the cost of backing terrorism\nA lush meadow in Pahalgam was soaked in innocent blood this week, marking the most painful terrorist blow to India since 2008. As investigators confirmed Pak’s role in the massacre, 22/4 became another grim reminder that its western neighbour remains India’s primary adversary.\n\nStrategic neglect is not an option.\nRead the full story on TOI+.\n\n",
        "headline_1": "Why Pak army must now feel the heat",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/why-pak-army-must-now-feel-the-heat/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-04-2025"
    },
    {
        "full_article": "Yet another young life has been lost because of society's failure to protect women and girls. A college student, who had been gang-raped six weeks ago, was found dead at her parents' home in Dhaka on Saturday night. Police suspect that the girl—daughter of a martyr of the July-August uprising—died by suicide. Reportedly, she had been raped by two men in Patuakhali's Dumki upazila on March 18 when she was returning to her maternal grandparents' home after visiting her father's grave. A case was later filed, and the accused were arrested. However, they had allegedly also taken photos of the victim and threatened to post them online if she reported the incident, according to the case file.\nProthom Alo reported that following her death, the girl's family filed an unnatural death case with the Adabor police station in Dhaka, quoting a police source who said they would investigate whether she had received threats from the alleged perpetrators. According to a report in this daily, the incident had left the girl deeply traumatised and she had been undergoing treatment. But is counselling enough when society at large constantly points fingers at rape survivors?\nIt is this very attitude—the deeply entrenched misogyny—that gives criminals the power to use rape and sexual violence as a weapon. How else can we explain the 105 gang rapes recorded last year and the 64 in just the first three months of this year (according to Ain o Salish Kendra)? Among the survivors of rape or gang rape, seven died by suicide in 2024, while two deaths by suicide were recorded between January and March. What's worse is that the majority of the victims are girls under 18.\nWe can blame our justice system—the slow legal process, the extremely low rape conviction rate, or the state's failure to provide comprehensive and free legal, medical, and psychological support—for the situation. But an unspoken truth remains: we, as a society, have failed to teach our men to respect women and see them as human beings, not commodities, not objects on which they can exercise power at will. As parents, we have failed to instil the right values in our sons, while simultaneously creating an environment where our daughters feel ashamed of their very existence.\nWhile we hope the government takes appropriate measures to ensure that the Patuakhali victim's family gets justice swiftly, it must do much more for the millions of girls who do not feel safe or respected enough as human beings. Patriarchy must be fought and toxic masculinity uprooted through mass campaigns, education, and proper enforcement of laws to prevent misogynistic content and behaviour online, in social settings, and in religious sermons. Unless men learn to see women as equals, which they are, we will continue to lose precious lives like that of this college girl.\n",
        "headline_1": "Laws alone cannot save women from sexual violence ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/laws-alone-cannot-save-women-sexual-violence-3881461",
        "news_paper_name": "The Daily Star",
        "publish_date": "28-04-2025"
    },
    {
        "full_article": "The writing of history in the Bengali language by a Bengali began around 225 years ago with the publication of Raja Pratapaditya Charitra in 1801. The book was printed by the Serampore Mission Press, under the commission of Fort William College, which had been established just a year earlier, in 1800, by Governor General Lord Wellesley. That same year, the founding of the Serampore Mission Press ushered in a new era of book printing in Bengal. Raja Pratapaditya Charitra was authored by Munshi Ramram Basu (1757–1813), a native scholar at Fort William College, and commissioned by William Carey (1761–1834), who headed the newly founded Bengali department. The book holds both historical importance and literary significance, as it was the first Bengali prose work written by a Bengali and the first Western-style historical narrative in Bengali.\nSajani Kanta Das mentioned that Ramram Basu wrote this book just two months after being assigned the task. What drove him was sheer courage, as he had no prior model of Bengali prose or historical writing in the language to guide him.\nThe book narrates the story of Raja Pratapaditya, a sixteenth-century ruler of Jessore who lived in the Mughal era. Nearly two centuries later, it was adopted as a textbook at Fort William College to help students—who were being trained for administrative roles under the British East India Company—learn the local history and vernacular of Bengal.\nThe Time of Ramram Basu\n\nWho was Ramram Basu, the first Bengali historian of the colonial era, who introduced the practice of writing history in the Western manner—though he initially relied more on intuition? Despite being a relatively obscure figure during his lifetime, with little known about his family background, his work had a lasting impact: it helped shift historical writing in India from an intuitive to an institutionalized form. His greatest strength was his command over languages. Missionaries noted that he spoke English fluently, had a strong grasp of Persian, and wrote Bengali with remarkable finesse. He was not only an insightful prose writer but, before that, he excelled in satire, with his poetry marked by sharp intellectual intensity.\nBorn in 1757 at Chunchura, in the Hooghly district, Ramram Basu learned Bangla and Persian to make a living. Later, when he came into contact with several Englishmen, for whom he worked as a Persian munshi and scribe, he also learned spoken English. In 1787, he was appointed as a Bengali teacher to the missionary John Thomas. Ramram accompanied Thomas to Malda, where he began teaching him Bengali. At that time, Thomas believed that many native people would eventually be converted to Christianity.\nIn 1793, William Carey—the renowned Baptist missionary and orientalist scholar, who had once been a shoemaker—arrived in Kolkata upon learning about the 'heathens' he sought to 'emancipate' from 'eternal fire.' He was accompanied by his family and another Baptist missionary named John Thomas. Almost immediately, Carey began learning Bangla and engaged Ramram Basu as his teacher with a salary of twenty rupees. With Basu's help, Carey later began translating the Bible into Bangla.\nRamram Basu's devotion and knowledge of Christianity, particularly his devotional poetry on Jesus, strengthened Thomas's firm belief that the mission was on the right path. At Carey's request, Ramram Basu wrote in praise of Christianity and against Hindu idolatry, leading both Carey and Thomas to believe that he would eventually embrace Christianity. However, this did not happen.\nIn 1796, an incident occurred in which Ramram had secretly become infatuated with a young widow, and when her child was found dead, Carey regarded it as a serious lapse in Ramram's moral integrity.\nHe was not heard from for several years after that. In 1800, Carey came to Serampore and met many people, including Ramram Basu. He was reappointed, as Carey recognized that preaching was not possible without the help of such a talented person as Ramram. Later, Carey was appointed as the principal of the Bengali department at Fort William College, where Ramram Basu was employed under him with a salary of 40 rupees.\nFor his work on Pratapaditya Charitra, he received 300 Taka from Fort William College. Before Pratapaditya Charitra, two of Ramram Basu's books, written in a poetic style, were published from Serampore in 1800 and 1801. Additionally, he assisted William Carey in refining the Bengali translation of the Bible. Ramram Basu passed away in 1813.\n\nThe reception of Raja Pratapaditya Charitra by later formal historians has been intriguing—not only for its pioneering role in historical writing but also for its own historical merits.\nThere is an assumption that Ramram Basu was familiar with Rammohan Roy, the pioneer of the Bengali Renaissance, as Basu was inspired by Roy's anti-idolatry writings. It is also believed that Ramram Basu sought help in finalizing the manuscript of Pratapaditya Charitra from Roy. However, both Brajendranath Bandyopadhyay and Sajani Kanta Das refuted this claim, pointing out that Roy's Bengali prose works only began to be published after 1815. Notably, his first book, written in Persian, was published in 1803–4.\nStories of Raja Pratapaditya Charitra\n\nPratapaditya was one of the foremost landowners among the 12 famous landowners known as the Bara Bhuyans of Bengal, with Isa Khan being the most prominent among them. Ramram Basu narrated the history of Pratapaditya chronologically, relying on what he found in previous Persian texts and oral traditions from his family about the 16th-century king, as they belonged to the same caste. In doing so, he blended both fact and fiction, with his writing reflecting both objective and subjective positions.\nThe story starts with Ramchandra, a Kayastha from East Bengal, who left his ancestral home in search of fortune and settled in Saptagram, where he found work in the tax collector's office. He had three sons—Bhabananda, Gunananda, and Sibananda—of whom Sibananda was the most promising.\nFor a time, the family lived together harmoniously. However, when Sibananda had a disagreement with a senior officer, they were compelled to relocate to Gaur. There, they were warmly received by King Solaiman, who granted them permission to settle.\nAmong the brothers, Sibananda, being the most astute, distinguished himself and gained special favor from the king. His two nephews formed a close friendship with Bajid and Daud, the nephews of Solaiman. Daud, in turn, promised to make them his ministers if he ascended the throne. Following his father's death, Bajid became king but was soon assassinated by Solaiman's son-in-law. However, the assassin was later slain by a loyal friend of Daud, who then ascended the throne.\nThis Daud was none other than the famous Daud Khan Karrani, the last independent Sultan of Bengal. Keeping his promise, he conferred the titles of Maharaja Vikramaditya and Raja Basanta Ray upon Srihari and Janakiballabha, the nephews of Sibananda.\nHowever, Daud soon grew ambitious and refused to pay tribute to the Mughal emperor Akbar. Realizing that the emperor would take punitive action against Daud, the brothers wisely decided that remaining in Gaur would be too dangerous. They, therefore, built a permanent residence in what was then the remote maritime wilderness of Jessore and developed it around 1573.\nIn response to Daud's defiance, Akbar dispatched his general, Todar Mal, to subdue him. Terrified, Daud attempted to flee but was eventually captured and executed in 1576. Following his death, the Mughal general entrusted Srihari and Janakiballabha with governing the region.\nAnticipating an invasion, Daud had previously sent his wealth and a significant stockpile of food to Jessore. As a result, after his execution, the two brothers became extremely wealthy and powerful. They were crowned with great pomp and splendor, inviting all their relatives, granting them land, and settling them in the area—thus marking the origin of the Bangiya Kayastha Samaj of eastern Bengal.\nSrihari had a son named Pratapaditya, who, from an early age, displayed traits of cruelty and an insatiable thirst for power. To keep him at a distance and instill discipline, Srihari sent him to Delhi to be trained in state affairs.\nIn Delhi, Pratapaditya impressed Emperor Akbar with his talent for extempore poetry. However, he also schemed against his father, distorting facts to such an extent that the emperor ultimately granted him the authority to govern his father's domain.\nDespite this betrayal, Srihari and his brother welcomed Pratapaditya back without outward resentment, seemingly untroubled by the humiliation he had caused them in the emperor's eyes.\nA few months later, Pratapaditya relocated his capital to Dhumghat, transforming it into a grand city with magnificent mansions, a massive fort, and bustling marketplaces. In 1604, he ceased sending taxes to Delhi and became virtually independent. He significantly strengthened his naval power and was regarded as the last king of Sagur Island, even minting coins in his name.\nThough Pratapaditya possessed admirable qualities, his flaws were equally pronounced. He was known for his generosity, but he was also ambitious, ruthless, arrogant, and intolerant. He built a formidable army and refused to pay tribute to the Mughal emperor. Driven by his thirst for power, he conspired against his own relatives and sought to suppress the kings who ruled estates in the province.\nNews of his treachery reached Delhi, enraging Emperor Jahangir. After a prolonged and sporadic series of battles, Pratapaditya ultimately surrendered. He died in Banaras while being taken to Delhi in 1606.\nFollowing his downfall, the emperor appointed Raghab Ray, the eldest son of Basanta Ray, as the new ruler. However, when Raghab Ray returned to Jessore from Delhi, he found the once-glorious city devastated and desolate and maintained the Jessore Samaj.\nSignificantly, Ramram Basu's account of the death of Pratapaditya greatly varies from the depiction by the poet Bharatchandra Ray (1712–1760) in his Annadamangal, who was a closer contemporary of Pratapaditya. Although Basu did not specify the exact time and date of the events, later editors painstakingly added approximate dates based on the details he narrated in his book.\nReception as a Literary Text\n\nGhulam Murshid noted that while Ramram Basu's contemporaries in Bengali literature were primarily Sanskrit scholars who wrote in a Sanskritized style, Ramram's prose reflected his inclination toward Persian. The early reception of Raja Pratapaditya Charitra, however, was mixed, with many initial reactions being particularly negative. For instance, a review in the Calcutta Review (1854) criticized its style, describing it as a \"kind of mosaic, half Persian, half Bengali.\" Similarly, Ramgati Nyayaratna, who wrote the first known history of Bengali literature, condemned Ramram Basu's indiscriminate use of Persian and Arabic words.\nShishir Kumar Das refuted these criticisms by providing a quantitative analysis of Pratapaditya Charitra. He calculated that the total number of Persian and Arabic words was 218, appearing 511 times within a text of approximately 14,976 words. The percentage of Persian words was only 3.4%, contradicting claims that Pratapaditya Charitra was heavily Persianized or linguistically unbalanced, as alleged in the Calcutta Review.\nThere is a common assumption that Fort William College's endeavor in the Bengali language aimed to sanitize it by removing Arabic and Persian influences, relying solely on Sanskrit under the guidance of its missionaries and pundits. However, Raja Pratapaditya Charitra contradicts this claim, as it contains numerous Arabic and Persian words. These words were likely colloquial at the time or commonly used in bureaucratic and administrative contexts. Ramram Basu incorporated these elements naturally, as Persian remained the official state language of India until 1835. That year, the English Education Act, introduced by Governor-General Lord William Bentinck, replaced Persian with English. Additionally, Fort William College also lost its significance when Haileybury College in England was established in 1806 for the newly recruited cadets of the Company.\nSukumar Sen highlighted that the emergence of prose style in Bengali literature marked the beginning of the modern age, as premodern Bengali literature was predominantly in poetic forms. He also stated that the early 19th century was a period when literary works were primarily instructive—designed to teach new ideas, informative in presenting new forms of thought, or discursive in justifying or rejecting different creeds. This transformation was significantly influenced by Christian missionaries and professors at Fort William College. Pratapaditya Charitra embodies both instructive and informative genres in this regard.\nMoreover, the character of Pratapaditya gained significant importance, and numerous biographies and works of fiction were written about him. He became a figure of both admiration and controversy in nineteenth-century Bengal, particularly as the nationalist movement gained momentum. As a result, Clinton B. Seely characterizes Raja Pratapaditya as a \"problematic hero.\"\nThe Legacy as a Historical Text\n\nBoth the sixteenth century, when Pratapaditya ruled, and the early nineteenth century, when the book was written, were pivotal periods for Bengal and India, marked by significant societal and political transitions. Moreover, the book played a pioneering role in the writing of history in Bengali, laying the foundation for future historical literature in the language.\nAlthough Ramram Basu didn't explicitly mention that he was writing history in this book, he stated that he undertook the task due to the lack of a detailed account of the rise and fall of any kings in the region. Significantly, his employer, Carey, was quick to identify Basu's work as \"history,\" as he wrote, \"I got Ram Boshu [Ramram Basu] to compose a history of one of their kings.\"\nRamram Basu did not attempt to write a comprehensive history of India or Bengal in a chronological manner, as Mritunjay Bidyalankar did in Rajaboli (1807), a Bengali work from the same Fort William enterprise. Instead, he focused on the local but significant figure of King Pratapaditya, with whom he felt an affinity due to their shared Kayastha lineage within Bengal's Hindu caste system. Later, historical writings on both local rulers, such as Krishna Chandra, the king of Krishnanagar, and detailed chronological narratives of regions gained popularity, emerging from both the college's initiatives and private efforts, which would become increasingly significant over time.\nThe reception of Pratapaditya Charitra by later formal historians has been intriguing—not only for its pioneering role in historical writing but also for its own historical merits. For instance, Jadunath Sarkar found the first part of Pratapaditya Charitra to be entirely historical, while other historians regard the book as a valuable sourcebook, as Ramram Basu blended both fact and fiction in his narrative. While Ranajit Guha, one of India's foremost historians, noted that Ramram Basu's narrative occasionally lapses into myth and fantasy, many historians agree that this flaw—almost unavoidable under the circumstances—has done little to undermine the overall authenticity of the work as an exercise in modern, rationalist historiography.\nThe Indian subcontinent was regarded as a historyless and stateless society, where the absence of prose writing in vernacular languages was seen as a sign of underdevelopment. From this perspective, Raja Pratapaditya Charitra stands as a monumental endeavor, both in terms of writing history and fostering prose in the Bengali language. While it may have initially appeared as part of a colonial project, patronized by colonial institutions and figures, it soon evolved into a distinctly native enterprise. What began as a form of local history writing ultimately became an integral part of global history.\nPriyam Pritim Paul is a researcher and journalist.\n",
        "headline_1": "Raja Pratapaditya Charitra and the Birth of Bengali History Writing",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/focus/news/raja-pratapaditya-charitra-and-the-birth-bengali-history-writing-3881671",
        "news_paper_name": "The Daily Star",
        "publish_date": "28-04-2025"
    },
    {
        "full_article": "Eduardo Galeano once wrote that football is a \"sad, beautiful game,\" a paradox that Liverpool's 2024-25 season embodies. Anfield remains a temple, but its hymns now echo under a new conductor: Arne Slot, the Dutch tactician who stepped into Jürgen Klopp's titanic shadow. The Kop's liturgy of hope has not dimmed; instead, it has evolved. Slot, a philosopher of gegenpressing with a Calvinist calm, has turned doubters into believers once more. His Liverpool is a symphony of chaos and control, a team that dances on the edge of Galeano's \"sun and shadow.\"\nPope Francis, the Argentine pontiff who had once called football a \"school of life,\" would've nodded at this resurrection. In Slot's first season, Liverpool have fused discipline with delirium, their 79 points (24 wins, 7 draws, 2 losses) a testament to collective faith. \"No one saves themselves alone,\" Francis would insist, and Liverpool's 75 goals—scored by 15 different players—prove it.\nThirty years? No, a new exodus\n\nGaleano lamented football's \"mechanical\" modern age, but Liverpool's 2025 campaign is anything but sterile. Though Klopp's exit left a void, Slot has rewritten the script. The Reds lead the Premier League by 13 points, their +44 goal difference a thunderclap of dominance. Mohamed Salah, now 32 but ageless, has 27 league goals and 18 assists, breaking his own record for goal involvements in a 38-game season.\nYet, shadows linger. The League Cup final loss to Newcastle and FA Cup shock at Plymouth Argyle are Galeano's \"useless beauty\" in reverse—moments where the ball \"crossed the line of dreams but not the pitch.\" Even so, Slot's men march on, their league form a rebuke to doubt.\nThe theology of Slot's gegenpressing\nKlopp's gegenpressing was a revolution; Slot's is a reformation. Virgil van Dijk, the high priest of defence, anchors a backline that has conceded just 31 goals. Trent Alexander-Arnold, now vice-captain, conducts play with 86 career assists, his crosses akin to papal encyclicals—authoritative, precise, transformative.\nUp front, Salah's trinity with Luis Díaz (15 goals) and Cody Gakpo (16 goals) embodies Francis' belief that \"a goal is a collective act.\" Even Alisson, the goalkeeper who scored a header last season, has become a symbol of Slot's audacity. His 95th-minute winner against West Brom in April 2024 feels like a prophecy fulfilled.\nShadows and light: The people's game\nGaleano's \"tribe of believers\" still roars. Anfield's average attendance of 60,322—including a 60,420-strong chorus against Ipswich—proves football's enduring magic. The Kop's scarves now wave for Slot, but their hymns honour the same saints: Shankly's socialism, Dalglish's grace, and Gerrard's near-misses.\nYet, modernity intrudes. The 25-million-pound signing of Valencia's Giorgi Mamardashvili for 2025-26 hints at football's capitalist engines, a tension Galeano decried. Still, Slot's bargain capture of Federico Chiesa (10 million pounds) and Jayden Danns' rise from the academy offer hope. \"The ball can be a tool of peace,\" Francis reminded us, and Liverpool's blend of thrift and youth answers his call.\nThe final stride: A pilgrimage to glory\nAs of April 22, 2025, Liverpool need just four points from their final five matches (Spurs, Chelsea, Arsenal, Brighton, Crystal Palace) to seal the title. Their 5-0 demolition of West Ham in December and 2-1 comeback at Fulham in April are already folklore .\nGaleano might call this a \"revolution\"; Francis, a \"pilgrimage.\" For Slot, it is simply logic. His side has lost only twice in 33 league games, their resilience forged in fires like the 3-6 thriller at Spurs and 2-2 stalemate at Arsenal.\nA game for the angels (and the Anfield faithful)\n\nWhen the final whistle blows, Liverpool's resurrection will be complete. Salah's new contract, Van Dijk's renewal, and Slot's serene touchline presence signal a dynasty reborn. Galeano's angels, playing their flawless heavenly football, might envy this mortal joy—the sweat, the slips, the scars.\nAnd Pope Francis, watching from the heavens, would surely whisper, \"Let it stay wild. Let it belong to the people.\"\nKey updates\nManager: Arne Slot's debut season, post-Klopp era\nStandings: Liverpool lead with 79 points, 13 clear of Arsenal\nTop scorer: Mohamed Salah (32 goals in all comps, 27 in PL) \nCrucial matches: Remaining fixtures vs Spurs, Chelsea, Arsenal\nSquad evolution: Chiesa's arrival, youth integration (Danns, Quansah)\nZakir Kibria is a writer and policy analyst. He can be reached at [email protected].\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "The symphony of grass and grace: Liverpool’s resurrection under a new maestro",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-symphony-grass-and-grace-liverpools-resurrection-under-new-maestro-3881281",
        "news_paper_name": "The Daily Star",
        "publish_date": "28-04-2025"
    },
    {
        "full_article": "A new World Bank report has rightly sounded the alarm about a potential rise in poverty and inequality in Bangladesh—warnings that policymakers can ill afford to ignore. According to the report, persistent inflation, job losses, and a slowing economy may further erode household welfare, intensifying our already pressing economic challenges.\nThe national poverty rate is projected to rise to 22.9 percent in 2025, up from 18.7 percent in 2022. Meanwhile, the share of people living in extreme poverty—defined as those earning less than $2.15 a day—is expected to nearly double to 9.3 percent, pushing an additional three million people into this category. In the latter half of 2024 alone, nearly 4 percent of workers reportedly lost their jobs, while wages declined by 2 percent for low-skilled workers and by 0.5 percent for high-skilled workers. The labour market, in short, is showing clear signs of distress. Notably, the labour force participation rate has dropped from 60.9 percent to 59.2 percent, driven largely by a sharp decline in female participation, from 41.6 percent to 38.9 percent.\nExacerbating the crisis is the prolonged spell of high food inflation, a key driver of poverty that has continued to squeeze household budgets. Real wages have been in decline for over 40 months now, as nominal wage growth consistently lags behind soaring prices. The Gini index, a key measure of income inequality, is also projected to rise from 33.4 in 2022 to 36.1 in 2025, with experts pointing to the weak and informal nature of the labour market as a primary cause.\nA lack of quality employment opportunities has left a vast segment of the population engaged in low-productivity, self-employed work, with limited earning potential. What makes this situation even more troubling is that GDP growth has been slowing in recent years—driven by falling investment, policy uncertainty, high borrowing costs, and political unrest—resulting in fewer jobs and lower confidence in the economy. In light of these trends, it is imperative that policymakers, political parties, and other stakeholders come together and take decisive steps to reduce uncertainty and improve the investment climate.\nTo this end, it is crucial to undertake necessary structural reforms urgently. This includes urgent banking and fiscal reforms aimed at restoring investor confidence and accelerating economic recovery. Frequent policy shifts and uncertainties that deter businesses from investing and expanding must also be addressed head-on. The government, in consultation with political parties, must also provide clarity on the timing of the next elections and work towards a consensus that reassures both domestic and foreign investors that Bangladesh will not remain trapped in political uncertainty indefinitely.\n",
        "headline_1": "Rising economic risks demand better interventions ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/rising-economic-risks-demand-better-interventions-3879771",
        "news_paper_name": "The Daily Star",
        "publish_date": "28-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 28, 2025 00:00:00  \nGrowing natural disaster risks driven by climate change continue to pose serious threats to the lives, livelihoods, and properties of Bangladesh's coastal communities. For these vulnerable people, life is a constant struggle against natural calamities such as cyclones, storm surges, rising sea levels and floods. After each disaster, they rebuild their homes - often constructed from bamboo, mud, and corrugated tin - only to see them destroyed again by the next onslaught. In the context of this relentless cycle of destruction and rebuilding, a recent roundtable discussion---one that was supported by CARE Bangladesh and AOSED ---held in Khulna, rightly emphasised the urgent need for integrating climate finance and establishing robust insurance mechanisms, specifically tailored to protect these frontline communities.\nDisaster insurance could play a critical role in cushioning the losses coastal communities face, safeguarding their homes, crops, and livelihoods. Yet, in a country where general insurance coverage remains limited, introducing disaster insurance might seem like an outlandish idea. The primary barrier is cost - especially in coastal regions where widespread poverty allows few to qualify for even basic insurance. Ironically, it is precisely those who are the least able to afford coverage need it the most, as they often lack the savings necessary for recovery.\nRecognising this, speakers at the Khulna seminar proposed that the financial burden of disaster insurance should not fall on the already struggling communities, but instead, be borne by the world's major climate-polluting nations. They advocated for the government to take the lead in formulating a climate-specific insurance policy for poor, vulnerable populations, with funding sourced from international grants, including the Loss and Damage Fund, the Green Climate Fund, and the Adaptation Fund. Such a grant-based insurance scheme could fully or partially cover insurance premiums, providing coastal communities with a critical safety net against financial ruin in the aftermath of disasters.\nThere is an urgent need to invest in improved homes and disaster-resilient infrastructure to reduce long-term vulnerability. Bangladesh could draw lessons from India's experience in Odisha, a cyclone-prone state where millions kutcha houses made of mud and thatch have been replaced with of pucca houses under a massive government-sponsored housing project. These stronger houses have not only reduced damage but also saved countless lives during severe storms. In contrast, many coastal residents in Bangladesh remain trapped in a vicious cycle of damage and repair, rebuilding fragile homes after each disaster. It is time to promote disaster-resilient buildings in coastal areas by incentivising risk reduction. At present, the meagre compensation that affected communities receive is barely enough to patch up their damaged homes. If coastal residents were supported in constructing disaster-resilient houses, they would be far better equipped to adapt to the growing intensity of extreme weather events.\nGiven the escalating risks, the government must step forward to introduce grant-based disaster insurance schemes and raise public awareness about them. At the same time, it is crucial to increase the financial autonomy and capacity of Union Parishads (UPs) to manage disaster-risk financing effectively. Strengthening local governance structures with adequate resources and training is essential to ensure efficient, transparent distribution of climate funds and successful implementation of a disaster insurance programme.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Insurance for coastal communities",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/insurance-for-coastal-communities-1745765197",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       April 28, 2025 00:00:00  \nShorter winter followed by prolonged summer marked by heatwaves with the level of mercury rising over 40 degrees centigrade has become a new normal. The congested cities like Dhaka with receding greenery and advancing concrete cover, are turning into veritable hellholes. The use of cooling devices to keep inside temperatures of buildings low is making matters worse. For the heat of the interior of the buildings now goes outside to heat up the overall environment of the cities further. Now to run the cooling devices you need power. To generate that power you have to burn fuel, which is the primary cause of global warming that has given rise to this phenomenon of heatwaves and rising temperatures in the first place. So, it is a vicious cycle we are trapped in. Worse yet, far from trying to find ways to break the cycle, measures are being taken only to maintain the status quo. By burning fossil fuel to generate power and keep the inside of the buildings of cities cool during hot summer, nothing is being ultimately gained. In fact, we are only continuing the policy of the West that gave rise to the climate change. Small wonder that, as a result, least developed countries like Bangladesh are being made to atone for the sin that the advanced industrial countries committed in the beginning. It is from the first industrial age when it all started. The ongoing heatwaves have definitely to do with the overall impacts of climate change. But are we really aware as a climate vulnerable nation that one climatic change-related phenomenon after another is increasing the challenge of adapting to it? \nLet us have an idea of how the subject of heat or temperature is gradually accumulating before us. A 2023 study, for instance, shows that between 1949 and 2013, temperature has risen in this part of the world at the rate of 0.13 degrees centigrade per decade. By 2050, this rate of temperature rise is predicted to be going up to 1.4 degrees centigrade. Looks like, it is a small amount. But when it comes to the amount of heat it can accumulate, that is huge. The heatwaves and the accompanying temperatures that we are now experiencing is the result of this ever rising rate of temperature. If 40 degrees centigrade and above is now normal. The indications are that things are getting worse. Scientists warn that it is not just the impacts of natural phenomena like El Nino that are behind the ever rising temperatures in recent years. In fact, human actions in the form of, for example, constructing high-rise buildings in great numbers and that, too, in an unplanned way are also a major factor to blame, scientists pointed out. The seasonal patterns have already changed fundamentally. A multinational research done in 2021, revealed that between 1950 and 2021, monsoon rainfalls in the months between May and October decreased. On the other hand, episodic rainfalls increased fourfold in Bangladesh. But alongside, increase in episodic rainfalls, we are also experiencing droughts. The duration of the droughts are getting longer, drying up natural water reservoirs. Here also human actions have a big role to play. But there are still far worse kinds of human actions that destroyed the forests and depleted natural reservoirs below the ground. Those are wars that humans have fought and have been fighting for control of natural resources including water. Though the possibility of water wars that was forecast in the 1970s did not after all take place on a predicted scale, there is no guarantee that such wars will not break out in the future. The main reason for such wars would be the control and diversion of the flow of natural water courses like rivers. Consider the recent faceoff between India and Pakistan, two nuclear nations with common border. Though initially, it was on the diplomatic level over a terrorist attack on tourists leading to around 26 or more deaths, it has now taken more serious turn with India's statement that it has suspended the Indus Waters Treaty. If the two neighbours will really come to deadly blows is a different issue, the point to consider here is that the upper riparian has chosen or has threatened to choose the most sensitive weapon, water, to punish its adversary. In fact, most rivers in the world being transboundary in nature, there is a great risk in the future that conflicts, even wars might break out over shared water resources. In such cases, responsibility will lie on the upper riparian nations in the case of the transboundary rivers to be more prudent about the issue. To be frank, whenever there is an option, humans will be prone to use it. Building water control structures to generate power or build dams on rivers to tame them as protection against floods or to divert their course to irrigate lands deprived of water was appreciated in the past when fewer people than now lived on earth. During those times Nature seemed to be abundant and even wild such as the mighty rivers like Padma, Meghna and Jumna in this region in particular. So, humans would then try to demonstrate their power over Nature by taming and harnessing it by various means. International lending agencies like the World Bank would then encourage nations to build dams to control floods, stop erosion or for diverting water to help irrigation. In this manner, most rivers of the world are now in chains. What was once a great boon to the people is now proving to be a bane of many. Meanwhile, the rivers have started to run dry either due to diversion of water by the upper riparian or for natural reasons. For countries with seacoasts like Bangladesh, it has turned further problematic. With the reduction of water flowing in the rivers, salinity increases in the coastal regions, depriving coastal people of sweet water to drink as well as to cultivate lands for agriculture. This calls for creating strong international arbitration mechanism so that countries sharing common rivers could get fair share of river waters whenever any dispute arises between co-riparian countries.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Is water war in the offing?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/is-water-war-in-the-offing-1745765244",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       April 28, 2025 00:00:00  \nThe embankment built to protect the Padma Bridge project area is under severe threat, according to a report carried in a contemporary. A two-kilometre segment of the embankment at Jajira point of Shariatpur has started experiencing river erosion. The river has become deeper closer to the Padma Bridge and at the same time the erosion is approaching the bridge. Given the treacherous nature of the river Padma, a hydro-meteorological disaster cannot be ruled out if measures are not taken immediately to protect the river-line embankment at that point. The problem of this river is particularly treacherous because of the fast shifting soil of its bed. This is exactly happening to one-kilometre segment of the embankment and the rest one kilometre length is actually experiencing erosion. \nThis is not the first time that alarm bell has been sounded. Months before another report came up with the danger posed to the embankment and the bridge. But the authorities failed to respond to the call the way it should have done. Following the landslide of 100 metre of the embankment at Naodoba zero point in November last year, the Bangladesh Water Development Board (BWDB) and the Bangladesh Bridge Authority (BBA) jointly carried out a study. The study found that the depth of the river along one-kilometre stretch is greater than in the surrounding areas. What was of particular concern is that the soil of the river bed continued to move away from that segment. The river moved closer to the other segment of one-kilometre length. Erosion happened there too. \nThe BWDB has undertaken repair works of the 100-metre embankment that gave in last year in November. The repair consists of putting in place sand-laden geo-textile (geo) bags and cement concrete (CC) blocks at a cost of Tk27 million. Isn't it too little too late? Tortuous and treacherous, the Padma cannot be restrained by such patch works. Even in the lean season, it can break through the defence of strong embankment. The least said about its power in the monsoon the better. \nAn extensive and comprehensive study was well in order to see if there was any error or defect when the river training was done. The bridge authority constructed an embankment two kilometres to the east in order to protect the project area of the Padma Bridge. After the river training, the bank-line embankment reportedly was aligned to the one constructed earlier. \nThis is somewhat confusing. Without river training, the feasibility of a bridge is questionable. When a bridge of the order on a mighty river like the Padma is concerned, not just river training but river engineering should be conducted meticulously beforehand to determine the vulnerability or not of the structure to river erosion or shifting of the channel. \nAny attempt to prevent erosion of the river by piling geo bags and cc blocks is most likely to prove a child's play. It is better to act on the basis of findings of river training and even river engineering. If needed, experts in hydro-meteorology from abroad can be hired to find out how grave the situation is and how it can be arrested sustainably. After all, this bridge has to be protected at any cost. \nEarly detection of any defect in the embankment will give better chance for obviating the threat effectively. There is also the need for analysing the anthropogenic impacts on the river. Sand extraction within the vicinity of the bridge was also reported a few times in the past. The bridge authority and the BWDB did not swing into action against the culprits to let such drives to act as a deterrent to the illegal and destructive practice. Before the worst happens, necessary remedial measures must be devised to save the bridge and the locality under threat.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Threat to Padma Bridge posed by river erosion",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/threat-to-padma-bridge-posed-by-river-erosion-1745765292",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 28, 2025 00:00:00  \nUrban farming is becoming a key solution to food security as cities grow. With more people moving to urban areas and less farmland available, urban agriculture offers a way for communities to grow fresh, local food right where they live. Innovative methods like vertical farming, hydroponics, and rooftop gardens make the most out of small spaces and reduce the environmental impact of traditional farming.\nUrban farms are great because they shorten the journey food takes from farm to plate, meaning we get fresher produce and reduce transportation emissions. They also encourage healthier eating and provide job opportunities for local communities. Urban farms help create more green spaces, improve air quality, and unite people to work towards common goals.\nStill, we need policymakers' support, infrastructure investment, and public awareness to make urban farming a significant part of our cities. Challenges to overcome include high startup costs, water use management, and zoning regulations. But by investing in urban agriculture, we can create more sustainable, food-secure cities that are healthier, greener, and more resilient for the future.\nSafwaanul Haque\nStudent\nBachelor of Business Administration\nNorth South University\nsafwaanul.haque@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Urban farming for food security",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/urban-farming-for-food-security-1745765315",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-04-2025"
    }
]