[
    {
        "full_article": "Tensions between Bangladesh’s interim government, led by Muhammad Yunus, and the military are no longer a secret. On Monday (May 26, 2025), an Army spokesperson publicly voiced opposition to the government’s proposal to open a “humanitarian corridor” to Myanmar’s conflict-torn Rakhine State, home to the persecuted Rohingya. The government’s plan is to supply medicines and other aid, but the military believes it would pose significant security challenges. Last week, Bangladesh army chief, Gen. Waker-Uz-Zaman, expressed concerns about several of the government’s initiatives, including the so-called humanitarian corridor, the potential foreign management of Chattogram Port, and the introduction of Starlink, Elon Musk’s satellite Internet service. He also urged the government to hold early elections for “a stable, elected government” that is capable of making decisions related to national security. Amid the growing rift, speculation swirled in Dhaka last week that Mr. Yunus might step down. Later, a Cabinet member said that Mr. Yunus “is staying with us”, but the Army’s subsequent press conference suggests that the cold war is far from over.When Mr. Yunus, backed by student groups, took over as the ‘Chief Adviser’ of the interim government on August 8, 2024, three days after the fall of the Hasina administration, he promised to lead Bangladesh into a new dawn of democracy from the semi-authoritarian years of the Awami League. But nine months on, he is still struggling to stabilise the country and rein in the mobs. The government’s crackdown on the Awami League, one of Bangladesh’s largest political parties, has further eroded hopes for inclusive elections. Most of the party’s senior leaders are either in exile or in hiding, while hundreds of party workers have been killed. Earlier this month, the interim government officially banned the Awami League, yielding to pressure from the student leaders and Islamist factions. Mr. Yunus and his allies, including the National Citizen Party, established by student leaders after Ms. Hasina’s fall, claim that elections can be held only by mid-next year, citing the need for electoral and political reforms. But the continued delay has sparked protests by the Bangladesh Nationalist Party and drawn public criticism from the military. By postponing the elections, suppressing the Awami League, using both state and non-state tools, and failing to restrain the mobs, Mr. Yunus, an unelected leader, is steering Bangladesh into deepening chaos and uncertainty. What Bangladesh urgently needs is a stable, legitimate government with a clear popular mandate. The interim government and all relevant stakeholders must prioritise holding inclusive, free and fair elections, at the earliest possible opportunity, ensuring the participation of all political factions.\r Published - May 28, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Bangladesh\n                    \n                            /                      \n                        \n                        armed Forces\n                    \n                            /                      \n                        \n                        Myanmar\n                    \n                            /                      \n                        \n                        Rohingya crisis\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        democracy",
        "headline_1": "​Reign of chaos: On Bangladesh’s inner tensions",
        "headline_2": "Yunus is pushing Bangladesh to the brink of instability",
        "link": "https://www.thehindu.com/opinion/editorial/reign-of-chaos-on-bangladeshs-inner-tensions/article69625506.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-05-2025"
    },
    {
        "full_article": "Despite robust growth in electricity generation over the past two decades, with rapid additions of renewable energy in the past five years, India has been unable to meet its peak power demand, with the deficit widening from 0.69% in FY20 to about 5% in FY24. This reveals constraints in the supply of power — new power production is time consuming, especially if fossil-fuel based, even as India attempts to integrate renewable power into the power grid. Therefore, India must focus on enhancing energy efficiency holistically to reduce power demand, also the quickest and least expensive way to address rising power demand and climate change. This year marks a decade of India’s groundbreaking energy efficiency scheme, UJALA, which has helped bring down the price of energy efficient light emitting diode (LED) bulbs from about ₹500 a decade ago to ₹70, enabling its widespread home use. The scheme succeeded as another public energy efficiency measure was baked into the initiative — the Street Lighting National Programme, which led to the installation of over 1.34 crore LED lamps across urban local bodies and gram panchayats, and reducing peak demand by over 1,500 MW. As of January 2025, the government has distributed about 37 crore LED bulbs and enabled the sale of about 407 crore more.LED bulbs consume half the amount of power of compact fluorescent lamps, while incandescent light bulbs require nine times the power that LEDs consume, translating into considerable cost savings for Indian homes. But estimates also suggest that the UJALA scheme alone has helped India save over $10 billion and avoided building over 9,500 MW of new generation capacity, which is the equivalent of 19 new coal-fired 500 MW power plants. Indeed, there are other energy efficiency measures that India has taken following the enactment of the Energy Conservation Act, 2001. The International Energy Agency states that between 2000 and 2018, energy efficiency improvements enabled India to avoid an additional 15% of energy demand and 300Mt of CO₂ emissions. But with India’s rapid urbanisation in the past two decades and rising per capita energy consumption to meet cooling needs as summers get hotter, peak power demand reached 250 GW last year. India is today the third largest power consumer globally, after China and the United States. Moreover, 70% of its energy output continues to be from coal and India has plans to add another 90 GW of coal-based capacity by 2032. What is needed now is greater energy efficiency mandates across sectors such as buildings, home appliances and the country’s sprawling MSMEs. Published - May 28, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        electricity production and distribution\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        energy saving\n                    \n                            /                      \n                        \n                        energy and resource\n                    \n                            /                      \n                        \n                        local authority\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        USA",
        "headline_1": "Energy and efficiency: On India and greater energy efficiency mandates",
        "headline_2": "India must reduce its power consumption by increasing efficiency",
        "link": "https://www.thehindu.com/opinion/editorial/energy-and-efficiency-on-india-and-greater-energy-efficiency-mandates/article69625210.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-05-2025"
    },
    {
        "full_article": "Why every Indian city watched with alarm, as a new underground station in Mumbai flooded\nThere is stuff one can accept in disaster movies, which one never, ever expects to encounter in real life. What happened to the Acharya Atre Chowk metro station in Mumbai on Monday felt all the more worse because it had been inaugurated just 15 days earlier. This station and the entirety of its Aqua line metro corridor is underground. In Delhi, underground stations provide shelter from intense rain. At this Worli station, the rain gushed in forcefully, people fled the platforms, the metro followed suit. MMRC says it’s because a water-retaining wall collapsed. That’s poor excuse for a Rs 37,000 crore shiny new project.\nAs Indian cities grapple with the pain of urban flooding, this is a reminder that throwing money at it will not suffice. What good does it do to citizens to be told that India is becoming the 4th largest economy in the world, when their lived realities don’t feel like it is even ranked 40th? What help are pricey infraworks when these are badly engineered? In many ways, things seem to be getting worse. It feels like a grandma’s tale that cities used to greet the rains with hurrahs. Now, Gurgaon to Chennai, everyone dreads roads washing away, garbage wading in. Because well into the 21st century, our stormwater drains are still used as dustbins.\nBuilding Mumbai’s underground metro has involved resetting the earlier drainage system. What we need to know is whether this has been done properly. This is where MMRC must be required to provide detailed data. Especially as several SoBo localities now experience waterlogging like they never have. Worli includes some of the world’s priciest real estate. Whitefield boasts the poshest villas in Bengaluru. It’s strange that nothing changes even after these get flooded. Years of delay in municipal elections is also strange. Meanwhile, massive financial outlays roll on. Potholes are found, remetalled, refound, in a loop. It’s as if politics has less incentive to help the city than hurt it.\nThat our metropolises were never planned to accommodate the millions they now do – with more on the way – was a credible defence once upon a time. With today’s tech tools and economic heft, India has no excuse for not doing right by its citywallahs. Mistakes now have to be named and shamed and righted. Flooded images of Mantralaya, Brabourne stadium and KEM hospital speak to everything being at stake in saving hydrological commonsense from drowning.\n\n",
        "headline_1": "Urban Aquagmire",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/urban-aquagmire/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-05-2025"
    },
    {
        "full_article": "Trump’s approach to Russia’s boss is strange, and in contrast to his tirades against other world leaders\nTrump says he’s running out of patience with Putin. Massive Russian aerial attacks on Ukraine over the weekend killed 12 people and injured 79. Trump, naturally, vented on Truth Social: something had happened to Putin and “He has gone absolutely CRAZY!”. Trump even held out a threat: “I’ve always said that he (Putin) wants ALL of Ukraine, not just a piece of it, and maybe that’s proving to be right, but if he does, it will lead to the downfall of Russia!”\nIt’s difficult to say whether Trump will actually follow through on promised crippling sanctions against Russia. He has a history of flip-flops when it comes to Putin. Since at least 2013, Trump has at various points touted his admiration for the Russian leader’s so-called toughness and wit. For example, in Nov 2013, Trump told MSNBC “I do have a relationship and I can tell you that he’s (Putin’s) very interested in what we’re doing here today.” In March 2015 he told Daily Mail, “The relationship (with Putin) is great, and it would be great if I had the position I should have.”\nIn Jan 2017, during his first presidency, Trump saw a friendly relationship with Putin as an asset, saying, “If Putin likes Donald Trump, I consider that an asset, not a liability.” To be fair, Trump has also said, again inconsistently, that Russia is a geopolitical foe. Like in March 2014 when he said Mitt Romney was right that Russia is US’s biggest problem. But there’s a clear difference between how he refers to Putin – carefully – and other world leaders who get the full Trump treatment. Consider the recent tongue-lashing that South Africa’s Cyril Ramaphosa got at the White House. Which begs the question: Why the kid-glove treatment for Putin? Trump said he would end the Ukraine war in 24 hours. He’s been tough on Zelenskyy. But what’s the deal with taking on Putin?\n\n",
        "headline_1": "Keeps Putin It Off",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/keeps-putin-it-off/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-05-2025"
    },
    {
        "full_article": "Just a few weeks ago, a brand-new underground metro station opened in Mumbai. It was part of the Aqua Line and was supposed to make travel easier for lots of people. But then something really unexpected happened — it flooded. And not just a little water. Heavy rain poured in, flooding the station and forcing people to run out. Even the metro trains had to stop.\nHow could this happen to a new station that cost thousands of crores to build? Officials said a special wall meant to hold back water broke. But many people didn’t find that to be a good enough reason. They were worried and angry — and not just in Mumbai. People in other cities, like Delhi, Bengaluru, and Chennai, were paying close attention. Why? Because flooding is a growing problem in cities all across India.\nThese floods are not just about heavy rain — they’re also about poor planning. Many Indian cities aren’t built to handle so much rain. And even today, drains are often clogged with garbage. That means the water has nowhere to go, and roads, homes, and even hospitals get flooded.\nWhen something like this happens, people wonder: If India is becoming one of the richest economies in the world, why do our cities feel like they’re falling apart?\nIn Mumbai, building the underground metro meant changing the old drainage system. But was it done properly? That’s a big question now. Some of the most expensive neighborhoods, like Worli, are getting waterlogged like never before. Yet, even after the rich areas flood, nothing seems to change.\nMeanwhile, roads keep getting potholes. The same ones get fixed and break again. And city elections, which could bring in leaders to fix things, keep getting delayed.\nA long time ago, people could say our cities weren’t ready for so many people. But now, with better technology and more money, we don’t really have that excuse anymore. It’s time for leaders to stop making promises and start fixing things properly. When important places like hospitals and government buildings are flooding, it shows that something very basic — like keeping the rainwater out — is going very wrong.\nIndia’s cities deserve better.\n\n",
        "headline_1": "When Rain Flooded a New Metro Station: What It Means for Indian Cities",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/when-rain-flooded-a-new-metro-station-what-it-means-for-indian-cities/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-05-2025"
    },
    {
        "full_article": "It might be spam, hoax, or fraud, but we’re always at our phones’ beck and call \nIf you’re reading this column, chances are that before you finish your cellphone will ring, demanding an immediate response. Should you answer or decline the call?\nThe caller is likely to be a property dealer wanting to interest you in a 2 BHK+SQ, in Outer Boonienagar, or an agent trying to sell you life insurance which should properly be called death insurance because it only kicks in after you’ve kicked the bucket, or someone offering to sell you a share in a gold mine in Rwanda, which will make you a crorepati overnight, so please give the caller the details of your bank account that will be cleaned out to the last paisa before you can say chhoomantar!\nWe are told repeatedly that phone fraud is one of the fastest-growing industries in India and internationally. There’s a huge workforce of phisherfolk who keep devising ingenious ways to hoodwink you into giving them your life’s savings by threatening to put you under digital arrest or some such scammy subterfuge.\nA cellphone service provider says that in one month alone it has detected and cautioned its customers about more than 27.5 billion suspected spam calls and over 500 million spam messages.\nAssuming that there are a million spammers, busy as workaholic bees, each one of them would have to make 27,500 calls per month, plus send out 500 messages. Which doesn’t leave much spare time for ancillary activities such as eating, sleeping, and the performance of ablutions.\nBut if the spammers show a remarkable work ethic in doing what they do, we the spammed are equally duty bound to answer the call of our phones with an alacrity greater even than when we answer what are known as calls of nature.\nWhen the phone calls, we are programmed to answer. Spam? Probably. But what if it’s in response to a job we’ve applied for, or a path lab result anxiously awaited, or a long lost friend trying to get in touch?\nSpam or not, our phone remains our master, the lord of the ring.\n\n",
        "headline_1": "Phoney business",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/phoney-business/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-05-2025"
    },
    {
        "full_article": "It is reassuring to see the conclusion of the first round of talks between the National Consensus Commission (NCC) and political parties over reforms meant to lay the groundwork for a more accountable and transparent system of governance. In a country where political deadlock is more common than consensus, the achievement of common ground across a wide spectrum of issues marks a departure worth noting. The first round—which covered 166 key reform proposals over 45 sessions—produced agreements in several major areas, but also disagreements in others, setting the stage for the second round of talks expected to begin within days. While this process goes on, the NCC plans to engage the Bangladesh Bureau of Statistics to conduct a survey to gather public feedback on key proposals and finalise a \"National Charter\" based on broader consensus by July.\nThanks to the structured and publicly accessible manner in which the discussions were held, we now know the areas where the parties agreed, partially agreed, or disagreed. For instance, all parties agreed to reinstate the non-partisan caretaker government system to oversee elections, but disputes remain over its formation, tenure, and the mechanism for appointing a chief adviser. Similarly, while there is support for a bicameral legislature and empowering the opposition through the deputy speaker's post, disagreements remain over how members of the proposed upper house should be elected. Another crucial sticking point is the proposal to limit the prime minister's authority—particularly preventing one from simultaneously holding the posts of PM, party chief, and leader of the House. Proposals to impose term limits on PM and reform the process of electing the president have also proven divisive. Sharp divisions remain over the proposed formation of a National Constitutional Council to oversee key appointments and uphold legal standards.\nThat said, the areas of consensus are significant in their own right. Parties have collectively endorsed vital judicial reforms, including the creation of a separate Supreme Court Secretariat, curbing executive control over judicial appointments, and introducing accountability mechanisms to discipline judges exhibiting political bias. There is also agreement on placing key parliamentary committees—such as those on public accounts, estimates, and government undertakings—under opposition control. On anti-corruption, all parties supported granting the Anti-Corruption Commission constitutional status, and ensuring its independence and accountability. Electoral reforms have also made notable progress. In public administration, there is strong support for automating public services, revising outdated laws such as the Official Secrets Act, and modernising the Right to Information Act.\nWhile full consensus on all unresolved issues is unlikely, as Prof Ali Riaz, co-chair of the NCC, has also acknowledged, we hope that political parties will engage sincerely in the remaining talks. Otherwise, the push for critical reforms may stall. At the same time, we must keep in mind the challenges of implementing reforms. The protests following the dissolution of the National Board of Revenue and the introduction of the Public Service (Amendment) Ordinance, 2025 show that real change will depend on our collective resolve to follow through despite the resistance these changes may provoke. All stakeholders must, therefore, rise above partisan or group interests, and act from a place of national responsibility.\n",
        "headline_1": "The reform drive must continue apace ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/the-reform-drive-must-continue-apace-3905136",
        "news_paper_name": "The Daily Star",
        "publish_date": "28-05-2025"
    },
    {
        "full_article": "Imagine a small village in a remote part of the world, where the nearest clean water source is miles away. Young children wake up at dawn every morning, walking miles with empty containers instead of books and pencils. These walks take hours, through harsh terrains, all to fetch water.\n\nLike many other regions of the world, in coastal Bangladesh, this imagination turns into harsh reality. Sahana Akhtar Rimi, a 13-year-old from Koyra, Khulna, recalls, \"Every day my mother fetches water while I care for my siblings. When my mother had to stay home to care for my sick father, I took on the responsibility. I was often late for school or even unable to attend. We often stood in long queues and sometimes returned empty-handed. Even at school, there was no safe drinking water. Without a safe source, my family used pond water, which made us sick with diarrhoea and dysentery.\"\n\nAccording to the World Health Organization (WHO), 2.2 billion people in the world do not have access to safely-managed drinking water services, and 4.2 billion people lack safely managed sanitation services. Globally in 2024, 176.6 million people needed humanitarian water, sanitation, and hygiene (WASH) assistance, but only 48 million received support, with just 37 percent of the required funding. For 2025, the sector will require $3.8 billion in funding, but due to cuts in aid, this percentage is expected to decline significantly. \n\nAccording to UNICEF, diarrheal diseases from poor WASH services are the second major cause of death for children under five. In 2021, diarrhoea caused about nine percent of deaths in this age group, translating to over 1,200 daily or about 444,000 yearly deaths, despite simple treatment solutions. Further, poor sanitation and water supply result in economic losses estimated at $260 billion annually in developing countries, or 1.5 percent of their GDP, increasing health and medical costs, time consumption, and consequently, affecting income-generating and livelihood opportunities.\nRecent global fund cuts further exacerbate the existing funding crisis for life-saving WASH services, but every crisis can also create opportunities, as Einstein suggested. This article explores some alternative and innovative mechanisms and opportunities for enhancing the finance and sustainability of life-saving WASH services, amid the global aid cuts. \nEncouraging charitable giving for life-saving services\nStatistic shows that clean water and sanitation prevent waterborne diseases, which kill millions annually. Charitable organisations can use these statistics about the need for improved WASH services to inspire action and attract support by emphasising their life-saving mission and vision. Duncan Green proposed religious giving as an alternative to aid dependency, suggesting that zakat is an efficient fundraising method in countries with significant Muslim populations. Similarly, other religious charity relief can contribute to strengthening lifesaving services. Philanthropic funding and religious giving, which is often more flexible than state-sponsored aid, can address urgent needs effectively and enable sustainable services aimed at reducing increasing funding gaps.\n\nFinancing WASH sector through the climate finance channel\nInvesting in resilient WASH infrastructure and services is a potential climate adaptation measure in climate-vulnerable countries, and accordingly, WASH infrastructures and services are key areas of climate-induced loss and damage. Thus, the WASH sector requires financing both from adaptation and loss and damage funds under the global climate finance mechanisms and commitments agreed at the Conference of the Parties (COP).\n\nFinancing integrated life-saving interventions\nFinancing a one-stop service centre by integrating all lifesaving services like health, nutrition, food security and WASH can reduce public health risks and prevent health hazards, ensuring the cost-effectiveness and efficiency of services. WASH services and healthcare must function in parallel. When WASH services are disrupted, it places a greater burden on primary healthcare services, which cannot address health hazards alone. WASH services act as preventive measures to reduce health risks, supporting the overall effectiveness of healthcare provision.\n\nStrengthening the blended funding mechanism\nCompared to traditional funding, public-private partnerships (PPPs) often lead to more efficient service provision and innovation. PPPs can bring much-needed efficiencies in service delivery. They often result in lower costs, faster implementation of projects, and improved overall service quality. Likewise, the private sector can enhance its business impact by actively participating in WASH funding and interventions, leveraging extensive outreach to WASH service recipients. Banks and financial institutions, as key industry players, play a crucial role in financing WASH initiatives, expanding their business and services to a broader population. Further, strengthening corporate responsibility frameworks can foster greater involvement from private and corporate entities, driving local engagement in sustainable WASH solutions.\n\nCommunity-based funding and interventions\nCommunity-based financing is another key catalyst for improving and sustaining access to WASH services. When communities contribute and take part in managing WASH services and infrastructures, it builds ownership and ensures long-term impact and sustainability. Spreading the message that every dollar invested in WASH brings a fourfold return helps households and communities see the value of investing. By sharing responsibility and co-financing, communities help make WASH services more reliable, reduce health risks, and lower healthcare costs. Further, local entrepreneurship development and engaging local vendors and markets would strengthen the WASH services at the local level, even in humanitarian settings.\n\nData and knowledge management\nEffective data and knowledge management would be instrumental for securing and promoting alternative financing and sustainability mechanisms at a local level. Data-driven storytelling for engaging the private sectors and effective awareness messages for community engagement would contribute to promoting blended and home-grown financing, ensuring the sustainability of WASH services and interventions. Leveraging the existing research and evidence, innovating low-cost and affordable technology, and nature-based solutions would facilitate long-term impact and sustainability of WASH interventions at local level, utilising available funding and resources effectively and efficiently. Further, the WASH sector has developed valuable resources and a global pool of experts over time. Despite funding cuts, these assets can sustain WASH interventions in collaboration with the public and private sectors with limited resources and funding.\nMohammad Omar Faroque is a research and development professional. He can be reached at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Exploring financing and sustainability mechanisms for WASH sector",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/exploring-financing-and-sustainability-mechanisms-wash-sector-3904631",
        "news_paper_name": "The Daily Star",
        "publish_date": "28-05-2025"
    },
    {
        "full_article": "Thirteen years is a long time to wait for justice. In most places of the world, that kind of delay would be an anomaly. In Bangladesh, it's become a routine. On May 21, a Dhaka court quietly extended the deadline for the investigation report in the murder of journalist couple Sagar Sarowar and Meherun Runi—for the 118th time. The new deadline is July 8, and few expect it to stick. The case has become less of a legal proceeding and more of a national metaphor for institutional decay, political obstruction, and a state still struggling to break out of its past.\nThe couple—he a news editor at Maasranga Television, she a senior reporter with ATN Bangla—were killed in their home in February 2012, stabbed to death while their child, just five years old at the time, was in the next room. The crime shocked the nation. It should have shocked the system into action, too. But 13 years on, the case remains unsolved, the culprits unpunished, and the consequences unresolved.\nThis isn't just another cold case. It's something else entirely—a symbol of how deep the rot runs, and how hard it will be for the interim government led by Prof Muhammad Yunus to convince people that real reform is even possible.\nWhen Yunus stepped into the role of chief adviser in the wake of the political upheaval in August last year, he did so on the strength of a promise: fundamental reform. Not just a new government, but a new kind of governance. He spoke of irreversible change. More than nine months later, the Sagar-Runi case is still stuck. This is important, because a failure like this tells people more than speeches or policy proposals ever can.\nThe history of this case reads like a catalogue of missteps. Initial investigations were fumbled, passed between agencies like a burden no one wanted. First, the local police, then the Detective Branch, then the Rapid Action Battalion (Rab)—none of them got close to solving it. More than a hundred extensions later, there's still no conviction, no clear suspect, not even a timeline that makes sense. Along the way, key evidence was destroyed, including—most recently—in a fire at a police office.\nEarlier this year, the case took another turn. The family's lawyer accused high-level officials from the previous government of actively obstructing the investigation. That lines up with what UN human rights observers have been saying since 2022: that Bangladesh suffers from a \"pervasive culture of impunity,\" where political connections act like shields against scrutiny. If those allegations are even partly true, it raises difficult questions—not just about the past, but about how much has changed under this new administration.\nTo be fair, the interim government hasn't entirely ignored the case. A task force was formed in October last year, including members from the Police Bureau of Investigation, the CID, and even Rab, although they had already been removed from leading the probe. The team has interviewed over 70 people, including a range of former officials. That's more effort than we have seen in years. But even so, there's a sense that the clock is ticking louder than ever.\nIn April, when investigators told the court they needed nine more months, they were granted just six. That decision reflects a growing impatience on the part of the judiciary, the public, and especially the press. Every delay chips away at confidence. Every missed deadline reaffirms a painful truth: that, sometimes, justice in this country is more political than procedural.\nAnd there's a broader context here. Prof Yunus came to power not through an election, but through what's been called a \"Monsoon Revolution.\" The movement that swept Sheikh Hasina's government out of office was driven by popular frustration with corruption, authoritarianism, and the sense that institutions had become hollowed out. The new administration's legitimacy hinges on the idea that things are different now. But how different, exactly? The continued stagnation of the Sagar-Runi investigation raises uncomfortable doubts.\nIf the interim government can't resolve this case—one that stands as a touchstone for press freedom, justice, and accountability—what does that say about its ability to reform anything else? This isn't just another file on a dusty desk; it's a test case for the government.\nSome of the hurdles are real. The crime scene was reportedly contaminated hours after the murders, with journalists and onlookers trampling over key evidence, according to the case investigators. The DNA evidence recovered is partial and inconclusive. These aren't small issues, but they don't fully explain why 13 years have passed without answers. They don't explain the lost documents, conflicting timelines, or the inertia that has followed this case like a shadow.\nThere's a lesson here that goes beyond forensics or bureaucratic reform. For Bangladesh to truly move past the Hasina era—or any era defined by unchecked executive power—it has to deal honestly with its ghosts. That means confronting cases like this one head-on, without delay and compromise. Anything less risks repeating the cycle.\nFor journalists still working in the country, the message is chilling. The Sagar-Runi case isn't ancient history; it's a daily reminder that their safety is negotiable, their profession vulnerable. And for ordinary citizens, the case underlines something more basic: that justice, when delayed this long, can start to look like denial.\nThere are still a few weeks before the new deadline. Maybe something will finally move. Maybe the 119th time will be different. But hopes are thin, and patience is thinner. A revolution, no matter how well-intentioned, can't rely on symbolism alone. It has to deliver—not just policy, not just vision, but results.\nUntil then, the legacy of Sagar Sarowar and Meherun Runi remains suspended in time, like their case file, like the trust of a nation still waiting for proof that justice doesn't only belong to the powerful.\nMd. Ibrahim Khalilullah is vice-president of Bangladesh Law Alliance. He can be reached at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The Sagar-Runi case and Bangladesh’s crisis of justice",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-sagar-runi-case-and-bangladeshs-crisis-justice-3904601",
        "news_paper_name": "The Daily Star",
        "publish_date": "28-05-2025"
    },
    {
        "full_article": "It is deeply concerning that despite warnings from public health experts, entomologists, and the media, the government's dengue control measures remain largely insufficient. Reports indicate that dengue cases have been rising rapidly with the early start of rains this year. As of the morning of May 23, the Directorate General of Health Services (DGHS) reported a total of 3,767 dengue cases, with 23 deaths. While there were 701 cases in April, the first 23 days of May saw 1,195 infections, indicating a troubling upward trend. Yet, the government's response has been noticeably inadequate. Without urgent action, this year's outbreak could surpass the severity of last year's, which saw 101,214 cases and 575 deaths.\nEarlier this month, entomologists warned of a sharp rise in the Breteau Index (BI)—a measure of Aedes mosquito density—across the country. Their research showed that in April, the BI exceeded 10, whereas last year's average remained below this level. They cautioned that if this trend continues, the BI could rise above 20 by June, posing a serious threat. Additionally, health experts have warned that if dengue serotypes such as DEN-1, 4, or even 3 become prevalent this year, the number of infections and severe cases could increase significantly. Therefore, the government must take this threat with the seriousness it deserves, and implement necessary preventive measures without delay.\nA national control programme for dengue has become essential by now. The Ministry of Local Government, Rural Development and Co-operatives (LGRD) has a crucial role to play in this regard. It must issue immediate directives to curb the spread of Aedes mosquitoes, prioritising breeding source management and larvae control. City corporations and municipalities must also establish year-round plans to maintain cleanliness and conduct regular fogging operations to prevent mosquito breeding. Proper waste management must be prioritised as well. Since early detection of Aedes hotspots is essential for dengue control, swift action must follow every rainfall to eliminate breeding sites and larvae. It is the responsibility of both state departments and residents to ensure that there is no stagnant water in containers, construction sites, or other potential breeding grounds.\nExperts have also stressed the need to declare dengue a reportable disease, which would facilitate proper data collection from hospitals and diagnostic centres and also enable more effective surveillance and response. Equally important, hospitals must be properly equipped to provide adequate treatment for dengue patients, especially those living outside Dhaka. Only through coordinated efforts and prompt action can we hope to prevent another deadly outbreak.\n",
        "headline_1": "Declare dengue a reportable disease",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/declare-dengue-reportable-disease-3902746",
        "news_paper_name": "The Daily Star",
        "publish_date": "28-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 28, 2025 00:00:00  \nGiven that the amount of arable land is not only limited but has also been shrinking over the years, while the population depending on it for food and work is ever-growing, it was understood long before the emergence of the modern hi-tech era that technology was the answer to agriculture's Achilles heel, its low productivity. A series of discussion events has been hel of late with the participation of stakeholders including people from the government's ministry concerned and experts both local and from abroad. At one such talks held recently in the city, the government came up with its 'Agriculture Future Outlook Plan 2025' which is said to be a strategic roadmap to deliver the fruits of advanced technology to the farming community's doorstep. \nThe key aspect of the strategic roadmap was a mobile application software developed by the Bangladesh Agricultural Research Council (BARC), the apex agri-research body under the Ministry of Agriculture. The app styled 'Khamari app' is said to be a repository of comprehensive agricultural information and tools unlike similar ones released in the past. The previous such apps, for instance, the one bearing identical name was released in November, 2023. But that app was focused on reducing expenses only on fertilizer as well as increasing crop yield. However, the latest version of the 'Khamari app' is reportedly, a comprehensive one as it would provide a wider range of information such as crop recommendation based on land suitability, fertility, fertiliser requirements, seed quantities, cropping patterns, etc. Also, it would, as told by its innovators, provide real-time market information thereby helping farmers to adopt pricing and sales strategies. \nThe app would also provide farmers with crop management tools enabling them to optimise farming practices. No doubt, the new app has enormous potential and it is hoped its intended users would be able to put the digital information tool to good use. However, the problem is the literacy rate among farmers is very low. True, most of them are familiar with modern smart phones and they can use those for personal communication as well as operate the inbuilt digital camera. But when it comes to reading and understanding information, let alone scientific information, then it would be a real challenge both before the potential users and the introducers of the app. In that case, the real task before the agricultural extension workers would be to make the intended users, the marginal, small and medium farmers digitally literate so they might take decisions on sensitive matters including crop management, application of inputs, marketing their crops and so on. \nMore important than the literacy issue is the lack of capital, especially among the small and marginal farmers. In fact, from buying inputs such as seeds, fertilisers, pesticides and maintaining cost of irrigation to hiring help for hoeing, harvesting, post-harvest transport cost to market their crops, they are constantly handicapped by financial constraints. Similarly, buying a digital device to operate the particular app for required information related to production and marketing is also going to be an additional investment for the cash-strapped farmers. While the government's priority will be ensuring the nation's food security, for farmers it will be maintaining a livelihood with at least two square meals a day. Hopefully, the government's central focus would be on farmers, the potential users of the 'Khamari app'.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Advanced agri-info  tool for farmers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/advanced-agri-info-tool-for-farmers-1748360748",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       May 28, 2025 00:00:00  \n\nCreating a congenial environment to attract foreign direct investment (FDI) is no longer just a developmental goal, it is a necessity. In an increasingly competitive global market, where nations are vying for foreign capital, it is imperative that Bangladesh presents itself as a promising destination that fosters investor confidence and ensures ease of doing business. While some progress has been made in recent years, particularly in terms of infrastructural upgrades and policy-level commitments, significant gaps still exist that need urgent attention. Without these corrections, foreign investors are likely to remain hesitant, and the country may miss out on vital investment opportunities.\nThe urgency of this issue came to the fore during a recent meeting of the joint Bangladesh-China Working Group (WG) on economic cooperation and investment. The meeting highlighted the pressing need for Bangladesh to offer a more investor-friendly climate, particularly as Chinese businesses show a growing interest in establishing operations in the country. The dialogue saw participation from representatives of the Chinese Ministry of Commerce, the Chinese Embassy in Dhaka, and Bangladesh's Economic Relations Division (ERD), among others. Notably, this meeting served as a preparatory session ahead of the upcoming Bangladesh-China Joint Economic Commission (JEC) meeting scheduled to be held in Dhaka on June 1.\nChina has long been a major economic partner of Bangladesh, both in terms of trade and investment. In the fiscal year 2023-24, Bangladesh imported goods worth US$16.637 billion from China, accounting for 26.4 per cent of its total imports. This clearly underscores the high demand for Chinese products in the domestic market. Additionally, China, including Hong Kong, has emerged as one of the leading sources of FDI for Bangladesh. According to data from the Bangladesh Bank, Chinese FDI reached $2.789 billion as of December 2024, making China the second-largest investor in the country.\nChinese enterprises are actively involved in an array of diverse sectors, including textiles, energy, manufacturing, and infrastructure. Major development projects such as the Padma Bridge and the Karnaphuli Tunnel in Chattogram bear testimony to China's significant involvement with Bangladesh's growth journey. Moreover, as production costs rise in China and geopolitical uncertainties prompt companies to explore alternative markets, Bangladesh stands to benefit from the \"China Plus One\" strategy, which encourages diversification of manufacturing bases beyond China.\nRecognising this opportunity, the interim government has expressed a strong desire to attract more Chinese investment, particularly in high-priority sectors such as healthcare, renewable energy (solar panel manufacturing), and high-value-added textiles. However, to fully leverage the advantages of China's industrial relocation, Bangladesh must address persistent challenges that have long plagued its investment ecosystem.\nA leader of the Bangladesh-China Chamber of Commerce and Industry (BCCCI) recently pointed out that while Bangladesh is proactive in seeking foreign investment, especially from China, various structural impediments continue to discourage investors from making long-term commitments. Despite Bangladesh's favourable factors -- such as a strategic geographical location, competitive labour costs, and the development of economic zones-the investment climate is often marred by bureaucratic inefficiencies, infrastructural shortcomings, policy inconsistencies, and a lack of transparency.\nChinese businesses, along with other foreign investors, frequently cite several critical obstacles. These include prolonged and complex approval procedures, inefficient customs processes, and inconsistencies in the application of rules and regulations. The overall business environment suffers from sluggish government agency responses and a general sense of unpredictability, making it difficult for investors to navigate the system with confidence.\nInfrastructure remains another major area of concern. Despite some improvements, Bangladesh continues to grapple with an infrastructure deficit. Unstable electricity and gas supplies, congested ports, and underdeveloped transport networks all contribute to increased operational costs and delay in project implementation. These inefficiencies diminish the country's competitiveness in the global investment landscape.\nA glaring example is the slow pace of progress in implementing the proposed economic zone dedicated to Chinese investors in Anwara, Chattogram. Despite high expectations and early enthusiasm, the project has seen delays, which has only added to investor frustration. This not only weakens investor sentiment but also affects the credibility of Bangladesh's investment commitments.\nAccording to analysts, the only way forward is carrying on with deep-rooted reforms. Administrative inefficiency and corruption must be addressed head-on. Streamlined approval processes, transparent and consistent policy frameworks, and the digitisation of public services could significantly improve investor confidence. Moreover, consistent dialogue between the government and the private sector -- both domestic and foreign -- will be essential to identify and resolve bottlenecks on a continual basis.\nAdditionally, leveraging successful regional models could be helpful. Learning from investment-friendly practices in countries such as Vietnam, Indonesia, Cambodia can offer valuable insights for Bangladesh. These countries have successfully improved their rankings in global indices such as the Ease of Doing Business and the Global Competitiveness Report, largely due to systemic reforms and robust infrastructure development.\nBangladesh at the moment stands at a critical juncture. With global supply chains shifting and investors looking beyond traditional destinations, the country has a golden opportunity to position itself as a viable alternative. However, this will only be possible if it takes meaningful and sustained steps to address the underlying issues that inhibit FDI. A conducive, transparent, and efficient business environment is not just desirable -- it is imperative if Bangladesh is to emerge as a key investment destination in the region.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Conducive investment climate: A key imperative",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/conducive-investment-climate-a-key-imperative-1748360819",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 28, 2025 00:00:00  \n\nIn many families, frequent quarrels between husband and wife are not uncommon. These conflicts may begin with minor disagreements but can escalate into serious arguments. Sadly, such disputes can have deep and lasting negative effects on children-both mentally and physically. When exposed to ongoing conflict, children may lose their appetite, have trouble sleeping, suffer from anxiety, become inattentive in their studies, appear sad or withdrawn, smile less, and in severe cases, even consider self-harm or suicide.\nGrowing up in an environment filled with conflict can foster negative thinking in children. Over time, they may become desensitised to this behaviour, leading them to disrespect or try to dominate their parents. This emotional detachment can weaken the bond between parents and children. Since the early years are critical for shaping a child's character, what they observe at home becomes a blueprint for their own behaviour. It is essential, therefore, that parents set a positive example by nurturing a healthy and respectful relationship.\nParents should be mindful not to argue in front of their children. Maintaining a calm and supportive atmosphere helps children feel secure. Disagreements should be addressed privately to avoid leaving a harmful impression on young minds. Mutual respect is vital; when children see their parents treating each other with dignity, they learn to do the same. Disrespectful behaviour, on the other hand, can lead children to take sides or lose respect for one or both parents.\nA warm, cooperative relationship between spouses sets a powerful example. It fosters a positive home environment where children learn empathy, kindness, and how to build healthy relationships. Expression of love and affection-whether through kind words, thoughtful gestures, or simply spending quality time together-strengthen the family bond and give children a sense of pride and security.\nUltimately, a peaceful, respectful, and affectionate home is one of the greatest gifts parents can offer. It lays the foundation for children to grow into emotionally resilient, confident, and respectful individuals.\nSanjida Jahan Shammi\nStudent, Daffodil International University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Impact of marital conflict on children",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/impact-of-marital-conflict-on-children-1748360857",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 28, 2025 00:00:00  \n\nFor job seekers, government recruitment exams not only bring the pressure of preparation but also the hassle of travel and accommodation. This becomes particularly difficult when exam centres are determined based on permanent addresses. Recently, the Directorate General of Food published a job recruitment circular, which was a re-announcement. Thousands of applicants applied for it. In the past, exams under the Directorate General of Food were held in district or divisional cities, which helped reduce the suffering, travel costs, and effort for many candidates.\nHowever, some candidates reside outside their home districts or divisional cities due to studies or other job commitments. In such cases, attending exams in their permanent address locations causes great inconvenience. Travelling long distances on short notice can also compromise exam performance, especially for those with financial constraints or tight work schedules. During the application process, all candidates provide their current address. Moreover, exams for a particular post under the Directorate General of Food are held on a single day with the same question paper for everyone. Therefore, if exam centres are allocated based on the current address, it would greatly benefit the candidates.\nHence, I earnestly urge the authorities of the Directorate General of Food to seriously consider this matter and hope this step will relieve all job seekers of anxiety and hassles.\nMD Abdullah Almamun \nDhaka\nkobimimun4989@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Exam centres closer to current address",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/exam-centres-closer-to-current-address-1748360956",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-05-2025"
    }
]