[
    {
        "full_article": "The separatist politics that dominated Kashmir for decades appears to be losing ground in the face of the assertive approach by the Bharatiya Janata Party-led central government. The Narendra Modi government has succeeded in altering the ground realities in Kashmir, advancing a new narrative of an aspirational region that seeks prosperity, peace, and integration. Reflecting this shift, members of several separatist outfits — J&K Peoples Movement, Democratic Political Movement, J&K Tahreeq Isteqlal, Tahreek-i-Istiqamat and J&K Salvation Movement — recently announced their formal dissociation from separatist ideology. Union Home Minister Amit Shah hailed the development as evidence of separatism becoming a thing of the past, crediting Mr. Modi’s vision of a “developed, peaceful, and unified Bharat”. That even second-rung separatist leaders or little-known separatist groups are publicly renouncing separatist politics and acknowledging its failure marks a significant departure from the past. It signals the emergence of a new paradigm for separatist leadership in the region. At the same time, it signals the end of an era where political engagement was viewed as a tool to manage separatist sentiment. Earlier Prime Ministers — P.V. Narasimha Rao, Atal Bihari Vajpayee and Manmohan Singh — had engaged in dialogue with separatist groups, and on several occasions, Pakistan had also joined the table. This approach shifted dramatically with Mr. Modi’s rise to power in 2014. In 2019, the government abrogated Jammu and Kashmir’s special constitutional status. Over the last five years, the Ministry of Home Affairs has banned key separatist organisations which include the Jamaat-e-Islami, the Jammu and Kashmir Liberation Front led by Yasin Malik, Mirwaiz Umar Farooq’s Awami Action Committee, Mohammad Abbas Ansari’s Ittihadul Muslimeen, and Shabir Shah’s Democratic Freedom Party. The Hurriyat Conference, once an influential coalition of over 20 organisations, including lawyers and traders’ bodies, has been largely rendered inactive. With most of its top leaders jailed or sidelined, separatism now lingers on the margins, overshadowed by shifting political realities.Still, whether the people and political class of J&K have organically embraced the realities, post-2019, remains an open question. The heavy deployment of security forces across urban centres is a reminder that New Delhi is yet to achieve complete control over the region. Meanwhile, militancy has morphed from an urban threat into guerrilla-style forest warfare, aided by advanced communication technologies and terrain-mapping tools. While Pakistan is entangled in internal crises, it is unlikely to relinquish its interests in Kashmir any time soon. New Delhi must now build upon its gains with deliberate, inclusive, and people-centric policies. Stability in Kashmir cannot be sustained by force alone — it requires trust, participation, and long-term vision. As a first step, J&K must be restored as a full-fledged State of the Indian Union in keeping with the Centre’s commitment to the Supreme Court of India.\r Published - March 29, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Jammu and Kashmir\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        security measures\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        technology (general)",
        "headline_1": "​Valley and hills: On peace in Kashmir",
        "headline_2": "Peace and stability in Kashmir require people’s participation",
        "link": "https://www.thehindu.com/opinion/editorial/valley-and-hills-on-peace-in-kashmir/article69386640.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "29-03-2025"
    },
    {
        "full_article": "The 19th report of Parliament’s Public Accounts Committee (PAC) is appropriately scathing in its criticism of the Goods and Services Tax (GST) regime, introduced in July 2017 to simplify, unify and improve indirect tax compliance in India. At the outset, the PAC highlights a nearly 2% drop in indirect tax revenue between FY18 and FY20 — the first two years of GST prior to the COVID-19 pandemic. Among the several discrepancies flagged, it is the non-auditing and non-finalisation of the States’ Compensation Fund for over six years that stands out as particularly troubling. This has strained the functioning of what was meant to be a unified yet federal tax structure. The PAC notes the Centre’s failure to furnish the Compensation Fund Account to the Comptroller and Auditor General (CAG), a necessary step to certify and release timely compensation to States for revenue losses since the rollout of GST. The centralising tendencies of the GST regime have long been a point of contention for major revenue-generating States, many of which have raised concerns over diminished fiscal autonomy and sharp declines in indirect tax collections. As a destination-based tax, GST is levied at the point of consumption, adversely affecting manufacturing-heavy States.To address these concerns, the GST (Compensation to States) Act, 2017, mandated a Compensation Fund and promised States a 14% annual revenue growth for five years (2017–22), using FY16 as the base year. However, many States have reported either non-receipt of funds or serious delays, which they say have negatively impacted governance. The PAC attributes this to the Centre’s indifferent approach. In one striking example, the PAC cites 2,447 inconsistencies — amounting to ₹32,577.73 crore — out of a sample of 10,667 cases — and criticises the Finance Ministry’s audit approach as “lackadaisical”. The PAC has recommended establishing a formal mechanism with the CAG to ensure timely audits and updates on pending cases. It also calls for a comprehensive review to develop a “GST 2.0” — a recommendation that is likely to resonate with States demanding a greater share of GST revenues, closer to 70%–80%, up from the current 50%. Published - March 29, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        laws",
        "headline_1": "Equitable distribution: On GST and the Parliament’s Public Accounts Committee report",
        "headline_2": "PAC recommendations on GST reforms will resonate with States",
        "link": "https://www.thehindu.com/opinion/editorial/equitable-distribution/article69386621.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "29-03-2025"
    },
    {
        "full_article": "Imagine going out for a yummy meal—\nYou finish eating, get the bill, and feel…\nWait, what’s this extra charge at the end?\nA “service charge” that you didn’t intend!\nThis charge is like a tip already added,\nBut many customers felt confused and a bit miffed.\nDo I pay the service charge and tip too?\nIt made eating out tricky to do.\nWell, the Delhi High Court just made a call—\nRestaurants can’t force this charge at all!\nNow, when you see it on your bill,\nYou can say “no” and skip the extra fill.\nThis decision makes some people cheer,\nBut restaurant workers may worry, I fear.\nThe service charge often helped pay their wage,\nSo now, some might feel a bit underpaid.\nBut hey, tipping is still up to you—\nA kind gesture for good service is always cool!\nRestaurants now need to think things through—\nMaybe adjust prices or find something new.\nThe court’s ruling isn’t about things like gas or bread,\nWhere prices are controlled, so people are fed.\nIt’s more about letting the market decide—\nWhere to eat is a choice; it’s your ride.\nSo, next time you’re dining, bill in sight,\nPay what you owe and tip if it feels right.\nThe market will work itself out in the end—\nRestaurants and diners will find a way, my friend!\n\n",
        "headline_1": "The Service Charge Debate: What Happened and What It Means",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/the-service-charge-debate-what-happened-and-what-it-means/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-03-2025"
    },
    {
        "full_article": "Imagine writing a poem, sharing your thoughts,\nAnd suddenly, you’re in trouble—who would’ve thought?\nThis happened to Imran, a man in the news,\nFor sharing a poem—he got accused!\nThe police said his poem caused harm and dismay,\nBut the Supreme Court (SC) had something to say.\nThey said, “Hold on! Poems aren’t crimes,\nFree speech is a right, even in tough times.”\nFive lessons the SC made super clear:\n\nDon’t Fear Criticism: If people speak up, don’t call it a threat.\nTalk Back, Don’t Shut Down: If you don’t agree, just share your own sound.\nFreedom First: Laws can’t crush the right to be heard.\nJudges Must Protect Rights: They must be fair, not bend to a side.\nArt and Satire Matter: Comedy, art, and jokes bring joy and chatter.\n\nThe SC showed us freedom is strong,\nBut why did this case drag on so long?\nThe real surprise wasn’t the SC’s call—\nIt was that Imran had to fight this at all.\nOthers face trouble for jokes and views—\nKunal Kamra and Allahbadia, too.\nLet’s remember these lessons and make it clear:\nFreedom of speech should never bring fear!\n\n",
        "headline_1": "Freedom of Expression: A Poem and a Lesson",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/freedom-of-expression-a-poem-and-a-lesson/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-03-2025"
    },
    {
        "full_article": "Bill Gates talks to rich guys, techies, activists, scientists…\nAmidst existential anxieties about inequality, climate change and genAI, the pull of ‘future porn’ is enormous. We want to know which people have what solutions in the making. The special hook that Netflix documentary What’s Next? The Future with Bill Gates has, is that the Microsoft founder and billionaire philanthropist anchors the conversations. Here’s a glimpse of how the talks go.\nWhat can AI do for us/ to us | In 2022 AI woke up. GPT-4 crossed a magic threshold. It can read and write and talk to us. The copyrighted material AI models train on gets a lot of attention, but these were not possible before you started putting so much content online, from Reddit to personal videos.\nAI promises to fill the yawning gaps in health and education. AI tool Sybil can accurately predict an individual’s future lung cancer risk from a CT scan. Vinod Khosla thinks in five years we will see an app approved as a primary care physician.\nAI’s also made it hard for James Cameron to create science fiction. Any idea of his takes a minimum three years to go to screen. How’s he going to be relevant in three years when things are changing so rapidly? He compares all the jobs angst to early onset dementia. As people exit the loop, what replaces their sense of purpose and meaning?\nTruth or consequences? | A lot of people who started the internet thought it would bring humanity together. They didn’t anticipate it being a great medium for being anonymous in a malevolent way.\nGiven how this trend amped up during the pandemic, it’s interesting to think of applying the methodology of contact tracing to get to the origin of a lie. Anthony Fauci says that people asked to explain how they reached an outlandishly untrue conclusion usually say, ‘Somebody showed me a tweet’. An untruth retweeted 100,000 times becomes a fact.\nCan we stop global warming? | When Earth’s surface was last as warm as today, sea level was 25 feet higher. Now, not only do we have to build a cleaner electricity grid, it has to be 2.5 times larger because demand will keep going up. Cement is the most consumed human-made material on the planet but inventing a new way to make it is a long way from making it affordable for every cement kiln across India.\nThomas Friedman says the key lies in the profit motive. There’s only one thing as big as Mother Nature and that’s Father Greed, the marketplace.\nCan you be too rich? | Is the existence of billionaires a fundamental policy error or the epitome of the American dream? America’s poor would make up a country bigger than Australia. For workers who get tips, the federal minimum wage is $2.13/hr. And yet, Mitt Romney says, finding policy solutions has taken a backseat, to culture battles and demonisation of people across the aisle.\nSure, the wealthy give back to society. But why should it be their choice and vanity? What about higher taxes instead? In the 50s and 60s, US had higher taxes, higher economic growth and deeper investments in the safety net. In 1964 the Johnson administration launched the war on poverty, and ten years later, the poverty line was half of what it was in 1960.\n\n",
        "headline_1": "What’s Our Future Gonna Look Like?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/whats-our-future-gonna-look-like/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-03-2025"
    },
    {
        "full_article": "Pricing is best left to markets, not courts\nRestaurants and hotels up and down the country were served a blow yesterday. Delhi HC ruled that service charge can’t be mandatory on food bills. Who wins? The Central Consumer Protection Authority, whose 2022 guidelines against default service charge on food bills will finally go into effect. Intervening years have seen passionate argumentation on both sides – with consumers often confused in the middle. Meal over, some still wonder if they need to tip on top of the service charge. They need not. And now, they can rightfully say no to the charge itself.\nTo the extent that the service charge has hitherto been used to even up the salaries, restaurant staff may be the most worried lot now. Those who criticise this business practice cannot deny that it’s found worldwide. It’s related to a calculation of what customers are willing to pay for the food itself, separated from the service, or more accurately the persons providing the service. Bottomline is that yesterday’s ruling means that restaurants and hotels have to review pricing, to stay in the black.\nBut this case is also unlike most cases that truly call for a pricing intervention, for example, in cases of monopolies or for essentials like some medicines. Rest of the time, shouldn’t the matter be left to market forces? Restaurants should be free to bill as they see fit, and customers are free to eat where they like. Markets will give the verdict.\n\n",
        "headline_1": "Off The Menu",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/off-the-menu/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-03-2025"
    },
    {
        "full_article": "At a time when the capital is already struggling with overpopulation and congestion, experts have reacted with scepticism to the move to revise the Detailed Area Plan (DAP) of Dhaka—saying it will worsen the city's liveability rather than improve it. The Rajdhani Unnayan Kartripakkha (Rajuk) drafted the amendment proposal after real estate developers intensified protests against DAP-2022 following last year's political changeover. And it has been recently discussed at the first meeting of a high-powered evaluation committee that decided to seek stakeholders' input before any decision.\nWhile talking to this daily, several urban planners said the proposed amendments, driven largely by demands from real estate developers, would further increase the city's population density and aggravate its living conditions. If approved, it will allow developers to increase building heights by two to four stories as well as floor area in most neighbourhoods. As a result, some areas could see their population rise to an alarming 50,000 per square kilometre. Experts particularly objected to the proposed change to the Floor-Area Ratio (FAR). The DAP currently has an area-based FAR system to ensure a gradual decrease in FAR from central to peripheral areas, maintaining some balance in urban expansion. Although it had been relaxed in 2023, under pressure from real estate businesses, the new draft now suggests changing the FAR approval system to a uniform plot-and-road-based one, making way for indiscriminate high-rise construction. Such modifications, argues one expert, will \"undermine the unique character of different neighbourhoods, disrupt urban balance, and risk the destruction of residential communities in Dhaka.\"\nThese warnings deserve to be taken seriously for the sake of the safety and wellbeing of residents. Allowing more high-rises without proper planning may not only worsen traffic congestion and overstretch public utilities, but also increase environmental hazards in a city already seeing the worst of them. The risk of fire hazards in high-rises along narrow roads is another serious concern, especially with the current lack of fire prevention measures. As urban planners have pointed out, it is also essential that setback distances between buildings are strictly enforced to ensure proper sunlight, ventilation, and overall safety.\nWe, therefore, urge the interim government to resist the pressure from real estate developers. As the city expands, so too must its planning standards, supporting infrastructure, and regulatory enforcement to ensure a liveable Dhaka. While the existing DAP is far from ideal, any changes to it should be guided by established urban planning principles, not the profit motives of a few. Given the state it has reached, we should also focus on reducing pressure on Dhaka by decentralising development.\n",
        "headline_1": "In revising DAP, we must resist undue real-estate pressure",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/revising-dap-we-must-resist-undue-real-estate-pressure-3859556",
        "news_paper_name": "The Daily Star",
        "publish_date": "29-03-2025"
    },
    {
        "full_article": "It is quite disheartening that the fate of life-saving forests in our country does not change regardless of whether there is a political or non-political government in power. Somehow, influential locals and unscrupulous businesses always manage to get the backing of someone in power to destroy and loot our natural resources for their own gain. The encroachment of the reserve forest in Majher Char in Patuakhali's Rangabali is a glaring example of this.\nAccording to a report in this daily, a local named Jewel Sikder has allegedly been expanding his fish enclosure encroaching upon the forestland. During Awami League's rule, he had its backing, and now, he is allegedly using BNP's banner although the latter has denied any affiliation. Jewel's list of alleged illegal actions includes not only felling trees to occupy deforested areas for expanding his business but also constructing a dam, digging drainage canals, and installing culverts inside the forest to facilitate water flow to his fish enclosure. Though evidence of forest grabbing was found, and an inquiry launched, no action has been taken against him yet. We hope that the inquiry process will not get stalled in bureaucratic delays, but the question remains: why did the forest officials not notice these activities beforehand? Why no action at all was taken? Surely, the dam and the culvert were not built overnight, nor could those be hidden away at will.\nUnfortunately, forestland grabbing, felling trees, and illegal logging are too common all over Bangladesh. These crimes continue happening right under the noses of authorities, and often with their help. There hardly seems to be any proactive supervision or patrolling to prevent such activities. Beyond their significance in maintaining ecological balance, forests, particularly in the coastal belts, have time and again shielded local residents from the severity of devastating storms. It is beyond comprehension why anyone would want to take down these protections. We urge the authorities, including local administrations and forest officials, to take firm action so that individual greed, political shelter, negligence of duty, and bureaucratic red tape do not lead to further loss of forestland in Bangladesh.\n",
        "headline_1": "We must save forests for our own sake",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/we-must-save-forests-our-own-sake-3859461",
        "news_paper_name": "The Daily Star",
        "publish_date": "29-03-2025"
    },
    {
        "full_article": "China has emerged as a global leader in the green energy sector, making significant strides in transitioning to renewable and sustainable energy sources. This is a crucial part of China's environmental goals and commitment to achieving carbon neutrality by 2060.\nOver the past decade, the country has invested heavily in green technologies, such as solar, wind and hydropower, while reducing its reliance on coal. In 2024, China became home to the world's largest solar and wind energy capacities as well as the largest electric vehicle market.\nAdditionally, it is a major player in the manufacturing of solar panels, wind turbines, and energy storage systems. China's leadership in addressing domestic environmental challenges is positioning the country as a key influence in global environmental policies and technologies.\nA central strategy behind the success in green energy is aggressive investment in renewable energy infrastructure. For example, tax breaks and low-interest loans for solar and wind energy companies have spurred innovation and growth. Alongside investments in energy production, China has developed an extensive electric vehicle network to reduce emissions from transportation, one of the largest sources of pollution in the country.\n\nSichuan Shudao Equipment and Technology Co, a leading company in the renewable energy sector, has made significant strides in promoting green technology, especially in wind and solar energy. The company develops and manufactures advanced equipment for clean energy generation. Its expertise in wind turbine production and solar panel efficiency has positioned it as a prominent player in China's green energy transition, contributing to the country's goal of reducing carbon emissions.\nSichuan Shudao excels in the development of high-efficiency wind turbines, with innovations that increase energy output and lower operational costs, making wind energy more competitive. Its turbines are designed for both onshore and offshore applications, expanding the potential for wind power generation. This technology could also serve as a valuable model for Bangladesh, as we are looking to diversify the energy mix and reduce our environmental footprint.\nThe company has also advanced solar energy solutions by developing high-performance solar panels using innovative materials and production techniques. These are now deployed in large-scale projects, including solar farms that power entire regions.\nSichuan Shudao is also exploring energy storage solutions to ensure solar energy availability even when sunlight is scarce. This combined focus on generation and storage is key to creating a reliable renewable energy supply.\nFor countries like Bangladesh, which experience high sunlight levels but face energy access challenges, taking a leaf out of Sichuan Shudao's book on solar technologies could be crucial in meeting the growing demand for clean energy.\nWith deteriorating environmental conditions, China's green energy methods could provide significant guidance to Bangladesh, which has long struggled with poor air quality, particularly in Dhaka, where pollution levels rank among the worst in the world. This has caused public health issues, including respiratory diseases, cardiovascular problems, and premature deaths.\nAdditionally, Bangladesh's reliance on coal and fossil fuels significantly contributes to its carbon footprint. Shifting to renewable energy could reduce pollution and decrease dependence on fossil fuels. By taking inspiration from China's green energy strategies, Bangladesh could design measures to reduce its reliance on coal and natural gas. With abundant sunlight and wind resources, the country has the potential to harness these renewable sources.\n\nChina's model of incentivising renewable energy infrastructure development could be replicated in Bangladesh, encouraging private and public sector investment. Offering tax incentives for solar panel installation or wind farm development could promote the widespread adoption of these clean energy sources. By investing in energy storage, Bangladesh could ensure renewable energy availability even during low-production periods. Shifting towards green energy would significantly improve air quality, with a reduction in coal-fired power plants and the widespread adoption of electric vehicles.\nFurthermore, Bangladesh could learn from China's \"green manufacturing\" initiatives, where industries are retrofitted with energy-efficient technologies to reduce emissions.\nIn short, China's leadership in green energy offers a model that Bangladesh could follow to address its air quality issues. By investing in renewable energy, energy storage, and green technologies, Bangladesh could reduce its environmental footprint, improve public health, and build a sustainable energy future. Through targeted policies, incentives, and long-term investments, Bangladesh could not only address air quality problems but also contribute to global climate change efforts.\nNaziba Basher is a journalist at The Daily Star.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "How China’s green energy strategy can inspire Bangladesh",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/how-chinas-green-energy-strategy-can-inspire-bangladesh-3859431",
        "news_paper_name": "The Daily Star",
        "publish_date": "29-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Reforming law to root out syndicates",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/reforming-law-to-root-out-syndicates-1743171528",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "The vanishing profit from agriculture",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-vanishing-profit-from-agriculture-1743171588",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Eid magazine: A rich tradition",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/eid-magazine-a-rich-tradition-1743171718",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Struggling street vendors",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/struggling-street-vendors-1743171741",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-03-2025"
    }
]