[
    {
        "full_article": "The UN Security Council’s statement on Friday (April 25, 2025) condemning “in the strongest terms” the terrorist attack in Pahalgam, was necessary, but inadequate. According to the statement, which expressed condolences to India, and to Nepal which lost one citizen, the members of the Security Council, that include Pakistan as an elected, non-permanent member this year, “reaffirmed that terrorism in all its forms and manifestations constitutes one of the most serious threats to international peace and security”. The statement also spoke of the need to bring the perpetrators and their sponsors to justice. However, the UNSC did not name The Resistance Front (TRF) that initially claimed responsibility for the attack, and did not refer to the group’s linkages to a UNSC-designated terror outfit, the LeT. Nor did it expressly speak of cooperation with the Government of India, as it had in the past. Finally, the statement made no mention of the terrorists’ intent to target non-Muslims — an abhorrent act aimed at instigating communal tensions. A comparison with previous such statements would make it clear that the language was “watered down” given that Pakistan is a member of the Council (2025-26), and had China’s support. China has in the past sought to veto statements critical of Pakistan. It is also disappointing that the statement, which was negotiated by France’s envoy, the current UNSC President, did not bring stronger inputs from others on the Council including the U.S., Russia and the U.K.As the government and security forces discuss counter-terror operations within Jammu and Kashmir to apprehend the terrorists and possible military options across the border, India’s next option may be to bring a more strongly worded statement to the UN General Assembly, as various countries have done in the Ukraine and Gaza conflicts. The government would no doubt be preparing to have those terrorists it has identified from the attack and the TRF itself, designated by the UNSC, much the same way as it was able to bring the designation of Pakistan-based Jaish-e-Mohammad chief Masood Azhar as a terrorist after the Pulwama attack. In addition, India could build its case at the Financial Action Task Force, which put Pakistan on a “greylist” from 2012-15 and 2018-22, and revive its plans to pass a Comprehensive Convention on International Terrorism at the United Nations. On the bilateral front, expecting assistance from Pakistan has been a dead-end in the past, despite its promises after Mumbai (2008), Pathankot (2016), and Pulwama(2019). Given the state of bilateral relations and the lack of diplomatic engagement, this is even less likely. Only a multi-pronged effort on the global stage, and the patience it showed with the extradition of Tahawwur Rana from the U.S., will ensure that India is able to follow all the threads in bringing those responsible for this brutal attack to justice and establish a durable peace. Published - April 29, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        United Nations\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Nepal\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        act of terror\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        minority group\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        Pulwama attack 2019\n                    \n                            /                      \n                        \n                        Mumbai terror attacks\n                    \n                            /                      \n                        \n                        Pathankot attack\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict",
        "headline_1": "Not strong enough: On Pahalgam terror attack and the UNSC statement",
        "headline_2": "The UNSC Statement on Pahalgam attack appears watered down",
        "link": "https://www.thehindu.com/opinion/editorial/not-strong-enough-on-pahalgam-and-unsc-statement/article69501705.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "29-04-2025"
    },
    {
        "full_article": "The resignation of Tamil Nadu Electricity Minister V. Senthilbalaji and Forest Minister K. Ponmudy from the Cabinet on Sunday (April 27, 2025), after adverse remarks of the Supreme Court and Madras High Court on different issues, is a matter of relief to the advocates of morality and propriety in public life. Their continuance in power would have caused great embarrassment to the DMK government, led by M.K. Stalin. Mr. Senthilbalaji’s exit came on the eve of the expiry of the deadline fixed by the Court last week to choose between his post and his freedom while Mr. Ponmudy’s departure came as the High Court, while directing the Registry to take up a suo motu writ petition regarding a derogatory speech delivered by him, observed that he had, prima facie, misused the liberty granted to him by the Court which had stayed his conviction as well as the sentence in a corruption case. Everyone in public life should uphold the dignity of the office they hold. Mr. Ponmudy evidently overlooked the importance of this principle. Mr. Senthilbalaji is on a sticky wicket, as the proceedings against him — both in respect of allegedly receiving kickbacks for jobs in the State transport corporations during his earlier tenure as Transport Minister (2011-15) in the Jayalalithaa Cabinet and money laundering — are in progress after the Court’s nod about two years ago.Corruption may not have been viewed by some as an issue that bothers the common man. Such a view may have been grounded in the fact that many politicians, accused of corruption, are successful in electoral politics and know how to stay in power. But, this perception cannot deter courts of law from proceeding against those involved in acts of corruption. Rightly, in September 2022, the Court held that “corruption by a public servant is an offence against the State and society at large”. At that time, the Court ordered the restoration of a criminal complaint quashed by the Madras High Court against Mr. Senthilbalaji and others accused of taking bribes in exchange for jobs in the Metropolitan Transport Corporation. Even though there are many anti-corruption activists, it appears that under the given circumstances, only the courts of law can effectively act against those in power for corruption. At times, interventions by courts against corruption might appear as acts of judicial overreach. But the episode concerning Mr. Senthilbalaji and Mr. Ponmudy, underscores the point that the top political executive in any State and at the Centre should show zero tolerance towards corruption. Published - April 29, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        Dravida Munnetra Kazhagam\n                    \n                            /                      \n                        \n                        corruption & bribery\n                    \n                            /                      \n                        \n                        politics",
        "headline_1": "Better sense prevails: On the resignation of Tamil Nadu Ministers",
        "headline_2": "Those in public life should uphold the dignity of the office they hold",
        "link": "https://www.thehindu.com/opinion/editorial/better-sense-prevails-on-the-resignation-of-tamil-nadu-ministers/article69501477.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "29-04-2025"
    },
    {
        "full_article": "On my daughters arranging my future \nOf late the kids have been musing over my departure. Not to a mall or airport but the grand goodbye. I have been an old woman to them from the time they met me. One daughter accompanies me with all the gravitas of a caretaker, giving me a careful onceover before leaving the house: take keys, sunglasses, has mom worn clothes. While privately I believe in my own immortality, they expect me to keel over any minute. Difficult to catch hold of me, they say, as I’m always at a funeral.\nI chose cremation over burial when they asked as if I had given it some thought, but there’s some confusion over my ashes now. My suggestion that these be divided between the two daughters was met with an awkward silence. I broke into childhood memories of a pond in Ollur I used to frolic in, and suggested immersing the ashes there. Too far, ma, was the clipped answer. Okay, I snapped, any lake in Bangalore will do. ‘We could get arrested for littering,’ say they. As they are still grappling with this, I am under strict orders not to perish till it’s sorted. They are also working on a guest list. If I grumble about a friend, they quickly scratch out the name. Henceforth talking highly of everyone I know.\nThe one thing I can do effortlessly and with some amount of speed is ageing. I am now only concerned about spines while reading romances. Find a good mattress, I tell the protagonists. Love happens all the time, but we have only one vertebral column. And while I find older people too free with their health details, I’m fascinated by my own knee pain and limp till someone asks. Some things I’m super sharp about, but some things…what was I saying?\nNobody wishes for a long lingering farewell. Unlike film heroes shot in the head but still able to give a coherent and complete speech, I want to go as an incomplete mystery, where my last words could hint at a homicidal past or at least a large embezzlement. ‘I’m Elena Ferrante’ was a favourite, but she may keep writing novels after I go. ‘You look the type who will have a lot of dramatic things to say on your deathbed,’ says daughter. ‘When you see the light, just walk into it. Don’t start describing it.’\n\n",
        "headline_1": "Guiding light",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/guiding-light/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-04-2025"
    },
    {
        "full_article": "Surrogacy privileges for single men must be weighed against the central need to protect children \nGestational surrogacy is now half a century old. The decades have seen demand for it grow and grow. But the regulations scrambling to administer it have travelled a zigzag line, constantly excluding-including people and activities depending on social negotiations. In Italy, for example, religious conservatives first succeeded in making surrogacy illegal and then a ‘universal crime’ on par with genocide. India has gone from being a popular global destination for commercial surrogacy, to banning it. Further, in 2021 a new law set out narrow terms for who can avail even altruistic surrogacy, which have been challenged by different excluded groups. What the challenges at core reflect is people’s desire to have a child of their ‘own’, when science is there to help overcome personal circumstances keeping it from being fulfilled.\nOne challenge the Supreme Court is set to consider is whether disallowing a divorced man from having a child through surrogacy is unconstitutional. This is in the context of the law allowing widowed and divorced women between the age of 35 and 45 years to avail surrogacy. Note that never-married women are just as excluded as the petitioner, as are ever-married women outside of the 35-45 age group, and same-sex couples. Odd exclusions have been placed on married couples as well. The various exclusions reflect odd notions of who would make a good parent. There is an arbitrariness to it all that definitely needs reviewing by the apex court. \nBut not all challenges are on the same footing. Given that sexual crimes are overwhelmingly dominated by men, the surrogacy privileges of single men should necessarily draw greater scrutiny. Especially as, everywhere, sexual crimes against children have been extra difficult to police. Complicated as the surrogacy rights terrain is, the interests of the child have to be at its centre. \n\n",
        "headline_1": "The baby, first",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-baby-first/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-04-2025"
    },
    {
        "full_article": "Saving this tourist season is the best reply govt can give terrorists and their masters across the border \nNo part of India should remain disturbed, especially a large frontier region facing a hostile neighbour. And just seven days ago – till the morning of April 22 – J&K was looking more “normal” than it has in decades. Terror attacks had reduced to about a third from their peak in 2018. Tax revenues had more than doubled in the same period. Investment in the eight years from 2014 to 2021 had never touched ₹900cr. But in 2022-23, it crossed ₹2,150cr, and likely reached ₹5,000cr last fiscal. Along the way, J&K also got a democratically elected govt. As Modi said on Sunday, “Democracy was getting stronger…people’s income was increasing, new opportunities were being created.”\nBut Pahalgam has cast a cloud over the future. Reports say 60-90% of tourist bookings across Kashmir have been cancelled. A hotel association has claimed 13L cancellations for Aug alone. While tourism certainly is not the main meter of normalcy for most states, it matters a lot in J&K. It is, after all, one of the UT’s biggest industries, accounting for roughly 8.5% of income. Drill down, and its significance for Kashmir, specifically, becomes apparent. During 2021-24, tourist arrivals in the Jammu region grew about 90%, but in Kashmir they jumped 425% – from 6.7L to 35L. This was a massive vote of confidence for Kashmir from the rest of India. And also from foreign tourists, whose numbers grew from just 1,614 in 2021 to 43,654 last year. \nThat’s why, govt must do everything to ensure Kashmir does not fall off India’s tourist map for even one season. Kashmiri livelihoods are at stake, but equally, it’s a question of increasing people-to-people contact via tourism to integrate those who feel alienated. It’s also about our national resolve – we can’t let five terrorists push Kashmir back six years. The 2025 tourist season isn’t lost yet. Summer break is still some weeks away, and the Amarnath Yatra doesn’t start until July. \nLast year, over 3L tourists had visited Pahalgam by the end of April, and this year was looking even better until last week’s killings and the tourist exodus. But some tourists have already shown courage to return to Pahalgam’s sites. Kashmir, meanwhile, has wholeheartedly condemned last week’s attack, showing where its sympathies lie. If govt seizes this moment to rebuild confidence in security arrangements – minus the overreach that inconveniences ordinary people – tourists will follow.\n\n",
        "headline_1": "Mission Kashmir",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/mission-kashmir/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-04-2025"
    },
    {
        "full_article": "On Pahalgam and the West’s ‘militant’ bias\nWords matter. The progressive liberati tell us they matter so much that your survival as a decent human being depends on being sensitive enough to correctly gender a houseplant on social media. Nouns, adjectives and pronouns must be treated with the reverence accorded to ancient artifacts found at an archaeological dig. You would imagine that when Hindus are hunted down and murdered in Pahalgam, Kashmir – murdered for the crime of existing – then NYT would deploy that same obsessive precision. Surely, they would reach for a familiar, correct word, the word they use for the perpetrators of 9/11. You know, terrorists.\nBut no. When Hindus die, the term that gently floats down is ‘militant’ – a word so gloriously beige that it sounds like someone got a bit rowdy at a PTA meeting. ‘Militant’ – not a monster, not a butcher – just a spirited political activist with poor anger management. Makes you wonder if the target of their attack were soldiers and tanks…or families on vacation. Spoiler: it was families.\nJacques Derrida – patron saint of people who quote books they’ve never finished – taught us that language encodes hidden power structures. Well, here’s an easy one: when Western media call terrorists ‘militants’, it’s because Hindus, in their worldview, can never be victims. Hindus are cast as permanent oppressors, with violence against them cast as ‘punching up’. No different than storming the Bastille – violence, sure, but to be seen in the larger context of historical justice, or, wait, there is a word for it, karma. \nThere is a side-show of clowns that enable this, pushing a pseudo-academic thread of messaging, namely that Hinduphobia isn’t real. It’s a ‘constructed term’, they say, from the comfort of panel discussions that smell faintly of Sauvignon Blanc and moral cowardice, used by Hindu fascists to protest when the chickens come home to roost – or militants come to do their ‘militanty’ things.\nTerror exists. All religions are targeted where they are in the minority. Some groups, though, get murdered twice: first by bullets and again by the slow suffocation of their truth. Meanwhile, their killers get to keep their moral alibi, polished and gleaming, courtesy of Western media houses.\nYes, words matter, especially when they come from organisations of influence. It’s long past time we used the right words. And called out those who do not.\n\n",
        "headline_1": "The right word: Terrorist",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/just-another-blog/the-right-word-terrorist/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-04-2025"
    },
    {
        "full_article": "We are concerned about the protracted leadership crisis at the local government bodies, particularly union parishads (UPs), where the continued absence of chairmen is disrupting the provision of essential services. Since the July uprising last year, UP chairpersons connected to the ousted Awami League government have been largely missing in action. Many either went into hiding or were arrested over alleged connections to criminal activities. According to the LGRD ministry, of the 4,575 UP chairmen across Bangladesh, at least 1,535 remain absent.\nAlthough administrators have been brought in to fill the vacuum, residents in many UPs, according to a report by this daily, are still facing delays and other disruptions in obtaining vital documents, causing them various complications. The administrators who were appointed to carry out the chairpersons' tasks (as an additional responsibility) are still struggling to do it effectively due to various reasons, including lack of leadership experience, unfamiliarity with the job's nature, overwhelming workload, etc. This has led to severe disruptions in several public services. For example, the beneficiary lists for the VGF and VGD programmes have not been updated as planned, causing delays in providing support to new recipients.\nUnion parishads are responsible for issuing birth, death, character, and citizen certificates, which are essential documents required to access many government services. UPs also play a crucial role in administering the social safety net programmes, running village courts, implementing rural development projects, and maintaining law and order. UP chairmen are best positioned to manage these tasks due to their local connections and understanding of their constituents' needs. We cannot expect the same level of expertise or tact from administrators, but the problems and sufferings thus caused cannot continue either. Enough time has passed for any test or trial the government may have needed to deal with the UP crisis. People expect results now.\nWe urge the government to take more targeted measures, including mobilising necessary resources, to equip the union parishads so that essential services can be provided without unnecessary hassle or delay. However, the most effective way to resolve this crisis would be to hold fresh local government elections and properly reconstitute the union parishads. This is how this system was designed to function, with people's representatives taking care of their needs. In our view, there is no need to wait for the national elections to conduct the local government elections. In fact, holding these elections could serve as a dress rehearsal for the national polls. More importantly, it will restore normalcy to the delivery of public services.\n",
        "headline_1": "Elected leadership can restore union parishad functioning ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/elected-leadership-can-restore-union-parishad-functioning-3882476",
        "news_paper_name": "The Daily Star",
        "publish_date": "29-04-2025"
    },
    {
        "full_article": "Rape culture refers to a societal environment where sexual violence is normalised, excused, or trivialised. Cultural attitudes, media portrayals, and weak legal enforcement contribute to its persistence, creating barriers to justice for survivors and reinforcing cycles of silence and impunity. At its core rape culture is about power, the dominance of one person or group over another, often targeting, women, children, and marginalised communities.\nRecent reports of sexual violence in Bangladesh have sparked national outrage. A woman was gang-raped for three hours on a bus. An eight-year-old girl lies on life support after a brutal sexual assault. A man harassed two women for smoking in public, triggering a mob that threatened them. Another mob freed a man accused of harassing a woman over her attire, celebrating him with a garland, pagri and the Quran. These incidents expose the toxic culture of misogyny, the devaluation of women, and the denial of bodily autonomy. This discussion focuses on four key factors that reinforce rape culture: language, social attitudes, traditional notions, and legal frameworks. \nThe power of words and tradition\nLanguage shapes societal perceptions. In Bangladesh, derogatory slurs like magi (woman of loose morals), \"whores,' \"bitches,\" are normalised, reinforcing the idea that a woman's worth is tied to false notions of \"purity,\" and she loses respectability if she does not observe conservative attire and decorum. However, purity, if the term must be used, refers to integrity and not attire and customs dictated by patriarchy.\nI have attended religious sermons in both urban and rural areas. Let me be clear here. Not all of them are about how to control women, but many are. These sermons often preach how westernisation and modernisation are loosening men's control over women who now work in public, wear \"inappropriate\" attire, and reject male authority. Men are urged to keep women under strict patriarchal control to maintain the social order. Changing this narrative is crucial. Women must not be demeaned as sex objects, nor their self-worth reduced to submission to male authority.\nWomen's bodies have long been viewed as commodities belonging to men. In many rural areas, a raped woman is considered \"dishonoured,\" forcing families to silence survivors out of fear of social ostracisation. Many are even forced to marry their rapists to restore family honour, furthering their victimisation. I remember a young woman who worked in my mother's house. She fled her village after being forced to marry her rapist. One day, her husband arrived and took her back. I watched her lonely silhouette disappear into the night. She said she had no choice; she had siblings to support, her family's honour to protect. At that moment, I realised the weight of social forces—there was nothing I could do.\nThe legacy of violence\n\nDuring the 1971 Liberation War, the Pakistan Army used rape as a weapon, yet discussions of these crimes is often framed as the loss of women's ijjat (honour) rather than war crimes. A story from that time has always stayed with me. A teenage girl was advised by her aunt to take poison if the military tried to rape her. The girl retorted, \"Why should I kill myself? I did not commit any crime.\" Her defiance is rare—most women are not socially conditioned to speak up.\nIn 1995, Yasmin Akhter, a 14-year-old domestic worker, on her way to her village was raped and murdered by three police officers who had offered her a ride. The officers were tried and hanged. The case became a landmark, leading to August 24, the day of her death, being observed as Resistance Day for Repression against Women. Yet decades later, rape culture persists in pernicious ways.\nA broken legal system\n\nWeak legal enforcement in Bangladesh enables perpetrators, especially powerful men, to evade justice. Police often refuse to register cases and humiliate survivors by questioning their morality. Even in media and legal discourse, rape is described as \"losing honour\" rather than a violent crime. In extra-judicial salishes, religious and social elites dictate punishments based on personal notions of morality rather than legal standards. Often, these salish judgments stem from property disputes or an elite man's sexual desires for the woman being punished.\nAccording to Kaler Kantho, more than 27,000 rape cases and nearly 60,000 cases of violence against women were reported from 2019-2023. In 2022 alone, 4,762 rape cases were recorded, yet only 24 convictions were secured in Dhaka over five years. These numbers highlight systemic failures and the immense pressure survivors face to withdraw cases.\nIn 2025, rape cases continue to rise, with minors being targeted. In response, the government mandated that rape investigations be completed within 15 days and trials concluded within 90 days, with no bail for the accused. While a step forward, the real test lies in implementation. We need policy changes that provide better support for survivors–safe homes, more female police officers trained in handling sexual assault cases, counsellors for survivors and perpetrators (rehabilitation is essential, the death penalty does not cure the problem), and funding for education programmes.\nEducation and civic awareness: The path forward\n\nEducation is the most powerful tool against rape culture. Gender awareness must start in primary schools, despite opposition from those who benefit from the status quo. Once, in a village, I saw an NGO pamphlet illustrating domestic violence with a drawn image of a man beating his wife. A young man objected that the poster was teaching children that Bangladeshi men beat their wives. Due to local clergy opposition, the pamphlet was later revoked. This bending of the knee to powerful entities that want to ensure women's subjugation must be challenged.\nSchools must integrate discussions on gender roles, toxic masculinity, and sexual harassment. Role-playing exercises, debates, and workshops can help young people engage meaningfully with anti-rape discourse and learning how to avoid words and behaviours that demean women. Teachers must be trained to lead these discussions with sensitivity, and parents and community members must be encouraged to see these ideas as beneficial for society. Local organisations working with women and children must be empowered to speak in public forums. Beyond education, we must rethink societal attitudes. Rape must be framed as a violent crime, not a loss of honour. Stricter penalties should be imposed on police and judges who fail to prosecute offenders.\nBreaking silence\nMany of today's survivors are speaking out, forcing society to reckon with its failures. Nowadays, women come forward to press charges against their attackers. University students are leading protests demanding accountability and justice. But why should women repeatedly march on the streets for their protection? Where are the law enforcement agencies, courts, and the state? Understandably, a radical change in power has created an infrastructural vacuum in society, creating opportunities for criminal activities. Even then, it is the state that must step up as the final guarantor of safety.\nThe anger and unity of the students mark a new era that must be sustained. It shows a young generation of women who will not be silenced, and these movements will organically connect to grassroots activism to spread greater awareness. We admire these courageous women who refuse to be muzzled. They are breaking the cycle of violence, naming their perpetrators, and reclaiming their voices—not just for themselves, but for all of us. We are with you, sisters!\nDr Lamia Karim is a Professor of Anthropology at the University of Oregon in Eugene, United States.\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our submission guidelines.\n \n",
        "headline_1": "Rape culture: What can be done?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/rape-culture-what-can-be-done-3882196",
        "news_paper_name": "The Daily Star",
        "publish_date": "29-04-2025"
    },
    {
        "full_article": "It is now a foregone conclusion that global warming caused by a buildup of carbon dioxide, the most important climate-warming greenhouse gas humans have been adding to the atmosphere, is, for all practical purposes, irreversible. That is because the current concentration of carbon dioxide will keep the engine of climate change running on a scale of centuries to millennia. As a result, halting our planet from heating up more will be extremely difficult to achieve, unless we go \"carbon negative\" as soon as possible.\nGoing carbon negative means removing more carbon dioxide from the atmosphere than adding it. It requires effective use of carbon dioxide removal technologies, such as direct air capture (DAC), or bioenergy with carbon capture and storage (BECCS), or biochar fuel to mitigate residual emissions. A challenge for DAC is that the atmosphere blanketing the Earth is very big, and carbon dioxide is a relatively small part of it, about 0.04 percent. Hence, the technology will work effectively only in the vicinity of power plants where carbon dioxide is emitted in large concentrations. Another area of concern with DAC is energy efficiency. Carbon dioxide is not a very reactive molecule, so extracting it is both energy and resource-intensive.\nAt its most basic, BECCS involves growing crops, burning them to generate electricity, capturing the carbon dioxide emitted during combustion and storing it deep down into the Earth's crust. However, it is essential to exercise caution to ensure that the emissions resulting from the cultivation, harvesting, transportation, and processing of biomass do not exceed the amount of carbon dioxide captured by the crops. Besides, there are concerns for the safety of the storage of carbon dioxide in huge volumes over a long timescale at a single location due to the possibility of leakages, which can lead to contamination of the environment.\n\nLately, biochar has gone from being a highly theoretical proposal to being one of the most viable negative emissions technologies. It has gained considerable attention in recent years for its potential to address pressing challenges in agriculture, climate change mitigation, and environmental sustainability.\nBiochar is a durable, carbon-rich substance created via pyrolysis, which involves the thermal breakdown of organic materials in an environment with limited oxygen. It has long been recognised for its ability to improve the health of soil and sequester carbon dioxide. Most importantly, biochar can help address climate change because it is one of the several techniques that target carbon dioxide.\nAs plants grow, they breathe in carbon dioxide from the air, using the carbon they absorb to build their tissues. Then they die and rot or decompose, releasing carbon dioxide into the air again. But if the decomposed plants are turned into biochar, carbon dioxide is instead converted into a solid, which can stay locked in the soil for many years. In this way, plants become one kind of carbon removal engine, drawing climate-warming carbon dioxide out of the air and storing it in the ground.\nBiochar can be produced from various types of waste materials, including wood, shells, agricultural residues, and byproducts from industries such as paper mills, sawmills, and breweries, among others. The waste is fed into a special stove-like device called a pyrolyser, a low-tech version like a kiln. Inside the device, the raw materials are deprived of oxygen as they are heated to temperatures between 200 and 700 degrees Celsius. Without oxygen, the wastes cannot catch fire, and their carbon does not turn into carbon dioxide and escape into the air. Instead, the wastes are converted into biochar.\nDepending on the operating temperature, the process also yields a liquid called tar or a gas called syngas. These byproducts can be combusted to generate the necessary heat for the continued functioning of the pyrolyser. Consequently, a pyrolyser can sustain its operation or generate additional fuel or energy for commercial purposes.\nOnce produced, biochar can be added to the soil. It can be applied in various ways, including being sprinkled on the surface, incorporated into the soil in layers or holes, or blended with compost or seeds. The carbon contained in the biochar has the potential to remain in the soil and be sequestered for a prolonged duration. According to Our World in Data, a non-profit online publication that focuses on global problems and trends, biochar can offset the equivalent of up to three gigatons of carbon dioxide each year by 2050, which is like shutting down 800 coal-fired power plants.\nThe most significant characteristic of biochar is its capacity to enhance the structure of the soil, retain water, and increase the availability of nutrients. It functions similarly to a sponge, effectively retaining vital nutrients and minimising the reliance on chemical fertilisers. Furthermore, its porous structure supports microbial activity, thus promoting healthier soil ecosystems. Biochar presents an environmentally friendly approach to improving characteristics of the soil, especially in sandy, acidic, and nutrient-deficient soils that typically experience challenges with water retention and loss of nutrients.\n\nThe production of biochar commonly utilises feedstocks such as rice husks, cassava peels, and various agricultural by-products, which are favoured for their accessibility and effectiveness in generating high-quality biochar. These biochars, sourced from agricultural waste, are particularly valued for their environmental sustainability and low production costs. For example, rice husk biochar is recognised for its ability to enhance the fertility of soil and improve water retention capabilities. Likewise, cassava peel biochar is extensively employed in tropical areas due to its capacity to improve soil structure and nutrient availability. Moreover, biochar derived from agricultural residues like straw, sawdust, and coconut shells is increasingly utilised for sequestering carbon dioxide and enhancing the quality of soil, particularly in regions where the management of organic waste is a significant concern.\nThe primary obstacle facing biochar is its cost and the fact that it is not a universally applicable solution. Compared to other soil amendments such as fertilisers or compost, biochar is generally more expensive, which complicates its mass production. For biochar to develop into a significant industry capable of contributing meaningfully to the mitigation of climate change, it will be essential to pursue innovative methods that enhance its affordability and efficiency.\nFinally, biochar fits the bill kanta diye kanta tola!\n\nDr Quamrul Haider is professor emeritus at Fordham University in New York, US.\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our submission guidelines.\n \n",
        "headline_1": "Biochar: A climate solution from the ground up",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/biochar-climate-solution-the-ground-3882036",
        "news_paper_name": "The Daily Star",
        "publish_date": "29-04-2025"
    },
    {
        "full_article": "Despite Bangladesh's significant progress in reducing the under-five child mortality rate over the years, our success in saving the lives of newborns is dismal. Neonatal deaths—or deaths within 28 days of birth—stand at 20 per 1,000 live births, which is far higher than the Sustainable Development Goal's 2030 target of 12 per 1,000 live births. A recent UN report on Bangladesh estimated that nearly two-thirds of over 100,000 children who died before their fifth birthday in 2023 passed away within 28 days of delivery.\n\nOne reason we fail to save our newborns is the lack of well-equipped Special Care Newborn Units (SCANUs) and Newborn Stabilisation Units (NSUs). These units have played a crucial role in saving many infants born with complications. However, a lack of maintenance and delays in replacing old and outdated machinery are limiting their effectiveness. Although the government is planning expansion by establishing more SCANUs and NSUs, the focus should be more on upgrading the existing ones and ensuring proper maintenance. Unfortunately, because of corruption in our healthcare system, obvious problems are often overlooked while resources get invested in less important areas. We can only hope that such practices will be avoided in the future.\n\nAlso, we should aspire to reduce the number of premature births, or births that lead to complications, in line with the adage \"Prevention is better than cure.\" Among the leading causes of neonatal deaths are birth asphyxia and prematurity/low birthweight. These can be prevented if mothers can deliver in well-equipped primary healthcare centres that have on-duty, experienced birth attendants, or if the delivery is conducted by trained, certified, and skilled midwives. Unfortunately, we have not been able to ensure these services evenly across the country. Home deliveries still account for 30 percent of all births in Bangladesh. Additionally, malnutrition among mothers and shorter intervals between pregnancies—often the consequences of child marriage—can, and does, lead to neonatal deaths.\n\nTherefore, the government must invest more in these areas to make primary healthcare more accessible, ensure proper nourishment of adolescent girls, prevent early marriages, and raise awareness about the importance of properly spaced pregnancies. Preventing neonatal deaths is crucial for the country's future, as every child saved today may be an asset for tomorrow.\n",
        "headline_1": "Neonatal deaths must be prevented",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/neonatal-deaths-must-be-prevented-3880311",
        "news_paper_name": "The Daily Star",
        "publish_date": "29-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 29, 2025 00:00:00  \nArial Beel, the country's third largest wetland after the Sunderbans and Hakaluki Haor, presents a classic case of misguided policy infringement in natural environment. To kleptrocratic administration, natural resources so integral to maintain bio-diversity, have little value other than a means to serving their myopic interests. Strangely, though, the members of the vested interest group try to pass their exploitative schemes as development projects. Arial Beel with its vast area located in between two rivers, the mighty Padma and the Dhaleshshwari, is not only home to a diverse species of aquatic flora but also a breeding ground of a large number of sweet-water indigenous species of fish. Parts of the swamp even become fit for cultivation of Boro and vegetables with the water receding in the lean season. \nIt is no surprise that some of the fertile brains of the deposed regime with capacity for incalculable monstrosity targeted the wetland for using it as yet another grand development project. Their target was to build an airport as a major showpiece of development all because this could offer them the opportunity to loot a huge amount of money. Farmers and fishermen who have been the traditional beneficiaries with many of those owning agricultural plots there were not concerned about the intrigues that went into making a choice for the area for construction of an airport. Nor were they so much aware of the environmental disaster an airport would have wreaked on the area and the surrounding villages and human settlements but they simply did not want to lose the wetland. It is because their livelihoods and life largely depended on the resources of the wetland. \nThus the interests of farmers and fishermen of the area and that of the government clashed and in 2011, the repressive administration unleashed its brutality on the unarmed people who organized a massive protest rally in the area. The fascist character was in full display when several hundred villagers were arrested and cases were filed against half the population of the adjacent villages. Mercifully, the casualty was limited to just one death but it could be many more. The wetland was saved by the people who demonstrated tremendous courage and commitment. \nStrangely, after almost nine months of incumbency of this interim government, the cases filed at that time are yet to be withdrawn. People who should be treated as heroes are still accused of false charges. The villagers of the area had to bring to the notice of the agriculture and home affairs adviser, who was on a visit there, of the cases filed in 2011 by the previous regime. It is not known if they moved for withdrawal of the cases after the July-August uprising. Now that the cases filed left and right over the past months are under scrutiny, the Arial Beel cases should be the prime candidates for immediate review and most likely withdrawal for understandable reasons. Let the protest movement that thwarted the attempt at anthropogenic infringement serve as a model for frustrating any government misadventure with potential for environmental disaster. It should also be a deterrent to all future development projects posing a serious threat to ecology and topography.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Arial Beel farmers  deserve better",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/arial-beel-farmers-deserve-better-1745852401",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       April 29, 2025 00:00:00  \n\nThe recent Pahalgam attack, which claimed 26 innocent lives, has reignited the long-simmering tensions between India and Pakistan, casting a shadow over South Asia's fragile stability. As the two nuclear-armed neighbors engage in retaliatory measures -- from diplomatic downgrades to cross-border skirmishes -- the ripple effects threaten to destabilise a region already grappling with economic headwinds. For Bangladesh, situated at the crossroads of this geopolitical fault line, the crisis demands a deft balancing act. The nation's economic aspirations and diplomatic credibility hinge on its ability to remain non-aligned, even as external pressures mount. \nThere is no doubt that if this tension cannot be swiftly and wisely eased, the long-term repercussions for Bangladesh could be profound. Already, a perception seems to be gaining ground among certain sections of Indian policymakers that Bangladesh's present regime is tilted towards India's strategic adversaries, namely China and Pakistan. Whether or not this perception is grounded in reality, the situation warrants Bangladesh's most cautious and professional diplomatic response.\nIt is imperative, therefore, that Bangladesh act with utmost professionalism and ensure that it remains totally non-aligned in current situation. History teaches that neutrality, when sincerely pursued and carefully maintained, is a nation's strongest shield in turbulent times. Bangladesh must reaffirm its neutral stance not just in official statements, but also in actions, gestures, and conduct at all levels of government and civil society. We earnestly hope that persons in responsible positions in Bangladesh will refrain from making any comment or displaying any gesture that could question or compromise the country's neutrality.\nThe Pahalgam attack has undoubtedly added fuel to an already volatile situation. India has directly blamed Pakistan for harboring links to the attackers, a charge that Islamabad has firmly denied. In response, India has swiftly downsized diplomatic relations, cancelled visas for Pakistani nationals, and, most significantly, suspended its participation in the Indus Waters Treaty -- an agreement that has stood resilient even through full-fledged wars between the two countries.\nIndia's decision to put the Indus treaty on hold is no ordinary step. For decades, this treaty had symbolised a rare zone of cooperation between two bitter rivals. Suspending it reflects the deep anger and frustration within Indian policymaking circles. Predictably, Pakistan has termed the move an act of war and has taken countermeasures, including restricting its airspace for Indian flights. Within two days of the escalation, cross-border skirmishes erupted between soldiers of both countries -- a disturbing reminder of how quickly a regional dispute can spiral out of control.\nThe conflict's escalation comes at a time when South Asia's economies are already reeling under external pressures -- the lingering impacts of the Ukraine war, global inflation, and the imposition of new tariffs by a major global power. At a juncture when countries like Bangladesh, Sri Lanka, and Nepal are seeking pathways to economic recovery and growth, the Indo-Pak conflict has emerged as a spoiler -- a dangerous distraction from the urgent task of economic rebuilding.\nFor Bangladesh, the stakes are particularly high. It has strong and growing economic ties with India, encompassing trade, energy cooperation, and connectivity projects. Simultaneously, there have been early signs of a potential new opening in economic relations with Pakistan in recent times.\nThe region's economies, including Bangladesh, are battling post-pandemic recovery, soaring commodity prices, and shrinking export markets. India and Pakistan, both facing stagflation risks, are diverting resources from development to defense. The World Bank's recent downgrade of South Asia's growth forecast to 5.8 per cent in 2023 reflects these pressures. A protracted Indo-Pak conflict would exacerbate supply chain disruptions, energy shortages, and food insecurity, hitting Bangladesh's import-dependent economy hardest. \nAny deterioration in the regional security environment could jeopardize these ties, undermining both immediate economic interests and long-term strategic goals.\nMoreover, the conflict carries serious implications for Bangladesh's ambitions to attract foreign direct investment (FDI). After the fall of the previous regime, which had become synonymous with corruption and irregularities, Bangladesh managed to rekindle the interest of a number of international investors. The ongoing US-China trade war had also led many multinational companies to scout for alternative investment destinations, and Bangladesh -- with its strategic location and emerging manufacturing base -- was beginning to emerge as a serious candidate.\nHowever, investors are notoriously risk-averse. No matter how attractive the incentives or the opportunities, few will be willing to invest in a country that is geographically positioned beside two potentially warring nuclear-armed nations. Instability, real or perceived, is poison to investor confidence. Thus, an extended or worsening Indo-Pak conflict could deal a heavy blow to Bangladesh's economic prospects at a time when it can least afford such a setback.\nGiven these realities, Bangladesh must tread with extreme caution. Its diplomatic efforts must focus on maintaining impeccable neutrality, reinforcing friendly relations with both India and Pakistan, and playing a constructive role -- if invited -- to promote dialogue and peace. Bangladesh must also be clear-eyed about its own national interests, prioritizing the security, economic stability, and well-being of its people above all other considerations.\nAt the same time, the broader hope must remain that India and Pakistan themselves will show the necessary restraint and pragmatism in dealing with the current crisis. Neither side should allow domestic politics, emotions, or historical grievances to drive them toward further escalation. The temptation to use conflict as a tool for short-term political gain must be resisted. At the end of the day, war between two nuclear powers is a zero-sum game in which no real victor can emerge. Both nations -- and the entire South Asian region -- would stand to lose immeasurably from such a catastrophe.\nIndeed, the leaders of both India and Pakistan owe it to their own people, as well as to the region, to de-escalate tensions and return to the path of dialogue and diplomacy. There are enough challenges facing South Asia already -- poverty, inequality, climate change, and the pressing need for economic development -- that should command the full attention and resources of regional governments. To add the horrors of war to these burdens would be an unforgivable tragedy.\nIn conclusion, Bangladesh must prepare carefully for all possible scenarios while remaining steadfastly neutral and committed to peace. At the same time, it is in the collective interest of the region that India and Pakistan recognise the futility of further escalation and work toward resolving their differences through peaceful means. The future prosperity and stability of South Asia depend on it.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Indo-Pak conflict & Bangladesh: A call for caution",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/indo-pak-conflict-bangladesh-a-call-for-caution-1745852496",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       April 29, 2025 00:00:00  \n\nIn the crowded streets of Dhaka, rickshaw is an essential nuisance. A frail, three-wheeled rickshaw, pedaled by a driver who may be in his early twenties or even late sixties and hurling abuse at another rickshaw driver pedalling past him is a common sight on the streets of Dhaka. Since it is risky for both fast and slow-moving vehicles to use the same road, the city authority had since long been thinking of rickshaw-free Dhaka streets. Hence came the idea of VIP roads. But rickshaws are often seen plying the VIP roads breaking the rules while the traffic police looking the other way. In fact, cycle rickshaws, (different from pulled rickshaw which first appeared in Kolkata in India at the turn of the 19th century), as historical records go, were first introduced in Narayanganj and Netrakona by British jute merchants in the late thirties of the last century. However, Chattogram had its first rickshaw brought from Myanmar in the early 20th century. It appears the rickshaws have become too entwined with the capital city's history and culture to be removed by any swift official diktat.\nUnderstandably, the streets of Dhaka could not be rid of rickshaws. Meanwhile, battery-run rickshaws have joined the pedalled ones in large numbers further worsening the chaos called Dhaka traffic. These are improvised version of existing rickshaws and their makers do not seem to follow any structural principles while creating these contraptions. And that is also not expected as the same old rickshaw mechanics are behind the design of the battery-run rickshaws. Recently, a deputy commissioner of the Dhaka Metropolitan Police (DMP) told the media that managing the battery-run rickshaws is proving to be a big problem now. That is because, the police look after traffic discipline, not issuing of permission for those vehicles to use the city's roads. Clearly, there is a lack of coordination between different city authorities. But when exactly did these battery-operated rickshaws first appeared on the city streets? A report says that these vehicles, also known as autorickshaws, or simply, autos, among the community of rickshaw drivers, were first introduced in the city in 2010. However, seeing that the number of these vehicles has been increasing uncontrollably and swamping the most busy city streets, last year on November 19, the High Court ordered that movement of battery-run rickshaws within the metropolitan area of Dhaka should be banned within three days (from November 19, 2024). But the protest demos and rallies blocking the streets practically brought the city to a standstill. Eventually, the prosecution appealed against the High Court rule. Finally, following a status quo issued by the apex court on November 15's HC directive, the battery-run rickshaws again returned to the streets of Metropolitan Dhaka. The sudden rise of battery-operated rickshaws has to do with smaller investment and fetches better return on investment than a CNG-run autorickshaw. Notably, though the actual cost of CNG-run auto is around Tk.600,000, after obtaining license its price shoots up to around Tk.2 million. But comparatively, its return on investment is lower. Unsurprisingly, many small investors are behind the battery-run rickshaws. Many passengers prefer the battery-operated rickshaws to CNG autos because the former is easily available and cheaper than CNG autos. \nGranted that the battery-run rickshaws are gaining popularity due to the advantages of their low fares and ubiquity. But then should these improvised vehicles, not certified by any appropriate agency about their roadworthiness be allowed to grow in such numbers unchecked? The city authorities need to think long and hard about the matter. In this connection, there is a development that may provide an answer to the tricky issue. A team of BUET is learnt to have designed a rickshaw that is both safe and low-cost. The Dhaka North City Corporation (DNCC) reportedly expressed interest about BUET-designed rickshaw. In that case, the existing rickshaws could be gradually phased out from the city, thinks DNCC authority. \nMaybe this new, BUET-designed rickshaw is the answer to Dhaka's traffic woes.\nsflim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Rickshaws of Dhaka city",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/rickshaws-of-dhaka-city-1745852558",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 29, 2025 00:00:00  \n\nIn many Upazila Health Complexes, there isn't even a single pharmacist appointed. Even where pharmacists are present, they are often burdened with excessive administrative tasks, rendering them unable to perform their essential duties effectively. Furthermore, most community clinics and union health centers lack any provision for pharmacist appointment, although medicine distribution continues unchecked. This leads to widespread issues such as the delivery of expired drugs, incorrect medication, and improper storage practices.\nDespite significant government expenditure on medicine supplies, the absence of qualified pharmacists results in poor resource utilisation, putting public health and safety at serious risk. The current situation is unacceptable and demands urgent intervention. The Directorate General of Health Services and other relevant authorities must take immediate action and ensure the appointment of sufficient pharmacists at all government healthcare facilities. \nProgga Das\nStudent, Department of Economics\nEden Mohila College\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Crisis of pharmacists in gov. health centre",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/crisis-of-pharmacists-in-gov-health-centre-1745852578",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-04-2025"
    }
]