[
    {
        "full_article": "The Qingdao meeting of Defence Ministers of the Shanghai Cooperation Organisation (SCO), that ended without a joint communiqué, indicates trouble within the 10-nation grouping. Defence Minister Rajnath Singh was forced to withdraw from the joint declaration as it contained no reference to terrorism at the behest of “one nation” — a reference to Pakistan. This is understandable, given that the meeting comes just weeks after the Pahalgam attack, and Operation Sindoor, after which India’s resolve to fight terrorism has redoubled. What sounds more surprising is that not only did the draft resolution fail to mention terrorism but member-states including host China and Russia had even reportedly considered referring to “disturbances in Balochistan”, at the instance of Pakistan, while leaving out mentions of the Pahalgam attack and cross-border terrorism, that India asked for. This is stark given that the SCO’s founding Charter in 2002 focused on the need to build “mutual intraregional efforts to curb terrorism, separatism and extremism”, and the Director of SCO’s signature Regional Anti-Terrorist Structure was present. Statements by the SCO Secretariat and the Chinese Foreign Ministry stuck to anodyne statements such as “...cooperation ...on modern security challenges and threats”. All eyes will now be on the SCO Foreign Ministers’ July meet and the SCO Summit in August-September to see if India’s concerns are more appropriately addressed.New Delhi must study whether there are shortcomings in delivering its message on the three-pronged “new normal” Prime Minister Narendra Modi announced after Operation Sindoor. In particular, China’s unhelpful role as Chair on the issue is disquieting, given its recent thaw with India. Unlike the SAARC grouping, where India held sway, the SCO is more focused on the original founders China, Russia and Central Asian States. Mr. Singh’s participation followed closely on the heels of India disassociating itself from a statement on Israel’s June 13 attack on SCO member Iran as it was critical of Israel. Post-Operation Sindoor, the government sent parliamentary delegations to 32 countries, but not to any SCO member-country. It is possible that the government lost a chance to give the grouping any prominence by doing so, although External Affairs Minister S. Jaishankar chaired a meeting of the India-Central Asia forum in June. India’s decision to skip hosting an in-person Summit of the SCO during its turn in 2023 could also still rankle. Breaking with the grouping, which is an important regional forum, will simply leave an open platform for Pakistan. Instead of crying foul, the government must convince members that their interests lie in strengthening cross-regional support against terrorism. Published - June 28, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        Iran\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Afghanistan\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Israel",
        "headline_1": "​Missed opportunity: On India, the terror fight and the SCO",
        "headline_2": "India should convince Shanghai Cooperation Organisation to take a strong stance against terrorism",
        "link": "https://www.thehindu.com/opinion/editorial/missed-opportunity-on-india-the-terror-fight-and-the-sco/article69745301.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "29-06-2025"
    },
    {
        "full_article": "India has been ranked among the top 100 countries in the Sustainable Development Report for the first time since this data began to be published by the Sustainable Development Solutions Network (SDSN) since 2016. The SDSN is an independent body under the aegis of the UN, whose publications are tracked by policymakers and governments. In 2016, India was ranked 110th out of 157 countries, making steady progress to reach 99 this year out of an expanded basket of 167 nations with better metrics and more granular comparisons. But it is no time to rest on this laurel. India must look at why this incline, by 11 points, was not achieved any sooner and the gaps to focus on. From a developmental perspective, the SDSN ranks India as having fared better in poverty reduction (SDG 1) even as India’s poverty estimation continues to be mired in controversy due to a lack of publicly available consumption expenditure data since 2018 and the poverty line (Rangarajan line ~₹33/day rural, ₹47/day urban) not having been updated. Proxy data suggest a considerable poverty reduction, almost halving between 2012 (22% based on NSSO data) and 2023 (World Bank – 12%).But SDG 2 (zero hunger) has remained a cause for concern. It also reveals the wide disparity between income groups and rural and urban areas on access to a nutritious diet. The National Family Health Survey (NFHS) estimates that over a third of Indians (35.5%) were stunted (NFHS-5, 2019-21), only marginally better than 38.4% (NFHS-4, 2015-16). Similarly, wasting, which is low weight for height, reduced from 21.0% to 19.3%. Obesity in the working age population (15-49 years) has almost doubled between 2006 and 2021, and concentrated in wealthier urban areas. Electricity access (SDG 7) is another indicator where India has done well. While the country has achieved near universal household electrification in the past two decades, the quality of power and duration vary vastly based on regions and urban/rural fault lines. It is, however, laudable that India today ranks as the fourth largest renewables capacity deployer, mainly solar and wind. And while India has bettered its score in infrastructure provision (SDG 9), noteworthy additions being rapid mobile penetration and financial inclusion through UPI-linked digital payments gateways, COVID-19 revealed the stark difference between rural and urban Internet penetration, which must be addressed to achieve even higher educational outcomes (SDG 4). It is telling, however, that throughout the Modi years, India’s performance in governance, the rule of law, press freedom and strong and independent institutions (SDG 16) has been lagging.\r Published - June 28, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Sustainable Development Goals\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        United Nations\n                    \n                            /                      \n                        \n                        poverty\n                    \n                            /                      \n                        \n                        personal income\n                    \n                            /                      \n                        \n                        rural-urban divide\n                    \n                            /                      \n                        \n                        nutrition and diet\n                    \n                            /                      \n                        \n                        obesity\n                    \n                            /                      \n                        \n                        population\n                    \n                            /                      \n                        \n                        electricity production and distribution\n                    \n                            /                      \n                        \n                        renewable energy\n                    \n                            /                      \n                        \n                        mobile phones\n                    \n                            /                      \n                        \n                        Coronavirus",
        "headline_1": "No time to rest: On India’s ranking and the Sustainable Development Report",
        "headline_2": "India did well in climbing up SDG rankings, but falls short in governance",
        "link": "https://www.thehindu.com/opinion/editorial/no-time-to-rest-on-indias-ranking-and-the-sustainable-development-report/article69745108.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "29-06-2025"
    },
    {
        "full_article": "We are not free merely because there happens to be no restraint on our actions. True freedom means we aren’t subject to the arbitrary will of one person or institution\nJokes, poems and social media posts that trigger outrage among certain sections of society dominate the news and have fuelled debate about the freedom of speech and its limits. Rarely, however, do we reflect on what freedom actually implies.\n\nIndeed, sometimes it seems as if our main concern is to secure the freedom of endless consumer choice.\nRead the full story on TOI+.\n\n",
        "headline_1": "What price liberty",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/what-price-liberty/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-06-2025"
    },
    {
        "full_article": "From Iran to Gaza to Ukraine, a pattern of unchecked conflict is bypassing law and diplomacy, taking the world towards a dangerous new normal\nSomeone recently likened the current condition of our bombed and bloodied world to the ‘Warring States period’, a centuries-long era in ancient China that was marked by the brutal logic of zero-sum politics and unremitting violence.\n\nThe term may be an eminently good fit. “Wars happen because the ones who start them think they can win,” Margaret Atwood wrote 30 years ago, in her bleak, beautiful poem The Loneliness of the Military Historian.\nRead the full story on the TOI+.\n\n",
        "headline_1": "Global disorder: No rules, all war",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/global-disorder-no-rules-all-war/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-06-2025"
    },
    {
        "full_article": "4 books, 4 vivid renderings of the country\nShah of Shahs (1982) by Ryszard Kapuscinski is a reporter’s account of the days leading up to the 1979 Islamic Revolution. It paints a vivid picture of Iran’s evolution from the rise of the Pahlavis – how a young Reza Khan, an officer in the Persian Cossack Brigade, went on to stage a coup with the help of the British and become the new Shah – through premier Mosaddegh’s burst of nationalism and democracy that was again sabotaged by Western oil interests, to finally the backlash against the throne that coalesced around Ayatollah Khomeini. \nInterestingly, a 1978 article aiming to discredit Khomeini by alluding to his foreign origins – his grandfather came from India – and casting aspersions on his mental health, was the trigger for the revolution. This history weighs heavy on Iran even today, with the struggle for “dignity” animating internal political discourse.\nReading Lolita in Tehran: A Memoir in Books (2003) by Azar Nafisi is an autobiographical account of a woman who finds herself suffocated by the arbitrary restrictions and punishments of her country. After resigning her university job, she creates, clandestinely, a classroom with more freedoms than exist outside. For two years, every Thursday, seven students gather in her home, taking off their veils, to peruse the relation between fiction and reality. They read A Thousand and One Nights and the forbidden, ‘non-revolutionary’ canon, Nabokov to Austen.\nLolita captures, for them, the texture of living in a totalitarian society. As movie houses were set on fire Ayatollah Khomeini had declared, “We are not against cinema…we are against prostitution.” Humbert rapes Lolita, robs her of childhood, and exonerates himself by implicating her, as vulgar vixen, vile slut, seducer. An illusory world makes saviour and executioner indistinguishable. \nRepublics of Myth: National Narratives and the US-Iran Conflict (2022) by Hussein Banai, Malcolm Byrne, John Tirman explores how two nations in a cold war for 40 years managed to deal on a complex issue – Iran’s nuclear programme – and then let it unravel. Crediting or criticising individuals – Obama-Rouhani or Trump – is incomplete reading. It’s the two nations’ centuries old narratives that constantly clash, and determine the relationship. Iran’s narrative is of suspicion of foreign involvement, US’s is of self-glorifying idealism. \nThese narratives, sustained by history, culture, ideology, overpower ‘strategic logic’. It took 18 years to reach an n-deal, driven by powerful state interests – existential for Iran’s regime survival, for US, a need to contain Iran. Yet, it was the stories nations tell themselves weaving history with myth that reinforced the US-Iran conflict – a fraught relationship itself became the key narrative. \nIran’s Rise and Rivalry with the US in the Middle East (2025) by Mohsen M Milani: In 1971, Iran was America’s top arms buyer, and ‘policeman of the Persian Gulf’ – a peg above Saudi – in Nixon’s eyes. Oil revenues were strong, yet the revolution that deposed the Shah and ushered in a theocracy was just eight years away. How did US, seen as a friend under Truman in the 1940s, become a foe so soon? One that Khomeini described as “the great Satan, the wounded snake”.\nIn Milani’s assessment, this rupture occurred because Iranians resent attacks on their sovereignty – which they have lost to Greeks, Arabs, Mongols, Turks and Britons over millennia. The 1953 coup – Eisenhower ganged up with Churchill to oust Mohammad Mosaddegh, patriotic Iranian PM who nationalised the Anglo-Iranian Oil Company – and continued interference since, were the deal-breakers.\n\n",
        "headline_1": "Iran: From the inside as well as outside",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/iran-from-the-inside-as-well-as-outside/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-06-2025"
    },
    {
        "full_article": "India needs a sophisticated China playbook \nSCO defence ministers’ meet showcased the Pakistan-China nexus, which mainly focused on undermining India’s stand on terrorism. The proposed joint statement was opposed by India after it was found that Pakistan, with China’s complicity, was blocking mention of the Pahalgam terror attack but was pushing for inclusion of ‘terrorist activities’ in Balochistan and the situation in Kashmir. This would have been shocking were it not part of a well-established tactic. \nBut, as familiar as it is, it should certainly inform the ongoing thaw in New Delhi-Beijing ties. Apart from aiding its ‘iron brother’ Pakistan, China itself remains a sophisticated strategic challenge for India. Therefore, utmost caution must be maintained in all dealings with Beijing. China’s United Front strategy means that any lever of the Chinese state – including private companies – can be leveraged by Beijing to further its strategic interests. Case in point, three massive tunnel boring machines for the Mumbai-Ahmedabad high-speed rail corridor remain held up at a Chinese port awaiting clearance. They were supposed to start arriving last Oct. Similarly, China is easing its urea export ban, but not for India. \nIndia needs two approaches here. It must power on with building indigenous supply chains and tech in critical sectors to reduce dependence on China. The PLI scheme for Active Pharmaceutical Ingredients has shown some results. It needs more backing. In the same vein, China’s monopoly on rare earth permanent magnet motors can be tackled through development of microelectronics. For R&D collaborations, we can reach out to Taiwan. Second, given the current geopolitical play, it’s vital to conclude the trade deal with US. This is now a strategic imperative. India needs options today. And the trade deal with US will provide New Delhi with good leverage vis-à-vis Beijing. It’s time to play smart.  \n\n",
        "headline_1": "Gaming the dragon",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/gaming-the-dragon/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-06-2025"
    },
    {
        "full_article": "The intensification of mob violence over the past 10 months has cast a dark shadow over the state of law and order in the country. There is no denying that the state's failure to act swiftly and decisively has, to some extent, emboldened mobs and contributed to a climate in which vigilante justice is becoming increasingly commonplace. In several such cases, the inaction of security forces appeared to signal even implicit acceptance of these acts. In other instances, police intervention came too late to prevent harm, and only occurred after footage of the violence sparked outrage on social media. All of this is entirely unacceptable.\n\nIn a video clip that went viral recently, some individuals were seen placing a garland of shoes around the neck of former Chief Election Commissioner KM Nurul Huda and striking him across the face with a shoe before handing him over to the police, who were present at the scene to arrest him in a case. As we have then stated, there can be no justification for violating the rights of an arrestee or anyone involved in a case in this manner. Another recent incident took place in Lalmonirhat town, where a barber and his son were beaten by a mob and later detained by police, allegedly for hurting religious sentiment. Regardless of the accusations, both individuals deserve their day in court in any society that claims to uphold the rule of law.\n\nAccording to Ain o Salish Kendra, since the fall of the Awami League regime, 179 people have been beaten to death by mobs. Add to that the long list of injuries and damaged properties courtesy of the marauding mobs. Moreover, if we examine yearly data on mob killings since 2015, there has been a marked increase since August 5, 2024. Although the interim government cannot be faulted for the mob violence that took place in the initial days after it took office—when security forces, particularly the police, were barely functional—it cannot shirk responsibility for the violence that has occurred over the past 10 months. There is no doubt that the government has failed to take meaningful action in many cases to curb mob violence, despite repeated assurances from various advisers.\n\nA case in point is the home adviser's response when asked how many people had faced action for mob violence: \"I don't know the exact number,\" he replied. Why is that the case? The home adviser should be the first to know the exact number if he and his government are serious about curbing mob violence. It is high time the government took this matter seriously and enforced the rule of law uniformly across the country.\n",
        "headline_1": "Rule of law, or rule of mobs?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/rule-law-or-rule-mobs-3926076",
        "news_paper_name": "The Daily Star",
        "publish_date": "29-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 29, 2025 00:00:00  \nIn what appears to be an attempt to fast-track renewable energy adoption, Chief Adviser Professor Muhammad Yunus recently directed the installation of rooftop solar panels on all government buildings including educational institutions and hospitals. The move is meant to go hand in hand with Bangladesh's Renewable Energy Policy 2025 which targets sourcing 20 per cent of electricity demand from renewables by 2030. As per the latest IRENA report, Bangladesh remains significantly behind its regional peers in solar electricity generation, with only 5.6 per cent of its power coming from solar, in contrast to 24 per cent in India, 17.16 per cent in Pakistan and 39.7 per cent in Sri Lanka. To meet upcoming target, tenders for 55 land-based solar plants have already been floated, but their full implementation could take until 2028. Hence, the government is now looking to rooftop spaces as a more immediate solution.\nThere are, however, significant doubts over the practicality and efficacy of this large-scale rooftop solar rollout. First off, the claim that 5.6 per cent of national electricity comes from solar power needs further investigation. It is plausible that this figure is indicative of installed capacity rather than actual output, which may be much lower given that many rooftop units stopped functioning soon after installation. Some high-rise buildings installed solar systems only to meet RAJUK's compliance requirements, and it is doubtful whether these systems are operational or connected to the grid in any meaningful way. Before allocating resources to this initiative, policymakers must distinguish between mere installation and reliable energy generation, particularly in a country where public infrastructure projects often neglect long-term maintenance.\nImplementing solar panels across all government buildings would require an enormous investment, possibly running into thousands of crore taka. Without proper planning, this could turn into a massive misallocation of public funds. There is a real risk that many of these panels would exist only on paper, much like the proverbial cow that exists in the book but not in the shed. Government hospitals, in particular, need uninterrupted and stable electricity to run life-saving equipment. Poorly installed systems, equipment failures or even overcast skies during the rainy season could damage sensitive medical devices and endanger lives. Similarly, schools and colleges that are already struggling with limited resources may end up with faulty or inefficient solar systems that become long-term financial burdens. The idea of public-private partnership, where private companies install and maintain systems out of their own commercial interest, appears promising at first glance, but previous experiences with such arrangements do not inspire much confidence. The government must also assess whether older buildings can bear the added weight of solar panels, and whether institutions in shaded or congested areas get enough sunlight to justify the cost. A nationwide rollout without checking these basic facts would be irresponsible, no matter how noble the intentions behind it.\nBefore moving ahead, the government must undertake a thorough feasibility study to examine whether a nationwide rooftop solar rollout is truly worth the investment. As part of this, it must assess the existing installations, especially those installed under the RAJUK directive, to see how many are still functioning, how much electricity they actually generate and what maintenance issues have arisen over time. The study must also evaluate costs, technical challenges and the potential for grid integration across different categories of buildings. Only after establishing the project's practical benefits and sustainability should large-scale implementation proceed. There is no denying that renewable energy is the way of the future, but rushing in without proper groundwork could easily turn a well-intentioned plan into a costly misadventure.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Rooftop solar: Caution before commitment",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/rooftop-solar-caution-before-commitment-1751119948",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       June 29, 2025 00:00:00  \nThe news that Bangladesh-linked money in Swiss banks increased by around 23 per cent last year has drawn attention of various quarters in the country. The significant rise in deposits has triggered widespread discussions, because of the fact that the notable increase did happen during a year when the country witnessed a mass uprising and the ouster of autocratic Prime Minister Sheikh Hasina. Many argued that the rise in deposit recorded since beneficiaries of the ousted regime transferred their ill-gotten financial assets and parked them in the safe vaults of the Alpine banks.\n\nThe data, released by the Swiss National Bank (SNB) on June 19, showed that Bangladesh-linked funds in the banks in Switzerland stood at CHF (Swiss Franc) 598 million in 2024, equivalent to Tk. 89.12 billion at the current market price. The amounts were CHF 58.38 million (approximately Tk 8.69 billion) in 2022 and CHF 26.38 million (approximately Tk 3.93 billion) in 2023. Bangladeshi money in the Swiss banks reached its peak in 2021 when the amount was CHF 871.76 million. \nIt is worth noting that Bangladeshi money in Swiss banks refers to deposits linked to Bangladesh in various ways. Besides Bangladeshi institutions and citizens, money deposited by firms and individuals with links to Bangladesh is also included. Several Bangladeshi nationals working in Switzerland and other European countries have their money in these banks. Bangladesh-based business houses also have accounts there. Moreover, there should be no reason to claim that all money deposited in Swiss banks are dirty or illegal money. \nThe popular perception is that people across the world keep their illicit income in Swiss banks, where the secrecy of depositors is highly protected. This perception is not baseless. The nature of secrecy makes Switzerland one of the leading tax havens, where individuals' or businesses' income or wealth is taxed at very low rates, if at all. As the beneficiaries of tax havens typically don't reside or operate in these countries or jurisdictions, tax havens also provide secrecy to conceal non-residents' incoming wealth from other governments. Therefore, tax havens offer lower tax rates, along with a legal system that ensures confidentiality for non-residents. That's why tax havens are termed as offshore jurisdictions or secret jurisdictions. \nHowever, the significant surge in Bangladeshi money in Swiss banks over the past year is a cause for concern. It's not improbable that those who illegally transferred money from Bangladesh to various destinations in recent years have once again moved their funds to Swiss banks for better protection of their ill-gotten financial assets. The fall of the Hasina regime and the subsequent efforts of the Yunus-led interim government to identify and recover illegally flown money may have alerted those who have stashed their black money in different tax havens. There are indications that over the years, some prominent businessmen, along with several politicians and bureaucrats, have stashed their black money in Singapore, the United Arab Emirates (UAE), Canada, Hong Kong, the United Kingdom (UK), and the United States (US). Some of them may now be switching to Swiss banks, as Bangladesh lacks an agreement with Switzerland on the exchange of information on financial accounts. \nDue to pressure from various countries, primarily the United States (US), the Swiss government has begun to relax the rules of bank secrecy. By joining the OECD accord on the exchange of banking information in 2014, the country opened the window to share information of the non-resident account holders in Swiss banks with the respective countries. In 2017, legislation was passed there allowing the Swiss government to share data with other countries under the Automatic Exchange of Information (AEOI). It has been on the rise. So far, more than 100 countries have AEOI agreement with\nSwitzerland. Switzerland implements the AEOI in accordance with the Multilateral Competent Authority Agreement on the Automatic Exchange of Financial Account Information (MCAA). Within the European Union (EU), the AEOI has been implemented based on a bilateral international treaty. India and Pakistan are the two countries in South Asia that have an AEOI agreement with Switzerland. \nUnder the AEOI system, banks in Switzerland disclose financial account data to the Swiss authorities. The Swiss authorities then automatically forward the data to the authorities in India or Pakistan, enabling them to examine the foreign financial account data. The primary purpose of the AEOI is to determine the extent to which taxpayers in a country hold bank accounts in Switzerland or any other country and whether they have transferred funds in a manner that avoids or evades taxes. The Swiss authorities, however, are committed to ensuring that information shared with a country does not breach international data protection requirements. Data sharing and receiving countries must adhere to the confidentiality clause of the AEOI. India has received a series of data about the Indian nationals and entities who have stashed money in Swiss banks after signing a bilateral agreement with Switzerland regarding AEOI in 2017.\nDuring the Hasina regime, discussions arose about recovering Bangladeshi funds from Switzerland. The autocratic government, however, did not take any effective measures to sign a bilateral agreement with the Alpine nation. In other words, the ousted regime kept the window open for illicit financial flows from the country. At that time, the central bank prepared an analytical note on Bangladesh-linked Swiss money, which claimed that both the assets and liabilities in the Swiss banks were generated mainly due to foreign trade transactions. This situation underscores the urgent need for bilateral agreements to prevent such financial flows in the future.\nThere is, however, another source to know the amount of Bangladesh-linked money in the Swiss banks. Locational Banking Statistics (LBS), prepared and released by the Bank for International Settlements (BIS) quarterly, also provides some information. LBS data showed that money deposited by Bangladeshis (non-bank or individual) in Swiss banks declined in the last two years. The amount was $100 million in 2022, which decreased to $63 million by the end of 2023 and further declined to $43 million in 2024. The table also showed that (table-1) individual deposits in Swiss banks are much lower as per SNB statistics than shown in BIS locational banking statistics. The Bangladesh Bank may investigate the matter further and provide a comprehensive explanation on the issue.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "What drives BD money into Swiss banks?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/what-drives-bd-money-into-swiss-banks-1751120218",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       June 29, 2025 00:00:00  \nThe International Monetary Fund's (IMF) approval of a US$1.3 billion disbursement of the third and fourth tranches of Bangladesh's $4.7 billion loan programme may help improve donors' sentiment and more foreign funds may be released in the coming months. But given the lingering state of political uncertainty there is little reason to be sanguine about a swift economic recovery.\nThe IMF's assessment of Bangladesh's economy also reinforces this cautionary outlook. While granting the disbursement of additional loan amount for Bangladesh, the global lender highlighted four major risks facing Bangladesh's economy: persistent political instability, continued tight monetary and fiscal policies, rising global trade barriers, and growing stress in the banking sector. In light of these challenges, it revised its economic growth forecast for Bangladesh from 6.5 per cent to 5.4 per cent in the next fiscal.\nThis subdued projection aligns with warnings from economists, who voiced concern at a recent post-budget dialogue hosted by the Centre for Policy Dialogue (CPD). They pointed to a growing sense of uncertainty that is stifling investment and slowing down economic momentum. GDP growth fell to just 3.97 per cent in the current fiscal year, which is the lowest in 34 years, apart from the pandemic period. Moreover, import of capital machineries has also dropped significantly, while private-sector credit growth slumped to a decade low of just 7 per cent in the first quarter of 2025.\nIn the face of sluggish investment, weak growth, and rising unemployment and poverty, the top priority for economic revival should be the stimulation of local investment. Yet, business leaders have voiced frustration at the CPD seminar that, while the interim government has been actively courting foreign investors, domestic investors continue to face inadequate support, unreliable utility services, and policy uncertainty.\nAdding to their burden are surging operational costs, driven largely by rising interest rates. Business leaders have expressed their frustration at being made to bear the brunt of this economic burden, especially when many of them had no role in the financial mismanagement of the previous government that contributed to the current crisis. They have called on the authorities to hold those responsible for past misappropriations accountable, rather than passing the cost on to legitimate enterprises. The alleged approach of not bringing local investors into confidence is clearly proving detrimental to the economy, leaving many in a wait-and-see mood.\nThe interim government deserves some credit for modest progress in lowering inflation and initiating several reform measures aimed at stabilising the economy and put it on the growth path. Yet, these efforts are being undermined by persistent political uncertainty, which continues to act as a drag on investor confidence and policy implementation. The rapport between economic recovery and political stability should not be undermined.\nMeanwhile, even though inflation is projected to ease, its lingering effects continue to weigh heavily on the low and middle income families. A recent World Bank report highlights an alarming rise in poverty. It warns that the national poverty rate will reach 22.9 per cent in 2025 from 18.7 per cent in 2022. Inflation and joblessness are key contributors, as the cost of living continues to outpace income growth. The report estimates that up to 3 million people may fall into extreme poverty, defined as living on less than $2.15 a day (adjusted for purchasing power parity), barely enough to afford basic necessities.\nTherefore, the economic cost of political uncertainty is not merely a matter of delayed investment or recovery, it directly affects the everyday lives of ordinary citizens. So the question is what measure is the government taking to clear the cloud of uncertainty? \nThe Consensus Commission has been holding dialogues with political parties, yet a breakthrough on reform measures remains elusive. When there is deep ideological divides among political parties regarding fundamental state principles, it is an uphill task to reach a consensus. In this context, the government would do well to focus on facilitating agreement among the parties on a minimum set of reforms necessary to ensure a peaceful and inclusive election and leave broader reform measures to be decided by the public through democratic processes.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Economic cost of uncertainty",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/economic-cost-of-uncertainty-1751120277",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-06-2025"
    }
]