[
    {
        "full_article": "The southwest monsoon stormed into Kerala, a week ahead of its scheduled arrival on June 1. This was not a surprise because as early as the first week of May, meteorologists had tipped off the country about its early arrival over the Andaman Sea — a crucial pit stop before its advent over Kerala. A May onset is not an exceptional occurrence — it has happened four times since 2014 — but additional support from a pre-cyclonic circulation in the Arabian Sea gave it a tremendous surge due to which several parts of Maharashtra and the Konkan coast saw the monsoon reach their shores earlier than anticipated. It was the first time in 35 years that Mumbai, which usually welcomes the monsoon around June 10, saw a May onset. Even prior to the onset, the India Meteorological Department (IMD), as far back as mid-April, had forecast an ‘above normal’ monsoon rainfall, or 5% more than the historical average of 87 cm. Following the monsoon’s onset, it has retained this outlook of ‘above normal’ rain, and has since increased it to 6% above the average.One of the quirks of how the IMD measures monsoon rainfall is that it only counts rainfall from June 1 to September 30 as ‘monsoon rainfall.’ Thus all the rain that has flooded Kerala, Mumbai and other cities since May 24 (when the monsoon landed) is accounted as ‘pre-monsoon’ rainfall. In its update, the IMD said that it anticipates June to receive ‘above normal’ rains. This means that the rains so far are a mere trailer to what is to come. This could be good news for kharif sowing and help the country improve its stocks of grain as well as shore up reserves for exports. The way the monsoon and forecasts are framed in the Indian context is that more rain is seen as a positive, given its connection to agriculture and that a large part of India is entirely reliant, disconcertingly, on the monsoon for a healthy crop. With accelerating urbanisation, excess rains are not always an unmitigated good. The floods that overwhelm cities are no longer restricted to the major metropolises but also tier-2 and tier-3 towns. While several of these cities are not even equipped for ‘normal’ rainfall, administrations — State and central — must seriously incorporate the portent from climate change which translates into citizens navigating erratic rainfall and greater disruptions from floods. While improved and high-resolution forecasts are a positive development, they have limited value without a wide-ranging societal effort to incorporate its warnings to improve everyday living. Published - May 29, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        Monsoon\n                    \n                            /                      \n                        \n                        Andaman and Nicobar Islands\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        Maharashtra\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        rains\n                    \n                            /                      \n                        \n                        forecast\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        flood",
        "headline_1": "​Sound and fury: On the monsoon",
        "headline_2": "India needs a societal effort to factor in IMD forecasts in everyday life",
        "link": "https://www.thehindu.com/opinion/editorial/sound-and-fury-on-the-monsoon/article69629451.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "29-05-2025"
    },
    {
        "full_article": "The French Open 2025, which got underway on Sunday, at once seems empty and so full of promise. It is the first edition without the now-retired 14-time champion Rafael Nadal, who had established such a stranglehold in Paris that Roland-Garros, during a soul-stirring ceremony on the opening evening, immortalised his footprint — quite literally — on Court Philippe-Chatrier. But in his absence, the field is now open for a new player to stake claim. Defending champion Carlos Alcaraz is the leading candidate and is closely followed by World No. 1 Jannik Sinner. Spaniard Alcaraz has warmed up well, with Masters titles in Monte Carlo and Rome, and the Italian Open triumph, which came with a straight-sets victory over Sinner in the final, seen as the sounding of the bugle. But Sinner, despite the defeat, will not be disheartened. Rome was his first tournament after serving a three-month doping-related suspension, and a five-match winning run, including a 6-0, 6-1 demolition of two-time French Open finalist and World No. 8 Casper Ruud, proved that elite tennis was still part of his muscle memory. Novak Djokovic, the 24-time Major winner, is without a Slam since US Open 2023, his worst run since 2016-18, but by winning in Geneva last week — his 100th Tour-level title — he is, at least, back in the conversation. Alexander Zverev, a semifinalist or better for four successive years in Paris, will want to shrug off his patchy recent form and show that he belongs among the world’s best.The women’s field is airier than the men’s, for three-time defending champion Iga Swiatek is far from being in tournament-winning form and a handful of stars are jostling to fill the space. The Polish player, hands down the best clay-court practitioner among women of the present era, has not even reached the final of a tune-up event and has an incredibly difficult draw to grapple with. Her principal rival and World No. 1 Aryna Sabalenka looks primed to take advantage even as those like No. 2 Coco Gauff, No. 4 Jasmine Paolini – finalist in 2024 – and No. 7 Qinwen Zheng are snapping at her heels. Three-time Major winner Sabalenka is playing the best tennis of her career, and made the final in Stuttgart on indoor clay before bagging the Madrid trophy recently. Gauff, despite looking undercooked, reached back-to-back finals in Madrid and Rome while Paolini secured the Italian Open. Though without a title in the lead-up, Zheng will have happy memories of Paris, a place where she won the 2024 Olympic singles gold medal. An outside bet would be the all-action Jelena Ostapenko, the Roland-Garros titlist in 2017 who also triumphed in Stuttgart recently. A victory for her will be in line with the women’s Tour’s propensity to throw up an eclectic array of champions.\r Published - May 29, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        tennis\n                    \n                            /                      \n                        \n                        France\n                    \n                            /                      \n                        \n                        Olympics",
        "headline_1": "​Hot on clay: On the French Open",
        "headline_2": "The French Open looks truly open in both men’s and women’s sections",
        "link": "https://www.thehindu.com/opinion/editorial/hot-on-clay-on-the-french-open/article69629463.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "29-05-2025"
    },
    {
        "full_article": "It’s in the news but I’m confused\nLast weekend, TOI put me in a quandary. Saturday’s top edit was called ‘The Importance Of Being Earnest’. It wasn’t about Wilde’s misplaced baby. It was about untamed consequences of international misunderstanding. Deploying examples from military history it conveyed real-time caution to the seven delegations of multi-party MPs who’ve fanned out to present the truth about Pak-sponsored terrorism. The edit warned that this important attempt to remove any misunderstanding about our position harbours a possibility of the message itself being mis-understood in any of the targeted 33 countries. Ignoring Hindi jihadis – and subtly promoting its own USP – TOI pitched English as the best medium for the message. I’ll  say ‘Three, or rather 33, cheers!’ to that. Provided the messengers themselves – ‘experienced and articulate’ though they are – have been fully briefed not only on What, but more so on How. Why? Because, like truth and Tharoor, English is seldom plain and almost never simple. \nThen STOI rah-rah-ed Banu Mushtaq’s International Booker win. No problem with that. It’s the equal applause for the translation that’s causing my confusion. Illa, illa, I’m not thoo-thoo-ing Deepa Bhasthi’s raw, hybrid English moulded to the contours of colloquial Kannada. I’m all for empire currying the King’s angrezi. But then what happens to the previous para’s stance? Imagine the Babel if our diplomats start adding their own idiomatic tadka? More to my point, do aforesaid ‘global-outreach’ MPs have linguistic handlers? Parroting script no can do. Complex questions will demand nuanswers. One misstep could make the whole exercise stumble.\nEarlier remarks on Col Sofiya further complicate this ‘propah-improppur English’ business. The MP mantri tried shrugging off a bigoted and sexist slur as a mere ‘linguistic mistake’. The SIT will hopefully rubbish this MCP’s men-dacity as SC did his non-apology. My question concerns Dr Ali Khan. Call me elitist, but how ‘linguistically’ equipped are those cops tasked with fine-toothcombing all his past posts written in professorial English? With ‘anti-national’ the semantic chameleon of our time, I hope no dis-understanding there.   \n                              ***         \nAlec Smart said: “Mumbai’ metro stations submerged. Undergrounded. ”\n\n",
        "headline_1": "Hazy Angrezi",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/hazy-angrezi/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-05-2025"
    },
    {
        "full_article": "What Bombay HC said while freeing a student applies to US govt approach to foreign students as well \nRavi Srinivasan had only 16 followers on X when he posted against a senior politician’s son 13 years ago. That police took note, and felt compelled to arrest him over other pressing matters, was surprising at the time, but no more. Police and lower courts have made examples of countless Ravis since then. A 19-year-old student in Maharashtra learnt this the hard way after posting words sympathetic to Pakistan during Op Sindoor. Although she realised her mistake, deleted the post, and apologised, her college rusticated her, and Maharashtra Police arrested her on May 9 for endangering India’s sovereignty, unity and integrity, promoting enmity, and outraging religious feelings. \nWhile striking down the dreaded Sec 66A of the IT Act – which was used to harass Ravi, students Shaheen Dhada and Renu Srinivasan, Kolkata prof Ambikesh Mahapatra, and many others – as unconstitutional in March 2015, Supreme Court had made a distinction between discussion, advocacy and incitement. Discussion and advocacy, “howsoever unpopular”, were at the heart of the freedom of expression, a fundamental right, SC had explained. And on Tuesday, Bombay HC did so again, in different words.\n“What does the state want? Does the state want students to stop expressing themselves and be converted into criminals,” it asked. To the college, HC said: “Someone expresses something, you want to ruin the life of a student? How can you rusticate like this?” How grave was the girl’s “offence”? In HC’s own words: “At the most, her act of sharing the post can be termed an indiscretion by a young student.” For this, she spent 18 days in jail and missed two exams.\nIn faraway America, Trump’s admin is also bent on silencing foreign students through social media vetting. Details are fuzzy, but to get a student visa you’ll probably need to have a particular kind of social media profile. “We will continue to use every tool we can to assess who it is that’s coming here,” a State Dept spokesperson said. Could liking a post about the suffering of children in Gaza be a disqualification? Maybe. But as American Civil Liberties Union pointed out in 2018, social media is today’s public square, and it’s so concentrated and easy to monitor that just knowing govt is watching you has a chilling effect on free speech. That’s why people leave China for US, not the other way round. So, curbing free speech can’t be good for democracies, in the West or East.\n\n",
        "headline_1": "When you post…",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/what-you-post/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-05-2025"
    },
    {
        "full_article": "Will Kamal Haasan, intense in public life outside Parliament, become dull like most actors inside the House?\nA few years ago Jackie Chan said that he wished he could join the Chinese communist party. What he was really wishing for was something impossible – being able to leverage his fan base into a political campaign. That’s kosher only in democracies. Think Reagan in America, Zelenskyy in Ukraine, Jayalalithaa in India, Glenda Jackson in UK, to name just a few instances. In India, the number of actors who have entered politics is big, but those that have truly made a mark are few. With Kamal Haasan set to enter Rajya Sabha, all eyes will be on whether he carries his trademark intensity inside Parliament.\nYesterday, even as DMK allocated one Rajya Sabha seat to Kamal’s fledgling MNM, quite a different story grabbed the headlines. Did he realise how provocative he was being when he peppered the audio launch of his upcoming film Thug Life with the claim that Kannada was ‘born’ out of Tamil? Controversies are the lifeblood of politics, not unlike entertainment. But it takes special skills to ride these winningly. In the movie business, Kamal has done this again and again. As protests gather steam in Karnataka, perhaps the actor would be considering that his parliamentary avatar needs to be less opinionated and more dull. \nJaya Bachchan, now serving a fifth term in the upper house, has developed a vivid presence, especially in speaking on behalf of women and the film industry. But otherwise, from Prithviraj Kapoor to Rekha, wowsome thespians have walked through Rajya Sabha with less impact than movie extras have on screen. Current members Ilaiyaraaja and KV Vijayendra Prasad don’t look like they are planning anything different. It will be a disappointment if Kamal fades into the benches too. Rajya Sabha, like Lok Sabha, needs more authentic debating. Taking positions and defending them can be about taking conversations forward. That’s what Indians deserve and need. \n\n",
        "headline_1": "Hide or speak",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/hide-or-speak/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-05-2025"
    },
    {
        "full_article": "Civil service exam needs two reforms. One, reduce max age & number of attempts at entry level. Two, an annual competitive test allowing 40-somethings to enter IAS\nThe civil service results for 2024 are out. Congratulations to the thousandodd candidates who have got through what is arguably one of the most competitive exams in the world. In media interviews, many candidates spoke about how they spent many years in preparation and their eventual success after multiple attempts.\nFor every successful candidate, there are at least ten others who too have invested years in preparation but have failed to make the grade. They are back at square one. An abysmal waste of productive years? Here are two ideas that govt can pursue to remedy the situation.\nRead full story on TOI+\n\n",
        "headline_1": "India needs UPSC 2.0",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/india-needs-upsc-2-0/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-05-2025"
    },
    {
        "full_article": "For quite some time, ordinary citizens have been feeling the brunt of economic hardship due to rising prices and other external shocks, including job losses. Therefore, the fact that the economy has experienced one of the slowest growth rates this fiscal year since FY1990-91, excluding the first year of the pandemic, does not come as a surprise. Bangladesh's GDP grew by 3.97 percent—almost half the inflated growth rate projected by the Awami League government when it prepared the budget last year. Although the interim government has revised the projection to five percent, the current provisional estimate is closer to what the World Bank and the Asian Development Bank (ADB) has forecast: 3.3 and 3.9 percent, respectively.\nThe decline has been attributed mainly to the sluggish performance of the agriculture and service sectors, which respectively saw growth rates of 1.79 percent and 4.51 percent in the current fiscal year, compared to 3.3 percent and 5.09 percent in FY2023-24. While the prolonged floods last year impacted agricultural output, the stubbornly high inflation dampened wholesale and retail sales in the service sector. But thanks to the RMG industry, the industrial sector performed well despite political tensions, labour unrest, and factory closures, with growth increasing from 3.51 percent in FY2023-24 to 4.34 percent this year.\nHowever, the outlook for the coming fiscal year does not raise spirits either, as global disruptive factors, including the imposition of US tariffs and Bangladesh's graduation from LDC status, present added challenges. Domestically, slumped investment, especially in the private sector, has failed to create job opportunities. In fact, according to the Centre for Policy Dialogue (CPD), 2.1 million jobs were lost in the first half of the current fiscal year. More concerningly, women accounted for the majority of those who lost their jobs. International factors, such as severe cuts in donor-funded projects in the NGO sector, played a part in this crisis.\nUnfortunately, the steps taken by the interim government over the last nine and a half months—including banking reforms, attempts to encourage investment, and the splitting of the National Board of Revenue—have not yet delivered any positive results. In fact, the banking sector is still reeling from the heavy burden of non-performing loans and irregularities incurred during the Awami League era. Under these circumstances, the upcoming budget must reflect the government's plan to tackle rising unemployment, high inflation, and illicit financial outflows. At the same time, the marginalised, including those at risk of falling below the poverty line, must be supported with well-designed and expanded social safety net programmes. Incentives should also be provided to sectors that can generate substantive employment, with a special focus on the female workforce.\nAt the same time, we agree with economists that the interim government should soon declare a definite roadmap for the election considering that it would provide businesses, among other stakeholders, with the predictability they require for planning investments and economic activities. Last but not least, the law and order situation must be improved to reignite investor confidence and reaccelerate the economic wheel.\n",
        "headline_1": "Budget must prepare us for difficult times",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/budget-must-prepare-us-difficult-times-3905821",
        "news_paper_name": "The Daily Star",
        "publish_date": "29-05-2025"
    },
    {
        "full_article": "Oftentimes, women's sports become victims of their own success. A team emerges that feels untouchable, steamrolling opposition in an endless crusade for silverware. The victories mount, but so does the predictability. That was the trajectory of Barcelona women's dominance—until Arsenal decided to write their own conclusion.\nOver 50,000 gathered in Estádio José Alvalade beneath the searing Lisbon sun, draped in either blaugrana or red and white. Two teams with the most passionate followings, meeting on the grandest stage of European football. Barcelona entered as the undisputed créme de la créme, having demolished the undefeated English champions with an 8-2 aggregate score. Arsenal, by contract, were far from flawless—a team punctured by moments of absurdity, confusion, but also flashes of outrageous brilliance. To call it Goliath versus David was almost an understatement.\nTo truly appreciate the magnitude of Arsenal's triumph, one must honour their journey—a journey that began from the humblest of beginnings: the qualifying rounds. No team had ever reached the semi-final starting from that position. Arsenal scraped through the second qualifying round, only to be thrashed by Bayern Munich in their opening group stage fixture. It was never a question of if Arsenal would falter but rather how deeply they might fall. Jonas Eidevall, then the club's manager, was dismissed amid a cascade of poor results. Arsenal was a club adrift, lacking cohesion, drained off goals, and defensively shattered.\nBut there is profound growth in defeat, in suffering, in building character. And that character galvanised every player and staff member to steer the ship to calmer waters. To replace Eidevall, Arsenal scoured far and wide, yet the answer lay quietly within their own ranks. Renée Josina Anna Slegers, the 36-year-old Dutchwoman and former Arsenal youth player, stepped forward, becoming the vital heartbeat of the club's revival.\nSlegers's presence dispelled the heavy cloud that had engulfed this once-great institution, the pioneering force of women's football in England. Chelsea had seized the initiative, bolstered by Sonia Bompastor, a serial Champions League winner, dominating domestically and chasing a sixth WSL title. Meanwhile, Arsenal seemed trapped by its glorious past and crushing weight of expectation, aggravated by a growing fan base. Slegers not only understood the burden—she embraced her player's individuality, crafting a style that coaxed their very best.\nIt's not just Sleger's renaissance that becomes a script in itself, but also the individual stories of each player that takes on a life of its own. Leah Williamson and Lotte Wubben-Moy have known nothing but Arsenal. Kim Little, who moved to Arsenal a year after they won the Champions League title for the first time, never managed to make it to the final. Only months ago, Chloe Kelly wrestled with doubts, contemplating a break from football at Manchester City. Alessia Russo made the bold and infamous move from the north to London in search of Champions League glory, only to see Arsenal miss out qualifying in her first season. Beth Mead and Stina Blackstenius spent much of the campaign under intense scrutiny. Yet, when it truly mattered, each of these players rose above their doubts, rewriting their stories with belief, resilience and sacrifice.\nPerhaps the boldest risk was taken by Mariona Caldentey. To leave Barcelona's constellation of stars for a struggling Arsenal was an act of faith and courage. Often overlooked behind giants like Alexia Putellas and Aitana Bonmati, Caldantey embraced discomfort and uncertainty. To walk onto the pitch and lift the Champions League trophy in front of the very teammates she once played alongside proved that her gamble had been richly rewarded, her quiet brilliance finally shining in full.\nEven after sealing their place in the final, Arsenal suffered stunning defeats: 5-2 to Villa, 4-2 to Brighton. The team appeared bewildered, drained, playing a game only they understood. In hindsight, those moments were Slegers's masterclass in instilling the resolve Arsenal would need to face Barcelona.\nOn that final day, Arsenal arrived ready, fighting every blow that was hurled their way. They stood tall, solemn in the belief that, at some point, their miracle would come. And miracles do not arrive by accident. They demand to be chased, scraped for, clawed into existence—every ball, every pass, every tackle. And every single Arsenal player poked, pressed, and persisted until that miracle became real.\nThe final and the most important push came from those who never touched the pitch but carried the team through every corner. Arsenal's fans, growing in number and volume, have long borne the weight of expectation, their love often burdened with disappointment. But in Lisbon, there was no bitterness, no anxiety—only joy. For once, they weren't asking for a miracle; they were simply watching their team stand where it belonged.\nThis victory was not born in a boardroom or bank account. It came from belief, stuck together through heartbreaks, near-misses, and quiet perseverance. Arsenal's triumph is not just a reminder to never count them out from the pinnacle; it is proof that continental glory does not have to come with a million-pound price tag. After all, Russo and Caldantey cost Arsenal zero Great British Pounds.\nTurns out, belief, when shared by 11 players and thousands more, is priceless.\nRaiyan Binte Rafiq is a sports columnist for The Daily Star. She works in Sports Media in the UK and manages recruitment at Next Level Sports Management.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Shaped by struggle, sealed in gold",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/beyond-the-dugout/news/shaped-struggle-sealed-gold-3905426",
        "news_paper_name": "The Daily Star",
        "publish_date": "29-05-2025"
    },
    {
        "full_article": "We are concerned by the recent spate of crime in Dhaka that put its law and order situation once again under the spotlight. Since the political changeover in August last year, public security in the city has been an area of concern with a persistent rise in various criminal activities. Although the authorities have taken a number of measures to address the situation, things have proven difficult to manage. The spike in criminal incidents—with CCTV footage of several going viral on social media—is understandably fuelling fear among the general public. The government, therefore, must increase its efforts to comprehensively address these security concerns.\nAccording to data from the Police Headquarters, Dhaka witnessed a noticeable rise in violent crimes in the first four months of this year, with robbery cases almost doubling and dacoity and murder cases nearly tripling compared to the same period last year. Over time, the criminals appear to be growing more audacious, often attacking people in broad daylight. On Tuesday morning, muggers attacked a currency trader, shot him, and robbed him of currencies worth Tk 22 lakh in the city's Mirpur area. On Sunday night, a BNP leader was shot dead by two assailants. Some perpetrators have even been seen carrying machetes, using them to intimidate or attack their victims.\nWhat does it say about our law enforcement if gun-toting, machete-wielding criminals can roam freely in public? In some cases, police appeared reluctant to take action. For instance, a victim of mugging in Nikunja, who was attacked with machetes, reported the incident to Pallabi Police Station but no action was taken until a video of the incident went viral. Speaking to The Daily Star, he said the incident had shattered his sense of security, and—one may easily assume—that of many others.\nThis situation has persisted more or less since August. While the interim government has taken some initiatives, including deploying army troops with magistracy powers to assist in maintaining law and order, these efforts have often proven insufficient. Unfortunately, the police have yet to fully regain their footing, and criminals continue to take advantage of the vacuum. This is unacceptable. Law enforcement agencies must reassert control over the city's law and order using whatever means necessary. It is unacceptable for people to continue living in fear for their safety.\n",
        "headline_1": "Dhaka’s law and order situation demands better interventions",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/dhakas-law-and-order-situation-demands-better-interventions-3905361",
        "news_paper_name": "The Daily Star",
        "publish_date": "29-05-2025"
    },
    {
        "full_article": "A recent report in this daily once again highlights how unsafe this country has become for children, particularly girls. Reports of rape cases compiled by Ain O Salish Kendra (ASK) and Bangladesh Mahila Parishad during the first quarter of this year show that the majority of the victims are aged below 18 years. ASK documented 342 reported cases, with 87.56 percent of known-age victims being children. Alarmingly, 40 victims were aged between infancy and six—too young to even grasp the horror inflicted on them. However, that does not appear to discourage the perpetrators, some of whom even carry out this heinous act in gangs. ASK data shows children also made up the majority of gang rape victims. Of the 84 reported gang rapes between January and April, 32 victims' ages were known, and 20 of them were minors. What does it say about our society—that before one protest over child rape ends, another child falls victim?\nLast year, an analysis published in this daily based on ASK data revealed that one rape occurred every nine hours in Bangladesh and the majority of victims are girls. For adolescent girls, the situation is even worse. The 2024 Violence Against Women Survey showed that adolescent girls, whether married or not, are the most vulnerable when it comes to both intimate partner violence and non-partner violence. These findings make one thing painfully clear: in Bangladesh, a girl's age, marital status, or social position offers no protection from abuse. In fact, child marriage only reinforces patriarchal—and in some cases, predatory—attitudes towards girls. Despite progress in education and growth in the economy, we have failed to challenge the misogynistic mindset still pervasive among some men among us. Unfortunately, attempts to introduce topics in schools that provide comprehensive mental, physical and reproductive health education along with teaching and encouraging appropriate behaviours to young people have been blocked.\nWe have tried to address the issue of sexual violence against women with laws, which alone cannot prevent these heinous crimes. It is time the government listened to the rights bodies and took steps to break the silence regarding cases of abuse, introduced school-based safety training, improved mental health and rehabilitation services. It also needs to facilitate community engagement involving parents, teachers, and local leaders, including the religious ones, increase monitoring of cybercrimes, and address the issue of offensive contents on social media. Ultimately, we must root out misogyny from society if we hope to make Bangladesh safe for girls. Until then, our children remain vulnerable.\n",
        "headline_1": "Address causes of child sexual abuse",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/address-causes-child-sexual-abuse-3903701",
        "news_paper_name": "The Daily Star",
        "publish_date": "29-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 29, 2025 00:00:00  \nIf everything goes according to the plan, the Bangladesh Bank (BB)---the country's monetary authority, is all set to emerge as an autonomous financial institute. To make this happen, as incumbent governor of the central bank Dr Ahsan H Mansur discloses in an interview with the FE, the process of bringing about the necessary revision to the Bangladesh Bank Order 1972 is under way right now. With this move Bangladesh stands poised to break free from the stereotyped notion that only the developed, not the developing or least developed, countries deserve independent central banks. In fact, the central bank in every country should enjoy some degree of independence in performing its core functions like monetary policy and financial stability. It may be accountable as much as required for maintaining transparency and responsiveness to crises through reporting to the finance ministry or parliament. \nThe nation will be waiting to see how far the horizon of the BB's autonomy can be extended under the legal provisions now getting worked out on the anvil. That the incumbent BB governor has made it clear that he has not been under any pressure from the government is understandable. It is, however, one thing under the rule of an interim government but quite another when a political government takes over. Political governments more or less exert pressure on the central banks everywhere at times to take popular decisions for reasons of political expediency. The national banks in advanced countries have safeguards equal to the task of withstanding such pressures without getting swayed by political pressures in favour of adopting short-term populist policies. Instead, the central bank undertakes the task of navigating the tortuous and painful course to achieve the long-term economic goals even if the policy is unpopular. If the BB is made structurally sound and legally strong to go about the business of focusing on its long-term goals such as framing effective monetary policy, controlling inflation and managing financial crises arising even out of external developments, it will be an excellent job. \nIt must be recognised that the BB has already given a good account of itself. During the remaining period, it will have to build on this to leave a legacy for the political government to continue with such an enabling equation. If this happens, it will be a great gift from the incumbent governor and the interim government to the nation. It is because of such mutually beneficial relations between the government and the BB, the later could take a few unpopular decisions such as leaving the exchange rate between dollar and Taka on the open market and supporting at least two banks to have an appreciable turnaround. \nNext to come, according to the governor, the most crucial decision on the non-performing banks. Merger of a few of them and takeover of others on the basis of assessment the BB made are on the cards now. The banks that face severe liquidity crisis will be taken over but not dissolved. The government can hardly afford to operate such sick banks. If not divested to raise funds, the other ways of their survival will be handing over to private hands or injecting more minted money. The last option is undesirable. Perhaps a middle course based on a combination of disposal of some assets, thriftiness in operation and the barest minimum injection of fund can help wobbling banks to gradually stand on their feet.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Autonomy for BB",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/autonomy-for-bb-1748447256",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       May 29, 2025 00:00:00  \n\nThe world is more environmentally conscious than ever, as the threats of environmental degradation and water pollution become increasingly evident. Fashion, being one of the most polluting industries on the planet, can no longer evade its responsibility. There is a growing international pressure for the industry to acknowledge its effect on the environment and adopt environmentally preferred manufacturing methods and materials. And those unwilling or unprepared to innovate and adapt will inevitably be left behind, forced to bear the consequences of inaction and reflect on the opportunities they have lost.\nIn this context, Bangladesh's leather industry exemplifies a sector weighed down by such missed opportunities, primarily due to its failure to comply with international environmental standards. As the country's second-largest source of export earnings after ready-made garments (RMG), the leather industry holds immense potential. Unlike the RMG sector, which depends heavily on imported raw materials, the leather industry can boast of having a ready domestic supply of raw materials and competitively low labour costs. Despite these inherent advantages, the sector has struggled to reach its potential. The root causes lie in weak governance, environmental negligence, and an evident lack of political commitment to make the Central Effluent Treatment Plant (CETP) at the Savar Tannery Estate fully operational.\nLeather processing is intrinsically harmful to the environment, with its heavy reliance on toxic chemicals and generation of substantial volumes of hazardous wastewater. To address these concerns and encourage cleaner practices, the Leather Working Group (LWG) was formed in 2005 by a coalition of global brands such as Nike, Adidas, and Timberland. LWG established a unified audit framework focusing on environmental management, chemical usage, waste treatment, and traceability of raw materials. It has since become the most recognised standard for environmentally responsible leather production worldwide. Without meeting the criteria set by LWG, manufacturers are effectively locked out of premium international supply chains.\nLWG's database reveals a dismal compliance record for Bangladesh's leather industry. Italy leads with 952 certified factories, followed by 334 in India, 263 in China, 62 in Pakistan, 27 in Vietnam, and 24 in Taiwan. In contrast, Bangladesh has only eight LWG-certified leather goods manufacturers. This limited compliance has had significant repercussions. According to the Bangladesh Tanners Association, the industry loses an estimated $500 million annually in potential export revenue due to the absence of LWG certification. This is further reflected in export earnings, which fell from $1.13 billion in 2012 to $970 million in 2024-a decline largely attributed to non-compliance with international environmental standards.\nDespite the relocation of tanneries from Hazaribagh to Savar more than eight years ago, the promised improvements have not materialised. The CETP at Savar, which was intended to address the environmental hazards of leather processing, remains incomplete and severely underperforming. It currently handles only about 14,000 cubic meters of waste per day, far short of the 35,000 cubic meters generated during peak periods such as Eid-ul-Azha. This shortfall means that significant amounts of untreated effluent continue to pollute the environment.\nSo, the question is how long will it take to establish a fully functional CETP? It is worth noting that the government invested approximately $53 million (Tk 565 crore) in the CETP facility, which was installed by a Chinese company. However, the plant was handed over to the Dhaka Tannery Industrial Estate Waste Treatment Plant Company (DTIEWTPC) in an incomplete state. Now, the facility requires extensive renovation and upgrade to meet operational standards. Instead of ensuring the CETP's functionality, the previous government tried to shift the responsibility to individual tanners, expecting them to establish their own Effluent Treatment Plants (ETPs).\nWhile about six tanners have independently set up Effluent Treatment Plants (ETPs) to meet environmental requirements and maintain access to international markets, the majority of tanneries in Savar are small-scale operations. These smaller tanneries lack the financial capacity to install individual ETPs, making LWG certification unattainable for most. Consequently, Bangladesh's leather exporters are forced to sell around 65 per cent of their tanned leather to middlemen and importers in China, often at prices nearly 60 per cent lower than what could be secured through direct sales to high-end markets. This situation leaves many tanneries grappling with reduced orders, financial instability, unpaid suppliers, and defaulted bank loans, trapping the sector in a cycle of underperformance and stagnation.\nThe present interim government, which includes several well-known environmentalists in its advisory council, is expected to take the issue more seriously. Beyond the financial losses caused by this non-compliance, the environmental and public health consequences are equally, if not more, alarming. The Dhaleshwari River, adjacent to the Savar leather estate, has become a toxic waterway, heavily contaminated by untreated effluents and solid waste. One of the most dangerous pollutants is chromium, a chemical used extensively in tanning. When mishandled, chromium poses serious environmental and health risks. Studies have shown that toxic chromium has entered the food chain, contaminating fish and poultry that consume feed made from affected by-products. It, therefore, poses a grave threat to public health.\nBangladesh has already proven its capacity to maintain environmental compliance in the RMG sector. So, why not the same be replicated in the leather sector? As Bangladesh approaches its graduation from Least Developed Country (LDC) status, the leather industry represents a crucial opportunity to diversify the country's export portfolio. Industry experts suggest that with the right mix of environmental compliance, incentives, and policy support-similar to those provided to the RMG sector-leather exports could reach $5 billion annually by 2030. However, continued inaction threatens to push the industry further into decline, deepening both economic losses and environmental damage.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "CETP crisis chokes leather industry's growth",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/cetp-crisis-chokes-leather-industrys-growth-1748447307",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 29, 2025 00:00:00  \n\nThe country is currently passing through one of its most critical moments since the interim government assumed responsibility following the mass uprising of July 2024 and the fall of the Hasina regime on 5 August 2024.\nA nation does not govern itself automatically; it requires leadership rooted in team spirit across its institutional pillars, harmony among political parties, and the collective will of the people. While political parties may hold differing ideological beliefs, in times of national crisis, it is imperative that leaders reach a consensus for the greater good of the country.\nWhat we need now is strong, patriotic leadership-transcending party affiliation, religion, caste, or personal beliefs-that can steer the nation in the right direction. True patriotism involves the courage to act in the best interest of one's country and is a pure sentiment that arises instinctively from the depths of the heart. It is the embodiment of love and devotion towards the nation, deeply rooted in our societal values.\nRegrettably, it is rare to find leaders who possess such unwavering patriotism-those who can be branded as inspired pioneers with an unshakable sense of national duty, even in the face of adversity.\nAt present, the nation finds itself at the crossroads of reform and the roadmap for elections. We remain hopeful that both objectives can be achieved within the timeframe already announced by the interim government-between December 2025 and June 2026.\nWhat we need most is patience, mutual respect, and commitment to democratic principles. As ordinary citizens, we remain confident that the uncertainty of this critical period will soon give way to clarity and progress-provided patriotism is placed at the forefront of all decision-making.\nWith heartfelt humility, we call upon both senior and emerging leaders to honour the bloodshed of the July uprising. The nation looks ahead with hope toward a dignified, fascist-free future.\nMd. Refatul Hossain\nAdditional Director (retd.)\nDepartment of Agricultural Extension (DAE)\nFaridpur Region.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Upholding patriotism in our hearts",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/upholding-patriotism-in-our-hearts-1748447337",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 29, 2025 00:00:00  \n\nIn the journey towards becoming a developed nation, Bangladesh must not overlook the critical need to protect its infant industries-those emerging sectors still too young to compete with established international players.\nWhile Bangladesh has made commendable economic progress, particularly through its ready-made garments (RMG) sector, it remains at a crossroads. The nation aspires to diversify and strengthen its industrial base, yet many new industries remain vulnerable in the face of stiff global competition.\nTo foster the growth of these industries, the government should consider implementing protective measures. These include imposing higher tariffs on certain foreign imports while reducing tariffs for domestic companies to ensure local products remain competitively priced. Subsidies and tax incentives targeted at fledgling industries would also lower production costs, enabling them to scale efficiently. Moreover, introducing non-tariff barriers-such as import licensing-can further shield local enterprises from premature exposure to global market forces.\nSuch strategies are not only economically sound but also essential for sustainable national development. By nurturing infant industries today, Bangladesh can secure a more diverse and resilient economy tomorrow-one that showcases innovation and industrial strength on the world stage.\nGovernment support at this pivotal moment could determine whether these industries become the future pillars of a developed Bangladesh.\nMd Jahid Munsi\nStudent, Bachelor of Business Administration\nNorth South University\njahid.munsi@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Protecting infant industries",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/protecting-infant-industries-1748447363",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-05-2025"
    }
]