[
    {
        "full_article": "The Index of Industrial Production (IIP), the nation’s monthly barometer of goods output, revealed a 10-month low growth rate in June, at 1.5%, largely due to the sharp contraction in mining activity, by –8.7% (10.3% in June 2024), and electricity output, by –2.6% (8.6% in June 2024). The early onset of the southwest monsoon, with its erratic and uneven distribution, led to water logging in large parts of the mining belts in Odisha, Jharkhand and West Bengal, hampering a key economic activity. Ranchi’s regional meteorological office has said that Jharkhand recorded 504.8 mm (against a normal of 307 mm) between June 1 and July 12 — but five districts were categorised as rain deficient. The resultant damage to the power distribution infrastructure and disruptions to supply chains may have contributed to the sluggish growth in industrial output at 3.9% in June, up from 3.5% a year ago. This in turn, is likely to have led to subdued power demand. While mining and power production collectively make up for almost a quarter (22.3%) of the IIP’s weightage, the rest is apportioned for manufacturing activities. The robust growth in capital (3.5%), intermediate (5.5%) and infrastructure (7.2%) goods output, indicates that much of industrial growth continues to hinge on the government’s infrastructure spends.There has been a general reluctance, both institutionally and in public economic discourse in India, to explicitly correlate disruptions in economic activity with climate-related events, especially in official narratives such as the IIP or GDP data releases. The Ministry of Statistics and Programme Implementation and the Reserve Bank of India (RBI) tend to frame industrial and economic under-performance in terms of ‘high base effects; supply chain bottlenecks; input cost fluctuations; global demand softening; and domestic consumption contraction’. Climate-related disruptions, such as in mining belts, are rarely mentioned in IIP or national accounts commentary. Economic data agencies in India have been slow to integrate climate risk frameworks into routine macroeconomic reporting, unlike institutions such as the European Central Bank or the Bank of England which have begun mapping climate risk to output and financial stability. True, climate attribution is complex: linking a specific event such as waterlogging in a coal mine to broader climate change involves scientific rigour and probabilistic modelling. Policymakers often avoid this due to fear of politicising economic data. Indeed, the RBI’s Financial Stability Reports now include climate-related risks. But this has not yet filtered into production-side metrics such as the IIP. The time has come for India to make a systemic shift to integrate climate attribution to economic activity. Published - July 30, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        industrial production\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        Monsoon\n                    \n                            /                      \n                        \n                        mining\n                    \n                            /                      \n                        \n                        Orissa\n                    \n                            /                      \n                        \n                        Jharkhand\n                    \n                            /                      \n                        \n                        West Bengal\n                    \n                            /                      \n                        \n                        electricity production and distribution\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        banking\n                    \n                            /                      \n                        \n                        macro economics",
        "headline_1": "Interrupted growth: On economic activity, climate-related events",
        "headline_2": "Industrial growth is still tied to government spends on infrastructure",
        "link": "https://www.thehindu.com/opinion/editorial/interrupted-growth-on-economic-activity-climate-related-events/article69869972.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "30-07-2025"
    },
    {
        "full_article": "On July 25, 2025, tragedy awaited students of Classes 6 and 7 at the Piplodi Government School in Rajasthan’s Jhalawar district as they assembled for prayer. A part of their school building gave way leading to the deaths of seven and injuries to several others. Most of the students were from tribal communities. The school is in the southeastern part of the State bordering Madhya Pradesh. There was a similar incident the next day in Nagaur district but the school was closed being a holiday. There has been much public anger in the State over the incidents which, quite rightly, have thrown the spotlight on the state of government schools. As in UDISE 2023-24 data, there are more than 70,000 government schools in Rajasthan serving nearly 84 lakh students, especially from the poorer and marginalised sections. Of these, some 8,000 schools have been estimated by the Education Department to be in a poor condition. The Jhalawar school was not among the schools identified as being in a poor state, indicating the extent of the problems. Some ₹650 crore had been allocated in the past two State budgets for boosting the infrastructure but inefficiencies in government have ensured that the measures did not make much difference. Fixing the infrastructure of government schools should be a priority for the State’s Bharatiya Janata Party government.The tragedy in Rajasthan should serve as a wake-up call across India, given the current policy defocus on government-owned education institutions. The National Education Policy (NEP) 2020 had called for an immediate increase in spending on education, from some 4.6% of GDP to 6%, identifying one-time spends on infrastructure as the lead priority besides identifying other sectors for a boost in support. Five years into the NEP, there is little to suggest that this has been a focus area for governments, Union or State. Policy thrusts have been more towards reducing government support, self-financing, and encouraging private sector contribution. While these may be applicable to higher education, basic school education is a primary duty of the government — as it is across the world including in the most developed nations. Setting up model schools and funding them to serve as exemplars cannot be at the cost of mass school education. Foundational Literacy and Numeracy has been identified as a critical area for boosting workforce productivity and reaping the demographic dividend that will soon run its course as India’s population ages. But the discourse on pathways towards achieving them is more on pedagogy, non-formal teaching and so on than the essentials — an infrastructure boost and teacher recruitment and training.\r Published - July 30, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        students\n                    \n                            /                      \n                        \n                        school\n                    \n                            /                      \n                        \n                        accident (general)\n                    \n                            /                      \n                        \n                        Rajasthan\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        demography\n                    \n                            /                      \n                        \n                        population\n                    \n                            /                      \n                        \n                        teachers\n                    \n                            /                      \n                        \n                        state budget and tax",
        "headline_1": "​Deaths in school: On the state of government schools",
        "headline_2": "Infrastructure of government schools need urgent attention",
        "link": "https://www.thehindu.com/opinion/editorial/deaths-in-school-on-the-state-of-government-schools/article69870009.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "30-07-2025"
    },
    {
        "full_article": "While driving a hard tariff bargain with Trump, India shouldn’t give rivals a head start in US market\nIf Trump sticks to plan, Indian exports to US may be tariffed at 26% starting Friday. It’s the ‘reciprocal tariff’ he threatened to impose from April 9, deferred by 90 days to July 9, and by three weeks more to Aug 1. Those extensions were meant to give countries time to negotiate trade deals on better terms. While most major economies – including Japan and EU – have closed deals, US-India talks remain inconclusive, even though commerce minister Piyush Goyal claimed “fantastic progress” last week. \nDoes that make the 26% rate inevitable? US commerce secy Howard Lutnick has said the Aug 1 deadline is cast in stone, but Trump runs govt by fiat, and ‘policy’ to him is just an extension of his mood. Nothing stops him from deferring the India tariff, especially when talks with China look headed into extra time. Also recall that, unlike Japan, Brazil, S Africa, Thailand and some 20 other countries, India didn’t get one of Trump’s ‘tariff letters’ early this month. US, despite its grouse about Indian protectionism, wants a slice of the Indian market, which is large and growing fast thanks to a growing population. Also, a growing India is in America’s interest as it can be a counterweight to China.\nBut that shouldn’t breed complacency as other low-cost economies like Vietnam, Indonesia and Philippines have already negotiated tariffs of 20% or less. Goods from Japan and EU will be taxed at 15%, and unless Trump goes extra sweet on India, that might be the best we can expect. He’s already hinted at a “world tariff” of 15-20% for countries with which US doesn’t have trade deals. And if China formalises its current 30% tariff – or lower – Indian manufacturers won’t have much of an advantage in the US market.\nMeanwhile, the multi-billion dollar investment commitments in Japan and EU’s trade deals show how hard it is to bargain with Trump. EU negotiators say they gave in at the last minute because the alternative was to start a trade war. Of course, some of the concessions they have made might not amount to much practically. For instance, EU’s promise to buy $750bn worth of US energy products over three years is meaningless, as US produces only about $166bn worth of these products in a year. India should also expect unreasonable demands, and skirt them tactfully. \n\n",
        "headline_1": "Sign up",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/sign-up/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-07-2025"
    },
    {
        "full_article": "That Haryana doesn’t have a single working AQI reader tells you a larger story on govts across India\nIt’s terrible enough that Indian cities are air pollution hotspots. Even more frightening is that the severity of pollution is underestimated. Last week, Haryana’s last functional AQI reading station went kaput. ‘Fun’ fact: Since April, all 29 AQI monitoring stations in the state went offline due to lapsed contracts, unlikely to be functional any time soon. Two IMD stations are functional, one in a relatively green patch in the otherwise glitzy glass & concrete jungle, Gurugram, with its high SUV density and factories. Haryana’s Faridabad has been India’s most polluted city. Fifteen of India’s top 100 most polluted cities on PM2.5 levels are in Haryana. So, it’s extraordinary that the Saini govt isn’t prioritising this, especially given the increasing burden of asthma and COPD.\nFaridabad and Gurugram are part of NCR – consistently the country’s most polluted bloc. In Delhi, when AQI hovers at ‘poor’, refrain is ‘it’s not so bad’. Think – to what extent polluted air is normalised and what our children breathe. Wheezing, sneezing, watery eyes, persistent coughs – children’s quality of life is compromised from that very first outing in their strollers. The causal link between air toxins and rising incidence of asthma in children is known for years. And yet…\nHere’s the thing. Per a non-profit researching energy and air pollution, CREA, air quality in 250 of 293 Indian cities Jan to June overshot WHO’s annual PM 2.5 standard. So, it’s not hotspots alone. Last year Meghalaya’s Byrnihat, home to an industrial park on the border with Assam, emerged among most polluted industrial settings – thanks to coke, cement, steel and brickmaking factories, all in scenic settings. Flaming red AQIs barely impact business practices. But it does redflag various govts failing to crack down on non-compliance of air pollution standards. In Haryana now, it’s not even being measured.\n\n",
        "headline_1": "Bad air, so what?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/bad-air-so-what/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-07-2025"
    },
    {
        "full_article": "There’s too much or too little of the precious liquid on which all life depends \nRecently a video went viral on social media in Gurgaon. It showed a city councillor swimming with a creditable freestyle stroke. What gave the video virality was not the aquatic athleticism of the swimmer, but the fact that he was demonstrating his prowess not in a swimming pool, or a river, or a lake, but on one of the main roads of the city. \nIt happens every year that, come the monsoon rains, Gurgaon gets submerged in a deluge that would do Noah and his Ark proud. Roads get waterlogged waist-deep, cars are seen floating like improvised canoes, and everything comes to a sodden halt. Orange and red alerts are notified by the authorities, schools are shut, and office-goers enjoined to WFH. \nMuch the same thing happens in Mumbai, Delhi, Kolkata, and other cities. Yet, in the midst of all this super-abundant liquidity, there’s a great water shortage. \nIn National Media Centre where I live, residents are being urged not to use water-wasteful hoses to clean their cars, but to use buckets instead. \nThe water tanker business is a thriving industry in Delhi and Bengaluru. In Mumbai people reportedly have to rouse themselves at five in the morning to fill their baltis and other containers with water before the taps run dry. \nThis deluge-or-dearth paradox is not restricted to urban areas. Rural India is routinely ravaged by the alternating scourges of floods and drought. And everywhere the water table is sinking lower and lower, aquifers are drying up, and rivers are choked with silt. \nOver 70% of the surface of our planet is covered with water, largely in the form of saline oceans. Almost 60% of the adult human body is made up of water. Despite its omnipresence there’s a growing shortage of water, raising the spectre of wars being fought over it in the near future.  \nToo much or too little, the precious fluid without which no life can exist poses a problem for which a solution has yet to be found that will hold water. Literally.\n\n",
        "headline_1": "Water woes",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/water-woes/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-07-2025"
    },
    {
        "full_article": "In 2020, India more than just released a policy – it rekindled an ancient ideal. National Education Policy (NEP) placed learning at the heart of nation building, drawing from civilisational wisdom. Framed through one of the most participatory policy-making processes in history under late K Kasturirangan’s guidance, NEP 2020 was a visionary roadmap rooted in cultural values. It reimagined learning as a process free from confines of rote memorisation, rigid structures, and linguistic hierarchies. It set the stage for a holistic, inclusive and future-ready education system.\nFive years on, NEP’s impact is visible in policy corridors and classrooms. In early childhood classrooms, play-based learning is displacing rote memorisation; children read fluently in their mother tongue; Class 6 students explore hands-on skills in vocational labs. Its imprint is visible in research hubs where India’s knowledge systems engage in dialogue with cutting-edge science. NEP’s vision is reflected in the rise of women in STEM fields and in the growing global presence of Indian institutions.\n\nNipun Bharat Mission has improved learning outcomes, ensuring foundational literacy and numeracy by Class 2. Nipun Bharat’s success, reflected in Aser 2024 and Parakh Rashtriya Sarvekshan 2024, has made classrooms spaces of curiosity and comprehension.\nRead full story on TOI+\n\n",
        "headline_1": "‘Multilingual, inclusive education being realised at scale’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/multilingual-inclusive-education-being-realised-at-scale/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 30, 2025 00:00:00  \nDeveloping the required infrastructure is undeniably the first condition to meet before attracting foreign direct investments (FDIs) in an economy. A seaport, in this regard, acts as the gateway to international trade to drive the engine of economic growth. In that case, sooner the Chattogram (Ctg) port is able to increase its efficiency to deliver quality service for its local, regional and international clients, the better for the nation's faster economic growth. To that end, the interim government is learnt to have fast-tracked its efforts to finalise deals with port development companies of global repute so the task of handing over the Ctg port's operation to them could be completed by next October, that is, before handing over power to the next elected government. \nAs reported earlier, the Ctg Port Authority (CPA) has raised its tariffs on a number of items including its goods, container and vessel handling services by large margins to set the benchmark so that after taking charge the interested foreign investors in port development could decide their own service charges based on it (government-fixed benchmark). The CPA secretary reportedly informed that the tariff-hike proposal has been already cleared by the finance ministry and awaiting law ministry's vetting before its publication through a gazette notification. But the local port users and stakeholders have been dismayed at the move, since the final decision of tariff raise, they claimed, has been made leaving them out in the cold. The port tariffs for some widely used services as finalised by the government are in cases 10 times higher than the current rates, they complained, though according to some port officials, the average tariff hike would actually stand at around only a 60 per cent in excess of the existing rates. Vehemently opposed to the final decision on raising port tariff rates, which are far higher than what they suggested should be (by around 10 to 20 per cent during their initial talks with the Shipping ministry), would be to the utter detriment of the country's foreign trade, especially Readymade Garment (RMG) export, which is, of late, battling severe headwinds. Worse, the port charges so outrageously enhanced will increase cost of doing all kinds of business and thereby burdening the economy and the general consumers with higher inflation. Arguments for or against the drastic port usage rates hike apart, the first thing that the government, or the Ctg port authorities for that matter, would do well to keep in mind is that however essential the move is, it should be made keeping the stakeholders in the picture. For any unilateral action in this regard might lead to a serious stalemate, which given the few months it is still left with to run, the interim government will find itself in quite a bind to resolve. \nThe reported assurance from the government that the frameworks for the agreements could not be scrapped by any future government as those (agreements) will be of international standards and bound by legal as well as diplomatic obligations with their possible geopolitical dimensions as well. This smacks of riding roughshod. In the final analysis, if things are left to widespread discontent of and non-cooperation from port users and, even worse, to be settled through prolonged future court battles, that hardly bodes well for the desired development of the port and its potential to draw expected FDIs to spur the nation's economic growth. \nWhile there is no point denying the overriding question of making Ctg port's efficiency and capacity for providing quality service to all users to match, if not excel, its regional competitors, it cannot be at the expense of national interests including those of the local users. Hiking tariff rate in anticipation of the port's questionable foreign takeover is flawed argument. The interim government would do well to look for wiser options.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Wisest option for hiking port tariff",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/wisest-option-for-hiking-port-tariff-1753804298",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       July 30, 2025 00:00:00  \nThe teacher-student ratio-widely regarded as one of the key indicators of educational quality-is deteriorating alarmingly, particularly in the country's secondary education system. One of the primary causes of the worsening ratio is the failure to recruit enough teachers to keep pace with the steady rise in student enrolment. While increasing enrolment is a positive indicator of access to education, it also demands proportional investment in teacher recruitment, training, and infrastructure-an area where the authorities continue to falter. Among the major reasons behind the growing gap is the inertia in filling vacant teaching positions. Whenever a few posts fall vacant due to retirement, death, or resignation, the response is neither prompt nor adequate. Rather than initiating timely recruitment, the authorities tend to wait until a large number of posts accumulate-sometimes taking five or six years-to justify a large-scale hiring drive. This approach, aimed more at reducing administrative workload and cost, is fundamentally flawed, leaving schools understaffed for prolonged periods.\nWorse still, this reflects a broader policy failure: the government's virtual abdication of responsibility for secondary education. With the vast majority of secondary schools being privately run, the government appears to have all but given up on expanding public secondary education. This hands-off approach is deeply concerning. Since independence, only a dozen secondary schools have been established by successive governments, and merely 60 institutions have been nationalised. Presently, there are only 339 government-run secondary schools in the country-just 3.0 per cent of the total. This means a staggering 97 per cent of secondary schools are privately operated, many of which charge fees that are unaffordable for most families, especially in urban areas.\nThis near-total reliance on the private sector has serious implications for equity and quality in education. Private institutions often operate with minimal oversight, leading to disparities in teaching standards, infrastructure, and access. One of the most visible symptoms of this is the declining teacher-student ratio. According to international norms, the ideal ratio for secondary education should be around 1:30. In stark contrast, many government secondary schools in Bangladesh operate with ratios as high as 1:103. Even the national average, as reported in the Bangladesh Education Statistics 2016 draft, stood at 1:41 in 2015 and worsened slightly to 1:42 in 2016. These figures, however, may not accurately reflect conditions in remote or low-lying areas, where the situation is often much worse.\nThe central issue is not simply the numbers-it's the absence of a coherent strategy for secondary education. The government's approach seems limited to expanding enrolment numbers without a corresponding focus on classroom conditions or learning quality. But enrolment alone cannot ensure meaningful education. Without a conducive learning environment-defined by adequate teacher presence, manageable class sizes, and relevant academic support-students are left struggling. In such overcrowded and under-resourced classrooms, meaningful teacher-student interaction is virtually impossible.\nThe consequences are evident. Deprived of attention in school, students are turning in ever-growing numbers to private coaching centres, which have mushroomed in every corner of the country, including rural and remote areas. These centres, mostly unregulated and unlicensed, have become the de facto education providers. Poor parents, with limited means, are compelled to spend on private tuition to ensure their children keep up with academic demands. \nThe rise of private coaching is not just an economic burden-it is a symptom of a failing system. It creates a dual-track education model, where schools are seen as ceremonial spaces while actual learning takes place in coaching centres. This trend is exacerbated by recent changes in the school curriculum, which require greater teacher involvement and student support-resources that are simply unavailable in today's secondary schools.\n\nReversing this decline calls for urgent and far-reaching reforms. First and foremost, the recruitment process must be overhauled. The current model of periodic, large-scale teacher recruitment is inefficient and harmful. A rolling recruitment system should be established to fill vacancies as they arise. This requires active monitoring of staffing levels and a decentralised response mechanism, allowing local education offices to initiate recruitment in real time.\nEqually important is teacher training. With evolving curricula and pedagogical methods, teachers must be equipped with the necessary skills and knowledge. Pre-service and in-service training programmes should be mandatory, ongoing, and aligned with curriculum changes. Existing teachers must be brought under continuous professional development programmes to remain effective in the classroom.\nMoreover, boosting the teacher workforce is not enough if quality is compromised. Recruitment should prioritise competence, subject-matter expertise, and a genuine commitment to teaching. Only a well-qualified, motivated teaching cadre can improve learning outcomes and restore the credibility of the classroom as the core of education.\nThese reforms will not be possible without a significant increase in budget allocation for secondary education. Investment is urgently needed in infrastructure, recruitment, teacher training, and school monitoring mechanisms. The current level of public spending falls far short of what is required to address the crisis, let alone to make meaningful progress towards equitable and quality education for all.\nSo, without immediate and sustained action to improve teacher-student ratios and address the structural weaknesses in school governance and support, the learning crisis will deepen. For a country that aspires to build a skilled and knowledgeable workforce, neglecting this foundational stage of education is not just short-sighted, it is also self-defeating.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Improving teacher-student ratio a must",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/improving-teacher-student-ratio-a-must-1753804389",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 30, 2025 00:00:00  \n\nIn recent years, Bangladesh has taken significant strides towards becoming a cashless economy. From digital wallets to QR payments, the way people transact is rapidly evolving. Mobile Financial Services (MFS) such as bKash, Nagad and Rocket have become household names, reshaping financial habits across urban and rural areas alike. As of January 2025, MFS transaction volume has reached a staggering Tk 1.72 trillion per month, with over 239 million registered accounts. This shift is driven by the convenience, speed, and safety that digital payments offer.\nThe COVID-19 pandemic accelerated digital adoption, forcing businesses and consumers to move away from cash. Today, digital transactions make up over a quarter of all banking activity in the country. With a growing young population and increasing smartphone penetration, the momentum for a cashless transition is strong. Even in remote villages, MFS agents provide services that were once limited to physical banks.\nHowever, the challenges are still there. A large portion of the population still lacks the digital literacy needed to confidently use financial apps and internet access remains limited to rural and low-income areas. Additionally, concerns about cybersecurity, fraud and data protection continue to grow. According to the Transparency International Bangladesh, over 6.0 per cent of MFS users have experienced financial losses due to fraudulent activity.\nRegulatory bottlenecks are another obstacle. Although the Bangladesh Bank issued licenses for digital-only banks in 2023, none have become operational as of mid-2025. This delay has slowed innovation and limited access to more advanced digital banking services. Moreover, service charges remain high for some users, with transaction fees up to 15 times greater than those in traditional banks.\nDespite ongoing challenges, Bangladesh is steadily advancing towards a cashless economy. With expanding digital infrastructure, strong policy support and innovation from the private sector, the momentum is clear. To ensure inclusive progress, greater focus is needed on digital literacy, fraud protection, affordability and internet access. With sustained efforts, Bangladesh can build a trustworthy and inclusive digital financial landscape that benefits people across all segments of society.\nMaria Tabassum Janbi, Student\nBachelor of Business Administration\nNorth South University \nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Are we ready for a cashless economy?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/are-we-ready-for-a-cashless-economy-1753804410",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 30, 2025 00:00:00  \nThe state of organ donation in Bangladesh is alarmingly poor. Despite the first successful kidney transplant in 1988, fewer than 1,000 kidney transplants have been performed since. Meanwhile, around 40,000 people suffer from kidney failure each year, yet only about 150 transplants are carried out annually. The situation for other vital organs is no better. Liver, heart, and lung transplants are virtually non-existent, with only four liver transplants completed to date. Corneal transplants are minimal-just 40 to 50 per year-despite half a million people suffering from corneal blindness.\nThe primary cause of this dismal picture is the absence of cadaveric organ donation. In most countries, organs from deceased donors are the cornerstone of transplant medicine. A single deceased donor can potentially save up to five lives. Yet in Bangladesh, no organs are currently collected from the deceased due to widespread superstition and religious misconceptions.\nNotable cultural figures like Waheedul Huq and Kamal Lohani have shown the way by donating their bodies for medical research. But broader public awareness and trust are lacking. According to Professor Harunur Rashid of the Society of Organ Transplantation Bangladesh, cadaveric transplantation must be introduced urgently to meet the overwhelming demand.\nTo move forward, the government, religious leaders, and healthcare professionals must jointly lead education campaigns to dispel myths and encourage a culture of donation. Without such steps, countless lives will continue to be needlessly lost.\nAshikujaman Syed\nBusiness Development Manager\nTianjin Pharmacn Medical Technology Co., Ltd., China\nsyedashikujaman@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Raising awareness about organ donation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/raising-awareness-about-organ-donation-1753804424",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-07-2025"
    }
]