[
    {
        "full_article": "The Government of India has so far handled the issue of the 50% tariffs imposed by the U.S. with maturity and pragmatism. Despite provocative statements by senior U.S. government officials, India has refrained from being baited and has instead stuck to its established position. So, while U.S. Trade Adviser Peter Navarro called the Russia-Ukraine war “Modi’s war”, India has remained calm and has instead been preparing on how to deal with the new reality of 50% tariffs. At the same time, Indian officials have said that negotiations on a trade deal with the U.S., though paused, are not off the table. Even the additional 25% ‘penalty’ tariff imposed on India is not a deal breaker, they have said, even though it renders any trade deal inconsequential. This is an eminently practical approach. A knee-jerk cessation of trade talks with the U.S. would hurt India further, but the gains from any potential trade deal will also be undone if these penalty tariffs remain in place. The messaging by the government to industry, too, has not been of denial but of reassurance: they know there is pain coming, and a plan is in the works to alleviate it. The solutions seem to be looked at from a suitability point of view, and not for optics. Rather than announce flashy fiscal incentives, the government has demonstrated awareness that such incentives would hardly make a dent in the face of the 50% tariffs for India while competitors face less than half that. Instead, the government is focusing on what it can effectively address, such as the impending liquidity crunch exporters are going to face.The Centre has been reasonably pragmatic about how to secure the overall economy from the tariff impact as well. Exports make up about one-fifth of India’s GDP. The U.S. accounts for about one-fifth of that, and even within that, about 40% of India’s exports to the U.S. will not be affected by the 50% tariffs. So, even though the sectoral impact of the tariffs could be quite severe for some sectors, the macroeconomic impact is likely to be limited. The dual approach of rekindling dialogues with China, while also trying to propel domestic consumption through GST rate cuts should, therefore, go a long way in mitigating the hit. There is some talk in the government about easing the norms laid out in the COVID-19-era Press Note 3, which curtails Chinese foreign direct investment in India. This should be encouraged, with adequate guardrails to ensure national security. The Centre and States must also cooperate next week to ensure that the GST rate cuts go through, without compromising too much on the States’ fiscal health. Now is the time for level-headed action, not emotional outbursts. READ MORE Published - August 30, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        government\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        trade agreements\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        national security\n                    \n                            /                      \n                        \n                        macro economics",
        "headline_1": "​Rational response: On U.S.’s tariffs and statements, India’s response",
        "headline_2": "India has opted for level-headed action in the wake of U.S. tariffs",
        "link": "https://www.thehindu.com/opinion/editorial/rational-response-on-uss-tariffs-and-statements-indias-response/article69988451.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "30-08-2025"
    },
    {
        "full_article": "The four-month high July growth rate of 3.5% in the monthly goods output barometer, the Index of Industrial Production, must have come as a relief a day after India’s largest trading partner, the United States, operationalised its punishing “penalty” tariffs of 25% ostensibly for New Delhi’s continued oil purchases from Russia. While this July’s 3.5% is lower than last July’s 5%, a broad-based growth in manufacturing aided by year-on-year (y/y) expansions in capital (5%) intermediate (5.8%) and infrastructure goods (11.9%), suggests that recovery continues to be led by considerable capex spends driven by the government. This is evident from the impressive growth in basic metals (12.7% y/y), electrical equipment (+15.9% y/y), and other non-metallic minerals (led by cement; 9.5% y/y).What must also come as a relief is the first green shoots of rural demand recovery as both consumer durables (7.7%) and non-durables (0.5%) were positive for the first time in nine months, on the back of a retail inflation of 1.55% aided by a second consecutive month of food price disinflation of - 0.8%, lower than -0.2% in June and 5.1% in July 2024. It is noteworthy that consumer non-durables — food staples and household essentials — have been positive only in four out of the past 12 months, and have consecutively remained negative from December last year till this August in the face of runaway consumer food price inflation that peaked between last September and January this year. While mining activity has contracted for the fourth consecutive month this year, July’s -7.2% was a tad better than June’s -8.7%, but much worse than last July’s 3.8%. The recovery from the massive flooding of coal mines across the mining States of Jharkhand, West Bengal, Odisha and Chhattisgarh could be a protracted process, the effects of which would be felt for months. The electricity output in July (0.6%) was marginally better than June (-1.2%), but was much worse that last July’s 7.9%. But these numbers may well be the calm before the storm. Tariff-impacted sectors such as textiles (-1.4%), apparels (3.2%), and leather (-3%) have already begun exhibiting signs of stress. The fact that these sectors are labour intensive and heavily dominated by India’s MSME sector makes the strain on the economy more acute. While the Centre has promised to address the near-term liquidity concerns of these sectors, the more human fallout of the highly probable large-scale job losses must be addressed if the gains from the historic easing in retail inflation for nine consecutive months are to be leveraged in a sustained manner to maintain, if not expand, consumption demand, and support India’s rural economy.\rREAD MORE Published - August 30, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        economy (general)\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        food\n                    \n                            /                      \n                        \n                        flood\n                    \n                            /                      \n                        \n                        mining\n                    \n                            /                      \n                        \n                        Jharkhand\n                    \n                            /                      \n                        \n                        West Bengal\n                    \n                            /                      \n                        \n                        Orissa\n                    \n                            /                      \n                        \n                        Chhattisgarh\n                    \n                            /                      \n                        \n                        textile and clothing\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        employment",
        "headline_1": "​Calm before the storm: On the economy, impact of U.S. tariffs",
        "headline_2": "The fall-out from probable job losses needs to be addressed",
        "link": "https://www.thehindu.com/opinion/editorial/calm-before-the-storm-on-the-economy-impact-of-us-tariffs/article69989848.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "30-08-2025"
    },
    {
        "full_article": "When ambition & loyalty pull in opposite directions\nAmbitious is great and ambition is dangerous. JD Vance has had a singular focus on making yuge goals. He went from being a never-Trumper to yes-man without whiplash. His next big thing is obviously the 2028 presidential election. This means a tricky tightrope. Show Trump that you are champing at his job, and he could fling you into the fifth circle of hell. Slick Vance has played it like a fox so far. But he has slipped up in a USA Today interview. He said, gasp, if there’s a “terrible tragedy”, he’s there, and he’s gotten the bestest of on-the-job training over the last 200 days.\nNothing we know about Trump says that he will take kindly to these words. Actually, which leader, in any field, would like their No 2 speculating about them shuffling off the mortal coil? Vance’s father was also named Donald, so there could be Oedipus complex type of stuff going on inside him as well. Historically, getting a raw deal has been part and parcel of the veep’s job, a tradeoff for playing in the presidential league. Asked about his VP Nixon’s contributions, Eisenhower famously said, “If you give me a week, I might think of something.” Trump can likely do better. Will he do it by phone? Vance got aboard the Trumpmobile after a lot of, as Trump said, “kissing my ass”. Staying on it up to 2028 will need tonnes more of the same.\n\n",
        "headline_1": "The Vance Dance",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-vance-dance/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-08-2025"
    },
    {
        "full_article": "Silence is golden, but India is nerve-wrackingly loud\nThe old Hindi saying, “a scabbard can’t fit two swords,” may seem pointless in this age, but like that coffee mug warning – “Caution. Handle with care. I’m hot” – it might still be useful. We could print it on smartphones for the edification of public transport users who watch reels without earphones. For, what is your mind if not a scabbard fitted to the sharp edge of your thoughts? The neighbour who blunts it with shorts or reels commits a grave misdemeanour indeed.\nBut maybe that’s too subtle a hint. We could take a leaf out of Transport for London’s book. They’ve launched a campaign to urge “headphone dodgers” to plug in on buses and trains, because the vast majority of passengers – 70% per their survey – do not like second-hand entertainment. Londoners call it “bare beating” – and “sodcasting,” when they’re not mincing words. Mind you, they’ve got strict laws against it – two years ago, a man was fined £300. But they’re trying to spare the rod now. Good luck to them, and the French, who fined a man 200 euros for making a speaker call at a train station in Feb.\nIn India, we won’t know where to start. Punjab Police is having a tough time checking bikes with loud exhausts. SC’s old order about the use of loudspeakers at night opted for early retirement, it seems. German laws prohibit hammering, drilling, sawing at home on Sunday. Lol. Psychologists have speculated that noise is a way of marking territory. On the road, in a train, late at night, the loud man or woman throws down the gauntlet to everyone else. But most people are averse to picking up the gauntlet. So, noise wins, mostly. A scabbard may be made to fit two swords after all.\n\n",
        "headline_1": "High Desibels",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/high-desibels/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-08-2025"
    },
    {
        "full_article": "Silence may be golden, but India sure loves being loud.\nHave you ever been on a bus or train and someone nearby is blasting reels or music without earphones? Annoying, right? In London, they actually have a name for it – “sodcasting” – like broadcasting, but really, really unwanted. They even fine people for it. One guy had to pay £300 (around ₹30,000!) for making too much noise. In France, another man got fined just for taking a loudspeaker call at a train station.\nIn India, it’s a whole different story. We’re noisy everywhere – bikes with roaring exhausts, loudspeakers blaring at night, drilling and hammering at odd hours. Rules exist, but they’re not really followed.\nWhy are people so loud? Some psychologists say making noise is like marking your territory – saying “This is my space!” Whether on the road, at home, or on a train, the loudest person kind of wins because most people don’t want to fight back.\nSo maybe, just maybe, our old saying about “two swords in one scabbard” does work: our minds are like scabbards (covers for swords), and noise from others can clash with our own thoughts. But in India, it seems we’ve made peace with carrying more than one sword at a time—whether we like it or not.\n\n",
        "headline_1": "High Desibels",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/high-desibels-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-08-2025"
    },
    {
        "full_article": "How his TV comic days shaped his wartime leadership\n“I am reporting here from the heart of Russia, if it has any heart left at all.” That was Zelenskyy filming a segment of his then weekly news parody from the edge of Red Square in Moscow in 2014. Just a few months after Russia had taken over Crimea. Zelenskyy had lived in Moscow for six years where his company, Kvartal 95, had massive productions from movies and sitcoms to variety shows. All in Russian. But Russia’s annexation of Crimea changed all that.\nThe Showman by Simon Shuster is the Zelenskyy book the world needed for insights into the mind of the Ukrainian leader. From barely known around the world as a comic-turned-politician, Zelenskyy is now one of the most recognisable faces, and for many, the leader Ukraine needed when the full-scale war began in 2022.\nShuster argues the beginning of this transformation goes back to Zelenskyy’s formative years in 1980s’ Kryvyi Rih. Zelenskyy belongs to the generation that saw the transition from the Soviet Union to free Ukraine, and this would impact his life choices going forward. Like his choice to be a performer instead of a more traditional profession that his Russian-speaking, Jewish, Soviet family wanted.\nShuster’s extensive reporting background on Russia and Ukraine gives him a good insider view into the Zelenskyy presidency and Kyiv’s response to the Russian invasion. Pieced together through extensive interviews with not just Zelenskyy but also those closest to him, both within his administration and personal circle, the book provides a riveting account of the early days of the full-scale war and the years leading up to it.\nWhen Russian guns opened up on Feb 24, 2022, nobody knew if Zelenskyy and his team would stick around. But as thousands of cars made their way out of Kyiv, Zelenskyy’s was moving in the other direction to the centre of the city where the presidential offices stood. When Oleksiy Danilov, then secretary of national security and defence council, pulled up to Zelenskyy’s office, the president asked a one-word rhetorical question in Russian: translated, it’s “Let’s kick some ass?”\nPer Shuster, this confidence in the face of odds is typical Zelenskyy. His entry into politics was a huge leap of faith too. Russia’s annexation of Crimea and the war in Donbas played a part in that decision. Those days he and his troupe would tour the frontline to entertain Ukrainian soldiers. Those interactions with men who were defending the country – unlike the elite sitting in Kyiv far removed from the war – proved to be pivotal in pushing Zelenskyy to run for office.\nBut in his initial years as president, he wanted to make peace with Russia. He had an innate belief that if he could directly talk to Putin, this madness could end and thousands could be saved. But Putin clearly had other ideas. The Russian massacre in Ukrainian towns and cities like Bucha following the full-scale war shook Ukrainians and the world, and would eventually stymie initial attempts at a negotiated settlement. Zelenskyy also thought he and Trump would get along given their reality TV background. But the Hunter Biden controversy put paid to that. It’s all this baggage that colours the war today: Putin’s cold calculations and Trump’s history with Zelenskyy – caught in the middle, a wartime leader who desperately wants peace.\n\n",
        "headline_1": "What Made Zelenskyy What He’s Today",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/what-made-zelenskyy-what-hes-today/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-08-2025"
    },
    {
        "full_article": "It is encouraging to see the Rohingya crisis getting renewed attention following a three-day conference in Cox's Bazar that brought together global stakeholders and Rohingya representatives in part to prepare inputs for a high-level conference scheduled at the UN Headquarters next month. A salient feature of this event was a seven-point proposal forwarded by Chief Adviser Muhammad Yunus, which needs to be acknowledged for capturing the major talking points of this evolving crisis. For too long, the crisis has been met with either indifference or a passive, short-term approach. Yunus rightly reminds the world that the Rohingya people's \"umbilical\" bond with their homeland cannot be severed, and that their safe and dignified return must remain at the core of any solution.\nHis first proposal—creating a \"practical roadmap\" for repatriation—underscores this point, for without such a plan the crisis risks being trapped in perpetual rhetoric. His second proposal highlights the need for sustained international aid, with major funding gaps emerging in the Joint Response Plan for 2025-26, especially after US cuts. The third and fourth points relate to the cessation of violence in Rakhine, allowing internally displaced persons to safely return home, and the creation of a platform for dialogue among Myanmar's ethnic groups to ease tensions.\nEqually important is his fifth point stressing greater involvement from ASEAN, neighbouring countries, and the international community in fostering peace and tackling cross-border crimes that destabilise the region. In this regard, he particularly mentions the ASEAN five-point consensus. In his sixth proposal, Yunus called on regional and global actors to stand firmly against ethnic cleansing and calibrate their relations with the Myanmar government, Arakan Army, and other armed groups accordingly. Finally, he placed justice and accountability at the heart of the solution, urging stronger international commitment to ongoing processes at the ICJ, ICC, and other forums. These seven pillars collectively outline a path towards both immediate relief and long-term resolution.\nGoing forward, we expect to see greater efforts on these fronts, especially from China which has the leverage to influence happenings in Myanmar and press for dialogue under ASEAN's five-point consensus. The fact is, as long as conflicts continue in Rakhine, the journey to desired outcomes, especially Rohingya refugees's repatriation, is unlikely to gain momentum. Even today, discriminatory policies like the 1982 Citizenship Law deny them basic rights. As Khalilur Rahman, the national security adviser and high representative for the Rohingya issue, has reiterated at the Cox's Bazar conference, Bangladesh submitted lists for approximately eight lakh Rohingya to Myanmar, which confirmed over 1,80,000 as eligible for return. But unless those root causes are addressed, not only will their return remain elusive but new challenges will complicate things further. Since early 2024, 1,50,000 more Rohingya have already arrived in Bangladesh following the surge in conflicts in Myanmar.\nBangladesh has done all it could so far, opening its borders to the refugees and carrying a burden far beyond its capacity. The refugees themselves have repeatedly voiced their yearning to go home. Regional and global leaders now must step up to ensure that this crisis is not allowed to being dragged on indefinitely.\n",
        "headline_1": "Resolving the Rohingya crisis requires greater solidarity",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/resolving-the-rohingya-crisis-requires-greater-solidarity-3971486",
        "news_paper_name": "The Daily Star",
        "publish_date": "30-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 30, 2025 00:00:00  \nTo amend the country's labour law in line with the international conventions on human rights, labour rights, environmental protection and good governance is admittedly the demand of the time. Also, members of the international community including Western diplomats, those of the European Union (EU) in particular, have been urging the government to effect the required amendments if only to continue availing the duty-free, quota-free (DFQF) access, the so-called GSP facilities, of the country's exports to its largest overseas market, the EU. And, after LDC graduation, the required changes in labour law would also help benefit from EU's GSP plus programme meant for vulnerable developing countries. Notably, through submitting application for the purpose, Bangladesh may be eligible for GSP plus upon expiry of three-year grace period (until 2029) following its LDC graduation by November 2026. \nIt is against this backdrop that the Tripartite Consultative Committee (TCC), a platform for consultation between the government, employers and workers to resolve industrial issues and help the government frame a relevant policy and effect labour law reform, reportedly, met in the city recently. The meeting chaired by the labour and employment adviser, aimed to fine-tune proposals for amending labour laws to meet international standards. In that meeting, a consensus was reached on the subject of forming trade unions (TU) in factories. In the said amendment thus proposed, the existing requirement of a factory's, say an RMG unit's, 20 per cent labour force's consent to form a TU, has been replaced, as reported, by a numerical option of at least 20 workers. The numerical threshold will replace the previous percentage option to form a trade union. According to the suggested amendments, the number of TUs to be formed in a factory has been increased to five in place of the previous three. The suggested amendments to the existing labour law should simplify the process related to registering and functioning of trade unions in industry.\nThe labour representatives at the TCC meeting rightly put forward strong arguments in favour of the numerical threshold instead of percentage. However, the employers' side, though it agreed to the numerical option for TUs in RMG units, stressed that for factories outside the RMG sector, the number should be higher. For formation of Collective Bargaining Agents (CBAs), representation from the majority workers of a factory was suggested. On this particular issue, the labour representatives favoured electing the CBA through vote. \nSome experts and industry representatives, however, expressed concerns that the amendment to TU formation with might lead to chaos, weaken management control and increase political interference from beyond the factories. Yet, once incorporated in the country's labour law, it would go a long way to make it compliant to international conventions facilitating its integration into the global economy and access to preferential tariff rates on selected products. Also, the labour law having enacted through embodiment of the proposed amendments, may also help establish workers' rights in an industry. At the same time, the TUs, to be formed, will give a stronger voice to the workers' demands and through their increased participation in the affairs of a factory, they would also be able to contribute positively to intra-industrial relations and productivity.\nIn this connection, the interim government needs to fast-track its endeavour to bring about the necessary amendments to the labour law in order to take better advantage of the prevailing DFQF arrangements from the EU market after the post-LDC graduation phase. It is more so, when the current world economy, including the Bangladesh's, is compelled to battle against the tariff anarchy triggered by Donald Trump.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Amending labour law to meet global standards",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/amending-labour-law-to-meet-global-standards-1756474920",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       August 30, 2025 00:00:00  \n\nIn a bold leap forward for automation, the National Board of Revenue (NBR) has mandated that nearly all individual taxpayers must file their income-tax returns online beginning this year. Only the elderly, individuals with disabilities, expatriates and those filing on behalf of the deceased are exempt from this new requirement. Obviously, this move aims to capitalise on the public's growing familiarity and comfort with digital tools to simplify return submission and improve transparency. This is undoubtedly a welcome change from the old, paper-based system. However, as with any great leap, the devil is in the implementation; and several challenges must be addressed to ensure a smooth transition for all taxpayers.\nThe good parts of this move are easy to see. For the average taxpayer, it eliminates the need to physically visit a tax circle and wait in long, intimidating queues. Given the longstanding allegations of harassment associated with many tax offices, taxpayers who become adept at using the online system stand to gain benefit from this change immensely. It also serves as a powerful blow against corruption. Specifically, it ends the deliberate practice where unscrupulous taxpayers would bribe some tax office employees to hide their physical files. This tactic ensured that when those files were later needed for scrutiny, they could not be found, thus preventing any legal action. Now, with records preserved in a secure digital format that is easily retrievable and far less susceptible to manipulation or loss, that avenue of corruption is closed. This ensures a level of transparency and safety that was once unthinkable, positioning the income tax department as the digital revenue authority matching modern economy demands.\nDespite these considerable benefits, the new system is not without its shortcomings. The most obvious one is its inability to allow taxpayers to upload supporting documents at the time of filing. Some NBR officials stated this omission is intentional, arguing that attachments only complicate the process and it is non-standard. While this approach may work for certain verifiable assets like savings certificates, it fails for numerous other categories. Critical information such as the salary of non-government employees, their Tax Deducted at Source (TDS) details or transactions involving land and property cannot be verified in real-time through the current system. Consequently, a taxpayer is forced to input data on good faith all the while facing the risk that any mismatch could trigger an audit and a demand for the very documents under the system would not let them submit those in the first place.\nFurthermore, this procedural gap creates a perverse incentive for non-compliance. When taxpayers are asked to submit information without supporting evidence, the temptation to misreport becomes hard to ignore. Stories of people inputting false numbers and boasting about it are already circulating from last year's filing season. Tax officials are government employees with limited capacity and they cannot reasonably be expected to detect every carefully constructed false return without the ability to cross-check documents. Even when irregularities are suspected, how many physical notices can realistically be issued? Sending a notice only to discover that everything is in order wastes time for both sides. Worse still, some taxpayers may ignore notices altogether, leaving officials to chase down information through letters to employers or manual follow-ups. In practice, this undermines the very efficiency the online system is meant to deliver. Hence, the NBR must recognise that, in its current form, the system is an open invitation to a new kind of digital tax evasion because it allows people to enter whatever numbers they please. These inefficiencies could be largely eliminated by incorporating an option to upload documents at the time of filing, which is a simple task for most taxpayers in today's digital age.\nAnother major weakness of the current system is its lack of integration with banking data. At present, taxpayers manually enter information such as account balances, interest income and tax deducted at source, with no way for the system to verify accuracy. The NBR is aware of this flaw and has already asked the Bangladesh Bank and the finance division to enable a mechanism where this information flows directly from bank servers into the online return form. Such integration would spare taxpayers the hassle of collecting statements and certificates and, more importantly, grant the NBR the enhanced ability to instantly cross-check taxpayer submissions, thereby making tax evasion far harder.\nUnsurprisingly, this idea has met resistance from the banking sector which expressed fears that sharing customer data could compromise privacy and discourage people from keeping their money in banks. These concerns are not without merit, but they do not outweigh the benefits as well. For a country with a vast informal economy and a tax base that remains stubbornly narrow, connecting the tax system to banking data is less a matter of choice than of necessity. Without it, automation will remain partial and the ambition of a truly transparent revenue system will continue to fall short.\nThe push to implement these solutions is also a matter of political timing. The country is currently under an interim government, a period often more conducive to passing difficult reforms. Once an elected government assumes power, influential groups with vested interests may again exert greater pressure, making it significantly harder to enact changes that threaten the status quo. This window of political will must not be wasted. Unless the gaps in the current system are closed, the online return mechanism will remain riddled with loopholes large enough to invite widespread abuse.\nNevertheless, there are positive indications that the NBR is committed to improving the system. In a welcome move, recently it has centrally determined which tax files require audit and disseminated these lists to circle offices, removing the discretion previously held by individual officials. This is a significant step. This should curb the longstanding practice where corrupt tax office employees could threaten taxpayers with audits to extort bribes. Taken together, these efforts mark a commendable beginning. The first step has been taken, but it is the next steps that will decide if this change truly works for everyone.\nshowaib434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Tax filing stands digital test",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/tax-filing-stands-digital-test-1756474981",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       August 30, 2025 00:00:00  \n\nEvery morning, the streets of Dhaka are crammed with a multitude of private cars, motorcycles, CNG-run three-wheelers, battery-run rickshaws, pedal rickshaws, a large number of them crowding the entrances of hundreds of schools. This daily influx exacerbates the already severe traffic congestion in the city. The situation turns worse during midday when morning shift ends and day shift commences, rendering many neighbourhoods in Dhaka virtually impassable. The city witnesses another wave of congestion as students come out of schools to return home.\nWith the absence of a reliable public transport system, students and guardians are left with no choice but to rely on para-transits and private vehicles. Despite numerous attempts, a comprehensive solution to this issue has remained elusive, leading to the underutilisation of the school bus service. Only a handful of educational institutions, including schools, colleges, and universities, have managed to implement a dedicated bus service for their students, teachers and staff.\nIn 2010, the Bangladesh Road Transport Corporation (BRTC) first introduced the school service with a fleet of 14 buses along the Azimpur-Pallabi route. Guardians initially showed great interest and then lost it due to delays and security issues. Now, only three to four buses are providing the service. Again, in July last year, Dhaka North City Corporation (DNCC) launched a 'smart' school bus service in Dhaka on a pilot basis. Under the initiative, the BRTC operated three double-decker buses on three fixed routes designed for picking up and dropping off students. The move, however, has remained suspended.\nThe primary issue with the school bus service is a lack of comprehensive planning and appropriate safety measures. Given that students reside in various parts of the city, it is crucial to gather relevant information and establish common pickup points. A select number of buses should be designated for students of specific educational institutions, with drop-off points located directly in front of school gates to prevent other vehicles from obstructing the process. \nUnlike students at the primary and junior levels, students at the senior level in schools (class 9 and 10, for instance) are better equipped to travel alone. For them, a dedicated school shuttle bus is a feasible option. So, schools need to encourage the older students to use the buses, and guardians need to be sensitised in this connection. It is, however, challenging for the junior students as most of them cannot travel unattended. It is necessary to provide sincere and responsible attendants in the school buses so that the guardians don't have to be worry about the safety and security of their children. \nA public-private partnership is necessary to operate the shuttle buses for educational institutions, as the government alone cannot manage the thing efficiently. Alumni of various schools and colleges need to come forward and mobilise necessary investment. Besides dedicated school buses, some shuttle buses for all students, irrespective of educational institutions, may also be introduced. Separate buses for male and female students are also needed to avoid untoward incidents. \nFor the shuttle bus service dedicated to educational institutions to be truly effective, it needs to be seamlessly integrated into the greater public transport system. Imagine the convenience if these shuttle buses could drop off students at metro rail stations, from where they can easily reach their desired destinations. However, it's important to note that this integration is not suitable for primary and junior level students. For them, buses need to reach dedicated stoppages near their residences, from where parents can safely collect them. The current bus-based public transport system in Dhaka is chaotic and disorganised, making it challenging for shuttle buses of educational institutions to be a part of that service.\nSo, it is necessary to revamp the public transport system by removing hundreds of dirty and ramshackle buses that are continuously polluting the air and causing noise. It is a nightmare for the commuters to travel by these buses in which the seats are congested and the windows are broken. It is the responsibility of the government to make the public transport efficient and ensure effective integration of shuttle buses for the educational institutions.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Introduction of shuttle school buses",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/introduction-of-shuttle-school-buses-1756475037",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 30, 2025 00:00:00  \n\nThe Rohingya refugee crisis continues to pose enormous humanitarian and public health challenges to Bangladesh. Nowhere is this more evident than in Ukhia, Cox's Bazar where nearly one million Rohingya refugees live. They live in some of the most densely populated camps in the world. \nOvercrowded shelters, inadequate sanitation, unsafe water sources and poor nutrition have created conditions ripe for the spread of infectious diseases. Outbreaks of cholera, acute diarrhoea, tuberculosis, diphtheria, measles and skin infections are recurrent in the camps. Respiratory illnesses continue to burden children and the elderly. Therefore, a minor infection can quickly escalate into a life-threatening epidemic.\nThe health burden is not confined to the Rohingya alone. The host community in Cox's Bazar is equally at risk of communicable diseases. So, it creates a dual challenge protecting a vulnerable displaced population while also safeguarding national public health security. Failure to address the crisis comprehensively could have consequences well beyond Ukhia.\nDespite various efforts from the government, international NGOs and local health workers, the response is increasingly strained. Humanitarian funding has been shrinking, leaving vaccination programmes, nutrition support and disease surveillance under pressure. Health facilities inside the camps are overcrowded, understaffed and often undersupplied. As resources dwindle, the likelihood of uncontrolled outbreaks grows stronger.\nWhat is urgently required is a renewed commitment both nationally and internationally to strengthen health interventions in Ukhia. This means sustained investment in disease surveillance, expanding immunisation coverage, ensuring uninterrupted supply of essential medicines and improving access to clean water and sanitation. Equally important is community engagement and empowering Rohingya refugees with health education, hygiene practices and active participation in prevention strategies.\nBangladesh has borne an extraordinary burden in hosting the Rohingya for eight years, displaying remarkable generosity and resilience. But the communicable disease crisis in Ukhia is not just a humanitarian issue; it is a matter of global public health. The international community must recognise the problem. There is no room for complacency. If the world truly stands in solidarity with the Rohingya, then urgent, coordinated and well-funded action against communicable diseases must follow. \nDr. Md Rifat Al Mazid Bhuiyan \nPost Graduate Fellow,\nRajshahi Medical College. \nrifatalmazid@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Communicable disease in Rohingya camps",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/communicable-disease-in-rohingya-camps-1756475081",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-08-2025"
    }
]