[
    {
        "full_article": "It has been a little over three months since President’s Rule was declared in Manipur, after a disastrous spell when the State government, led by the Bharatiya Janata Party’s N. Biren Singh, failed to de-escalate tensions in the ongoing ethnic conflict. By all accounts, there has been a significant reduction in gun violence and arson, which had flared up sporadically since the ethnic conflagration began in May 2023. Some of the weapons that were looted from police constabularies have been returned and the militants do not seem to be roaming around with sophisticated weapons impudently as they did earlier. But that has not meant that peace has returned. The free movement of people and goods across highways and between the hills and the valley continues to be impeded. There have been no signs of any thaw in the hostility between the two communities that were at the centre of the conflict and this has meant that those displaced, and who lost their homes in the valley and the hills, are yet to return. That the peace has been fragile was seen in the way the Imphal valley convulsed in protests following a recent incident during the run-up to the Shirui Lily festival, in Ukhrul district in late May. When a State transport bus with journalists drove close to Kuki-Zo inhabited areas, some security personnel placed stickers on the bus to hide the name of the State – an act that riled civil society groups in the valley. Ostensibly, this was done to allow for their safe passage through the Kuki-Zo areas but it only antagonised groups in the valley who saw this as an act of kowtowing to demands for a “separate administration”, one of the key demands of the Kuki-Zo community representatives. Apparently, some of the latter’s partisans had opposed transport services through their areas but stepped back after a stern stance by the organisers of the festival.It is understandable that the Union government has to walk a tightrope in Manipur, and that explains the relatively slow pace of a return to “true normalcy”. But the government must take strong steps in disarming insurgent and chauvinist groups who continue to hold sway in the valley and the hills. It should also send out a message that these sections will not represent the respective communities in the peace and political initiatives that are needed to resolve the conflict. The distrust of state institutions has led to ethnic partisans setting the discourse. In order to reverse this situation, a stronger commitment to implementing the rule of law, while focusing on rehabilitating the victims of the conflict, is the need of the hour. Meanwhile, there have been calls for the restoration of the State Assembly, with some MLAs claiming majority support for a fresh iteration of an NDA government. This step should only be considered if there is some consensus on steps to be taken towards normalcy among the elected representatives of the respective communities and civil society actors. Published - May 30, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Manipur\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        national or ethnic minority",
        "headline_1": "Slow and unsteady: On Manipur and an elusive peace",
        "headline_2": "Ethnic violence has abated but peace continues to elude Manipur",
        "link": "https://www.thehindu.com/opinion/editorial/slow-and-unsteady-on-manipur-and-an-elusive-peace/article69634223.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "30-05-2025"
    },
    {
        "full_article": "On the afternoon of May 24, MSC Elsa 3, carrying more than 640 containers, started tilting off the coast of Kochi, apparently due to an operational problem. The nearly three-decade-old ship was said to be structurally safe. The crew abandoned the ship after unsuccessfully trying to right her. Now, Elsa 3 is lying at the bottom of the seabed 50 metres below. As per the cargo manifest, officials say the ship had 13 containers with hazardous goods. Twelve had calcium carbide, a reactive compound, and one had “rubber solution”. Some 50 containers, many empty, were floating and getting tossed around by monsoon weather. Officials say the rubber solution has reacted with the seawater and accounts for the plastic pellets being found on the Kerala coast. Five containers with calcium carbide, another pollution hazard, are lying on the seabed and need to be safely disposed of before they cause damage. Some oil pollution has also been reported. There is as yet no clarity on how to safely dispose of the plastic pellets.Though containers have tremendously boosted world trade logistics, oversight and control of what each container that passes several hands, ships and yards has is a global problem. Besides the 600-odd containers still lodged inside Elsa 3’s cargo space, some 365 tonnes of heavy fuel oil and 60 tonnes of diesel lie inside the ship’s tanks. That much of the oil has not seeped out yet is fortuitous but there is every possibility of it happening if quick action is not taken. The Chennai coast was ravaged by 250 tonnes of heavy fuel oil from an oil tanker that collided with an LPG carrier in 2017. MSC Elsa 3 is a toxic dump that needs to be quickly disposed of. Salvers are being engaged and they will follow international insurance protocols. The National Oil Spill Disaster Contingency Plan (NOS-DCP) names the Coast Guard as the nodal agency for such responses. In Chennai, the response was delayed by several days and there was much confusion and a lack of coordination between agencies. In Kerala, however, there has been enough time to rig up an effective response. With ambitious plans for economic growth that will inevitably lead to a surge in ship traffic, the government has also planned to draw more national and global transshipment traffic into India’s waters. India is only set to see a great number and variety of ships of varying cargoes on its coast in future. The Kerala response will show how well prepared India is to handle a major maritime disaster. Published - May 30, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        maritime accident\n                    \n                            /                      \n                        \n                        waterway and maritime transport\n                    \n                            /                      \n                        \n                        oceans\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        shipping service\n                    \n                            /                      \n                        \n                        hazardous materials\n                    \n                            /                      \n                        \n                        water pollution\n                    \n                            /                      \n                        \n                        diesel fuel",
        "headline_1": "​Danger in the sea: On Kerala and the MSC Elsa 3 sinking",
        "headline_2": "India’s response to maritime disasters must be faster and better",
        "link": "https://www.thehindu.com/opinion/editorial/danger-in-the-sea-on-kerala-and-the-msc-elsa-3-sinking/article69633913.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "30-05-2025"
    },
    {
        "full_article": "The globalisation of English has taken a lot of the foreignness out of foreign travel\nBunny and I are in Torino, Italy. And Bunny is eager to try out the conversational Italian she has picked up through assiduous practice on the Duolingo app on her cell phone.\nWe go for a morning coffee to Caffe Mulassano, the 118-year-old establishment that looks like what the inside of an antique jewel box should look like, all burnished gleam and gilded glow.\nBuongiorno, vorremmo due cappuccini, deka per me, normale per lui, Bunny says in her best Duolingo Italian.\nOkay, two cappuccinos, one decaf, and one regular coming right up, says the barista, sounding like she’s been displaced from Queens, NYC.\nIt’s like that wherever we go. Bunny asks for directions to a restaurant or wherever else we want to go, in punctilious Italian. The reply is almost invariably in English.\nIt was very different when we first visited Italy in 1973. We didn’t have a word of Italian, and no locals spoke anything else. We got by with an extempore hit-and-miss mixture of sign language, guesswork, and strokes of sudden inspiration.\nIt made simple things, like ordering a meal, or asking the way to the train station, into a dramatic adventure, an exciting exploration of an exotic linguistic landscape. It made foreign feel foreign.\nNow, everyone, everywhere, in Europe, even in France which once shunned les anglais like a socially transmitted disease, will break into Anglo-Saxon at the drop of a chat.\nA linguistic pandemic, English spans the globe, hurdling geographic borders and cultural boundaries like a vocal virus. And the more you try to speak to the local citizenry in their language, the more you’ll prompt a response in English, the speaker seizing this opportunity to demonstrate a grasp of what has become the most cosmopolitan of all languages, thanks to global commerce, Hollywood, and the lyrics of pop music. While this makes for ease of communication, it takes much of the foreignness out of foreign.\nSo we look forward to our next port of call, where no one speaks English at all. It’ll make for a nice change when we get to London. \n\n",
        "headline_1": "Talk the talk",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/talk-the-talk-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-05-2025"
    },
    {
        "full_article": "Trump’s logic for tariffs was always shifty. Just how shifty became clear in a court case US govt lost \nGovt work is hush-hush, but every few years declassified files spill old beans. So we now know that CIA trained pigeons to take photos inside USSR during the Cold War. That was Project Tacana. Now the curious term ‘Taco’ is floating around. Is it a secret US tariff strike aimed at Mexico? On Wall Street, it’s shorthand for ‘Trump always chickens out’. After all, the 47th prez lowered tariffs on China from 145% to 30% in a month. But Trump has a different take. “It’s called negotiation,” he told reporters on Wednesday.\nAlso on Wednesday, Trump’s aides tried convincing the US Court of International Trade that his tariffs had facilitated a different kind of negotiation – brokering the May 10 ceasefire between India and Pakistan. “This ceasefire was only achieved after President Trump interceded and offered both nations trading access with the United States to avert a full-scale war,” commerce secretary Lutnick said while opposing a plea to block Trump’s sweeping tariffs.\nThat’s either a slip or a file declassified too soon, for as far as we recall, Trump on May 11 wrote, “While not even discussed, I am going to increase trade, substantially, with both of these great nations.” Note: not even discussed. Forget a tariff threat, even trade was not on the table. And as far as India is concerned, US was not at the table either. Jaishankar made it clear again on Monday: “It was the Indian military action that made Pakistan say: We are ready to stop.”\nNeither Lutnick nor secretary of state Rubio – who said a negative ruling could “lead to embarrassment of the United States on the global stage” – could persuade the court, which faulted Trump’s use of emergency powers to impose tariffs. It’s a setback, but the tariffs will remain for now. Trump’s admin has already filed an appeal.\nThis battle could continue for many months, and since only the basis for the tariffs – not the tariffs themselves – is legally flawed, Trump could find a workaround. But what he needs to settle urgently is the rationale for tariffs. They were meant to right America’s balance of trade, and bring back manufacturing. Then they became a tool to stop illegal immigration and drugs. Then, a diplomatic bargaining chip. A veritable Swiss army knife. Hardly the blade for a hegemon. It can rend global trade, but won’t make China cower.\n\n",
        "headline_1": "Getting judged",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/getting-judged/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-05-2025"
    },
    {
        "full_article": "Assam’s move to liberalise arms licences in some state areas can turn seriously wrong. It should scrap the policy\nAssam cabinet’s decision to approve a special scheme to grant arms licences to ‘original inhabitants’ and ‘indigenous citizens’ in vulnerable areas of the state has rightly raised eyebrows. The last thing the Northeast needs is more guns. After years of painstaking security operations and negotiations leading to more than 10,000 militants across the region laying down their arms, giving guns back to the people defeats security objectives. It also undermines the narrative of normalisation that was taking hold in the Northeast.\nAssam CM Himanta Biswa Sarma says it is meant to deter threats and enhance personal security among indigenous communities in areas like Dhubri, Nagaon, Morigaon, Barpeta, South Salmara-Mankachar and Goalpara. He also cites recent developments in Bangladesh. But this would mean that Assam police and other security forces in the state haven’t been able to ensure law and order. Second, Assam has a terrible history of insurgency-induced lawlessness. Kidnappings, extortion and targeted killings were rampant during the height of Ulfa terror. What if the new liberal gun licence policy turns the clock back? As a state opposition leader said, govt can give gun licences but has no control over how those guns will be used.\nThird, in recent years, the Northeast has been talked up as a growth hub and a key pillar of India’s Act East policy. But will investments flow to the region if an atmosphere of lawlessness prevails? Note that Morigaon – where the new gun licence policy will supposedly apply – is earmarked for a semiconductor plant. Will hundreds of supporting companies required for semiconductor manufacturing make a beeline if there’s no confidence in local law and order? Himanta’s critics say he is playing his political games with assembly polls due next year. Whatever his reasons, he should take back the gun policy. \n\n",
        "headline_1": "Bullet isn’t the point",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/bullet-isnt-the-point/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-05-2025"
    },
    {
        "full_article": "Written by: Inder Raj Ahluwalia\nThe Fifth Sikh guru, Guru Arjan Dev’s life and achievements played a key role in shaping Indian history and spiritual traditions. Preaching Guru Nanak Dev’s mission, Guru Arjan Dev propagated humility, devotion, and surrender to God’s will. He imparted several teachings on important issues, such as acceptance of God’s will, trust, kindness, tolerance, and humility. The cornerstone of his teachings was having faith in one Creator.\nAt a physical level, one of his great tasks was the completion of the tank at Amritsar’s Golden Temple. Being truly secular, he had invited a Muslim saint, Mian Mir, to lay the temple’s foundation stone. With secularism being of paramount importance, his take on the subject is priceless. Through his life and teachings, the guru promoted universal brotherhood and religious tolerance.\nCollecting hymns of the first four Sikh gurus and adding his own verses and those of Farid, Kabir, Raidas, Jaidev, and Bhikham, his greatest work was the compilation of the holy Adi Granth. Today, the Granth Sahib is revered by millions worldwide.\nA priceless legacy bequeathed to us by the Guru is the Sukhmani Sahib prayer. Universally hailed as the ‘consoler of the mind’ and the ‘jewel of peace’, Sukhmani Sahib’s wealth of positive powers has won the faith of millions. Devotees recite it in devotion to the Guru as an expression of gratitude and faith; it is an invocation for physical and mental well-being and health.\nIn an environment dominated by significant turbulence and violence, the guru wrote the prayer to calm and heal, and he is omnipresent throughout its verses. He poured his very spirit, peace, into this composition.\n\nA powerful prescription for peace, calm, and bliss, prayer is undertaken by the devotee with the Guru’s generosity, mentorship, and guidance.\nWith ‘Sukh’, comfort, and ‘Mani’, mind, the prayer fulfils several goals. It refreshes the mind, soothes frayed nerves and rejuvenates the soul. It also banishes sorrow and removes anguish through sincere remembrance of God. In the third astapadi, canto, the Guru states that any study of holy texts, performance of austerities, etc, cannot compare with reading or listening to the Sacred Word.\nAbove all, Sukhmani Sahib helps one become a better person. It enables one to reach a high spiritual state through meditation and Self-realisation. Guru Arjan Dev believed that ‘men who stand for truth have to suffer, and their suffering strengthens the cause of truth’.\nAmidst upheaval, he found time to encourage trade and industry among the Sikhs, which created a surge in business transactions. He favoured widow remarriage, which hugely impacted contemporary life, and condemned the use of intoxicants. His opening of a leprosy centre in Tarn Taran is a noble reference point in relation to this disease.\nAlmost everything Guru Arjan Dev did was directed at being tolerant, good, and progressive. Today’s ravaged, troubled, and fractured world must realise the depth and wisdom of the Guru’s philosophy and follow in his footsteps. Guru Arjan Dev created a roadmap for us, and now the onus is on us to follow it.\n\n",
        "headline_1": "Sukhmani Sahib: Consoler of the mind",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/sukhmani-sahib-consoler-of-the-mind/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 30, 2025 00:00:00  \nAs the countdown to the national budget announcement begins, expectations for a realistic and targeted approach from the interim government rather than ambitious, sweeping promises would not be misplaced. Such a pragmatic stance is necessary, given the diverse and pressing challenges confronting the economy at this critical juncture. Broadly, trade expansion, employment generation, and investment promotion are expected to feature prominently on the government's spending priority list --- an indication reinforced by Finance Adviser Dr. Salehuddin Ahmed in his recent interview with The Financial Express.\nWith the economy still reeling from the aftershocks of recent political unrest, Dr. Ahmed finds himself navigating a tight fiscal space. \"Resource gap is the main challenge in budget formulation,\" he stated, emphasising the need for strategic resource mobilisation. The government, he revealed, plans to tap into foreign budget-support credits while also focusing on domestic avenues --- taxation, bank borrowing, and bond issuance --- to bridge the fiscal gap. Unlike previous administrations, the current government is intent on crafting a budget grounded in realism, focusing on clearly defined, attainable goals within available resources, he said.\nDr. Ahmed highlighted the importance of harmonising fiscal and monetary policies and ensuring judicious use of allocated funds, rather than expanding indiscriminately. In this context, the Annual Development Programme (ADP) will see reductions, which he admitted could affect employment. He, however, maintained that the government is consciously avoiding large, capital-intensive megaprojects and shifting its development strategy. \nMedia reports indicate that health and education --- two sectors chronically underfunded --- will again fall short of receiving meaningful increases. Despite expectations for corrective allocations from the interim government, no significant change appears likely. Dr. Ahmed's emphasis on skills and capacity development over infrastructure investments in these sectors may reflect a practical stance, but it fails to fully address the sectors' dire needs. It is critical that allocations are adequately matched to address glaring deficits in healthcare and education service delivery.\nIn a move aimed at fostering innovation and job creation, Dr. Ahmed mentioned that a dedicated fund will be introduced to support start-ups and new entrepreneurs. Furthermore, he hinted at widening the regulatory gap between listed and non-listed companies, and curtailing export incentives. The government is also looking to reduce tax expenditures by cutting back on exemptions granted through statutory regulatory orders (SROs) that often go beyond budget sanction. \nThe proposed budget outlay stands at Tk 7.90 trillion --- marginally lower than the current Tk 7.97 trillion. Revenue earnings have been targeted at Tk 5.18 trillion, with ADP spending set at Tk 2.30 trillion. The GDP growth target is 5.5 per cent, and inflation is expected to be brought down to 6.5 per cent from the current 9.0 per cent. The budget deficit is projected at Tk 2.26 trillion, or 3.62 per cent of GDP, which is estimated at Tk 62.5 trillion. Given the contractionary nature of this budget, it is imperative that sufficient attention is directed towards supporting small and medium enterprises, enhancing credit access for rural businesses, and bolstering sector-specific development, especially in agriculture, fisheries, and cottage industries.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Opting for realistic  budget targets",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/opting-for-realistic-budget-targets-1748533115",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       May 30, 2025 00:00:00  \n\nSome of the vital economic indicators that have come to light of late are far from encouraging. The country's gross domestic product (GDP) has been projected to grow at 3.97 per cent by the end of this fiscal year. This is the slowest growth in the past 34 years excluding the year 2020 when Covid-19 had its heavy toll on the economy and its growth rate slumped to 3.45 per cent. Similarly, during the first 10 months of the fiscal year 25, the execution rate of the Annual Development Programme (ADP) was 41.31 per cent, marking the lowest implementation rate in the past 15 years during the period under scrutiny. That may, keeping with the tradition of a late spurt, albeit suspect, rise up to a higher percentage but obviously will fall far behind the hundred per cent target. \nIf these less-than-positive economic indicators are not enough, revelations made at a conference titled \"Advancing Gender-Responsive Budgeting and FfD4 Outcome\" further add to the discomfort. Here the acronym FfD4 in its full form is the Fourth International Conference on Financing for Development held in Seville, Spain from June 30 to July 3 this year. If the Seville conference focused on how to finance sustainable development and reform the international financial architecture, the one organised by the Citizen's Platform for SDGs, Bangladesh and UN Women Bangladesh sheds light on the impacts of a recessionary economy on women in particular. That it has been made worse by the external adverse developments including measly international investment climate is also a fact. An analysis by the think tank Centre for Policy Dialogue finds that as many as 2.1 million people lost their jobs in the first half of the current fiscal year. What is particularly disconcerting is that 85.7 per cent of them to have become unemployed are women.\n Now if the gender-biased job losses are read even against the low GDP growth that is likely to contribute a modest $12 billion to the $450-billion economy in the fiscal year 2023-24 to make the size of the economy $462-billion strong in the ongoing fiscal, a foreboding picture of women's empowerment emerges. At the same time, it also points to the economic malaise on account of gross gender disparity in economic participation. It proves to be a cruel irony when per capita income is set to rise from $2,738 in the previous fiscal to $2,820 in the 2024-25 fiscal year. When a large number of people, particularly women whose participation in economy and development misses the gender parity by a wide margin, become freshly jobless, it is a consequence of decline in various economic indicators or even retrogression in some sectors. \nTo make the matter still worse for the interim government, the National Board of Revenue has failed to achieve the revised and down-sized revenue earning target by Tk 715 billion in the first 10 months of the financial year 2024-25. The revenue growth at a decelerated rate of 3.24 compared to the previous year during this period is unlikely to make a recovery in the remaining two months of the fiscal. So both the domestic and external sources of income show no sign of improvement. Had there been massive investment---both domestic and foreign, economic activities would gain momentum. But the country's political instability and lawlessness do not help the cause. \nThe rallying cry for a wide-ranging reform also is becoming subdued because of the interim government's lack of dynamic economic governance. In the absence of a bold and radical shift in economic management, even the leading economists who were involved with the task of preparing the white paper on the state of the country's economy expressed their exasperation. They have complained that the government has yet to act on the suggestions they made on a priority basis. Slight improvement in inflation and some stability in the foreign exchange market go to the credit of the governor of the Bangladesh Bank (BB). The central bank's tight monetary policy has made this possible but these are not enough to bring about a turnaround for the economy.\nMeanwhile political stakeholders are becoming restive on the question of reform. Different political parties' views are now diametrically opposed to each other. This could be avoided if the interim government did not dilute its concentration to some needlessly controversial issues such as human corridor and leasing out the profitable Chittagong terminal to foreigners. Instead, it would be wise to announce a clear-cut roadmap for election without leaving room for confusion because of a tentative seven-month time gap between December and June. \nIf some much-needed economic reform agenda were initiated within six or seven months of the interim government's assumption of power, it would have its reflection by this time. Unemployment has already taken its toll and if the economy performs as it does now, more people will become unemployed. Even the better performing readymade garment (RMG) industry amidst the global gloomy manufacturing and business environment will soon lose its steam because of two vital inputs such as gas and power supply. The situation will be more challenging on account of US president's reciprocal tax now vitiating the global commerce and trade. Failure to reform the labour law has already given an edge to competitors of Bangladesh RMG manufacturers in Vietnam and Cambodia. There is no way Bangladesh will be able to take any advantage of diversion of manufacturing units from China. So the prospect of an economic turnaround is hardly bright, if not bleak.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Economic indicators are  far from bright",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/economic-indicators-are-far-from-bright-1748533187",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       May 30, 2025 12:00:00  \n\nHealth facilities are the places where the two most important events of life for a large number of humans - birth and death - take place. In today's world parents want their babies are born in a hospital, not at home, to avoid childbirth complications that might risk the life of baby or mother or both. People prefer hospital care for themselves and their dear ones whenever they fall sick, particularly when they are terminally ill. Budgetary allocation and government's attitude to healthcare, however, do not reflect the priority the sector deserves.\nThere is no denying that the country's public healthcare system is grappling with chronic underfunding, misplaced priorities, inefficient management, and structural rigidity. Budgetary data in the last decade suggest that successive governments consistently allocated an average of just 5.0 per cent of the national budget for health. The allocation accounted for 2.0 per cent of the Gross Domestic Product (GDP). The figures are alarmingly low when compared with the recent Health Sector Reform Commission's recommendations, which suggest an allocation of at least 5.0 per cent of GDP and 15 per cent of the national budget to improve the country's healthcare system. More concerning is the fact that despite increasing public health demands the health ministry cannot fully utilise whatever allocation it receives. It is subjected to major cuts during mid-year revisions.\nA critical yet often overlooked issue contributing to poor budget utilisation is the lack of administrative and financial skills among hospital managers. Most public health facilities in the country are headed by physicians. These doctors may be highly skilled in clinical care, but lack experience in financial management, project planning or administrative governance as most of them do not receive any formal training in these fields. Such skill mismatch leads to significant inefficiencies, resulting in a struggle for directors or chief executive officers with planning expenditures, preparing detailed project proposals, and executing development funds. As a result, significant portions of the development budget or Annual Development Programme for the ministry remain unused, prompting the finance ministry to downsize it towards the end of the fiscal year. Poor implementation performance affects infrastructural development, equipment procurement, and system upgrades, delays service delivery and deters international development partners from channelling aid through government systems.\nAnother administrative bottleneck lies in the highly centralised nature of health financing. Public health facilities are not allowed to retain or reinvest their earnings, no matter how significant they are. Government health facilities are legally bound to deposit almost all their revenues to the national exchequer within a limited time frame, leaving facility managers with no flexibility to address urgent local needs or improve service delivery. Such rigidity discourages initiative at the local level. A government hospital that earns revenue from different services cannot use that money to repair essential equipment, purchase emergency medicines or procure other emergency supplies.\nThe underfunding and low budget implementation in the health sector lead to overcrowded hospitals, overworked doctors, inadequate medical supplies and poor infrastructure. People often have to rely on out-of-pocket (OOP) expenditures for even basic health services, deepening inequalities. According to several surveys, Bangladesh consistently ranks among the countries with the highest OOP spending on health globally. In 2021, the World Bank reported that Bangladesh's OOP expenditure was 73 per cent while health economists estimate that the current real OOP expenditure has reached 83 per cent. Low government investment in health sector and a lack of health insurance result in so high OOP, causing financial burdens on families.\nThe Health Sector Reform Commission has put forward a roadmap to reverse the current state of public healthcare. It is now up to policymakers to demonstrate the will to follow through. Ensuring adequate funding, building administrative capacity of health facility managers, and decentralising financial authority are not merely technical reforms; they are essential steps towards securing the health and dignity of every Bangladesh citizen.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Underfunding cripples public health sector",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/underfunding-cripples-public-health-sector-1748533242",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 30, 2025 00:00:00  \n\nAs Eid-ul-Adha approaches, Bangladesh's leather sector finds itself at a critical juncture. The government's recent decision to temporarily lift the ban on raw leather exports primarily to support the underprivileged class which relies on rawhide collection during Eid, has once again revived a longstanding debate. The debate is, if exporting raw leather is merely a blessing for the poor or a curse for the nation's industrial ambitions. While this policy offers short-term relief and liquidity to grassroots collectors, it threatens Bangladesh's long-term potential to become a global powerhouse in finished leather goods. \nBangladesh is uniquely positioned for leather sector growth. With over nine million cattle processed annually, especially during Eid, the country has abundant rawhide supply. However, exporting raw leather-earning less than $2.0 per square foot-yields only a fraction of the value compared to finished goods like bags and shoes, which sell for $15-$50 per square foot. As the nation moves towards LDC graduation, exporting low-value raw materials could jeopardise the opportunity to build a high-value export sector.\nGlobal dynamics further favour Bangladesh. Amid US-China tensions, Western brands are actively seeking alternatives to Chinese suppliers. With its competitive labour costs and raw material availability, Bangladesh is well-placed to step in. The country already produces over 400 million pairs of shoes and 80 million bags annually-proving its production potential.\nHowever, structural challenges persist. The Central Effluent Treatment Plant (CETP) at Savar remains only partially functional, threatening compliance with international environmental standards. Only three of 220 tanneries currently hold Leather Working Group (LWG) certification-essential for premium market access. Without certification, Bangladeshi exporters often sell leather at discounted rates to intermediaries abroad, who then resell finished products at a premium.\nWith LDC graduation looming and preferential trade benefits fading, Bangladesh must act now. Industry experts estimate that with full CETP operation, proper policy incentives, and export duties on rawhide, the country could capture up to 10 per cent of China's leather market, generate $10 billion in exports, and create over 100,000 jobs. This will also require a comprehensive national policy and programmes under it for workforce upskilling, R&D investment, and global standard compliance.\nThe short-term benefits of rawhide exports must not overshadow the long-term national interest. Bangladesh must choose value addition over volume and build a resilient leather industry that can thrive in global markets.\nShehwa Tahreem Amin\nanuvuanuvu17@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Rawhide exports vs global value addition",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/rawhide-exports-vs-global-value-addition-1748533266",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-05-2025"
    }
]