[
    {
        "full_article": "The National Education Policy (NEP) 2020 mandates that all students across the country must learn three languages in school. Theoretically, NEP 2020 is more flexible than the previous versions of the three-language policy in India, which have always faced resistance not just in south India but also different States. Hindi is only one of the many Indian languages, and States are free to choose any two Indian languages and one foreign language in the mix of three, according to NEP 2020. However, the fear that Hindi will become the default option as the second Indian language apart from the native language is aggravated by Maharashtra government’s attempts to prioritise Hindi over other regional languages and its continuing vacillation on the issue. The State has now withdrawn its decision that Hindi will ‘generally’ be taught until Class five, as the second Indian language, after it kicked off a political storm in the State and put the ruling Bharatiya Janata Party (BJP) on the back foot. A committee headed by Dr. Narendra Jadhav will now deliberate with all stakeholders on the relevance of the three-language policy. Chief Minister Devendra Fadnavis has said the government would accept its recommendation. This change of heart comes after estranged cousins Uddhav Thackeray and Raj Thackeray, legatees of a strident version of Marathi pride that often turned into violent xenophobia, came together to oppose what they see as “imposition” of Hindi. Evidently, the language issue is uniting political rivals against the BJP.Languages associated with power gain more influence but attempts to force languages on people on the back of political power can be divisive. The paradox is that the BJP sees the three language policy as a question of national pride and unity. It is clear that most students, including those in India’s Hindi-speaking regions, want to learn English. According to Maharashtra Minister Ashish Shelar, nearly a fifth of students in the State are learning a third language and the new policy would give that option to all students. There are 15 languages including Hindi available in schools under the third language option, and when at least 20 students demand a language in a school, it will be taught. While this sounds noble and politically neutral, the actual implementation is different. Hardly anyone in Bihar has learnt Tamil or Malayalam or Kannada or Telugu under the three language policy so far. The chances of an overwhelming majority of students ending up with Hindi as part of the three-language policy is high. No State or school can offer a vast range of languages. The BJP must reassess its language policy taking into account the responses that are emerging from different parts of the country. It must learn the language of unity.\r Published - June 30, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        education\n                    \n                            /                      \n                        \n                        students\n                    \n                            /                      \n                        \n                        school\n                    \n                            /                      \n                        \n                        language\n                    \n                            /                      \n                        \n                        Hindi\n                    \n                            /                      \n                        \n                        Maharashtra\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        Tamil\n                    \n                            /                      \n                        \n                        Malayalam\n                    \n                            /                      \n                        \n                        Telugu\n                    \n                            /                      \n                        \n                        politics",
        "headline_1": "Language of unity: On Maharashtra and the issue of Hindi",
        "headline_2": "Uniformity should not be confused with national unity in language policy",
        "link": "https://www.thehindu.com/opinion/editorial/language-of-unity-on-maharashtra-and-the-issue-of-hindi/article69751365.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "30-06-2025"
    },
    {
        "full_article": "Tennis loves its traditions, and The Championships at Wimbledon more so. In the recent past though, the sport’s most prestigious Major has progressively cut out many of its famed anachronisms. The bespoke grass-court seeding formula, the Middle Sunday holiday and best-of-five set doubles matches have all been done away with. Now, for the first time in the 148-year history of the tournament, there will be no line judges, and electronic calling will take effect on all courts. Yet, when the first ball is struck on Monday, there will be no dearth of the verdant pomp and splendour. If anything, a less clustered court, with its glazed green grass, may lead to a better visual experience, and give the best players, clothed in pristine white, a broader canvas to work their magic on. Chief among them will be Jannik Sinner and Carlos Alcaraz, the world’s top two men who have now established an engaging rivalry reminiscent of the Roger Federer-Rafael Nadal duels. Alcaraz, in fact, is the two-time defending champion at SW19 and has won four of his last five tournaments, including the Queen’s Club Championships. World No. 1 Sinner does not have similar grass pedigree, but his first-ever Slam semifinal was at the All England Club in 2023, and he won the only meeting with Alcaraz on grass, at Wimbledon 2022.However, 24-time Major winner and seven-time Wimbledon champion Novak Djokovic is not to be discounted. The 38-year-old Serb is not in Slam-winning shape but grass presents the best chance. He finished runner-up in 2024 just weeks after a knee operation and the last time he exited Wimbledon before the final was in 2017. Among women, No. 1 Aryna Sabalenka, despite the bitter French Open final loss to Coco Gauff, remains the player to beat and there is no reason why her power-packed game cannot triumph in southwest London. But the last eight editions have seen eight different victors, pointing to an open field. For Gauff and five-time Major champion Iga Swiatek, Wimbledon has been the least rewarding Slam and they will be hoping to crack the code. American Gauff has not gone past the fourth round while Swiatek’s best showing is quarterfinals. Defending champion Barbora Krejcikova, 2024 runner-up Jasmine Paolini and 2022 winner Elena Rybakina are among the other notable names. The Indian presence will again be limited to doubles with Rohan Bopanna, Yuki Bhambri, Sriram Balaji and Rithvik Bollipalli competing. As the country’s tennis remains stuck in a vicious cycle of a shrinking talent pool, administrative apathy and endless litigation, it will be up to these players to keep the flag flying.\r Published - June 30, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Wimbledon\n                    \n                            /                      \n                        \n                        tennis\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "Whites on greens: On Wimbledon 2025",
        "headline_2": "Wimbledon might be Djokovic’s best chance for a 25th Slam",
        "link": "https://www.thehindu.com/opinion/editorial/whites-on-greens-on-wimbledon-2025/article69751376.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "30-06-2025"
    },
    {
        "full_article": "Bezos’ Venice wedding typifies what spending power is doing to ecologically vulnerable places\nThe Bezos-Sanchez wedding spectacle in Venice cost $50mn. Plus the $3.5mn Bezos donated to – or ‘tipped’, as some said – the city’s local institutions. For context, Sanchez’s 30-40 carat diamond bauble is estimated upwards of $5mn. The only blip were protests, residents against Venice authorities’ reckless push to over-tourism, disregarding climate concerns (pollution from luxury yachts), impossibly high rents (Venice is tailored for ultra-rich, not residents), and elitism. The demonstrations forced a venue change for the three-day spectacle’s biggest event. Locals griped about the takeover of their city. In 2019, Uttarakhand town Auli struggled with man and machine to clean up 240 quintals of waste, left behind after a Gupta Bros family wedding. They offered to pay for the full exercise. But throwing money doesn’t make the problem go away. The problem is authorities’ unresponsiveness to residents’ concerns and scientists’ cautions, Cultural and environment redlines are crossed to chase tourists. \nThat’s at the rich end of the spectrum. Among the masses, pilgrimage turned tourism has meant a sharp uptick in accidents during pilgrim-festivals – yesterday’s Odisha stampede a case in point. Even simple trips turn into giant bling events in ecologically fragile regions. Garbage that mountaineers leave behind on Everest is well-documented. Boisterous walkathon pilgrimages such as the kanwar yatra, music blaring jaunts inside Ranthambore/Jim Corbett, weddings inside reserves and sanctuaries, there is nothing to stop the experience-seeker. Even those who would run away from it all do so in unsustainable ways – SUVs, air-conditioning in the hills, food wrappers, water bottles, trekking gear are bare essentials. In the last few years state govts and courts in southern states have restricted the scale of commercialisation for tourism. For instance, given the carrying capacity of Western Ghats roads – per TN govt 20,000 vehicles enter the Nilgiris every day – vehicle entry caps were imposed. In Coorg, estate conversions into resorts were stopped. Are the Himalayas the children of a lesser god? \n\n",
        "headline_1": "Match made in hell",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/match-made-in-hell/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-06-2025"
    },
    {
        "full_article": "Make ‘carry your own food’ your airline mantra\nThere’s something about airline food that feels profoundly Dickensian, best described as “Please, sir, may I have none?”\nMy latest airborne encounter began with the Vegetarian BF tray featuring podi idli that looked like it had survived not just boarding, but boarding school – starved of attention, nutrients, and affection. A shrivelled relic of South Indian heritage, it lay huddled next to an uthappam that resembled an existential crisis – flat, confused, and entirely out of place, like a seeker questioning life’s choices.\nMost of it remained untouched – except the croissant, which masqueraded as ‘continental’. It filled the stomach, yes, but also the rest of the day with digestive suspense. Then came the yogurt and cereal combo, which promised a healthy start – if you were born and raised in a granola commercial. Sweet beginnings are best reserved for love letters and Bengali mornings where rasgullas are served with pride and without apology. For the rest of us who crave chutney and sambar, this was treason wrapped in tinfoil.\nAnd so, in a moment of altitude induced clarity, I recalled an ancient wisdom I always forget: Just carry your own food. A lovingly packed podi idli – still echoing your mother’s affection and armed with actual spice – would have been fresher, tastier, and entirely free of philosophical burden.\nBut no. We are creatures of eternal optimism. We fall for airline ads with glossy chefs and dreamy menus and think, “Maybe this time.” So we leave behind 300 grams of edible common sense and gleefully check in 30 kilos of winterwear for tropical weather.\nTo be fair, airlines aren’t entirely to blame. Mass-producing meals across time zones, accommodating vegan-Jain-gluten-free-non-dairy-fusion diets, and then heat-sealing them into aluminium boxes is a culinary circus act. The miracle is not that the food tastes bad, it’s that it exists at all.\nSo, next time you fly, trust your gut. Carry that home-cooked idli. Or pick something up from your favourite restaurant, or even the airport café. At least you’ll know what’s in it. And it won’t look like it was rescued from a UN relief mission.\nBon voyage – and bon idli. \n\n",
        "headline_1": "A flight risk of taste",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/a-flight-risk-of-taste/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-06-2025"
    },
    {
        "full_article": "Whether in US or India, judicial intervention in policy is best restricted to constitutional questions   \nThe tug-of-war between Trump and federal courts has made news through the first five months of his presidency. His executive orders on everything from birthright citizenship to govt downsizing keep stalling in these 600-odd courts. An aggrieved party can always find a friendly judge somewhere in the country – Americans call it “judge shopping” – to block a presidential order. Not just for itself, but the entire nation. Trump’s erstwhile buddy Elon Musk summed up the situation thus: “If any judge anywhere can block every presidential order everywhere, we do not have democracy, we have tyranny of the judiciary.”\nBut America’s supreme court has now put an end to this practice of trial courts issuing “universal injunctions”. While hearing a challenge to Trump’s order on birthright citizenship, the court said federal courts cannot “exercise general oversight of the executive branch”. In these polarised times, this decision will be hotly debated. Critics say universal injunctions are a necessary check on Trump’s despotic tendency. Years may pass before the supreme court decides appeals against his orders, and thousands could be deported, sacked, or made to suffer in other ways in the interim. \nBut objectively, such injunctions have stymied not only Trump but also his Democratic predecessors Biden and Obama. A judge in Texas blocked Obama’s DACA programme in 2015. During the pandemic, federal judges blocked Biden’s vaccine and mask orders. One judge even tried to ban the abortion pill, mifepristone, across America. What needs guarding here is not the president or the judges but the constitution. If the president’s executive orders violate the constitution, courts should take a stand, but they shouldn’t try to shape policy.\nWhich is exactly what CJI Gavai said in Nagpur on Thursday: “judicial activism should not turn into judicial adventurism and judicial terrorism”. In India, as in US, it is not the judiciary’s job to demand or make laws. For example, India’s SC was clearly out of line when it made the national anthem mandatory in cinemas, in 2016. Luckily, it corrected its decision. But judicial overreach in executive matters has become common. SC’s rejection of the resolution plan for Bhushan Steel and Power is a recent example. Earlier, SC had waded into the issue of farm laws. Even HCs have trespassed into the legislative domain – consider how Manipur HC’s “recommendation” of ST status for Meiteis in 2023 sparked ethnic strife. Clearly, governance by encroachment of powers is a bad idea.\n\n",
        "headline_1": "Courts vs govts",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/courts-vs-govts/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-06-2025"
    },
    {
        "full_article": "We are not free merely because there happens to be no restraint on our actions. True freedom means we aren’t subject to the arbitrary will of one person or institution\nJokes, poems and social media posts that trigger outrage among certain sections of society dominate the news and have fuelled debate about the freedom of speech and its limits. Rarely, however, do we reflect on what freedom actually implies.\n\nIndeed, sometimes it seems as if our main concern is to secure the freedom of endless consumer choice.\nRead the full story on TOI+.\n\n",
        "headline_1": "What price liberty",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/what-price-liberty/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 30, 2025 00:00:00  \nThe government's reliance on domestic and foreign borrowing to bridge its budget deficits is endemic. A significant portion of the domestic borrowing traditionally comes from the banking sector and through the sale of national savings certificates (NSCs). The sale of NSCs, however, has been steadily declining over the last couple of years, leaving the government's loan target from this source unmet. As a result, increased reliance on bank borrowing is squeezing capital availability for the private sector. Interest rates on savings certificates were raised in January to make them more attractive, yet net sales of NSCs have remained negative. According to central bank data, during the July-April period of FY25, net sales of savings certificates went negative at Tk 74.31 billion, with encashment outpacing fresh investments. The reason for the slump is not hard to fathom. Inflation, economic slowdown and declining purchasing power has made savings in long-term government instruments a luxury many cannot afford. Low and middle-income families are, in fact, delving into their savings simply to stay afloat. \nAll this is further compounded by the procedural complexity surrounding the purchase of savings certificates. The requirement to submit proof of filing income tax returns for purchases above Tk 0.5 million has become a significant drawback for investors in NSCs. While the intent behind the rule to prevent tax dodging by wealthy individuals is understandable, its implementation has inadvertently penalised lower- and middle-income families. Many of them are forced to file tax returns simply to qualify for savings certificates, even if they have no taxable income. The lack of user-friendly mechanisms for return filing has only worsened the situation, apparently demotivating many from investing in NSCs. Thus, even after the marginal hike in interest rates, the competitiveness of NSCs compared to products offered by banks and non-bank financial institutions is in question. Moreover, unlike NSCs, these alternatives are often short-term and offer greater flexibility in both purchase and encashment.\nThese are the structural flaws that the government must iron out as it seeks to make the NSCs more attractive. Of late, the Ministry of Finance has tasked the Directorate of National Savings with identifying the causes behind the slump in sale of NSCs and take up corrective measures. The decision to investigate the causes behind declining investments in NSCs is welcome. As noted, simplifying the purchasing process, easing unnecessary conditions such as mandatory tax return submission and ensuring competitive returns would go a long way towards making NSCs a popular investment tool once again. \nMoreover, allowing savings certificates to be used as loan collateral could make a significant difference. At present, many investors are forced to encash their NSCs to meet family emergencies. If they had the option to secure bank loans against their sanchaypatras, many would not have gone for premature encashment. Banks offer loans against fixed deposit receipts (FDRs), so why not against NSCs? This is a glaring inconsistency. Given that NSCs are backed by a sovereign guarantee, it is entirely reasonable to permit their use as collateral under clearly defined conditions. So, allowing NSCs to be used as loan collateral, similar to bank FDRs, would provide the much-needed flexibility for investors facing emergencies.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Lukewarm sale of savings certificates",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/lukewarm-sale-of-savings-certificates-1751203965",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       June 30, 2025 00:00:00  \n\nHaving the requisite amount of foreign currency to meet import bills as well as external debt obligations is a constant challenge being faced by Bangladesh economy. Aside from export of manpower and service, commodity export is the standard affair to earn foreign currency. But Bangladesh's export basket could not be expanded significantly beyond apparel products so far. Other manufacturing sectors include leather and leather products, home textiles and the emerging fields of pharmaceuticals and light engineering. But their full potential is yet to be exploited. However, agriculture, the largest sector of the economy, which employs about 43 per cent of the country's entire labour force and contributes about 14.23 per cent to the GDP, is yet to come of age so far as its full export potential is concerned. In FY2023-24, for instance, agriculture's share of the total export earning was only 2.17 per cent at US$ 965 million. Notably, the country's major exportable agricultural products include frozen fish, shrimp, tea, spices, fruits and processed agricultural products. Agro-processing, especially the food processing industry contributes about 1.7 per cent to the GDP and employs 250,000 people. \nSince jute, a traditional export item, was declared an agricultural product in 2023 by the government of the time, its status should remain as such so that it may get all the policy support and other benefits that other agricultural products draw from the government. Agricultural products in FY2023 earned US$912 million from exports. If the export earnings from jute and jute products (US$912 billion in FY23) were also accounted for, the total earning from agricultural exports in FY23 would be twice the amount.\nAt a recent roundtable held in the city, experts and those concerned in the export of agricultural products pointed out how Bangladesh was missing out on the opportunity that the agro-processing sector holds. The global market for agricultural market was US$1.6 trillion in 2022 and is projected to grow to US$2.2 trillion by 2032, according to the Agricultural Commodity Market Research. Bangladesh's agricultural commodity sector with its present worth at around a billion dollar is nowhere near neighbouring India's around US$49 billion dollar in FY24 and with a 2.4 per cent share of the global agricultural export market. India is a very big country with its equally large agricultural sector and a comparable export market. In that case, Vietnam may be a better candidate for comparison with Bangladesh. But there, too, Bangladesh simply bears no comparison. With its USD62.4 billion agricultural commodity export in 2024, which marked an 18.5 per cent increase over the previous year (2023)'s, Vietnam is placed among the world's top 15 agri-product exporters. With more than double the population of Vietnam and a very fertile deltaic plainland, Bangladesh should have been able to fare better in terms of agricultural production and exports. True, Vietnam has far bigger landmass than Bangladesh, but that is not entirely arable due to its rugged central highlands. In fact, it is the government's policy towards agriculture that has enabled that country's (agricultural) products to compete in the global market better than ours. \nTo compete in the global market, the first condition to meet is the quality of the agricultural products. This requires agricultural practices that are up to internationally accepted standards. Does Bangladesh have required facilities to certify its products that are accredited by the International Organization for Standardization (ISO)? Is certification by the country's own testing body, Bangladesh Standards and Testing Institution (BSTI), acceptable to all importing countries? These are the issues that would matter most if Bangladesh is to carve out a niche in the global agricultural product market. \nIs it not paradoxical that Bangladesh has not been able to make its mark in the global agri-product market so far despite the fact that it ranks third in the world as the producer of rice, vegetables and onions; second as the producer of jute and jute goods; fourth in tea production and seventh in potato and mango production? Even rice production has increased in the Barishal region by 1.5 times, thanks to modern cultivation techniques, though its agricultural lands shrank by 6.0 per cent between 2014 and 2019 due to urbanization. These are clear indications of how the immense potential of the country's agriculture is being wasted due to lack of focus and the required practices. As noted in the foregoing, to compete internationally, the first condition of Good Agricultural Practices (GAP) has to be fulfilled. That involves maintaining soil quality, optimum water usage, integrated pest management, moderate use of chemical and organic fertilizers as well as eco-friendly resources and post-harvest handling. To ensure safety of agricultural products for both domestic and overseas consumers risks of microbial, viral and toxin-related contamination have to be removed. Evidently, the primary conditions to meet in ensuring those issues is the standard practice of hygiene, managing water quality and safe handling of inputs. It is a whole host of good practices that protects soil, environment and minimise pollution. Also, protection of workers' health is an issue that should be addressed through providing them with necessary training, protective equipment and, most importantly, safe working conditions. High quality agricultural products also require having proper storage facilities for agricultural products. \nPresident of Bangladesh Agro-processors' Association (BAPA), Md. Abul Hashem, reportedly told a recent discussion event in the city that if proper policy support from the government is assured, Bangladesh, within the next three years, will be able to earn thrice the amount it now does (around US$1.0 billion) from agricultural products export. Apart from that the areas needing urgent addressing, he pointed out, include absence of internationally recognised testing facilities since BSTI's certification is not globally accepted, acute shortage of technical experts and farmers lacking required skill in fertiliser application. All these factors together militate against quality of agricultural products. It is worthwhile to note that though the Small and Medium Enterprises (SMEs) are the backbone of the agro-processing sector, they lack the capacity to meet the compliance criteria of the global market. That brings us to the issue of initiating skill development training for workers employed in the SMEs as well as developing management skills of those operating the SMEs on a massive scale. \nThe government has a huge stake in developing the agricultural sector as part of diversifying the country's export basket so that the economy may survive the post-graduation challenges of a highly competitive world market.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Focusing on export of  agro-based products",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/focusing-on-export-of-agro-based-products-1751204021",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       June 30, 2025 00:00:00  \n\nThe news that as many as 36 Bangladeshi migrants in Malaysia have been arrested for their involvement in militancy is unsettling to say the least. They were active in introducing Islamic State (IS)-inspired ideology in the host country and formed recruitment cells within the community of their compatriots there, according to The New Straits Times. Whether the militants had any ambition of spreading terrorism in Malaysia is not clear but the authorities there made it amply clear that the \"cells were set up to indoctrinate radical beliefs, raise funds for terrorist activities, and to ultimately overthrow the legitimate government in their home country\". \nMalaysia follows a strict policy against terrorism. Datuk Seri Saifuddin Nasution Ismail, the Home Minister of that country revealed that planned security operation based on intelligence gathered by the Special Branch carried out in three phases in Selangor and Johor could nab the 36 Bangladeshis in connection with the organised undercover militant activities. Of them, five have been \"charged under the Offences Relating to Terrorism (Chapter VIA) of the Penal Code\" in two sessions courts. Another 15 of the group have been issued deportation order and the rest 16 are under investigation for their involvement in the clandestine militant movement. \nClearly, Malaysia's campaign against militancy has been swift and decisive, but is Bangladesh now equally determined to fight militancy? After the August 5 uprising, terrorists and anti-social elements came out of jails when the gates of many of those including the high-security one at Kashimpur were broken open. The six Islamist terrorists who attacked the Holey Artisans in Gulshan, Dhaka, killing 22 people, many of them foreigners, were killed but their seven associates including their masterminds were sentenced to death. Their whereabouts are not known. Also two militants of the banned Ansar al-Islam were snatched from the crowded court area in old Dhaka. They are still at large. \nIn fact, the interim government had little time to pay attention to the re-emergence of militancy in the country. The fluid state of politics in the country has not helped the cause. Some point accusing fingers at the attack on the Bangladesh Television building at Rampura, Metro Rail station at Kazipara and other highly sensitive infrastructures and centres on militants who joined the protesters during the movement. \nMalaysia has done its part of the job by busting the dens of militants who organised there and were making preparation for unleashing attacks on the government in Bangladesh at their convenience. But busting the terrorist network in Malaysia may not be enough. The militant groups may have formed a coalition among themselves in order to advance their common goal of unseating any elected government in the country. There is no guarantee that the IS followers are not active in other countries with the same dubious objective. Even they may try to cause serious disruption during the election to be held tentatively in February next year. \nThe police force is yet to make full recovery from the setback it suffered during and after the uprising. There is a need for extra vigilance and thankfully the Border Guard Bangladesh (BGB), the Rapid Action Battalion (RAB) and the Army are still on security duty. The police seem more to be interested in apprehending the members of the former ruling party of the fallen government than minding other pressing business. Since they had intimate knowledge of the militant groups, their service should be made good use of in hunting the militants, if any, trying to staging a comeback. \nMeanwhile, communications should be established with the Malaysian authorities in order to verify the militant backgrounds of those accused. They should be interned on their deportation from Malaysia and quizzed to get as much information as possible. If they have international connections, they may be made to admit so.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Looming threat from militants active abroad",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/looming-threat-from-militants-active-abroad-1751204072",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 30, 2025 00:00:00  \n\nThe interim government has taken the commendable initiative of \"Zero Soil\" to reduce air pollution caused by dust. Covering exposed soil with green vegetation can significantly reduce dust generation, thereby helping to minimise air pollution. The question, however, is which crops are most suitable for quickly covering the soil with minimal maintenance? \nIn Bangladesh, we have several common cover crops such as clover, vetch, cowpea, rye, Lojjaboti (Mimosa pudica), sunn hemp, and many others. Leguminous cover crops not only help reduce soil dust but also improve soil health by conserving moisture, suppressing weed growth, and fixing atmospheric nitrogen. Similarly, grasses like rye protect the soil surface from wind and provide ground cover by binding soil particles through their root systems.\nMimosa pudica, locally known as Lojjaboti, is another excellent option. It grows quickly and has a dense, sprawling habit that effectively covers the ground. Its extensive root system helps stabilise the soil and prevent erosion, especially on sloped areas like canal banks. When in bloom, its elegant, pink, button-like flowers also enhance the aesthetic appeal of the landscape.\nSunn hemp is a fast-growing summer legume that produces a significant amount of biomass. Its vibrant yellow flowers not only attract pollinators such as honeybees but also create a visually pleasing environment, particularly on road medians. The road islands can be planted with different cover crops, selected according to the size and shape of the open space.\nCover crops act as living mulches, enhancing soil fertility by adding organic matter. Therefore, from an environmental perspective, the \"Zero Soil\" initiative is both practical and sustainable. To ensure its long-term success, the Department of Agricultural Extension (DAE) and the Arboriculture Wing of the Roads and Highways Department may consider partnering with the Dhaka North City Corporation (DNCC) and the Department of Forestry. By working together, these agencies can implement the initiative smoothly and effectively contribute to reducing dust pollution in our urban environment.\nMd. Refatul Hossain\nAdditional Director (retd.)\nDepartment of Agricultural Extension (DAE)\nFaridpur Region.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "\"Zero soil\" initiative and cover crops",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/zero-soil-initiative-and-cover-crops-1751204094",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-06-2025"
    }
]