[
    {
        "full_article": "The IMF’s ‘C’ grade for India’s national accounts statistics should be a matter of concern for India, which has a reasonably robust data collection and analysis apparatus in place. A ‘C’ grade is the second lowest there is, and implies that there are some issues with the data that impede the adequate surveillance of the economy. National accounts not only include zoomed out macro indicators such as GDP and GVA but also sectoral metrics and measures of investment levels, consumer spending and — of particular interest right now — how exports are doing. Issues with these metrics, therefore, impede effective and targeted policymaking. A grade of ‘C’ puts India in the same league as China when it comes to its national accounts, a decidedly unenviable position to be in. The IMF is not the first to point out the flaws in India’s national accounts. Nor is this the first time that it has pointed them out. The IMF’s main problem with the national accounts data, that its base year of 2011-12 is very outdated, has been pointed out time and again. Outdated data is a problem India has been grappling with for a while now. The Index of Industrial Production and the Consumer Price Index both have a base year of 2011-12. In fact, even the IMF said the reason that India’s CPI received a grade of ‘B’ and not ‘A’ was because of the outdated base year. The outdated base year and the inordinate weightage of food in the CPI have resulted in India not being able to accurately capture price movements. Consequently, the RBI’s monetary policy is also impaired.The government is currently in the process of updating the base years and methodologies for national accounts, CPI, and IIP, with the new series due to be launched in early 2026. Perhaps the biggest issue with the national accounts statistics in India — and the area that requires the most attention — is the inability to accurately capture the informal sector. The informal sector, by definition, is extremely difficult to quantify since it comprises entities that are unregistered and cash-based. Yet, a more accurate estimate of the informal sector will not only materially impact the growth rate and size of the economy but will also lend crucial insight into how the bulk of India’s population is doing. India’s national accounts estimation has certainly improved over the years. The 2011-12 series included granular data from India’s corporate sector through the MCA-21 database, replacing the earlier Annual Survey of Industries. The proposed inclusion of GST data in GDP estimation in next year’s series is a welcome improvement. The IMF’s grade just further underscores how damaging delays in data releases and upgrades can be. Published - November 29, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        investments\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        Reserve Bank of India",
        "headline_1": "​Data deficiencies: On India and the IMF’s low grading",
        "headline_2": "IMF’s low grading shows how damaging delays in data upgrades can be",
        "link": "https://www.thehindu.com/opinion/editorial/data-deficiencies-on-india-and-the-imfs-low-grading/article70335187.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "30-11-2025"
    },
    {
        "full_article": "The recent escalation of tensions between China and Japan has become one of the most serious diplomatic crises between the two Asian giants. The trigger was Japan’s new Prime Minister Sanae Takaichi’s November 7 statement that any Chinese military actions against Taiwan could pose a threat to Japan’s survival, implying that Tokyo might intervene militarily. This was the first time a sitting Japanese Prime Minister made an explicit remark about Japan’s stance on a potential Chinese military action in Taiwan, marking a sharp departure from the cautious strategic ambiguity that Tokyo had long maintained. An enraged China has demanded that Ms. Takaichi retract her remarks, and has banned Japanese seafood imports and issued travel advisories to its citizens to avoid Japan. China has also claimed that Japan is planning to deploy missiles on Yonaguni island near Taiwan, calling it “an extremely dangerous move”. Chinese Coast Guard vessels are also patrolling the waters around the disputed Diaoyu/Senkaku Islands in the East China Sea, actions Japan says violate its territorial waters. Beijing has warned that any Japanese military intervention in Taiwan would be treated as an act of aggression.China’s anger is not entirely unfounded. Japan’s colonial legacy still casts a long shadow over the region. From 1895 to 1945, Taiwan lived under Japanese occupation following the Treaty of Shimonoseki. Japan’s brutal occupation of parts of China left wounds that are still raw in Chinese collective memory. Taiwan was returned to Chinese control after Japan was defeated in the Second World War, but became a separate administrative entity when the Kuomintang retreated there following the communist revolution of 1949. Although Taiwan has been self-ruled ever since, China considers it as a core sovereignty issue, a position acknowledged by most countries, including the U.S., through their adherence to the One-China policy. For decades, the status quo helped preserve the Taiwan Strait. Despite the deep mistrust, China and Japan remain economically intertwined — bilateral trade exceeds $300 billion annually. But the election of Ms. Takaichi, a hardline nationalist, and her provocative rhetoric, coupled with China’s forceful response, now threaten to usher in an era of full-spectrum hostility in East Asia. An immediate solution to the Taiwan issue is unlikely. For peace and stability to endure, especially amid global conflicts, the status quo — shaped by China’s claims, Taiwan’s self-rule, America’s strategic ambiguity and restraint on all sides — must be preserved. China and Japan should de-escalate and refocus on strengthening economic cooperation. The U.S., Japan’s treaty ally, must balance its security commitments with diplomatic efforts that are aimed at preventing miscalculation. Published - November 29, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        China\n                    \n                            /                      \n                        \n                        Japan\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        Taiwan\n                    \n                            /                      \n                        \n                        oceans\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        seafood\n                    \n                            /                      \n                        \n                        imports",
        "headline_1": "Tense waters: On China-Japan tensions",
        "headline_2": "China and Japan must de-escalate and focus on economic cooperation",
        "link": "https://www.thehindu.com/opinion/editorial/tense-waters-on-china-japan-tensions/article70335160.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "30-11-2025"
    },
    {
        "full_article": "Product design is dying, India should revive it \nWhy did T800, the Terminator, have an internal display reading out data in English, when it was an autonomous machine ‘thinking’ in zeroes and ones? Well, it needed the ‘feature’ to reinforce the character’s ‘machineness’ – a purpose arguably better served by Schwarzenegger’s wooden dialogue delivery . In that light, T800’s display was genius design. Alas, judging by all the new stuff on our shelves and streets, the design genie has left the building. \nTime was when even Robinson Crusoe, when he returned to civilisation, wouldn’t have mistaken a radio for an oven. Now, the rest of us can sometimes mix up Musk’s Cybertruck with a deep freezer. As for his ‘Robovan’ – “it’s coming,” he wrote on Friday – it could be a camping tent or Iron Man’s mask, depending on your angle of view. This is not to pick on Musk, who has fathered some nice looking cars before, but to generally assess the state of the design art. \nThe prevailing mantra is to make everything flat, and black. Or shiny silver. Microwave, water purifier, TV – they all look like variations on your smartphone. This, we are told, is futuristic. But since good design draws inspiration from environment – the classic Vespa from a wasp, and the classic VW Beetle from a beetle – are we headed into a future where our only inspiration would be flat walls? It could happen if AQI remains as dreadful as it is now, but it would be a depressing future. \nWhat will it take to make things beautiful and evocative again, like the moka pot (1930s), and the Eames lounge chair (1950s)? Where’s the gorgeous modern scooter that could star in a remake of Roman Holiday? As the world’s two-wheeler king, India should make it. In fact, given its rich design traditions, India should aspire to become the world’s product design studio. That’s one thing China, with its regimented thinking, hasn’t been able to do. Young and free India has an edge.\n\n",
        "headline_1": "Studio India",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/studio-india/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-11-2025"
    },
    {
        "full_article": "Power & prejudice define what we mean by mental disability \nSimon Jarrett, a nursing assistant in the 1980s in a south England hospital for the mentally ill, recoiled when he read the file of his first patient, G, who had been admitted in 1924 aged 6. The file said: ‘G is a bat-eared cretin’. Only for Jarrett to learn the insult was the ‘official’ term for the mentally deficient in 1920s-30s. \nThose They Called Idiots: The idea of the disabled mind from 1700 to the present day by Simon Jarrett traces how society’s view on ‘intellectual disabilities’ evolved – historically labelled ‘idiots’, ‘imbeciles’, ‘feeble-minded’ etc. The “idea of the disabled mind”, the book argues, is neither fixed nor natural but has changed given cultural, legal, medical, racial and political contexts.\nIn the 18th century, those considered ‘idiots’ were neither isolated nor locked away. They lived within families or communities, worked (even if involuntarily) and contributed. They weren’t ‘beyond’ society but lived in everyday social imagination – including in unkind jokes. \nThe mid-19th century to 1980s saw their ‘incarceration’ – about 140 years of institutionalisation, locked away from the mainstream. This had its roots, the book argues, in ideas of Enlightenment, which had built ‘mental attributes’ that made one ‘human’. The bureaucratic state that followed took those ‘different’ in its ‘care’ – a life of routine & regulation, cruelty & humiliation, were part of the drill. Emerging ideas of citizenship, responsibilities & roles, demanded certain ‘mental ability’ in order to ‘belong’. Those deemed deficient were carted off to the ‘medical terrain of asylums’. \nEugenics deeply influenced attitudes. Nazi experiments saw the ‘mentally defective’ as threats to social “purity”, leading to untold horrors of dehumanisation. Enter democratisation & meritocracy, and, where was the place for the unintelligent? \nThe race for mechanisation, cybernetics, disappearance of ‘routine work’, the book quotes laureate physicist George Thomson, were problematic: “What is to happen to the really definitely stupid man, or even the man of barely average intelligence?” Thomson foresaw the “stratification of society and allocation of resources according to intelligence as nothing less than a headache for future politicians.” \nIn England, post-war welfare state model swept all mental deficiency charities and hospitals into state care under NHS. But as the book argues, “What role could medicine play in the lives of these people who were simply who they were, who happened to have a lower level of mental faculty than others but for whom there was no form of medical intervention that could treat, change or cure?”\nParents would be pressured to institutionalise infants, and the “authority was so… unquestionable, it was difficult for parents to resist, even if they were desperate to keep their baby.” The book argues that even post war, the eugenics influence was sustained, if “disguised”. The idea was to forget this one, and try for a “more successful outcome”.  \nBut then, parents began to oppose the “soulless arrogance” of doctors who would dismiss their offspring as “less than human”. They became a “site of opposition” to medical authority. The movement captured public attention, till laws and govts and societies conceded these are people in need of justice, not isolation. Jarrett provokes a rethink of the idea of mental disability not as a flaw, but a reminder that the measure of ‘normal’ is shaped by history, power, and attitude. Who we call an ‘idiot’ says much about us. \n\n",
        "headline_1": "An Intelligent & Caring Guide To ‘Idiots’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/an-intelligent-caring-guide-to-idiots/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-11-2025"
    },
    {
        "full_article": "Few frauds are as funny as those related to insurance\nRemember the farmer in England who claimed insurance for his phone that had disappeared into the insides of a cow while he was helping it calve? Or the woman who lost her phone when she left it in a sponge cake pre-bake? Both phones were, ahem, retrieved, as it were, but not quite in working condition. If ever there’s a list of bizarre and fraud insurance claims, here’s one for the top five. A businessman in UP tried to cremate an employee’s remains. Only, ground staff discovered the corpse was a dummy. Verily, the doll is dead, long live the droll. The businessman had a neat Rs 50L policy in the employee’s name in the hope of cheating insurers by faking his death. \nTo be dead serious, insurance fraud is no joke. Just weeks ago in Nov, Lucknow cops arrested a couple for duping insurers of Rs 25L payout by faking the husband’s death. Financial distress and mounting debts are apparently pushing otherwise-most-ordinary middle-class people to extreme actions and criminal behaviour. Of course, crash-for-cash and burning down property are classic frauds insurers are ever alert to. As is inflating medical bills or pretending an injury is more severe than it is. So what’s the upshot? Insurers get even more tightfisted when it comes to honouring genuine claims. Every insurance fraud makes insurance companies 10 times more nasty when dealing with people who really need help. \n\n",
        "headline_1": "Claim To Fame",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/claim-to-fame/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-11-2025"
    },
    {
        "full_article": "That SC has many times overturned its own rulings should be celebrated, not lamented. The 2-judge bench’s critique misses the point. From strengthening fundamental rights to decriminalising gay sex, guaranteeing right to privacy to stopping misuse of sedition, SC reviews have protected citizens\nOn Wednesday, a two-judge Supreme Court bench observed the court is pained at the “growing trend of revisiting and overturning of its own verdicts by subsequent benches”. Ironically, this obiter dictum came on the day the country commemorated its 75-year-old Constitution, one recognised by SC and jurists as a living document, open to dynamic interpretations with passage of time.\nRead full story on TOI+ \n\n",
        "headline_1": "Supreme change of mind",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/supreme-change-of-mind/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-11-2025"
    },
    {
        "full_article": "Every year, lakhs of birth certificates are issued to establish the civil identity of citizens, and this document later becomes essential for obtaining a National ID (NID) card. Before the introduction of online birth registration, the process was entirely manual, slow, fragmented, and prone to errors. NID issuance began in 2008, and in 2010 Bangladesh modernised its civil registration system by launching the online Birth Registration Information System, reinforcing the legal requirement to register every birth within 45 days under the Birth and Death Registration Act, 2004.\nDespite these advances, interoperability remains a major challenge. The Birth and Death Registration Information System (BDRIS) currently exchanges limited data with 22 government agencies through MoUs and API-based connections. Previously, in the absence of a unified legal mandate or a standardised data-protection framework, these arrangements relied more on administrative goodwill than enforceable safeguards. The recent introduction of the Personal Data Protection Ordinance (PDPO), Cyber Safety Ordinance (CSO), and the National Data Governance and Interoperability Architecture (NDGIA) provides much-needed regulatory clarity and institutional mechanisms for secure, transparent, and lawful data exchange. Together, these policy instruments signal the government's commitment to strengthening interoperability and establish a clear legal foundation for expanding future BDRIS linkages with other government systems.\nHowever, the lack of full integration continues to create real-life complications for citizens. To obtain an NID, an individual must first have a birth certificate; yet an adult applying for a birth certificate is often required to present an NID as proof of age. For many, the experience resembles the classic question: which comes first, the egg or the chicken?\nEven birth registration rate among children aged 0 and 11 months are not 100 percent in Bangladesh. However, major opportunity to link the Expanded Programme on Immunization (EPI) with BDRIS exists. Such integration would allow birth registration to take place automatically at the point of delivery or during a child's first vaccination, ensuring accuracy and preventing children from being left out. Beyond easing the burden on families, this approach would reduce duplicated data entry across government offices and cut the number of steps citizens must navigate. Similar integrations are needed to bring birth and death registration closer to frontline health services, creating a more transparent, efficient, and citizen-friendly system.\nThe government's commitment to making BDRIS accessible to all is clear, but that commitment must now translate into more timely and forward-looking technical upgrades. The expansion of hosting capacity from 72-terabyte to 500 terabyte and the increase in document upload limits from 200-kilobyte to two-megabyte are welcome steps, but they come long after the system began straining under its own weight. These fixes should not be viewed as enhancements; they were overdue necessities for a platform expected to manage crores of records across the country.\nInteroperability is also beginning to show promise. The April 2025 collaboration with the Election Commission, through which BDRIS data supported e-ID delivery for 1.25 crore students demonstrates what coordinated digital services can achieve when systems finally begin to talk to each other.\nDespite these improvements, the current BDRIS interface still works only partially on mobile and tablet screens, even though smartphones remain the primary digital access point for many rural registrars and citizens. Without a fully responsive redesign, the platform risks excluding precisely the communities it aims to serve. A dedicated mobile app, designed around real user behaviour rather than technical assumptions, could simplify registration and deepen public engagement. Bangladesh does not lack talent; a national design challenge or hackathon involving universities and private-sector partners could inject fresh, practical ideas into the redesign process. Such an initiative would help BDRIS evolve into the intuitive, citizen-centred digital service it has the potential to be.\nImproving BDRIS is not just a technical necessity; it is a matter of identity, access, and dignity. Civil registration platform responsible for documenting the very beginning of a person's legal existence cannot afford to be slow, disconnected, or difficult to navigate. It must be interoperable, easy to use, and designed around the realities of citizens' lives, not the limitations of legacy systems. Stronger coordination, user-centric design, and long-term planning are needed to close the remaining gaps. If these reforms are prioritised, BDRIS can truly fulfil the promise with which this journey began: ensuring that every individual is recognised, protected, and able to participate fully in public life.\nGM Saiful Islam is a development professional specialising in local governance, urban planning, and results-based management.\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Civil registration system needs a citizen-centred upgrade",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/civil-registration-system-needs-citizen-centred-upgrade-4046046",
        "news_paper_name": "The Daily Star",
        "publish_date": "30-11-2025"
    },
    {
        "full_article": "Bangladesh is witnessing one of its most troubling reversals in poverty in over a decade, and recent assessments emphasise the scale of the crisis. According to the World Bank's Bangladesh Poverty and Equity Assessment 2025, nearly 20 lakh people have fallen into poverty this year, pushing the rate to 21.2 percent, while more than 30 lakh slipped below the line last year. The country's total poor population has now reached around 3.6 crore, driven by job losses, soaring inflation, and declining household consumption. Despite repeated policy assurances, scattered relief measures, and incremental social assistance, the slide continues. The WB found that between 2010 and 2022, the poverty-reduction elasticity of growth fell to 0.9; in other words the country's economic growth was less effective in reducing poverty, reflecting weakened governance, shrinking labour opportunities, and a growth model increasingly unable to shield vulnerable households.\nLabour market data shows that Bangladesh lost nearly 20 lakh jobs between 2023 and 2024, with another eight lakhs expected to vanish this year, with women and young people being the hardest hit. Most new jobs are concentrated in low-productivity agriculture, signalling stagnation in industrial and service-sector dynamism. The WB report revealed entrenched failures in the social protection system, with only half of the poorest 20 percent of households receiving benefits, while the richest quintile continues to benefit from various subsidies—evidence of chronic mistargeting and political leakage. The survey further highlights that 6.2 crore people now hover just above the poverty line, vulnerable to slipping below it due to illness, shocks, or minor income disruptions.\nNationwide, poverty dynamics is increasingly visible in altered consumption patterns, livelihood adjustments, and falling living standards. Real wages, particularly in rural areas, have stagnated or fallen even as food prices remain elevated. Rising rural poverty is eroding household resiliency as families are reducing meals, borrowing at high interest, or selling productive assets to cope. Stagnation in job creation also risks undermining Bangladesh's hard-won progress in women's economic participation.\nThe persistence of this crisis reflects a failure of coordination, accountability, and long-term planning. Budgetary constraints, administrative delays, and fragmented policymaking are no longer sufficient explanations. Job creation strategies must be revamped, market access improved for rural households, skills development strengthened and transparency ensured in welfare programmes. Bangladesh has overcome adversity before, but the current trajectory demands decisive, coordinated, and accountable action. Without it, the poverty reversal could become entrenched, undermining national progress for years to come.\n",
        "headline_1": "Act now to reverse the poverty backslide",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/act-now-reverse-the-poverty-backslide-4045806",
        "news_paper_name": "The Daily Star",
        "publish_date": "30-11-2025"
    },
    {
        "full_article": "We are shocked by yet another devastating fire in the Korail slum, the fourth major one in just two years. Home to nearly 1.5 lakh people, Korail has always been vulnerable to fire hazards. However, the latest incident exposed how unprepared we still are to handle them. The fire revealed structural flaws that have remained unaddressed for years. As flames ripped through 1,338 tightly packed shanties on November 25, around 6,000 residents lost their homes overnight. The scenes the next morning were painfully familiar—families rummaging through charred ruins and children holding the few things they managed to save.\nThis tragedy highlighted the deadly structural weaknesses that make Korail so vulnerable. The slum has one entry point, which is so narrow that even two rickshaws cannot pass at once. It took firefighters 35 minutes just to reach the scene, while large engines could not enter at all. Crews had to drag hoses from a distance as flames fed on wooden frames, garbage, and tangled electrical wires.\nThe human cost of the fire cannot be overstated. Among the victims was Minara Begum, still searching for her mother, Hosne Ara. Elsewhere, Rima Akter stood with her eight-month-old son, recalling how a suspected electrical short circuit near her home triggered explosions of a chain of gas cylinders, forcing her to flee with her children. This was the third fire for 50-year-old Mohammad Ismail, who wandered through the ruins with a single suitcase containing the last pieces of his belongings. He had rebuilt twice before, only to watch his possessions turn to ashes again.\nHundreds are now living under the open sky in nearby fields and schoolyards. They need shelter, warm clothes, food, and financial aid to meet daily needs. The government has been providing emergency relief, but that is not enough. It must implement a well-coordinated plan so they can rebuild their lives. Private organisations should also step forward. Wealthy citizens must not forget the workforce that provides them with services at homes and offices every day.\nEqually importantly, the structural flaws that make firefighting so difficult in Korail must be addressed urgently. Experts have repeatedly mentioned crucial reforms: accessible roads, safer construction materials, proper electrical maintenance, and, most importantly, community-based first-response teams trained and equipped to act before fires spread. These recommendations must be implemented without fail. At the same time, the causes behind the frequent blazes must be investigated and addressed efficiently. Such devastating fires must not be repeated.\n",
        "headline_1": "Survivors of Korail slum fire need urgent support",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/survivors-korail-slum-fire-need-urgent-support-4045126",
        "news_paper_name": "The Daily Star",
        "publish_date": "30-11-2025"
    },
    {
        "full_article": "We are deeply concerned by the vulnerable condition of many Dhaka University residential halls, which were once again exposed by the recent earthquake. For years, experts have warned that these ageing dormitories are structurally weak, yet university authorities have repeatedly ignored the warnings. The 5.7-magnitude quake left fresh cracks in at least 12 halls and plaster peeled off in numerous areas, injuring several students. Thousands now live in constant fear that the next tremor could bring catastrophic collapse. Meanwhile, frustrated by years of inaction by the authorities, students of Mohsin Hall temporarily moved into unused staff flats to protest their unsafe living conditions. This is truly unfortunate.\nReportedly, since 2008, experts, including teams from Buet, have inspected multiple halls and recommended major structural repairs, retrofitting, and even evacuation in some cases. But only emergency fixes were carried out. Mohsin Hall, Surja Sen Hall, Shahidullah Hall, Zahurul Huq Hall, and others remain in the same compromised state identified more than a decade ago. Sir Salimullah Muslim Hall, flagged as the most vulnerable, was recommended for evacuation by Buet in 2021, yet no impactful action has been taken. Instead of being renovated or rebuilt, these halls continue to house thousands of students everyday.\nAccording to DU engineers, at the core of this crisis lies chronic underfunding and longstanding neglect in building maintenance. While money is allocated for development, almost nothing is provided for routine maintenance. Only emergency repairs are undertaken, and expert recommendations for major renovations are left unimplemented. Around Tk 22 crore has been spent on the maintenance of seven to eight halls in the last five fiscal years, when fully renovating a single hall would cost nearly Tk 20 crore. This mismatch in funding makes meaningful repairs impossible.\nAfter the quake, DU announced a two-week vacation to repair the dormitories, and some other universities, including Jagannath University, temporarily suspended classes and exams. But campus closures will not solve the problem; all public universities must ensure that student halls are structurally safe. They must establish proper evacuation systems with clear exit signs, regular drills, trained staff, and designated gathering points. Most importantly, campuses must be integrated into the national disaster preparedness framework. For DU, both immediate and coordinated long-term action are essential. High-risk halls need full structural audits, and unsafe buildings must be evacuated and retrofitted or rebuilt. The government should allocate dedicated maintenance funds, and a joint task force of DU, Buet, and relevant agencies should oversee the implementation. DU must act before a preventable tragedy unfolds.\n",
        "headline_1": "DU dormitories need urgent repair",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/du-dormitories-need-urgent-repair-4044331",
        "news_paper_name": "The Daily Star",
        "publish_date": "30-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 30, 2025 00:00:00  \nThe verdict against former prime minister Sheikh Hasina in three corruption cases involving valuable government plots has produced a moment of national reckoning over the abuse of political power and the dangers of unchecked authority. A Dhaka court sentenced her to a total of 21 years in prison and imposed additional financial penalties, delivering its judgments in absentia as she and her co-accused family members were tried as fugitives from justice. Her son Sajeeb Wazed Joy and daughter Saima Wazed Putul were also convicted and sentenced to five years each for similar offenses. The charges stem from allegations that they illegally acquired three residential plots in the Purbachal New Town Project by concealing information about their existing property holdings in Dhaka which violated legal conditions governing such allocations. The testimonies presented in court lifted the veil on a coordinated effort involving government officials who bypassed required procedures and approved allocations even though the basic paperwork was missing and the submitted affidavits carried no legal weight. \nThe proceedings and the judge's observations conclusively revealed the deliberate manoeuvres to sidestep established protocols and rush the scheme through multiple layers of approval. Specifically, the court highlighted the allocation of plot to Sheikh Hasina via an initiated note despite there being no formal application, constituting a direct violation of regulations. The prosecution established the allocation was secured through a fraudulent, non-notarised affidavit, a method subsequently applied to grant plots to her children. The judge observed that Hasina actively pursued more properties even after initially receiving one, by recommending plots for her children and other family members, behaviour that reflected an insatiable appetite for accumulating state assets through improper means. Expressing astonishment at this avarice, the judge questioned why a four-time prime minister would require such holdings. The sequence of events, from the illegal initiation to the final transfer of the plot, demonstrated how oversight mechanisms remained subordinate to political authority and how routine compliance checks were brushed aside when politically influential figures were involved. \nThese convictions come at a time when Sheikh Hasina is already facing a death sentence delivered by the International Crimes Tribunal on charges of crimes against humanity linked to the events surrounding the July uprising that ended her final term in office. The broader political situation has shifted dramatically since her departure from power as the interim government has effectively barred the Awami League from contesting the upcoming national elections and many of its senior leaders have either fled or remain incarcerated. These developments have cast the party's future into uncertainty and have prompted debates on whether it can reorganise or whether its organisational spine has been irreversibly broken. While Sheikh Hasina's legal fate is unlikely to be settled anytime soon due to her current stay abroad under the protection of a foreign government which complicates the execution of the court's judgment, the symbolic weight of these verdicts is substantial.\nThe immediate political consequence appears to be the Awami League's further marginalisation from the country's formal political process. The long-term significance, however, lies in the precedent these verdicts have set for future governments. The judgments sent an unambiguous message that the illegal acquisition of state assets will be met with legal consequences and that administrative bodies have a duty to resist undue influence. This represents a necessary step for rebuilding public trust in institutions. Whether this legal outcome translates into a broader, sustained campaign against entrenched corruption or remains an isolated episode tied to political change is a question that only the future trajectory of the national politics can answer.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Purbachal plot case lesson for corrupt leaders",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/purbachal-plot-case-lesson-for-corrupt-leaders-1764425984",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       November 30, 2025 00:00:00  \nThe calendar year 2025 is now set to enter its final month tomorrow. In other words, just a month from now, the world will see the start of another year. The annual stock-taking of global economic performance is already underway, although only relevant data for the first three quarters (January-September) is available. In this connection, the World Trade Organization (WTO) released the latest Goods Trade Barometer on Friday last. The barometer is a composite leading indicator for global trade that provides real-time information on the course of trade in goods relative to recent trends. Usually, the barometer predicts trade developments two to three months ahead. The latest barometer indicates a possible development of global trade in the last quarter of the current year.\n\nThe key message of the latest WTO Goods Trade Barometer is that global goods trade growth is set to moderate in the last quarter, leading to slower growth in the last half of the year. The surge in global trade in the first half was mainly driven by frontloading of imports ahead of expected tariff hikes and by rising demand for AI-related products, according to the barometer index analysis. The overall barometer index fell to 101.8 in September, down from 102.2 in June and below the quarterly trade volume index, which reflects actual merchandise trade developments. \nThere are six component indices of the barometer, and all are above their standard baseline value of 100 except for the agricultural raw materials index (98.0), which has been in contraction since the start of the year. \nThe indices for air freight (102.7) and container shipping (101.7) remain above trend. Nevertheless, these two indices have declined over the last three months, indicating a slowdown in global goods transportation. In other words, trade volume is likely to go through a downtrend in the coming days. The WTO last month predicted that merchandise trade, in terms of volume, may register 2.4 per cent growth in 2025 and 0.5 per cent in 2026. The slower growth projection is driven by higher tariffs and trade policy uncertainty in the second half of 2025 and in 2026.\nThe indices for automotive products (103.0) and electronic components (102.0) remained constant over the same period. It also indicates moderate growth prospects. Finally, the new export orders index (102.3) surpassed the baseline value of 100 in the second quarter, after some volatility at the end of 2024 and the start of 2025. \nSo, the overall reading of the indices suggests a moderation in global merchandise trade growth this year. \nEarlier last month, the UN Trade and Development (UNCTAD) in its global trade update showed that the world trade expanded by about $500 billion in the first half of 2025, despite volatility, policy shifts and persistent geopolitical tensions. \"Momentum remained strong into the third quarter, even as growth patterns varied across regions and sectors,\" it added.\nUNCTAD also said that the trade growth continued in the third quarter, with goods expected to expand by about 2.5 per cent quarter over quarter and services accelerating sharply to around 4 per cent. As full data for the third quarter trade were not available at the time of releasing the UNCTAD update, the UN organisation issued a nowcast, a forecast of what is immediately expected, for the third quarter. It also said that barring major adverse shocks in the final months of 2025, global trade is projected to surpass its 2024 record levels. Last year, the value of global merchandise trade stood at US$24.5 trillion, posting modest growth of 2 per cent over 2023. \nUNCTAD was of the view that despite turbulence from shifting US trade policy, global trade dynamics have so far shown limited disruption. However, uncertainty over future policy remains a key risk. \"Geopolitical instability also continues to weigh on trade, with persistent conflicts that could further disrupt regional dynamics and heighten concerns over energy and food security,\" it added in its October update report.\nThe moderation of the global trade in goods will also impact countries like Bangladesh as their exports are dependent on the movement of the global market. Already, the country's trade in goods registered a modest 2 per cent growth in the first nine months of the current year over the previous year. Statistics available with Bangladesh Bank showed that total trade in the January-September period of 2025 stood at $82.79 billion, which was $81.14 billion in the same period of 2024. \nThe official statistics also showed that merchandise exports of the country increased by 4.74 per cent in the first nine months of the current year, whereas the imports remained almost the same, reflecting weak domestic demand. \nAs the country enters the election-centric political business cycle, weak domestic demand will persist for a couple of months before and after the election in February of the next year. While the import is correlated with domestic demand, the export is linked to the international market, which has already become somewhat volatile due to Trump's tariff policy. \nThe US President initially imposed a 35 per cent reciprocal tariff on Bangladesh, which later fell to 20 per cent after hectic negotiations with several commercial offers to the US. The new tariff rate comes into effect in August, and the primary impact will be visible by the end of the year. \nAs China is the leading trade partner, mainly because it is the largest source of imports in Bangladesh, despite a decline in domestic demand, total imports from China will post moderate growth by the end of the year. \nOverall, Bangladesh is going to witness a year of sluggish trade in goods which will have some negative impact on the growth of country's gross domestic product (GDP).\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Global trade moderation and Bangladesh",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/global-trade-moderation-and-bangladesh-1764426147",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       November 30, 2025 00:00:00  \nDhaka as a city is imploding. Overpopulation has overwhelmed its civic amenities, while problem such as chronic traffic congestion, utility crises, environmental pollution, and other urban stresses continue to grow unchecked. Not long ago, it earned the distinction of being one of the least liveable cities in the world. One would expect the government to take determined and effective steps to gradually address this mess, improving living conditions for city dwellers and helping the city shed this negative image. Ironically, however, the situation appears to be getting worse, not better, by the day.\nAccording to the UN's World Urbanization Prospects 2025 report, Dhaka has climbed seven positions to become the world's second most populous city, trailing only Jakarta. By 2050, it is projected to top the list as the world's most populous city with 52.1 million inhabitants. What consequences lie in store for the city if this projection comes true?\nThe runaway population growth already threatens sustainability. Today, around 82,000 people live per square kilometre in Dhaka. The authorities are struggling even to provide basic housing to this vast population. The city's environment is under severe threat; pollution is rising and water supply and sanitation systems are under severe stress. Parks, fields and open spaces have disappeared or are disappearing. Water bodies disappeared long ago, and now even the rivers are decaying due to pollution and rampant encroachment.\nTo make the city liveable, the first imperative is to curb the unchecked population growth. Every development plan has to contemplate a stable or foreseeable population; or else who can make a plan for a population that is continuously growing, a demographic base that is constantly shifting? Not only the jobless are migrating to Dhaka for supposed economic opportunity but the country's administrative structure is such that it will compel everyone to visit Dhaka for every purpose. All ministries, departments, state and private bodies are headquartered in Dhaka. Interestingly, even protesters from remote areas are nowadays coming to Dhaka to hold their rallies. This is due to the unitary structure of government. Can this not be altered? It is time for a drastic review.\nAdministrative, judicial, and civic services need to be decentralised and made accessible at the upazila, district and divisional levels. Advanced medical care, higher education, and essential public services should be expanded to districts and divisional cities so that people are not compelled to travel to Dhaka. Then, employment opportunities and SME-based economic activities must be broadened in rural areas through easy loans, alongside an expansion of agent banking so that each union has at least one authorised banking agent. Industries and factories should be relocated from Dhaka and other major cities to designated industrial zones. Once economic opportunities are made available in villages, the incentive to migrate to the city will naturally decrease. \nSo, for Dhaka's crisis, the solution does not lie within Dhaka itself but in the villages. If income is generated in villages, fewer people will choose to migrate to the city. As long as employment opportunities remain concentrated in Dhaka rather than in villages and upazila- and district-level towns, economic inequality will persist, and the relentless inflow of people into the city will continue unabated. Expanding the city, increasing building heights, or constructing more flyovers and expressways cannot provide a sustainable solution. Only decentralisation offers a long-term, viable path forward.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "As Dhaka's population surges, services go haywire",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/as-dhakas-population-surges-services-go-haywire-1764426189",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 30, 2025 00:00:00  \n\nDespite struggling with capital and provisioning shortfalls, as well as a large volume of non-performing and defaulted loans, most of the stressed banks received good ratings from credit rating agencies over the past years. Even those banks now undergoing mergers achieved A+ to AA in long-term ratings and ST-2 in short-term ratings in consecutive years.\nCredit rating is one of the most vital indicators for banks to determine their strength in terms of liquidity, coverage, leverage, future prospects, and to analyse their SWOT. It clearly instils confidence among customers by presenting a holistic picture of a bank's strength.\nIn past years, however, the scenario presented was often contradictory to the actual stance. Hiding defaulted and non-performing loans, along with showing fictitious income, was a common practice for banks seeking to appear stronger than they actually were.\nAs a small-sized economy, Bangladesh has eight credit rating agencies, which makes it misleading to assess a healthy picture. Countries like India, Pakistan, the Philippines, and others, which are stronger than Bangladesh, operate with fewer agencies.\nThis ornamental rating system not only undermines trust in banking but also creates severe risks for sustainability. Audit firms are also liable for such fabrication. Credit rating agencies conduct their assessments largely based on audit reports, relying about 60 per cent on audits to determine financial indicators. The remaining 40 per cent concerns non-financial issues. In effect, most of the accountability is transferred to the audit firms. These practices devalue potential in economic sectors and create a poor benchmark for the banking sector.\nIt is very disappointing to see ratings as high as AAA for heavily burdened banks. Even some banks that sank under enormous defaulted loans achieved BBB+ in previous records.\nWhen the banking sector is grappling with bad debts, it is now imperative to eradicate the existing irregularities in credit ratings and audit reports. Bangladesh Bank, BSEC, and other relevant authorities must take immediate action to prevent the situation from worsening further.\nKawsik Azad Pronoy\nA Banker \nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Misleading credit ratings",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/misleading-credit-ratings-1764426208",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-11-2025"
    }
]