[
    {
        "full_article": "The industrial production data for September is especially useful as it provides insights into longer periods such as the second quarter and the first half of the financial year. The news is not all bad, but there are areas that warrant attention. When looked at on a half-yearly basis, the IIP data for April-September 2025 show that industrial growth was the slowest in at least five years. At just 3%, the half-yearly growth is well below what it should be. However, quarterly growth shows that things are improving — Q2 growth was a more robust 4.1%, compared to 2% in Q1. The bright spot in all of this, at least on the surface, has been the manufacturing sector. In September, it grew by 4.8%, the second highest in this financial year. On a quarterly basis, the July-September 2025 quarter saw the manufacturing sector grow by a relatively strong 4.9%, the fastest quarterly growth it has seen since the quarter-ended December 2023. On a half-yearly basis, too, the sector’s growth bounced back to 4.1% in the April-September 2025 half, after having slowed to 3.8% in the first half of the previous year. Activity in the mining sector contracted in September 2025, the second quarter, as well as in the first half of the financial year. While some of this can be attributed to the monsoon this year, this performance is still unusually poor. Strengthening the sector should be a priority to shore up India’s energy and strategic mineral security.The manufacturing sector’s apparent strong performance, too, is not something that should be taken at face value. The data show that the growth is not broad-based, and is instead concentrated in some sectors. Of the 23 main manufacturing sub-sectors measured in the IIP, more than half contracted in the July-September 2025 quarter. Of concern is that labour-intensive sectors such as apparels, leather products, rubber products and plastics, all contracted in the September 2025 quarter. The sectors that grew included wood products, mineral products, basic metals and fabricated metal products, many of which are more capital intensive. If this trend persists, it could have negative implications for job creation, and warrants attention. The other troubling aspect of the data is that the consumer non-durables sector has contracted for the last six consecutive quarters. While some of these are essential items such as salt and edible oils, others are items of discretionary spending. Much of this is because of the base effect, but slack demand has been a problem that policymakers have been grappling with for some time. The only real solution lies in increasing incomes and creating jobs. Published - October 30, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        industrial production\n                    \n                            /                      \n                        \n                        manufacturing and engineering\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        energy and resource\n                    \n                            /                      \n                        \n                        minerals\n                    \n                            /                      \n                        \n                        metal\n                    \n                            /                      \n                        \n                        Salt\n                    \n                            /                      \n                        \n                        personal income\n                    \n                            /                      \n                        \n                        employment",
        "headline_1": "Uneven growth: On industrial production data for September",
        "headline_2": "Increasing incomes and creating jobs are a must to boost demand",
        "link": "https://www.thehindu.com/opinion/editorial/uneven-growth-on-industrial-production-data-for-september/article70217239.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "30-10-2025"
    },
    {
        "full_article": "Kerala sprang a surprise last week by signing up for the scheme, Prime Minister Schools for Rising India (PM SHRI), that dovetails the National Education Policy (NEP)-2020, to upgrade and brand 14,500 schools nationwide as model institutions. Kerala, one of the three States to oppose the NEP-2020 (the others being Tamil Nadu and West Bengal), on the contention that it sought to encroach on the subject of school education, which is in the Concurrent List, and infuse it with communal bias and anti-scientific content, was evidently looking to gain central funds. Earlier this year, Tamil Nadu had approached the Supreme Court of India after the Centre withheld funds under the Samagra Shiksha (SS) scheme over the State’s refusal to adopt the NEP-PM SHRI framework. Kerala’s agreement on adopting the scheme is now in freeze after strife within the ruling Left Democratic Front (LDF) soon after the government signed the PM SHRI Memorandum of Understanding (MoU) with the Centre, without Cabinet approval — an issue deferred twice in Cabinet meetings. The CPI, a key LDF partner, demanded an immediate withdrawal. The CPI(M), which holds the general education portfolio, initially defended the decision, arguing that enrolment in PM SHRI was necessary to avail of federal funds withheld under the SS, which had led to salary arrears for teachers and non-teaching staff. The CPI(M) clarified that Kerala remained opposed to the NEP-2020 and would retain control over its school curriculum. The allies reached a détente on Wednesday — a cabinet subcommittee will scrutinise the MoU. Implementation of PM SHRI will remain suspended until the subcommittee’s recommendation. The Centre will be formally informed of this decision.Kerala has long excelled in school education, achieving near-universal gross enrolment ratio, high retention rates, superior learning outcomes, and modern infrastructure — milestones that render many NEP-2020 targets redundant in the State. For Kerala, PM SHRI amounts to little more than cosmetic rebranding of already high-performing institutions, but the State would be forced to comply with provisions of the NEP-2020 for integration of ‘Indian Knowledge Systems’, which many reckon is a euphemism for pseudoscience. It is regrettable that the Centre withholds federal funds under the SS to arm-twist States into accepting NEP-2020 or PM SHRI. While Tamil Nadu has pursued legal redress, its case has not received the judicial urgency it warrants. In India’s federal polity, the judiciary must robustly defend cooperative federalism whenever it is undermined. As Kerala pauses PM SHRI, it must consider litigation to secure its rightful share of central funds. Federalism and State autonomy cannot be bargaining points in the quest for funds. Published - October 30, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Kerala\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        West Bengal\n                    \n                            /                      \n                        \n                        school\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        finance (general)\n                    \n                            /                      \n                        \n                        Left Democratic Front\n                    \n                            /                      \n                        \n                        Communist Party of India\n                    \n                            /                      \n                        \n                        Communist Party of India -Marxist\n                    \n                            /                      \n                        \n                        government",
        "headline_1": "​Federalism and funds: On Kerala and PM SHRI",
        "headline_2": "State autonomy cannot be bargaining point for availing central financing",
        "link": "https://www.thehindu.com/opinion/editorial/federalism-and-funds-on-kerala-and-pm-shri/article70217227.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "30-10-2025"
    },
    {
        "full_article": "That stability seems to be returning to Tatas’ top level is good news for the conglomerate and for the country. This is an opportunity for Noel Tata to create his own legacy\nBy numbers, Tata Group is a big part of the India story. It is India’s largest private sector employer, earns $180bn in revenue, and has a combined market cap of over $300bn. More importantly, the Tata name is proof that the country can produce a world-class, trustworthy brand. So, neither the conglomerate nor the country can afford disruptions at the top; stability and continuity are of vital importance. That Noel Tata has consolidated his grip on Tata Trusts, which controls Tata Sons – the group’s holding company – is therefore to be welcomed. Board-level issues should be settled quickly so that the group can get back to focusing on business. Given the multiple external challenges it faces – such as Trump’s H-1B curbs, which can impact TCS, and tariff shocks – the last thing it needs is to be distracted by internecine battles.\nThrough the history of large entities, a transition from old to new has not always been smooth. So the tensions within the Tata Group over the last couple of months should not come as a big surprise. Ratan Tata’s campaign for full control three decades ago – in the face of almost open defiance from the group’s chieftains, who ran their companies as fiefdoms – took many years. By comparison, the current round of discord within the Tata Trusts board spilled into public view only about a couple of months ago when the Mehli Mistry faction broke with the tradition of unanimity by voting against a Tata Trusts’ nominee director on the Tata Sons board; the events that followed culminated in retaliatory action in the form of a majority vote against the reappointment of Mistry.\nUnder Ratan Tata, the group’s revenues rose from $4bn to $100bn in the first two decades. Now that another Tata appears secure in the saddle, he has an opportunity to create his own legacy at the 157-year-old conglomerate. Both the Tatas and the nation stand to gain.\n\n",
        "headline_1": "Back To Business",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/back-to-business/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-10-2025"
    },
    {
        "full_article": "The curated path to online applause\nNot knowing the ABC of GenZ, I learnt about ‘aura farming’ only from this week’s STOI. It explained that your clothes, quotes, company you keep and vice versa, dance moves, your ‘look’ whether rizz, biz or even ‘resting bitch’, all have to be meticulously ‘curated’ – all for the Holy Gain of ‘online attention’. Does this mean that instead of the best version of yourself, you want to become the best ‘clickbait’? Really? Wow! FYI, my pre-pre-GenZ world also knew a thing or two about ‘aura’, even if we didn’t call it a ‘vibe’. And, yes, we too had people who worked at ‘cultivating’ it, like grapes, instead of ‘farming’ it, like bajra. \nHaving started Bombay Times which spawned the OG ‘Page Three People, P3P’, should I don my ash-toned designer sackcloth to atone for this ultra-narcissism? Mea culpa, P3 made even sane P eager to swap fame for ‘celebrity’ – which soon became celebrittle thanks to every Tony, Moni and Wannabe. But, hey, we only started the fire. It was fanned wild by that Great Enabler, the Selfie. Paromita Vohra, in these pages, recently informed us that this OCD aura-enhancement has now been deputed to The Instagram Boyfriend, a loser kept only to ‘curate’ the babe’s best shot at ‘Likes’ (nee fame). \n‘Big Brother Is Watching’ was dreaded. Big Bro Following is desired. Sting was unintendedly prescient. ‘Every move you make, every breath you take’ will be designed for ‘lit’ Aura Effect. Even the ‘natural look’ is a put-on, laboriously. Just like celebrities shielding their faces in photographs taken by  the pap their own manager alerted. \nWe ‘had it coming’. From fake news to faked people was only to be expected. Political/personal events have become like buffet salads – carefully arranged only for maximum eye appeal and image amplification. Back then, people attended curated exhibitions. This ‘aura farming’ curates people for exhibition. Not just body parts or even whole body, but entire persona.  \nWith camera as neo-Creator, should God worry? As it is, bots are staging a warm-bloodless coup.\n                                              *** \nAlec Smart said: “Netas should stop insulting Jungle raj.”\n\n",
        "headline_1": "‘Aura’ story, horror story",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/aura-story-horror-story/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-10-2025"
    },
    {
        "full_article": "Musk says truth is the foundation of his Grokipedia. But how can we trust AI to know what’s true & what’s not\nIn Western thought, Aristotle’s correspondence theory is the gold standard definition of truth and falsity. Truth corresponds to a fact in the world, falsity doesn’t. That definition is 23 centuries old. But deciding what is true and what is false, or agreeing on this, has certainly not become easier since then. Mind you, humans have continued to set a lot of store by this endeavour. Modernity has been as much about the determination of measurable, verifiable, universal truths as individuality and subjectivity. It is in the language of this hoary tradition that Elon Musk has launched his Grokipedia – saying that its goal is the truth, the whole truth and nothing but the truth. Except, darn it, the main qualification of this exercise seems to be the elimination of the human.\nGrokipedia has been launched as the Other of Wikipedia. That it has wholesoul plagiarised Wikipedia is ironic, but also completely of a piece with how AI’s degrading human copyrights. Wikipedia’s USP is transparent edit histories and messy human arguments, while Grokipedia’s is being all-AI. Of course, Wikipedia often stumbles in telling truths, but it is humans who bicker over it. Think about handing this complex matter to an LLM. These language models don’t even understand their system prompts precisely, let alone the concepts of truth and falsehood. Couple of years ago, researchers estimated that AI chatbots can hallucinate anywhere from 3% to 27% of the time. So, to trust knowledge creation to AI’s statistical trick of predicting the next word is a mug’s game. \nThe way everyone on X is hunted by Musk’s posts, unless they block him, betrays another dangerous kink in his encyclopaedia. The world’s richest man wants discourse dominance and X, Grok, Grokipedia…they can all be rigged to fall in line. Chatbots have shown themselves overeager to please even plain vanilla users. Imagine how much more sycophantic LLMs can be to their Big Daddies. Don’t be fooled that this is just a culture war. The entire corpus of human knowledge is at stake here. \n\n",
        "headline_1": "Musked ‘Facts’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/musked-facts/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-10-2025"
    },
    {
        "full_article": "Experiments around the world have already established that cloud seeding can’t defeat air pollution. What Delhi is doing in their wake can’t even be called innovation. It’s just political theatre\nYesterday, to mitigate air pollution, Delhi govt, in collaboration with IIT Kanpur, conducted the first cloud-seeding trial in areas like Burari, north Karol Bagh and Mayur Vihar. This follows the 25-point Air Pollution Mitigation Plan for 2025 it had unveiled in June, as a prelude to the smog season. The very first item in this plan was a “pilot project of cloud seeding through IIT Kanpur to study its effectiveness in dust mitigation”.\nRead full story on TOI+\n\n",
        "headline_1": "Flawed seeding",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/flawed-seeding/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-10-2025"
    },
    {
        "full_article": "The recent approval in principle of the draft Anti-Corruption Commission (ACC) Ordinance, 2025 is a welcome and necessary step towards the long-overdue reform of the institution, which is essential for combating the pervasive menace of corruption in the country. The decision to abolish the existing discriminatory provision that long granted special privileges to government officials—contrary to the constitutional guarantee of equality among citizens—is a much-needed corrective measure.\nIn 2013, this extraordinary exemption for civil servants was inserted into the Anti-Corruption Commission Act, 2004 by the then Hasina government, overruling a parliamentary standing committee's objection. Although the High Court declared the provision unconstitutional and ordered its repeal in 2014, the government ignored the ruling for the next decade. It has been alleged that such undue privileges were used by the Hasina government to secure the political loyalty of civil servants, enabling the manipulation of elections and the suppression of opposition under an increasingly authoritarian rule.\nAmong the recommendations of the ACC Reform Commission—established by the interim government led by Professor Muhammad Yunus following the 2024 mass uprising against Sheikh Hasina's autocratic regime—was the abolition of Section 32A of the ACC Act. This section requires the ACC to obtain prior government approval before initiating cases against judges, magistrates, or government employees, mirroring Section 197 of the Code of Criminal Procedure. However, as ACC Reform Commission chief Dr Iftekharuzzaman has noted, the draft ordinance falls short of fully implementing the widely supported reform proposals. A key omission is the failure to ensure transparency in the appointment process of ACC commissioners.\nExperience has shown that the politicisation of such institutions often begins at their formation stage, as secrecy and lobbying influence such key appointments. The draft ordinance drops the crucial provision mandating public disclosure of shortlisted candidates for the commission. The interim government, therefore, should reconsider these strategically significant reform issues. It should also adopt the proposed provision for half-yearly performance reviews of the ACC, as recommended by the reform commission, to strengthen accountability.\nWhile the ordinance in its current form is expected to enhance the ACC's operational capacity and effectiveness, the absence of sufficient safeguards against politicisation—stemming from a lack of transparency in appointments—risks undermining the broader reform objectives. Half-hearted or flawed reforms rarely yield lasting benefits. The government must, therefore, heed the concerns raised by the reform commission and ensure the full implementation of its recommendations to truly empower the ACC and restore public confidence in the fight against corruption.\n",
        "headline_1": "ACC ordinance needs full reform",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/acc-ordinance-needs-full-reform-4021321",
        "news_paper_name": "The Daily Star",
        "publish_date": "30-10-2025"
    },
    {
        "full_article": "We are deeply alarmed by the death of a pedestrian struck by a falling bearing pad from Dhaka's metro rail. But behind this tragic death lies a baffling negligence of supervision by the authorities responsible for public safety. Public infrastructure is more than steel and concrete—it represents a covenant of trust, a promise that the systems designed to improve daily life are, above all, safe.\nThat covenant was shattered on a street in Dhaka's Farmgate area on Sunday. The falling component killed a 35-year-old man named Abul Kalam Azad. Just a year ago, an identical component fell from a pillar a short distance away. That no one was killed then was a matter of luck. The repetition of such an outrageous failure suggests that the initial incident was treated as a glitch to be managed, rather than a serious warning that should have triggered a comprehensive safety review.\n\nThe immediate aftermath of Sunday's incident has followed a predictable script. The authorities suspended metro services, causing widespread disruption. A committee has been formed to investigate. Compensation has been promised to the victim's family. These are administrative reflexes, not solutions. They do little to confront the deeper crisis—lax supervision and weak accountability. The explanations offered so far by the authorities are alarming in their vagueness. The managing director of Dhaka Mass Transit Company Ltd (DMTCL) speculated about \"jerking of the line,\" a \"construction issue,\" or a \"design flaw.\" But this uncertainty itself is unacceptable. This is not a minor technicality; it is a component responsible for transferring the entire load of the train and absorbing its vibrations. Its integrity cannot be compromised. Even more troubling are the questions surrounding the investigation. Appointing the former managing director of the metro rail company, who now leads the government's Bridges Division, to head the probe committee is a clear conflict of interest. This is deeply problematic: he held the position of managing director at DMTCL when the previous incident occurred.\n\nThe science of elevated rail systems is indeed mature, perfected over a century of global engineering. That a bearing pad could dislodge not once, but twice in Bangladesh, points unequivocally to a grave compromise in either its construction, its design, or more likely, the rigour of its oversight and maintenance. The suggestion from officials that \"corrective measures\" were taken after the first incident reveals that those measures were insufficient.\nThe government must immediately run an independent safety review of the entire 21-kilometre line, with its findings made public. Every vulnerable component, every weld, every bearing must be subjected to scrutiny. The death of Abul Kalam Azad is a terrible human cost and a direct result of supervisory failure. This tragedy must be the final warning that forces a reckoning with the integrity of a system upon which millions of lives now depend.\n",
        "headline_1": "Metro tragedy exposes fatal supervision failure",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/metro-tragedy-exposes-fatal-supervision-failure-4020491",
        "news_paper_name": "The Daily Star",
        "publish_date": "30-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 30, 2025 00:00:00  \nWith the South Asian Association for Regional Cooperation (SAARC) virtually becoming dead and buried, the compulsion for Bangladesh to join a trade and economic bloc was overriding. The urgency has been further heightened by the country's graduation from LDC (least developed country) status and the tumultuous impacts triggered globally by US President Donald Trump's reciprocal tariff. A better option is to gain access to the Regional Comprehensive Economic Partnership (RCEP), world's largest trade bloc. The Economic and Social Commission for Asia and the Pacific, a UN agency, in its working paper titled, 'Analysis Report: Bangladesh's Service Trade and RCEP Accession' has observed that \"RCEP accession, coupled with deep domestic reforms, is a strategic necessity for Bangladesh\". Last year Bangladesh also formally made its request for its inclusion in the 16-member world's largest free-trade alliance. Comprising 10 ASEAN countries including Malaysia, Singapore, Thailand and Vietnam, the trade bloc also boasts members as diverse as Japan, Australia, South Korea and New Zealand with China playing the role of the architect in its formation. \nThe ESCAP prescribes strategies Bangladesh needs to develop in order to facilitate its qualification for membership in the RCEP. Right now the country is way behind the criteria set for the bloc's membership. Liberalisation of various areas of economic and trade sector is the name of the game. On that count, it has to prioritise some selective areas aligning to or nearly compliant with the RCEP criteria. Travel, banking and ICT correspond to the need of the trade bloc. The ESCAP reports is categorical that 'a phased, learning-by-doing' approach' would be suitable for Bangladesh. Cambodia and Lao PDR have been enjoying delayed liberalisation. Trade diplomacy can earn Bangladesh similar concessions. So, Bangladesh has to focus on the selective sectors compliant or about to comply with the RCEP set criteria. \nNotwithstanding some advantages a few sectors enjoy to join the bandwagon, there is one particular area called the service sector that, according to the ESCAP, stands to benefit immensely from the proposed accession. The country exported services worth US$1.5 billion to RCEP members as against the import of services worth 3.61 billion in 2023. The modest growth of service exports by 8.2 billion could be far higher provided that Bangladesh adopted a policy of liberalisation and had obtained its membership in the bloc. Now Bangladesh is in negotiation with RCEP members separately for economic partnership agreement. This would be unnecessary had it done its homework well to have access to the bloc as a whole. \nAfter all, the bloc currently accounts for 28 per cent of the global GDP, 29 per cent of the world population and 25 per cent of the international trade in goods and services. Any agreement with a single member nation can never be as beneficial as the privileges a member enjoys. Starting its journey in 2020, the RCEP has demonstrated its strength and the future potential it holds. With all its limitations Bangladesh should make its choice for service sector liberalisation clear as early as possible. Service sectors need trained and especially skilled workforce. Unless the country fine-tunes its RCEP-ready sectors and prepare its human resources through reforms to the education system, it cannot be equal to the task. The demographic dividend needs to be explored with sincerity and seriousness.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "RCEP membership  for Bangladesh",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/rcep-membership-for-bangladesh-1761747746",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       October 30, 2025 00:00:00  \nRegular loss of lives under most unfortunate circumstances has become a part of the city dwellers' precarious existence in the bustling megacity of Dhaka. The tragic death of 35-year-old Abul Kalam Azad from the bearing pad of metro rail pier falling on his head in Farmgate area has once again brought to the fore the issue of fragility and uncertainty of human life in the capital.\nIn this bustling and teeming city of about 20 million, danger seems to lurk at every step, around every corner and in every direction. For Azad, death fell from the sky. For others, it waits beneath the ground as open manholes dot the city streets and footpaths in many areas. In June, a woman fell into an uncovered manhole in the Tongi area, and her body was recovered after an agonizing wait of 36 hours! Such incidents are not uncommon in Dhaka, although it is the port city of Chattogram that has gained notoriety for open manhole-related deaths, with at least 13 lives lost to this hazard.\nMeanwhile, the crash-landing of a fighter aircraft at Uttara Milestone School and College in July stands as another glaring example of a completely avoidable tragedy, which claimed the lives of 34 students and teachers. Then there are frequent instances of preventable deaths in factories that go up in flames while workers toil inside, often with gates locked. A recent such fire incident in Mirpur killed 16 workers. \nNot to mention the regular loss of lives and limbs under the wheels of runaway buses, auto-rickshaws, or garbage trucks due to reckless driving and blatant disregard for traffic rules. Even while simply crossing a road, no one knows when commuters might find themselves trapped between two competing buses. Such is the callous disregard for public safety that even a simple stroll on the street can sometimes prove tragic. Last year, a female official of Bangladesh Bank died after a brick chip fell on her head from a building in the Mouchak area. Before that, flyover girders came crashing down in Uttara, claiming four lives, including those of two children.\nEating out with loved ones is also fraught with danger, as one never knows when an eatery might turn into an inferno. All the while, the risk of falling prey to street criminals or being caught in the crossfire of political clashes looms like a shadow from which no one can escape. The sheer variety of ways in which life can be abruptly cut short raises a haunting question: is this a city, or a death trap?\nOwing to the poor state of governance reflected in all sectors, at all levels, many of these tragic incidents are not the result of human error or inescapable circumstance. Instead, they are caused by human neglect and gross omissions that almost border on contempt for safety rules. Thus, though such incidents are often passed off as accidents, they are, in fact, virtually invited. Social scientists and urban planners rightly observe that these are not mere accidents - they are murders by managerial failure.\nAfter such preventable deaths, it is customary for the authorities concerned to form a probe body. But those whose negligence allows these tragedies to befall the city's residents are rarely held accountable. Instead, the incidents are swept under the carpet with token compensation to the victims' families, while safety standards remain unchanged. As no one is punished and safety measures are not improved, one fatal mishap inevitably follows another, perpetuating a vicious cycle of neglect and impunity.\nSafety at workplaces and public spaces is not a matter of pity or benevolence towards citizens; it is their fundamental right. Every individual who steps out to earn a living, commute through the city, or simply take a walk on the street deserves the assurance of returning home safely. The relevant government agencies, city authorities, factory owners, and private business or property owners are all legally and morally bound to ensure this right in their respective areas. But when no one is held accountable for negligence that jeopardises public safety, and the responsible bodies can get away with offering only meagre compensation to victims, why would they bother giving adequate attention to ensuring public safety?\nSince the announcement of the Tk 5 lakh compensation package for the tragic death of Abul Kalam Azad under the Dhaka Metro Rail, one question has been doing the rounds on social media: is a human life so cheap? \nDeath or disability of workers has multidimensional implications on the economy and society. While the death or disability of workers seriously hampers production processes, absence of an earning member throws his/her family members in dire straits. The situation is particularly dire in Bangladesh as life insurance coverage is virtually non-existent. \nPutting a monetary value on a person's life may seem impossible. But after a wrongful death, such a grim financial calculation is crucial for two reasons. Firstly, to safeguard the financial and emotional needs of the surviving family- in Azad's case, his wife Irene Akhter Priya is left to raise their two young children alone. Secondly, a substantial compensation could serve as a deterrent, compelling concerned authorities to take public safety measures more seriously. The government can use various international matrices to prepare an adequate and fair compensation for the victims of every preventable tragedy.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Putting a price tag on life",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/putting-a-price-tag-on-life-1761747953",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 30, 2025 12:00:00  \nWorld Stroke Day, observed globally on October 29, carries the 2025 theme: \"Every Minute Counts.\" This highlights the vital importance of recognising stroke symptoms early and acting without delay. The FAST message-Face drooping, Arm weakness, Speech difficulty, and Time to call for emergency help-remains the simplest way for the public to identify warning signs.\nA stroke is a medical emergency caused by an interruption in blood flow to the brain. Brain cells begin dying within minutes, leading to paralysis, speech difficulty, and cognitive impairment. Ischemic strokes result from blocked blood vessels, often due to high blood pressure, cholesterol, diabetes, or smoking. Hemorrhagic strokes occur when a blood vessel bursts, frequently linked to uncontrolled hypertension, aneurysms, or head injury. Some strokes have unknown causes, known as cryptogenic strokes.\nTimely medical attention can save lives and prevent long-term disability. Diagnosis involves history-taking, clinical assessment, and imaging like CT or MRI scans. Ischemic strokes may be treated with clot-dissolving drugs or mechanical thrombectomy, while hemorrhagic strokes often require surgery to control bleeding. Rehabilitation-including physiotherapy, speech and occupational therapy, and psychological support-is crucial for restoring independence and quality of life. Neuroplasticity allows brain recovery even years after a stroke.\nPrevention is the most effective strategy. Healthy habits such as a balanced diet, regular exercise, routine screening for blood pressure and cholesterol, and avoidance of tobacco and excessive alcohol can significantly reduce risk. Public awareness campaigns and survivor support networks strengthen resilience and improve outcomes.\nFor Bangladesh, building a stroke-safe future demands collective commitment from citizens, health systems, and policymakers. Every second lost during a stroke is brain function lost forever. Awareness, prevention, and timely intervention are essential. Every minute counts, and every action matters.\nMd. Amir Hossain and\nMd. Abu Abdullah\nBoth are retired Additional Secretaries to the Government of Bangladesh\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Preventing stroke and disability",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/preventing-stroke-and-disability-1761747985",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 30, 2025 00:00:00  \nThe number of educated unemployed people in Bangladesh has doubled over the last eight years, according to the Bangladesh Bureau of Statistics (BBS). Alarmingly, the highest unemployment rate is among educated youth, with one in every three unemployed holding a bachelor's degree. The Bangladesh Labour Force Survey 2024 reports 26.24 lakh unemployed people, of whom 8.85 lakh have a bachelor's degree-an indication of a growing social and economic concern.\nSeveral factors contribute to this rising unemployment: rapid population growth, lack of coordination in the job market, increased competition, limited expansion of cottage and small-scale industries, and underdeveloped agricultural sectors. Immediate and strategic steps are necessary to address this challenge.\nOne effective approach is to integrate compulsory vocational and technical education alongside formal education. This would not only equip youth with practical skills but also create new employment opportunities. Subject-based education can help balance competition in the job market, while investment in infrastructure-such as canal digging, road construction, and dam projects-can generate jobs, particularly in rural areas.\nBangladesh's large population can be transformed into a productive workforce if proper training, skill development, and employment strategies are implemented. Technical education is not just a tool for personal development; it is a national strategy to reduce unemployment, enhance economic growth, and strengthen the country's human capital.\nShah Muntacher Hossain Mihan\nStudent, Department of Social Work\nNoakhali Science and Technology University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Tackling unemployment through technical education",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/tackling-unemployment-through-technical-education-1761748040",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-10-2025"
    }
]