[
    {
        "full_article": "More than two weeks have passed since 41 people died after a crowd crush at a political rally of actor-politician Vijay and his party, the Tamilaga Vettri Kazhagam (TVK) in Karur. Yet, far from establishing culpability, the judicial response risks prioritising political narrative over factual inquiry. On October 13, 2025, the Supreme Court of India’s intervention, transferring the investigation to the Central Bureau of Investigation (CBI) and appointing a supervisory committee, was ostensibly meant to restore order after procedural disarray at the Madras High Court. The Court’s move seems to have arisen because of the sharp remarks, perhaps unwarranted, by a single judge at the Madras High Court about Mr. Vijay and the TVK, neither of whom was a party in a case about rally protocols that did not directly concern the Karur incident (which fell under the Madurai Bench’s jurisdiction). But the Court has created new problems. It has granted the petitioners’ demands for a CBI investigation and judicial supervision as “interim relief”, yet the measures are irreversible. Once the CBI files a charge sheet, there can be no reversion to State police investigation. The Court’s rationale for the CBI transfer is equally problematic. It cites press conferences by senior State officials as attempts to exonerate subordinates, casting a doubt on investigative impartiality. But this amounts to a gag order on public officials. After the incident, Mr. Vijay and his supporters alleged conspiracy. Should State officials refrain from responding to grave allegations amplified across social media merely to appear neutral? Presenting factual evidence, including footage, should not automatically prejudice an investigation. This is too flimsy a ground for a transfer of the case to the CBI, once described by the Court as a caged parrot of the Centre. Ironically, the Court cited State of West Bengal and Ors. vs The Committee for Protection of Democratic Rights, West Bengal and Ors. (2010), which warns against ordering CBI investigations “as a matter of routine or merely because a party has levelled some allegations against the local police”, undermining its own reasoning.The order devotes considerable attention to police “inaction” and crowd management failures but makes no mention of the TVK’s or leaders’ responsibilities in organising the rally. The Court may be seen as pre-judging who was at fault. It notes that the TVK was not made a party in the High Court proceedings, yet does not consider what this could mean for a balanced inquiry. Following the interim order, it is unclear what remains to be adjudicated at the final stage. It remains to be seen how the Court will address allegations that one petitioner was unaware of the petition filed in his name, and that another litigant, who abandoned his family years ago, is not a ‘real’ representative of a child victim. Justice requires affixing clear responsibility to deter chaos, not proceedings that muddy accountability. Published - October 15, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        politics\n                    \n                            /                      \n                        \n                        accident (general)\n                    \n                            /                      \n                        \n                        Tamilaga Vettri Kazhagam\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        investigation\n                    \n                            /                      \n                        \n                        police",
        "headline_1": "Flawed order: On the transfer of the Karur stampede case to the CBI",
        "headline_2": "The transfer of the Karur case to the Central Bureau of Investigation raises troubling questions",
        "link": "https://www.thehindu.com/opinion/editorial/flawed-order-on-the-transfer-of-the-karur-case-to-the-cbi/article70163617.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "15-10-2025"
    },
    {
        "full_article": "The September 2025 retail inflation data, at a 99-month low of 1.54%, has important policy implications for the RBI in particular. Except for August, retail inflation has slowed in every month this financial year. The average rate of inflation for the first half of the fiscal is 2.2%, just within the RBI’s comfort band of 2%-6%. When inflation was at the higher end of this band, the RBI had repeatedly said that its target was 4%, and that it would not rest until inflation was at that level. There is an argument to be made for the central bank to strive for that same target now that inflation is repeatedly coming in below that mark. Consistently low inflation means that supply is comfortably outstripping demand. Inflation in the clothing and footwear category, for example, was at 2.3% in September 2025, and has been falling pretty consistently for the last two years. This is not a good place to be in, especially now. Faced with the same oversupply problem, albeit at a much larger scale, China is increasingly depending on demand from abroad to absorb its supply. This has not exactly been India’s forte historically, and the current tariff tensions affect exports. The government has tried to stimulate domestic demand through income-tax and GST rate reductions. Households have been using the direct tax rebate to bolster their savings and reduce debt rather than increase consumption. GST rate cuts also led to only a temporary spurt in purchases.What is needed is a sustained increase in real wages, and for that the private sector needs to step up. It is good news that private sector investment announcements grew strongly in the first half of this year, but those need to translate into real projects on the ground soon. One way that the RBI can help is to cut interest rates significantly in the next Monetary Policy Committee meeting in December. With inflation so low and private investment needing a boost, it is better to err on the side of accommodation than conservatism. The other policy issue the RBI needs to deal with is the inaccuracy of its forecasts. In April, it had predicted that inflation for the year would be 4%. Later, it consistently revised this forecast, arriving at 2.6% at the latest meeting in end-September. While factors influencing inflation are dynamic, such a drastic revision of the forecast in just six months shows that something is wrong with the RBI’s estimation process. Since a key aspect of its work is with inflation prediction, this is a deficiency that it should address quickly.\r Published - October 15, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        inflation and deflation\n                    \n                            /                      \n                        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        textile and clothing\n                    \n                            /                      \n                        \n                        footwear\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        investments",
        "headline_1": "Inflation lessons: On the inflation data and the RBI",
        "headline_2": "The Reserve Bank of India will have to be more accurate in its predictions",
        "link": "https://www.thehindu.com/opinion/editorial/inflation-lessons-on-the-inflation-data-and-the-rbi/article70163069.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "15-10-2025"
    },
    {
        "full_article": "EC must allow states their own timelines for SIR. Time is of essence for robust voter rolls \nWill EC heed Maharashtra election commission’s request to defer the re-doing of state electoral rolls till local polls – long delayed – are over after Jan 2026? When EC announced a special intensive revision (SIR) of electoral rolls end-June for Bihar, heading into state polls in Nov as scheduled, the exercise was destined to be a rushed and confusing affair. And it was, abundantly. Had EC announced the exercise for Maharashtra instead at the time, the state election commission (SEC) would have had enough months on hand for the exercise before local polls. Its state elections had concluded months ago. Since polls to urban local bodies and panchayats have separate electoral rolls under sole jurisdiction of SECs, there would be no confusion. Voters and administration would have time to upload documents, weed out extras, de-duplicate, spot problem additions and troubling deletions. To ensure healthy and fair participation and trust of a resident population in a robust electoral cycle needs time.\nThe final voter rolls per EC in Bihar, have left much to be desired. With elections upon them, no political party, no matter its reach, is in any position let alone mood to wade into nitty-gritties of who got unfairly left out or added. The case, anyhow, is in Supreme Court. What is of concern at this point is what timelines will EC allow all other states? At their convenience? No two states are similar when it comes to an exercise tech-driven, document-heavy for diverse demographics and all manner of geographies. An SIR would really be efficient only after Census, even delimitation. There is much EC desires via SIR that Census will answer – rural-urban divide for one. Question whether it is for EC to decide on citizenship is also in Supreme Court. Until that is settled, the matter of nationwide electoral rolls needing urgent revision is, for all practical purposes, moot.\n\n",
        "headline_1": "Letter From Maha",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/letter-from-maha/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-10-2025"
    },
    {
        "full_article": "Why America’s prez is a godsend for India’s humorists  \nTwo Indian humorists, Gup and Shup, discussing their career prospects. \nGup: Three cheers for Donald Trumpji! Thanks to him you and I still have our jobs. \nShup: And not just us. All humorists would have been made jobless because they stepped on someone or the others’ sensitive toes. \nGup: And there are no end of sensitive toes waiting to be stepped on. There are religious sensitive toes, and political sensitive toes, and cultural sensitive toes, and dietary sensitive toes, and linguistic sensitive… \nShup: You don’t have to keep toeing the line. We all know about all those toes we couldn’t step on without fear of being slapped with slander charges, or just plain slapped and beaten up. With the result that the whole jingbang lot of us would have joined the ranks of the unemployed. Then our saviour came in the form of Trumpji who became the perfect butt of all our toe-stepping-on humour. And now I’m not only not in danger of being sacked, but my boss says he’s going to give me a raise! \nGup: Indeed, making Trumpji the butt of humour has become a cottage industry with do-it-yourself humorists generating more self-employment than the PM’s Rozgar Yojana scheme. \nShup: Too true. My nephew-in-law’s cousin brother has become a stand-up comic like Vir Das, thanks to Trumpji. And he doesn’t even have to make up any jokes about him; he just repeats what Trumpji says word for word, and weird for weird, and the audience is rolling in the aisles. After all, you can’t out-joke a joker and Trumpji is the biggest joker of all, with he himself being the biggest butt of his own jokes. \nGup: But what will we do when Trumpji’s term is over and he has to step down? Will he do a hat trick and go for a third term? \nShup: He might well do so. But if he doesn’t, his replacement will be as perfect a butt for us as he has shown well in ad-Vance…\n\n",
        "headline_1": "Thank You Trumpji",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/thank-you-trumpji/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-10-2025"
    },
    {
        "full_article": "Google’s India AI hub is great news. Governing AI to India’s advantage is another matter \nNot all infra is equal. Google’s Visakhapatnam AI hub, to be built with $15bn over the next five years and with the Adani group, will be its largest artificial intelligence data centre outside America. This reflects the power of the Indian market – and its massive embrace of AI. As Sam Altman said recently, if there is one large society in the world that seems most enthusiastic to transform with AI right now, it’s India. But if this is an assertion of control over the physical backbone of AI in a region of high strategic growth potential for Google, what is it for India? With such infra, India can improve data sovereignty, become a stronger player in AI, and have more say in how AI is deployed. This is invaluable as AI firms look set to have gatekeeper power over humanity’s future.\nGoogle’s announcement comes on the heels of Mokyr-Aghion-Howitt winning the Economics Nobel.  They spotlight how technological innovation has been the engine of modern prosperity, but also how this economic growth is neither natural nor guaranteed. Yes, AI will determine the future. But what that will look like will depend on who controls the physical and digital infra of AI, who gets to set the terms (pricing, access, regulation), and how the benefits – and risks – of AI are distributed. New entrants and disruptive models will only be able to displace giant, monopolistic incumbents to the extent they can actually compete with these. Google building a large AI hub in India shows the country jockeying for a happy place in the AI-driven global economy. Getting there will need a lot of other birds flying in sync. So far, Indian companies have mostly been doing only peripheral servicing, which is quite worrying.\nAlso seen in the Nobel spotlight is a larger AI control problem. AI hallucinates, AI greasily defies safety controls, yet we are now in a loop where AIs are building the next AIs. As this technology expands control over lives everyday, perhaps the world has never been in greater need of a shared trust architecture. But finding one feels impossible. Washington and Beijing agreeing to a common ethics framework is now no less science-fictional than the Terminator films. Innovation has always been a double-edged sword. Until now it has served humankind well. Thanks to it, there are more than 8bn of homo sapiens on Earth now. The great known unknown is whether AI will cut us to size. \n\n",
        "headline_1": "Can’t Tech It Easy",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/cant-tech-it-easy/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-10-2025"
    },
    {
        "full_article": "The three laureates did their work pre-AI. But their research showed how important rules are for humanity to gain from massive tech disruption. But is the madness of this tech without a method?\nDiverse geography, turbulent history, and disparate cultures separated them. But somewhere along the way, an unstated, sometimes less appreciated, element overlapped between the two great stories. The Protestant ethics of thrift, hard work, and disciplines may have laid the Western foundations of capitalism\nRead full story on TOI+ \n\n",
        "headline_1": "Eco Nobel & CreAItive destruction",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/eco-nobel-creaitive-destruction/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 15, 2025 00:00:00  \nIn this data-driven digital age, the challenge of safeguarding personal information from unauthorized access and use is daunting. Reports of data breach leading to loss of sensitive data on financial transactions, medical history, biometric information, to name but a few, abound. Against this backdrop of various digital challenges to the citizens' data privacy, the interim government, in a bold move, has approved the drafts of Personal Data Protection Ordinance, 2025 and the National Data Governance Ordinance, 2025.\nThe interim government's Council of Advisers at a meeting on Thursday last unanimously approved the nation's first comprehensive legislation to safeguard restricted and confidential personal data making local and foreign media platforms and tech companies compliant with the national law. This is undoubtedly a decision long time coming by the interim government. Notably, the National Data Protection Ordinance will operate under the oversight of a data management authority. To that end, the advisory council did pass the Data Governance Ordinance. While the data protection law aims to ensure confidentiality, security and unlawful use of the citizens' personal data, concerns have been expressed by the Transparency International, Bangladesh (TIB), over what it said 'hasty approval' of the two ordinances 'without adequate expert consultation and stakeholders' engagement. Especially, the TIB pointed to the fact that the draft of the data protection law had been going through a prolonged phase of contention between the stakeholders and the former authoritarian government before its fall. The TIB further complained that the interim government through passing the two ordinances on personal data protection has ignored stakeholders' recommendations on critical weaknesses and risks in the drafts and that it 'secretly approved the latest drafts unilaterally without informing stakeholders'. These are no doubt serious allegations by the corruption watchdog against the very intention and spirit of the personal data protection and governance ordinances.\nHowever, the CA's special assistant rejected the TIB's claim, asserting that extensive consultations have been arranged with local as well as international stakeholders including the technology companies, namely, Meta, Google and representatives from the business community. Of course, the issue of exercising legal control over the handling of restricted and confidential personal data by the social media and tech companies, both of local and international origin, is a matter of serious concern for governments across the world. So, there is no question, as demanded by certain quarters, of delaying the passage of the laws to protect the individual citizen's privacy and the data concerned under any pretext. \nEven so, regarding the 'loopholes' as alleged by the TIB that certain section and subsections of the data protection ordinance contain and might create scope to exempt data controllers and processors from their duties and responsibilities, the government would be required to look into those alleged lacunae, if any, and try to address those at the earliest. Also, the fear that the exemptions under the ordinance would allow the data protection authority broad access to personal data in the name of 'crime prevention' should be duly allayed. To ensure that those sections of the ordinance, as alleged, might not turn into 'tools of control and surveillance', by any government in the future, the authorities would do well to clarify.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Law to ensure data security, privacy of citizens",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/law-to-ensure-data-security-privacy-of-citizens-1760452057",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       October 15, 2025 00:00:00  \nCottage, Micro, Small and Medium Enterprises (CMSMEs) are often described as the backbone of Bangladesh's economy. They account for nearly 85 per cent of the country's industrial base, employ around 11.8 million people and contribute close to 28 per cent of GDP. Yet, despite their importance, CMSMEs remain far from realising their full potential.\nAt a recent discussion organised by the Dhaka Chamber of Commerce and Industry (DCCI) on \"Branding and Marketing Challenges for CMSMEs: Unlocking Export Potential,\" industry leaders reiterated the pressing challenges holding the sector back. Limited access to finance, inadequate infrastructure, shortage of skilled manpower, insufficient policy support, and stringent loan conditions remain the primary bottlenecks. Added to this are restricted access to local and global markets and the slow adoption of new technologies. These constraints have resulted in a paradox: while CMSMEs employ nearly 85 per cent of Bangladesh's industrial workforce, their contribution to GDP remains stagnant.\nOne of the most persistent challenges for CMSMEs is their restricted access to finance. Although the government has rolled out refinancing schemes, credit guarantees and stimulus packages, the reach has been far from satisfactory. Disbursement has often fallen short of announced targets. Moreover, stringent collateral requirements by banks and the absence of a comprehensive CMSME database make it difficult for many small entrepreneurs to qualify for institutional loans. This financing gap discourages new ventures and limits existing ones from scaling up or investing in innovation.\nMarket access is another formidable obstacle. Too many entrepreneurs continue to rely on outdated promotional methods, while neglecting digital tools that could significantly expand their reach. The lack of professional branding, modern packaging and adequate advertising budgets further weakens their visibility in both domestic and international markets. As a result, many businesses fail to identify or connect with their target customers. This disconnect partly explains why a large number of startups fail to survive beyond the first two years of operation.\nInstitutional support structures also remain underdeveloped. While the SME Foundation organises trade fairs and facilitates participation in international exhibitions, these initiatives are piecemeal and cannot substitute for systematic training in business fundamentals. Entrepreneurs often lack knowledge of branding, pricing strategies, consumer behaviour and customer engagement-skills that are vital in competitive markets. \nThe policy architecture for CMSMEs reflects both ambition and inconsistency. While official documents underscore the importance of the sector, implementation is often weak. For example, the stimulus packages designed during the pandemic promised substantial relief but actual disbursement fell far short of expectations. Similarly, while cluster development and backward linkage industries are frequently cited as policy goals, little progress has been made in integrating CMSMEs into global value chains.\nThe Competition Commission, mandated to ensure fair competition, has remained largely inactive in addressing the dominance of large enterprises. This leaves smaller businesses at a disadvantage, often unable to compete on equal terms. Without effective enforcement of the Competition Law 2012, CMSMEs are left vulnerable to market distortions, where powerful players can dictate terms of trade.\nThis policy-execution gap also explains why Bangladesh's CMSME contribution to GDP remains stagnant while neighbouring countries have seen significant growth. Vietnam, for example, has aggressively pursued cluster-based strategies, integrating small enterprises into export-oriented production networks. The result has been a steady rise in SME competitiveness and global market share.\nDespite these persistent challenges, the CMSME sector holds enormous potential to drive inclusive development. Besides a large number of industrial workforce employed in this sector, women now represent 6.47 per cent of SME entrepreneurs, and expanding opportunities for them can create a multiplier effect in poverty reduction and gender equity. Strengthening CMSMEs would therefore not only bolster industrial diversification but also support social inclusion by creating jobs in rural and semi-urban areas where formal employment opportunities are scarce.\n\nThe sector's promise is also tied to Bangladesh's broader economic transition. As global trade becomes increasingly competitive and as tariffs on Bangladeshi exports-particularly from the US-create new pressures, CMSMEs could provide the resilience and diversification needed to sustain growth. \nBangladesh's CMSME sector finds itself at a critical juncture. On the one hand, it remains the backbone of employment and industrial activity, providing livelihoods to millions. On the other, its persistent structural weaknesses limit market connectivity, and policy gaps prevent it from fulfilling its potential. Unless these challenges are addressed, the sector will remain fragile with high rates of early business failure undermining long-term growth.\nYet, the promise is undeniable. With the right mix of financial inclusion, policy reform, institutional support and market integration, CMSMEs could emerge as the cornerstone of inclusive and sustainable growth. The challenge before policymakers and industry stakeholders is not just to recognise this potential but to translate it into a coherent strategy that allows small enterprises to thrive. Doing so would not only unlock stalled potential but also ensure that Bangladesh's growth story is broad-based, resilient and inclusive.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Unlocking the stalled  potential of CMSMEs",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/unlocking-the-stalled-potential-of-cmsmes-1760452144",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 15, 2025 00:00:00  \n\nThe state of the banking sector in Bangladesh is not good. This is not a topic for gossip in tea stalls; rather, it is a serious issue that requires research to understand how the economy has been gradually weakening due to non-performing loans (NPLs) in the banking sector. Therefore, it is completely misleading to judge the condition of the country's economy based on the current government's performance and to claim that the previous situation was better.\nThe breakdown of laws and regulations, as well as weaknesses in socio-economic foundations, has caused a major crisis in the country.\nRegarding the fragile foundations of the banking system, the Advisors Committee recently approved the merger of five banks: First Security Islami Bank, Global Islami Bank, Social Islami Bank, Union Bank, and Exim Bank. These will be combined into a new entity named United Islami Bank, with an authorised capital of Tk 40,000 crore and a paid-up capital of Tk 35,000 crore. This initiative aims to rescue these banks from collapse through proper funding and management.\nThe Bangladesh Bank has already decided to appoint administrators to monitor the condition of the newly proposed bank.\nAlthough the bank will be \"new\" after merging, it will inherit the existing challenges of the previous banks. Recovering the huge defaulted loans is critical, regardless of the bank's new name. Moreover, customer trust in the banking system has been significantly eroded, and rebuilding this trust while ensuring smooth withdrawal mechanisms will be a serious challenge.\nThe profitability of the bank will largely depend on the disbursement of new loans, which may be difficult for the newly formed bank for several years due to the high NPL ratio. Collecting new deposits and public shares will also be a significant challenge. So, despite the merger, the crisis is not fully resolved. \nKawsik Azad Pronoy\nAssistant Vice President \nDutch Bangla Bank PLC.\nCorporate Business Division,\nDhaka North Cluster\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Will the merger heal ailing banks?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/will-the-merger-heal-ailing-banks-1760452169",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 15, 2025 00:00:00  \n\nLand in Bangladesh is more than just property - it represents social status, economic autonomy and a pathway out of poverty. Yet, women remain largely absent from the country's land registers. Recent reports show that few women are landowners, leaving them financially vulnerable, dependent and often excluded from agricultural decision-making.\nAlthough existing laws allow women to inherit property and be co-holders on khatian, customary practices still determine most outcomes. Patriarchal norms, social pressure, and informal village arbitration often deprive widows and daughters of their lawful entitlements. Even when deeds exist, many women fail to complete mutation - the final step in recording ownership - rendering their rights ineffective in practice.\nWhile 2025 has seen renewed discussions on inheritance reform and gender-responsive land policy, resistance from conservative groups has made political consensus fragile. Legal reform alone cannot change ground realities without social acceptance and enforcement.\nDigital land services such as e-mutation, e-khatian, and the Land Service Gateway offer a new opportunity to strengthen women's ownership rights. Properly implemented, digitisation can reduce reliance on intermediaries and make ownership records transparent. However, without inclusive design such as ensuring women's access to ID, mobile connectivity and digital literacy, technology risks perpetuating the same exclusions.\nBridging this gap requires three steps: legal reform to clarify spousal and joint rights; community-level awareness and paralegal support and inclusive digital rollout with offline assistance and regular audits.\nOnly through these measures can land become a tool of empowerment rather than inequality for women in Bangladesh. The time to act is now - before another generation inherits the same injustice.\nSamiul Al Nafi \nStudent of law \nBangladesh University of Professionals\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Women and land rights",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/women-and-land-rights-1760452181",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-10-2025"
    }
]