[
    {
        "full_article": "Barely a week after the remains of nine coal miners were recovered at the end of a 44-day operation, from a coal mine that had flooded in Assam in early January, a disaster of similar contours, this time in Nagarkurnool, Telangana, is in the making. A portion of the Srisailam Left Bank Canal tunnel, which is under construction, collapsed on February 22, 2025 leaving eight workers trapped. What is known so far is that a three-metre section of the roof collapsed due to water seepage. The roof collapse eventually led to the tunnel crumbling over a stretch of eight metres. Despite nine specialised rescue teams, drawn from the Centre and the State governments, working round-the-clock, no significant progress has been made so far on ascertaining the condition of the workers and in devising an optimal rescue plan. So far, the playbook that is being experimented with seems to be inspired by the successful rescue work in the Silkyara Tunnel collapse in Uttarkashi, Uttarakhand, in November 2023, where a portion of the four -kilometre-long tunnel that was being constructed collapsed, stranding 41 workers. It took a 16-day operation that started out with a variety of approaches, including drilling horizontally, and later on vertically, from both ends of the tunnel to reach the stranded workers. In the end, key breakthroughs were achieved by a team of ‘rat hole’ miners from Assam, who use manual excavation methods that are considered hazardous and deemed illegal.The key difference between the Silkyara episode and the one in Srisailam is the presence of water. There were 70 workers in the tunnel when a deluge of water and muck suddenly began to gush inside. Barring the eight, the rest escaped, with 13 of them sustaining injuries. However, in the subsequent days, it is the torrential flow that has proved to be a barrier to rescue operations. The history of tunnel-linked disasters globally shows that while rare, they can often be catastrophic. A large proportion of these accidents, studies show, are due to a rupture in aquifers (underground water channels). It is to determine such risks that extensive studies are commissioned to understand the sub-surface geology of a site. A report by the Uttarakhand disaster management authority on the Silkyara episode says that there was insufficient analysis of the rock formations at Silkyara but also that a complete picture of structural deformities cannot be known before tunnelling. While the rescue of the trapped personnel at the Srisailam tunnel is paramount, there has to be a proper investigation by the authorities on the reasons for the collapse and action taken, if evidence emerges of tardy pre-tunnelling analysis.\r Published - February 27, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        mining\n                    \n                            /                      \n                        \n                        Assam\n                    \n                            /                      \n                        \n                        disaster management\n                    \n                            /                      \n                        \n                        Telangana\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        water\n                    \n                            /                      \n                        \n                        geology\n                    \n                            /                      \n                        \n                        science (general)\n                    \n                            /                      \n                        \n                        disaster and accident",
        "headline_1": "Water blight: On the Srisailam tunnel cave-in",
        "headline_2": "Scientific risk assessment prior to undertaking tunnel work is a must",
        "link": "https://www.thehindu.com/opinion/editorial/water-blight-on-the-srisailam-tunnel-cave-in/article69266725.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-02-2025"
    },
    {
        "full_article": "The adage that ‘the wheels of justice grind slowly, but grind exceedingly fine’ may be true, but there are times when punishment for crimes comes so late that it is hardly recognisable as justice. The patience of a family’s long wait for justice may have been rewarded this week, when Congress leader Sajjan Kumar was sentenced to life imprisonment for the killing of a 50-year-old man and his 18-year-old son by a frenzied mob during the anti-Sikh pogrom in Delhi in 1984, but no justice system ought to be proud of a verdict that comes 40 years after the crime. This is the second case in which Mr. Kumar, then a Congress Member of Parliament, has been found guilty of leading a mob. In 2021, the Delhi High Court reversed a trial court judgment acquitting him of overseeing the killing of five people in the same locality, Raj Nagar, and sentenced him to imprisonment for the rest of his life. His involvement in leading the riotous mob was known to many, witnessed by some, but covered up by all those who mattered. The police had initially failed to carry out any genuine investigation, registered omnibus first information reports for many separate incidents, discouraged complainants and witnesses from naming or describing the assailants, and only recorded the loss of property and belongings looted by the mobs that ransacked houses before burning them.However, public outcry, political activism and the change of regime over the years have ensured that there were mechanisms from time to time to reopen closed probes and record testimony: the Justice Ranganath Misra Commission, the Justice Nanavati Commission and the Jain-Aggarwal Committee. Affidavits filed before these panels, purported contradictions in them, and the question of whether these disclosures were made at the earliest opportunity, have all been exploited by defence lawyers to delay trials over the years; but a few have made it to the very end. These outcomes kept a sliver of hope alive for at least a few victims, the latest being the three women who witnessed Jaswant Singh and his son Tarundeep being beaten and burnt before their eyes. It is a fact that fixing criminal liability in mob violence is extremely difficult, but the lesson is that the problem of finding credible witnesses should not be compounded by manipulated investigations. Even in this case, the last word has not been said as Mr. Kumar may question the finding of his guilt in appeal. A belated conviction may be seen as proof that the efflux of time need not be an impediment to justice. Or, one may wonder if it is inevitable that influential people can evade the law long enough so that they have a full and untrammelled political career before their role is proved.\r Published - February 27, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        crime, law and justice\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        riots\n                    \n                            /                      \n                        \n                        sikhism\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        prison\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        investigation",
        "headline_1": "Slow, unsteady: On the Sajjan Kumar case and the 1984 riots",
        "headline_2": "Influential criminals should not be allowed to evade justice indefinitely",
        "link": "https://www.thehindu.com/opinion/editorial/slow-unsteady-on-the-sajjan-kumar-case-and-the-1984-riots/article69266743.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-02-2025"
    },
    {
        "full_article": "What India can learn from Trump’s idea of fast-tracking US citizenship for a $5mn fee\nGreen card – you know and envy those who have it. Enter gold card. You’ll envy these cardholders even more. It’s the latest Trump idea. But this one’s not kooky. Gold cards will give “very high-level people” – a very Trump term – a new route to citizenship in exchange for about $5mn. Quizzed on whether it would slide in shifty people, the prez said he knows some Russian oligarchs who are nice people. Hmmm…But let’s not prejudge. Let the background checkers do their job, and let the very rich keen on American passports, do their math. Trump expects to sell maybe 10mn of these cards, maybe more. The ching-ching of that many cards sold may twin the anthemic zest of a Miley Cyrus hit, chorus line: Yeah, it’s a party in the USA/Yeah, it’s a party in the USA.\nMore prosaically, there’s a pre-existing EB-5 scheme, which the gold card will supplant, and which laid out the red carpet for immigrants making investments upwards of $800,000. In his first term, critics said businesses connected to Trump and his family benefited unfairly from this scheme. Be that as it may or may not, the new administration sees EB-5 as full of nonsense and fraud. Critics’ grouse now is that the $5mn scheme will put US in the company of Malta, Vanuatu, Grenada and the like, other countries that have been dishing out golden passports for years. But this is very poor punditry. Obviously, none of these other passports have anything like the pull of an American one. And some other rich countries offer buy-a-passport schemes too.\nActually, this is an idea for India to also consider. Of course, the $5mn fee would need to be sharply reduced. But that done, wouldn’t there be wealthy Bangladeshis or perhaps Sri Lankans eager to buy a fast-track to Indian citizenship? For rich Afghans, in particular, it could truly be a golden escape.\n\n",
        "headline_1": "Hi, Gold. Bye, Green",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/hi-gold-bye-green/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-02-2025"
    },
    {
        "full_article": "Plane speaking after mantri agony\nIt was farmer minister’s turn to protest. Agriculture mantri came a cropper, or rather Air India did after unwisely allotting him a ‘broken and sunken’ seat on Bhopal-Delhi flight AI 436. Perhaps its numbers adding up to 13 had something to do with the eightfold path to ignominy. Less-exalted passengers squirm and bear it, perchance complain on X; Shivraj Singh did so too on his Chouhan-dle. But in his case it did not end there. A sudden rise in cabin pressure followed.\nOne, Tatas issued a personal and public apology.\nTwo, aviation minister spoke to DGCA.\nThree, latter sought report from AI.\nFour, faulty seat was specially galling since MP strongman had boarded from own former capital.\nFive, cabin crew had cautioned against allotting it.\nSix, adding insubordination to insult and anatomical injury, in 2022, DGCA had directed AI not to sell unserviceable seats.\nSeven, plane was just a year old. Its geriatric fleet was major cause of our once-vaunted international carrier’s nose-dive. But renewal had begun after its renewed Tata ownership.\nEight, ex-minister Rajeev Chandrasekhar gratuitously sprang to the attack on springless seat with his own X post, ‘If it was anyone else other than the polite, gentleman minister @ChouhanShivraj ji, person would have created a justified angry response to this kind of incident.’\nSo here’s my two-bit. Honourable mantriji could afford soft voice; others will pucca carry big stick. But, ‘polite gentlemanly’ responses aren’t the norm. There’s a planeload of instances of ruckus made by this twice-born breed if it gets less-than-obsequious treatment.\nIn cabin crew terminology, they ‘do not refrain from standing up till’ they have managed to bring regular business ‘to a complete halt’. In their own ministerial flight path, they want to ‘fasten their seat-belts tightly’. And when unfastened from seat of power, they find it extremely difficult to ‘observe the No Fuming sign’.\n***\nAlec Smart said: “Don’t turn USAID into USFADE. It’s served more poor than polls.”\n\n",
        "headline_1": "Hard landing",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/hard-landing/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-02-2025"
    },
    {
        "full_article": "More courts find against govts & for foreign firms, better it’s for India’s reputation as biz destination\nIn 2015, Narayana Murthy said Infosys had never made a profit on a govt contract. Thanks to red tape, one-sided contracts and shifting goalposts, at least 1L cr in private contractors’ payments was held up at that time. Tuesday’s Bombay HC decision in the Systra case shows things haven’t changed much. MMRDA, the Maharashtra govt agency that plans and manages infra around Mumbai, had contracted French infra consultant Systra for metro work. Last month, the agency terminated Systra’s contract without assigning reasons. HC, however, set aside MMRDA’s order as arbitrary and unfair. It made it clear that the agency does not have a licence “to act unfairly, arbitrarily or unreasonably”.\nIt’s a timely signal to all govt bodies to honour their contracts in letter and spirit. In World Bank’s now-discontinued ‘Doing Business’ reports, India’s poor rank was partly due to the difficulty of enforcing contracts, both govt and private. But govt’s record is especially problematic. It does not inspire confidence among foreign contractors, and leads to higher costs because contractors inflate rates anticipating objections and delays. For now, HC’s decision will instil confidence in foreign partners. But govts will have to consistently show they consider contracts sacrosanct. Remember, every time courts find against govts and for foreign businesses, India’s reputation as a good country for business will improve. If govts, especially GOI, act smartly, they wouldn’t reflexively challenge such decisions. Over the medium term, this is one of the few competitive advantages India can have over China, where it’s impossible for any court to find against govt in any matter.\nThe case is also important because Systra has accused MMRDA of corruption, and claims it was punished for resisting. The agency’s budget is 40,000cr-plus. So, speedy, fair investigation is in order. Especially when other global infra consultants are watching. India needs much foreign collaboration. Namo Bharat trains on Delhi’s showpiece RRTS suburban link are designed by French giant Alstom, and a subsidiary of Germany’s Deutsche Bahn operates the corridor. Western firms are easily put off by the stench of corruption, and India can lose the perception battle. The latest Corruption Perceptions Index places it at 96th position out of 180 countries, where it is tied with Gambia and Maldives. Although no paragon itself, China is 76th. But in 1995, when Transparency International launched the index, India was 35th out of 59 countries, ahead of China in 40th position. That’s a statistic really worth considering.\n\n",
        "headline_1": "Artha Systra",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/artha-systra/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-02-2025"
    },
    {
        "full_article": "State elections to Bihar’s 243-seat assembly are many months away. But for all purposes, campaigning is well underway. Modi’s Bhagalpur visit and largesse announced is as strong a sign as any that after Haryana, Maharashtra and Delhi, Bihar is on NDA and INDIA’s radar.\nRead full story on TOI+\n\n",
        "headline_1": "Bihar 2025: Old game, new rules",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/bihar-2025-old-game-new-rules/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-02-2025"
    },
    {
        "full_article": "Disclaimer: This article is for informational purposes only and does not endorse or condone any form of abuse or exploitation.\nIn a packed room at Bookworm Bangladesh on January 11, 2025, an unusual literary discussion unfolded, marking a significant shift in Bangladesh's conservative literary landscape. The event, \"Trigger Warning: Dark Romance\", organised by Sister Library in collaboration with Bookworm Bangladesh and Star Books and Literature, brought together diverse voices to explore the emerging world of dark romance literature.\nWhile the panel—featuring dark romance author Shanjida Nushrath Ali; Dr Nazia Manzoor, Editor of Star Books and Literature and Chair of the Department of English and Modern Languages, NSU; Dr. Kaiser Huq, academic, translator, and poet; and literary critic Shahriar Shaams—explored various aspects of the genre, one particular element stood out: the transformation of traditional arranged marriage narratives in contemporary dark romance.\nUnlike traditional romance, dark romance delves into themes of obsession, coercion, and psychological danger, often blurring the lines of consent and exploring morally ambiguous characters. Erotica, on the other hand, centers on intimacy and desire. While it may share elements with erotica's focus on intimacy and desire, dark romance distinguishes itself through its complex narrative structures and moral ambiguity. This evolution in romantic fiction is finding a growing audience in Bangladesh, as noted by Bookworm's owner, Amina Rahman, during the event. This growing appetite signals a shift in reader preferences, with many seeking narratives that push boundaries.\n\nThe arranged marriage trope in dark romance frequently serves as a clash between traditional values and contemporary desires. Traditionally perceived as a means of securing familial alliances, arranged marriage takes on a different dimension in dark romance—becoming a battleground for power struggles, forbidden desires, and intense emotional conflict. This tension resonates strongly in South Asian contexts, where marriage is often seen as a duty rather than a personal choice.\nIn this evolving landscape, authors like Shanjida Nushrath Ali are pushing the limits of mainstream fiction by introducing bold themes previously unexplored. Except for a handful of examples like Humayun Azad's Pak Sar Jamin Sad Bad (Agamee Prakashani, 2004), which actually somewhat had dark romance and erotic elements, historically, Bangladeshi eroticism has existed largely in the underground choti genre—short, mostly explicit fiction often circulated informally. However, unlike choti, which prioritises physical encounters over storytelling, dark romance incorporates psychological depth, intricate power dynamics. Choti often focuses solely on physical encounters, frequently lacking the character development and narrative sophistication found in dark romance. This difference is crucial, as dark romance uses its exploration of desire and power to delve into complex emotional landscapes.\nDuring the panel discussion, Dr Manzoor highlighted a crucial aspect: \"The reason why dark romance draws you is because it often deals with female desire. When women want to take control of their desire, and it is in the shape of darkness, what stories can you find then?\"\nThe arranged marriage trope in dark romance frequently serves as a clash between traditional values and contemporary desires. Traditionally perceived as a means of securing familial alliances, arranged marriage takes on a different dimension in dark romance—becoming a battleground for power struggles, forbidden desires, and intense emotional conflict. This tension resonates strongly in South Asian contexts, where marriage is often seen as a duty rather than a personal choice. While not dark romance per se, Humayun Ahmed's work often explores the psychological impact of forced relationships and the suppression of individual desire in traditional marriages. For example, in Shonkhonil Karagar (Khan Brothers, 1973), the character of Bilkis, though betrothed in an arranged marriage, harbours a deep longing for a different life and love. While not explicitly erotic, the undercurrent of her repressed desires hints at the psychological complexities that arranged marriages can entail. Similarly, Selina Hossain's Hangor Nodi Grenade (Anannya Prokashoni, 2003) portrays the complex power dynamics within arranged marriages through Jamila, showing how women in such setups often navigate complex emotional landscapes, hinting at both resilience and suppressed desires, even in dire circumstances like wartime. These examples, though from mainstream literature, illustrate the existing tension between tradition and individual agency, coercion, power imbalance, and emotional conflict—tensions that dark romance explores more explicitly.\nA hallmark of dark romance is the presence of dominant, often morally grey heroes. In arranged marriage narratives, this translates to a protagonist bound—willingly or unwillingly—to a powerful, often dangerous partner. This fuels stories of coercion, psychological tension, and reluctant attraction. For example, Cora Reilly's Bound by Honor (2014) explores an arranged marriage in the mafia, blending themes of loyalty, passion, and danger. These narratives often begin with mistrust but evolve into dark, intense love—a defining element of the genre.\nThe forced proximity inherent in an arranged marriage setting often fuels the slow-burn passion characteristic of dark romance. The genre thrives on tension, drawing characters together by obligation while simultaneously forcing them to resist their growing attraction. This push and pull between duty and desire amplifies the emotional stakes, creating a compelling narrative dynamic. For example, a dominant hero might initially exert control, but the heroine's resistance can lead to a gradual shift in the power balance, adding another layer of complexity to their evolving relationship. This forced proximity psychological interplay is evident in novels like The Kiss Thief (2019) by LJ Shen, where the protagonist initially resists her arranged marriage, only to find herself entangled in a complex web of power, control, and reluctant attraction. The gradual shift in power dynamics and the deepening emotional stakes are what make dark romance distinct from both traditional romance and pure erotica.\nBangladesh, too, has a complex relationship with erotic literature which sometimes reflects a broader cultural tension between tradition and modernity; explicit discussions of desire, consent, and power have remained largely absent in mainstream fiction. This lack of representation created a gap between reality and literature, as themes of passion and coercion were often softened or ignored altogether. This self-censorship in mainstream fiction revealed not just literary boundaries, but deeper societal resistance to confronting these themes openly and sometimes with consequences.\nThe recent emergence of dark romance, however, represents a potential shift, not just in foreign literature but also in Bangladeshi literature, welcoming discussions on previously taboo topics. The panel discussion at Bookworm Bangladesh also emphasised the need for open dialogue around these narratives—not as a means of sensationalising them, but to acknowledge the realities of power imbalances and emotional complexity in relationships. Without addressing these themes, literature risks failing to fully capture the depth of human experience.\nHow does dark romance fit into Bangladeshi literature? Can arranged marriage narratives in dark romance bridge the gap between tradition and modernity? These are complex questions. Dr Kaiser Huq, a notable voice in contemporary Bangladeshi literature, observed that genres like dark romance challenge traditional literary boundaries, offering fresh perspectives on social structures and relationships. This observation is the key. Dark romance, by its very nature, pushes against established norms, forcing a re-examination of traditional power dynamics within relationships. For instance, the arranged marriage trope, when explored through the lens of dark romance, can expose the underlying power imbalances inherent in such arrangements. It can also explore the often-unspoken desires and frustrations of individuals trapped within these structures. Therefore, dark romance, while controversial, has the potential to offer critical commentary on traditional practices, prompting important conversations about consent, agency, and the evolving nature of relationships in modern society. It can bridge the gap by exploring the unspoken undercurrents of tradition, bringing them to the forefront in a way that sparks dialogue and challenges conventional thinking.\nYet, the persistent taboo surrounding dark romance in Bangladeshi literature reflects a broader cultural reluctance to engage with themes of desire, power, and agency—particularly within the context of traditional institutions like arranged marriage. But as evidenced by the growing readership of both translated dark romance works and emerging Bangladeshi online fiction, there is a clear appetite for narratives that challenge these boundaries. As Bangladeshi literature embraces bolder storytelling, will local authors rise to the challenge of reinterpreting this trope for a South Asian audience? As mentioned, since the demand is there—perhaps all that's needed is a writer willing to take the plunge. The potential for this transformation rests with a new generation of writers, poised to redefine both the genre and the landscape of Bangladeshi literature. This growing openness to host such conversations, combined with the rising generation of writers who are increasingly willing to explore these themes, points to an exciting evolution in Bangladeshi literature—one that might finally bridge the gap between traditional storytelling and contemporary desires.\nNazmus Sadat is a knitwear consultant in the RMG sector with a passion for literature and a penchant for sharing his reflections on Goodreads and Instagram (@dshadowcatreads). He can be reached at [email protected].\n\n",
        "headline_1": "Between tradition and taboo: The arranged marriage trope in Bangla dark romance literature",
        "headline_2": "",
        "link": "https://www.thedailystar.net/culture/books/news/between-tradition-and-taboo-the-arranged-marriage-trope-bangla-dark-romance-literature-3834921",
        "news_paper_name": "The Daily Star",
        "publish_date": "27-02-2025"
    },
    {
        "full_article": "As part of a study on play, two groups of children were asked to practise solving jigsaw puzzles. One group was given a choice of additional puzzles on the floor besides those on the table, with no adult intervention. The other group was informed that there were puzzles they needed to solve, with an adult present, but no interaction occurred. Both groups were given 10 minutes to complete the puzzles and then asked to solve them again. Which group do you think performed better?\nThe study's first group was free to choose their puzzles, had no adult presence, and could decide where to solve them. Thus, they identified the setting as a playful environment, which gave them the freedom to try new ways to address a problem. The second group, on the other hand, perceived the setting as non-playful due to the adult presence and the site that was dictated to them (the table, in this case). Regarding performance, all children improved after practice, but the playful group went beyond the immediate results. Children practising in the playful environment showed enhanced purposeful creativity, problem-solving skills, persistence, focus, engagement, well-being, and metacognition, i.e. the ability to monitor, control, and reflect on learning and processing information.\nBut how does one define play? Justine Howard, associate professor in child research at Swansea University and a developmental and educational psychologist specialising in play, describes play as a \"process or cycle characterised by children adopting a playful psychological state or approach to a task.\" Put simply, play is defined by the players themselves. Therefore, the question is: what puts them in a playful psychological state?\nHoward illustrates this with a teacher playing with preschool students pretending to drive a bus. When the teacher joined in, asking about the destination, fare, and change for 50 pence, the children gradually lost interest. Although the teacher intended to integrate learning, the children felt she had taken over their activity. Children view activities as playful when they feel they have choice and control (over when, where, with whom, what, and for how long they play), regardless of age and context.\nIn a study, Howard and her colleagues asked children aged three to six to pose for pictures while engaging in activities like reading, solving puzzles, or group work. In different classrooms, children played a game where they sorted pictures into \"play\" and \"not play\" categories by posting them in labelled letterboxes. After sorting, the children explained their choices. They generally did not consider an activity playful if it was done at a table or if an adult was present. Smiling faces in the pictures were more likely to be seen as play. Activities with books and numbers were less likely to be considered play, while outdoor activities were perceived as more playful than indoor ones.\nAn interesting observation from the study was how children used cues to determine how they would approach an activity. For example, placing a box of Legos on the table or a floor is essentially the same, but children view the activity as play when it's on the floor. Choice also plays a significant role; activities are labelled as play when perceived as voluntary.\nHoward compares a child learning in a playful environment to an archer with a quiver full of arrows. When children feel confident and secure, they have many opportunities to hit the target. If they miss, they might even adjust the target, demonstrating innovative problem-solving in a relaxed, choice-driven environment. In a playful state, children are more willing to experiment and take risks. Howard explains, \"A small change in their environment and the cues that they are exposed to can have such an impact on children's psychological state that they do much better on the task as opposed to when they are not given that agency.\"\nConversely, when that agency is taken away, children have fewer arrows in the quiver, and they feel like their opportunities are limited. They are more afraid to take risks and think of innovative ways to address a challenge. Thus, they are more likely to continue with an incorrect action rather than think about it creatively and are less likely to be deliberative or purposeful with their problem-solving. Their behavioural thresholds are heightened, and they become more aware of what they \"cannot\" do, leading to more rigidity in their actions.\nIn playful environments, children can retry activities without judgment, building identity and self-confidence. This low-threat environment is why play—a low-cost, sustainable way to support children's mental health and well-being—is so important for every child's development. It reduces their fear and protects their self-esteem, helping them with increased emotional and physical perseverance.\nPerceptions of play are embedded in cultural practices. Parents in Bangladesh generally struggle to acknowledge even teacher-led play as an acceptable teaching tool. The more knowledge we have about play and the more evidence there is on its importance, the more convinced parents are likely to be about its impact on children's development. Children obviously have to learn to do certain things at certain ages when it comes to mainstream education, but through play, we can help that learning be more effective by helping them feel safe, make mistakes, and grow within their learning environment.\nUpashana Salam is senior manager of communications and knowledge management at the BRAC Institute of Governance and Development (BIGD).\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Why children’s voices matter in unlocking their full potential",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/why-childrens-voices-matter-unlocking-their-full-potential-3834471",
        "news_paper_name": "The Daily Star",
        "publish_date": "27-02-2025"
    },
    {
        "full_article": "Our hearts go out to the victims of the devastating fire that swept through Rangamati's Sajek Valley, one of the most popular tourist destinations in the country. According to estimates given by the district administration, the fire—which broke out around 1:00pm on Monday—gutted about 98 establishments including 36 resorts and cottages, 35 houses, 20 stationary shops, and seven restaurants. Business owners estimate the total damage to be around Tk 100 crore, including Tk 30 crore lost in tourism-related destruction alone. While the scale of the fire has caught many by surprise, preliminary investigations reveal glaring lapses that make such a tragedy seem all but inevitable.\nAccording to a report by Prothom Alo, the fire, which burned uncontrollably for hours, was exacerbated by the lack of a fire station nearby. By the time fire service units from Dighinala, Khagrachhari, Rangamati, and other far-flung areas arrived, the damage was already extensive. The water crisis in Sajek also hampered firefighting efforts by locals. There were other factors responsible for the devastation. For example, most structures in Sajek are built of wood and bamboo, making them highly flammable. The uncontrolled expansion of resorts and cottages without proper regulations also created a densely packed environment where fire could easily spread. Moreover, none of Sajek's estimated 126 resorts and cottages had fire extinguishers, nor had there ever been a fire drill in the area.\n\nHow could such a popular spot develop without having any fire safety measure in place? Why didn't the local administration and fire service department enforce necessary measures, even after similar fires broke out in Sajek in 2017, 2021, and 2023? While the lack of fire and building safety is a threat that extends to all of Bangladesh—especially urban and industrial settings where fire incidents are a common occurrence—the Sajek episode should serve as a wake-up call for the tourism authorities and entrepreneurs. We need sustainable tourism that prioritises safety, not unplanned expansion that compromises it.\nThe question is, how could such a popular spot develop without having any fire safety measure in place? Why didn't the local administration and fire service department enforce necessary measures, even after similar fires broke out in Sajek in 2017, 2021, and 2023? While the lack of fire and building safety is a threat that extends to all of Bangladesh—especially urban and industrial settings where fire incidents are a common occurrence—the Sajek episode should serve as a wake-up call for the tourism authorities and entrepreneurs. We need sustainable tourism that prioritises safety, not unplanned expansion that compromises it.\nThe immediate priority, however, is to ensure the victims are properly compensated and helped in rebuilding efforts. At the same time, steps must be taken to prevent fires in the future. The establishment of a fire station in Sajek or nearby areas has become crucial. Also, given the water shortage in hilly regions, every resort and cottage there should be mandated to have fire extinguishers and other essential firefighting equipment. All this must be done as part of a strict regulatory framework for tourism infrastructure development.\n",
        "headline_1": "Sajek fire a wake-up call for the tourism sector",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/sajek-fire-wake-call-the-tourism-sector-3834436",
        "news_paper_name": "The Daily Star",
        "publish_date": "27-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Concern about law and order",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/concern-about-law-and-order-1740581238",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Why is this surge in crimes?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-is-this-surge-in-crimes-1740581327",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Police must prove  their worth",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/police-must-prove-their-worth-1740581400",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Improving global ranking of public universities",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/improving-global-ranking-of-public-universities-1740581435",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-02-2025"
    }
]