[
    {
        "full_article": "The India-United Kingdom Comprehensive Economic and Trade Agreement (CETA), signed by the two countries on Thursday, is a good example of the give and take between two large economies of comparable size. While the U.K. has agreed to provide India duty-free access to about 99% of its tariff lines, it has been more conservative when it comes to the movement of professionals. It has set an annual quota of just 1,800 visas for niche professional roles such as yoga instructors and classical musicians, and the agreement falls short of making commitments on broader visa categories such as business visitors or IT professionals. This was something India had been keen on. On the other hand, while India has opened about 90% of its tariff lines for duty-free import from the U.K., it has kept key agricultural products such as dairy products, apples, oats, and edible oils out of the deal — key demands of the U.K. Similarly, while India has committed to reducing duties on automobile imports by a substantial 100 percentage points over time, these are subject to a graded quota over the next decade, which gives the domestic industry time to adjust. A sign of a good deal is when both sides walk away happy but not satisfied. In any case, such bilateral deals should not be viewed as a zero-sum game where one side’s loss is another’s gain. Enhancing bilateral trade is in both countries’ interests, especially at a time when the world’s biggest trading powers are raising tariff and non-tariff barriers.The U.K. is a relatively small trading partner for India, but therein lies ample scope for growth. While at a macro scale the gains might initially be limited, the sector-wise increases have the potential to be significant. Sectors such as agriculture, textiles, leather and chemicals are all set to see quick gains. There is potential for longer term benefits too. The U.K. is a major gateway to Europe, which is a much bigger trading partner of India’s. Goods destined for Europe could be routed through the U.K., and the duty-free arrangement will likely enhance this flow. Companies in other countries that already export to the U.K. will also start viewing India more favourably as an investment destination so as to take advantage of the duty-free access. It is now up to the government to help Indian exporters scale up and compete internationally. Another important consideration is that such a deal sets the template for future ones. The general trend is that the bigger the economy being negotiated with, the bigger the concessions given. The United States and the European Union will now want more from India than what it has conceded to the U.K. Published - July 26, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        trade agreements\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        imported cars\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        Europe\n                    \n                            /                      \n                        \n                        investments\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        European Union",
        "headline_1": "​Promising compromise: on the India-United Kingdom Comprehensive Economic and Trade Agreement",
        "headline_2": "India-U.K. trade deal may set the template for the EU and U.S. deals",
        "link": "https://www.thehindu.com/opinion/editorial/promising-compromise-on-the-india-united-kingdom-comprehensive-economic-and-trade-agreement/article69855013.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "26-07-2025"
    },
    {
        "full_article": "The imposition of President’s Rule, once a frequent and politically motivated tool of the Centre, has declined considerably since the 1990s. This welcome shift is a consequence of S.R. Bommai, the landmark judgment, the rising influence of regional parties in national politics, and public revulsion to its misuse. In recent years, its application has become rare, reserved for genuine constitutional breakdown or severe internal security challenges, such as in Manipur. On Friday, President’s Rule was extended there by another six months, from August 13. But few would contest the extension, as the Centre is struggling to find a durable solution to the ethnic conflict. Following the resignation of N. Biren Singh and the fall of the BJP government, there has been a discernible but fragile calm. A crackdown on militant groups that had operated with impunity has reduced open violence, and some families displaced since May 2023 have begun to return home. However, these positive developments are overshadowed by the unbridged and deep-seated ethnic schism between the Kuki-Zo and Meitei communities. The landscape of Manipur is still carved up by buffer zones, rigidly segregating communities. The political chasm is just as stark: Kuki-Zo groups are resolute in their demand for a separate administration, while hardline Meitei organisations persist with a narrative that brands fellow citizens as “outsiders”.Administrative steps, particularly those that reiterate de-weaponisation and a defanging of militant groups acting for ethnic interests, must continue. They not only break the aura of impunity with which these groups function but will also encourage moderates to raise their voices for reconciliation. During Mr. Singh’s tenure, prominent civil society activists seeking to halt the conflict by critiquing the biased nature of governance were hounded. But the administrative measures to improve the rule of law must be supplemented by political gestures. The BJP enjoyed support in the valley and the hills when it was elected, but has been unable to bridge the ethnic hostility. This is largely because the party’s national leadership has shown little inclination to treat the issue urgently, leaving it to civil servants and security forces to tackle the problem. While the continuation of President’s Rule might seem inevitable in Manipur, its success should not be measured by the absence of violence alone. The Centre’s responsibility is to foster political conditions to bridge the ethnic divide, but that responsibility must be shared. Political parties and civil society groups must defy the hardliners and begin the painstaking work of reconciliation. The future of a peaceful Manipur will be written by the initiative of committed political actors willing to transcend ethnic divisions and work toward the genuine healing of their fractured society.\r Published - July 26, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Manipur\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        national or ethnic minority\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party",
        "headline_1": "Healing Manipur: on Manipur and President’s Rule",
        "headline_2": "Fragile peace demands political actors pursue genuine reconciliation",
        "link": "https://www.thehindu.com/opinion/editorial/healing-manipur-on-manipur-and-presidents-rule/article69855597.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "26-07-2025"
    },
    {
        "full_article": "Vacationers need new places to holiday in \nPushback against ‘over-tourism’ is gathering pace. Maui, Hawaiian archipelago’s second-largest island, is set to can vacation rentals to meet a housing shortage made worse after a wildfire destroyed neighbourhoods. Reportedly, over a fifth of Maui’s housing is built for tourists. Last month, Spaniards turned water guns on unsuspecting vacationers in Barcelona and Mallorca. They were protesting mass tourism that’s ‘fuelling a housing crunch and erasing their hometowns’ character.’ Protests in Italy, Greece, Belgium and Bhutan have forced authorities to tweak policies that promote tourism unchecked at the cost of upending a destination’s living costs, draining its water, altering its character and degrading the environment. World’s most-sought spots are in ecologically fragile areas – or have turned vulnerable after tourism’s push. Think: 75% of solid waste in J&K’s Pahalgam is courtesy visitors.  \nIndia’s groaning with car-choked roads, dry water sources and shaky mountains across Himalaya’s favourite spots. Landour’s population is less than 4,000. Mussoorie’s is 30k-35k. In 2024, the two had about 20L holiday-makers. A growing pain for locals are off-season crowds – post-Covid, tourism’s a year-round affair. Climate change meets OTT-tourist infra to deal a double whammy: a landslide in Sikkim stranded 1,600 tourists this June. Who’s thinking solutions? Limiting numbers was attempted in some hill stations. But little has moved on dispersing the travelling hordes to new cool-climate spots, or building satellite destinations around hotspots. Tourist masses need new destinations.\n\n",
        "headline_1": "Where do you go?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/where-do-you-go/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-07-2025"
    },
    {
        "full_article": "Was US’s serial killer wave a result of industrial pollution?\nIn the age of true crime fandom, books about serial killers have big appeal. Murderland: Crime and Bloodlust in the Time of Serial Killers by Pulitzer-winning Caroline Fraser reminds us how stomach-churning this hobby can be. There are more women being killed on a page, in one terrible way after another, than men in the entire book.\nWhat the book investigates is why so many serial killers were roaming America in the 1970s and 80s. At the time, all this “mindless violence” was blamed on political turmoil, dissolution of the family, on television. On black people, even though the superpredators were mostly white males.\nThe book offers a dramatically different answer. It was toxins that made the men toxic. Sulfur oxides wafted up the furnaces spread across the Pacific Northwest, alongside lead and arsenic. Many neighbourhoods felt like Dante’s inferno. Sometimes when men got into a bathtub after smelting work, the water turned green.\nBut ASARCO, which operated many smelters (plus copper, zinc, asbestos mines) kept fighting off the citizens who wanted pollution controls and the scientists who worried about carcinogens. This was also the business of Rockefellers and Guggenheims. It took two great American family fortunes to build a city of serial killers, Tacoma, the book says.\nIt creates a sinister parallel between how all the anti-pollution objections were swept aside for decades, and how many rape-murders the serial killers were able to get away with.\nFraser completely reframes the time and space otherwise associated with baby boomers, Americana and Archie. She also enmeshes herself into this rebranding. She extends out the map of her childhood neighbourhood, centres it on Tacoma, and finds Ted Bundy and Gary Ridgway also growing up near her, and Charles Manson imprisoned. In addition to the many serial killers she tracks through the book, she muses on her own father’s random cruelties to his wife and children: “I should have killed him while I had the chance.”\nIf the Tacoma of that time is comparable to the wasteland landscape of Dune, it’s because Frank Herbert indeed drew his desert vision from the city and its smelter, which made the air “so thick you can chew it”.\nThe book highlights research connecting the functional derangements caused by lead to men repeatedly beating, raping, strangling, stabbing and smothering women and children, as if compelled by some force as implacable as gravity. This fever only breaks around 1992, after regulators stop dragging their feet, leaded gasoline is phased out, and lead levels in American children and adults start declining rapidly.\nMRI scans measuring adult brain volumes show that lead exposure in childhood causes very notable abnormalities in men, leading to high levels of psychopathy. Greatest volume loss is found in the anterior cingulate cortex, which helps in regulating behaviour. In scans of female subjects, red areas are relatively minor.\nChange happened when everyone breathing a lot of lead shifted towards complaining about it. And when technology stepped up. In 1975, there was a newfangled experiment, instructing a computer to cross-check multiple lists of suspects, such as traffic violations near areas where women disappeared and classmates of victims. To catch Ted, that was the turning point.\nAn X-ray of his skull showed “nonunion of coronal suture”. Something was literally broken in his head.\n\n",
        "headline_1": "Toxins thicken the air, killers walk the streets",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/253596/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-07-2025"
    },
    {
        "full_article": "Grim results of EV makers raise a question about viability\nThe future of mobility is electric, and it should have been here by now, considering that Morris & Salom’s Electrobat cars were running on Philadelphia’s streets in 1894. In 1909, an electric car beat a gasoline car in Boston’s busy traffic by 15 minutes. But electric cars are still at the 25% sales mark globally, and like most averages that figure is misleading. \nWhen 70% of all electric cars are made in China, and 65% are sold there, the picture looks distinctly ICE-y – short for internal combustion engine – for the rest of the world. Then consider market leader Tesla’s woes. Its quarterly revenue has slumped. Half-yearly sales in Europe are down 33%. But more worrying for it is the drying carbon credits market under Trump. So far, Tesla’s made billions selling these credits to makers of ICE cars. It earned $2.1bn from them in just the first nine months of 2024. Tesla also has to worry about the phase-out of the $7,500 tax credit for EV buyers in Sept. \nCarbon and tax credits are nothing but subsidies for the EV business in US and Europe, and the Chinese EV miracle was also built on subsidies. By some accounts, China spent $231bn over a decade to prop up the industry, which now has spare capacity of 3mn cars, leading to cut-throat competition at home and dumping outside. That raises an important question. If EVs have truly come of age, why do they need state support? In 1900, US had only 8,000 cars. By 1915, there were over 2mn. Henry Ford’s Model T – launched for $850 in 1908 and priced at just $300 in 1917, thanks to economies of scale – brought the horseless revolution without any state help. It’s time electric cars learnt to stand on their own four wheels.\n\n",
        "headline_1": "Volt face",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/volt-face/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-07-2025"
    },
    {
        "full_article": "Corbett Tiger Reserve, initially founded as Hailey National Park in 1936, stands as the first national park on the Asian mainland and a significant milestone in wildlife conservation. It’s a popular destination for wildlife tourism today, drawing many visitors from India and around the world.\nThis vibrant wildlife tourism economy is supported by a network of accommodations, both within and outside the reserve, along with vehicle-based safaris across eight designated zones. Each year, approximately 300,000 visitors generate nearly Rs 20cr in revenue, contributing to regional development.\nRead full story on TOI+\n\n",
        "headline_1": "Jim’s big cats & the cost of ‘progress’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/jims-big-cats-the-cost-of-progress/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 26, 2025 00:00:00  \nThere is no denying that Bangladesh's shipbreaking sector is now past its prime as it struggles on multiple fronts to keep itself sustainable. The headwinds it is facing have to do with regulatory and compliance issues as well as a slump in ship recycling business globally. Given the sector's notoriety as an environment polluter, a source of substances harmful to human health as well as ecology and its disregard for workers' safety, it is hardly surprising that the sector has long been in the crosshairs of the local and international rights groups and environmental lobbies. Classified Red by the Department of Environment (DoE) in 2007 and then reclassified back to Orange B in 2021, the sector needs to fast-track its efforts to meet the conditions of regulatory authorities concerned. \nSo, to remain in business, the ship recycling yards in Bangladesh have to go green as required by the Hong Kong Convention (HKC), which the country ratified in June 2023 and it (ratification) came into force on Jene 26, 2025 so that safe and environmentally sound ship recycling practices could be ensured. But due to procedural delays in getting the necessary clearances at home, thanks to the tardy bureaucracy, the country runs the risk of losing its competitive edge in the international shipbreaking market. Though the country's ship-breaking yards began their green transitioning since 2017 when one of the ship recycling yards got the required international certification, yet the process has remained rather slow, according to the Bangladesh Ship Breakers and Recyclers Association (BSBRA). That is why, so far only seven ship recycling yards could obtain Statement of Compliance (SoC) from HKC, says the NGO Shipbreaking Platform (NSP), an international body for greener and safer ship dismantling practices. \nBut unless, the shipbreaking yards get the necessary compliance certification from HKC, the local companies will not be able to import the scrap ships for recycling. Reports have it that local shipbreakers bought only 57 scrap ships between January and June of this year which is 36 per cent less than the number of end-of-life ships imported during the same period last year (2024) at 89. Such downturn is bad news not only for the local shipbreaking industry which once led the world with the highest number of scrap ship dismantled in 2021 at 254, it also means loss of livelihoods of those employed in this sector which according to an estimate numbered 40,000 workers and families dependent on them. The shipbreaking industry's decline is not a matter of highs and lows that happens in every type of business. On the contrary, it is a structural one, think some experts. Multiple global factors are also to blame for this including the Russia-Ukraine war that began in 2022 followed by the Red Sea crisis (starting in 2024) disrupting global shipping routes and supply chains. \nAll this has led to an emergency with the demand for additional shipping capacity. As a result, globally, the shipbreaking sector has fewer old ships earmarked for demolition. As expected, the global decline in the shipbreaking industry has threatened the viability of the domestic ship recycling sector, too. Some yards have reportedly shut down their operations. Under the prevailing circumstances, the government should expedite its work of issuing DASR (Document of Authorization to Conduct Ship Recycling (DASR), which is mandatory under HKC, to which Bangladesh is a party. Local industry insiders view the lack of DASR a barrier to their importing scrap hips for demolition. So, the faster the country's shipbreaking yards turn green, the better will be their prospect of growth and, again, become a thriving industry as before.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Protecting the shipbreaking industry",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/protecting-the-shipbreaking-industry-1753447219",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       July 26, 2025 00:00:00  \nIn less than a week, the Trump administration's new tariffs will come into effect. Unless Bangladesh manages to strike a deal with the US before then, which it has been attempting to do for a while now, its exports will get slapped with a brutal 35 per cent duty starting August 1. From the look of things, Bangladesh is nowhere near securing a favourable settlement even after two and a half months of negotiations while competing countries such as Vietnam, India, Indonesia and Thailand have either reached or are very close to reaching a deal to get tariff cuts on their own exports.\n\nGiven the situation, if those competitors receive lower tariffs and Bangladesh does not, it will be a major setback to the country's single largest export destination. Nearly $9 billion worth of annual exports, mostly garments, would take a direct hit because a tariff this high is almost guaranteed to reduce shipments. Buyers will definitely want to know how the additional 35 per cent tariff will be covered. Will they pass it on to consumers, transfer it to exporters or split it in some way? Until such questions are resolved, many orders are likely to be postponed. And unless some practical arrangement is made to decide who carries what share of the cost, buyers might choose to shift their orders to countries with lower tariffs in the end. That means the livelihoods of over a million garment workers who help produce RMG exports to the US would be at stake.\nWhen these tariffs were first announced back in April with varying levels for various countries based on a trade imbalance calculation, most people assumed it was purely an economic move on the part of the US. It was only by mid-July, when a leaked US Trade Representative letter revealed certain conditions attached to the tariff discussions, that it became clear there was more to the story. Turns out, this wasn't just about money. There were strings attached. Bit by bit, it became clear that the US had brought national security, foreign policy and geopolitics into what was supposed to be a trade discussion. For instance, one condition demanded that Bangladesh comply with any US sanctions on other countries, potentially cutting off trade, commerce and investment with the likes of Russia and possibly China down the line. On top of that, there were other tough demands such as joining thirteen global treaties on intellectual property, adhering to strict rules of origin and so on. \nThis exposed two important realities. First, the US has obviously reverted to a Cold War mentality and is now employing tariffs and trade as tools to pull countries into its camp in a larger contest for global dominance. Bangladesh may be a tiny player in economic terms and a nonplayer in terms of military power, but even it has not been spared from the crossfire of global power politics. The US seems to believe it can weaken its rivals, especially China, through its tariff strategy. Given that the US has seemingly weaponised tariffs against Bangladesh, it is reasonable to assume it has done the same with other countries, and that those who were rewarded with favourable terms are the one that have quietly given in to its demands. Bangladesh, which has long upheld a foreign policy of friendship with all and malice toward none, now finds that very principle under threat. Being forced to take sides would not only break from this tradition but could also land Bangladesh right in the middle of someone else's conflict.\nThe second thing this whole episode reveals is how woefully unprepared Bangladesh has been in handling such a crisis. It is widely known that negotiations with the US are complicated and that countries seeking to influence American policy or retain trade benefits typically do so through registered lobbyists. That's how the game is played. Shockingly, Bangladesh entered this high-stakes negotiation without hiring any professional lobbyist. This decision, or oversight, has been nothing short of disastrous. While most countries rely on strategic lobbying, Bangladesh's attempt to manage the situation through bureaucrats and advisers alone only exposed its lack of preparation. Now there's talk of scrambling to hire lobbyists, but it comes too late and will likely not reverse the damage caused by months of inaction and miscalculation. \nSo where does that leave the country? Obviously, the US is asking for concessions that could economically tie Bangladesh's hands for years and force it to cut ties with China, something that would be extremely difficult if not impossible. Eventually, Bangladesh may have to offer some limited concessions that don't compromise its national interest, if not by the deadline, then soon after, if it hopes to secure an exemption or at least gain some breathing room on tariffs. Before making any counteroffer, however, the government needs to consult security, diplomatic and trade experts because these demands obviously touch on critical national priorities where their inputs would be invaluable. \nLet us also not forget the power of personal diplomacy which can potentially make a difference under the circumstances. Countries that successfully secured trade deals with the US so far often had their heads of state speak directly with president Trump and that clearly played a role in sealing the agreements. For example, Vietnam's Communist Party general secretary To Lam and Indonesia's president Prabowo Subianto both held phone conversations with Trump. Bangladesh's chief adviser Prof Muhammad Yunus is not only a Nobel Laureate but also known for his charming personality and ability to influence negotiations. Should he engage in direct talks with President Trump, his personal appeal could well prove decisive in bringing a favourable outcome. That being said, no matter how desperate the situation gets, Bangladesh cannot afford to compromise its sovereignty or long-term principles just to get a temporary trade benefit. No deal can be worth that much.\nshoeb434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Export on edge amid tariff crisis",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/export-on-edge-amid-tariff-crisis-1753447343",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       July 26, 2025 00:00:00  \nAround 34 years after the fall of the autocratic regime of Ershad, the country has witnessed another mass uprising against the authoritarian regime of Sheikh Hasina in the last year. Although the two events are not entirely comparable due to differences in intensity and complexity of the dynamics, some similarities are also present. \nErshad seized power in 1981 through a military coup, removing a democratically elected government while serving as the country's army chief. In the next nine years, protests and movements against his autocratic regime continued despite military restrictions and oppression. During this period, mockery of the parliamentary system occurred in the context of two parliamentary elections, and non-functional parliaments coexisted alongside a centralised power structure, with all authority concentrated in the hands of President Ershad. The students first ignited the anti-Ershad movement. Leading political parties, the Bangladesh Nationalist Party (BNP) and the Bangladesh Awami League (BAL), gradually came to the streets and shaped the movement. Hasina-led BAL, however, joined the third parliament election in 1986. Before disclosing the party's decision to participate in the election, Hasina publicly declared that those who would take part in any election under Ershad were 'national traitors'. She did not hesitate to disown her own words within a few days. BNP leader Khaleda Zia was insistent on her strong stance on not participating in any election under Ershad. Both parties, however, abstained from participating in the 1988 parliamentary election, as the movement against the Ershad regime intensified. \nThe final blow against the regime came in 1990 as all the student organisations joined hands. Their unified position was a crucial turning point of the movement and helped the political parties move ahead. Ershad finally stepped down on December 6, 1990, handing over power to the country's first caretaker government. Bangladesh embarked on the path of democracy after a nine-year struggle. \nSimilar to the movement against Ershad, students led the movement against Hasina in 2024, where the role of political parties was limited. The intensity of repression by her regime was so brutal that it has no match with Ershad's. During the July mass uprising, around 1,400 people were killed in 36 days, whereas more than 20,000 people were injured, and around 11,700 people were detained and tortured. \nAlthough Hasina-led Awami League assumed power in 2009 following a landslide victory in the eighth parliamentary election on December 29, 2008, in the years that followed, she gradually eroded the integrity of the election process. In the next three parliamentary elections, she and her party took whatever measures were necessary to stay in power, thereby depriving the masses of the opportunity to cast their votes. Despite being a big beneficiary of democracy, she gradually turned herself into a cruel authoritarian. Her party and its affiliated organisations, especially the Bangladesh Chattra League (BCL), became monsters. Though many development works were completed to boost the economic growth during the 15 years of the regime, corruption and plundering of national resources by Hasina loyalists reached a new high, widening socio-economic discrimination further. All these prepared the ground for a mass uprising in July last, which forced her to step down and flee, seeking refuge in India. \nAs students of public universities led the mass uprising and faced the most intimidation, they were later backed by the students of private universities. Breaking the misconception that students at the private universities are self-centred and maintain a safe distance from any socio-political activity, they exposed their sensitivity to the rightful causes. As students from the different private universities started to come on the streets in solidarity with their peers at public universities, it gave the movement a new momentum. The anger and protests later spread across schools and colleges. Another force of the movement was students of madrashas in the country. They also played a critical role in making the movement more people-oriented. Finally, the remarkable role of the female students and youths must be mentioned. \nAs the country reminisces about the fateful days of the July mass uprising, it is also time to objectively evaluate and acknowledge the role of the various groups that joined the movement. The unity, demonstrated by the participants, especially students and youths from different spheres of society, was instrumental in making the uprising a success.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Recognising roles of July movement actors",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/recognising-roles-of-july-movement-actors-1753447389",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 26, 2025 00:00:00  \n\nThe 2025 SSC results have revealed a troubling reality in Bangladesh's education system. With pass rates falling and thousands failing in key subjects such as English, Mathematics, and Science, serious questions are being raised about teaching quality and the implementation of the new curriculum.\nThe recently introduced competency-based curriculum was rolled out hastily. Teachers were insufficiently trained, learning materials arrived late, and students were unprepared for unfamiliar exam formats. These challenges were felt most acutely in rural areas, where resources and academic support are already lacking.\nParents and students are growing increasingly frustrated. \"My daughter studied hard, but she didn't understand the new question style,\" said a parent from Rajshahi. Educators fear that without proper support, the reforms may end up doing more harm than good.\nThis decline in SSC performance is not a one-off issue-it signals a deeper crisis in our approach to education. If these gaps are not addressed urgently, we risk leaving a generation unprepared for higher studies, employment, and the demands of a modern economy.\nIt is imperative that the government invest in comprehensive teacher training, improve school infrastructure, and ensure the curriculum is clearly understood by both educators and students. Educational reform must be meaningful, inclusive, and responsibly implemented. The future of our children-and our country-depends on it.\nMd Nahid Gazi\nDhaka\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "What SSC results reveal about our schools",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/what-ssc-results-reveal-about-our-schools-1753447402",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-07-2025"
    }
]