[
    {
        "full_article": "Between late November 2024 and now, the rupee has depreciated about 7%, sliding from roughly ₹83.4 a dollar to about ₹89.2. This is not unprecedented as in 2018, it slid 11%-12% against the dollar. The comparison is instructive because the political and trade backdrops have echoes of that earlier period. In 2018, during the first term of U.S. President Donald Trump, global dollar strength, rising U.S. interest rates and trade tensions pressured emerging market currencies, including the rupee. The RBI used its first longer-term currency-swap as a systemic liquidity check. In 2019, it completed a $5 billion three-year dollar/rupee swap. And in February 2025, it carried out a $10 billion dollar/rupee buy-sell swap auction to infuse long-term rupee liquidity into the banking system under global stress. Such swaps are a standard tool by central banks to supply liquidity, shore up forex reserves and prevent disorderly currency depreciation when the dollar surges or capital flows reverse. The steep rupee slide in November arises in a context of external pressures — a widening current-account deficit, driven partly by higher imports of bullion, as a hedge in uncertain times, and exporters scrambling to maintain competitiveness amid high U.S. trade tariffs. In such a hostile global macro-environment, the RBI’s mandate is limited: under the floating-but-managed regime, it can only ‘smoothen volatility’ rather than fix the exchange rate.Between November last year and now, the RBI sold a net of roughly $50 billion in forex to stabilise the rupee. Even so, the slide has proceeded, highlighting the external pressures. That said, there is room for cautious optimism. India’s foreign exchange reserves are comfortable — close to $693 billion. On the domestic front, retail inflation has slumped: headline CPI inflation came in at just 0.25% in October 2025, well below the RBI’s target-band of 2%-6%. This gives the RBI space to tolerate modest currency depreciation without triggering aggressive rate hikes especially as India transitions from cheaper Russian crude to relatively costlier U.S. oil imports. With crude accounting for over a fifth of total imports in FY25, rupee depreciation combined with costlier oil imports could exert upward pressure on inflation. Given this environment, monetary stabilisation alone cannot suffice. The Centre must address India’s long-standing vulnerability: heavy dependence on oil. Steps such as faster transport electrification must be treated as strategic imperatives and pursued with urgency. These must be done with a well thought-out trade policy, as opposed to a raft of bilateral trade deals that India has focused on , in the hope that these would diversify trade routes. If anything, trade agreements with Japan, the UAE and ASEAN have tilted the trade balance against India. Published - November 27, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        currency values\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        banking\n                    \n                            /                      \n                        \n                        foreign exchange market\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        imports\n                    \n                            /                      \n                        \n                        Japan\n                    \n                            /                      \n                        \n                        ASEAN\n                    \n                            /                      \n                        \n                        United Arab Emirates\n                    \n                            /                      \n                        \n                        trade policy",
        "headline_1": "​Limited room: On the Indian rupee",
        "headline_2": "India must reduce dependence on oil imports to stabilise the rupee",
        "link": "https://www.thehindu.com/opinion/editorial/limited-room-on-the-indian-rupee/article70326823.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-11-2025"
    },
    {
        "full_article": "The 30th edition of the Conference of Parties (COP) concluded in Belem, Brazil, a city chosen for its proximity to the Amazon rainforest. The symbolism was high this year. It is 10 years since the Paris Agreement was signed by 195 countries — a pact to ensure that the globe did not heat up beyond 2°C of pre-industrial times and, as far as possible, contain it to 1.5°C. That was a goal easier stated than done; 2024 ended up being the first time that temperatures breached the 1.5°C territory though it will require several more such transgressions for 1.5°C to be the ‘new normal’. In all the years since, COPs have been about systematically getting all countries to move on the path of restructuring their economies away from their fossil-fuel hardwiring; apportioning responsibility — and finance — in ways to actualise these goals, and finally work towards addressing the damage that climate change had already done to societies, livelihoods and ecologies. While there has been success, in that most countries — even the United States — recognise that renewables are the future of energy, it has been challenging for countries to execute the transformation while also growing their economies and keeping their competitive edges sharp. This has led to the formation of the two broad blocs — one led by developed countries and affiliated allies that has pushed for hard targets and road maps to phase out fossil fuels, and the other by developing countries or petro states who reject such prescription and demand more money and action from the developed countries.The Brazil COP sought to bring a change in the narrative by stressing ‘implementation’, and reminding the world that multilateralism and ‘mutirão’ (coming together) were indispensable to the Paris Agreement. While the absence of the U.S. weakened the developed country blocs, this year saw greater thrust on topics such as ‘adaptation’ and ‘just transition’ — concepts that acknowledge the everyday effects of climate change and stress practical preparatory steps and finance pledges to help countries burnish climate defences. India, which has been one of the prominent voices for developing country coalitions, was welcoming of the Brazil Presidency’s acknowledgement of concerns but did not declare its updated Nationally Determined Contributions (actions on adopting clean energy). The COP’s negotiation process often leaves one wondering about the net gains made, given that pollution, deforestation and climate denialism seem more voluble and visible but, as it is often said, this is humanity’s only opportunity to mitigate a cataclysm of its making. Published - November 27, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        climate change\n                    \n                            /                      \n                        \n                        Brazil\n                    \n                            /                      \n                        \n                        forests\n                    \n                            /                      \n                        \n                        Paris Climate Summit COP21\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        green technologies\n                    \n                            /                      \n                        \n                        pollution",
        "headline_1": "Fighting the fire: On COP30",
        "headline_2": "COP30 sought to change the narrative by stressing on ‘implementation’",
        "link": "https://www.thehindu.com/opinion/editorial/fighting-the-fire-on-cop30/article70326338.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-11-2025"
    },
    {
        "full_article": "Another study shows stardom can shorten lifespans, but the culprits are still bad choices and stress\nIn the words of a famous American artist, we were all going to be world-famous for 15 minutes. Fifty-seven years on, the quote’s paternity is disputed, and even two minutes of fame on social media remains a mirage. Meanwhile, new research is giving us pause, because stardom can seemingly shorten lifespans significantly. The study’s German authors picked up the ‘2,000 Artistes of All Time’ list and found these singers only live to 75, on average, but their less famous peers make it to 79. The actual un-rounded difference is 4.6 years. That means, being a very famous singer can be as bad as smoking.\nThis confirms what another study posited in 2013 – that a public career tends to shorten your time on Earth. Instead of looking at singers, Australian researchers had then analysed 1,000 NYT obituaries – the assumption being that you have to be famous to earn a posthumous mention in NYT’s pages. They found that actors, singers, musicians and sportspersons lived to 77, on average. Famous writers, however, managed to touch 79, which is a sobering reflection on the nature of writerly fame. Academics, historians and economists – who can’t fill a classroom, never mind stadiums –  averaged 82. Moral: boring is safe. \nSo, should you stay away from the kind of virality that’s earned from stand-up acts and singing on YouTube, Instagram, etc? It’s hard to say because, in 2001, when today’s social media stars were toddlers, researchers made a contradictory finding. They compared all 762 nominees for an Oscar (until then) in a leading or supporting role with 887 of their cast members of the same sex and age. And they found that Oscar winners outlived the others by 3.9 years, on average.\nThe golden mean, then, would be to play, sing, act as you like on social media, only being very careful – as a 2007 study said – for 25 years after you become famous. Because that’s when life spirals out of control under the influence of drinks, drugs, stress, and other questionable life choices. Even better would be to do your thing without courting success or fame at all. It’s a timeless idea from a timeless text – Gita.\n\n",
        "headline_1": "Fault In Our Stars",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/fault-in-our-stars/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-11-2025"
    },
    {
        "full_article": "AI-generated visuals should be identifiable as such. Fiction is fun, fake news is poison\nThe so-called $1tn club has been going walkabout together the past week. In one image, Elon Musk, Satya Nadella, Mark Zuckerberg, Sundar Pichai, Jensen Huang, Sam Altman, Tim Cook, and Jeff Bezos are shooting the breeze in a lux parking lot. In another, at a frat house. There are trademark tees and leather jackets and hands in pockets. There’s definitely a masters of the universe vibe – whether it be a grand redemption or ruination that they are planning. But, but, but…none of this ever happened. These are AI-generated visuals. \nWhen these drop anonymously into our feeds, some people consume the images critically, checking for a match with what they know of the real world. Others take it all in at face value. Humans have, after all, always made sense of life through this precept: Seeing is believing. No more. Great leaps in AI tech have put the ability to ‘cook’ reality in all our hands. For many of us, it’s a fab creative legup. But this doesn’t at all mean that collapsing fiction and non-fiction genres is OK. We are not OK with disinformation, erosion of trust, rage baiting. And evermore convincing AI outputs rapidly increase its malicious capacity. A recent example is how Aishwarya Rai’s humanist speech about there being only one religion, the religion of love, was swamped by its horribly distorted version. \nPlatforms need to be marking AI-generated content as such. In public interest. Newspapers do this. But tech bros have for too long kept making excuses. Watermarks can be removed, metadata can be stripped, whine and whimper. Nobody is fooled. If you can make Cleopatra walk around modern Egypt and the manosphere’s Jake Paul give makeup lessons, you can call out the AI content your AI algorithm is making viral. It’s notable how AI tools are more wary of twerking lawsuit-ready Taylor Swift and Travis Kelce, than Modi and Trump. Left to themselves, AI companies could even end up making truth a luxury product. They have flirted with ideas like making AI images identifiable for ‘free’ creators, but not paying ones. Authenticity is precious to all and must remain available to all. \n\n",
        "headline_1": "Seeing Is Not Believing",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/seeing-is-not-believing/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-11-2025"
    },
    {
        "full_article": "Pollution-solution? We haven’t the foggiest\nWhat’s that Zohrabai Ambalewali golden-oldie? AQI-aan mila ke,/Stubble jala ke,/Chaley nahin jana? Looks like Mumbai and Dilli are playing catch-up, catch-up. FOMO Mumbai is determined to match Dilli’s air quality – or lack of it. Ouff, how we can do one-SPMship if sea breeze is blowing away our stockpile of vehicular emissions. Don’t worry, we will add more-more highways so more-more cars can worsen our ‘Very Poor’ status. \nWhat you are thinking, Dilli-ji? You have crude stubble burning, we have sophisticated engines combusting. To that add the dust thrown up (and trees cut down) by the crazed construction activity. So what if ‘building for tomorrow’ might well ensure that there will be no tomorrow? Forget ecology. Remember Bill-bhau’s ‘It’s the economy, stupid.’   \nHowever saddi Dilli still beats amchi Mumbai because it has more political  avenues for fouling the air. Ruling party fogs up commission and omission with emission of  hype and rhetoric. Opposition goes better. It keeps adding SPM:  suspended parliamentary matter.  \nRecent COP30 reminded us how bad AQI heats up the planet through pollutants. It also reminded me how much our polluticians contribute to climate change. Party fossils have always fuelled regression; often with surprisingly renewable energy. Now, thanks to above-mentioned SPM, there’s no  ‘sustainability’ of parliamentary discussion; instead, spewed invective further degrades the atmosphere. As a result our netas have achieved net-zero. Naturally India would praise ‘adaptability’ at the COP30 conference. That’s what all our turncoats are so good at. \nWe have high levels of greenhorn gassers inside Sansad Bhavan. Achha, newcomers are still learning that words speak louder than actions, but political ‘grey-horns’ have always been better at gassing. In both cases, verbal flatulence makes up for the lack of ‘factulence’. Yes, ji, political climate change is pucca  needed, else democracy will hurtle into a bozone hole.\nTrue, all are susceptible, but one party especially seems to suffer most  wheezing over ‘poor heir quality’.\n                                          ***\nAlec Smart said, “How about a statutory warning against ‘overprocessed people’ laden with preservatives and aura-tives?”\n\n",
        "headline_1": "COPs and robbers",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/cops-and-robbers/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-11-2025"
    },
    {
        "full_article": "Why many competing small subnational identities are good for a country\nEven as he fights back xenophobic attacks from MAGA folk, Kash Patel is getting some heat from desis too. Firefighting politically, he said his blood is Gujarati, his heart is American, and his duty is to US’s constitution. \nWhat some Indians are muttering is, why didn’t he say his blood is Indian? This is disingenuous criticism. Strong regional identities are a fundamental feature of nations, not a bug. \nFor example, Texan/Californian or Punjabi/Malayali are labels embodying sharp distinctions. Such identities can both predate the nation-state and feel more intimate, with deeper roots in daily life, in language, food, festivals, and in the stories grandparents tell. \nThis tension, obviously, is not primordial. We can trace it to the 1648 Treaty of Westphalia, the West’s original sin. This went on to carve the entire world into nation-states pitted against each other. \nFrom directing diabolical colonialisms yesterday to mindless xenophobia and wars today, its othering has continually scarred human affairs. \nBut it’s not omnipotent. In India, a rich vein of  identification along state lines already provides meaningful countervalence. And there’s plenty of room for further enrichment. \nThe renaissance Sienese republic provides one model for this. It experimented with rules and practices to channel young people’s energies in ways that would increase social harmony. We need something like this because of how rudderless folks feel today. \nThis is the striking paradox of our time: more identities than ever, yet less belonging. So, imagine a real communitarian push across India’s 800 odd districts. \nSports, music, even martial arts competitions that draw super engagement. The fiercest contenders get talent spotted by the armed forces. \nAnd those who show themselves disinclined towards conflict get directed to many, many more roles in society.\nSuch contests would also weaken the ‘us vs them’ beastie. However fiercely you would compete for your district, you wouldn’t think of other teams as enemies. Both being Indian. \nThe problem with nations is, as Benedict Anderson pointed out, no nation imagines itself coterminous with mankind. This is, of course, tragically absurd. To see the absurdity would be a great lesson in peacemongering. \n\n",
        "headline_1": "Notions of nation",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/notions-of-nation-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 27, 2025 00:00:00  \nThe deployment of eight teams by the Rajdhani Unnayan Kartipakkha (RAJUK) following the Friday's powerful quake and three more tremors the next day to assess the vulnerabilities of buildings in Dhaka is a welcome move. It has identified 300 buildings out of 3,252 already assessed at quake risks. The number will be staggering when the city's 2.145 million buildings are assessed. In 2019 also, a survey conducted by the RAJUK under a World Bank-supported project found that over 40 per cent of buildings in the capital and Gazipur were vulnerable to earthquake. At that time 42 buildings were found to be highly risky and were marked for immediate demolition but no action followed the suggestion. In the face of lurking danger, the authorities become highly active but with time, they tend to be oblivious of the follow-up action. Will the current tempo sustain? \nAfter the Friday's biggest jolt in decades, not only quake experts but even ordinary mortals, panicky as they are, feel that a monumental tragedy to be enacted in this chaotically built city is not far away. Reports have it that some people have started shifting to areas in surrounding areas with no high-rise buildings but having large spaces. Anyway, not many people have such options and this cannot be a solution to the problem facing the city of concrete jungle. That the old and vulnerable buildings have to be demolished is indisputable. The authorities must act decisively to save lives before the calamity strikes. \nThe next option is highly costly. In case of new structures, though, modern technologies can help avoid damage to and destruction of multi-storey buildings on account of powerful quakes. So, the RAJUK must make it mandatory to accommodate one of the proven technologies so far used successfully in Japan or other countries. But for traditional buildings, the use of such technologies is highly costly. Seismic isolation, a technology used in Japan, uses from the base rubber bearings or ball bearings to isolate buildings from the ground. The ground can move independently allowing buildings to remain protected from shocks. Another device is damper or shock absorbers. Large shock absorbers are installed within a building's structure, which absorb seismic energy to convert it into heat. Hydraulic fluid-filled cylinders with pistons and large pendulums at the top of a building counteract its sway at the time of a quake. Then there are the buckling restrained braces (BRBs) which are engineered to yield and deform without buckling and absorb energy, preventing damage to the main structure. \nThere are other technologies to prevent buildings from collapsing. But these are the most advanced and successful ones. A few multi-storey buildings in Dhaka have used such technologies but retro-fitting of such technologies is highly challenging and costly. Yet there are some people here who can afford the expenses of adding the seismic isolation or BRB technology to their buildings in order to make those resilient to quakes. Yet this city will remain highly vulnerable to powerful quakes measuring 7.0 or higher on the Richter Scale. The Friday's earthquake has laid bare the insufficiency in preparedness for calamities of outsize order. The fire service and civil defence's capability should be enhanced many times more so that it can respond effectively in case of a disastrous quake.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Beyond demolition of vulnerable buildings",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/beyond-demolition-of-vulnerable-buildings-1764164055",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       November 27, 2025 00:00:00  \nAntimicrobial Resistance (AMR), a growing global public health threat, is severely affecting the management of infectious diseases. Microorganisms are increasingly developing the ability to resist the killing effects of antimicrobials (AMs), rendering these drugs less effective or even completely useless in fighting the microbes. This alarming trend is once again substantiated by recent findings from the National AMR Surveillance by the Institute of Epidemiology, Disease Control and Research (IEDCR).\nThe scale and severity of this threat were laid bare in the latest surveillance data of the IEDCR. Covering 96,477 patients between July 2024 and June 2025, the IEDCR found that nearly four in every ten patients admitted to intensive care units (ICUs) are not responding to available antibiotics, largely due to overuse and misuse. \nEven more concerning is the revelation that multidrug-resistant pathogens among ICU patients have reached a staggering level of 89 per cent, highlighting serious shortcomings and a clear lack of prioritisation in the current public health response. Small wonder that any extrapolation of these data to the national level, covering millions of patients, would paint an even grimmer picture.\nIrrational and inappropriate use of antimicrobials, causing AMR, is a well understood natural consequence. A close relationship has been documented between the excessive and unnecessary use of antimicrobials and the development of drug resistance. The emergence and spread of AMR are complex phenomena due to improper knowledge of AMs usage and inadequate interactions between the prescribers and the patients, along with lack of adequate attention of the regulatory bodies and the policymakers. Noncompliance with recommended dose of AM is another major problem. Easy availability without prescription also leads many patients to self-prescribe antibiotics, contributing to the mictobes' drug resistance ability . \nBesides, sporadic use of antibiotics in poultry, fisheries and agriculture introduces resistant bacteria into the food chain, ultimately harming consumers. A recent study revealed that more than 90 per cent of poultry farms in the country use antibiotics indiscriminately. In addition, samples of nearly two-thirds of fish and chicken meat contain bacteria associated with antibiotic-resistant infections.\nThe WHO and other international bodies rightly addressed AMR as the biggest threat to the management of infectious diseases. Each year, World Antimicrobial Awareness Week (WAAW) is observed during 18-24 November, aiming to raise global awareness of antimicrobial resistance and promote best practices to reduce its spread.\nThe WHO has also issued several key guidelines to support countries in tackling AMR, including its Global Action Plan on Antimicrobial Resistance, which outlines strategic priorities such as improving awareness, strengthening surveillance, reducing infection rates, optimising antimicrobial use and investing in new medicines, diagnostics and vaccines.\nBesides, there is a need to promote the appropriate and cost-effective use of antimicrobials, prohibit their sale without a qualified health professional's prescription and improving infection-prevention practices to curb the spread of resistant pathogens. It is also essential to regulate the manufacturing, sale and distribution of counterfeit antimicrobials, eliminate their circulation in informal markets and significantly reduce the use of antimicrobials in food-animal production.\nThe WHO recommends the development of a national antibiotic policy and the formation of a multisectoral national alliance against AMR to ensure a coordinated approach to regulating the use of antimicrobial agents. These measures are designed to promote behavioural change among prescribers and communities, encourage the rational use of antimicrobials, build capacities for efficient surveillance, strengthen diagnostic systems for microbial diseases and reinforce infection-prevention and control programmes. The recommendations further emphasise the need for a strong national governance mechanism, robust surveillance systems, a functional AMR reference laboratory, the integration of AMR topics into education and training curricula, improved hygiene practices and strengthened regulatory systems to guarantee access to quality antibiotics.\nPublic health experts at a recent seminar marking World Antimicrobial Awareness Week 2025 highlighted the scale of the crisis and the need for unified efforts to curb antibiotic misuse. One of the most concerning issues highlighted in the seminar was the persistent weakness of AMR surveillance, marked by limited environmental data and inconsistent laboratory reporting. Participants stressed the need for low-cost antimicrobial stewardship interventions and joint hospital teams comprising clinicians and microbiologists. Strengthening the link between those who treat patients and those who analyse laboratory samples is essential for developing effective protocols and improving reporting quality. Without reliable laboratory systems, the national AMR response remains fundamentally compromised.\nChallenges in implementing the National Action Plan on AMR were also brought to the fore. Insufficient laboratory capacity and low motivation among stakeholders continue to impede progress. Experts emphasised the need for sustainable financing, private-sector engagement and stronger regulatory enforcement against unauthorised antibiotic sales.\nOverall, experts say combating antimicrobial resistance requires more than policy documents and technical guidance. It demands coordinated efforts, strong regulatory enforcement, sustained investment and meaningful public engagement. Without a whole-of-society approach, antibiotic misuse will persist, laboratory systems will remain fragile and resistant pathogens will continue to spread.\nIt is time to elevate AMR containment to a national priority supported by robust surveillance, strict regulation, empowered frontline workers and active community participation. This requires establishing a comprehensive laboratory-based surveillance system covering humans, birds, fisheries and animals; prohibiting the sale of antimicrobial agents without the prescription of an authorised professional; and enforcing laws and regulations governing the production, quality control and marketing of these medicines. These measures are expected to strengthen national capacity to combat AMR and build a more resilient health system.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Antimicrobial resistance threat looms large",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/antimicrobial-resistance-threat-looms-large-1764164123",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 27, 2025 12:00:00  \n\nAgricultural entrepreneurship is crucial for Bangladesh to stimulate its economy, generate employment opportunities, enhance food security, and augment the value of raw agricultural produce through advanced processing and innovative practices. The agricultural sector is the predominant employer and serves as the primary source of sustenance and income for many individuals entrenched in poverty. The advancement of agro-industries and the emergence of agri-entrepreneurs profoundly influence the local agricultural landscape and the livelihoods of smallholder farmers.\nToday's agriculture is expanding beyond traditional farming to technology-driven advanced practices. However, the contribution of agriculture to the national GDP has progressively diminished with industrialisation, despite serving as a major employer, engaging over 40 per cent of the total workforce. Agricultural entrepreneurs, in this context, could assume a crucial role in transforming the mindset of farmers from subsistence farming to value-added, processing-based commercial enterprises.\nThe comprehensive agricultural framework, encompassing cultivation, processing, storage, value addition, and marketing - extending from farm to fork - has given rise to a novel enterprise known as agri-entrepreneurs or Agripreneurs.\nConcurrently, businesses that leverage advanced technology to support farmers have emerged, referred to as Farmapreneurs. A new wave of entrepreneurs, many without a formal agriculture background, are leveraging modern technologies to connect Farmapreneurs with markets, provide quality inputs, improve supply chains, and introduce forward-looking farming techniques. There is a concerted effort by the government and various organisations to empower rural youth and women to become agri-entrepreneurs through comprehensive training, financial assistance, timely provision of quality inputs, and assurance of market access for their products.\nA few days ago, the Department of Agricultural Marketing (DAM) orchestrated an agri-entrepreneurs' conference, where growing startups and innovative agro-based entrepreneurs gathered to showcase their processed products with remarkable enthusiasm and high expectations. This assembly underscores the extensive potential and capability to thrive and diversify the present agricultural landscape. As the dynamics of our agricultural systems continually shift in response to consumer preferences and the demands of industrial stakeholders, it is imperative that this momentum persists seamlessly, underpinned by robust support from governmental bodies and international organisations.\nMd. Refatul Hossain\nAdditional director (retd)\nDepartment of Agricultural Extension (DAE)\nFaridpur region.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Agri-entrepreneurs - a new startup",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/agri-entrepreneurs-a-new-startup-1764171398",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 27, 2025 00:00:00  \n\nBusy city roads are becoming increasingly difficult to navigate. Cars frequently turn abruptly without following traffic rules, and sudden lane changes create constant hazards. Added to this is the widespread problem of vehicles parking irregularly-even in \"no parking\" zones and on spaces meant for pedestrians. As a result, people are forced to walk on the roads, putting their safety at risk.\nThe issue goes beyond parking. Illegal shops and roadside tea stalls often occupy a significant portion of the footpaths and even part of the road. With pedestrians pushed onto the main carriageway, traffic congestion worsens, leading to delays, frustration and increased noise pollution. Many commuters experience discomfort and rising stress levels due to these chaotic conditions.\nSuch disorder inevitably leads to frequent accidents-some minor, others severe. A single moment of negligence can take away a precious life and plunge a family into grief. Before plans for road widening are implemented, illegal structures and makeshift stalls must be cleared. The eviction laws need strict enforcement to ensure that roads and footpaths remain free from encroachment.\nPedestrian movement must not be obstructed. A city cannot function smoothly without safe and accessible walkways. Strong and consistent administrative action is essential to restore order on our roads.\nMohibul Hasan Rafi\nGovernment City College, Chattogram\nmohibulhasanrafi809067@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Everywhere parking, nowhere to walk",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/everywhere-parking-nowhere-to-walk-1764164156",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-11-2025"
    }
]