[
    {
        "full_article": "Microcrystalline Cellulose (MCC) is chemically inert. The human body does not absorb it. The skin does not react to it. But it has several useful physical properties such as being a binder and texturiser, which is why it has varied applications in the pharmaceutical, food, cosmetics and other industries. MCC can add weight to a drug and facilitate the active ingredients to function effectively while making the drug conform to weight specifications. On Monday (June 30, 2025), however, the pharma unit of Sigachi Industries in Hyderabad, which makes this benign substance, was the scene of a lethal accident, with the toll rising to 36 on Tuesday (July 1, 2025). The making of this safe substance does involve risky processes, which can, however, be safe if appropriate procedures are followed by trained personnel. Most of the dead are young, poor, migrant workers from northern and eastern India who often lack social support. The Telangana government has announced an ex gratia of ₹1 crore and efforts must be made to ensure it reaches the families. It does seem that the response of mitigation agencies was timely and is ongoing.The blast, however, puts the spotlight back on the pharma manufacturing industry, which has been a foreign exchange earner for India. Such accidents have been frequent, sadly. In August last year, there was a major accident at a pharma unit in Anakapalli near Visakhapatnam. Months earlier, in April, there was another accident in Hyderabad. Officials suspect that Monday’s accident happened due to equipment malfunction, likely due to poor maintenance. It could have led to an abnormal build-up of temperature, leading to the blast. Key aspects of operating such hazardous units safely are that HAZOP, or a form of process hazard analysis, should be carried out by competent and knowledgeable staff. The data that individual units generate, that would indicate any abnormality, should be seamlessly integrated into operation control, again manned by competent staff. Operators should be trained, constantly aware of safety issues and implement steps that can ensure safety. While these are recommended practices, what is crucial is that such plants should have a high level of safety culture. Operators, managers and workers should be conscious of the ever-present risks. In this era of heightened scrutiny of industrial accidents by proactive media, manufacturing units are expected to conform to global norms especially regarding safety. Major slip-ups, such as this accident in Hyderabad, are likely to have a negative bearing on this key source of trade for India.\r Published - July 02, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        pharmaceutical\n                    \n                            /                      \n                        \n                        chemicals\n                    \n                            /                      \n                        \n                        industrial accident\n                    \n                            /                      \n                        \n                        Hyderabad\n                    \n                            /                      \n                        \n                        Telangana\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        migration\n                    \n                            /                      \n                        \n                        Andhra Pradesh\n                    \n                            /                      \n                        \n                        foreign exchange market\n                    \n                            /                      \n                        \n                        safety of citizens\n                    \n                            /                      \n                        \n                        manufacturing and engineering",
        "headline_1": "Costly lapses: On the Hyderabad pharma unit blast",
        "headline_2": "Pharma plants should have a high level of safety culture",
        "link": "https://www.thehindu.com/opinion/editorial/costly-lapses-on-the-hyderabad-pharma-unit-blast/article69760401.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-07-2025"
    },
    {
        "full_article": "The new financial year has gotten off to a relatively poor start when it comes to industrial production. Growth in the Index of Industrial Production slumped to a nine-month low of 1.2% in May 2025. This follows an eight-month low of 2.6% in April. Taken together, this puts the average growth in the index so far in 2025-26 at just 1.9%, down from the 5.7% average in 2024-25. A major reason behind the dip in May’s industrial performance was due to the electricity sector, which contracted 5.8%, its worst performance since June 2020, nearly five years ago. This poor performance in electricity generation can be put down to an unusually cool May, but it could also point towards lower offtake for industrial purposes. The fact also remains that the slowdown in the overall IIP has been broad-based — several key sectors have either contracted or slowed sharply. The manufacturing sector slowed to a growth of 2.6% in May, down from 5.1% in May last year. A deeper look shows that this slowdown was driven by contractions in the manufacture of textiles, leather products, chemicals, pharmaceuticals, electronics, and furniture. While some of these are core sectors, most are consumer-facing, implying that demand in the economy is not picking up, and may even be slackening further. This is backed by the fact that the consumer durables and nondurables sectors simultaneously contracted for the first time since November 2023.A sub-sector analysis of this data further reinforces the takeaway that demand is weak. Within consumer durables, the IIP data showed significant contractions in the production of footwear, books, plastic furniture, shaving razors, stainless steel utensils, computers, phones, air-conditioners and coolers. These are all items of discretionary spending, not strictly essential, which implies that people are holding off on their purchases. Even among consumer non-durables, the items that have seen contractions — such as meat, honey, fruit juice, jams, sugar and bottled water — are those that are eschewed the quickest during lean periods. The situation does not seem to have improved much in June either. The private sector manufacturing Purchasing Managers Index report, released on Tuesday, shows that while demand for intermediate goods is doing well, the same cannot be said for either capital or consumer goods. In recent interviews, Finance Minister Nirmala Sitharaman has expressed confidence that urban demand is recovering and that Budget 2025’s tax breaks will boost demand by the time the festival season rolls around. The progress of the monsoon so far indicates that rural demand may indeed pick up by then, but urban demand remains a worry. With trade remaining subdued and uncertain, domestic demand weakness does not augur well for the economy in 2025-26.\r Published - July 02, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        industrial production\n                    \n                            /                      \n                        \n                        manufacturing and engineering\n                    \n                            /                      \n                        \n                        electricity production and distribution\n                    \n                            /                      \n                        \n                        textile and clothing\n                    \n                            /                      \n                        \n                        chemicals\n                    \n                            /                      \n                        \n                        pharmaceutical\n                    \n                            /                      \n                        \n                        electronics\n                    \n                            /                      \n                        \n                        furnishings and furniture\n                    \n                            /                      \n                        \n                        consumer goods\n                    \n                            /                      \n                        \n                        footwear\n                    \n                            /                      \n                        \n                        books and publishing\n                    \n                            /                      \n                        \n                        plastics\n                    \n                            /                      \n                        \n                        mobile phones\n                    \n                            /                      \n                        \n                        Union Budget\n                    \n                            /                      \n                        \n                        Monsoon",
        "headline_1": "Demand distress: On slowdown in the overall IIP",
        "headline_2": "Rural demand might yet pick up during the festival season",
        "link": "https://www.thehindu.com/opinion/editorial/demand-distress-on-slowdown-in-the-overall-iip/article69760107.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-07-2025"
    },
    {
        "full_article": "From sea to shining sea, America sees the Don of a new era \nSecond Opinion was granted an exclusive interview with the White House.\nSecond Opinion: Mr President, thank you so much for… \nWhite House (interrupting): Drop this Mr President crap. Call me by my new title, Mr Permanent Resident.\nSO: But doesn’t making yourself the Permanent Resident go against the Constitution?\nPR: Heck, no, There’s nothing wrong with my constitution. Cholesterol, BP, all great.\nSO: I meant the Constitution of US, the Bill of Rights, and all that. \nPR: The heck with the Bill of Rights. Don’t you know that two rights make a wrong.\nSO: I think it’s two wrongs that don’t make a right… \nPR: Rights, wrongs, what’s the diff? Anyways, I’m having a ball with my new sidekick Bibi in Tel Aviv as side by side we kick ass in Iran. \nSO: What happened to your sidekick, Elon? \nPR: He turned out to be a softie, a real Musk melon. So I took him aside and kicked his ass. \nSO: But mightn’t all this sidekicking in Iran lead to World War III? \nPR: World War III? I didn’t know that there’d been I and II. But a good sequel will sure make me a bomb.  \nSO: I think World War III will involve bombs of a different sort…But tell us how your plans to make America great again are coming along. \nPR: They’re coming along real swell. Time is making me the Man of the Era. \nSO: Wow! That’s wonderful. When did that happen? \nPR: It happened right after I made Time the MAGAzine of the Era. But now you’re gonna have to excuse me. I gotta go and ICE some illegal immigrants, like this bimbo who was smuggled in from France or someplace, and is carryin’ on about huddled masses yearnin’ to  breathe free.\nSO: You’re deporting Liberty? \nPR: Yeah, the Statute of Liberty… \n\n",
        "headline_1": "Trump it all",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/trump-it-all/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-07-2025"
    },
    {
        "full_article": "Who’ll succeed the current Tibetan spiritual head & how the selection will work are huge geopolitical issues\nThis week, the Dalai Lama is expected to reveal his plans about his successor. While it’s still not clear whether he will anoint a successor or simply reveal a framework to select the next Dalai Lama, the geopolitical implications are huge. The spiritual authority that the Dalai Lama commands in Tibetan life is great. China knows this, and therefore, hasn’t tried to foist its own Dalai Lama on the Tibetan people all these years, even with the Dalai Lama in exile in India since 1959. Beijing is waiting for the right opportunity to capture the important Tibetan institution once the current Dalai Lama passes away. \nThat opportunity will present itself if the traditional selection method is followed as per the principle of reincarnation. This is because once the Dalai reincarnate is identified – usually a young boy – there is approximately a 20-year gap when he is groomed to take over as the next Dalai Lama. China will certainly not wait that long and install its own Dalai appointee at Lhasa’s Potala Palace. \nBut there’s an important weapon in the current Dalai Lama’s arsenal – legitimacy. Combined with his earlier statement that ‘emanation’ too could be a mode of succession of the Dalai, this opens the possibility that a successor could be chosen within his lifetime. The Dalai has also been clear that his successor will be born in the free world outside China. Theoretically, it is possible that the next Dalai could be identified in India’s Tawang where the sixth Dalai Lama was born. However, that could create another friction point in India-China relations with a Dalai Lama in each country.\nMeanwhile, if Xi Jinping is looking to extend his tenure at the helm of the Chinese party-state at the 2027 Chinese Communist Party Congress, this political confrontation over the Dalai Lama is precisely what he will relish. With China’s control of Tibet, he holds the upper hand. And installing a Beijing-selected Dalai Lama carries little risk compared to other options to increase his macho appeal: for example, a military campaign against Taiwan. But US too is a player here. US Congress recently introduced a bipartisan resolution that reaffirms only the Dalai Lama can select his successor, rejecting any interference by Beijing. India and US may also coordinate on the Dalai selection process when the time comes. Tibet, therefore, is poised to return to the heart of geopolitical powerplay.   \n\n",
        "headline_1": "The next Dalai Lama",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-next-dalai-lama/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-07-2025"
    },
    {
        "full_article": "Fixing air quality is not as easy as scrapping old vehicles. But govt’s gone for the short cut\nNew York schoolteacher Irv Gordon drove his 1966 Volvo P1800S 51L km before his death in 2018. German Gunther Holtorf drove his 1988 Mercedes G-Class around the world – altogether 9L km – over 26 years. Neither US nor Germany has a mandatory vehicle scrappage rule. In fact, the average age of cars in US has risen from 9 years to 14 years since 2000. But India has made compulsory vehicle scrapping a pillar of its clean air policy, and starting yesterday, diesel vehicles older than 10 years, and petrol vehicles older than 15 years aren’t being sold fuel in Delhi. \nAgreed, vehicles that shouldn’t be on the road shouldn’t be fuelled. But govt diktats have costs – fuel station staff will spend time monitoring 62L registration plates, arguing with vehicle owners, and possibly getting manhandled. So, one must ask, what’s the point? If the goal is to clean up Delhi’s air, removing old vehicles won’t make a significant dent. Yes, studies have shown that vehicles are responsible for over 50% of pollutants in Delhi’s air, but that’s largely due to the nature of stop-and-go traffic. All vehicles – new or old – pollute more in these conditions. The solution is to have fewer vehicles on the road, but that can’t happen without comfortable and dependable public transport, and safe pedestrian and bicycle paths.\nUS air quality has improved tremendously since 1980 despite the increase in average vehicle age. That can happen only when govts look beyond the low-hanging fruit of vehicle scrappage. Prioritising vehicle maintenance over age, for example. How can Delhi’s air be clean if 35% of its pollutants enter from neighbouring districts? Industry, mining, agriculture, deforestation, all affect air quality, but they can’t be fixed with the stroke of a pen. \n\n",
        "headline_1": "Exhausting policy",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/exhausting-policy/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-07-2025"
    },
    {
        "full_article": "Back from an official visit to Ladakh, FM Nirmala Sitharaman writes what struck her most were the extraordinary vibrant colours & the sense of calm\nA  few days ago, I returned from an official tour to the Union Territory of Ladakh as part of the GOI’s ‘Vibrant Village’ initiative. The aim of the tour was to visit the village of Hanle, nestled at an altitude of 14,700 feet, to understand the specific challenges that people face in this border village.\n\nThe first thing one observes and feels upon landing in Ladakh is its unique landscape – the rugged hills, valleys, vast grasslands and daunting wilderness are breathtaking.\nRead the full story on TOI+.\n\n",
        "headline_1": "‘Finding meaning in ever changing skies’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/finding-meaning-in-ever-changing-skies/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-07-2025"
    },
    {
        "full_article": "In a world increasingly shaped by algorithms, decision-making is stripped of human nuance. From predictive policing to hiring processes and social media content moderation, algorithms promise efficiency, scale, and objectivity. However, as these systems assume a greater role in shaping outcomes, they introduce a post-human condition where machines, not humans, are increasingly entrusted with life-altering decisions. The real question is: what is lost when empathy, reflection, and ethical reasoning are sidelined in favour of data-driven speed?\nThe promise of algorithmic decision-making lies in its precision. Yet, as scholars like Safiya Noble, author of Algorithms of Oppression, and Cathy O'Neil, author of Weapons of Math Destruction, highlight, these systems—far from being neutral—often reinforce existing social biases. Noble demonstrates how search engines propagate racial stereotypes, while O'Neil exposes how risk models in law enforcement and education disproportionately target marginalised groups. These aren't merely data errors; they are symptoms of flawed assumptions about fairness, often embedded within the algorithms themselves. In the post-human condition, these biases are perpetuated not by human malice but by automated systems that replace human decision-making without accountability.\nTo address this, anthropologist Genevieve Bell introduced anthrorithms, a counter-model of reasoning that privileges human experience, ambiguity, and moral consideration. Unlike algorithms, which optimise for efficiency and predictability, anthrorithms pause for reflection. They resist the urge to reduce human lives to data points, acknowledging that logic cannot capture ethical judgement. In a world that increasingly privileges machines, anthrorithms challenge us to retain our human responsibility to question, reflect, and care.\nAlgorithm vs anthrorithm: A quick contrast\n\nThis divide mirrors the historic gulf between science and the humanities, which CP Snow once described as \"two cultures.\" Today, however, the stakes are much higher. In the face of climate collapse, surveillance capitalism, and digital inequality, the boundaries between the technical and the ethical, the computational and the human, are more fluid than ever. As historian Dipesh Chakrabarty argues, global crises demand a reconciliation between the scientific and the ethical, between the analytic and the interpretive. In this light, the rise of machine-driven decision-making is not simply a technological issue, but a cultural and ethical one that calls for more than just computational accuracy—it demands a human-centred reflection on what counts as justice.\nAlgorithms excel at replication—they detect patterns, optimise decisions, and predict behaviour. Yet, they cannot fathom the complexities of human lived experience, nor can they account for moral nuances. As we cede more and more of our decision-making processes to machines, we are faced with the reality of a post-human condition, where the human element is not just sidelined but replaced. This shift is evident across various domains.\nConsider predictive policing, where algorithms use historical crime data to predict where crimes are likely to occur. While seemingly objective, these systems often reinforce existing racial and class disparities. The data used to train them reflects historical patterns of discrimination, perpetuating the same biases in new, automated forms. Similarly, in hiring algorithms, candidates are assessed based on keywords or past hiring patterns, yet these systems often fail to recognise the value of lived experience, diversity, and human potential. In both cases, algorithms make decisions with cold efficiency, but they fail to reflect the ethical complexities inherent in human lives. Anthrorithms, in contrast, would pause to ask: who benefits from these systems, and who is left out?\nIn healthcare, algorithms are used to calculate risk scores for patients. These tools often rely on data from insurance companies, which may overlook the social determinants of health like poverty, systemic racism, and access to care. The algorithmic model may provide an efficient answer, but it fails to address the root causes of disparities in health outcomes. An anthrorithmic approach would not only consider the clinical data but also the context in which individuals live and the systemic inequalities they face.\nIn all these cases, algorithms provide clarity—but at the cost of context. They offer certainty, but without accountability. They are designed to optimise, but they cannot engage with the ethical dimensions of their decisions. This is the crux of the post-human condition: algorithms can process information with unmatched precision, but they cannot ask whether their decisions are just. This is where anthrorithms step in: they prioritise ethical hesitation over automated certainty, insisting that the responsibility for judgement cannot be outsourced to machines.\nIn practice: Algorithm vs anthrorithm\n\nThis intersection of algorithm and anthrorithm is where we must confront the limitations of technology. Algorithms offer clarity, but they are ultimately products of the data they are trained on, and that data is often as flawed as the systems that generate it. While algorithms may be optimised for speed and accuracy, they cannot reflect the lived realities of human beings, nor can they bear the ethical burden of their decisions. It is here that anthrorithms offer a critical intervention: they demand that we engage with the messy, contradictory, and often painful truths of human existence.\nThe rise of algorithmic systems is not limited to the Global North. In the Global South, digital systems are often introduced through development initiatives or corporate agendas, with little regard for local context or social equity. In countries with weak regulatory frameworks, algorithms can be used to surveil entire populations, perpetuating neocolonial control over data. Anthrorithmic thinking demands a more equitable approach, where communities are not just subjects of data collection but active participants in defining the ethical contours of digital systems.\nGlobal development programmes using biometric IDs or credit scoring systems may promise inclusion, but they often exacerbate inequalities by marginalising communities that lack access to digital infrastructure. Anthrorithms push back against this datafication, urging for justice in how technology is deployed. This is not just a technical issue; it is about who gets to define the rules, who gets to participate, and who gets excluded.\nTo create a just and ethical society, we must integrate anthrorithms into our technological frameworks. This doesn't mean rejecting algorithms, but rethinking how they are used. Algorithms must be held accountable, and their limitations acknowledged. The human element—the capacity for reflection, care, and responsibility—must remain central in decision-making, even as machines become increasingly sophisticated.\nThe solution is not to eliminate technology but to humanise it. Anthrorithms invite us to pause and reflect: what are the implications of these decisions? Whose interests are being served? Are we, in the name of progress, reinforcing old patterns of exclusion and injustice? These are not just ethical questions; they are existential ones. In the post-human condition, the challenge is not simply about better algorithms, but about ensuring that these systems are held accountable to human values, ethical judgement, and social justice.\nIn an age where machines increasingly make decisions about our lives, the most radical act may be to refuse to abdicate our ethical responsibility. Anthrorithms offer a path forward, insisting that technology must serve humanity, not replace it.\nDr Faridul Alam, a retired academic, writes from New York City, US.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The ethics of machine judgement and the post-human condition",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-ethics-machine-judgement-and-the-post-human-condition-3929926",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-07-2025"
    },
    {
        "full_article": "Returning to Dhaka last September after five years abroad, I was simply searching for a modest, functional, and affordable cabinet. But as I wandered through the bustling alleys of the Mirpur Stadium furniture market, I found myself entangled in a complex narrative woven from timber, class aspirations, and ecological politics. Amid rows of polished wood and lively chatter, one term repeatedly caught my ear: Jessore teak. It mimicked the elegance of real teak (segun) but was far cheaper. When I asked what tree it came from, most were unsure, until an elderly shopkeeper disclosed the truth: Jessore teak is actually akashmoni (Acacia auriculiformis and Acacia mangium), a fast-growing species that matures in a decade and thrives where little else does.\nMore than clever marketing, this wood embodied an entire ethos: a way for ordinary people to furnish homes, build poultry and livestock sheds, or secure microloans in a constrained economy. But just as this quiet ecosystem of livelihoods had stabilised, it was abruptly disrupted. In May, the government banned both acacia and eucalyptus, citing ecological harm. The decision left growers, carpenters, and consumers in limbo, destabilising a forestry economy built over decades.\nExotic trees are not new to Bangladesh. Teak (Tectona grandis) was introduced by the British colonial administration but remained confined to state forests for a long time. The real expansion came in the 1980s through social forestry programmes, supported by NGOs and later the Forest Department. Lacking fast-growing native alternatives, acacia and eucalyptus were promoted for their rapid growth, resilience in poor soils, and ease of maintenance, particularly in degraded areas, along embankments, and in roadside plantations. These species quickly established themselves, spreading from public lands to private homesteads, offering both green cover and economic benefits.\nHowever, this success came with ecological trade-offs. As non-native species, they contribute relatively little to local biodiversity and have been criticised as \"water-hungry.\" Eucalyptus, in particular, is often accused of depleting soil moisture and releasing allelopathic toxins through its leaf litter. Yet much of this criticism is based more on public perception and environmental activism than on rigorous science. Peer-reviewed research from Bangladesh remains limited. Globally, findings are mixed: some studies suggest eucalyptus aids reforestation on degraded soils, while others warn of its hydrological and allelopathic impacts. Nevertheless, negative media coverage and activism have shaped public opinion, prompting the Forest Department to halt eucalyptus planting on public land since 2007, although private cultivation has continued.\nThe recent ban, however, goes further, prohibiting not just the plantation but also the transport and sale of both acacia and eucalyptus. Responses have been mixed. Rural communities that relied on these trees for furniture, fuelwood, income, and construction now face sudden precarity. Foresters, too, have questioned the rationale behind equating acacia with eucalyptus in a blanket ban. Acacia, a nitrogen-fixing species from the Fabaceae family, is often used to rehabilitate barren land and support mixed-species plantations. In marginal areas, it plays an important role in expanding green cover and meeting household needs. Allegations that acacia pollen causes asthma remain unsubstantiated, with forestry experts pointing to a lack of credible studies.\nAt first glance, the ban may seem like a bold ecological pivot. But on closer inspection, it reveals a deeper flaw in Bangladesh's environmental governance: the tendency to implement sweeping decisions without rigorous research or inclusive dialogue. Despite decades of widespread planting, methodologically sound studies evaluating the long-term ecological impacts of these species remain rare. If these trees are now deemed harmful, why were they so aggressively promoted in the first place? Where are the baseline trials? Who is held accountable?\nThis sudden reversal illustrates what political theorist James C Scott termed the synoptic impulse: the state's tendency to simplify complex realities into legible, administratively manageable forms. In the 1980s, the state promoted eucalyptus and acacia as miracle solutions. Now, it seeks to erase them with a single decree. In both cases, local complexities and ecological nuance are sacrificed for the promise of a uniform, scalable fix.\nMy conversations with villagers in Khulna and Chattogram reveal widespread frustration and confusion regarding the blanket ban. These trees are deeply embedded in rural economies—used for firewood, furniture, and even as collateral. Yet the ban was enacted without consultation, excluding those most affected: farmers, nursery owners, women who gather fuelwood, and entire communities reliant on these species. Even more troubling is the apparent class bias: teak, a slow-growing species favoured by the wealthy for high-end furniture, remains exempt—despite its well-documented ecological impacts, including soil degradation and allelopathic effects. Once again, the burden of \"ecological correction\" falls disproportionately on the rural poor—particularly those who followed state-backed guidance and now face penalties—while the wealthy remain untouched.\nThe government's recent shift towards promoting \"indigenous fruit, medicinal, and timber species\" is a welcome move from the perspective of ecological restoration. However, based on past experiences, I remain wary of the risk of reproducing new monocultures—whether orderly rows of mahogany (also an exotic) or rain trees—neither of which meaningfully contributes to biodiversity. Even fruit tree culture has undergone significant transformation. What were once seed-grown, community-nurtured orchards—mosaics of mango, jackfruit, java apple, custard apple and black plum that supported rich biodiversity and fostered an ecosystem of care and support—have been replaced by a few fast-yielding clonal shrubby varieties that lack both ecological richness and cultural resonance. Today's fruit trees are smaller, more susceptible to disease, and less hospitable to birds and pollinators. This shift reflects a forestry paradigm that prioritises market efficiency over ecological resilience and cultural heritage. \nMoreover, it remains unclear whether the ban adequately considered the carbon sequestration potential of these fast-growing species, or whether it was grounded in robust and methodologically sound environmental assessments.\nYet within this rupture lies a space for possibility. The ban reopens the conversation on how forestry can be reimagined—diverse, participatory and grounded in lived realities. But meaningful change requires more than symbolic gestures. It demands institutional support for those affected: subsidies, compensation, access to credit, and above all, humility in policymaking.\nInstead of a blanket ban, a more context-specific approach would involve zoning: identifying where these fast-growing species can be safely cultivated and where they should be restricted. But guidelines alone are not enough. A robust monitoring system involving forest officials, local administrations, and community members is essential to ensure adherence to zoning rules. Without such participatory oversight, even the most well-intentioned policies may falter.\nIn Bangladesh, trees are never just trees. They are instruments of state control, markers of class aspiration, and pillars of survival. Eucalyptus and akashmoni once symbolised progress; now they represent excess. Teak exudes elite distinction; \"indigenous\" species invoke nationalist pride. What is needed is not a binary of \"good\" versus \"bad\" species, but an inclusive, reflexive forestry model—one that recognises past errors, embraces ecological complexity, and shares both risks and benefits more equitably.\nDr. Mohamed Abdul Baten specialises in environmental policy, resource governance, and neoliberal impacts on marginalised communities and is a faculty member at North South University.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Banning trees to save nature? Rethinking Bangladesh’s exotic tree policy",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/banning-trees-save-nature-rethinking-bangladeshs-exotic-tree-policy-3929921",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 02, 2025 00:00:00  \nThe surge, as reported, in the remittance inflow from Bangladesh's expatriate workers in the last fiscal year (20024-25) that has broken all past records could not have come at a better time. In fact, the total amount of remittance over the entire period of FY'25 that crossed US$31 billion marking an increase by 25.50 per cent compared to that of the previous fiscal (FY24) at US$23.74 billion speaks volumes for the confidence that the hard working remittance earners have in the government that replaced the autocratic regime of the past through the July-August, 2024 popular uprising. There is no denying that the stringent measures that the incumbent interim government adopted to curb illegal informal channels including the so-called 'hundi' of money transfer as well as introduction of a more market-oriented exchange rate regime have played a positive role in achieving this positive outcome. Admittedly, the financial incentives offered to encourage the expatriate workers to send their remittance through official channels did play their part in the rise of the volume of remittance inflow.\nThis is obviously an occasion to celebrate as the hard-earned remittance money will go to bolster the country's foreign exchange reserves and contribute to maintaining macroeconomic stability and managing external debt. It is not only the government's hard currency hungry foreign currency account that the enhanced remittance earning will serve, the money will also improve financial conditions of the recipient families. But as the boost in remittance inflow is not simply a matter of government policies or the mere goodwill of the migrant workers, the present level of remittance inflow cannot be taken for granted. Numerous factors including the policies of the host governments on migrant workers, bilateral relations between governments -- the host government and migrant workers' country of origin, international politics, behaviour of the global foreign exchange market at a given time etc.; determine the rate of remittance.\nSo, it would be wise to shift the attention to other important issues that the policymakers have always given short shrift to. Even as the remittance earners as a community in general are showered with words of praise from the government, the Press and the intellectual class for the yeoman service they have been rendering to the nation, the total outlook changes as soon as they are faced with an individual remittance earner. A not-so-impressive-looking migrant worker, often having her/his origin in the countryside, obviously fail to claim the attention they deserve from the smart, educated, and mostly urbane officials of the foreign missions or those at home.\nAn immediate outcome of this indifferent attitude of the foreign mission officials towards the migrant workers from their home country is that the officials of the host government or the private sector employers of that country, too, find no reason to be kind to those migrant workers in question. To break this vicious circle of apathy and neglect towards the hapless migrant workers, the government at home needs to play a very proactive, attentive and protective role. On this score, the government should learn from how aggressively other manpower exporting countries deal with the host governments when it comes to the cause of their nationals abroad. The government, at the same time, should pay attention to easing the travails the overseas job-seekers undergo at every step of their journey abroad. High amounts they are charged by the recruiting agencies, the agents of overseas employers, as part of various documentation fees, must be reduced to the bare minimum. To start with, the government should initiate a hassle-free one-stop service for overseas job-seekers.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Easing travails of overseas job-seekers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/easing-travails-of-overseas-job-seekers-1751383050",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       July 02, 2025 00:00:00  \n\nWith the advent of the monsoon, the prevalence of dengue fever in the capital and other regions of the country has once again emerged as an all-too-familiar concern. Regrettably, this recurrence is not merely seasonal -- it is symptomatic of the persistent lack of a systemic and sustainable strategy to combat the mosquito-borne disease. Despite the known risks, there has never been a well-coordinated effort on the part of the authorities to decisively address the threat of dengue.\nReports from across the country, including Dhaka, indicate that the dengue situation has taken a serious turn. In the capital alone, hundreds have recently fallen ill, with a significant number requiring hospitalisation this month. Although the current situation might not yet be deemed alarming, past experiences remind us how swiftly things can escalate. Dengue outbreaks in previous years have demonstrated the disease's potential to spiral into a full-blown health emergency within weeks.\nAccording to the Directorate General of Health Services (DGHS), the total number of deaths from dengue this year has already reached 29, with confirmed cases standing at 5,739 since January. The most recent fatality was reported from the Chattogram Division, outside the city corporation areas. The latest figures further reveal that the Barishal Division saw the highest number of new dengue cases (101), followed by Chattogram Division (28), Dhaka Division excluding the city corporations (5), Dhaka South City Corporation (19), and Dhaka North City Corporation (16). As of Saturday morning, 633 dengue patients were undergoing treatment in hospitals across the country.\nLast year marked the worst dengue outbreak in Bangladesh's history. The country recorded 101,214 confirmed cases and 575 fatalities -- an unprecedented prevalence. Such staggering figures underscore the urgency of a more serious and scientific approach to combating this recurring menace.\nA decade ago, when dengue first took a heavy toll nationwide, the healthcare system -- both public and private -- was largely unprepared. Medical facilities were inadequate, contributing to the higher deaths. While the situation in urban areas has somewhat improved since then, casualties still occur, particularly in smaller towns and rural regions. In these areas, a combination of poor awareness and limited access to timely medical care exacerbates the crisis. Experts also note that children, especially minors, are particularly vulnerable, with a higher fatality rate among them compared to adults.\nDespite the recurring nature of dengue outbreaks, awareness campaigns and mosquito eradication drives are glaringly absent in urban centres like Dhaka. This neglect is deeply concerning, especially as the monsoon intensifies. The risk of dengue reaching epidemic proportions looms large, and already, a few fatalities have been recorded in the capital. Unfortunately, both Dhaka South and North City Corporations appear to be passive observers. There is little visible activity in the municipal wards to raise public awareness or to carry out anti-mosquito measures. \nFrustration is mounting among citizens and public health professionals alike as the authorities continue to rely on the same outmoded methods of mosquito control. These conventional approaches not only lack innovation but have also been repeatedly proven ineffective. In a recent conference held in the capital, entomologists described the city corporations' current strategies as unscientific and even counterproductive. They argue that these measures may actually be contributing to the surge in cases.\nThe most commonly used method - fogging -- is particularly under scrutiny. Experts have warned for years that fogging is largely ineffective in controlling Aedes aegypti, the mosquito responsible for spreading dengue. These mosquitoes typically breed in clean, stagnant water found in household containers, not in the drains or sewers targeted by fogging. At best, fogging can eliminate only about 20 per cent of the mosquito population and does little to address the root of the problem.\nMoreover, ad-hoc solutions like importing Bacillus thuringiensis israelensis (BTI), a bacterium used to control mosquito larvae, are unlikely to yield long-term results. Without a proper understanding of the local environment and mosquito ecology, such interventions risk being not only ineffective but also potentially hazardous. Experts cite the example of Kolkata, where a scientifically coordinated, community-based mosquito control programme -- designed by entomologists and health professionals -- has shown success in containing dengue.\nThe question is, why has Bangladesh not adopted a similarly science-based approach? The answer points to a systemic failure of governance and institutional inertia. It is now evident that our health institutions lack the data, research infrastructure, and, most worryingly, the will to collaborate with experts in entomology, epidemiology, and urban planning. The absence of a comprehensive, research-informed action plan reflects total disconnect between policymaking and ground realities.\nIt is imperative that the government urgently bring together a multidisciplinary taskforce comprising doctors, entomologists, public health specialists, city corporation officials, urban planners, and civil society stakeholders. Such collaboration is essential to design both immediate interventions and long-term strategies to control and eventually eliminate dengue. Efforts must be made to understand transmission patterns, evaluate the efficacy of the current control methods and pilot new technologies for vector control.\nAbove all, science -- not bureaucracy -- must guide the country's response to this escalating public health threat. Traditional, reactive approaches have failed us repeatedly. The time has come for proactive, data-driven strategies and to follow international best practices. The fight against dengue can no longer be managed by cosmetic efforts. It demands urgency, innovation, and above all, political will.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Dengue's return : A public health crisis revisited",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/dengues-return-a-public-health-crisis-revisited-1751383148",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 02, 2025 00:00:00  \n\nIn Bangladesh, Islamic microfinance has become an essential instrument for empowering female entrepreneurs, especially in the social and familial contexts that frequently influence their business ventures. Women who might otherwise be reluctant to interact with traditional financial systems will find this model more acceptable because it is in line with Islamic principles, which place an emphasis on social responsibility and ethical financing. Profit-sharing and interest-free loans are two of Islamic microfinance's distinctive features that address the needs of women by enabling them to access capital without having to worry about interest, which is frequently a barrier in traditional microfinance. Islamic microfinance provides a supportive framework that promotes female entrepreneurship in Bangladesh, where cultural norms may limit women's economic participation. Since they are frequently viewed as the primary caregivers, women's participation in business can benefit both community development and family welfare. Islamic microfinance institutions can assist women in overcoming the obstacles of entrepreneurship, including restricted access to resources and social expectations, by offering customised financial products. In addition to increasing women's economic independence, this financial assistance promotes their sense of agency and empowerment.\nFurthermore, it is important that Islamic microfinance be accepted in the family setting. When women's business endeavours are presented within an Islamic financial framework, families that uphold Islamic principles may be more willing to encourage them. Increased family support can result from this acceptance, which is important for female entrepreneurs who frequently encounter opposition from male family members. The social environment in Bangladesh is also very important; when women in business succeed, they can challenge gender norms and encourage other women in their communities to follow in their footsteps.\nBeyond empowering individuals, Islamic microfinance has the potential to support Bangladesh's larger socio-economic development objectives. Communities can gain from more economic activity, the creation of jobs, and higher living standards when they invest in women-led businesses. Additionally, when female entrepreneurs succeed, they can reinvest in their communities and families, fostering a positive cycle of empowerment and growth. \nMd Nahid Gazi, Dhaka\nnahid.gazi@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Microfinance model for women entrepreneurs",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/microfinance-model-for-women-entrepreneurs-1751383181",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 02, 2025 00:00:00  \n\nAs businesses move towards cashless systems and digital payment platforms dominate the market, a growing portion of the population is being quietly pushed to the margins. While the shift to digital payments is often celebrated as \"modernisation,\" its unintended economic consequences, especially for low-income communities, are rarely discussed.\nNot everyone has access to bank accounts, mobile wallets or reliable internet. In many areas, especially among the elderly, daily wage earners and rural workers, cash remains the only reliable method of transaction. Yet, more and more shops, transport services and even hospitals are going fully digital, refusing cash outright. This leaves many people unable to participate in the economic activities. \nBeyond exclusion, digital payments often come with hidden costs: transaction fees, minimum balance charges and data collection that feeds targeted marketing. For someone living paycheck to paycheck, these small fees and forced digital dependencies are real burdens. The shift also empowers tech companies and banks, giving them control over transaction data and spending patterns, while the individual loses both privacy and flexibility. This growing digital divide isn't just a technology gap, it's an economic one. Policymakers must ensure that digital progress does not come at the cost of access, affordability and autonomy. Cash must remain a valid option and financial tools should be inclusive, not predatory. True modernisation includes everyone, not just those with a smartphone.\nYana Islam Rifa\nBachelor of business Administration \nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Going cashless limits choices for the poor",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/going-cashless-limits-choices-for-the-poor-1751383201",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-07-2025"
    }
]