[
    {
        "full_article": "What United States President Donald Trumpdid to global trade on April 2, 2025 in Washington closely mirrors a disruptive precedent set by President Richard Nixon in 1971. On August 15, Nixon stunned the world by announcing the “temporary suspension” of the U.S. dollar’s convertibility into gold. This effectively dismantled the Bretton Woods framework that was worked out quite unilaterally in 1944, which led to the setting up of the World Bank and the International Monetary Fund, and provided an anchor for global currency stability — an avenue to address balance of payments crises, and to finance the reconstruction efforts of former colonial powers. Though announced as a temporary move, it became permanent and upended the global financial system, as nations reckoned with a new era of financial market volatility. Similarly, Mr. Trump’s reciprocal tariffs have instantly ushered in global economic uncertainty, the full extent of which will be felt in the months and the years ahead. By unilaterally altering trade relationships, he has disrupted the very system of interconnected global commerce that the U.S. helped build in the post-war era.The international reaction has been one of shock and concern. The U.S. is the world’s largest importer of manufactured goods, accounting for about 13% of global imports in 2023. The new tariffs will reroute supply chains and force countries to diversify their export strategies. In the immediate term, the cost of imports will rise for American consumers, leading to reduced demand. The ripple effects will be global, causing production slowdowns as exporters scramble to find alternative markets. Economies such as China, Japan, India and the European Union are likely to experience a temporary decline in economic growth. Yet, unlike in the Nixon era, the U.S. today holds a diminished position in global trade. In the 1970s, it was the world’s dominant trader, with an estimated 13%-15% share of global trade. China’s presence was negligible at the time, accounting for less than 1%. Today, China commands the largest share of global trade, at around 14%, while the U.S. has slipped to roughly 10%. The international community also accepted the dollar’s supremacy in the 1970s because of America’s overwhelming economic and technological dominance. Now, although the dollar remains the preferred reserve currency, the centre of economic gravity has shifted. The world’s leading exporters of advanced technologies are now China and other Asian powers, including South Korea, Japan, and Taiwan. Thus, Mr. Trump’s turn to protectionism — an attempt to regain American economic dominance — may well hasten the country’s retreat from its hegemonic position. Published - April 05, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        currency values\n                    \n                            /                      \n                        \n                        finance (general)\n                    \n                            /                      \n                        \n                        manufacturing and engineering\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Japan\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        European Union\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        South Korea\n                    \n                            /                      \n                        \n                        Taiwan",
        "headline_1": "American retreat: On Trump’s turn to protectionism",
        "headline_2": "The U.S. risks ceding its position as a global economic powerhouse",
        "link": "https://www.thehindu.com/opinion/editorial/american-retreat-on-trumps-turn-to-protectionism/article69413177.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "06-04-2025"
    },
    {
        "full_article": "The issue of defections in Legislative Assemblies has become a vexed one in public life in recent years. Ruling parties — the Bharatiya Janata Party in particular — have adopted an unabashed approach to augment their legislative support by encouraging defections. A commonly used modus operandi — used egregiously in Manipur in the late 2010s and later in Maharashtra — involves the Speaker, invariably from the ruling party, sitting on disqualification petitions from Opposition parties against legislators who have defected. Some defectors have even been sworn in as Ministers, pending adjudication on their party-switching by the Speaker. Many States have seen the unedifying sight of mass defections to the ruling party just after elections, making a mockery of the democratic exercise. The latest is the situation in Telangana where the petitions filed by the Bharat Rashtra Samiti (BRS) in March-April 2024, to disqualify 10 of its legislators who defected to the Congress, were notified by the Speaker only in January this year. The Supreme Court, hearing a petition by the BRS seeking timely action by the Speaker, has rightly observed that it was not “powerless” if a Speaker chose to remain indecisive. Justice B.R. Gavai’s observation that the courts cannot tell a Speaker how to decide, but that they could ask the Speaker to decide within a reasonable period, is a rational one.A five-judge Constitution Bench, in May 2023, had reposed its faith in the Speaker’s “propriety and impartiality” to decide on defections, but “within a reasonable period”. Flowing from this judgment, the Court had, in October 2023, fixed a deadline for the Maharashtra Speaker to decide defection pleas from the Opposition after the undue delay by him in hearing them. Yet, the issue is persistent. This is inevitable as Speakers are invariably elected from ruling parties and rarely act in a non-partisan manner, despite the expectation that they will do so. In 2020, the Court had asked Parliament to amend the Constitution to strip Legislative Assembly Speakers of their exclusive power to decide upon whether legislators should be disqualified or not under the Tenth Schedule which frames the anti-defection law. It had also asked for an independent tribunal, instead of the Speaker, to be appointed for the task. No such action has been taken by Parliament since then and the problem of defections going unaddressed by Speakers within a reasonable time frame persists. If the Court forces the hand of the Speaker in Telangana, it might be one more blow for decisive action. But the scourge of defections and how it is dealt with will remain as long as voters do not punish those who indulge in such practices. Published - April 05, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Manipur\n                    \n                            /                      \n                        \n                        Maharashtra\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        Bharat Rashtra Samithi\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        Telangana",
        "headline_1": "​Taken to task: On the Supreme Court and defections",
        "headline_2": "The Supreme Court is right in pushing Speakers to act decisively on defections",
        "link": "https://www.thehindu.com/opinion/editorial/taken-to-task-on-the-supreme-court-and-defections/article69413196.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "06-04-2025"
    },
    {
        "full_article": "The recent boom next to my workplace at MIT has brought in a number of restaurants that offer healthy food for busy people. The menu is generally Mediterranean inspired, but with their own little twists. The protocol is always more or less the same: choose a grain, something high on nutrients like farro or brown rice or the ubiquitous quinoa. Then the greens, arugula or mesclun, beans or chickpeas, your choice of protein, meatballs or falafel, dry little chunks of mildly spiced chicken breast or tofu, hummus or baba ganoush, and the obligatory avocado. All topped off by a choice of dressings, usually starring tahini and lemon.\nThe whole process — specifically choice at every step — stresses me out. What if I don’t want boiled soybeans today? Was the chicken breast really as bad as I seem to recall? The hungry faces of the folks behind me compel me not to dither, but as soon as I opt for something, doubt creeps in. Then there is the sticker shock at the end — did I really pay nearly Rs 1,500 for that? But most of all, I am troubled by the serving staff, hurrying to implement my expressed desires as fast as possible —“You said falafel, sir?” (I say yes, even though I seem to remember saying meatballs). Their stress infects me.\nWhen I sit down with my bowl, I feel compelled to gobble my food and get back to work. It crosses my mind that it might be the intended effect — this is, after all, a country founded by Puritans.\nThe production line seems carefully engineered — 20 seconds to put in the grains, 20 more for the greens, 30 seconds on the toppings to create the illusion of choice. There are scoops sized to deliver the right amount of grains, to not waste too much hummus and so on. They advertise specials — there might be, for example, a Freshness Bowl with falafel and farro — the recipes for those are neatly printed on colourful cards.\nAnd yet, perhaps unsurprisingly, the whole thing is a bit hit or miss. The recipe is on the card, but where is that damned card? The grain girl is a little too fast for the greens guy, so the bowls pile up. One tips over, cluttering the working area with stray farro that needs a cleanup. In the meanwhile, the faces of the busy people turn censorious. The serving staff senses that and gets doubly nervous. More errors happen.\nIt all reminds me of Charlie Chaplin’s masterpiece, ‘Modern Times’. If you have seen it (if you haven’t, it’s really worth it), you will recall the scene where Charlie is struggling to stay abreast of his colleagues on the speeded up production line, and finally the pressure gets to be too much and he runs amok. This is Chaplin’s dystopian vision of modernity, with its emphasis on efficiency above all.\nThe contemporary relevance of the film came home to me with the current discussion about whether Indians need longer work hours.\nL&T chairman S N Subrahmanyan argued publicly for a 90-hour work-week, including Sundays. In a remarkable recorded speech that went viral, he explained that he saw no reason to stay home when one could be at work: “What do you do sitting at home? How long can you stare at your wife? How long can the wives stare at their husbands? Get to the office and start working.”\nThis is a rather special view of the labour market. Subrahmanyan believes that his staff should want to work more hours, since home life is so boring. This does not seem to be a widely shared view. It is revealing, for example, to compare work hours as countries get richer. There is a recent 49-country data set put together by economists Alexander Bick, Nicola Fuchs-Schu¨ndeln, and David Lagakos and published in the prestigious American Economic Review, that tries to consistently measure the hours people actually spend at work (rather than the official hours). What is very clear from this study is that people in the poorest third of countries work 50% more hours than people in the richest third, despite the fact that hourly wages in richer countries are many times higher, so if making money was the only objective, workers should have been clamouring for more hours. In fact, labour movements in the now-rich countries have a long history of demanding less hours and more vacation.\nIt seems obvious that most people across the world see shorter and fewer work days as a part payoff from development. Or to put it the other way around, people in poorer countries work harder in part because they have little choice, at least if they want a reasonable standard of consumption. While working at least a few times a week is often preferred to not working, most people also want time to read and browse the internet, cook and go shopping, play with their children and take care of their parents, hang out with their friends and cuddle with their loved ones (and, perhaps, stare at their spouses).\nThere may also be health reasons to limit work hours, at least if the correlational evidence is to be believed: those who work more than 50 hours a week seem to be more likely to get hypertension and related ailments. More worryingly from Subrahmanyan’s point of view, the data suggests long hours don’t raise productivity much, largely because workers run out of energy at some point. Workers in a call center in the Netherlands had to work more hours on some days because the number of callers fluctuates, and when that happens, the central planning office asks them to stay longer. A recent study by economists Marion Collewet and Jan Sauermann finds when workers are assigned 10% extra hours, they take significantly less than 10% additional calls — productivity falls as the hours get longer. This is despite the fact most people in this firm work part time, so their work-day is closer to four hours. Fatigue is likely to be a bigger problem for those who already work long days and are being asked to do more. This is indeed what the literature finds.\nThe idea that you don’t add so much to output by adding hours is also consistent with the fact that average work hours in the US are 50% higher than those in Italy, Spain, Belgium, and France. Since the US is nowhere near 50% richer than those countries, Americans work many extra hours for relatively little extra production. Without trying to claim 20-20 hindsight, I do recall that when I arrived in the US, I was struck by the fact that my fellow-students made a virtue out of how hard they were working (“three all-nighters in a row”) in sharp contrast with the (annoying) Indian practice of ascribing good results to pure genius, unaided by any effort.\nHaving lived here for 40 years, I see that this emphasis on the appearance of hard work blights the lives of all too many Americans. They feel obliged to stay long hours at work to demonstrate that they are ‘serious’, even when there is not much to do. They sit at their desks and try to look busy, while clandestinely googling more interesting jobs, and take industrial lunch breaks, where the stressed looks of the line workers are echoed by the pinched faces of the eaters, straining across their avocado bowls to find something work-relevant to say to their colleague. When I first went to Europe in 1990 after being in the US, I was struck by the absence of this theater of diligence. Lunch time was to be enjoyed: many sandwich shops will sell you a little dessert with your stuffed baguette or ciabatta, and if you want, even a small bottle of wine. Going to lunch with my French colleagues was pleasant — idle chit-chat was permitted or even encouraged, unlike in the US — but also a little stressful, since they would happily drink their midday wine and head back to work, while my unaccustomed body craved a nap.\nOne of our gifts as South Asians, I feel, is our ability to create that same bonhomie without having to rely on alcohol or even a sit-down meal. I remember the clusters of office workers at lunch time around food vendors in Kolkata in the 1970s, in Dacres Lane or behind Writers Building, eating their precariously balanced lunches standing up, always joking, making fun of each other (and probably the absent bosses), and tasting each other’s food. Most jobs, then and now, come with a fair amount of tedium — it is that bonhomie, the sense of collective purpose and the feeling of having contributed, that makes it all bearable. Maybe Subrahmanyam’s quest to get people to stay longer would work better if the workplace was pleasant and relaxed, less about getting scolded for not doing enough, more about being appreciated for what you do.\nThis is part of a monthly column by Nobel-winning economist Abhijit Banerjee\n\nIllustrated by Cheyenne Olivier\nRECIPE: Here is an idea for all those packing lunches to take to work or school\nSavoury Polenta Cake with Spicy Tomato Sauce\nFor the cake, preheat the oven to 180 degrees C. Beat together ½ cup olive oil, 1½ cups yogurt, 2 eggs and 2 tbsp sugar until well mixed. Mix in 1½ tbsp minced fresh ginger, 1-2 finely sliced green chilies, 25 minced curry leaves and 6 thinly sliced green onions. Add 1½ cups polenta or coarse ground makai kernels that were previously soaked in water for 2 hours, 1 cup flour, 1 tsp baking powder, ½ tsp baking soda, ½ tbs salt and 1 tsp cumin powder and mix very well. Bake in a well-oiled baking dish for 50 minutes or until the top is brown and firm and a tester comes out more or less clean.\nFor the sauce, bring 4 cups of water to boil in a medium-sized saucepan and throw in 750 gm fresh juicy tomatoes. Remove after 45 seconds and put in cold water. The tomato skins should come off easily now. Chop up the flesh. Put a chhaunk of 1 tsp kalonji, 1 tsp fennel seeds and 1-2 green chilis in 3 tbsp oil. Once the seeds are sizzling and fragrant, add in 1 tbsp minced garlic. Cook the garlic for 2 minutes at medium-low heat and then add the chopped tomatoes and 1 tsp salt and raise heat slightly. Cook for 15 minutes until the sauce has reduced to about two-thirds of what you started with.\nRemove from heat and serve with the cake. If you want to add more protein, coarsely grate 200 gm paneer and add to the sauce for the last 2 minutes (add some extra salt).\n\nILLUSTRATION CREDIT: Cheyenne Olivier (France)\n\n",
        "headline_1": "Back to Modern Times: The new obsession with longer work days",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/a-nihilists-view/back-to-modern-times-the-new-obsession-with-longer-work-days/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-04-2025"
    },
    {
        "full_article": "Delhi and Beijing are holding their breath as their analytical frameworks for international politics are upended with each passing day. Having burnt its fingers in Ukraine, the US under Trump is attempting to extricate the West from its own folly. The unthinkable — a US-Russia détente — is within the realm of the possible. At any rate, the shift towards multipolarity is irreversible.\n\n\nStrategic Reset: Challenge is building a stable relationship despite power asymmetry\nA US less inclined to intrude into every aspect of the planet’s affairs is a positive development. Geopolitical peace will offer respite from the relentless and destructive western militarism since the late 1990s. The risk, however, is that the vacuum from a receding US might be filled by disruption and inertia. In particular, the global economy needs new stakeholders to offset the US’s de-globalisation policies. India and China have co-invested in such a framework. Initially envisioned as a modest down payment for an inclusive non-western alternative to the Washington-consensus model, BRICS Plus is now poised to play a frontline role in the multipolar era. But for this to occur, India-China relations need a clear turning of the page.\nLogic of a Rapprochement\n\nIt was during the unipolar moment that the dominant narrative on India-China relations turned towards an existential rivalry, largely fuelled by the West. India’s political leadership and strategic community too embraced the idea of it as a geopolitical lynchpin and a western sentinel in Asia. Not only was our foreign policy since the early 2000s restructured around this basic paradigm, but also the China policy. That framework is now obsolete. While the US will pursue transactional benefits from India, in the broader churning underway, the purported geopolitical significance once attached to India has lost its meaning in Washington. As a consequence, India has begun seeing itself less as a dispensable chip in western grand strategy and more as a major regional and future great power with national interests and objectives. Naturally, its China policy will evolve too.\nThe challenge is building a stable relationship with Beijing despite a comprehensive China-India power asymmetry, which will remain for several decades. The false US promise to alter the India-China setting in India’s favour must be replaced by enlightened realism. Our powerful and prosperous neighbour cannot be kept at arm’s length until some distant future moment when India is strong enough to dictate the terms of engagement. The ‘give and take’ has to occur during this prolonged phase of catching up. The onus is on China as well to adopt a revised India policy in light of the diplomatic revolutions afoot elsewhere. Priorities include stabilising the LAC to mutual satisfaction, resuming a serious conversation on resolving the border dispute, articulating innovative approaches to managing parts of the common neighbourhood including those areas where India and China might have similar interests, and, removing the subcontinent from future geopolitical contests between other great powers. Such an agenda is within the reach of both leaderships who already have a clear understanding of each other’s core interests and concerns.\nAs a late industrial economic power, Delhi had good reasons to pursue national capacity building. But where it faltered was by letting geopolitics come in the way of leveraging interdependence with leading economic centres. China did not let its geopolitical differences with the US come in the way of a bold globalisation strategy. The duality of its economic policies — keeping the door open while developing a robust domestic ecosystem and infrastructure — accounts for its spectacular economic transformation.\nTerms of Engagement\n\nFor India, the primary economic centre to be leveraged now is China. There is no way around this reality. It is not whether but how to economically engage China. What should be debated are the inter-sectoral trade-offs, the types of economic partnerships between Indian and Chinese economic actors, the extent of access to Chinese capital and technologies, and India’s participation in China-centred supply chains. These are sophisticated policy themes that require serious deliberation but were previously swept aside during the unipolar euphoria.\nFrom the Himalayan thaw at the 2024 Kazan BRICS summit to PM Modi’s recent remark that “for centuries, India and China have learned from each other,” both sides are signalling a cooperative and less adversarial narrative for the relationship.\nBut a mere thaw will not suffice. A modus vivendi for at least the next two decades is the prerequisite for Asia’s major powers to collaborate on stabilising, reforming and benefiting from the rapidly changing world setting. For India, the economic advantages and geopolitical peace on its periphery if a détente is executed intelligently are too vital to be stymied by naysayers. For China, a stable southern periphery, a more purposeful multilateral partner at BRICS, and an India that thinks and acts for itself in the geopolitical realm holds tremendous benefits. This is an opportunity that both leaderships should grasp.\n(Zorawar Daulet Singh is an author, most recently, of Powershift: India China Relations In A Multipolar World)\n\n\n",
        "headline_1": "Just a thaw is not enough, India and China need to turn the page on past",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/voices/just-a-thaw-is-not-enough-india-and-china-need-to-turn-the-page-on-past/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-04-2025"
    },
    {
        "full_article": "China has let loose a salvo in response to Trump’s tariff assault. Yesterday, it announced a 34% import duty on all US goods. This reciprocal tariff is at exactly the same rate as the one Trump had imposed on imports from China, on April 2. The world’s two largest economies, which are also the two largest trading nations, are now officially at trade war.\n\nRead full opinion on TOI+\n\n",
        "headline_1": "Gunfight that no one wins",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/gunfight-that-no-one-wins/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-04-2025"
    },
    {
        "full_article": "Trump’s ‘Liberation Day’ has become doomsday for global markets. Stocks are plunging big. Apple, Nvidia, Nike and other mega companies have lost hundreds of billions in value. World leaders are reeling between retaliation and reconciliation.\n\nRead full opinion on TOI+\n \n\n",
        "headline_1": "Tariffing Trump is America’s working class ‘hero’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/letterfromwashington/tariffing-trump-is-americas-working-class-hero/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "US’ new tariffs put BD on uncertain ground",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/us-new-tariffs-put-bd-on-uncertain-ground-1743861583",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Trump's trade blitzkrieg: Dhaka needs to explore options",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/trumps-trade-blitzkrieg-dhaka-needs-to-explore-options-1743861738",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Who wins tariff  war?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/who-wins-tariff-war-1743861782",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Scope of financial derivatives in BD",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/scope-of-financial-derivatives-in-bd-1743861795",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-04-2025"
    }
]