[
    {
        "full_article": "When decisions are based on the principle of natural justice, they serve a particular social purpose or aim to right a specific wrong. The National Organ and Tissue Transplant Organization’s (NOTTO) recent advisory, stating that women patients and relatives of deceased donors awaiting transplants will get priority as beneficiaries, walks the path of rewriting a gender trope. There is a gender skew as NOTTO’s decadal data (2013-23) indicates. As per NOTTO, in 2023, women constituted 63% of all living donor transplants, and yet they comprised between 24% (for heart) and 47% (lung) as beneficiaries of organs for transplantation. In kidney transplants, women were only 37% of the beneficiaries in 2023, while for liver, women’s share was 30%. For pancreas transplant, women totalled up to 26% of total beneficiaries. Analysis in the British Medical Journal showed that in the past five years, women contributed to 36,038 of the 56,509 living organ donations in India, and benefited from transplantation in only 17,041 cases. NOTTO, in its advisory, said the recommendation was an attempt to address the gender imbalance among organ transplant recipients; to make provisions for additional points in the allocation criteria for women patients in the waiting.While certainly laudable in what it sets out to do, this move could well be beset with procedural hassles. Currently, organ allotment protocols do not allow for prioritising any one recipient over another, except on grounds of health. There are, therefore, no provisions to prioritise women and/or near relatives of previous donors. Since the NOTTO advisory, questions have also been raised about whom the definition of ‘near relatives’ should include, and if all families involved in donating cadaveric organs for transplantation (since 1995) would be considered beneficiaries. The primary fear among implementers seems to be that this might become another backdoor way to facilitate out-of-turn allotments, particularly as organ harvesting rackets continue to be busted in India. However, it makes little sense to throw the baby out with the bathwater, particularly when operating with the intent to be more inclusive, in a society shaped by patriarchal norms. It is crucial that NOTTO makes this a participative process, taking along various agencies involved in implementation. While it is important to ensure proper implementation under the Transplantation of Human Organs Act, and widen access to the limited pool of organs, above all, it is imperative that the principle of not denying anyone whose need for an organ is the greatest, based on health parameters, is always adhered to.\r  Published - August 13, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        medical service\n                    \n                            /                      \n                        \n                        health\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        laws",
        "headline_1": "Justice and equality: On organ transplantation, gender skew",
        "headline_2": "Those most in need of organ transplantation should not be denied it",
        "link": "https://www.thehindu.com/opinion/editorial/justice-and-equality-on-organ-transplantation-gender-skew/article69924723.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "13-08-2025"
    },
    {
        "full_article": "The August 11, 2025 Supreme Court order represents the most forceful judicial intervention yet on the matter of free-roaming dogs. By directing Delhi and its satellites to collect every street dog within eight weeks, confine them permanently in pounds, and expand shelter capacity at speed, the Court has signalled its willingness to override administrative lethargy. Delhi records roughly 30,000 dog bite cases a year and rabies still kills poor urban residents with patchy access to post-exposure prophylaxis. The Court’s blunt instrument conflicts with the Animal Birth Control Rules 2023, specifically its doctrine of “capture, neuter, vaccinate, release”, and which forbid municipalities from permanently relocating healthy dogs or impounding them for long periods except if a dog is rabid, incurably ill or found to be dangerously aggressive by a veterinarian. The Rules have failed the test of numbers, however. Urban dog populations have continued to swell despite sporadic sterilisation drives because 70% coverage, below which reproduction rebounds, has almost nowhere been reached. The prescription to return dogs to their territories has entrenched packs in the same high-density neighbourhoods where children play and garbage accumulates. The Rules also block municipalities from exploring alternative strategies such as long-term impoundment. Now, if the Rules are intact, municipal officers who confine dogs could be prosecuted; if they obey the Rules, they risk contempt of court.Policymakers should treat this conflict as an opportunity to confront an outdated legal setup. The Prevention of Cruelty to Animals Act 1960 was enacted when India’s urban footprint was modest. Today’s conurbations with dense informal settlements cannot afford such dog populations. Entrenched ideological positions that romanticise “community dogs” and regard confinement as oppression take insufficient account of the dense human ecology. A modern statute should clearly distinguish between sociable dogs that can find homes; aggressive or chronically ill dogs that require euthanasia; and the large residual category that can live in proper shelters — but none on public roads. Cities should impose duties on municipalities, specify minimum staffing and veterinary standards for pounds, and tie fiscal transfers to reductions in morbidity. Urban local bodies also need steady funding, perhaps under the National Centre for Disease Control, to bankroll the construction and operation of shelters and to fund large-scale sterilisation teams. Veterinary education councils should integrate shelter medicine into curricula to ensure a workforce exists to staff new facilities. Without such support, Delhi risks swapping its dog menace with underfunded canine slammers at the city’s edge, invisible but also cruel. Published - August 13, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        animal\n                    \n                            /                      \n                        \n                        disease\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        local authority\n                    \n                            /                      \n                        \n                        Delhi",
        "headline_1": "​Dogs and laws: On street dogs and the Supreme Court order",
        "headline_2": "Urban local bodies need funding for shelters and sterilisation drives",
        "link": "https://www.thehindu.com/opinion/editorial/dogs-and-laws-on-street-dogs-and-the-supreme-court-order/article69924696.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "13-08-2025"
    },
    {
        "full_article": "Top court did well to put on hold coercive action against owners of ‘old’ vehicles. Age isn’t an indicator of fitness \nThe sound of an ill-conceived idea – phasing out 10-15-year-old cars – screeching to a halt is music to car owners’ ears. Supreme Court did the right thing in all but putting a stay on the NGT order, saying no coercive action was to be taken against owners of 10-year-old diesel and 15-year-old petrol vehicles in Delhi-NCR. The CJI-led bench remarked, “Earlier, one used to use cars for 40-50 years. Vintage cars are still there…” That is exactly the point on which NGT’s 2018 order should not have been given in the first place. As in humans, so in cars – age hardly denotes fitness. \nAs Delhi govt argued that the NGT directive was not based on scientific study or environmental impact assessment, it has repeatedly been stated that policing car consumers is the easy way out and achieves little if the stated goal of the phase-out is to curb emissions. To control auto emissions, much more needs done. Pollution testing infra across India, including in Delhi-NCR, is a fraction of what is required. Govts have simply not invested in it. Per EPCA, barely 15-20% of polluting vehicles on the road are identified by testing centres. A ramp-up of pollution testing infra nationwide should be top priority. Buying new cars is barely a pollution control measure. Manufacturing of cars in itself has huge environmental impact – among the highest rates of raw material consumption and pollution. So, to replace a well-maintained car with a new one hardly serves the purpose of sustainability. \nDisposing of such so-called end-of-life cars in Delhi-NCR has to a large extent been to drive them off to areas where regulation is lax. Further, where’s the infra for scrapping vehicles? Crushing of cars is a major source of solid waste. A scrapping policy can only build a mountain of debris – of plastic, rubber and glass apart from the metal. Japan has long ensured a high-tech circular economy for scrapping, to the extent that recycling rates for airbags and auto shredder residue are 85% and 70%. Where does India stand on this? \nCar owners in Delhi-NCR have had the unique distinction of being in the only world capital where age of their car has been the measure of its fitness. The NGT order only betrayed lack of both rational thinking and scientific knowhow.\n\n",
        "headline_1": "Well Driven, SC",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/well-driven-sc/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-08-2025"
    },
    {
        "full_article": "If the English language is alien to us, then so is much of what we consider integral to us \nIs Nagaland not part of India but a foreign country, and are the citizens of that state foreigners? Is the Indian Constitution written in a foreign language? \nIf asked these questions, BJP MP Nishikant Dubey’s unequivocal response would be “Yes.”\nIn a recent exchange in Lok Sabha with members of DMK, the saffron politician said he would not speak in English as it was a foreign language, and by promoting English, we would become the “slaves” of England once again. \nThe MP’s linguistic observations are subject to the law of unintended, and in this case very unfortunate, consequences. If English is indeed a foreign language then Nagaland, which has English as its official state language, must be by the MP’s lingual definition, no longer part of the Indian Republic, but a foreign country. \nThe second unintended consequence concerns the Indian Constitution that is not only written in English but also enshrines that language as the official link language of the country. \nIn the BJP MP’s view, is the Constitution of India, on which the entire structure of the Republic is founded, a foreign document embodying a foreign, un-Indian sovereignty?\nThe MP is fortunate that he enjoys an entitlement called parliamentary privilege, which basically means that members of Parliament can say whatever they like, without fear of punitive action being taken against them. \nHowever, if common citizens like you or I were to air the MP’s views in public, we might well be liable to prosecution for sedition by causing the state of Nagaland to secede from the country, and for deeming by implication that the Indian Constitution is unconstitutional, thereby not only challenging the validity of the Indian state, but eliminating it in toto. \nBut if the MP effectively invalidates the Constitution, then he also invalidates himself as an MP, a position he enjoys because of the Constitution. \nIn which case does Parliamentary privilege get ruled out, and sedition get ruled in?\nAnd it’s all the fault of that damn foreign language. \n\n",
        "headline_1": "Foreign India",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/foreign-india/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-08-2025"
    },
    {
        "full_article": "Engineers & non-engineers both have a key role, as long as they are bilingual in human & AI languages\nThere’s no taking comfort in these numbers. India produces 1.5mn engineers every year (ahead of US and China outputs) but their unemployability is widely decried. A big disconnect between academic training and the market leaves a majority of these engineering graduates without the skills that employers need. There is, however, a creamy layer that has hitherto flown in a different orbit. Turns out, even its engine is getting rusty now. One indicator is how engineering dominance is retreating from India’s top B-schools. IIM-Ahmedabad’s share of non-engineers has jumped from 33% to 50% in three years. Among IIM-Indore’s and IIM-Lucknow’s new batches, engineers are now the minority. \nIn the AI era, India needs smart engineers more than ever. But producing 20 times more engineers than US is a failed strategy, obviously. In the MBA game, what is looking like a dramatic shift in India today is already commonplace in US, where management programmes have always recruited from diverse academic backgrounds. Still, better late than never. At least the elite engineering schools are reading the writing on the wall, and focus is gradually shifting to producing creators rather than coders. \nThat means, as countless LinkedIn posts point out, enabling curiosity, interdisciplinary collaboration and risk-taking. It doesn’t mean picking whether engineers or non-engineers make better managers. That’s a swampish debate. The future belongs to professionals who respond to technological and other transformations inventively and strategically, irrespective of their precise pedigree. The important thing is that they are fluent in both social and machine languages. Consider that top GenAI experts say its real bottleneck is creative reasoning. Humans are still far, far ahead in listening, innovative insights, and rallying fellow humans around a shared vision. In the new world under construction, soft skills may be the real superpower.\n\n",
        "headline_1": "Managing the shift",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/managing-the-shift/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-08-2025"
    },
    {
        "full_article": "Trump’s extortionate tariffs needn’t badly hurt seafood exporters. But governments have to act fast\nIndia’s fisheries industry, seen as a sunrise sector, is in uncharted waters thanks to Trump’s tariffs. India is the second-largest fish-producing country in the world, accounting for 8% of global production. In fact, seafood exports in 2024-25 reached an impressive $7.38bn. However, the sector is bracing for a whopping 59.72% in US duties if Washington goes ahead with the additional 25% tariff linked to Russian oil on top of the already announced 25% plus 5.76% countervailing duty and 3.96% anti-dumping duty.\nThis will simply price out Indian producers and exporters from the US market. And that is a significant blow because 92% of India’s seafood export is shrimp with more than 40% of this shrimp export heading to US. The situation calls for serious support to the industry that employs about 28mn people directly. In the long term, however, the industry must become more efficient not just to insulate itself from the vagaries of global trade but also challenges such as climate change.\nFirst, GOI must try to offset the potential loss of the US market by stitching up favourable trade deals with other countries that aid the fisheries industry. The India-UK FTA is a good template. Indian seafood exports to UK – currently valued at Rs 1,000cr – attracted 8.9% duty. With the deal that will come down to zero. We need similar deals with other lucrative markets such as EU.\n\nSecond, there’s an urgent need to harness untapped potential. Budget 2025-26 provides for a framework for sustainable harnessing of marine resources in India’s exclusive economic zones and high seas. This must be expedited to increase seafood production. Third, India is facing stiff competition from other producers such as Ecuador, Indonesia, Vietnam and Thailand.\nTo counter this, we need better marketing, storage and transportation to gain efficiency in distribution and sales.\nFinally, global warming-induced challenges are on the horizon. These range from increasing acidity of oceans to declining dissolved oxygen levels in inland water bodies. Hence, the fisheries industry needs to be backed by serious R&D to facilitate the adoption of new technologies and sustainable practices. Only this will keep the growth momentum going.\n\n",
        "headline_1": "Fish in new waters",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/fish-in-new-waters/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 13, 2025 00:00:00  \nIt cannot be denied that the country's highest hard currency earner through export, the Readymade Garment (RMG) sector, has, of late, come up against certain unforeseen headwinds. The recent tariff war launched by the US President Donald Trump is definitely one. However, after negotiations with the number one global economic and military power, the government's trade delegation could bring down, to some extent, the high tariff the US first imposed on its imports from Bangladesh. Even the reduced rate of tariff will still be way higher than what was before the imposition of this new US tariff regime. Needless to say, it is the apparel products that are to endure the impact of such tariff hike from a major export destination of the country's exports. But it is not only the US tariffs, the uncertainties due to the wars in the Middle East and in Ukraine in Europe, which is the largest destination of Bangladesh's apparel as well as other products, have added to the challenges. Various tariff and non-tariff barriers recently raised by the neighbouring India on Bangladesh's external trade have also been playing their part in putting Bangladesh's chief exportable items through their paces. Also, the post-2024 cuts on general export incentives of 1.0 per cent, local yarn incentive of 3 per cent and the cash incentives of 0.5 per cent to 20 per cent of export value provided to different sectors including the RMG, together militated against the competitiveness of the RMG products in the global market. \nNow, what challenges the post-graduation realities would pose to the exports are raising new concerns. That is because, the preferences Bangladesh had so far been enjoying as one of the least developed countries (LDCs) from the Western importers may not apply when the country joins the developing nations' club after graduation. The good news is, recognising the domestic and external challenges that the RMG sector is currently facing, the interim government has decided to maintain the existing export incentives and cash assistance programme for 43 sectors from July to December of the current fiscal year (FY 2025-26). However, a central bank's circular issued on July 10 to this effect specified that the rates for export incentives and cash support provided to products in question shipped between July 1 and December 31 would vary from 0.30 per cent to 10 per cent depending on product category. Of course, this is lower than the maximum rate of 20 per cent that the same category of products had been enjoying pre-2024. Even so, the question remains whether these export incentives including cash assistance would continue during the second half of FY 26, that is from January 1 to June 30 of the next calendar year. \nIt is against this backdrop that the leaders of the RMG sector recently met with the finance ministry officials to reiterate their demands for restoring pre-2024 cash support, local yarn incentive and general export incentive until 2029 in accordance with the World Trade Organization (WTO) provisions. Being the premier export sector of the country, the apparel industry leaders' demands have definitely their merits. And the successive governments have also been extending various incentives and assistances so they can remain competitive in the international market. While being sensitive to their cause, it is also important to understand the limitations of any government to continue propping up a particular business sector indefinitely. \nIt is time the apparel sector came of age and stayed competitive in the global market on its on strength. Meanwhile, the government should also extend necessary policy as well as financial support to other prospective export sectors, if only to diversify the country's export basket.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Should incentives continue for RMG sector?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/should-incentives-continue-for-rmg-sector-1755012678",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       August 13, 2025 00:00:00  \n\nIn response to the US reciprocal tariff now cut to 20 per cent, Bangladesh's textile and spinning millers are set to significantly increase American cotton imports. The move comes under a trade-off arrangement designed to make the country's apparel exports more competitive in the US market.\nUnder the latest US Presidential actions, export goods entering the American market must use at least 20 per cent of the customs value of the product in US-origin content to qualify for partial duty exemptions under US Customs and Border Protection (CBP) provisions. In practice, this means that at least one-fifth of a product's value must come from US sources to receive preferential treatment. The tariff reduction applies only to the US-origin portion, while the non-US portion remains subject to the standard tariff.\nTo illustrate, US customs will apply the tariff only on the non-American share of a product's value, provided the 20 per cent US-content threshold is met. For example, a T-shirt valued at $10 with 20 per cent US-origin content would face a tariff of $1.60 instead of $2. The 20 per cent tariff rate -- applicable to Bangladesh -- would be calculated solely on the $8 non-US portion.\nSpeaking at a press briefing, the President of the Bangladesh Garment Manufacturers and Exporters Association (BGMEA) said the measure presents a unique opportunity to reduce export costs and strengthen Bangladesh's position in the American market. The US Customs and Border Protection (CBP) will have authority to verify compliance, requiring importers to provide documentation on the proportion and value of US-origin materials. This verification aims to ensure only eligible products enjoy reduced duties.\nIndustry insiders say the new condition will drive an increase in US cotton imports, potentially doubling current volumes by year-end. A practical example comes from denim trousers with an FOB (Free On Board) value of around $8, where the fabric component accounts for roughly $4.125. Of this, cotton makes up about 33.25 per cent -- comfortably above the required threshold. Even in cases of lower-value brands, such as Kontoor, the cotton content typically remains high enough to qualify.\nThe owner of a large apparel company noted that his facilities produce around 54 million yards of denim annually, with 60 per cent destined for the US market. The company imports 24,000 tonnes of cotton each year, of which only 15 per cent currently comes from the US. Plans are now in place to increase the share of US cotton imports by nearly 60 per cent to capitalise on the tariff advantage.\nA former BGMEA president added that the requirement for US raw materials, alongside local value addition, could spur investment in Bangladesh's spinning and textile mills, thereby generating new employment opportunities.\nWhile US cotton is generally more expensive than cotton from other countries, exporters have little choice but to adopt it when targeting the US market. Industry stakeholders expect US brands and retailers to demand US-origin cotton in their orders to benefit from the tariff concessions, making the sourcing decision less about preference and more about market access.\nCurrently, Bangladesh imports over $4 billion worth of cotton annually, including around $500 million from the US. Domestic production falls far short of demand, forcing manufacturers to rely heavily on imports -- a situation that naturally supports a pivot toward US cotton for garments bound for America. Some factories already use as much as 40 per cent US-origin material, meaning the 20 per cent tariff would apply to only 60 per cent of the product's value, lowering overall duty costs even further.\nAccording to the US Department of Agriculture (USDA), Bangladesh is projected to remain the world's largest cotton importer in 2025-26, with imports expected to reach 8.5 million bales. The USDA also forecasts a modest recovery in global cotton consumption, set to hit a five-year high of 118.1 million bales, driven largely by strong demand in textile-exporting countries such as Bangladesh and Vietnam. Global cotton trade is expected to rise by 2.3 million bales to 44.8 million bales in 2026, signalling a broad-based recovery in textile production.\nTo support this momentum, the Bangladesh government is finalising a dedicated bonded warehouse facility to ensure duty-free access for US cotton. Chief Adviser Muhammad Yunus has also written to the US President, pledging a substantial increase in US farm imports -- particularly cotton -- as part of a broader trade diplomacy effort to reduce bilateral trade imbalances.\nAs part of this strategy, Bangladesh is drafting a roadmap to double US cotton imports by 2028, targeting a 25 per cent share of total cotton supply from American growers. Based on 2024 projections, imports from the US are set to grow from 1.0 million bales in 2025 to 2.1 million bales by 2028. The US share of Bangladesh's cotton imports will climb from 12 per cent to 25 per cent over that period, with the import value nearly doubling from $473.8 million to $987.04 million.\nThis shift aligns with Bangladesh's recent strong export performance. Garment export from the country surged 13.79 per cent year-on-year to $7.55 billion in FY2024-25, according to the Export Promotion Bureau (EPB). Maintaining this momentum will require strategic adaptation to new trade conditions, including compliance with US content requirements.\nAlthough initial concerns were raised about the implications of the new tariff structure, the outlook appears positive than many anticipated. However, clarification as to the extent of duty waiver will make things easier to grasp. The coming months will determine how well exporters adapt to the evolving trade regime and whether this policy shift translates into sustained market gains.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "How US cotton can help BD apparel survive Trump's tariff better",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/how-us-cotton-can-help-bd-apparel-survive-trumps-tariff-better-1755012802",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 13, 2025 00:00:00  \n\nAs inflation, devaluation of currency, and trade deficits have risen, remittances have emerged as a savior for Bangladesh's economy. With over 10 million Bangladeshis working abroad, their remittances regularly support the country's foreign exchange reserves, keeping the Taka stable and funding imports of staple items like fuel and food.\nIn 2025, while exports have been bruised by global market downturns and foreign direct investment is questionable, remittance inflows have been remarkably resilient. The continued stream of foreign exchange has saved a worse balance-of-payment crisis and eased the burden on the central bank during a period of economic weakness.\nYet excessive reliance on remittances also carries high risks. Migration costs are rising, host countries' employment and visa policies are tightening, and informal channels still skim off sizable portions. Excessive reliance on remittances may also delay long-overdue structural reforms in essential areas such as trade, industry, and taxation.\nTo ensure such vital inflow is sustained, institutions to assist migrant workers must be strengthened by the government, skills training has to be enhanced, and diplomatic efforts must be stepped up to secure labor contracts abroad. At the same time, the transaction costs must be reduced and channels for remittances formalized through electronic platforms and banking networks to secure and upscale these earnings.\nLastly, a dynamic remittance economy is a necessary shock absorber-but not a substitute-for stable growth. Remittances cannot replace industrialisation-driven growth, export diversification, and sound economic management. But they can buy the country precious time to pursue more extensive reforms and weather external shocks. Bangladesh must move quickly to salvage this economic lifeline-while building in place a more durable future.\nFarzan Jawed Mashfi\nStudent, BBA, North South University\nfarzanjawed.16@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Navigating economic uncertainty",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/navigating-economic-uncertainty-1755012893",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 13, 2025 00:00:00  \n\nTwo journalists were attacked in Gazipur within a day. On Thursday, Asaduzzaman Tuhin, a staff reporter for the daily Pratidin Kagoj, was brutally hacked to death by armed miscreants. The day before, Anwar Hossain, a reporter for the daily Alo, was beaten. We strongly condemn these acts of violence and demand the immediate arrest and fair trial of the perpetrators.\nThese incidents raise serious concerns about the safety of journalists and the overall security situation in the country. While law enforcement agencies have arrested seven people in connection with the murder, justice must be ensured through an impartial investigation.\nJournalists routinely face threats, attacks, lawsuits, and harassment for performing their professional duties, often at the hands of political leaders, local influential figures, or even state actors. The enactment of the Digital Security Act by the previous government has worsened this situation by enabling persecution under the guise of law, stifling free expression in media and social platforms.\nThe question remains: has the situation improved following recent political changes? Sadly, many complaints and cases involving harassment and murder of journalists remain unresolved. Without accountability and trials, such violence will continue unchecked, emboldening those who seek to silence the press.\nJournalists play a vital role in informing society and upholding democracy. It is the government's duty to ensure a safe and free environment for the media, to prosecute all crimes against journalists, and to uphold the principles of free expression and justice.\nAshikujaman Syed\nBusiness Development Manager\nTianjin Pharmacn Medical Technology Co., Ltd.\nTianjin, China\nsyedashikujaman@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Speedy trial key to fighting crimes",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/speedy-trial-key-to-fighting-crimes-1755012919",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-08-2025"
    }
]