[
    {
        "full_article": "Bihar has again demonstrated a singular electoral pattern in the Assembly elections which have ended. In preliminary voter turnout data from the Election Commission of India (ECI), women outnumbered men by at least 4.34 lakh votes, which is striking as they were registered approximately 42 lakh fewer than men on the electoral rolls following the Special Intensive Revision (SIR). This gender gap, where those with fewer registrations turned out in greater absolute numbers, underscores a complex interplay of welfare politics, demographic realities and lingering questions about electoral roll integrity. The paradox becomes pronounced when viewed against the backdrop of the SIR exercise that preceded the election. It resulted in net exclusions favouring men, with women disproportionately removed from the rolls. Following these deletions, the gender ratio of Bihar’s electorate plummeted to just 892 in the final SIR rolls, as against 907 recorded barely a year earlier. The Hindu’s statistical analysis of the draft SIR and exclusion data — released after a Supreme Court of India directive — revealed that women (18-29 years) were most severely affected, particularly under the “permanently shifted” category of exclusions. This suggests that women who moved after marriage bore the brunt of deletions, with no transparency on whether they were added to rolls in their new locations.Despite these anomalies, the higher turnout of women is likely to work to the advantage of the Nitish Kumar-led government, if past electoral trends hold true. His nearly two-decade tenure has consistently emphasised women’s empowerment through targeted welfare measures. This election cycle saw the launch of the Mukhyamantri Mahila Rojgar Yojana in September, and the transfer of ₹10,000 to women across Bihar. Disbursements continued after the Model Code of Conduct, with the ECI accepting the questionable rationale that it was an “ongoing scheme”. Higher participation by women in electoral processes is worth celebrating. Such patterns have been largely confined to States with either intense political-ideological contestation — West Bengal and Kerala — or those with high development indices. Bihar, however, presents a different picture. Its high male out-migration rates, for work, partly explain why women’s absolute turnout exceeded men’s despite their smaller registered base. The last-minute cash transfers and these structural demographic factors appear to be more responsible for the turnout pattern than any deep political or ideological mobilisation. This brings into focus the ECI’s silence on a fundamental question: how did Bihar’s electoral rolls end up with a gender ratio significantly lower than what surveys indicate for the State’s population? Until the ECI provides transparent answers about the SIR process, the celebration of the higher women’s turnout must remain qualified. Electoral participation gains meaning only when preceded by fair and accurate voter registration. Published - November 13, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Bihar\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        welfare\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        demography\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        marriage\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        West Bengal\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        migration",
        "headline_1": "Qualified success: On women’s turnout, Bihar Assembly election",
        "headline_2": "Male out-migration and cash transfers make women’s turnout higher in Bihar",
        "link": "https://www.thehindu.com/opinion/editorial/qualified-success-on-womens-turnout-bihar-assembly-election/article70271956.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "13-11-2025"
    },
    {
        "full_article": "Kolkata’s Eden Gardens, one of cricket’s hallowed venues, will again host South Africa. Back in 1991, when South Africa was readmitted to cricket following the withdrawal of apartheid and the consequent lifting of a 21-year sporting ban, it was the eastern metropolis that rolled out the red carpet to Clive Rice and his men. The first ODI was played at a packed Eden on November 10, 2025, one in which India prevailed, and 34 years later, another Protean unit led by Temba Bavuma will clash against Shubman Gill’s men in the first Test commencing on Friday (November 14, 2025). In a fresh cycle, South Africa, the defending champion in the ICC World Test Championship, is up against India, often an indomitable force in its own backyard. That the tour of England was drawn at 2-2 in the longest format and the subsequent Tests against the West Indies at home were swept aside, is a pointer to the form and ability of Gill’s unit despite the retirements of Virat Kohli, Rohit Sharma and R. Ashwin and the continued absence of Mohammed Shami. The first two may still be playing ODIs, but this truly is Gill’s era and five tons in his last seven Tests reveals a batter finding an extra gear when given the extra responsibility of captaincy.This latest cricketing joust is like a full-course meal as it features two Tests, three ODIs and five T20Is. India can finesse its plans and team combinations in all three formats, besides gaining further inputs on the form and relevance of Rohit and Kohli after their decent run during the recent ODIs in Australia. The T20Is too will have an added layer as India and Sri Lanka will be hosting the ICC T20 World Cup next year. That Rishabh Pant is back in the mix, after a hiatus following an injury, augurs well while the other wicket-keeper Dhruv Jurel may still find his slot as a pure batter considering his exploits with the India A unit. Gill, Yashasvi Jaiswal, K.L. Rahul, Ravindra Jadeja, Pant, Jasprit Bumrah and Mohammed Siraj constitute the nucleus of a squad that is dealing with transition under coach Gautam Gambhir. South Africa with its blend of doughty batters and a sharp attack headlined by Kagiso Rabada, can be a strong opposition. The visitors also have an adequate blend of spin revealing an Indian origin flavour thanks to the presence of Keshav Maharaj and Senuran Muthusamy. Last year, host India was humbled by New Zealand and even if it is largely seen as an aberration, Bavuma’s men could draw inspiration from the Black Caps. Published - November 13, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Kolkata\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        South Africa\n                    \n                            /                      \n                        \n                        cricket\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        ICC\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Sri Lanka\n                    \n                            /                      \n                        \n                        New Zealand",
        "headline_1": "Renewed rivalry: On the India, South Africa first Test, at Eden Gardens",
        "headline_2": "India will be keen to move ahead in the new cricket Test cycle",
        "link": "https://www.thehindu.com/opinion/editorial/renewed-rivalry-on-the-india-south-africa-first-test-at-eden-gardens/article70271349.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "13-11-2025"
    },
    {
        "full_article": "Islamabad blaming India and Afghanistan for terrorism on its own soil is laughable\nPakistan continues to live in a state of delusion. After a suicide bombing outside an Islamabad court claimed the lives of 12 people, Shehbaz Sharif quickly pointed fingers at India and Afghanistan. Needless to say, this is laughable and a poorly disguised attempt at defecting blame from Pakistan’s own failings. For a country that practically wrote the playbook on maintaining double standards on terrorism – nurturing terror purveyors while claiming to be victims of terrorism – it’s rich that it now tries to implicate others for its own sins. \nThere was time in the 1950s and 60s that Pakistan was being studied by foreign experts as a possible South Asian success story. But the disastrous measures of its leadership in 1971 in response to the liberation movement in what was then East Pakistan – now Bangladesh – served a body-blow to the very idea of Pakistan. Today, it continues similar colonial policies in Balochistan, provoking a powerful movement against Islamabad’s exploitation. During the Soviet-Afghan war, Pakistan hosted tens of thousands of mujahideen fighters to curry favour with US. Pakistani Taliban is their progeny. Recall also, it was merely a 100km from Islamabad in Abbottabad that bin Laden was found holed up.\nPakistan thinks it can play all sides and be friends with both US and China, turning to each whenever it needs to be bailed out. But it forgets that national strength stems from skilled people, institutions and economy. All three failed to develop because its military had other priorities. Today, Pakistan is a military dictatorship masquerading as a civilian regime. And with the 27th constitutional amendment – which gives lifetime immunity to Asim Munir – about to be passed, even the fig leaf of a hybrid regime is coming off. The question is how long Pakistan’s delusions can last in the face of its polycrises.    \n\n",
        "headline_1": "Joke’s On Pak",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/jokes-on-pak/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-11-2025"
    },
    {
        "full_article": "He sounds keen on a trade deal now, but it’s in India’s interest to wait for US Supreme Court order on his tariffs \nAfter delays, disappointments and a brief falling out, the India-US trade deal seems around the corner. Trump’s said it’s “pretty close”. Commerce minister Piyush Goyal sees it happening “any day” now, even “tomorrow”. For India, it won’t be a day too soon because $40bn worth of labour-intensive exports have been at stake ever since Trump imposed a punitive tariff on India in late Aug. US equally needs a deal to access Indian markets, and ensure the India-China thaw – forced by its own rigid stand on Russian energy – does not hurt its strategic interests. \nThe deal has to happen. Not because Trump considers India an “amazing country”, but because it is a nation of “actually, 1.5bn people”, where he expects his new ambassador, Sergio Gor, to “promote investments in key industries and technologies, increase American energy exports and expand our security cooperation”. Clearly, US needs India as much as India needs it. After his petulant “dead economy” jibe in July, Trump got real about India. By early Sept, he was looking forward to “speaking with my very good friend, Prime Minister Modi”. Birthday wishes, Diwali greetings, and thanks for “support on ending the War between Russia and Ukraine” followed.\nThere have been five rounds of trade negotiations meanwhile, and it looks like there’s nothing left to iron out now. For India, this resolution is commendable because not once – unlike UK, Japan, Korea, etc – did it rush to plead its case, and pump up Trump. It refused to bend under the burden of his 50% tariff, and as Goyal said, has refused to “compromise the interests of farmers, dairy and workers”. Likewise, Trump is satisfied that India has “very substantially” cut back its purchase of Russian energy. Bloomberg recently reported that five big Indian refiners have not ordered any Russian oil for Dec. That gives Trump his off ramp to slash tariff on India.\nThe stage is set then, but India shouldn’t sign the deal before Trump waives the penal tariff. When it goes, the balance 25% tariff would still be disadvantageous for India, vis-à-vis Vietnam, Malaysia, Cambodia and China, which enjoys unmatched economies of scale. Having been so patient for so long, India should aim for a 15% rate. There’s no need to rush because if US Supreme Court strikes down Trump’s tariffs in the coming weeks, the pre-Trump average US tariff of 3.3% would be far more advantageous than any deal.\n\n",
        "headline_1": "Trump’s Dealemma",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/trumps-dealemma/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-11-2025"
    },
    {
        "full_article": "New weapons of ‘mass’ destruction\nThere was much buzz last week over weight-reducing drug Mounjaro becoming No. 1 pharma brand, outselling infection-reducing Augmentin. This not only knocks inches off its exultant users but now made its manufacturer Eli Lilly inch past GSK. Its India partner for this is legendary AK Hamied’s Cipla, which till now was best known for knocking the bottom off Big Pharma. In fact, the multinationals lobby was rumoured to have deprived Cipla’s scientists of the Nobel it could well have won for its pathbreaking anti-retroviral HIV-AIDS therapies. Ah well, good to know it’s gone viral by now coming to the aid of those immuno-deficient against other appetites.\nWhat’s getting eyes popping and jaws dropping is the speed at which this WRD is mopping off competition. Its Sept sales jumped 42% higher than Aug’s. That’s when it gave a severe gastric attack to antacid Pan to become No. 2 in India. Should we call it Mounting KiliMounjaro?  Unlike Africa’s long-dormant highest peak, it has def created a volcanic disruption. \nOk, regardless of the belching lava (and not just from antacidwallas), isn’t the news about a WRD ousting an antibiotic something to celebrate? It suggests that more people are worried about the effect of burgers than of bacteria. C’mon, what’s not to hurrah about that?  \nLet’s take our Insta divas – and who isn’t, since everyone is on non-candid camera? If they’re swagging about with the give-away shriveled, hollow-cheeked look once reserved for those seriously afflicted, I’d say weight-reduction drugs are a great leveller. A social one especially, since going to bed hungry has leapt from dire necessity to lifestyle choice.\nAugmentin sales were augmented by its combinations which helped combat several multidrug-resistant (MDR) bacteria. Now along comes this aura-exuding WRD offering multicuisine resistance. ‘Gimme more!’ say the hip and hyped, ‘so I can eat less of more.’ And get a flat tummy without big-bucks tuck. Wow!\nThe icing on the chocolate cake is that it reduces blood sugar as well. Diet and diabetes tackled in one swallow. \nBtw, a major side-effect is heartburn/acid reflux. Revenge of the ousted antacids?\n                                                *** \nAlec Smart said: “The Hippocrates oath has been doctored – cynically.”\n\n",
        "headline_1": "Fat-checking",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/fat-checking/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-11-2025"
    },
    {
        "full_article": "One, security forces have busted many Islamist terror networks, arresting 80-plus this year. Two, no counterintelligence is foolproof. Three, Pakistan’s jihad puppeteers may again look to create mayhem in India outside Kashmir. Four, this tactic gets a boost from Pak-Bangla cosying up. Five, India’s agencies will know that risk of Islamist terrorism will likely grow\nWhile there is a storm of speculation, particularly on social media, very little has been authoritatively disclosed with regard to the explosion in the Red Fort Metro Station parking lot on November 10, which killed at least 13, and injured another 30.\nA case under sections of the Unlawful Activities Prevention Act and the Arms Act, as well as the Bharatiya Nyaya Sanhita, has been registered.\n\nIt is clear that the Red Fort blast is being treated as an act of terrorism and the PM has described it as a “conspiracy”, declaring, “Theconspirators behind this will not be spared. All those responsible will be brought to justice.”\nSimilar sentiments have been echoed by ministers for defence and home.\nRead the full story on TOI+.\n\n",
        "headline_1": "Warnings from Red Fort",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/warnings-from-red-fort/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-11-2025"
    },
    {
        "full_article": "It is frustrating that Bangladesh, despite being one of the world's least responsible countries for greenhouse gas emissions, is facing an ever-rising climate debt. The irony is, Bangladesh is also one of the most vulnerable nations to the impacts of climate change, with millions of its people already affected. But we are not alone in facing such predicaments. As global leaders gather at COP30 in Brazil, it is crucial that they find ways to reduce this unfair burden on Bangladesh and other highly vulnerable countries.\nIt must be acknowledged that it is the failure of wealthy nations—the highest emitters of greenhouse gases—to commit to grant-based, justice-driven funds for vulnerable countries that has resulted in such punishing climate debts for the latter. According to an index published by a Dhaka-based think tank, Bangladesh is in the \"high risk\" debt-trap category with its burden forecast to increase further by 2031. How is this fair? It is illogical that Bangladesh must borrow $29.52 for every tonne of carbon emitted, meaning that for every $1 it receives in grants, it also receives $2.70 in loans. Between 2009 and 2022, Bangladesh reportedly accrued $3.4 billion in climate-related loans, making it increasingly dependent on external borrowing for adaptation and resilience. For over a decade, LDCs like Bangladesh have consistently received more climate loans than grants.\nIn 2022, Bangladesh identified 113 high-priority interventions across eight sectors, including water resources, agriculture, and urban resilience. Experts estimate that this plan will require around $8 billion annually from 2023 to 2050, yet Bangladesh has so far secured less than 1 percent of these projected needs. According to the World Bank, the country incurs losses of approximately $1 billion from average tropical cyclones, and by 2050, one-third of agricultural GDP may be lost due to climate vulnerability and extreme events. Thus, the new global climate finance goal of $1.3 trillion for LDCs must uphold the principles of fairness and equity, or countries like Bangladesh risk being further submerged in climate debt.\nThese vulnerable nations are facing increasingly frequent disasters driven by climate change, including cyclones, droughts, rising sea levels, and soaring temperatures. Decision-makers in forums such as the G7 and G20 must urgently address the debt crisis plaguing the Global South. This requires debt relief and a substantial increase in grant-based climate finance. Wealthy nations, being the largest contributors to the climate crisis, bear responsibility for its consequences on the countries of Global South. They must act decisively to reduce their debt burden and provide funds that will meaningfully mitigate climate change effects. Only by taking responsibility for their emissions can the wealthy nations ensure fairness and protect those most at risk.\n",
        "headline_1": "Reduce Global South’s climate debt burden",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/reduce-global-souths-climate-debt-burden-4033306",
        "news_paper_name": "The Daily Star",
        "publish_date": "13-11-2025"
    },
    {
        "full_article": "The most profound acts of love often unfold in homes where a family member lives with a disability. In these homes, a woman—usually the mother, wife, or sister—becomes the entire infrastructure of care; a 24-hour lifeline that holds the household together. Yet, such relentless labour has huge implications on the physical, mental and economic well-being of the caregiver.\nWe often speak, and rightly so, about empowering persons with disabilities and ensuring their access to healthcare, education, and livelihood. Yet, in focusing so intently on the person with disability, we often ignore those who sustain their daily life. We are failing the caregiver and by doing so, we are also failing the person she serves.\nDuring an interview for a BRAC Institute of Governance and Development (BIGD) study, a grandmother in her sixties explained that the physical strain of caregiving for her granddaughter with disability can be overwhelming. She is expected to shift from a position of gentle authority to that of a hands-on therapist, implementing complex and often painful exercise routines that are essential for mobility. Furthermore, the task of taking her to a hospital, which is quite a distance from their home, leaves her drained. She also cannot attend to household chores on those days.\nYet the physical toll is only part of the story. The psychological costs run even deeper. Caregiving demands constant vigilance. For a child or adult with an intellectual or physical disability, the caregiver becomes a sleepless sentinel, forever alert to danger. She cannot afford to let her guard down. This endless watchfulness ensures safety and dignity for her loved one, but it strips away her own rest, privacy, and peace of mind. Over time, this unending anxiety corrodes her spirit.\nBIGD's fieldwork with households that combine disability support with livelihood activities revealed a painful truth. Many caregivers, especially older women, reach a point of profound fatigue and scepticism. Findings from an ongoing BIGD study suggest that separate counselling sessions, focused solely on the mental health of caregivers, can help with their emotional wounds. When caregivers were given space to express exhaustion, manage stress, and rebuild motivation, the entire family's progress in caring for the person with disability improved. Without this emotional repair, every intervention risked collapse.\nThe burden of caregiving is also deeply economic. In ultra-poor households, the caregiver often manages both care and income. She runs a small business, tends livestock, or manages a poultry farm while maintaining a demanding rehabilitation schedule. She is expected to be an entrepreneur, nurse, therapist, and homemaker all at once. Her life sits at the cruel intersection of poverty, disability, and gender inequality. This impossible balancing act comes at a cost. If she focuses on the family business, caregiving suffers. If she focuses on caregiving, the family income declines. The constant tension between economic survival and emotional duty keeps her trapped in a cycle of anxiety and exhaustion.\nAs a society, we must stop viewing caregivers merely as instruments of care and begin recognising them as individuals with their own rights to health, rest, and dignity. This crisis cannot be solved by sympathy alone. It requires systemic reform. We need to create community-based support networks that provide scheduled respite. Even two hours of rest a week for an elderly mother, taking care of child with disability, would help. Every disability or poverty programme should include psychosocial care for caregivers as a mandatory component. Government safety nets must be streamlined to ensure that caregivers receive adequate economic support.\nThe silent suffering of caregivers is one of the clearest indicators of our collective neglect. Their strength is extraordinary, but it is not infinite. If we truly want to secure dignity and opportunity for persons with disabilities, we must begin by protecting the health of those who hold their world together. It is time to lift this invisible burden before the strain becomes too heavy to bear, and the caregivers are lost to exhaustion.\nTahasin Tasnim Mohce is research associate at the BRAC Institute of Governance and Development (BIGD) in BRAC University.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Caring for caregivers: The missing link in disability support",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/caring-caregivers-the-missing-link-disability-support-4032711",
        "news_paper_name": "The Daily Star",
        "publish_date": "13-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 13, 2025 00:00:00  \nAt a time when a high-level United Nations (UN) team arrives in Dhaka to discuss Bangladesh's progress for graduation from its least developed country (LDC) status to a developing nation, Japan brings off a tariff reform allowing continuation of the generalised system of preference (GSP) for the newly graduated ones for three more years. Countries like Bangladesh vying for the graduation will enjoy the grace period. Although the interim government insists that the graduation should maintain the timeline scheduled for November, 2026, economists and business leaders complain that the country is yet to be ready for the qualification and it should be deferred. At a meeting with the visiting UN delegation, the country's top business leaders sought five- to six-year delay for the graduation. In response, the UN team has asked for 'a detailed roadmap, outlining the country's preparation for graduation'. Another UN delegation scheduled to visit Dhaka in January will further assess the country's preparation for graduation. \nSure enough, the arguments for and against next year's scheduled graduation to a developing country have their merits. Bangladesh has GSP facilities with most of the countries considered destinations of the country's main product garment. However, the US, which is second to the European Union (EU) in terms of import from Bangladesh, does not allow this facility. Export to the EU amounted to $18.5 billion compared with $8.37 billion to the US in 2023-24 fiscal year. The figures for the fiscal year 2024-25 were $19.71 billion and $7.54 billion respectively. Japan's share in the import of garment from Bangladesh is estimated at $1.8 billion, accounting for 2.92 per cent of the latter's total export. \nCompared to the exports to the EU and the single largest market of the US, Japan lies far below. But it is the gesture of preferential treatment that it grants to LDCs and the newly emerged countries that is highly significant. Japan had to change tariff law and inform the World Trade Organisation (WTO) of its decision. This move may inspire other countries to follow suit. For example, the LDC privileges China has agreed to extend to Bangladesh for two years may be further extended. Now the stands taken by the government and the private sector are clearly opposed to each other. The objection raised by businesses that the current macroeconomic stress, high bank interest rates, inflated or distorted growth data under the deposed government, years of loan scams, fallouts of the pandemic and Russia-Ukraine war have made the preparation for graduation untenable. \nBusiness leaders have cited reasons convincingly. Indeed, there is no point falling into the middle-income or vulnerability trap. This means the country risks attaining a stage of development stagnation or, in a worse-case scenario, a reversal of progress. Right now Bangladesh, enjoys LDC facilities from 38 countries. But this does not mean, the country can steer clear of a global economic shock. World trade has changed so much after Trump's reciprocal tariff that economic and trade relations are now unpredictable. Hardly a country remains unaffected by the current business turmoil. But it is the smaller countries with limited or no trade diversification that are likely to suffer more from further trade disruptions. Political uncertainty in the country will not help the cause. A three-year grace period may not be enough for finding a solid ground under its feet.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Beyond Bangladesh's graduation from LDC",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/beyond-bangladeshs-graduation-from-ldc-1762957217",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       November 13, 2025 00:00:00  \nThat ground water table is falling dangerously low is a major worry for the country. This has been going on over the last few decades and experts have been repeatedly sounding alarms. Over-extraction to meet the growing need of an increasing population is the obvious reason. Some of the extracted water is of course replenished but the amount is not of the same proportion. The continuous sinking of the groundwater table holds the risk of triggering a water crisis in areas excessively dependent on it, jeopardising food security and potentially causing land subsidence and other environmental calamities.\nNowhere are the stakes of the falling groundwater table higher than in the northern Barind region. As world leaders gather for the United Nations Climate Change Conference (COP30) in Belém, Brazil, alarming reports of severe drought and water scarcity are emerging from this area. The vast Barind areas, sprawled across Rajshahi, Chapainawabganj, and Naogaon, are often referred to as the country's food granary. Estimates suggest the Barind region alone produces about 35 per cent of Bangladesh's irrigated Boro rice and around 60 per cent of its wheat. Groundwater irrigation is vital to sustaining this massive agricultural output.\nThe gravity of the situation can be understood from a recent research finding. A 2025 study published in the Global Food Security journal, titled \"Revisiting the Drought-Food Insecurity Nexus: A Social-Ecological Systems Perspective,\" warns of catastrophic consequences. This research projects that if climate pressures continue to rise and water management falters, food security in the Barind region could drop by more than half, a crisis that would have profound national implications.\nThe Barind's topography and climate make it uniquely vulnerable. Its climatic condition is harsher than other areas of the country, marked by higher temperatures and lower rainfall compared to the national average. Moreover, the area's reddish clay soil is heavily compacted and not ideal for water retention. Consequently, the Barind has the most intensive use of groundwater in the country, with over 90 per cent of the total irrigated area relying on it.\nThe expansion of irrigation following the installation of deep-tube wells since 1990s, and the resulting over-extraction of water from aquifers have led to a steady decline in groundwater levels. Farmers in the region lament that only a decade ago, groundwater could be reached at a depth of around 30 feet; now, it requires digging as deep as 80 feet to find water, and even deep tubewells sometimes fail to pump out water. \nThe crisis is twofold: the impact of a changing climate and the overextraction of limited resources. Added to this is the reduced flow in rivers caused by upstream barrages and dams in India. In the northern region large stretches of some rivers (for example the Teesta) shrink into sand-beds during the dry season. Conversely, during the monsoon these same rivers may swell rapidly when the gates of upstream dams or reservoirs are sometimes opened after heavy rain, contributing to flooding downstream in Bangladesh.\nAmid increasing frequency of water shortages in various parts of the country, the government in August declared 50 unions in 26 upazilas of four districts as severely water-stressed. Of these, 47 unions are located in the Barind districts, with the remaining three in Chattogram's Patiya upazila. The government is now reportedly preparing guidelines to limit the use of water in these water-stressed areas.\nWater is being increasingly viewed worldwide as a scarce resource, while Bangladesh is reasonably well-endowed with this resource. So if the country has become overwhelmingly dependent on groundwater the problem is not scarcity of resource but uncontrolled pollution and poor water management. \nAs part of improved water management, rainwater has to be harvested. The wisdom of the ancient people can be a good guide here. At least rainwater must be made to supplement the water needs. The rivers crisscrossing the country should be maintained properly so that they can be used as a source of clean water. And to ensure sufficiency of surface water it is necessary that management not only of water but also of lands should be improved. Planned housing should replace unplanned housing.\nBesides, to ensure more efficient water use in cultivation, experts suggest the adoption of sprinkler and drip irrigation systems. The sprinkler system sprays water over crops or soil, simulating natural rainfall, while the drip irrigation system delivers water directly to plant roots through perforated pipes, releasing one to four litres of water per hour from each dripper, without requiring the external pressure needed for sprinklers. Given the uneven terrain of the Barind region, efforts should be made to popularise both methods.\nAnother effective approach to utilising surface water is the lift irrigation system, in which water is pumped from lower-level rivers or reservoirs to higher elevations for agricultural use. This method is already in limited use in parts of northern Bangladesh. However, considering the region's vast agricultural land and large population, a mega lift irrigation project should be explored. Similar systems in several countries have successfully pumped water from major rivers to high elevations and distributed it across thousands of kilometres through canals, tunnels, and pipelines to and semi-arid regions. Bangladesh could consider developing large-scale lift irrigation system in the Padma and Jamuna basins.\nImplementing such mega projects, however, will require significant investment. Regrettably, the Barind region doesn't receive the attention it deserves in climate change adaptation efforts, which largely focus on the country's coastal belt. Therefore, the depletion of groundwater and the resulting threat to the region's food security underscores the urgency of adopting a more integrated approach to climate change mitigation measures. What is needed is a holistic strategy to ensure climate-resilient water management and agriculture. Investment must be made in sustainable irrigation systems, rainwater harvesting, lift irrigation projects and support for farmers adopting drought-tolerant practices. If these initiatives are implemented effectively and sustained, they could play a crucial role in alleviating the region's water scarcity and ensuring food security.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Tackling water scarcity in Barind tracts",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/tackling-water-scarcity-in-barind-tracts-1762957256",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 13, 2025 00:00:00  \nIt is disheartening to know that with just two months left before the new academic year, printing for nearly 210 million secondary-level textbooks has yet to begin. Past delays due to irregularities, corruption and tender-related complications hampered curriculum implementation and dampened student enthusiasm.\nGovernment plans to print around 310 million textbooks this year, 85 million for primary and 225 million for secondary levels. Tender cancellations and work order delays have already slowed the process, and the upcoming national election could exacerbate the situation if printing presses prioritise political materials over textbooks. This may push desperate parents to the market, where free textbooks are often illegally sold, undermining the government's initiative.\nTo prevent this, authorities must allocate printing based on each press's capacity, monitor tendering transparently, and ensure strict quality control. Supporting local presses is also essential, as shifting printing domestically over the past years has strengthened the national printing industry and created employment opportunities.\nUltimately, timely textbook delivery depends on efficient inter-agency coordination, transparent management, and strict supervision. With proactive measures, our children can begin the new academic year with enthusiasm, not anxiety.\nRiyad Hossain\nStudent, Govt. BL College, Khulna\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ensure timely delivery of textbooks",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ensure-timely-delivery-of-textbooks-1762957352",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 13, 2025 00:00:00  \nToday's youth-Gen Z, Alpha, and the emerging Beta generation-are often hailed as extremely smart. They seem to have mastered every corner of modern technology. But is that really true? Does being able to use the latest gadgets or apps equate to true intelligence?\nIn reality, a truly smart person possesses knowledge, taste, and manners. Sadly, these qualities are gradually fading among young people. While they can navigate smartphones or search engines effortlessly, many now rely on technology for even the simplest tasks. Critical thinking is often outsourced to artificial intelligence, and a shifting sense of fashion and social trends increasingly defines their \"taste.\" Worse still, offensive language is frequently mistaken for confidence.\nWhy has this dependence on technology become so pervasive? Easy access and the speed of digital tools are key factors. Globalisation has made life faster and more interconnected, while smartphones, the internet, and search engines are now at everyone's fingertips. Digital platforms offer instant solutions, encouraging a preference for ready-made answers over independent thought.\nEducation has also become largely digitalised. Online classes, e-books, and video tutorials have revolutionised learning, but they have simultaneously fostered dependency on technology. In the era of the Fourth Industrial Revolution, skills like coding, data analytics, and artificial intelligence are essential for employment, further drawing young people toward technology.\nAt first glance, this reliance appears beneficial-it solves problems quickly, opens career opportunities, encourages innovation, and improves access to education. Yet, overdependence comes at a cost. Excessive use reduces patience and critical thinking, weakens memory and creativity, and diminishes the ability to analyse deeply. It also leads to addiction, physical ailments such as eye strain and insomnia, and social consequences, including weakened empathy and emotional connection. Moreover, online privacy violations, cyberbullying, and hacking pose significant risks.\nAs the saying goes, \"A matchstick can light a stove or burn a house-it depends on how you use it.\" Technology itself is not harmful, but complete dependence is dangerous. Young people must learn that true intelligence lies not in using technology, but in using it wisely and responsibly.\nLaboni Akter Kobita \nDepartment of Public Administration \nJagannath University \nlaboniakterkobita6@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Rise of a tech-dependent generation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/rise-of-a-tech-dependent-generation-1762957381",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-11-2025"
    }
]