[
    {
        "full_article": "In urging the Union government to work on guidelines to regulate speech on social media, the Supreme Court of India is seeking to empower an executive that is already weaponising the legal limits on freedom of expression. In response to a petition by a non-profit assailing derogatory remarks by online figures against disabled persons, the Court issued instructions that further a problematic trend of the judiciary egging on the state to encroach on legal grey areas with statutory restrictions that undermine constitutionally guaranteed rights. To regard distasteful humour, however disturbing it might be, as a problem to be solved through the courts and by executive rulemaking, is to fall into a deceptive trap of imagined righteousness that progressive democracies should avoid. There are always unpleasant consequences in expanding powers to police speech: partisans wield their powers to ferociously monitor what is or is not appropriate, instrumentalising agencies of the state to suppress art and political speech they do not like; citizens find themselves constantly looking over their shoulder before expressing themselves. Under the overbearing atmosphere of censored expression, truths and ideas that must be reckoned with for a functioning democracy are stifled. People should not have to constantly look against asterisks that set terms and conditions for fundamental liberties. Film producers and directors have been pushed away from exploring subject matters that would help India progress socially, and journalists have been dealing with first information reports for carrying out their professional duties.In recent years, the Union government has, formally and informally, expanded its control of online speech, with the problematic Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021, and an amendment to those Rules that would allow social media companies to be proceeded against for content posted by users that has been flagged by the government. Monday’s (August 25, 2025) instructions seem set to expand those ambitions, which are themselves under challenge with the Supreme Court. Hate speech and speech inciting violence against minorities are criminalised in India, giving disadvantaged groups powerful avenues of recourse when they are legitimately wronged. Handing an executive, which already has a record of mala fide weaponisation of media and speech regulations, more powers would be dangerous in the extreme. At a fundamental level, such judicial pronouncements, which cite “misuse of freedom of speech” as a ground, seem to misperceive the framework of their institutional role: that of a protector of rights under a clear constitutional framework, and not of an unchallenged lord in a feudal society.READ MORE Published - August 27, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        government\n                    \n                            /                      \n                        \n                        media\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        executive (government)\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        disabled\n                    \n                            /                      \n                        \n                        humour\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        arts (general)\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        hate crimes\n                    \n                            /                      \n                        \n                        minority group\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "Imagined righteousness: On conduct on social media",
        "headline_2": "Courts must protect rights of citizens, not allow the state untrammelled power",
        "link": "https://www.thehindu.com/opinion/editorial/imagined-righteousness-on-conduct-on-social-media/article69979599.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-08-2025"
    },
    {
        "full_article": "Sport is at its best when there is a clearly established pecking order and intense competition between the hierarchical rungs. The presence of a dominant and diverse set at the top, followed by a capable and efficient mid-card, and an under-card that can upset the apple cart makes for engaging viewing. However, in recent times, the men’s and women’s tennis tours have seen a hollowing out of the middle. It is particularly stark in the men’s game where Carlos Alcaraz and Jannik Sinner have pocketed the last seven Grand Slam tournaments, talents as effervescent as 2021 U.S. Open winner Daniil Medvedev are threatening to fade away while teenaged phenoms such as Joao Fonseca are rising. At the ongoing U.S. Open, it will be interesting to see if a class that consistently snaps at the heels of the top dogs emerges. The legendary Novak Djokovic, winner of a record 24 men’s Slams, has made three semifinals in as many Majors in 2025. The 38-year-old is still good, but the question is if he is good enough to go all the way. Taylor Fritz and Ben Shelton, No. 4 and No. 6 respectively, are out to end the United States of America’s 22-year wait for a male Slam winner even as Alexander Zverev will be desperate to prove that his No. 3 ranking is not an anomaly.Among women, Aryna Sabalenka, Iga Swiatek and Coco Gauff have combined to win 10 of the last 14 Majors. Though the trio’s hold at the top is not as water-tight as the Alcaraz-Sinner duopoly, they are the players to beat. World No. 1 Sabalenka, a finalist this year at both the Australian Open and the French Open and a semifinalist at Wimbledon, will be eager to defend her title at Flushing Meadows and avoid a Major-less season. Swiatek, who resurrected her career at the All England Club in July after a year-long slump, has continued her fine touch, winning a key U.S. Open tune-up event in Cincinnati. Gauff has had a forgettable time since securing the Roland-Garros crown but the home setting in New York should energise her. It will be intriguing to watch who among Jessica Pegula (2024 U.S. Open runner-up), Jasmine Paolini, Amanda Anisimova, Elena Rybakina — the 2022 Wimbledon champion — and Emma Navarro turn out to be the challengers. Also of interest will be 18-year-old sensation Mirra Andreeva. The Russian won Dubai and Indian Wells, broke into the top-10, made back-to-back quarterfinals at the French Open and Wimbledon, and is now World No. 5. The cream has risen to the top. Will it stay there? READ MORE Published - August 27, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        sport\n                    \n                            /                      \n                        \n                        tennis\n                    \n                            /                      \n                        \n                        US Open\n                    \n                            /                      \n                        \n                        Wimbledon\n                    \n                            /                      \n                        \n                        gender",
        "headline_1": "​Not truly open: On tennis and the U.S. Open",
        "headline_2": "Tennis needs a strong middle tier to see keen contests through two weeks",
        "link": "https://www.thehindu.com/opinion/editorial/not-truly-open-on-tennis-and-the-us-open/article69979649.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-08-2025"
    },
    {
        "full_article": "From today, Indian goods sold in the US will suddenly become much more expensive. Why? Because the US President, Trump, has added a new tax (called a tariff) of 25% on them, as punishment for India buying oil from Russia. This comes on top of an older 25% tax, which makes many Indian products way too costly compared to goods from other countries. For example, an Indian shirt may face 62% tax, while one from Vietnam faces only 20%. This means fewer people in the US will buy Indian products, which could hurt Indian businesses, jobs, and even India’s economy.\nBut India didn’t give in to Trump’s pressure. He didn’t really care about Russia earlier – he only brought it up when India refused to open its markets for American farm and dairy products. That’s why many say this is less about Russia and more about trade fights. Interestingly, Trump hasn’t taxed China for buying Russian oil (China buys even more than India!), but he’s threatening them for other reasons.\nIndia is trying to cope by reforming its economy and finding new markets. But Trump also has a problem: Americans may soon feel the pain too. Everyday goods in US stores will get costlier, and many families are already struggling with loans. So while India will face tough times, Trump’s own people may also get angry when shopping becomes too expensive.\n\n",
        "headline_1": "Walled Mart",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/walled-mart/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-08-2025"
    },
    {
        "full_article": "Some opposition parties have decided not to join a special group (called JPC) that will study a very important new law. This law says that if the Prime Minister, Chief Ministers or state ministers are put in jail for more than 30 days on serious criminal charges, they will lose their jobs.\nThe JPC will have 31 MPs – 21 from Lok Sabha and 10 from Rajya Sabha. Out of these, 14 will be from opposition parties. But four opposition parties (TMC, SP, AAP, and UBT Sena) have said they won’t join. Others like Congress and DMK will.\nThe boycotting parties say that their voices aren’t heard and rules are not followed. But here’s the thing – this time, the government actually needs opposition support. To pass this big law, they need a two-thirds majority in Parliament, which they don’t have on their own. Even some BJP allies want changes to prevent misuse of the law.\nBoycotting can be a strong protest, but if it’s used too often or too quickly, it loses power. By walking away from the JPC, these parties are reducing their own strength. If they stay in, they can argue, demand changes, and bargain. That’s smarter politics than giving the government a free pass.\n\n",
        "headline_1": "Talk, don’t walk away",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/talk-dont-walk-away/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-08-2025"
    },
    {
        "full_article": "Kamala and I were getting ready to go out for a book reading. She was dressed in her usual simple cotton sari and barely visible accessories. I decided I needed to be the brand ambassador of toxic masculinity: Where is the Kanjeevaram silk and the jasmines hanging from your hair announcing to the world that you are Madrasi?\nShe narrowed her eyes and pursed her lips in warning. Then came the flash floods of anger running over decades of south Indian stereotypes. ‘You should be the last person to reinforce this nonsense! You don’t walk around doing a lungi dance or talking like Mehmood in Padosan in real life.” She sat down angrily on the sofa, which meant I and Bollywood were in for a lecture. ‘Do you remember the cringe fest in Agneepath with Mithun’s Krishnan Iyer Yemm Yay. And by the way there are no Madrasis – I am a Kannadiga and the neighbouring states have Malayalis and Tamilians and Telugu people.’ I smiled to myself – because anger was making her look Param Sundari. ‘Never mind the trope of jasmines and accents and jewellery and mohiniyattam, I won’t dance, I won’t wear flowers in my hair, or drape myself in heavy silk and gold for every occasion!’ she continued. ‘This Shalini Unnikrishnan from Thiruvananthapuram and Thekkepata Sundari Damodaran Pillai have made the wounds fresh again and the botched attempt at speaking a few phrases in Malayalam or Tamizh to create the illusion of authenticity just grate on the collective sensibilities of an entire region.’ I wanted to attempt a conciliatory, why this Kolaveri di. But better sense prevailed. ‘SRK as Shekhar Subramaniam in Ra.One added culinary catastrophe by mixing in curds with noodles,’ she continued, wrinkling her nose in disgust.\nHindi cinema has created these supposed comedic exaggerations for other socio-linguistic groups too. I reminded Kamala of the intellectual Bengali forever eating shondesh and spouting feminism, as in Rocky Aur Rani and repeated soon after in Aap Jaisa Koi . The quirky nervous Parsis dressed like they are going for a fancy dress party. The Anglo Indian usually named Maria, in a short frilly dress, swaying on the beach or praying in a chapel.\nKamala calmed down as I poured out fresh decoction into a stainless steel tumbler. We may be becoming woke but Bollywood needs to wake up and smell the filter coffee.\n\n",
        "headline_1": "South side story",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/south-side-story/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-08-2025"
    },
    {
        "full_article": "The Supreme Court told people in Bihar who were wrongly removed from voter lists to use their Aadhaar card to re-enroll. But just using Aadhaar won’t fix all the problems. To get back on the voter list, people have to fill a form called Form 6. It asks for your Aadhaar number, and if you don’t have one, you have to tick a box saying so. Aadhaar is also used to prove your age and where you live. This is confusing because the Election Commission (EC) isn’t always clear about whether Aadhaar is required.\nThe confusion is worse because the EC has arguments with political parties, who are important in running elections. Sometimes the EC says parties haven’t raised enough claims about voters being wrongly removed, but the parties say it’s hard because each voter needs a separate form. With 65 lakh (6.5 million) people removed, it’s almost impossible to fix quickly.\nThe EC also seems impatient with political parties, even though it’s the Commission’s job to make sure everyone can vote. Many people are busy with farming or dealing with floods, so they can’t always check the voter lists. By August 25, only about 1.4 lakh (140,000) claims had been received, and only 14,000 sorted out. Political parties have warned that rushing the voter list is a bad idea, especially before big elections.\nIn times like these, the EC’s job is very important. It needs to focus on making fair and accurate voter lists, not arguing with political parties.\n\n",
        "headline_1": "The 65 Lakh Question",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/the-65-lakh-question/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 27, 2025 00:00:00  \nUncertainties over availability of funds to raise the renewable energy to a notable level have become a major concern. The resource constraint is seen as a hurdle in the nation's bid to produce more green energy at a time when country's gas reserve has been depleting fast and uncertainties over the overseas export and manpower markets are looming large. A recent discussion meeting, organized by a local policy think tank, Centre for Policy Dialogue (CPD), was told that renewable energy's share in the national power grid is only 3.6 per cent while fossil fuel-based power dominates with 43.4 per cent. To help reduce the huge spending on fossil fuel imports, it is essential to boost renewable energy. The country, according to an estimate, will have to make an investment of US$42 billion to achieve that by 2040. That is a substantial amount of money. \nThe government does not have the capacity to invest $3.0 billion annually, on average, on renewable energy. The budget for FY 2025-26, for instance, has left little fiscal space in support of renewable energy. Though the FY '25's budget had at least a symbolic commitment worth Tk 1.0 billion for the renewable energy sector, the FY '26 budget of the interim government made no commitment as such for renewable energy. The government's Energy and Mineral Resources Division (EMRD) got a revised budgetary allocation of Tk 10.53 billion, which in US dollar at the current exchange rate is around USD 86.417 million for FY 2025. Now, what share of this budgetary allocation for EMRD would go to develop renewable energy remains a question. So, how can the government hope to achieve its renewable energy objectives as envisioned in its latest energy policy without any fiscal resources earmarked for the purpose? Yes, there is a provision of 10-year tax exemption for renewable energy producers followed by 5 years' partial relief. There is also the provision of duty exemption on the import of equipment related to renewable energy and the facility of selling excess power to the national grid under the Net Metering Guidelines of 2018. These and other such provisions for the renewable power producers and investors are but supportive in nature. Where is the government's own involvement here?\nObviously, the renewable energy policy, 2025 looks progressive. But considering the past performance of the government on renewable energy issue, there is hardly any reason to be overly hopeful about the future. Notably, the policy think tank CPD has termed it 'overambitious'. It is against this backdrop some experts are calling for creating a sizeable renewable energy fund by the government preferably from the national budget to reduce the risks the lenders like commercial banks might face while recovering those (loans) from recipient renewable energy producers and entrepreneurs. To meet the target of sharing 20 per cent of grid capacity by 2030, the country would be required to generate additional 18.162 GW of renewable energy. Similarly, it will have to produce 35.713 GW of renewable power to meet the target of 30 per cent by 2040. Since, mobilization of a huge volume of state resources for investing in renewable energy would be difficult, the government does not have any option other than seeking involvement of private sector and bilateral and multilateral donors. \nSo, to implement its renewable energy strategy successfully, the government, in addition to drawing its own resources as much and possible, will have to create an enabling environment for investors, foreign and local. However, the interim government and any other future government should carefully shun the path the immediate past autocratic regime had chosen to distribute benefit to political cronies using the infamous indemnity law adopted in 2010 for the power and energy sector.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ensuring fiscal space  for renewable energy",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ensuring-fiscal-space-for-renewable-energy-1756226637",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       August 27, 2025 00:00:00  \n\nIn a strategic move to meet the rising demand for farm credit and enhance food security and rural livelihoods, the Bangladesh Bank (BB) has raised its agricultural loan disbursement target for the 2025-26 fiscal year to Tk 390 billion. This marks a 2.63 per cent increase from the previous fiscal year's allocation, signalling the central bank's commitment to support the nation's fast-expanding agricultural activities, which often face funding challenges.\nAnnouncing the revised Agricultural and Rural Credit Policy and Programme for FY 2025-26, BB Governor Dr. Ahsan H. Mansur emphasised the critical role of agricultural finance in fostering rural economic resilience, improving food production and keeping inflation in check. At a press conference he urged commercial banks to ramp up efforts to ensure a consistent flow of credit to farmers, especially smallholders who form the backbone of the rural economy.\nUnder the new policy, the farm loan disbursement target stands at Tk 390 billion. Of this, Tk 139 billion will be provided through state-owned commercial and specialised banks, while private and foreign banks are expected to disburse Tk 251 billion. This underscores the growing responsibility of private financial institutions in supporting agriculture, a sector that still represents only 2.40 per cent of total bank lending-a figure the governor described as \"very low\" given its importance.\nTo address this imbalance, the policy sets out stricter guidelines and accountability measures for all scheduled banks. They are required to design their own agricultural credit programmes aligned with the central bank's policy. If a bank fails to meet its disbursement target, it must deposit the shortfall-without earning any interest-into a BB-managed fund, which will be used to refinance other banks more willing or able to support the sector.\nA key feature of the new farm credit policy is its focus on climate-smart agriculture and the promotion of sustainable farming practices. Recognising the challenges posed by climate change-such as droughts, floods, and soil salinity-the policy encourages financing for irrigation equipment, solar-powered systems, renewable energy applications in farming, and mechanised agriculture. Technological adoption is seen as vital not only for boosting productivity but also for mitigating environmental risks.\nMoreover, the policy places significant emphasis on women's empowerment and financial inclusion. Women farmers and rural entrepreneurs will receive special attention in the disbursement process, aligning with broader development goals related to gender equity.\nThe credit policy also introduces specific sectoral allocations to better reflect current needs and priorities within agriculture. Of the total disbursed funds, 55 per cent will go to crop cultivation, 13 per cent to fisheries, and 2.0 per cent to irrigation and mechanisation. Notably, the share allocated to the livestock sector has been increased from 15 per cent to 20 per cent, indicating a growing recognition of its economic potential.\nExpanding the list of eligible crops for financing is another significant shift. New items such as cucumber, taro stems, beetroot, black cumin, ginger, garlic, turmeric and date molasses have been added. This move aims to diversify agricultural production and encourage farmers to explore high-value and niche crops, which could open up new market opportunities and improve income stability.\nTo encourage credit access among small-scale farmers, the policy also eliminates Credit Information Bureau (CIB) service charges for loans up to Tk 0.25 million. This waiver could help reduce entry barriers for those who need financing the most but are often discouraged by bureaucratic or financial constraints.\nDespite the policy's ambitious scope, its success hinges on effective implementation and active participation from commercial banks, particularly private ones. Historically, disbursement has fallen slightly short of targets. For example, in FY 2025, agricultural and rural loan disbursement reached Tk 373 billion-just below the target of Tk 380 billion and only marginally higher than the Tk 371.5 billion disbursed in FY 2024.\nThere are broader concerns about prioritisation and execution. Credit disbursement strategies need to be region-specific, taking into account variations in climate conditions, crop patterns, and local economic activities. For instance, areas frequently affected by drought or salinity may require different financial tools and timelines from those in more fertile zones.\nMoreover, while expanding the range of eligible farm activities is positive, it can also lead to selective bias. Banks may gravitate towards sectors that appear safer or more profitable, potentially neglecting critical but higher-risk sub-sectors like fisheries and poultry. These sectors, despite being vulnerable, have seen remarkable growth over the past two decades and play an increasingly vital role in rural economies. Ignoring them due to perceived credit risk would be a missed opportunity.\nTo bridge the gap between disbursement and actual credit needs, redefining credit-worthiness is necessary. Agricultural lending cannot be viewed through the same lens as conventional commercial lending. Innovative financing models-such as group lending, crop insurance integration, or mobile banking-based monitoring-could improve both disbursement and recovery rates.\nWithout matching innovation, there is a risk that credit access may remain skewed towards more \"bankable\" areas, sidelining essential but underserved sectors. Hence, the central bank must work closely with financial institutions and agricultural stakeholders to refine and adapt credit criteria in a way that reflects the realities of rural farming.\nThe increased farm loan target and policy revisions by the Bangladesh Bank represent a commendable and timely effort to strengthen agricultural resilience, rural livelihoods, and food security. However, the real impact of these changes will depend on how well the policy is executed on the ground. Prioritising transparency, inclusivity and adaptability will be a prerequisite.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Implementation of revised farm loan policy",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/implementation-of-revised-farm-loan-policy-1756226799",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 27, 2025 00:00:00  \n\nOnce upon a time, shopping in Bangladesh was regarded as an activity where one hunted the best price at the new market or got a custom-made suit at a nearby boutique. Skip ahead to 2025, and the view is quite different. Today, it's no surprise to see rows of luxury cars in Banani, imported watches peeking from boardroom sleeves, or Instagram feeds overflowing with branded handbags and global fashion hauls. So the question is - has Bangladeshis become more brand-conscious than ever before?\nThis certainly seems to be the case. Rising incomes, steady GDP growth and strong remittance inflows have given birth to a confident middle and upper-middle class with significant spending power. At the forefront of this shift are young professionals, freelancers, and entrepreneurs. For them, luxury is not just about quality-it is a lifestyle. It goes beyond fashion; it is identity, prestige, and proof of success in a compressed society, signalled by Gucci sneakers or a Louis Vuitton bag.\n Rocket fuel has been added to this trend by social media. Luxury has become a visual marker of success on platforms like Instagram, TikTok, and Facebook. A snapshot at a five-star brunch or a reel unboxing the latest iPhone is not just content; it is currency in the social media economy. This is why high-end restaurants, rooftop bars and luxury hotels are booming in Dhaka and beyond.\nBut here's the twist: this trend highlights a growing social divide. On the one hand, the affluent embrace a luxurious lifestyle; on the other, many still struggle to access basic necessities. Critics argue that brand obsession reflects a culture of superficiality. Supporters, however, see it as an evidence of economic maturity and Bangladesh's integration into global consumer culture.\nWhether interpreted as a sign of development or a case of social snobbery, one fact remains undeniable: luxury is no longer confined to a tiny elite in Bangladesh, it is fast becoming the new norm. And don't be too surprised if your next-door neighbour's bag says Dior instead of Doel, in a society where status often speaks louder than words.\nSyed Shadman Zahin\nStudent\nSBE,North South University\nsyed.zahin05@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why luxury has become the new normal",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-luxury-has-become-the-new-normal-1756226821",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 27, 2025 00:00:00  \n\nEvery day, thousands of people rush through the roads and streets to reach their workplaces, educational institutions, or markets. But when these veins of the city suddenly rupture, the entire body becomes immobile. So, the city life comes to a halt. Swamibag in the capital is a mirror of that paralysed existence. From early morning, excavation work begins on the main road of Swamibag, creating a crisis. Mud from the cut sections in the middle of the road spreads across the entire street. Those who left home for offices or schools in the morning find themselves trapped in mud by noon. In some places, the mud reaches knee-deep; in others, upto waist. People slip and get injured, clothes ruinedand some struggle helplessly to return home.\nSimilar situations repeat in various parts of the city. The picture is the same, the problem is the same-only the location changes; the suffering does not.\nThe primary cause of Swamibag's current plight is a lack of planning. Alternative routes were not arranged before the digging. The solution is not a mystery. With a bit of awareness and planning, such suffering can be avoided. Informing locals before work begins, keeping alternative routes open, scheduling work outside office and school hours, using modern machinery to finish quickly-these are not new concepts. Yet, surprisingly, they are ignored every time.\nMd. Rished Ahmed, Student\nDepartment of Mass Communication and Journalism\nJagannath University, Dhaka\nmdrishedahmed@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Road digging, citizens' suffering",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/road-digging-citizens-suffering-1756226842",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-08-2025"
    }
]