[
    {
        "full_article": "The principal rival fronts in Bihar have finally announced incumbent Nitish Kumar and Tejashwi Yadav as their respective chief ministerial candidates after weeks of speculation and haggling. The National Democratic Alliance (NDA), around the Bharatiya Janata Party (BJP)-Janata Dal (United) axis, and the Mahagatbandhan, or Grand Alliance, around the Indian National Congress-Rashtriya Janata Dal (RJD) axis, are caught in their internal games of one-upmanship. The delay in the announcements by both fronts suggests that their chief ministerial candidates are more a result of compulsions than any convergence of minds. The BJP had clearly indicated in recent weeks that the choice of Chief Minister would remain open before it made a turnaround to endorse Mr. Kumar for yet another term. The BJP is a bigger party in the outgoing Assembly, though Mr. Kumar is the Chief Minister. The saffron party sees an opportunity now to claim the top post, given the evident slowing down of Mr. Kumar, who is 74. The Lok Janshakti Party (LJP), another NDA constituent, is also hostile to Mr. Kumar. As it turned out, the BJP concluded that growing public perception that Mr. Kumar may get replaced, was damaging the NDA’s prospects. Though he is aging and faltering, Mr. Kumar continues to command enough of a following in Bihar for the BJP to fall in line behind him, at least until the election is over.Something comparable has happened between the Congress and the RJD. The Congress was reluctant to endorse Mr. Yadav initially, but then gauged that any further confusion on the leadership question could undermine the alliance, which has other challenges too. While Mr. Yadav has the support of a notable and articulate segment of the population, he is also resented with equal ferocity by the sections of the rest. By declaring Mr. Yadav as the chief ministerial candidate, the Grand Alliance is trying to first consolidate its Yadav base before seeking to expand it. The chief ministerial faces of the NDA and the Grand Alliance pull a lot of weight but also face a crisis of legitimacy and public scepticism for various reasons. Neither front is in a position to push for new possibilities in leadership and vision, and in such a situation, Bihar’s voters might consider other options if available. Prashant Kishor’s Jan Suraaj Party is trying to place itself as a platform for those who are tired of Mr. Kumar and Mr. Yadav. It is still a long shot for Mr. Kishor, but the confusion and delay before the tentative clarity suggest that all is not well in the other two alliances. Published - October 27, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Bihar\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        National Democratic Alliance\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Janata Dal (United)\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        Rashtriya Janata Dal\n                    \n                            /                      \n                        \n                        Lok Janshakti Party\n                    \n                            /                      \n                        \n                        Jan Suraaj Party\n                    \n                            /                      \n                        \n                        politics and government\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        political process (retired)\n                    \n                            /                      \n                        \n                        political parties and movements (retired)",
        "headline_1": "​Clarity and confusion: On the Bihar election preparations, the rival fronts",
        "headline_2": "Both the National Demodcratic Alliance and the Mahagatbandhan are dealing with internal divisions",
        "link": "https://www.thehindu.com/opinion/editorial/clarity-and-confusion-on-the-bihar-election-preparations-the-rival-fronts/article70205315.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-10-2025"
    },
    {
        "full_article": "The government has announced a list of 24 individual scientists and a team as recipients of the second edition of the Rashtriya Vigyan Puraskar (RVP) awards, conferred by the Centre for scientific achievement. As in 2024, this year too has four broad categories: the Vigyan Ratna, Vigyan Shri, Vigyan Yuva-Shanti Swarup Bhatnagar award and Vigyan team award. The Vigyan Ratna and Vigyan Shri are for scientists who have made distinguished contributions over their lifetime, and recent distinguished contributions respectively. The Yuva is for individuals under 45 and the final one for a team endeavour in technology development.In theory, the total number of awards, under all categories, is capped at 56; though this year, there are fewer than the 33 awarded last year. The award announcement has been delayed by several months, but this could indicate greater scrutiny of potential awardees. It is important to note that unlike earlier editions of national science awards, for instance the Shanti Swarup Bhatnagar (SSB) awards, there is no cash component given for the RVP, to align with the spirit of the Padma awards. But scrutiny is a double-edged sword. Last year, it emerged that some scientists were told about being recipients, only to be informed later that their names had been dropped. Several prominent scientists across India wrote to the Office of the Principal Scientific Adviser (PSA), demanding transparency in the process of award selection. There were concerns that factors other than scientific merit — for instance, criticism of government policy and political ideology — may have played a role. The PSA has not categorically responded to these demands except to point out that the selection committee, called the Rashtriya Vigyan Puraskar Committee (chaired by the PSA and which includes Secretaries of Ministries and members of scientific academies), “recommended” awardees to the Minister of Science and Technology. It is not explicit whether the Minister can overturn a recommendation made by the committee. The RVP awards were instituted after the Ministry of Home Affairs and heads of science departments concluded in 2022 that there were too many awards being given out by individual scientific departments and, hence, necessary to trim them and raise their ‘stature’ to national awards. While awards such as the SSB awards too were finalised in consultation with the Science Minister, the centralisation and the explicit attempt to make the RVP ‘Padma-like’, means that they appear far more politicised than they ought to be. If the aim of the RVP is to increase ‘stature’, the government must be seen to have an explicitly hands-off approach and let scientists judge the excellence of their peers. Published - October 27, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        science (general)\n                    \n                            /                      \n                        \n                        award and prize\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        award and prize\n                    \n                            /                      \n                        \n                        human interest\n                    \n                            /                      \n                        \n                        science and technology",
        "headline_1": "Hands-off approach: On the Rashtriya Vigyan Puraskar awards",
        "headline_2": "Scientists are the best judges of excellence in science",
        "link": "https://www.thehindu.com/opinion/editorial/hands-off-approach-on-the-rashtriya-vigyan-puraskar-awards/article70205328.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-10-2025"
    },
    {
        "full_article": "There’s no match for what comes from the heart\nRecently, I encountered a ghost from my literary past – a former college junior stopped me mid-stride on Bengaluru’s Church Street to reminisce about how my poetry had helped him win over a girl 20 years ago. Their romance didn’t last, but apparently my verses had staying power. As he walked away with a nostalgic smile, I couldn’t help but wonder: would today’s campus Casanova even need a poet?\nBack in our day, the campus poet was an essential ecosystem player. We were the lyrical guns-for-hire, the emotional mercenaries of university life. Need to impress someone? Commission a sonnet. Planning a protest? We’d craft your chants. Broke and hungry? We could rhyme for food. Our verses lubricated the gears of campus romance, rebellion, and self-expression. We were the original ghostwriters, crafting emotions for those who felt deeply but couldn’t find the words. We gave shape to longing, lent voice to heartbreak, and added rhythm to the ordinary. \nThe campus poet occupied a peculiar niche in the academic food chain. We weren’t quite the tortured artists holed up in coffee shops, nor were we the published poets with book deals. We were something more pragmatic – poetic entrepreneurs, if you will. A few of us even gained fleeting fame, our words scribbled on hostel walls or whispered at cultural nights.\nBut now? ChatGPT can churn out a love poem faster than you can say ‘roses are red’. The algorithm never gets writer’s block, never pines for an audience, never stays up all night reworking a stanza. Meanwhile, like vinyl record stores in the age of Spotify, today’s campus poets face an existential crisis, as the democratisation of verse makes poets of everyone and customers of no one. \nYet, something vital is lost when poetry becomes instant and transactional. The pauses, the imperfections, the vulnerability – they’re what made our verses human. As our carefully crafted metaphors compete with algorithmic alliterations, the campus poet says he’s still not done and that there’s no match for what comes from the heart. \nAI can rhyme, like bells can chime, write you a line and take no time,\nBut be not fooled, it’s got no heart, and what’s a poet without that?\nNo burden of past, no eyes to weep, its thoughts are just what wires keep,\nIt feels no joy and feels no pain, sings in code – a ghostly strain!\n\n",
        "headline_1": "Campus poets vs AI",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/tell-tale/campus-poets-vs-ai/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-10-2025"
    },
    {
        "full_article": "Indie dog breeds have suffered colonial, then postcolonial belittling. But India is finally doing better  \nGive a dog a bad name…and you know what happens. And it has very much happened to our indigenous breeds. Before colonial rule, Indian dog breeds were valued at home. Their speed, strength and loyalty also meant that they were sought after abroad. Ancient Greek, Roman and Chinese records indicate they were recognised as distinct and superior. But British rule saw a deep reversal of such ideas. As their kennel culture and their standards of ‘breeding’ and ‘purity’ took root, Indian breeds came to be seen as inferior, mongrels, ‘street dogs’, even ‘pariah dogs’. A counter-reversal is being attempted at the institutional level and this is very much the right thing to do. \nBSF, for example, is now deploying 150 Rampurs and Mudhol Hounds across the country, from Thar desert to Tawang. Indie breeds, it is now beginning to be seen, are better adapted to Indian conditions. This shift wouldn’t have taken so long if our colonial inheritance hadn’t been topped up with long, postcolonial inertia.  During decades of a closed economy, the imported-is-good and local-is-bad binary stultified. And this socialist overhang continued even afterwards.  Pugs, Shihtzus, Rottweilers…have carried status like designer bags and cars. Police and military systems did not really pursue independence from imported breeding and training manuals either.\nWith atmanirbhar lens, we can see that what we have, what we have always had, is not of poor quality. But to go from understanding to implementation won’t happen overnight. BSF began by studying the parent generation of breeds like Mudhol and Rampur Hounds, then introduced the second generation to socialisation and foundational training, and commenced methodical training only with the third generation. Rebuilding a sundered relationship will take time, dedication and systemic will. And this time, let’s be smarter, and not be sniffy about what we have. A 5000-year-old civilisation has plenty to offer.\n\n",
        "headline_1": "Woof! It took long",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/woof-it-took-long/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-10-2025"
    },
    {
        "full_article": "That visiting cricketers were molested speaks to how India treats the issue of women’s safety\nMP cops are advertising their quick arrest of the man accused of molesting two Australian women cricketers. The team was in Indore for ICC Women’s World Cup. But that barely begins to address the issue. That two cricketers were assaulted in broad daylight, just a few hundred metres from their hotel in the poshest part of town, is not just a matter of shame for a cricket-loving country hosting a high-profile international tournament, it also reinforces the perception that women aren’t safe in India’s public places. \nNote that several countries, including US, UK, Canada and Australia, have travel advisories for women visiting India. The latest incident will only go to justify those. Second, where were the security protocols for a high-level international event? BCCI has offered to revise its safety systems. But the damage is already done. India hopes to host other big international tournaments in future. Ahmedabad has been recommended as the host city for 2030 Commonwealth Games pending final confirmation. India is also vying to host Olympic and Paralympic Games in 2036. Ensuring safety is a key part of these processes. And the Indore incident doesn’t inspire confidence.\nThis is also one of the reasons why India doesn’t realise its full tourism potential. Last year, the country saw 9.9mn foreign tourist arrivals. Much smaller Thailand saw 35.5mn foreign tourists. This costs India – because tourism provides one of the largest returns per rupee invested. Given India’s many tourism spots, the sector could have generated a much larger number of jobs, particularly for the youth. But it badly underperforms.  \nFinally, security cannot be addressed in silos. If India’s women, who face daily harassment in public spaces, are not safe, no amount of security protocols for foreign female athletes or tourists will help. You can’t have security for the elite without security for ordinary folk. And that means a far higher conviction rate for sexual violence and offences. The all-India conviction rate for rape cases that went to trial is less than 3%. Clearly, a vast majority of offenders in sexual violence cases evade justice, emboldening other predators. Yet the response of the political leadership is to politicise the issue and score points against political opponents. Lack of safety for women will endure unless there is wholesale reform in policing and the justice delivery system. India’s women deserve far better.  \n\n",
        "headline_1": "What Indore tells us",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/what-indore-tells-us/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-10-2025"
    },
    {
        "full_article": "Biharis who migrate for work remain embedded in caste, class networks of home. Parties tailor their messaging accordingly. And whether a migrant votes depends on his/her ability to absorb income loss from work foregone. And here, whether parties compensate for lost earnings is a crucial factor\nCandidate nominations for the final phase of Bihar polls ended yesterday. Almost every candidate who clears scrutiny will, aside from working local caste networks, keep a sharp eye on migrant voters. Bihar’s five million migrants, many local pundits say, are key to the outcome of the political contest.\nRead full story on TOI+ \n\n",
        "headline_1": "Bihar: The migrant vote",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/bihar-the-migrant-vote/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 27, 2025 00:00:00  \nThe bustling megacity of Dhaka has long been mired in a series of public nuisance, which earned it the dubious distinction of being one of the least liveable cities in the world. One would expect the government to take determined and effective steps to gradually address this mess, ensuring that living conditions for city dwellers improve and the city sheds this opprobrium. Ironically, however, the situation is seemingly getting worse, not better, by the day. Take, for example, the problem of illegal occupation of footpaths and roadsides by hawkers. These days, this long-standing problem seems to have reached a menacing proportion. In many areas it has almost become impossible to walk on the footpath. The problem has come to such a pass that even the sides of the railway tracks are not being spared. A recent picture published in the Financial Express shows hawkers not only set up makeshift shops on both sides of the rail tracks in the city's Jurain area, but also tuck themselves into the narrow space between the parallel lines. \nUnder the politically elected government, it was often alleged the city authorities could never free the footpaths from illegal occupation because of an unholy nexus between politicians, the police and musclemen. This illegal practice is sustained by a massive amount of daily toll collection from spot selling of footpaths and roadsides. But the interim government is not a political government. Why, then, has it failed to take a decisive action against this rampant illegal business that so brazenly occupies public space and inflicts immense distress upon commuters? Is this inaction a sign of weak governance, indifference, or a mere continuation of the same laxity that has plagued the city for years?\nThen there is the problem of unbridled growth in the number of battery-run auto-rickshaws, which has made city rides riskier and traffic jams worse. These auto-rickshaws are not supposed to be allowed to run on the main roads, but over the last year or so, the auto drivers have been enjoying so much freedom that they are freely plying from one end of the city to the other, breezing through flyovers, zigzagging across lanes and even using the wrong side of the roads, making the city's traffic a total mess. \nThe proliferation of illegal hawkers and auto-rickshaws are just two of the long list of civic menaces city dwellers are grappling with daily. Whether it is the encroachment of footpaths or the brazen disregard for traffic laws, the common denominator is regulatory failure. Now, the big question is, how can the city get rid of this mess. At this stage of massive accumulation of civic blights and a lack of effective leadership in city corporations, there is little to no chance of the situation being improved. Earlier, a task force formed by the interim government recommended unifying the two city corporations and introducing a city governance system where a single entity, headed by an elected public representative, would be responsible for the overall planning, coordination and delivery of all urban services. Regrettably, the proposal has remained stuck on paper. The interim government, therefore, must straighten things out and accelerate the process of handing over the responsibility of governance into the hands of elected representatives. Only the quality of future leadership, political will and radical solutions like decentralisation and implementation of city governance offer hope.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The mess that is Dhaka",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-mess-that-is-dhaka-1761491852",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       October 27, 2025 00:00:00  \nThe middle-to-low-income earners, who mostly belong to the fixed income groups in society, are gradually failing to hold on to the socio-economic categories, such as the middle-income groups, they have traditionally been bracketed into. Such developments have occasionally been the stuff of the socio-economic studies. These social researches and studies and reports on them have, of late, been making news with boring repetitions. According to the Bangladesh Bureau of Statistics (BBS), point-to-point inflation in Bangladesh inched up to 8.36 per cent last month (September) from 8.29 per cent in August. Food inflation, on the other hand, was recorded at 7.64 per cent in September, up from 7.60 per cent in August. Non-food inflation stood at 8.96 per cent in September, marking a slight increase from 8.90 per cent in August. Now, what impact have these relentless increases in the rates of inflation on the incomes of the fixed-income people, particularly in the so-called, middle-income and low-income categories of population, left? \nWhatever raises they had in their wages/salaries at least on paper meanwhile have been eaten up by food inflation and increases in a hundred and one expenditures in their day-to-day lives. The latest BBS data further show that wages grew by 8.02 per cent in September down from 8.15 per cent in August and 8.19 per cent in July. So, it is a case of double whammy the fixed income groups have been hit by in the months being discussed. Reports further have it that as of last September, it has been for the 44th month that inflation has outpaced the wage growth as experienced by the socio-economic categories of population under consideration. This report only confirms historical records of what these segments of the population have already been going through. But those apparently boring and uninteresting news reports on the falling income levels of the people who are also society's conscious section as they belong to the larger educated class and hence opinion-makers in society are obviously a social force to be reckoned with. History has ample evidences of how disgruntled middle classes led revolutionary upsurges in countries across the world both in the past and in recent times. Our own July uprising of 2024 and the youth revolt in the neighbouring Nepal are instances of what urban and educated youths who by default belong to the social middle class are capable of. Our university and college students who called their movement against autocracy as one against discriminations belong to the middle class families that were deeply affected by income disparity in society. Once the middle-income people take to the streets with their grievances, other groups of society including the low-income groups and the working class join in. Though members of the working class often take out militant protest demonstration to press home their various economic demands, they cannot engage the rest of society in their struggles. But when the middle-income group or the middle class joins the movement, it often takes the shape of social upheavals, even revolutions. This is the reason why social research and study groups are especially concerned about the changes in the income levels of middle-income as well as those of the low-income categories of population. An important point to note here is the characteristics of the middle class in the post-colonial societies which, as in our own case, are also economically and culturally rooted in their feudal past. But the middle class of the industrial societies are basically the managerial and professional classes with high discretionary incomes and culturally driven by individualism. \nBut the middle class of post-colonial societies as in South Asia is still held together by strong familial bonds, which is not the case with the middle class people of the industrial societies of the West. So, the middle-income groups of the post-colonial, least developed as well as developing societies in Asia and Africa are economically more vulnerable than their counterparts in the highly industrialised societies, especially in the West. \nIn that case, the government should be especially attentive to the economic woes of the middle and low-income people, if only to ward off a social upheaval similar to or more disruptive than the one the nation experienced in July 2024. To be frank, the present situation of the socio-economic classes under scrutiny in Bangladesh can be likened to a time device dangerously ticking away to detonate at an unspecified point of time.\nBut how is the government currently in office, or the political party waiting in the wings to form government following the next general elections prepared to meet the stress that is fast building up in society? To all appearances, they are not. The July upsurge seems to be quite lost on them as they are still engaged in the traditional culture of demonstrating their political muscle through mobilsation of party goons and rent-seeking. But had they learnt anything from the ouster of the previous dictatorial regime through student-led mass uprising, they would be alert to the evolving socio-economic issues and to how a large segment of the population previously belonging to the middle class are fast getting pauperized!\nIt appears, the traditional ruling classes live in a state of timelessness where life does not change. So, once voted into office, everything would be fine, they believe. \nBut given the developments in the socio-economic landscape on the economic front, it may not prove to be an easy ride for any elected government of the future. The persistently falling curve of income of the fixed income people since 2022 with no sign of letup in the near future is an ill omen they need to take serious note of. So, they would do well to include in their election manifesto a guideline on how they are going to tackle the issue after getting elected. But so far, except for a lot of familiar and high-sounding, though empty, rhetoric, nothing of substance could be heard from their side.\nThis is anything but reassuring, especially when going by the BBS Wage Rate Index, across 63 occupations including industry, agriculture and services, wage growth in all eight administrative divisions of the government have demonstrated a negative growth as of last month (September). Notably, the worst performer of all was the southwestern division of Khulna. That is nothing surprising since the overarching impact of unrestrained rise in inflation has hit the wage earners of this traditionally neglected part of the country the hardest. \nBut are politicians hailing from this region aware of these challenges facing them and ready to address those if they are elected in the next polls?\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Danger that people's persistent income loss poses",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/danger-that-peoples-persistent-income-loss-poses-1761491882",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       October 27, 2025 00:00:00  \nPlanting tree is his passion. Badshah is his given name. He deserves the name without any reservation because his heart is as large as any benevolent and legendary badshah ever possessed for showering kindness. Contrary to the grandeur of the name, this Badshah is a day labourer. But the unwavering mission he has embarked on for the past 20 years is a testament to the richness and resourcefulness of a human being extra ordinaire. The focus a leading Bangla contemporary has directed on him is no doubt a tribute to the man's noble mission. But he deserves even more for his passion, dedication, sacrifice and commitment to the cause without expecting any reward. \nLocal people have rightly added the epithet, 'gacher bandhu' (friend of trees) before his name. Once derided or laughed at, even physically assaulted, Badshah Mian is credited to planting about 30,000 trees---all of which are fruit-bearing local trees. This man from a remote village of Peerganj, Rangpur had his inspiration from a moving incident involving his two children. Way back in 2004, a mango and jackfruit trader was passing by on way to the market right at the moment he, his son and daughter happened to be on the roadside in front of his house. The kids asked their father to buy some fruits for them but he had no money to fulfil their demand. \nThis set Badshah Mian to thinking. If he cannot buy fruits for his children, poor neighbours like him also cannot afford such a treat. He came up with a solution to the problem. The day labourer decided to plant fruit trees on unused roadside or fallow lands near schools, mosques and other public places. It was in 2005, that he faced the greatest test when some owners of land adjacent to the road uprooted saplings he planted. Frustrated, he gave up and thought that was the end of his dream. But a man with a mission, he got enough inspiration the next year and has continued ever since. \nHow passionate he is about his mission is highlighted by his decision he arrived at on consultation with his wife. One fourth of his income from working as a day-labourer, would be spent on tree plantation. No, he does not appeal to others for money, instead gifts saplings to others requesting them to plant those and take care. The nobility of his heart that beats now in the bosom of 72 years announced its amazing capacity for loving trees when in 2005, he had no money to fence the 150 tender plants of mango and jackfruits he planted. Finding no other alternative, he sold the earrings of his daughter to make fences around the saplings. \nWhat Badshah Mian has done few can do in one's lifetime. A man considered illiterate in the conventional term, he is wiser than the run-of-the-mill educated people. How can a person convince himself and even his wife to set aside one-fourth of the meagre income for the cause of greening the 15 villages in his area! He claims no credit for this but he is highly gratified when villagers eat the fruits of trees he plants and take rest under their shade. He seems to be intuitively wise because he chose to plant only the indigenous saplings of fruit trees instead of the trees valued for their timbers. His motivation comes from within.\nLet the man be celebrated for his extraordinary performance. He is an unsung hero who has been carrying his mission without caring for publicity. The yearly official ritual of tree plantation weeks or month starts with a bang and mostly ends in a whimper. Those events are marked by photo sessions producing hardly any tangible results. People like Badshah Mian quietly carry on their lone campaign and become successful because they believe in themselves, respect Nature, its ecosystem and the inborn mental broadness to share the fruits of their success with millions of their fellow human beings.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Close to Nature, Badshahs  work wonder",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/close-to-nature-badshahs-work-wonder-1761491975",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 27, 2025 00:00:00  \n\nLast year, potato farmers were pleased with their earnings, selling crops at Tk 50 to 60 per kg and making a healthy profit. Encouraged by this success, many more farmers decided to cultivate potatoes this year.\nHowever, the result has been disastrous. With huge supply of potatoes to the market, prices have plummeted, forcing farmers to sell at a loss. Many took loans from banks and now struggle to repay them, sinking into serious debt.\nDespite requests for government intervention, little has been done to alleviate the situation. This is alarming. If farmers cannot earn from a good harvest, they may be discouraged from cultivating in the future, potentially leading to food shortages nationwide.\nTo address this crisis, the government must act quickly. Exporting surplus potatoes to other countries could stabilise the market, while financial support for affected farmers would help them survive this loss.\nImmediate measures are essential. Failing to support our farmers now risks a serious food crisis in the years ahead.\nMd. Azam Khan\nFaridgonj, Chandpur\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Farmers in trouble after good harvest",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/farmers-in-trouble-after-good-harvest-1761492003",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-10-2025"
    }
]