[
    {
        "full_article": "The massacre of 26 people, most of them tourists, in Pahalgam, Kashmir, by Islamist terrorists has jolted the conscience of the nation and the world. It is a tragic reminder of the constant threat of terrorism, which strikes without warning at innocent civilians. The mind-numbing reports of the attackers identifying victims by religion before executing them at close range mark a new low in the history of Pakistan-sponsored terrorism. Home Minister Amit Shah, who visited the attack site, asserted that “Bharat won’t bend to terrorism,” while Prime Minister Narendra Modi curtailed his visit to Saudi Arabia to return to New Delhi. India must speak in one voice in this period of national calamity. It is imperative to avoid internal divisions that could threaten social cohesion. The unity of the Indian people is the most potent antidote to terror instigated from across the border. Amid the horror, a local Muslim man tried to shield the tourists but lost his own life in the process. Widespread protests across Kashmir following the incident also signalled a rejection of such violence by ordinary citizens. The victims hailed from all parts of India, reflecting the diversity of those who were drawn to Kashmir as it re-emerged as a favoured tourist destination. The attack has disrupted not just lives, but also livelihoods in a region economically dependent on tourism.New Delhi’s response must address the people of Kashmir, the broader Indian public, Pakistan, and the international community. Since 2019, India has followed a new policy approach in Kashmir, strengthening infrastructure and connectivity to integrate the region more closely with the rest of the country. Yet, the broader global environment has grown more volatile, with internal instability and international conflicts on the rise. India’s strategy must be guided by realism grounded in national interest and devoid of empty rhetoric as it seeks to isolate Pakistan, whose export of terrorism is predicated on the two-nation theory and Hindu-Muslim hostility. The national resolve must be firm and focused in the face of terror as the government does everything possible to swiftly bring the perpetrators to justice. Published - April 24, 2025 12:48 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        act of terror\n                    \n                            /                      \n                        \n                        Jammu and Kashmir",
        "headline_1": "Unity and resolve: On the Pahalgam terror attack",
        "headline_2": "India must remain firm and focused in the face of terror",
        "link": "https://www.thehindu.com/opinion/editorial/unity-and-resolve-on-the-terror-attack-in-pahalgam/article69484027.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-04-2025"
    },
    {
        "full_article": "U.S. Vice-President J.D. Vance’s first visit to India was marred by the brutal terror attacks in Pahalgam, but his messages of solidarity with India, even as he chose to continue his family vacation at the Taj Mahal, have been appreciated in New Delhi. Visits by American Presidents to India have been rare, other than for ceremonial reasons, and Mr. Vance is the first American Vice-President to travel to India in 12 years, after Joseph Biden visited in 2013. The visit was a “largely private” affair, as Mr. Vance, his wife of Indian-origin Usha Chilukuri Vance, and their three children took in the sights in Delhi, Jaipur, and Agra. The visit provided for a quick review of decisions made during Prime Minister Narendra Modi’s trip to the U.S. in February, although the Vance-Modi talks on Monday did not produce substantial outcomes apart from an announcement that the terms of reference for the Bilateral Trade Agreement (BTA) being negotiated in Washington had been finalised. They also provided for a chance to discuss U.S. President Donald Trump’s visit to India later this year for the Quad Summit, and plans for Indo-Pacific strategy. It is unclear whether Mr. Modi raised India’s concerns over a number of issues with Mr. Vance, including U.S. tariffs and their impact on the global economy, the U.S. crackdown on immigration, as well as the recent revocations of visas issued to hundreds of foreign students, more than half of whom were Indian, according to a survey.However, at a public address in Jaipur, Mr. Vance responded to some of the criticism of the Trump administration’s actions. Rather than seeking to “start a trade war”, Mr. Trump hopes to “rebalance global trade”, Mr. Vance said, and outlined the BTA as a “final deal” for “fairness”. He also raised the need for India to drop “non-tariff barriers” that stop U.S. access to the Indian market — understood to relate mainly to selling agricultural produce and dairy products, a sensitive issue in India. On defence, Mr. Vance said that India was a trusted partner for co-production of U.S. defence hardware, and repeated Mr. Trump’s offer of F-35 fighter jets. He criticised previous U.S. governments for cutting back on fossil fuel energy production, and said Mr. Trump’s policy of “drill, baby, drill” would be to India’s benefit if it increases the purchase of oil and natural gas from the U.S. Finally, he stressed the importance of amending India’s nuclear liability law so that U.S. companies would feel comfortable in setting up nuclear power plants in India. Broadly, Mr. Vance’s effort during his visit to India was to underline the importance of statements and demands already made by President Trump. New Delhi must consider carefully what it seeks from the U.S. in return, as thus far Mr. Modi and his ministers who have travelled to the U.S. have been in “listening mode”, studying the Trump agenda rather than reacting to it — whether it is in the area of geopolitical moves regarding the Russia-Ukraine conflict and Israel’s war on Gaza, or those spurring global trade disruptions. Published - April 24, 2025 12:45 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India-United States",
        "headline_1": "Talking mode: On U.S. Vice-President J.D. Vance’s visit to India",
        "headline_2": "India must be firm in negotiations with the U.S. on trade and tariffs",
        "link": "https://www.thehindu.com/opinion/editorial/talking-mode-on-us-vice-president-jd-vances-visit-to-india/article69484011.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-04-2025"
    },
    {
        "full_article": "Profit crash forces world’s richest man to think whether he must leave Trump to save Tesla\nIn 2018, Elon Musk launched his personal Tesla Roadster into space with a mannequin named Starman in the driver’s seat, and a ‘Don’t Panic’ sign on the dash. He could have used that sign now when things aren’t going to plan. Tesla’s Q1 sales are down 13%, and net income 71%. Used Teslas are 10.1% cheaper than last year, although used cars overall are 1% dearer. Meanwhile, sales of Tesla’s biggest rival, BYD, have grown 60% in the same period. Tesla’s stock is down to $238 from $480 in mid-Dec, and Musk has seen his own net worth dip below $300bn briefly, from $400bn-plus last Dec.\nSomething has surely hit the ceiling for Musk to announce he’ll take a back seat at DOGE, where he’s been slashing and burning entire federal departments to cut govt spending. “Starting next month, May, my time allocation to DOGE will drop significantly,” he said on Tuesday. US law allows “special govt employees” like Musk to work 130 days in a year, so his term doesn’t end until late May. He’s clearly retreating to save Tesla.\nBy endorsing Trump and MAGA, Musk has alienated environmentally conscious, liberal-minded Americans, who typically buy Teslas. In Europe also, he’s riled prospective buyers by backing far-right candidates. Tariffs have meanwhile made his pricier Model S and Model X cars unsaleable in China. While BYD has announced lightning-fast charging and a new luxury car over the past few weeks, Musk, in his own words, has been “stretched pretty thin. I have like 17 jobs.” Hence, the reboot. With $20bn worth of govt contracts, Musk can’t go back to describing Trump as “not the right guy…doesn’t seem to have the sort of character that reflects well on the United States”, but he’ll have to change course for Tesla’s sake. \n\n",
        "headline_1": "Markets beat Musk",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/markets-beat-musk/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-04-2025"
    },
    {
        "full_article": "How GOI can add to its first set of responses & put Pak’s military-terrorist complex under the cosh\nGOI has retaliated swiftly to the Pahalgam attack, with the Cabinet Committee on Security chaired by Modi taking four key decisions – suspension of Indus Water Treaty, closure of Attari border checkpost, suspension of visas for Pakistanis, and withdrawal of defence advisers in each other’s high commissions. Here are four other measures GOI can consider to further ratchet up the pressure on Pakistan.\nFirst, a military-security response that specifically targets the terror perpetrators. For, a wider confrontation with Pakistan is precisely what Islamabad wants at this point. The Pahalgam attack was designed for maximum mileage. Islamabad is desperate for global attention to distract from its own, existence-threatening domestic failings. It wants Washington, Beijing and the Arab states to get involved. New Delhi, therefore, shouldn’t take the bait. Instead, let’s hit Islamabad where it hurts by working more closely with Kabul and Tehran. \nSecond, the attack took place when Modi was in Saudi Arabia. Riyadh in recent years has invested a lot in curbing radicalism and terror financing. Yet it continues to economically bail out Pakistan – perhaps as an insurance against Iran. But it’s time India calls in the good relations it has cultivated with Gulf Arab states. If they want to actualise a modern, post-oil vision for their countries, they need India, not Pakistan. India-Middle East-Europe Economic Corridor has huge potential. China-led BRI that goes through Pakistan sees this as a threat. Therefore, New Delhi must urge Gulf states to financially cut off Pakistan, which has become an impediment to regional security and development. \nThird, China today is Pakistan’s all-weather friend and biggest benefactor. But with Trump in Washington, Beijing wants to restore cordial ties with India. So here’s the first test that New Delhi must put to Beijing – get Islamabad to crack down on anti-India forces. If Beijing follows through, there can be progress on bilateral ties. If it doesn’t, we will know that China will never abandon terror-sponsor Pakistan. \nFourth, Trump holds no candle for Pakistan. The last time he was president, Pakistan was placed on the FATF’s grey list for money laundering and terror financing. Pakistan was taken off the list in 2022. After Pahalgam, New Delhi and Washington must work together to put Islamabad in the doghouse again and restart increased  FATF scrutiny. Plus, there are many Republican Congressmen and Senators who have been calling out Pakistan’s militarist ‘hybrid regime’. New Delhi must work with them to pursue sanctions against Pakistani military elements that support terrorists. It’s time to put Islamabad under the cosh.   \n\n",
        "headline_1": "Hit ’em hard, smartly",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/hit-em-hard-smartly/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-04-2025"
    },
    {
        "full_article": "Raj (not Makepeace) Thackeray jumps on banwagon\nMy joined-at-the-lip columnist, Jug Suraiya, wrote on Tamil Nadu CM Stalin’s battle against infiltrating Hindification. Now Maharashtra’s desperately-wannabe-CM, Raj Thackeray, has joined Word War too, leading to All Unquiet on the Western Front as well. With all guns blazing, Raj T wants to enforce the use of Marathi instead of not just Hindi, but also English. Bank of Maharashtra staff even had to ask for protection against his stormtroopers.\nThis now-toothless tiger’s latest rampage is of a piece with his aggressively cultivated image as last remaining champion of the original Shiv Sena raison d’être: ‘tod-phod party’. But Balasaheb’s hotheaded nephew tod-phodoed the party itself, forming breakaway MNS in 2006, after uncle anointed his own (milder) son Uddhav successor. Now both cousins are desperately seeking relevance, which has led to this week’s talk of rapprochement. If that actually happens, it will be quite a Tamasha for Marathi and ‘Marathi Manoos’.\nBut there are no ‘ifs’ about forcible Hindi jaw-jaw leading to war-war. From South to East, the battle has been joined against this covert neo-colonialism by Hindi-speaking imperialists. ‘Impose and rule’ is being seen as their strategy. Seize reins via Trojan Horse of ‘logical’ three-language formula, their tactic.\nParanoia? Really?! There’s no such thing as surrogate mother tongue. Those not born to Hindi will suffer growing disability nationally. Globally too thanks to parallel lowering of English. Language is so emotive a tie that it unknotted Pakistan in 1971. Why, in the linguistic reorganisation of 1956, our own old state boundaries came to naught.\nLet non-BJP states reject a double engine, in schools as in sarkar. Fine. But if, next, each wants to drive only its own track, cross-border communication will get totally derailed. Already in alienating tower blocks, neighbours of different stripes don’t speak to one another. Imagine if people from different states can’t speak to one another. We’d end up like that verse about Boston ‘Land of the bean and the cod/Where the Lowells talk (only) to the Cabots/And the Cabots talk only to God.’\nThe possibility should leave you speechless.\n                                            ***\nAlec Smart said: “Paradise lost. ‘Normalcy’ gunned down. Who will Rest in Peace?”\n\n",
        "headline_1": "Bharat that is Hindia?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/bharat-that-is-hindia/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-04-2025"
    },
    {
        "full_article": "Authored by: Dadi Ratanmohini\nQuality of our vibrations depends on the quality of our thoughts and feelings. We create thousands of thoughts in a day, and every thought carries a feeling with it.\n\nSome of these thoughts and feelings are beautiful, pure, and positive, while others are impure and negative. All these travel and touch other souls and physical nature. Hence, the quality of our thought vibrations, feelings, belief system or attitude holds the key to better or batter our life, relations, society, nature and environment.\n\nOur daily life gives us many choices of what to do and how to do it to the best of our ability. The decisions we make in each of them reflect our values. Whether it’s our care, patience, sincerity, or gratitude, values always give direction and add meaning to life. If our thoughts, words and behaviours are in line with our values, we feel comfortable. But if we compromise, deviate or give up values, we regret it sooner or later.\n\nYou create a compass of values and use it to guide your choices and decisions. But as you set out into the world, you notice people around you are compromising their values. At those moments, do you get tempted to drop yours?\n\nValues are our strength. Even if nobody is using them, and even if others believe these don’t work, we should not give up. Living values consistently strengthen the spectrum of our principles. Holding on to these core values, even in the face of temptations and challenges, increases our inner strength. Values should be at the heart of all our choices and decisions, always. If we use them only as per convenience, we lose our values.\n\nChoose a core value and be committed to making that value reflect who you are and what you do. Use it consistently and with everyone. Remind yourself, ‘I choose one value at a time. And I use it in my every thought, word and behaviour. My values define me. I bring them into action in every scene and strengthen my personality.’ The value you choose works like a code of conduct, helping you become better until you achieve excellence.\n\nCore values are our souls’ original qualities: peace, joy, love, bliss, purity, power, and wisdom. When we contemplate and experience the essence of these core qualities, we radiate the highest vibrations, which empower our surroundings and social atmosphere.\n\nSimultaneously, we also see and feel our own and others’ inner selves, our souls – a divine point of spiritual light located between the eyebrows. The more we do that, the more our aura gets positively charged, and our vibrations then make our environment pure and positive.\n\nThose empowering feelings of soul consciousness make our every word and action clean and harmonious. Such soul-conscious feelings of happiness enable us to love and respect all souls and nature.\nOur regular practice of soul consciousness, constant contemplation of divine knowledge, and daily Rajyog meditation or communion with the Supreme Soul can empower us to adopt universal values, simple living, and a positive, sattvic lifestyle in an easy, natural, and effortless way, helping us build a better life and world.\n\n",
        "headline_1": "Core values help achieve excellence",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/core-values-help-achieve-excellence/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-04-2025"
    },
    {
        "full_article": "In what is becoming a tedious display of ego clashes and false heroics, students of Dhaka College and Dhaka City College have again turned the streets around their campuses into battlegrounds, leaving the general public to suffer the consequences. Given how routine such conflicts involving the two colleges have become, this is no longer just about who or what started it off; any excuse seems enough to unleash violence. On Tuesday, it was the allegation of a Dhaka College student being assaulted the previous day, leading to an attack on the City College premises as well as hours of chase and counter-chase as police struggled to contain the situation. Many, including police officials, were injured. It's painful to see this meaningless cycle of violence among students who are supposed to lead the nation one day.\nAccording to a report, this is the fifth time that students of these colleges clashed in the last four months. City College students were also involved in a separate clash with their peers from Ideal College earlier this year. As police and witnesses have noted, often trivial matters ignite clashes, leading to repeated disruptions, injuries, and property damage. The surrounding areas, dense with markets and educational institutions, bear the brunt of these outbursts. For commuters and small businesses, every such episode means lost time, lost income, and a growing sense of insecurity. For the students involved, it is a tragic waste of youthful energy, and it has a damaging effect on all other students as well.\n\nThis tendency for violent outbursts seems to be increasing in the country. Only days ago, a third-year student of Primeasia University was stabbed to death in broad daylight over a petty argument. The ease with which young people now resort to violence—even over minor personal slights—suggests a deeper malaise caused by decades of authoritarian and undemocratic practices, whose effects continue even after the uprising. There is a possibility that this culture of impulsive aggression could harden into a long-term norm if we do not act urgently.\nEqually alarmingly, this tendency for violent outbursts seems to be increasing in the country. Only days ago, a third-year student of Primeasia University was stabbed to death in broad daylight over a petty argument. The ease with which young people now resort to violence—even over minor personal slights—suggests a deeper malaise caused by decades of authoritarian and undemocratic practices, whose effects continue even after the uprising. There is a possibility that this culture of impulsive aggression could harden into a long-term norm if we do not act urgently.\nIt is, therefore, not enough to blame the police for the failure to prevent vandalism at City College, as its authorities did. This vandalism or violence is not just a law enforcement problem; it goes much deeper, and all must do their part to resolve it. Dhaka College and City College administrations must work closely with law enforcement to impose strict disciplinary measures, enhance monitoring on and around campuses, and ensure swift punishment for any acts of violence. The role of social media groups in fuelling tensions must also be addressed. We urge the interim government and political parties—whom feuding students often draw their strength from—to treat this issue with the seriousness it deserves.\n",
        "headline_1": "A tragic waste of youthful energy",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/tragic-waste-youthful-energy-3878461",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-04-2025"
    },
    {
        "full_article": "As I prepare my thoughts for presentation at the upcoming State Heritage Conference 2025 in Perth, Australia, I find myself reflecting not just on a specific architectural philosophy, but on a journey. It is a journey undertaken over more than a decade within the stimulating intellectual environment of BRAC University in Bangladesh, a journey towards articulating what we now term \"New Contextualism.\" This endeavour, born from the unique socio-cultural and environmental crucible of Bengal, seeks to offer a more nuanced, responsible, and ultimately more humane approach to shaping our built environments. It is with this perspective, deeply embedded in our local experiences yet aspiring towards global relevance, that I wish to share a vision that seeks to intricately weave the rich threads of our past with the pressing necessities and boundless possibilities of the future.\nThe genesis of New Contextualism lies in a critical appraisal of the dominant architectural paradigms of the recent past. Modernism, with its universalising zeal, often arrived in contexts like ours as an external imposition—its sleek lines and abstract forms frequently disconnected from the lived realities, the climatic imperatives, and the deeply ingrained cultural sensibilities of Bengal. It promised efficiency but sometimes delivered alienation, overlooking the subtle wisdom embedded in vernacular traditions honed over centuries. Postmodernism, reacting against this perceived sterility, swung towards irony and surface quotation, occasionally lapsing into a fragmented pastiche that lacked the deeper resonance and historical continuity we instinctively seek in our surroundings. Neither approach seemed wholly adequate to address the complex tapestry of challenges and opportunities presented by the 21st century, particularly in regions grappling with rapid development alongside profound historical legacies.\nNew Contextualism emerged not as a prescriptive style, but as a critical framework—a way of thinking that advocates for a design process that is intrinsically forward-looking, yet profoundly anchored in an understanding of the past. It resists the homogenising tendencies of globalisation while simultaneously rejecting a retreat into uncritical nostalgia. Central to its ethos is a commitment to equity and justice, striving for design solutions that are inclusive, acknowledging the diverse needs and aspirations within our communities, and fostering environments where all can thrive.\nMy personal trajectory towards formalising these ideas was indelibly shaped by experiences both practical and academic. During my early career as an architect-planner for the Barisal City Corporation, I was confronted daily with the imperative to reconcile new interventions with existing urban fabrics, to respect the community's collective memory and future hopes while navigating the practical constraints of a deltaic environment. This wasn't merely about aesthetic compatibility; it was about understanding settlement patterns shaped by water, livelihoods intertwined with the landscape, and social structures reflected in spatial arrangements. How could design honour this intricate web while facilitating necessary progress? This question became a persistent companion.\nThis practical grounding was later enriched by doctoral research into the early Buddhist architecture of Bengal. Immersing myself in the study of sites like Mahasthangarh, Wari-Bateshwar, and the monasteries that dotted the ancient landscape, I was struck by the profound symbiosis these structures achieved with their context. Their design wasn't arbitrary; it was a sophisticated response to the local climate, harnessing breezes, managing monsoon rains, and utilising locally available materials like terracotta with remarkable ingenuity. Their spatial organisation reflected specific rituals, social hierarchies, and a distinct way of life. This wasn't merely 'building'; it was culture rendered tangible, a testament to a deep, holistic understanding of place. It demonstrated a form of contextualism that was both pragmatic and deeply meaningful, offering invaluable lessons in resilience, resourcefulness, and cultural expression—lessons that resonated strongly with the nascent ideas of New Contextualism. These ancient builders understood, perhaps intuitively, principles we now strive to recapture: designing with nature, not against it, and embedding cultural values within the very fabric of their constructions.\nFrom these diverse streams of influence—the practical challenges of contemporary urban planning in Bangladesh, the deep historical insights from our region's architectural past, and a critical engagement with global architectural discourse—the core tenets of New Contextualism began to crystallise. These are not rigid dogmas, but guiding principles for a more thoughtful and responsible design process:\nForward-Thinking Design Anchored in Prediction\nArchitecture, by its very nature, shapes the future. The buildings we conceive today will stand for decades, if not centuries. Therefore, design cannot merely react to the present; it must anticipate the trajectory of societal needs, technological advancements, and environmental shifts. This is not speculative fancy, but a profound responsibility. While emerging tools like Big Data and AI offer unprecedented predictive capabilities, their accuracy is contingent upon the depth of our understanding of historical precedents and current trends. The past provides the essential data set—the underlying patterns—upon which meaningful prediction can be built. We must design for the unfolding future, informed by the lessons of the past.\nHistorical Grounding as Foundational Knowledge\nA deep, critical engagement with history is not an optional academic pursuit for the architect; it is fundamental. History illuminates the evolution of societies, the successes and failures of past built interventions, the enduring cultural values embedded in form and space, and the long-term consequences of design decisions. In Bengal, understanding the hybridisation evident during the Sultanate period—the blending of Islamic typologies with local construction techniques and motifs—or the sophisticated water management systems of ancient settlements provides crucial context for contemporary challenges. Ignoring this historical continuum risks creating rootless environments, repeating past mistakes, and failing to leverage the accumulated wisdom of generations.\nHolistic Context Understanding – The Tenfold Matrix\nContext, in the New Contextualist framework, transcends the immediate physical site. It encompasses a complex, interwoven matrix of factors. To grasp this complexity, we employ a tenfold overlapping analysis, examining the Social (community structures, demographics, lifestyles), Economic (livelihoods, industries, affordability), Political (governance, patronage, regulations), Historical (layers of development, memory, significance), Ecological (climate, topography, biodiversity, resources), Scientific (material properties, technological possibilities), Geographical (location, connectivity, regional influences), Cultural (traditions, beliefs, aesthetics, rituals), Urban (density, infrastructure, public space), and Architectural (typologies, styles, precedents) dimensions. This comprehensive lens, reminiscent of the multi-layered understanding required to decipher Bengal's own complex cultural evolution, ensures that design interventions are not simplistic or unidimensional, but respond sensitively to the intricate reality of place. It prevents the imposition of predetermined solutions and fosters locally attuned responses. For instance, understanding the 'al'—the raised earthen embankment crucial for agriculture and movement in the delta—informs approaches to infrastructure and settlement design in flood-prone areas, a lesson derived directly from the geographical and historical context.\nBalancing the Universal and the Particular – The Art of Hybridization\nWe live in an interconnected world, and universal knowledge regarding structural principles, material science, and technological innovation is invaluable. New Contextualism embraces this global knowledge but insists on its critical adaptation to the specificities of the local. It rejects the wholesale importation of 'International Styles' just as it rejects parochial isolationism. The goal is a productive hybridization, analogous to the process that shaped Baņgālee culture itself through encounters with Vedic, Buddhist, Jain, Islamic, and European influences. It involves filtering global knowledge through the lens of local climate, materials, craftsmanship, cultural norms, and aesthetic sensibilities. The result should be architecture that is simultaneously contemporary and timeless, globally aware and deeply rooted in its place. The evolution of the Sultanate mosque in Bengal, incorporating elements like the curved cornice derived from bamboo construction, exemplifies this successful synthesis.\nDesigning for Adaptability and Resilience\nChange is inherent to the human and natural condition, perhaps nowhere more so than in dynamic landscapes like the Bengal delta. Buildings and settlements must therefore be designed not as static objects, but as adaptable systems capable of accommodating future changes in use, technology, and environmental conditions. Resilience—the capacity to withstand shocks and stresses (like floods, cyclones, earthquakes, or economic shifts) and to recover or transform positively—must be a core design objective. This often involves learning from vernacular traditions, which frequently embody passive resilience strategies, and integrating this wisdom with contemporary engineering and planning techniques.\nBuilding upon this foundation, our ongoing work at BRAC University has led to the articulation of New Contextualism 2.0. This evolution reflects a heightened urgency regarding global environmental challenges and a more explicit integration of contemporary sustainability frameworks. Key enhanced focus areas include:\nNature-Inspired Design (Biomimicry)\nLearning directly from the strategies employed by local ecosystems and organisms to thrive in specific conditions. How do mangroves dissipate wave energy? How do termite mounds achieve passive cooling? Nature offers millennia of R&D for sustainable solutions.\nDeep Sustainability Integration\nMoving beyond superficial 'greenwashing' to embed sustainability principles throughout the design lifecycle—from material sourcing and energy efficiency to water management and waste reduction—always prioritising locally appropriate solutions.\nAlignment with UN Sustainable Development Goals (SDGs)\nExplicitly mapping design intentions and outcomes against the global framework of the SDGs, ensuring that architectural interventions contribute tangibly to broader goals of poverty reduction, health and well-being, clean energy, sustainable cities, and climate action.\nEnhanced Focus on Proactive Resilience\nDesigning not just to withstand current hazards but to anticipate and adapt to future climate change impacts, such as sea-level rise and increased storm intensity, which pose existential threats to regions like coastal Bangladesh.\nPresenting these ideas at the State Heritage Conference in Perth is particularly significant. Heritage, within the New Contextualist perspective, is not a static relic to be cordoned off or merely replicated. It is a vital, living continuum—a repository of knowledge, identity, and meaning that must actively inform contemporary design. Understanding the historical layers, the cultural narratives, and the embedded wisdom within heritage sites allows us to create interventions that are respectful yet innovative, fostering a sense of continuity rather than rupture. It's about building upon legacy, not just beside it.\nOur academic explorations have yielded tangible proposals that illustrate these principles. The redevelopment proposal for Dhaka's historic Chawk Bazar, undertaken as a student design studio project, grappled with the intense complexities of regenerating a centuries-old marketplace pulsating with informal commerce, dense habitation, and irreplaceable heritage structures. Applying New Contextualist principles led to strategies focused on phased interventions, integrating livelihoods, adaptive reuse of historic buildings, and the introduction of contextually sensitive materials and forms, aiming to enhance functionality and safety while preserving the unique, vibrant chaos that defines its identity. Similarly, a conceptual proposal for reclaiming the Al-Cazaba in Almeria, Spain, explored how this philosophy could guide the revitalisation of a historically layered Islamic fortress complex, respecting its profound heritage while integrating contemporary uses and enhancing public accessibility. Again, in the revitalisation of the Alpona Gram, the New Contextualist proposal aimed to transform it into a community-based tourism destination to manage tourism's impact on the existing settlement fabric and benefit the community.\nAs Bangladesh navigates its path of rapid development, the choices we make regarding our built environment are critical. Unthinking adoption of generic global models risks erasing our unique cultural identity and exacerbating environmental vulnerabilities. Embracing a philosophy like New Contextualism offers a potential pathway towards creating cities and settlements that are not only functional and aesthetically considered but are also deeply resonant with our rich Baņgālee heritage, intelligently responsive to our specific ecological and social context, and robustly equipped to face the challenges of the future. My upcoming presentation in Perth is an opportunity to share these insights, honed in the delta, on a global stage. It is my sincere hope that this engagement will stimulate further dialogue, critical reflection, and ultimately, the wider application of New Contextualism, both within Bangladesh and beyond, contributing to the creation of built environments that are more sustainable, equitable, and deeply meaningful for all.\nDr Mohammad Habib Reza is an architect, architectural historian, and Associate Professor at the School of Architecture and Design, BRAC University, specialising in architectural and urban design history and theory, and heritage management.\n\n \n",
        "headline_1": "New Contextualism: An architectural philosophy for deltaic Bangladesh",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/focus/news/new-contextualism-architectural-philosophy-deltaic-bangladesh-3878456",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-04-2025"
    },
    {
        "full_article": "On April 20, 2025, battery-run rickshaw drivers took to the streets to protest against the decision to ban their vehicles in Dhaka's Gulshan and Banani areas. Soon after, tensions flared with clashes breaking out between battery-run rickshaw drivers and the locals, pedal rickshaw pullers, and ride-sharing motorcyclists. Based on the reports that have come out following the altercation, it appears that this entire affair has devolved into a \"he said, she said\" situation, with all parties claiming that they did not provoke the clashes—they just acted to defend themselves. The following day, protests escalated again. This time, there were reports of the protesting drivers threatening pedestrians who attempted to take photos of or record the incident unfolding. Additionally, the scuffle with pedal rickshaw pullers intensified as the protesters threw two pedal rickshaws off the bridge into Gulshan Lake.\nEarlier this month, when demonstrations in solidarity with Gaza poured out across the country, the movement garnered attention for all the wrong reasons. It wasn't the sheer volume of people who turned up that shaped the headlines, but rather a fraction of those \"participating.\" With the rallies fizzing into chaos, it was the looting and vandalism that captured most of our attention. Not only did these abhorrent acts divert attention away from the very issue the protests were for, but they also undermined the collective effort that the rest of the nation displayed.\nA month before that, records of two young women being attacked in Lalmatia by an enraged mob pervaded much of our discourse and psyche. What followed was a barrage of more reports of violence against women. In between and beyond, plenty more has happened. One might claim that too much has happened. Yet, it would be wrong to claim that these acts have only taken place in the past several months since the interim government took charge. It did, however, feel like they happened more frequently. Moreover, it would be dismissive to claim that a collective fear did not grip the nation. After all, we are a nation in transition. Any sign of instability threatens grave consequences.\nHowever, as we look back at the incidents and scrutinise many others that have grabbed the headlines—not just in the past several months but in the many years prior as well—an underlying pattern emerges. The pattern I am referring to not only binds the many events that have plagued the conscious collective but, in many ways, is a reflection of it. What I am alluding to is our inclination for violence. Many traits may characterise this irrational phenomenon. It may be described as being delirious, damning, and downright despicable. But if all we do is condemn these attacks, without fully fleshing out what compels them to transpire in the first place, then the thoughts we spare for the victims are performative at best, and dismissive of their struggles at worst.\nWhat triggers violence cannot just be explained by the rule of the former regime and its subsequent overthrow. To make sense of it, we must turn to the values, or rather the lack of them, that the country has survived with for far too long. Our core values, the four principles of our constitution, haven't been used to create organisations that promote them. Instead, these values have been distorted and blatantly overlooked. Without institutions built on the foundation of state values, how can we expect to undertake a long-term project of nation-building? On what basis is it meant to be sustained and directed? What core beliefs are supposed to resonate across generations?\nDespite our history, all these questions are devoid of a solid answer. We have been left to fend for ourselves based on the whims of our politicians, most of whom have rarely, if ever, attempted to rectify or even address it. Rather, they have continued to perpetuate a political culture of control and dominance and leveraged it to accumulate personal wealth. The cycle has repeated far too many times because the system here has been rife with corruption for decades. It has cultivated a culture of impunity, not accountability, essentially warping the law and forcing functionality to completely crumble. Even when due process is taken, it is not done to uphold the law or serve justice but for retribution or to assert dominance. Inevitably, the impulse that one might get away with their wrongdoing trickles down, thus forging the culture of impunity as the norm.\nNonetheless, the malfunctioning of our legal system doesn't exist in isolation. Its roots, which are a result of a lack of a value system, are entrenched deep in our education system as well. Without a set of values to dictate the curriculum, what core principles are meant to be instilled in and embodied by young minds? While we can debate the implications and impacts of imparting a few rigid values on students, we cannot deny that these principles can at least act as references to mould their thinking around. Additionally, what is indicative of the state of our educational institutions is the fact that elected politicians themselves tend not to send their children to local government schools, opting instead for private English medium schools or schools abroad.\nWhat, then, does that say about the state of our educational institutions? It screams of the giant rift between politicians and their constituencies. In the process, it also lays bare the source of scarcity that the rest of the nation has to make do with. The dynamic this fosters is one of resentment, enforcing the idea that not only is there no one looking out for them, but also that these institutions are doing nothing to bolster their interests. As a result, people take matters into their own hands and take drastic, often poorly thought-out measures that prove to be counterproductive.\nWith crumbling institutions built on fragile principles, power has, time and again, been co-opted. Is it then any wonder that Bangladesh has been marred by mindless violence for as long as most of us can remember? The sources of people's apathy and collective restlessness can be attributed to a system that has continued to fail them. A withering system may amplify and echo their troubles. However, it most certainly underpins that while values may be abstract, their weight is tangible.\nAbir Hossain is a journalist. He can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Our propensity for violence and the elements that foster it",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/our-propensity-violence-and-the-institutions-foster-it-3878356",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-04-2025"
    },
    {
        "full_article": "We welcome the submission of proposals by the Women's Affairs Reforms Commission, which provided 433 recommendations aimed at eliminating discriminatory provisions and structures in our laws, policies, and institutions. Unlike many other reform reports, this one specifies recommendations that the interim government can implement immediately. Among these is the withdrawal of Bangladesh's reservations to two articles of the United Nations Convention on the Elimination of All Forms of Discrimination Against Women (CEDAW), which ensures legal equality in marriage and divorce.\n\nIn this regard, the commission proposed the introduction of a uniform family code to ensure equal rights in marriage, divorce, inheritance, and maintenance for women across all religions—which can be made applicable optionally during the current government's term. Other laws that require strengthening and/or amendment to make the provisions more inclusive and victim-friendly, according to the commission's proposal, include the Prevention of Domestic Violence Act-2010, the Guardians and Wards Act-1890, and rape and labour laws. The report also recommends enacting a new law on sexual harassment based on the 2009 High Court guidelines.\n\nRights of female migrant workers, domestic labourers, sex workers, as well as the elderly also came under the purview of the commission's recommendations. For example, it urged the government to ratify and implement the International Labour Organization's Conventions C189 and C190, which focus on domestic workers' rights and protection of workers from workplace violence and harassment, respectively. It proposed the establishment of help desks at all police stations and courts for women, children, the elderly, and people with special needs. Other recommendations include ensuring six months' paid maternity leave and two weeks' paid paternity leave in all sectors, and implementing the National Broadcasting Policy 2024 to stop mass media from presenting women in a negative light. In the political arena, the most notable recommendation was expanding parliamentary seats to 600, with 300 seats for directly elected women. Although this appears \"unrealistic,\" the commission chief believes such an increase is necessary.\n\nFor years, rights groups have been advocating for many of these changes only to be ignored by successive governments, thus allowing the perpetuation of repressive and discriminatory laws denying women equal rights. For the first time, a comprehensive document has now been drawn up with the aspiration that we can actually move forward towards a more women-friendly society. Sadly, certain quarters, instead of presenting constructive criticism and logical arguments for or against the recommendations, are already voicing their opposition and demanding the dissolution of the Women's Affairs Reforms Commission itself. We are, however, encouraged by Chief Adviser Muhammad Yunus' directive to promptly implement recommendations where possible. We hope that all political parties and other stakeholders will engage in healthy debate about the recommendations, recognising that ensuring equal rights for all genders will lead to a just, fair, and prosperous nation.\n",
        "headline_1": "We cannot miss this opportunity to truly empower women ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/we-cannot-miss-opportunity-truly-empower-women-3876241",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 24, 2025 00:00:00  \nThe idea of making government’s savings instruments tradable is quite interesting. Its practical benefits are likely to be wide, adding a new dimension to private savings and even the country's economy. Right now the money invested in savings tools has little opportunity to roll and speed up the process of 'money begets money' other than contributing to government fund for its expenditure. If the savings instruments like sanchaypatras of different categories become tradable in the secondary market, their dynamic provisions may have a multiplier effect on the bourse, private savings and the economy in general. Already popular, sanchaypatras will be more attractive because of the flexibility and dynamism the Finance Division's initiative will add to those instruments. People will be able to sell those in time of emergency and once the exigency is met, they can buy instruments similar to the ones they sold instead of going the whole hog of opening a fresh savings tool with the bank. \nAnother feature of immense merit with highly practical use will be its collateral value. Currently, fixed deposit receipt (FDR) enjoys the mortgage value and can be used as collateral for obtaining loan but sanchaypatras do not enjoy the same status. This is plainly contradictory. FDR is savings for a certain period and the agreement is made between an account holder and the bank concerned. If the bank collapses, there is no guarantee that the depositors will get their money back. In case of sanchaypatra, the government or the state is the guarantor of the investment and the money with interests has to be paid back unfailingly. So, the use of savings instruments as collateral is more than justified. How much loan against those can be sanctioned is a matter that can be meticulously worked out. Understandably, the nitty-gritty will be specified in clear terms to avoid confusion and loan default.\nIn this context, a perusal of the total amount of the savings certificates sold in 2024 and the repaid amount present a clear picture of depositors' financial constraints. By issuing savings certificates, the country's banking channel had an infusion of Tk788.47 billion while the repaid amount stood at Tk999.72 billion, registering a decline in sale by Tk211.24 billion. The reason is not far to seek. Inflation and ill health of the economy compelled more people to encash their savings instruments in order to stay afloat. Many of the savings account holders did so prematurely. Had there been the opportunity to sell savings tools in the secondary market or receive loans against those, many of them would not have encashed their sanchaypatras. \nSure enough, trading of government's savings instruments in the secondary market is a smart way of mobilising government fund. More importantly, the dynamism it will lend to money is likely to make idle money's use productive. Small entrepreneurs can make the best use of this limited but highly useful fund if the commercial aspect can be made compatible with investment in their small and medium enterprises (SMEs). Mobilisation of fund alone without its productive use and circulation in manufacturing units, businesses and market does not make an economy dynamic and strong. The range and scope of government's treasury bills and bonds in expediting such economic activities at the grassroots level can as well be widened to complement such an effort.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Tradable savings instruments",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/tradable-savings-instruments-1745420831",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       April 24, 2025 00:00:00  \nThe old proverb \"when life gives you lemons, make lemonade\" inspires optimism and a proactive approach in the face of adversity. Even though it is viewed as a simple encouragement at personal level, history suggests that adversity can indeed be the mother of invention even on a national scale. \nFor Bangladesh, unexpected challenges imposed by its neighbour, India, have paradoxically spurred domestic growth and self-reliance in key sectors. Take the example of India's 2014 ban on cattle exports, which catalysed a surge in local cattle rearing, ultimately leading Bangladesh towards self-sufficiency in meat production and empowering hundreds of thousands of farmers and traders. Similarly, India's onion export restrictions in 2020, even though initially caused a record price hike, ultimately led to a notable rise in Bangladesh's domestic onion production in the following years.\nNow, with India abruptly halting Bangladesh's transshipment facility-which had enabled the export of goods to third countries via Indian airports-Bangladeshi apparel exporters, particularly those dealing in fast fashion and seasonal wear that require short lead times, are left without a fast and cost-effective export route.\nIt is worth mentioning that the transshipment facility was introduced in 2020 as part of a bilateral agreement, and Bangladeshi exporters have been using it by paying a certain fee. Clearly, it had been a win-win arrangement for both countries, and India stands to gain no apparent benefit from withdrawing the facility. In fact, the move is widely seen as politically motivated as one Indian news outlet reports \"How India Is Making Bangladesh's Yunus Pay for Cozying Up With Pakistan, China.\"\nHowever, there is little reason for Dhaka to be unnerved by India's unilateral decision, as the volume of Bangladesh's RMG exports routed through the Indian transshipment facility is negligible compared to its total volume of exports. And, Bangladesh is well-positioned to overcome this challenge through its own arrangements.\nAlthough the seaports are the primary gateway for Bangladesh's exports and imports, there is an annual demand to export over 200,000 tonnes of garments by air, which is growing by the year. This demand primarily stems from garments produced for specific seasons or under the fast fashion segment, where trends change rapidly. Products under this segment are treated as perishable goods as delayed delivery can result in order cancellations. Air shipment is also vital for the delivery of agricultural goods where time is of the essence.\nApparel makers are under constant pressure to reduce lead times. However, bureaucratic hurdles which causes delay in custom clearance as well as limited storage facility, a lack of adequate scanning facilities, and frequent equipment failures - such as scanning machines frequently going out of order-create significant obstacles to smooth export processes. These challenges hinder manufacturers' efforts to quickly deliver products. \nMoreover, due to higher jet fuel prices along with higher taxes, ground handling fees, and other airport charges, it has often been more economical for exporters to transship goods via Indian airports like Kolkata or Delhi rather than directly through Dhaka. \nDespite this, of the annual 200,000-tonne air shipment demand, approximately 80 to 85 per cent was already being handled through Hazrat Shahjalal International Airport (HSIA), with only 15 to 20 per cent previously routed via Indian airports under the transshipment arrangement. To put this into perspective, between January 2024 and March 2025, just over 34,900 tonnes of garments-worth $462 million -were shipped through India. For a country that exports over $40 billion worth of garments annually, managing this small portion of redirected shipments is not supposed to be a big deal. \nAs a matter of fact, there is a silver lining in this disruption. The authorities here in Bangladesh started considering it is an opportunity for Bangladesh to enhance its air-cargo shipment capacity, which will pave the way for greater control over its supply chain. Needless to say, it would also greatly boost government's revenue. The authorities have already decided to begin air cargo operations from both Sylhet and Chattogram airports, with air shipment from Sylhet set to commence on April 27.\nMeanwhile, efforts are being ramped up to accelerate the operation of the third terminal at HSIA by as early as October this year. The third terminal is expected to boost HSIA's cargo handling capacity to 546,000 tonnes annually-a significant increase from the current capacity of 200,000 tonnes handled by Terminals 1 and 2. That means the third terminal will triple the airport's export cargo handling capability.\nAlthough a \"soft inauguration\" of the terminal was held by the then-Awami League government in October 2023 ahead of the national election, it was nothing but a farce. The terminal is yet to become operational. The latest report suggests that 98 per cent of the terminal's construction is complete, with only exterior infrastructure works remaining, which are going on in full swing. Several operational components-including equipment installation, calibration, and testing-are being carried. The Civil Aviation Authority is currently in talks with the Japan International Cooperation Agency (JICA) regarding ground-handling services. The authorities are hopeful of completing these tasks by June of this year. Once completed, the terminal could be a game changer for the country's aviation sector.\nSo, while India's withdrawal of the transshipment facility may initially pose challenges and raise export costs to some extent, with foresight, policy backing, and strategic investment, Bangladesh can transform this setback into a catalyst for boosting air cargo logistics and port infrastructure. Bangladesh must seize this moment by streamlining regulatory reforms, reducing costs and leveraging its expanding airport capacity.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "How BD can withstand India's  transshipment withdrawal",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/how-bd-can-withstand-indias-transshipment-withdrawal-1745420900",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 24, 2025 00:00:00  \n\nThe prices of two essential perishable farm products-onions and potatoes-have been steadily rising in the backdrop of the end of the harvest season. These two items are indispensable in our daily meals. Potatoes and onions are deeply embedded in our food culture; our rice-based cuisine often includes mashed potatoes mixed with chopped onions as a staple side dish.\nShockingly, prices increased by Tk 20 per kilogram within just a week following the month of Ramadan, leaving consumers bewildered. As regular consumers, we are not demanding a drastic price drop, but rather, we seek price stability.\nIt is important to recognise that farmers deserve a fair price for their produce. At the same time, consumers should be able to buy these essential items at reasonable prices. Currently, prices are relatively stable, which is beneficial for both parties. However, sudden price hikes driven by unscrupulous traders would destabilise the market and affect everyone.\nOften, some dishonest wholesalers hoard fresh produce for extended periods to create an artificial shortage, disrupting smooth supply chains and inflating prices. To prevent this, we need a robust and continuous market monitoring system that can identify and hold accountable those who are responsible for such manipulation.\nMonitoring must be frequent, thorough so that immediate measures can be taken to curb unjustified price hikes. The Department of Agricultural Marketing (DAM), with support from the Department of Agricultural Extension (DAE) and law enforcement agencies, should form a strong and active monitoring team. This team should regularly inspect key market centers and help maintain price stability.\nMoreover, the team should visit warehouses to detect illegal hoarding and take immediate on-the-spot action when necessary. If the current price trend of onions and potatoes continues without undue interference, both farmers and consumers will remain satisfied, as production costs and purchasing power remain aligned within acceptable limits.\nMd.Refatul Hossain\nAdditional Director (retd)\nDepartment of Agricultural Extension (DAE)\nFaridpur Region\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Strengthen market monitoring",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/strengthen-market-monitoring-1745420929",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 24, 2025 00:00:00  \n\nThe Constitution of our country clearly states that government officials are public servants. This is not just a legal provision-it is a moral and civic commitment rooted in the values of responsibility and service. Yet, in practice, we see a growing departure from this principle. Many officials now appear more focused on exercising authority than serving the people, often displaying negligence, indifference, and self-interest.\nRather than upholding discipline and working for the welfare of citizens, some have become entangled in the pursuit of power, influence, and personal benefit. Corruption, favoritism, and undue political interference are gradually corroding the very foundation of our administrative system. Promotions and appointments are often dictated by personal connections or financial incentives rather than merit or capability.\nThis erosion of public service ethics is fostering widespread distrust among citizens. A dangerous disconnect is emerging between the state and the people-threatening our democratic fabric.\nTo restore faith in public institutions, we must urgently cultivate a culture of integrity, transparency, and accountability-one that is not limited to policy documents but becomes visible in daily governance. It is equally important to recognize and support honest and committed officials whose service exemplifies the spirit of public duty.\nNow is the time for bold and principled political leadership, and for sincere administrative reform. Only then can we ensure that governance remains anchored in public welfare and the dignity of every citizen.\nRashedul Islam Akib\nStudent, Department of Islamic Studies\nUniversity of Chittagong\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Responsibility lost in the shadow of power",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/responsibility-lost-in-the-shadow-of-power-1745420954",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-04-2025"
    }
]