[
    {
        "full_article": "The arrest of two Catholic nuns by the Chhattisgarh police on charges of human trafficking and forced conversion is another instance of growing religion-related harassment. Keralite Sisters Preeti Mary and Vandana Francis, from the order of the Assisi Sisters of Mary Immaculate, were escorting three tribal girls to an Agra convent for jobs when they were apprehended from Durg railway station on July 25, 2025, after a Bajrang Dal member filed a complaint. They have been booked under Section 4 of the Chhattisgarh Freedom of Religion Act, 1968 (conversion) and Section 143 of the BNS (trafficking). While Chief Minister Vishnu Deo Sai insisted that the nuns were engaging in “human trafficking and conversion... through inducement”, the kin of the girls have since clarified that there was no forceful conversion and they had given their consent to be taken to Agra. The arrests have led to condemnation across the political spectrum against communal vigilantism. Leaders across political lines have protested. Ruling Left Democratic Front and Opposition United Democratic Front MPs from Kerala held dharnas outside Parliament, and the Catholic Church, through its official mouthpiece, Deepika, and other church organisations too denounced the arrests.This is not the first time that a proselytisation row has erupted involving Christian missionaries. Last year marked 25 years of the brutal killing of Australian missionary Graham Staines and his two minor sons in Odisha. Despite the fact that the Constitution provides citizens the right to practise and propagate the religion of their choice, several States, including U.P., M.P., Chhattisgarh, Rajasthan, Arunachal Pradesh, Jharkhand and Odisha, have misused provisions of anti-conversion laws that were intended only to prevent conversion through force or fraud or allurement. These laws are often used to criminalise interfaith marriages by labelling conversion by marriage as unlawful. In tribal-dominated regions such as Jharkhand, there is another tension brewing between Adivasis and both Christian tribals and Hindus. While Hindutva groups with the RSS’s backing are exhorting tribals to wake up to their Hindu roots, tribal outfits are resisting this and demanding a separate Sarna religious code. Tribal outfits allege that the Hindu groups are doing the same thing as Christian missionaries to subsume their distinct culture. In Chhattisgarh, which has around a 2% Christian population according to the 2011 Census, there is also a debate on whether tribals who are converting to Christianity should be delisted from the Scheduled Tribes. In such a churn, the onus is on political, religious and social organisations to focus on economic development, jobs and welfare. Government machineries should be used to enforce rights, guaranteed by the Constitution, not violate them.\r Published - July 31, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        arrest\n                    \n                            /                      \n                        \n                        religion and belief\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        Chhattisgarh\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        tribals\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Left Democratic Front\n                    \n                            /                      \n                        \n                        United Democratic Front\n                    \n                            /                      \n                        \n                        media\n                    \n                            /                      \n                        \n                        Orissa\n                    \n                            /                      \n                        \n                        murder\n                    \n                            /                      \n                        \n                        Reservation\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        population and census",
        "headline_1": "Arrest and unrest: On arrest of nuns in Chhattisgarh",
        "headline_2": "Communal agenda is behind the arrest of nuns for human trafficking",
        "link": "https://www.thehindu.com/opinion/editorial/arrest-and-unrest-on-arrest-of-nuns-in-chhattisgarh/article69874057.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "31-07-2025"
    },
    {
        "full_article": "Divya Deshmukh’s astonishing performance at the women’s chess World Cup has put the limelight back on Indian chess, yet again. Rarely does a week pass without an Indian player achieving a significant feat in some corner of the world. Still, what Divya did at Batumi, Georgia, on Monday, deserves attention. The 19-year-old from Nagpur won one of the most prestigious tournaments, coming through a gruelling knockout competition, outwitting rivals much stronger and more experienced. She had started out as the 15th seed. That she defeated another Indian, the fourth-seeded Koneru Humpy and reigning World rapid chess champion, in the final, underlined the country’s domination of the event. Two other Indians, D. Harika and R. Vaishali, had also advanced to the quarterfinals. The great show in Georgia does not make India a superpower in women’s chess, though. That honour belongs to China, home to the last three women’s World champions. Though the Indian women, like the men, won the Chess Olympiad last year at Budapest, China has more depth. India may now boast the world’s best young talent among men, in the form of World champion D. Gukesh, World No. 4 R. Praggnanandhaa and No. 5 Arjun Erigaisi among others, but the bench in women’s chess is not all that strong.Divya’s — and India’s — stunning success should no doubt inspire young girls to take up chess as a career. The huge media attention that Divya has received — she has been featured on the front pages of newspapers, became breaking news on TV and got plenty of traction online — could encourage even more parents to make their daughters learn chess. And India needs more girls to move the pieces on the chessboard. Though the current Indian lineup looks good enough to retain the Olympiad gold next year, it is imperative that the country needs to spot and nurture fresh young talent. There are a few players such as Vantika Agrawal and B. Savitha Shri, but in the world’s top 100, there are only eight Indians, while China has 14, including the top three. India’s chess administrators have to make some long-term plans for women’s chess, and should implement them quickly. After identifying a fairly large group of promising girls, they need to be properly trained and provided excellent coaches. Only few families can afford the highly expensive trainers and the travel to Europe, from where the Indian players usually make their norms for their Grandmaster or International Master titles. There should also be more such tournaments in India. Published - July 31, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        chess\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        sports event",
        "headline_1": "​Top board: On Divya Deshmukh’s women’s chess World Cup win",
        "headline_2": "Indian women are catching up with the men in world chess",
        "link": "https://www.thehindu.com/opinion/editorial/top-board-on-divya-deshmukhs-womens-chess-world-cup-win/article69869874.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "31-07-2025"
    },
    {
        "full_article": "Patch-making, Supreme Court style\nThe mandap too often turns into a fractious mandi. Unsavoury, but not unexpected because in Indian terminology, ‘market’ usually comes after ‘marriage’. The Big Fat Desi Shaadi is often followed by Big Fat Messy Sequel, which is why both are the staple of  big and small screens. This may or may not be the ‘Kyunki’ behind feisty Smriti Irani returning to the avatar that made her role model of saas and bahu alike. Not that her later stomping ground was really different. Politics makes as strange bedfellows as do faulty horoscopes,  and many netas go in for divorce, and stick with their new party provided it keeps them in the bungalows to which they want to be accustomed. \nSo it was only a matter of time before lofty Supreme Court began functioning like lowly family court. It happened thrice last Friday, the judges sounding more like life-honed Chandrika chachi, or standard-issue Agony Aunt. In one, they ticked off an Indian ambassador who carelessly acquired two wives. The second involved  a decorated IAF pilot — veteran of Balakot bombing — and his wife who were strafing each other ; the Bench soothingly told them to reconcile, saying, ‘You are not enemies.’ The third hit a target more obdurate than cross-border terrorism. \nIt dealt with the major cause of joint-family fracture: monster-in-law. In my Mumbai Mirror ‘Giving Gyan’ column, I constantly had to mollify desperate wives for whom ‘The Other Woman’ was not some sassy siren but scheming saas. Most Indian men being Mama’s boys – and mamas using every ploy to keep them so – the son chooses to maintain the peace by siding with her. He says: ‘After all, so much Ma has suffered for me. Besides, she won’t be among us for long, no?’ The first reasoning is so unmindful of the bahu’s suffering that — finally fed up — she’s the one who fulfils the second. Justices BV Nagarathna and KV Viswanathan admirably  counselled  this  ‘dutiful son’ to hear out his wife’s  POV, and respect her feelings as well. \nHonourable SC  judges won’t have to return home to face the hellish fury of a mother-in-law scorned. But Justice Nagarathna repeated the sensitivity she advised last February while reinstating two callously dismissed women judicial officers in MP. Such a desirable change from patriarchal bilge spewed from more backward benches. \n                                           ***\nAlec Smart said: “14K males among 26,234L illegit recipients of Ladki Bahin funds. Vote a way to disburse welfare!”\n\n",
        "headline_1": "Justice Seema Aunty",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/justice-seema-aunty/",
        "news_paper_name": "The Times of India",
        "publish_date": "31-07-2025"
    },
    {
        "full_article": "India should have done the US trade deal before deadline. But quick resolution is still possible\nIn the end, six months of sweet-talking didn’t cut it with Trump. Starting tomorrow, most Indian exports to US will be tariffed at 25%. On his Truth Social megaphone, Trump also announced a “penalty” on India for being the largest buyer of Russian energy. It’s not clear how much this would amount to, but if he enforces his threat of 100% secondary tariff on Russian energy buyers, Indian goods could become prohibitively expensive in America. That’s the worst case scenario, but the best isn’t rosy either. \nConsider the numbers. Last year, India exported goods worth $87.4bn to US – its biggest market. Pharmaceuticals, pearls and precious stones, phones and readymade garments were the major products. Indian manufacturers in these categories earn up to 30% of their turnover from US. But with 25% import duty, either they or their clients will need to take a haircut. Or, pass on the extra cost to US customers. But the latter two aren’t options when a rival like Vietnam is tariffed at 20%, and does not face secondary tariffs for buying Russian energy.\nPharmaceuticals are India’s biggest export to US, worth over $12.5bn last year. Trump kept pharma imports out of his original ‘Liberation Day’ tariffs in April, but is now talking about imposing up to 200% tariff on meds to incentivise production at home. So, there’s a cloud of uncertainty over this sector already. Electronics – phones mainly – became a leading product category in the last couple of years, and India now supplies more than a third of phones to US. In fact, exports trebled in Jan-May, over the corresponding period last year. But Trump’s tariffs could change that. \nA tariff-induced slump in demand for Indian goods would hurt the job market. The gems and jewellery sector, for instance, employs 5mn people and accounts for $11bn of exports to US. It almost ground to a halt when Trump announced his ‘reciprocal’ tariffs in April. Last month, India’s overall exports to US grew by 23.5% when industrial output growth slowed to 1.5%. It shows the importance of US demand for Indian manufacturing. So, a timely deal would have served India well, even on Trump’s terms. That’s the reason why other major economies like Japan and EU chose not to start a tariff war with him, settling for 15% tariff now to stay in the game. The door isn’t closed for India either. A US team is visiting in late Aug, and a deal then would quickly put business back on track. A longer delay, however, would send the wrong signal to foreign firms looking at India for their China-plus strategy.\n\n",
        "headline_1": "Door’s still open",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/doors-still-open/",
        "news_paper_name": "The Times of India",
        "publish_date": "31-07-2025"
    },
    {
        "full_article": "Why world was far better prepared for ocean quakes this time than in 2004\nThe world breathed easy as Japan and Hawaii downgraded, and Russia lifted its tsunami warnings. No casualties were reported till late evening although damage was extensive in Russia’s coastal town of Severo-Kurilsk, battered by waves 10-13ft high. The town’s 2,000-odd population lives at a higher ground and is safe. The world was on tenterhooks because tsunamis spell devastation – almost 2.5L died in 2004, over 20,000 in Japan in 2011. One reason casualties are so far nil, and damage limited, is science, forecasting and international collaboration. Scientists can predict not only when a tsunami will hit but also how much flooding there’ll be, unthinkable in 2004. Both the tech and coverage of Pacific Ocean – where over 75% of tsunamis form – with sensors, early warning systems and deep-ocean assessment (US NOAA’s DART buoys) have improved many times the last two decades.\nOcean quakes trigger waves on the ocean floor – the difference between a tsunami wave and a surface one. These push out with force that sensors deep in the Pacific now record via sonics and other indicators. If in 2004, there were only six such buoys, there are over 40 now scattered across seismically active regions in Pacific Ocean. What makes a difference in impact on coastlines is the incline from ocean floor to the coast. Sharper the incline, higher the body of water pushed up, bigger the wave. This makes Japan among the most vulnerable because its incline is steep. But Japan also has among the most sophisticated warning systems. An earthquake still can’t be predicted but its epicentre can be quickly calculated and warnings issued within seconds and minutes through seismographs nationwide. Authorities have time to respond and swiftly evacuate people in the line of a brute wall of water. There’s no being pacific about that.\n\n",
        "headline_1": "Tsunami lessons",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/tsunami-lessons/",
        "news_paper_name": "The Times of India",
        "publish_date": "31-07-2025"
    },
    {
        "full_article": "Because there’s a fortune to be made from 60-plus consumers. They are the ones with a lot of time and money on their hands. Goods and services they want represent very lucrative opportunities.\nIf you ask any marketing manager what their biggest priority is, they will typically say they are trying to crack Gen Z. That’s their priority. You can understand why. Popular media is dominated by Gen Z discourse and by the idea of their being the most important generation right now.\nRead full story on TOI+\n\n",
        "headline_1": "Why brands’ Gen Z obsession costs them",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/millennial-speak/why-brands-gen-z-obsession-costs-them/",
        "news_paper_name": "The Times of India",
        "publish_date": "31-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 31, 2025 00:00:00  \nThe row over 'miniket' and 'jeerashail' has turned uglier with the ministry of commerce (MoC) revoking the directive of the Directorate of National Consumers' Right Protection (DNCRP). Here, the bone of contention is the fictitious name given to rice after cutting and polishing coarser varieties like BRRI Dhan 28 manifestly to deceive consumers and making higher profit. The DNCRP imposed a ban on this type of artificially changed rice under the name of 'miniket' and 'jeerashail' on July 13 last. Strangely, the auto rice millers in the country have nowhere challenged the DNCRP contention. Instead, they have sought intervention by the MoC and additionally raised the spectre of a food crisis as part of an intimidating tactic. The MoC has duly given in to the millers' demand. Now the very status of DNCRP has been put into question. It has been left licking its wounds. \nA study carried out by the Department of Agricultural Marketing (DAM) in 2023 confirmed that local millers excessively polish coarser rice to market it as 'miniket' although it does not exist officially. Manipulation with rice is not limited to BRRI Dhan 28-turned 'miniket' or 'jeerashail', the finer varieties are equally suspect. A genuine rice trader would admit that there is no such stuff as 'nazir shail'. In the rice growing belt it was known as 'paisam', its natural name. But it is no longer grown commercially because of lower production. Other coarse varieties are polished and passed as 'nazir shail'. The 2023 DAM study came out with the revelation that 5.17 million tonnes of rice out of a total of 40 million get wasted in the process of overpolishing. As a result, the country has to import rice from abroad and at the same time consumers are doubly cheated---first, by forcing them to buy rice shorn of its nutritious values and second, to make them pay higher prices for a fake item. \nThe only saving grace in the controversy over the disputed rice varieties is that the MoC has asked the food ministry to look into the matter and make the ultimate decision on the marketing of those varieties. In fact, it is the National Seed Board that reserves the right to pronounce the verdict on this controversial issue. Of course, the agricultural scientists involved with the development of various types of BRRI Dhan in Bangladesh are expert in such matters. Their opinions may also be taken in resolving this controversy. Any tinkering with the original shape and size of the staple is a punishable offence. So, the controversy should be brought to an end once and for all. \nThere is no point allowing any myth surrounding the nation's staple to continue. It is also undesirable that big trading groups or auto rice millers would use marketing stunt by attributing some eye-catching name to rice that actually has no existence. Rice, crops, fruits and vegetables are not like industrial products or feed. Rice market is under the control of the rice millers and groups of companies which have entered the business in recent times. Together they take the nation hostage and raise prices at their sweet will. There is nothing to be surprised if they are diverting the attention from the volatile rice market by raising this latest controversy.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Controversy over rice varieties should end",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/controversy-over-rice-varieties-should-end-1753882680",
        "news_paper_name": "The Financial Express",
        "publish_date": "31-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       July 31, 2025 00:00:00  \nThe interim government had given transport owners a six-month ultimatum to remove all unfit vehicles from the roads. To facilitate this transition, the transport owners were even offered soft loans so that they can replace their rundown fleets with newer, safer vehicles. However, despite these incentives and the ample time provided, transport owners remained largely indifferent, taking visibly no steps to comply with the directive. Instead, when the deadline ended and the law enforcement agencies launched a crackdown on unfit vehicles from early July, transport owners are now responding not with compliance, but with defiance. \nIn a reckless and audacious move, several organistion of transport owners and workers recently issued 15-working-day ultimatum to the government to stop the drive against old, unfit and unsafe vehicles. Otherwise, they warned of enforcing a 72-hour nationwide transport strike from 6 a.m. on August 12 to 6 a.m. on August 15. Transport strikes have already been enforced in several districts, and now the fear of broad disruption looms large.\nThe transport owners' eight-point list of demands includes extending the economic lifespan of commercial vehicles from the current 20-25 years to 30 years, amending the Road Transport Act-2018, reducing the recently increased presumptive income tax on commercial vehicles to previous levels, formulating a scrappage policy for old vehicles, and expediting the issuance and renewal of driving licences, among others. Some of these demands, particularly the extension of vehicle lifespan and amendments to the RTA, are not only unreasonable but also dangerous. \nReportedly, there are more than 80,000 buses, minibuses, trucks, lorries and tankers that have already exceeded their economic life as of July 16. These unfit vehicles are not only responsible for frequent accidents and traffic jam, but also emitting dangerous level of toxic gas. Considering this, the government's move to stop running of the unfit vehicles on the road has been a welcome step. But such steps had also been taken several times during the previous government, but to no avail. The transport owners' resistance to change once again raises the unanswered question: when will the transport owners and workers show due sensitivity to the issue of road safety? Is human life such a cheap commodity that we can place at the mercy of unskilled drivers of unfit vehicles?\nThe transport sector is critical to daily life in Bangladesh, but it has remained in disarray for decades. Every attempt to reform it has been met with fierce resistance from within. A powerful lobby of transport owners and workers has consistently sought to operate on its own terms, free from regulation and accountability.\nIn 2018, following a massive student-led movement for road safety, the then government enacted the Road Transport Act. However, the government could not implement the law due to opposition from entrenched transport syndicates. These same groups have repeatedly obstructed the rollout of the 'Dhaka Nagar Paribahan' service, an initiative aimed at bringing order to the capital's chaotic public transport system. Now, once again, they are trying to derail efforts to remove unfit vehicles from the roads.\nThe problem runs deeper. Years of unchecked political patronage and rampant corruption under the Awami League government allowed a powerful transport syndicate to take root. After the AL's fall, new politically connected groups have taken over, continuing the same culture of corruption and rent-seeking. Acting under the cover of owners' and workers' associations, they engage in illegal activities and routinely block any measure that threatens their grip on the sector.\nFollowing the 2024 mass uprising, the public hoped that long-delayed reforms would finally materialise and order would be restored in the transport sector. Yet, nearly a year later, there is little sign of real change. This status quo is unsustainable. Transport associations must not be allowed to hold an essential public service hostage to their narrow interests. The government must stand firm in taking all lawful and necessary actions to restore order in this critical sector.\nAt the same time, for a lasting and effective resolution, all stakeholders-including transport owners-should be included in the dialogue. Legitimate concerns must be acknowledged and addressed. However, public safety must remain non-negotiable.\nOne potential way to break the stranglehold of private transport lobbies is to expand the role of the public sector. However, the limited number of buses operated by the Bangladesh Road Transport Corporation (BRTC) has done little to ease the crisis. According to Mozammel Haque, Secretary General of the Passengers' Welfare Association, launching a dedicated city bus service could transform Dhaka's transportation landscape. He argues that introducing just 2,000 new buses could significantly reduce chaos and improve service.\nTo this end, the government has announced plans to introduce electric bus services in Dhaka under a World Bank-funded project, citing the city's worsening air pollution and environmental concerns. However, unless the entrenched syndicates controlled by vested interests could be dismantled, no government move to improve the capital city's passenger bus service will succeed. It is time for the government to act firmly as we have already lost too many precious lives in what looked like avoidable accidents.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Transport owners' tyranny must go",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/transport-owners-tyranny-must-go-1753882727",
        "news_paper_name": "The Financial Express",
        "publish_date": "31-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 31, 2025 00:00:00  \n\nCancer has become a pressing public health issue in Bangladesh, with thousands being diagnosed and losing their lives to the disease every year. What is particularly unfortunate is that many people remain unaware of how to prevent cancer, even though a significant number of cases can be avoided through basic lifestyle modifications and increased awareness.\nCancer occurs when certain cells in the body grow uncontrollably and form tumours, which can spread to other parts of the body. Common types include lung, breast, and stomach cancers. In Bangladesh, the rise in cancer cases is largely due to unhealthy lifestyle choices and insufficient public awareness.\nOne of the most effective steps in preventing cancer is avoiding tobacco. Smoking or chewing betel leaf mixed with tobacco significantly raises the risk of lung, mouth, and throat cancers. Quitting tobacco use could save countless lives. Additionally, adopting a healthy diet-rich in fresh fruits, vegetables, and home-cooked meals-can help protect against cancer, while excessive consumption of processed or oily food increases vulnerability. Safe drinking water, avoidance of alcohol, and regular physical activity-such as walking or cycling for at least 30 minutes a day-also contribute to a healthier, cancer-resistant body.\nEqually important is the role of awareness. Many people are unaware of early warning signs, such as sudden weight loss, persistent lumps, or unexplained bleeding. Early detection significantly increases the chances of successful treatment and recovery. Community platforms like schools, mosques, and local centres can serve as effective spaces to educate people about the symptoms and prevention of cancer.\nCancer prevention is not only possible but also within reach if we collectively commit to healthier lifestyles and widespread awareness. It is time we prioritise our health and unite in building a cancer-free Bangladesh.\nDr Md Rifat Al Mazid Bhuiyan\nPostgraduate Fellow\nRajshahi Medical College\nrifatalmazid@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Lifestyle modification in cancer prevention",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/lifestyle-modification-in-cancer-prevention-1753882766",
        "news_paper_name": "The Financial Express",
        "publish_date": "31-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 31, 2025 00:00:00  \n\nSycophancy-insincere flattery aimed at gaining personal advantage from superiors, wealthy individuals, or leaders-is unfortunately widespread in our society, particularly in the political arena and within the civil service. This hypocritical practice undermines fair processes, leads to biased outcomes, and ultimately harms the nation.\nPolitical activists and civil bureaucrats often indulge in this unwritten custom, using excessive praise to curry favour with those in power. However, such behaviour is notably absent in the management systems of international organisations, NGOs, and private sector companies, where merit and professionalism are more highly valued.\nUnder previous regimes, it became apparent that individuals who portrayed themselves as liberal or progressive-and who could present themselves favourably to the authorities through insincere means-were often regarded as the most suitable candidates for important positions. In many instances, irrelevant and exaggerated praise dominated public discourse, overshadowing critical issues that required real attention.\nIt is imperative that the current interim administration, as well as any future government, ensures good governance by eliminating flattery and sycophancy from all levels of the development process. The attitudes of bossing, commanding, and authoritarianism are outdated tools of colonial-era bureaucracy, yet they continue to be embraced and enjoyed by many in executive roles. This mindset breeds a culture in which sycophancy thrives as people seek to win favour by any means necessary.\nTherefore, we must, without further delay, abandon and refrain from this harmful culture of sycophancy in every sphere of our national life.\nMd. Refatul Hossain\nAdditional Director (Retd.)\nDepartment of Agricultural Extension (DAE)\nFaridpur Region\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Getting rid of the culture of sycophancy",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/getting-rid-of-the-culture-of-sycophancy-1753882777",
        "news_paper_name": "The Financial Express",
        "publish_date": "31-07-2025"
    }
]