[
    {
        "full_article": "The Standing Committee of Parliamentarians on Labour, Textiles and Skill Development, in its report on the 2025–26 demands for grants to the Union Ministry of Labour and Employment, has rightly reiterated the urgent need to revise the minimum monthly pension of ₹1,000 for member-pensioners under the Employees’ Provident Fund Organisation (EPFO). This amount, fixed in August 2014 under the Employees’ Pension Scheme (EPS) of 1995, has remained unchanged for over a decade. Ironically, the Bharatiya Janata Party (BJP)-led government continues to take credit for the pension hike in 2014, though it merely implemented a decision announced earlier by the Congress-led United Progressive Alliance (UPA) regime. Back in 2014, when the UPA proposed the ₹1,000 minimum pension, the BJP, which was in the Opposition, criticised the move as insufficient. Its senior leader, Prakash Javadekar, called it a “pittance” and demanded a hike to at least ₹3,000.At present, the government allocates an average of ₹980 crore annually for minimum pension payments. This figure needs to be tripled in order to make it a meaningful increase. Additionally, the Centre contributes 1.16% of wages (capped at a ₹15,000 monthly wage ceiling) towards the EPS corpus — an amount revised to ₹9,250 crore for 2024-25 and expected to cross ₹10,000 crore in 2025-26. The government’s argument is that it cannot afford a further financial burden, but feasible suggestions to manage the additional expenditure have been submitted to the Labour and Finance Ministries and the EPFO. Equally concerning is the EPFO’s handling of applications from those opting for pensions based on higher wages. Many applicants, now receiving demand notices requiring contributions amounting to several lakhs of rupees, have been left in the dark about their entitled pension amounts and arrears. In several cases, applicants have had to rely on their online accounts to track updates, as the EPFO has failed to issue any official communication. Instead of providing clarity, applicants are expected to calculate their expected pension through a portal-based calculator that comes with a disclaimer and no assurance of accuracy. The situation is worse for member-pensioners from exempted establishments, where authorities have summarily rejected applications for higher pension and even stopped previously sanctioned higher pensions without proper explanation. The Union government must initiate comprehensive stakeholder consultations, take steps to increase the monthly pension and ensure the fair treatment of all member-pensioners.\r Published - April 02, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        pension and welfare\n                    \n                            /                      \n                        \n                        wage and pension\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        employee benefits\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        United Progressive Alliance\n                    \n                            /                      \n                        \n                        finance (general)\n                    \n                            /                      \n                        \n                        government",
        "headline_1": "​Pension woes: on EPFO member-pensioners",
        "headline_2": "The Centre must bring in transparency in scrutiny of pension claims",
        "link": "https://www.thehindu.com/opinion/editorial/pension-woes-on-epfo-member-pensioners/article69400075.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-04-2025"
    },
    {
        "full_article": "United States Vice President J.D. Vance’s recent visit to Greenland, where he reaffirmed U.S. President Donald Trump’s plan to assert control over the Arctic island, was a blunt demonstration of American power over a strategically vital territory inhabited by around 56,000 people. The visit drew sharp disapproval from Greenland’s local leaders and the Danish government, which retains sovereignty over the island. It marked a new low in U.S.-Greenland relations, which have soured in recent weeks. While Mr. Vance was inspecting the Pituffik Space Base (formerly Thule Air Base), Mr. Trump declared that the U.S. would “go as far as we have to” to take control of Greenland. This is not the first time that an American administration has attempted to acquire the island. In 1867, following the purchase of Alaska from Russia, the U.S. held unsuccessful talks with Denmark to buy Greenland. During the Second World War, after Nazi Germany occupied Denmark, the U.S. established military and radio stations on the island. In 1946, Washington offered Denmark $100 million for Greenland, which it rejected. More recently, during his first term, Mr. Trump made a similar offer, which was again declined by Denmark and Greenland. Now, in his second term, he is aggressively pursuing the idea, undeterred by the strong opposition from both sides of the Atlantic.But the Greenland of today is different from the Greenland of the 19th or even the mid-20th century. Once a Danish colony, it was formally incorporated into the Kingdom of Denmark in 1953. After a 1979 referendum, it gained autonomy, with foreign affairs and defence under Danish control. Since then, nationalist sentiment has grown, with polls indicating over 80% of Greenlanders in support of full independence. In another survey, 85% of the population opposed becoming a part of the U.S. The American push for Greenland is rooted in geopolitical calculations. As climate change accelerates Arctic ice melt, the region is becoming more accessible for navigation and resource extraction. Only five countries have direct access to the Arctic seabed: Canada, Russia, Norway, Denmark (via Greenland), and the U.S. (via Alaska). Russia already maintains a strong military presence in the region. Washington sees control of Greenland as a way to expand its Arctic claims and access to untapped natural resources. But attempting to seize territory for strategic or economic gain echoes the behaviour of bygone empires. Mr. Trump’s expansionist ambitions risk further undermining the fragile post-war international order, which is grounded in principles of territorial integrity and national sovereignty. The U.S. should respect the will of the people of Greenland. Any change in the island’s status must come through the democratic choices of its residents, and not through external pressure or geopolitical gamesmanship. Published - April 02, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Greenland\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        Denmark\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        climate change\n                    \n                            /                      \n                        \n                        natural resources\n                    \n                            /                      \n                        \n                        democracy",
        "headline_1": "​Leave it alone: on the status of Greenland",
        "headline_2": "Any change in Greenland’s status must come from the choices of its residents",
        "link": "https://www.thehindu.com/opinion/editorial/leave-it-alone-on-the-status-of-greenland/article69400451.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-04-2025"
    },
    {
        "full_article": "By Pulkit Sharma\nEmpathy as a virtue was valued deeply by our ancient cultures and there was a time when people worked hard to instil this quality in younger generations. Several mythological legends, ancient folklores and cultural narratives tell us to see beyond narrow boundaries of our ego and connect deeply with joys and sorrows of others, fostering strong bonds and meaningful dialogues. But in recent times empathic spaces in human repertoire have been shrinking fast and getting overpowered by narcissism and apathy.\nA recent study published in the Personality and Social Psychology Review concludes that self-reported empathy in youngsters has been declining since 1980, with an especially steep drop in the last decade. Newer generations are becoming increasingly trapped in their lonely bubbles of self-love, ruthlessly focusing on fulfilling their own desires, wishes and fantasies. More often than not, they display a callous attitude to pain and suffering of others. You can hear them say that why even bother to worry about the world, fret over things beyond one’s control and walk that extra mile to support others.\n\nOur world is grappling with multiple threats including climate change, environmental pollution, extremism, xenophobia, geopolitical aggression, geoeconomic greed, brutal wars, forced migrations, psychopathy and cybercrimes. We forget that we are nothing but a tiny pixel on this vast map and we will continue to exist only if the world exists. If the world disintegrates, our lonely bubbles of narcissism will burst, leaving us in utter fear and misery. We must remember that we are not isolated, self reliant entities. We are deeply embedded in an interconnected existence – we exist because the existence exists. While the existence holds us, nourishes us, protects us and provides for us, the existence also needs nourishment, protection and love and we all must do our bit in maintaining this fragile, symbiotic balance.\nTherefore, we must break free from constraints of our narcissism and develop connections of empathy, affection and altruism with the world around us. Finding ways to reconnect with the world is not very difficult. Spending more time in the real, outside world and carefully observing everything that exists in nature can reawaken our lost curiosity for nature, wildlife and fellow human beings. Meeting new people, interacting with them and attentively listening to their narratives can make us aware of the multiple similarities we share with them and ubiquitous happiness and sadness that run deeply in our veins. It might also make us aware that there are often multiple and divergent perspectives of looking at the same reality. While perspectives change, reality remains the same and an introspection into these perspectives and the one reality reveals how we all are connected to the universe.\nThe Nasadiya Sukta from Rig Veda reveals that there was either an existing or a non-existent Singularity before the creation. There was no sky, air, matter and no water. This One formless thing experienced a desire to manifest itself and therefore it expanded into multiples. We are a part of this formless One and therefore interconnectedness is our true nature. Through empathy we can reconnect with the formless One, and reclaim our true, joyful essence.\nThe writer is a clinical psychologist based in Puducherry\n\n",
        "headline_1": "Exploring interconnectedness of being",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/exploring-interconnectedness-of-being/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-04-2025"
    },
    {
        "full_article": "As advertised, Trump presidency has thrown disruptive balls in global geo-economic playgrounds. And yet the most disruptive move of them all may come today with Trump’s announcement of “reciprocal tariffs” — retaliatory tariff-marking irrespective of the political colour of the trade partner, ally or adversary. Separately, on Thursday 25% tariff is set to be imposed on all cars and car parts being imported into US. Thus, tariffs make a comeback in American policy toolkit after several decades of free-trade evangelism when US swapped political allegiance for market access.\nPre-World War I, US was a highly transactional major power. It tailgated British (more accurately British Indian) expeditions in Asia to expand trade footprints — most famously with China in the aftermath of opium wars. At the same time, it zealously protected its own spheres of influence in the Americas against British overreach, like in Venezuela in the late 19th century. It was starkly illustrative that the largest trade and tech partner of the world’s first communist state, Soviet Russia, was America!\nRead full story on TOI+\n\n",
        "headline_1": "Is Trump’s tariff turmoil good news for India?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/is-trumps-tariff-turmoil-good-news-for-india/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-04-2025"
    },
    {
        "full_article": "On Jan 26, 1950, the first chief justice of India took office under the new Constitution. Three days before CJI Harilal Jekisundas Kania took this oath, his comments on a Madras high court judge (Bashir Ahmed) evoked a sharp reaction from the prime minister. Nehru wrote to home minister Sardar Patel that Kania was being “unjudicial and indeed improper”. Patel deputed the home secretary to convince Kania not to give an adverse opinion on Justice Bashir.\nThus, the executive’s attempts to influence CJI, for appointments to constitutional courts, are as old as the Supreme Court itself. The Nehru era saw such attempts fuelling apprehensions about the dilution of judiciary’s independence.\nIn 1958, the first law commission, led by MC Setalvad, in its 14th report put the blame primarily on chief ministers becoming a source of patronage for those aspiring to become HC judges.\nRead full story on TOI+ \n\n",
        "headline_1": "Judges & GOI: A murky tale",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/legallythinking/248437/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-04-2025"
    },
    {
        "full_article": "Trump’s tariff blitzkrieg could prove to be a boon for the long-exploited Indian consumer\nThe tariff war that Trump has declared against the world has got govts across the globe scrambling to devise strategies to counter the US offensive, ranging from retaliatory taxes on American imports to submissively lowering their own import duties on Uncle Sam’s products.\nNew Delhi seems to favour the latter approach and is inclined to reduce the imposts it levies on US products, from chicken legs and apples to Harley Davidson mobikes.\nAs a result, Trump’s MAGA tariff bombshell could well have an unintended beneficiary, the long-exploited Indian consumer.\nEven as the price of almost all products rises substantially in US, adversely affecting American buyers and customers, Indian consumers might end up paying less for a number of consumables, from Californian almonds to bourbon, the whiskey made in Kentucky, if under White House pressure New Delhi lowers its import duties, which range from 11% to as high as 60%.\nIndia’s high tariffs have long been justified on the grounds of saving foreign exchange and promoting domestic production, both laudable aims. But such protectionist policies have ended up short-changing the Indian consumer by guaranteeing a virtual monopoly to domestic suppliers of everything from consumer durables to comestibles.\nThe enforced absence of competitiveness in price and quality has inevitably resulted in the Indian consumer having to pay more for second-rate products.\nPre-Trump 2.0, US tariffs were among the lowest in the world, at around 2% on manufactured goods, a point that the American president repeatedly thundered in high dudgeon, claiming that this has enriched countries such as India at the expense of America.\nHowever, the low tariffs also benefitted American consumers, making them the most self-indulgent in the world. Now, if US increases its import duties and India lowers its, the tables could be turned at the expense of the US consumer and to the advantage of the Indian consumer.\nTo which a toast might well be raised, in bourbon of course. Cheers, Donaldji.\n\n",
        "headline_1": "Shukriya, Donaldji",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/shukriya-donaldji/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-04-2025"
    },
    {
        "full_article": "In a world increasingly shaped by algorithms, social media bubbles and partisan divide, truth feels more elusive than ever. The International Fact-Checking Day is a day to celebrate the important role fact-checkers play in defending truth against the overwhelming tide of information disorder—or so we are told. Does fact-checking actually make a substantial dent in the deluge of disinformation swamping our digital lives?\nMake no mistake, fact-checking has scaled up dramatically, with at least 451 projects, organisations, and campaigns active in more than 100 countries, according to Duke Reporters' Lab. From the early days of outfits like Snopes tackling urban legends to the rise of PolitiFact and similar initiatives during the 2008 US presidential election, the practice has become a worldwide movement.\nConsidering this scale, fact-checking is no longer the scrappy side hustle of underpaid journalists. It has become a marketable service that requires diverse funding streams. Big Tech platforms like Facebook and Google have poured millions into fact-checking initiatives, philanthropic grants, and corporate sponsorships. Even government-backed initiatives help keep the lights on. Yet, none of these funding streams are immune to accusations of bias or agenda-setting.\n\nOn the other hand, non-profit fact-checking is a financial orphan. Some have self-sustaining models, others don't. Beyond being an alternative to legacy news media, many have expanded their scope, incorporating OSINT (open-source intelligence) techniques, watchdog journalism, advocacy, and citizen journalism. Automated fact-checking using machine learning or AI chatbots have also grown vital alongside human capacity. For instance, Elon Musk's AI bot Grok has been throwing a wrench in propaganda machinery with oddly satisfying sarcasm and slang, if any X user asks for it. Unlike a flesh-and-blood fact-checker struggling to wade through the deluge of information to verify and counter disinformation, Grok presents evidence-backed rebuttals almost instantly. Despite its drawback in producing quality reports, it is at least able to effortlessly debunk fragile and blatant falsehoods.\nThe concept of \"disinformation market value\" is not explicitly defined in standard economic terms. However, we can interpret it as the financial value that stems from the creation, dissemination and monetisation of disinformation. In 2021, a special report by Newsguard, an internet trust service, estimated that publishers of misinformation and disinformation received $2.6 billion annually. However, the actual propaganda war is perhaps more daunting and decentralised.\n\nToday, even lone influencers and loosely coordinated networks can be harder to detect, let alone their financial incentives. Worse, the investment in AI-driven fact-checking pales in comparison to the multi-billions being funnelled into generative AI tools that can craft convincing synthetic media in seconds, playing a dual role.\nRegardless of their funding models, establishing a reputation for independence, non-partisanship and objectivity has been a major challenge for many fact-checking platforms. However, even more pressing is the question of impact. Has fact-checking actually curbed disinformation? Have you ever heard of a fact-check report that has gone viral? In contrast, a well-orchestrated lie on social media can rack up millions of views in hours, often faster than the dry recitations of fact. In April 2013, when the Twitter account of the Associated Press was compromised, a false claim was posted about explosions at the White House. The misinformation triggered immediate panic in financial markets, causing the S&P 500 to drop one percent and wiping out $136.5 billion in market value before the truth was clarified. This imbalance reflects a fundamental disadvantage as fact-checking remains largely reactive, chasing falsehoods after they have already metastasised.\n\nHowever, studies suggest that fact-checking can effectively correct misinformation and improve public understanding, though its impact varies depending on context and audience. There is still considerable ambiguity regarding when and how fact-checking affects beliefs. Prof Sander van der Linden of the University of Cambridge, author of multiple award-winning book Foolproof: Why Misinformation Infects Our Minds and How to Build Immunity, says, \"Fact-checking does work… Studies provide very consistent evidence that fact-checking does at least partially reduce misperceptions about false claims.\"\nBeyond this argument, its future could still hold promise if it evolves beyond its current constraints. One path forward lies in rethinking scale. Rather than chasing every falsehood, fact-checkers could focus on high-impact targets—disinformation campaigns with clear societal stakes, like election interference or public health crises. Another change could be to engage the public. Fact-checking needs a complete overhaul in how we incentivise and create demand for truth. Thus, the burden can no longer be on the fact-checkers to find the facts, and we should instead try to weave fact-checking deeper into the fabric of our society. And perhaps most radically, fact-checkers could also pivot from debunking to pre-bunking, inoculating people against disinformation before it takes root, as experiments in \"media literacy vaccines\" have begun to explore.\nThe growth in number and scope of fact-checking projects is a testament to our collective hunger for clarity in a chaotic world. As someone who has been involved in fact-checking since its early days, I believe this industry has the potential to scale, professionalise, and evolve to meet the challenges ahead.\nSams Wahid Shahat is information integrity researcher at Tech Global Institute.\n\nViews expressed in this article are the auhtor's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The fact-checking boom: A growing industry or a fading promise?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-fact-checking-boom-growing-industry-or-fading-promise-3861841",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-04-2025"
    },
    {
        "full_article": "Bangladesh, a nation of remarkable resilience and ambition, faces immense governance challenges due to its extraordinary population density. With over 1,300 people per sq-km as of now (according to World Population Review)—a figure that would soar beyond 2,500 if the uninhabited Sundarbans and hilly regions were excluded—the country ranks among the most densely populated in the world. To put this into perspective, even if the entire global population of 8.2 billion were concentrated within the United States, its density would still be less than 900 people per sq-km—far lower than Bangladesh's adjusted figure.\nIn light of these staggering demographics, the need for a more efficient and decentralised governance model in Bangladesh has never been more pressing. During a recent discussion on this subject, Sakhawat Khan, former country director of Amnesty International South Sudan and a seasoned UN official with 30 years of experience in the Horn of Africa, emphasised the crucial role of a provincial government system in ensuring greater accountability and effective resource distribution in densely population areas. Having overseen one of the world's largest refugee camps in Somalia, Khan strongly supports the idea of provincial governance as a means to improve administrative efficiency and citizen engagement.\nSeveral African nations have demonstrated the benefits of such a system. Ethiopia, for instance, has successfully implemented a federal structure that grants significant autonomy to its regional states, allowing for localised decision-making tailored to diverse ethnic and economic needs. Similarly, Kenya's devolution model, introduced in 2013, has significantly improved service delivery by empowering county governments with financial and legislative authority, reducing corruption, and fostering development in previously marginalised regions.\nDrawing insights from these examples, Bangladesh could greatly benefit from a provincial government system to enhance governance, improve accountability, and ensure balanced development. Currently, the country's administrative and judicial structures remain heavily centralised, creating bottlenecks in service delivery. The concentration of major judicial branches, national administrative offices, and decision-making bodies in Dhaka results in significant inefficiencies. Public services, including the judiciary and police administration, often require citizens from remote areas to travel to the capital, incurring delays and additional expenses.\nWith an estimated population nearing three crore, Dhaka bears the brunt of excessive urban congestion, infrastructural strain, and service backlogs. This over-centralisation has not only impacted governance efficiency but has also stifled regional development. \"Bangladesh needs to recognise that a centralised system is no longer viable for a nation of its size and density. A well-structured provincial system can empower regional administrations to make timely, locally-informed decisions,\" Sakhawat Khan said.\nA comparative analysis with neighbouring countries offers valuable lessons. India's federal structure, with 28 states and eight union territories, has allowed for faster local governance, economic decentralisation, and improved law enforcement through state police forces. Pakistan, too, follows a provincial model with four provinces, which, despite its political and administrative challenges, has enabled regional autonomy. Sri Lanka's Provincial Council system, introduced in 1987, has had mixed results due to ethnic tensions, but has nonetheless improved local governance and service delivery. Even smaller nations like Switzerland and Belgium have implemented decentralised governance models, demonstrating that federalism is not just about geographical size but about administrative efficiency and governance quality.\nIf Bangladesh adopts a similar model with five to seven provinces, it could achieve better administrative efficiency and reduce the burden on the central government. Public services could be brought closer to citizens, ensuring more effective delivery in crucial sectors like healthcare, education, and law enforcement. Establishing regional High Courts would significantly reduce legal backlogs and delays, improving access to justice. Additionally, decentralisation would drive economic growth beyond Dhaka, mitigating regional disparities and fostering nationwide development.\nMoreover, a provincial framework would create multiple centres of power, preventing excessive centralisation and reducing risks of bureaucratic inefficiencies. By distributing political authority across regions, Bangladesh could move towards a more participatory and accountable democracy.\nGiven the country's unique challenges—high population density, administrative overload in Dhaka, and inefficient service delivery—the need for a provincial government system is clear. Learning from its neighbours and other successful models, Bangladesh has an opportunity to build a more effective and inclusive governance structure.\nImplementing a provincial government system would mark a significant step towards ensuring equitable development, strengthening governance, and fostering democratic representation. By embracing decentralisation, Bangladesh can unlock its full potential and pave the way for a more balanced and prosperous future.\nAKM Sayedad Hossain is executive director at the National Institute of Global Studies (NIGS). He can be contacted at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Decentralising Bangladesh is the way to efficient governance, equitable development",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/decentralising-bangladesh-the-way-efficient-governance-equitable-development-3861626",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-04-2025"
    },
    {
        "full_article": "Recent media reports suggest that the Public Administration Reform Commission of Bangladesh has proposed dividing the country into four administrative provinces as a means of decentralisation, aiming to establish a more efficient administrative system. However, it remains unclear whether this proposal also entails replacing the existing unitary parliamentary democracy with a federal system of governance. While federalism may be advantageous for vast nations such as the US, Russia, Indonesia, and India—where diverse social, cultural, and religious groups coexist—it is entirely unnecessary for a small and relatively homogeneous country like Bangladesh. A unitary parliamentary democracy remains the most suitable model for our governance.\nWhat Bangladesh truly requires is an effective and manageable administrative framework rather than an expansion of the flawed system we currently endure. The administrative structure we have inherited, dating back to colonial rule in 1793, is profoundly obsolete and continues to hinder national progress, exacerbating poverty and contributing to social, cultural, and political deterioration. No modern, civilised nation retains such an antiquated system, which bestows excessive power upon administrative officials—such as upazila nirbahi officers (UNOs), deputy commissioners (DCs), and divisional commissioners—who function almost as viceroys. While certain superficial modifications have been made, the core structure remains largely unchanged and retains its colonial character. A comprehensive and fundamental restructuring is long overdue.\n\nIt is imperative that we dismantle this antiquated framework and transfer all administrative authority to the union parishad (UP), thereby eliminating the district and upazila administrative tiers. The UP should be reconstituted as the primary governing authority at the local level. Urban and rural areas alike should be divided into UPs, with all members and the chairperson elected through a party-list proportional representation system (PRS), where feasible. The UP should function as a robust local legislative body, complemented by a fully autonomous administrative unit tasked with implementing and enforcing its decisions. This unit would oversee essential public services, including primary and secondary education, healthcare, infrastructure, law and order, social welfare, and employment opportunities for both men and women. In essence, the UP would bear direct responsibility for the well-being of every citizen. A more in-depth discussion of the advantages of a strengthened UP system warrants further exploration.\nBy abolishing the offices of the DCs and UNOs, we would effectively curtail excessive bureaucratic dominance, ensuring that governance is truly by the people and for the people. Rather than being subjected to distant bureaucratic rule, citizens would be served by locally accountable representatives within the UP.\nDividing Bangladesh into four provinces would necessitate an expansion of the bureaucracy at both the central and provincial levels, inevitably leading to increased administrative expenditures, corruption, nepotism, and favouritism. The long-term financial, social, and moral transformation of Bangladesh—particularly in rural areas—can only be achieved through a robust local government, not through the reinforcement of the colonial administrative \"iron frame.\" Advanced nations owe much of their stability and efficiency to the strength of their local governance structures. The US and UK, despite their imperfections, remain effective democracies largely due to the resilience of their local government systems.\n\nIntroducing a federal structure in Bangladesh would be catastrophic, not only due to the financial burden of sustaining multiple layers of government but also because of the nation's low levels of education and the deeply entrenched culture of political corruption. Such a transition would drive Bangladesh towards fragmentation, particularly given its sensitive geopolitical reality.\nTherefore, Bangladesh requires a strong central government wherein authority is concentrated within a single national framework—eschewing regional governments while ensuring that local UPs are empowered to function under national directives. Laws and governance must remain uniform across the nation and should be executed solely by the local government (UP) through its own independent administrative apparatus. The sooner we abolish the ineffective and corrupt DC and UNO offices, the sooner Bangladesh can progress towards a truly people-centric governance system, underpinned by an efficient and accountable UP administration.\nTayeb Husain is a retired college teacher and business executive based in Sweden.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Should Bangladesh be divided into four provinces?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/should-bangladesh-be-divided-four-provinces-3860651",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-04-2025"
    }
]