[
    {
        "full_article": "Union Home Minister Amit Shah has rightly stressed the need to make a distinction between refugees and infiltrators. Though valid, the problem lies in the application of objective parameters by those in power to make a distinction. Even where proper policy and a legal framework exist, issues may arise. Also at play is the level of official understanding. In India, which is not a signatory to the 1951 UN Convention on the Status of Refugees and the 1967 Protocol, there is no comprehensive single law defining who a refugee is, leaving scope for arbitrary action. Till the end of March 2025, apart from the Citizenship Act 1955 and the Passports Act 1967, three laws (the Foreigners Act, 1946, the Registration of Foreigners Act, 1939 and the Passport (Entry into India) Act, 1920) were applied to deal with foreign nationals, including refuge seekers. From April, the Immigration and Foreigners Act replaced the three pre-Independence laws and subsumed the Immigration (Carriers’ Liability) Act, 2000. While this streamlined the legal framework, the absence of a refugee policy document has also led to different yardsticks for the refugee community in India. While there was a rehabilitation policy in 2014 for about 63,000 Tibetan refugees, there is no such document for the nearly 90,000 Sri Lankan Tamils. At the end of June 2023, the population of refugees or persons of concern in India was over 2.11 lakh (also counting those from Myanmar, Afghanistan, Bangladesh, Africa and West Asia). Any undocumented or overstaying refugee is regarded as an illegal migrant (Citizenship Act). He can also be called an infiltrator. Thus, genuine and harmless refugees risk facing harassment.Even though the Citizenship (Amendment) Act, 2019 was aimed at providing citizenship to six religious minorities belonging to Bangladesh, Pakistan and Afghanistan, it drew sharp criticism as it discriminated on the lines of religion and left out sections of Muslims, and also Sri Lankan Tamils and the Rohingya, both minorities in their countries. But in a notification last month, undocumented or overstaying Tamil refugees, who have registered themselves with the authorities, were granted exemption from penal provisions of the Immigration and Foreigners Act, provided they took shelter in India on or before January 9, 2015. Other groups too have been covered. Still, there is no change when it comes to the recent trend of religion-based exclusions. There is nothing fundamentally wrong with the approach of discreet humanitarian relief to refugees in general but this has to be backed by consistent, rational and fair treatment for all.  Published - October 16, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        refugee\n                    \n                            /                      \n                        \n                        United Nations\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        immigration\n                    \n                            /                      \n                        \n                        illegal immigrants\n                    \n                            /                      \n                        \n                        Tibet\n                    \n                            /                      \n                        \n                        Sri Lanka\n                    \n                            /                      \n                        \n                        Myanmar\n                    \n                            /                      \n                        \n                        Afghanistan\n                    \n                            /                      \n                        \n                        Bangladesh\n                    \n                            /                      \n                        \n                        Citizenship Amendment Act\n                    \n                            /                      \n                        \n                        religion and belief\n                    \n                            /                      \n                        \n                        minority group\n                    \n                            /                      \n                        \n                        welfare\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Rohingya crisis",
        "headline_1": "Refugees and infiltrators: On different yardsticks for India’s refugee community",
        "headline_2": "India needs a refugee policy document that is non-discriminatory",
        "link": "https://www.thehindu.com/opinion/editorial/refugees-and-infiltrators-on-different-yardsticks-for-indias-refugee-community/article70167639.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "The 2025 Nobel Prize in Economic Sciences has been awarded to Philippe Aghion, Peter Howitt and Joel Mokyr, who have, over decades, attempted to explain humanity’s unprecedented progress over the past two centuries. While Mokyr has provided the long historical and cultural context, Aghion and Howitt have given it a formal mathematical frame or the “creative destruction” model. The idea itself is older. It originates with economist Joseph Schumpeter, who described capitalism as an evolutionary system in which innovation continuously displaces old technologies, firms and industries — a process both creative and destructive. But Schumpeter’s framework rested on certain assumptions: that markets are free, competition is open, and the state acts only as an enabler of private enterprise, not as a driver of innovation. This assumption sits uneasily with the historical record. The long vision of the erstwhile Soviet state, and now the Chinese model of developmental capitalism, reveal how the state itself can shape and direct innovation. The creative destruction model, refined by Aghion and Howitt in the early 1990s, emerged during the twilight years of the Cold War, just as the Washington Consensus and neoliberalism became the dominant global economic paradigm. These models reinterpreted Schumpeter’s idea in mathematical form through the endogenous growth theory — the notion that long-term growth is generated not by external forces but by innovation, education, and research arising within the economy. Crucially, it assumed that competition and private incentives — not central planning — are the engines of technological progress.But the Nobel recognition comes at a time when the very conditions for this model to succeed have been upended by U.S. President Donald Trump. His administration has weaponised global trade, politicised science and technology, and turned markedly protectionist, departing from the open, rent-seeking capitalism of the post-war American economic order. While the creative destruction and endogenous growth models remain powerful tools to understand progress within a specific system — that of neoliberal capitalism — they fail to explain the exponential technological advances of state-led economies such as China. These models also overlook how geopolitics, institutional fragility and widening inequalities can reshape the very structure of innovation. It is thus telling that the Nobel Committee has chosen to honour a framework whose ideal conditions — liberal markets, global openness, and scientific freedom — are under strain. This perhaps must be viewed as a warning that for liberal democracies to thrive, they must not renege on the ideals of institutional freedoms within state-enabled capitalist societies. Published - October 16, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        economics (education)\n                    \n                            /                      \n                        \n                        award and prize\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        USA",
        "headline_1": "​Evolution, revolution: On the Nobel Prize in Economic Sciences 2025",
        "headline_2": "The economics Nobel is a nod to freedom and innovation",
        "link": "https://www.thehindu.com/opinion/editorial/evolution-revolution-on-the-nobel-prize-in-economic-sciences-2025/article70167655.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "India should readjust its strategic policy: dependency on any country for anything, energy or arms or trade or tech, mustn’t exceed a quarter of total requirement. That’ll reduce vulnerability when any power pulls the plug\nAs trade wars harden into tariff wars and sanctions become political instruments, India’s challenge is to remain free in a world that punishes independence. Most countries pick sides. India picks stability. Its answer lies in a new rule for this age of coercion, one that is not about joining blocs but about managing dependencies. No more than 25% dependency on any single partner in any strategic area, whether energy, defence, trade, finance, or technology, so that no one partner can pull the plug.\n\nRead full opinion on TOI+\n\n",
        "headline_1": "New Delhi’s new target: 25%",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/new-delhis-new-target-25/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "Advantages of having a khichdi election with states and Centre together are minimal compared to the costs. Regional voices and the federal compact are sacrificed for suspect macroeconomic gains\nThe High-Level Committee on “One Nation, One Election” (ONOE) has endorsed the idea. A reading of the report suggests the committee reduced its terms of reference to a simple question: Do the Constitution or our laws disallow it? The answer: They don’t. So, let’s go ahead and do it.\nRead full opinion on TOI+\n\n",
        "headline_1": "One nation, one election: Why the promise doesn’t add up",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/one-nation-one-election-why-the-promise-doesnt-add-up/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "By S Kannan\nChange is the only constant. From times ancient, change is a realisation that we must go with the flow. It is easier to walk along the river. The flow is defined by nature and science, rather than attempt the harder walk upstream. For those who may be tempted to walk in the reverse direction, it may seem like a fresh, energising challenge. However, sooner than later, the mind and heart will agitate, attempting something against a natural force is not only futile, but it also defies logic.\nThe change of guard in the Indian One Day International (ODI) cricket team signifies the natural flow of time. Board of Control for Cricket in India (BCCI) appointed Shubman Gill the captain of the One Day cricket team, replacing highly successful skipper Rohit Sharma, who won international competitions for India. This signifies that we must be ready to roll with the times, irrespective of how successful we may have been.\n\nBeyond cricket, in our daily lives too, we are faced with many situations, where acceptance of change and making adjustments help maintain our fragile peace and calm. For instance, if there is a peak traffic time in a bustling city and you know about it, adjust. Change your departure time, it is not only logical but an acceptance, such a change is positive energy. Imagine, if you are trying to wade through a sea of humanity to enter a Metro coach, it is a forced exercise. A change for the better is timing yourself well, logically, leaving in accordance with peak time factored. Just like when a player decides to play an elegant straight drive or a late square cut, he must hit it with great timing to get optimum results.\nGreek philosopher Heraclitus said: “Change is a constant.” What he had said in 500BC holds good today as well. There is grace in accepting change and letting go, just like Rohit Sharma gave up captaincy in T20 internationals, tests, Mumbai Indians, and now ODIs. We, too, must move on from positions we once held, from jobs we were so passionate about and work towards creating a new tomorrow not just for ourselves but for all those associated with us. Going with the flow, changing with seasons is the way of nature and living according to nature brings peace and calm.\nAccording to a Zen Koan, a man once fell into the river. His friends panicked and frantically tried to help him but could not do much. Soon, they had to abandon their attempts as they saw the man being carried away by the river. When they reached near the fall, they found their friend unharmed. They asked him, how did he even manage to survive a raging river full of rocks and boulders. The man said because he adjusted according to the flow of the river and followed how it turned at bends and near boulders. The man explained that he accepted the river’s will and surrendered his ego.\nIn Sanskrit, “Samyak sarati iti samsar” means an unending flow, constant movement. That which keeps moving is samsar, the world. This is a direct reference to how change is natural and should be accepted.\n\n",
        "headline_1": "Don’t get clean bowled by change",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/dont-get-clean-bowled-by-change/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "A DNA-based census confirms that India is not doing right either by the creature or its own heritage\nThat India is symbolically associated with the elephant (as US is with the eagle and China with the dragon) says something about its place in our civilisation and imagination. As the new Status of Elephants in India report reminds at its start, these majestic creatures are revered in connection with Lakshmi, Ganesha, Buddha…and killing an elephant was punishable with death in the early Mauryan period…and so on. Not every country is blessed with such a rich heritage of coexistence, compassion and worship in relation to animals. But are we living up to it? Not at all.\nThe new 2021-25 estimate of India’s Asian elephant population is 22,446, down 19% since the 2007 estimate. Yes, the use of the DNA-based mark-recapture technology this time means the data are not totally comparable, even as it provides a much more reliable baseline for future monitoring. Also yes, the report is crystal clear and detailed that India is disrespecting and hurting elephants today, across the country. For example, the once-contiguous elephant population in Western Ghats continues to be rapidly disconnected by factors like changing land use and mushrooming developmental projects. Such fragmentation is acute in the Northeast, which holds the second largest elephant population of India.\nAcross the planet, the last century has seen humanity quadruple its number while African elephants have lost nearly 90% of theirs and Asian ones 70%. Even modern notions of compassion are all screwed up. For example, tourists feel good about themselves when they support so-called elephant sanctuaries. Hey, let’s bathe with a baby elephant, they looove the water after all. But when that baby has to stay in the water all day, pulled away from her own family to entertain one set of strangers after another, that’s severe exploitation of a sentient being. This intelligent animal belongs in the wild. Any domestication is the result of a long list of cruelties. And it will remember each of these, given its extraordinary memory. We put the elephant in a lot of our stories. But it is not known with certainty what she thinks of us. Going by our modern track record, she likely finds us disgusting.\n\n",
        "headline_1": "Elephants Are Losing",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/elephants-are-losing/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "We welcome the Bangladesh Army's decision to act on the warrants issued by the International Crimes Tribunal (ICT) against 16 in-service ranking officers recently indicted for crimes against humanity, including enforced disappearance and torture in custody. Its announcement in this regard—that all but one of those accused officials have been placed under custody—has reassured observers and the public, dispelling social media rumours meant to create sensation and stir unwarranted political tension. These trials are vital to ensuring justice for the many victims of cruel and inhumane suffering.\nIt was also reassuring to hear Adjutant General Md Hakimuzzaman affirm, at a press briefing held at the Army Headquarters on Saturday, that \"Bangladesh Army respects all laws recognised by the Constitution.\" We hope that this spirit will be carried through in all its future actions. The nation and the international community will be watching closely to ensure that the army's public pledge to cooperate with the ICT's judicial process is followed through. We can recall that the United Nations fact-finding mission's report on the July uprising atrocities also called for ensuring accountability of members of security agencies. Any issue with technical clarity in the ICT Act, hopefully, will not affect the administration of justice.\nWe also note the adjutant general's assertion that those named by the ICT for alleged crimes were charged for their actions while working at the Directorate General of Forces Intelligence (DGFI) and the Rapid Action Battalion (Rab), and that these agencies at that time were not under the Army HQ. Distancing the accused from the army as an institution certainly deserves due consideration, as the DGFI functions under the Prime Minister's Office—currently under the Chief Adviser's Office—and Rab is an arm of the police.\nHere comes the question of how the army as an institution can protect its sanctity and integrity from those who may tarnish it by committing criminal acts during their secondment to other agencies. An institutional mechanism of rigorous screening before their reinstatement must be developed. The question of differentiating between the army and its officers serving in various security agencies outside the force also reminds us of the need to reform these agencies.\nThere must be effective legal deterrents to prevent politicians from misusing security agencies—particularly the DGFI—for partisan purposes. Equally important is ending the abuse of power and impunity these agencies have long enjoyed on flimsy security grounds. Besides political workers, student activists, rights defenders, and academics, we in the media have also experienced DGFI's overreach. It intimidated newsrooms so often that a climate of fear persisted for quite a long time, affecting press freedom.\nWe echo the calls made by some civil society organisations such as the Transparency International Bangladesh and the Human Rights Forum Bangladesh that the interim government must initiate meaningful reform of these security agencies, so that the incoming political government post-elections can carry the process forward. We need reforms that can prevent a reversion to the old practices of power abuse and the weaponisation of these agencies by political masters.\n",
        "headline_1": "Army cooperation with ICT trials vital",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/army-cooperation-ict-trials-vital-4008141",
        "news_paper_name": "The Daily Star",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 17, 2025 00:00:00  \nWhile Bangladesh has long focused on removing non-tariff barriers (NTBs) in other countries to facilitate its exports, it now finds itself facing similar demands from the European Union (EU) -- its largest trading partner. The EU has formally asked Dhaka to eliminate a number of trade- and investment-distorting NTBs as part of efforts to deepen bilateral trade relations. According to official sources, the EU has identified around 60 types of NTBs -- categorised under 13 broad areas in a document prepared in consultation with EU member states -- that it views as major impediments to business expansion,.\nThe EU's list highlights sector-specific obstacles affecting trade in agriculture, food and dairy products and pharmaceuticals-sectors that have significant potential but remain constrained by procedural and regulatory bottlenecks. The identified NTBs span critical areas such as investment, services, customs procedures, government procurement, intellectual property rights (IPR), counterfeit goods, double taxation and profit repatriation. As Bangladesh prepares to graduate from the Least Developed Country (LDC) category in 2026, the EU has emphasised the need to align its commercial and regulatory practices with international standards. The EU also notes that restrictions on foreign access to bonded warehouses, inland container depots and quality-control operations continue to limit trade efficiency.\nIn the agro-business sector, the EU has pointed to complex licensing processes, inconsistent product standards and discriminatory duties -- especially on filled milk powder -- that discourage agricultural exports to Bangladesh. Other technical barriers include non-recognition of international test reports and mandatory radiation-testing requirements that complicate market access for European exporters. In the pharmaceutical sector, the EU has identified slow approval processes for new products, limited compliance with international marketing codes, and logistical challenges in cold-chain management and ground handling of sensitive medicines. Concerns have also been raised over non-transparent procurement practices and tendering rules that distort competition. Beyond these sectoral issues, the EU's document underscores weaknesses in tax administration, inadequate enforcement of IPR laws --particularly for seed-related innovations -- and regulatory hurdles that restrict the repatriation of profits, dividends and licensing fees by foreign companies. The EU has made it clear that in order to expand trade and investment ties, Bangladesh must demonstrate a firm commitment to fair, transparent, and rules-based trade governance. It also reaffirms the bloc's readiness to engage with Dhaka through constructive policy dialogue to address these challenges. Importantly, the EU stresses that ensuring a level playing field will benefit not only European exporters and investors but also Bangladeshi businesses that seek to operate in a predictable and competitive environment.\nIt appears that most of the reported barriers are process-related rather than rooted in legal or policy frameworks. Nevertheless, removing them would unlock significant opportunities for trade and investment on both sides and support Bangladesh's economic transition beyond LDC status. To meet these expectations, Bangladesh should adopt a comprehensive and time-bound action plan to address the EU's concerns on a priority basis. By enhancing regulatory transparency and aligning standards with global best practices, Bangladesh can strengthen investor confidence and consolidate its partnership with the EU in the post-LDC era.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Addressing NTBs to cement partnership with EU",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/addressing-ntbs-to-cement-partnership-with-eu-1760628360",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       October 17, 2025 00:00:00  \nObservance of the World Standards Day or International Standards Day on October 14 in this country has become routine but its confinement to the official circle and some private agencies has little helped create the mass awareness and spread the message. The rhetoric speakers at the function exude does not match with the grass-roots-level reality. When the officials claim that several laboratories of the Bangladesh Standards Testing Institute (BSTI) have been developed as world class facilities, they would be hard put to explain why the parent institute's certificate is not recognised by other countries. \nAccepted that some laboratories meet the international testing standards but there are several tests that no laboratory here can perform. The international standard plant quarantine for exports and some advanced food safety analysis are missing, let alone the specialised chemical analysis. When required, it is done by Societe Generale de Surveilance, a multinational company founded in France and headquartered in Geneva, Switzerland. Inspection, verification, testing and certificate services are its specialisation no other institute can challenge. \nHowever, the first two should have been within the reach of the local laboratories long ago but for the bureaucratic go-slow policy on developing testing infrastructure. Export of vegetables including the leafy ones and fruits is often restricted due to failure of meeting the phytosanitary requirements of the importing countries. In Bangladesh, the plant quarantine wing under the Department of Agriculture Extension (DAE) of the Ministry of Agriculture serves as the National Plant Protection Organisations (NPPO) in other countries. Now the question is if the wing concerned issues a phytosanitary certificate, if the destination country is obliged to recognise it. Clearance of a commodity by the NPPO is one thing and the same by the quarantine wing under the DAE is a completely different thing. \nWhy Bangladesh does not have a full-fledged NPPO? Consignments to and from other countries need to meet the international standards. Advanced technology and expert manpower are a prerequisite for ensuring that plants and plant products are free from pests and diseases. Further, it has to make sure that the ecological health of the destination country is not disturbed by introduction of invasive species. When potato export fails to take off because of failure to meet the phytosanitary requirements of the importing countries such as Russia, there is a need for reviewing the DAE's role in improving the entire gamut of cultivation, harvest and storage of agricultural produce. The inspection and monitoring must start from quality seeds to irrigation to use of fertilisers to spray of insecticides to harvesting and storage of crops. \nThis is how Bangladesh can transform its image as a producer of safe foods. Maintaining the standards of the consumables is a culture of ethical practices a people develop throughout ages. Unfortunately, this country is not famous for this. On the contrary, there are dark geniuses who can produce a carbon copy of anything starting from local brands to foreign brands of cosmetics and toiletries to life-saving drugs produced by pharmaceutical companies. Unsuspecting consumers often purchase the spurious products thinking those are genuine. Both adulterated foods and counterfeit consumer goods compromise or cause harm to public health. \nDigital technology has made copying so picture perfect that naked eyes often fail to distinguish the fake items from the genuine. For example, toothbrushes of the famous brands like Dr West's are available everywhere in the country. The prices of such items are a good indication of its local production. No one cares for the copyright laws that should have prompted the authorities launch drives against factories that churn out millions of the item. Standardisation of goods produced by genuine manufacturers thus suffers a setback in the process. At the same time, the country's aspiration for self-sufficiency in various products is stymied. As the market is flooded with fake products of foreign brands, the local brands find marketing of theirs very difficult. \nSo, there is a need for containing the invasive business of counterfeit goods. Notwithstanding the BSTI's endeavour to protect both consumer rights and maintenance of standards of local brands, the counterfeiters find ways of carrying out their forgery and fraudulent business. Unless the massive counterfeit business can be dismantled, standardisation of goods will not take a firm root in the system. Therefore, serious and effective drives should be launched in order to drive impostors out of business. This is a perquisite for improving quality of products of local brands and adding value to the national economy. \nObservance of the World Standards Day in the capital with the participation of the government officials concerned, representatives of the CAB and industries in the private sector will hardly produce any positive results unless people at the grassroots level are sensitised about maintenance of qualities of produce and goods and take a stand against adulteration and copying of goods. To that end, the DAE and representatives of SMEs should collaborate for observance of the day in villages and small towns. This year's theme, \"A Shared Vision for a Better World: Standards for Sustainable Development Goals\" leaves a cue to bringing first the house in order and then engaging with the wider world.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Beyond observance of the World Standards Day",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/beyond-observance-of-the-world-standards-day-1760628447",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       October 17, 2025 00:00:00  \nGlass-fronted buildings have nowadays become the new norm in cities in Bangladesh. Almost all corporate headquarters, luxury hotels, hospitals, and shopping malls in all big cities, particularly Dhaka, have adopted this new architectural style, as it represents progress and sophistication. But these glass buildings absorb an absurd amount of energy.\nBangladesh already suffers from frequent power outages due to rising electricity demands. These buildings, with their gleaming exteriors, only worsen the situation with demands for even more power. Experts recommend designing these buildings intelligently, as they are currently incompatible with the country's energy situation. It is time for starting use of high reflective glass or photovoltaic glass, as it will make the buildings more energy efficient.\nThe glass facades have become an icon of modernity, creating an international look that appeals to most clients. But in a country like Bangladesh, where the temperature often goes over 35°C, this style of architecture poses a great risk. The glass allows sunlight to enter the building, which raises the indoor temperature, leading to complete dependence on air conditioners. These glass-covered buildings use up to 30-40 per cent more electricity than traditional buildings. The issue is even more apparent in the summer seasons when the energy consumption of the country is at an all-time high with the air conditioning of such buildings accounting for the major portion of it.\nBangladesh has made remarkable progress in generating electricity, exceeding 25,000 megawatts. Yet it is plagued by frequent load shedding, mainly caused by inefficient energy use. Load shedding --- most frequent during heat waves ---affects households, industries and other essential services such as hospitals. On the other hand, Bangladesh's dependence on imported fuel is increasing, affecting the country's goal of reducing the same and replacing it with renewable energy.\nThe integration of high reflective glass in buildings could ease the problem. Coated with metallic oxide layers, high reflective glasses prevent a huge portion of solar radiation from entering the building, reducing air-conditioner usage and electricity consumption by 20 to 40 per cent. Neglecting these advantages, developers opt for cheaper, ordinary float glass. But the difference in initial cost is negligible when compared to the potential reduction of energy cost.\nOn the other hand, photovoltaic glass goes a step further and generates electricity with the solar cells integrated into it. It transforms some of the sunlight into electricity, allowing buildings to compensate for some of their electricity consumption. Besides several western nations, countries like Singapore, Japan, South Korea, Malaysia, and the United Arab Emirates are also using this technology in their skyscrapers. In a country like Bangladesh, where energy demands are higher than the production capacity, integrating high reflective and photovoltaic glass could be revolutionary with buildings turned into vertical power plants. Several obstacles keep this from becoming a reality. Many developers are still unaware of both the energy implications of glass-coated buildings and the improved alternatives to them. Furthermore, the country's building code currently does not require energy efficiency.\nOvercoming these obstacles requires raising awareness and revising the Bangladesh National Building Code. Awareness campaigns have to be conducted to educate both developers, property owners and the general public on the negative impacts of glass-coated buildings and the merits of their alternatives. The National Building Code should include provisions for buildings to be energy efficient while developers and architects should be trained to start incorporating high reflective glass and photovoltaic glass in their designs.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Opting for energy-efficient building glass",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/opting-for-energy-efficient-building-glass-1760628475",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 17, 2025 00:00:00  \n\nAs a riverine country, Bangladesh relies heavily on its waterways for transportation. In many cases, passengers find travelling by launch more comfortable than by bus or train. However, this sense of comfort vanishes into thin air when passengers face a host of irregularities and challenges.\nWhile short-distance trips tend to be relatively hassle-free, passengers travelling longer routes -- such as to Barishal or Bhola -- frequently face serious difficulties. During these long journeys, passengers often have no choice but to buy food from the canteens and shops inside the launches. This is where the problems begin. Most canteens serve unhygienic food, which can lead to illnesses such as diarrhoea, dysentery, typhoid, ulcers, heart disease, and hepatitis. Passengers often fall ill mid-journey, far from medical help, placing them in a dangerous and uncomfortable situation.\nIn addition to the poor quality of food, many onboard shops sell expired products. I personally experienced this. After purchasing a packet of biscuits from a shop on a launch, I discovered in my cabin that it had expired six months earlier. Unfortunately, selling such expired and unsafe food has become commonplace.\nWhen passengers attempt to protest, they often face intimidation from organised syndicates operating within the system. This is deeply troubling, especially considering that the right to food is one of the five fundamental rights of every citizen. Ensuring access to safe food is an essential part of that right. While food is necessary for survival, safe food is even more critical, as health and nutrition go hand in hand. Sustainable living and good health are impossible without access to safe and nutritious food. Unhygienic food remains a major threat to public health.\nIn the light of this alarming reality, I believe it is imperative for the authorities concerned to take sincere and proactive measures. Regular monitoring and enforcement, coupled with responsible behaviour from passengers, are essential steps towards ensuring food safety on launches.\nHasan Mahmud Shuvo\nMBBS student\nInternational Medical College Hospital, Gazipur\nhasanmahamudshovo9005@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ordeals on river routes",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ordeals-on-river-routes-1760628496",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-10-2025"
    }
]