[
    {
        "full_article": "On June 2, India took a turn for the better in its transport electrification journey by offering a concessional import duty of 15% on completely built-up units. This is contingent on the EV manufacturer investing a minimum of about ₹4,150 crore over three years to localise manufacturing in India, with a base domestic value add of 25% in three years, going up to 50% in another two years. The notification, under the Scheme to Promote Manufacturing of Electric Passenger Cars in India (SPMEPCI) announced in March 2024, allows for a maximum import of 8,000 completely built units annually for each manufacturer for five years. The SPMEPCI adds to the bouquet of policies that attempts to boost EV adoption and manufacturing. However, these policies put together fall short of addressing a pressing issue in India’s journey to decarbonise and transform mobility — technology transfer. India began this journey in 2015, about five years later than most large economies. An outlay of ₹895 crore for the Faster Adoption and Manufacturing of (Hybrid &) Electric Vehicles in India (FAME) scheme, for five years, expanded to ₹10,000 crore in 2019. China announced its ambitious New Energy Vehicle subsidy programme in 2009, which, coupled with mandatory joint venture manufacturing of EVs until 2022, enabled technology transfer. In addition, a reduced import duty on EVs (25% in 2010 to 15% in 2018), and cumulative incentives of about $230 billion in the past 15 years — the most by any country — enabled China to achieve the highest global EV adoption rate. This also supported rapid charging infrastructure deployment, making China the largest producer and consumer of EVs.The U.S. began this journey in 2010 with an initial outlay of $25 billion for its Advanced Technology Vehicles Manufacturing Loans Program. This was greatly expanded under the Biden administration’s Inflation Reduction Act. But its EV adoption rate is much lower than China’s. In 2024, out of 17 million global EV car sales, China alone accounted for 11.3 million, followed by Europe with 3.2 million, the U.S. with another 1.5 million, and the rest of the world accounting for the remainder. China’s vertical integration of battery manufacturing, from mining, processing to assembling, has aided economies of scale with competitive pricing of EVs against conventional ICE vehicles. For now, the 25% DVA that India could aim for under the just announced scheme would be repurposing locally made auto components meant for ICE vehicles to EVs and layering it with Software-as-a-service. But to obtain the crucial technology for the heart of the EV — its battery — India must replicate its approach to localising ICE manufacturing, which is to mandate joint ventures with local ICE or EV makers, and gradually allow for a complete open market. Published - June 05, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        Electric vehicles\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        mining",
        "headline_1": "​Falling short: on India’s EV journey",
        "headline_2": "India must ensure technology transfer in the EV segment",
        "link": "https://www.thehindu.com/opinion/editorial/falling-short-on-indias-ev-journey/article69657068.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-06-2025"
    },
    {
        "full_article": "Royal Challengers Bengaluru (RCB) played the Indian Premier League’s (IPL) inaugural game on April 18, 2008. It was a night that, however, belonged to rival Kolkata Knight Riders with Brendon McCullum’s unbeaten 158 putting the match well beyond the host in its backyard at the M. Chinnaswamy Stadium. In the subsequent editions, the franchise with a fiercely loyal fan base, promised much, delivered little and had three runner-up finishes to show. Finally, the ghosts of the past were laid to rest when Rajat Patidar’s men claimed the title with a six-run victory over Punjab Kings in the summit clash at Ahmedabad’s Narendra Modi Stadium on Tuesday night (June 3, 2025). RCB’s triumph in the IPL’s 18th edition was also a tribute to Virat Kohli’s longevity. He has been with the squad since its first game in 2008. In a unit that featured stars such as Rahul Dravid, AB de Villiers, Chris Gayle and Ross Taylor in the past, Kohli has been the forever spine. The young lad has grown into a patriarch, and he has achieved enough and more with the Indian team, both as player and captain, but a missing IPL trophy, always rankled him. Finally that aberration has been corrected and there was no mistaking the relief and joy that coursed through him on a surreal June night.Patidar’s assurance, Kohli’s experience, spinner Krunal Pandya’s choking spells, and Josh Hazlewood’s sharp pace, all combined well while many others dished out cameos to keep RCB in the hunt through the latest IPL. Even if the cup proved elusive, Punjab Kings did remarkably well, especially its captain Shreyas Iyer; he will have a larger role with the Indian ODI team whenever Rohit Sharma and Kohli bid adieu to that format. Among the rest, Mumbai Indians, after a lukewarm start, surged back and found a berth in the play-offs, one that also featured Gujarat Titans. If the IPL was all about RCB’s redemption song and Punjab Kings’ chutzpah, equally, it mirrored the decline of a pedigreed outfit, the Chennai Super Kings (CSK), which finished last. An ageing M.S. Dhoni could not stem the rot and former champion CSK will have to rebuild afresh in the coming editions. Having commenced on March 22, the IPL stretched interminably and a break caused by the Pahalgam terror attack and the resultant Operation Sindoor, forced a change in schedule. The IPL also highlighted talented players such as young Vaibhav Suryavanshi and Sai Sudharsan. As a sporting brand, the league is formidable but, as Kohli said, Tests are five levels above in quality and, hopefully, modern players will respect this reality.\r Published - June 05, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Indian Premier League\n                    \n                            /                      \n                        \n                        cricket\n                    \n                            /                      \n                        \n                        Test  cricket\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025",
        "headline_1": "​At long last: On the IPL, Royal Challengers Bengaluru’s win",
        "headline_2": "Bengaluru finally laid old ghosts and recent memes to rest",
        "link": "https://www.thehindu.com/opinion/editorial/at-long-last-on-the-ipl-royal-challengers-bengaluru-win/article69657022.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-06-2025"
    },
    {
        "full_article": "Great that GOI’s announced Census. But delimitation & caste questions make it more than just stats\nBetter late than never, as they say – GOI’s finally announced a date for census. But this piece of excellent news comes with a big question mark attached to it. Given that the population count has to end by March 2027, will final results be out before 2029 Lok Sabha elections? This is a politically supercharged question.\nIf the population count does come in appreciably before, say, early 2029, a delimitation commission can be set up in this LS term itself. But if, like in the previous census, the final population count takes almost two years to publish, 2027 census results won’t likely come in time for the delimitation exercise to finish before 2029 polls. Therefore, census 2027 is not just a vital statistical exercise for the world’s largest democracy, it will also be keenly watched to see whether it changes the dynamics of electoral politics before the next LS polls. It would be best, therefore, if GOI gives a broad idea of the month/year by which final population count can be expected, as well as its plans on a delimitation commission given those dates.\nFor example, a delimitation commission can start its work before 2029 but GOI may decide to go with existing LS seat structure for the next general elections. That most big states ruled by opposition parties are in the South, which has successfully controlled population growth, and BJP’s political dominance is concentrated in the North and West makes any debate on delimitation fraught. Anything short of clarity will make a polity already characterised by bitter divides even more fractured. India, in a relatively sweet spot economically, simply doesn’t need a hot-blooded political fight, pitting North against South.\nSpeaking of economics, and hopefully assuming the census doesn’t lead to almighty political rows, the exercise will fill several gaps in understanding and governing India. We don’t have any idea of key numbers. What’s the urban-rural divide, in terms of numbers and living standards? How many Indians are poor enough to qualify for govt benefits like free foodgrain? How have consumption patterns changed? What’s the real story on migration? These are just a few of many vital questions the census will answer.\nCaste census? Caste will be enumerated, that’s all we know now. We also know Bihar’s caste census has done little to improve policy and Karnataka’s is mired in controversy. Like delimitation, this is another political red hot potato.\n\n",
        "headline_1": "Finally, sense of us",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/finally-sense-of-us-3/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-06-2025"
    },
    {
        "full_article": "RCB celebrations turned into a tragedy yesterday, but it was an entirely preventable one\nLife is cheap in India, it is commonly said. It feels cruel. It also feels true all too often. How true it is of what happened at M Chinnaswamy Stadium yesterday. Royal Challengers Bengaluru fans had waited 18 years for their team to win the IPL trophy. Their excitement was palpable even to those watching from far cities, Delhi to London. Dream fulfilled, mission accomplished, nirvana…the rejoicing messages were unending. Siddaramaiah to DK Shivakumar to HD Kumaraswamy to Vijayendra Yediyurappa…proud cheers poured in from across the state’s political spectrum. Ee Sala Cup Namde! This year the cup is ours. That massive numbers would pour into any celebratory space was a no-brainer. Then came the stampede. And the deaths.\nOf course these were entirely preventable. Bengaluru traffic police had initially said that the victory parade was cancelled and then said it had made “preparations in case it happens”. If it had indeed done so, the stadium wouldn’t have gotten packed far beyond capacity. Indeed, various authorities could have actioned steps to prevent uncontrollable crowds from approaching the venue. The Bengaluru metro was running overcrowded, for example, issuing frequent warning announcements. Social media was also full of live images and videos that should have initiated safety measures in various control rooms. Every part of govt seemed to have participated in cheering the RCB victory. Which part of it will take responsibility for turning the cheers into tears?\nJust over the past year, we have seen stampedes take lives of Kumbh travellers at the New Delhi railway station, at a Dalit gathering in Hathras, a devotees queue in Tirupati, a Pushpa 2 promotional event in Hyderabad, and the list continues. Because basic crowd management is missing, ordinary activities are always on the edge of a deadly pileup. Govt doesn’t do its job, and citizens pay with their lives.\n\n",
        "headline_1": "Death at a stadium",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/death-at-a-stadium/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-06-2025"
    },
    {
        "full_article": "Street food always comes up Trumps\nIt also gets tarreefs. Wall Street has been unkind to versatile taco by associating it with a guy who’s merely versatile in changing his mind/policies/friends/foes.  Its acronym has been particularly snarky to a President for whom all things Mexican are difficult to swallow.  It’s doubly delish that TACO was dished out by a street called Wall, coined by Financial Times columnist Robert Armstrong. Should I succumb to the temptation of  bringing in the ‘strong arm’ tactics of the present POTUS? Na–chhod do. Letit pass. ‘Trump Always Chickens Out’ has bred a brood of jokes, but the ones laughing all the way to the bank are street-smart dealers who bought when a tariff announcement took a bite out of a stock, and sold when a rescinding made it regain its mojo. Takings have been plumper than a Butterball turkey since Trump has see-sawed 50 times on tariffs since he returned to the menu. So, there’s much Thanksgiving there.                                                                \n‘Good friend Modi’ may not use the TACO jibe about ‘Good friend Donald’, but ‘taycos’ have plenty of takers in Gujju-land. In fact, Taco Bell has Mehtamorphosed to Taco Bhel, stuffed with anything. This has also been the fate of the traditional quintessential Bombay dish. Indeed noun has become verb; it’s been ‘bhel-puried’. Actually all dishes ‘Make-see-kun’ have been  revolutionised, ordered from outlets called Pancho Villa, and polished off in a ‘Zapata’. That’s when the hungry aren’t leaning towards ‘peeza’. \nMasalafied Mexican and Italian have a pan-Indian following but nowhere more than in Ahmedabad. Remember, it was called the experimental theatre of  Hindutva, but I’ve always found it to experimental theatre of food. Anything goes, even ingredients/toppings/fillings that don’t conventionally go with one another. I’ll get sarson da saagified for saying this, but culinary ‘new normal’ was first institutionalised in the khao galis of Amdavad. Like in another context, if others gave you a ‘goli’, they’d give you an ice ‘gola’ – in 22 flavours. The laadiwalas’ of Manek Chowk had innovative pani-puri pani long before fancy fusion chefs started serving it in cutesy containers, and at distinctly uncutesy prices. \nYes, there may be plenty of Ahmedabaddies, but I’m all for streetside Ahmedagoodies.\n                                                ***\nAlec Smart said: “Drones are now the worker bees of the war-hive.”\n\n",
        "headline_1": "Taco Bhel",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/taco-bhel/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-06-2025"
    },
    {
        "full_article": "Subdue without fighting – this Sun Tzu proverb has found terrifying new meaning in our times. As ‘We the people’ risks becoming ‘We the trending’ across democracies, weaponised algorithms are turning citizens into combatants, keyboards into artillery, attention into territory. Read full story on TOI+\n\n",
        "headline_1": "X is not most of us",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/x-is-not-most-of-us/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 05, 2025 00:00:00  \nEid-ul-Azha, the second of the two great festivals of the Muslim Ummah, is primarily a festival of sacrifice. But this festival assumes a unique spiritual significance with the performance of hajj scheduled for the 10th day of the twelfth and final month of Dhu al-Hijja on the Islamic calendar. Hajj performed in Makkah is mandatory for all the devout Muslims who are physically, mentally and financially capable of doing so. Sacrifice of animal is integral to the performance of Hajj. Although the celebration is slated for the 10th day of Dhu al-Hijja, it is carried forward to the following three days. However, the difference of time by a day or two in moon sighting from different locations on the planet, which is the basis of lunar months, actually sets the dates for celebrations of both Eid-ul-Fitr and Eid-ul-Azha. This is what actually explains celebration of the two great festivals on different dates. \nNow, all great festivals are generally marked by mammoth congregations. Hajj is certainly one such congregation. Even the prayer offered to the Almighty Allah brings together thousands and, in some select Eidgahs of Bangladesh, tens of thousands of followers of Islam. If Eid-ul-Fitr is preceded by the practice of a month-long siam or self-abnegation, Eid-ul-Azha transcends this lesson to yet another humanitarian and spiritual cause. The core theme ingrained in these two religious obligations is of course unreserved and total submission to Allah, the benevolent. This sacrificial ritual is incorporated into Islam from the unrivalled example of prophet Ibrahim's willingness to make the supreme sacrifice. At the command of Allah the merciful, Prophet Ibrahim was about to slaughter his son Ismail as a complete surrender to the supreme being's will. It was, however, the ultimate test not only the prophet but also his son were put to by the Almighty. Both came out of the test in flying colours as they responded unhesitatingly to the call of duty to Allah. \nIn today's mundane world, no one is asked to sacrifice his son. Then where does lie the significance of the sacrifice? It is in the purity of mind that remains steadfast against all distractions and seductions. One has to offer to Allah what one holds dearest to his bosom. This also is a lesson in renunciation for the sake of complete surrender to the creator. Through this, man seeks a union with the omnipotent being. To do so one has to come clean on any mundane consideration like prophet Ibrahim and prove total submission to God's will. \nSadly, the spirit is woefully missing now. Most people are more eager for the feast than going by the religious edict. When it comes to sacrifice of animals, some take it as an opportunity for flaunting wealth by way of procuring the prized bull or ox for slaughter. Theirs is no sacrifice and it is not accepted by Allah. Apart from this clear religious message, Eid-ul-Azha's socio-economic implications are also very significant. Through sharing and distributing sacrificial meat with relatives and among the poor, the well-to-do in society can also perform a duty towards society. The money spent on the sacrificial animal also contributes to the economy by way of fostering cattle rearing by poor farmers and developing cattle farms in both rural and peri-urban areas.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Celebrating Eid-ul-Azha in its true spirit",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/celebrating-eid-ul-azha-in-its-true-spirit-1749058176",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       June 05, 2025 00:00:00  \n\nThe proposed budget for the fiscal year 2025-26, amounting to Tk 7.9 trillion, marks a significant shift in Bangladesh's fiscal objectives: moving away from grand development narratives towards pragmatic restraint and people-centric welfare. While rolling out the budget on Monday, Finance Adviser Salehuddin Ahmed conspicuously refrained from announcing ambitious development projects or lofty GDP growth targets. Instead, his focus was squarely on ensuring human development through greater access to public healthcare and quality education, expanding social safety net coverage, and providing fund for innovative entrepreneurs and so on, aimed at building a welfare state in line with the vision of the July Uprising.\nHowever, amid resource constraints and poor revenue collection, the finance adviser had to carefully calibrate a smaller budget, marking the first time a budget proposal has been lower than the previous year's. The proposed outlay is Tk 70 billion less than the current fiscal year's original allocation of Tk 7.97 trillion. While not a drastic cut, the reduction signals an austerity measure in response to a subdued economic outlook marked by high inflation, slack investment growth, liquidity crisis in banks and above all political uncertainty. The government aims to reduce fiscal deficit to around 3.6 per cent of GDP, the lowest level in over a decade, signaling its intent to restore fiscal discipline by reducing budget deficit and boosting domestic revenue collection. The challenge, however, lies in ensuring that this policy of fiscal restraint does not undermine investment in critical sectors such as health, education and job creation.\nMeanwhile, financing this smaller budget will be a daunting challenge unless revenue collection improves significantly. The budget sets a revenue target of Tk 5.64 trillion, equivalent to 9 per cent of the gross domestic product (GDP). Of this amount, Tk 4.99 trillion is expected to be mobilised through the National Board of Revenue (NBR), while the remaining Tk 650 billion is projected to come from non-tax revenue sources.\nHowever, a critical question is how will the government achieve the ambitious revenue collection target of Tk 5.64 trillion? Historically, revenue collection has consistently fallen short of targets, with the highest amount collected being Tk 3.75 trillion in FY23. Given the current slowdown in business activity and investment, along with rising unemployment, experts argue that the government's revenue goal is overly ambitious, and likely unattainable under current conditions.\nIf revenue collection falls short, the budget deficit will widen, which will force the government to increase borrowing from both domestic and foreign sources. The deficit is currently projected at Tk 2.26 trillion, with Tk 1.25 trillion expected from domestic sources and Tk 1.01 trillion from external sources. At this level, the deficit is considered manageable. However, if the shortfall in revenue leads to a higher deficit, the government may be compelled to rely more heavily on commercial bank borrowing, potentially crowding out private investment and pushing up borrowing costs. With treasury bills already offering interest rates of 11-12 per cent, banks are increasingly inclined to invest in government securities rather than lending to private borrowers. So, how will the private sector get adequate access to credit if the government taps deeper into the banking sector? Many suggest the government to take foreign loans at concessional interest rates. However, the country's external debt has already exceeded $100 billion, and the finance adviser has allocated a staggering Tk 1.22 trillion in the budget for interest payments on both domestic and foreign loans. Therefore, reducing government operational expenditure and boosting revenue collection are crucial for achieving sound fiscal management.\nUltimately, it all comes down to how the government will achieve the budget's ambitious revenue growth target of 27.98 per cent for the next fiscal year, especially given its persistent failure to meet revenue targets in the past. Meeting this target will be a significant challenge. However, many argue that the target itself is logical, pointing out that Bangladesh's revenue collection remains far too low relative to the size and growth of its economy. The country's public sector is among the lowest revenue-generating in the world. The country's tax-to-GDP ratio, a key indicator of revenue efficiency, stands at just 7.4 per cent, the lowest not only in South Asia but also among most global economies. In comparison, Nepal and India boast of tax-to-GDP ratios of 23.4 per cent and 20 per cent, respectively. Experts argue that, given the size of Bangladesh's GDP, the tax-to-GDP ratio should be at least 17 per cent. However, this target has remained out of reach due to widespread corruption and inefficiency within the revenue department. In addition, the prevalence of tax evasion remains alarmingly high among the people and businesses.\nIn a recent interview, the Finance Adviser cited a case in which a taxpayer owed Tk 1 billion in taxes but managed to get away with paying only Tk 100 million as tax-allegedly by bribing a tax commissioner with Tk 600 million and pocketing the remaining Tk 300 million. This is not an isolated incident; similar cases are widespread across the country. Retail VAT evasion, along with tax avoidance in the informal businesses and e-commerce sector, also contributes significantly to revenue losses. It is estimated that over 30 million businesses operate in the country, yet fewer than 2 per cent are registered for VAT. Corruption is also rampant in customs operations. According to one estimate, trade mispricings alone cost Bangladesh approximately $8.27 billion annually between 2009 and 2018. These issues underscore the urgent need for procedural reforms, stronger oversight, and greater accountability within the revenue department.\nRecognising these challenges, the government recently took the bold step to dissolve the NBR and create two new entities: the Revenue Policy Division, responsible for tax law formulation and policy, and the Revenue Management Division, tasked with revenue collection and enforcement. This reform aims to enhance accountability, efficiency, and transparency. However, progress in implementing this vital reform measure has been stalled in the face of protests from NBR employees, who have a vested interest in retaining control over both policy formulation and enforcement functions. \nHence, the government's ability to achieve its revenue target depends on implementing the reforms, cracking down on corruption, broadening the tax base and strengthening administrative capacity. Bangladesh's economy stands at a critical crossroads. Success in overcoming revenue challenges will determine not only the country's economic stability but also the realisation of a more equitable and welfare-oriented society.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Achieving the ambitious revenue target",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/achieving-the-ambitious-revenue-target-1749058225",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 05, 2025 00:00:00  \n\nAs Eid-ul-Azha approaches, the rush to buy sacrificial animals has begun across the country. The vibrant scenes of cows, goats, sheep, and camels in the markets reflect the devotion of the Muslim Ummah to follow the Sunnah of Prophet Ibrahim (AS). However, many overlook a crucial aspect of this sacred ritual-proper care of the animal from purchase to slaughter.\nOnce an animal is bought, some owners rush it home, often forcing it to run. This is harmful, especially if the animal is not accustomed to such exertion. Experts suggest that leading the animal gently if the home is nearby, or using a pickup or truck if the distance is long. As animals often lack proper food and water in markets, they should be offered both immediately upon arrival at home.\nThe shelter for the animal should be clean, dry, and free from filth. Regular cleaning of dung and waste is essential to prevent environmental pollution. If feasible, the animal should be bathed daily, especially on the morning of the sacrifice. In urban areas, mosquito nets or coils may be used, but they must be kept safely away from the animals.\nAttention must be given to the animal's diet. An adult cow requires 8-10 kg of green grass, 10-14 kg of hay, and 3-5 kg of granular feed per day. Goats need around 1.5-3 kg of granular feed or 4-5 kg of leafy food. In hot weather, mixing saline in water can help relieve fatigue, though it is advisable not to overfeed the night before the sacrifice.\nDuring slaughter, special care is necessary. The knife should be sharp, and no animal should be slaughtered in front of another, as this causes fear and distress. Skinning must only begin once the animal is completely lifeless to avoid unnecessary suffering. Sacrifice is not a mere ritual-it is an act of devotion aimed at earning the pleasure of Allah. Compassion toward animals is an integral part of this worship.\nA. R. Salauddin Ferdous\nTrishal, Mymensingh\nferdous5803@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Treating sacrificial animals with compassion",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/treating-sacrificial-animals-with-compassion-1749058246",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 05, 2025 00:00:00  \n\nRickshaw pullers in Bangladesh face a daily struggle for survival. Despite their vital contribution to urban transport, especially in congested cities like Dhaka, they remain one of the most neglected segments of our workforce. Low earnings, debt to rickshaw owners, and lack of social protection continue to trap them in cycles of poverty.\nMany rickshaw pullers work more than nine hours a day, often amid curfews and political unrest, just to provide for their families. Their job is physically exhausting and exposes them to numerous risks, including traffic congestion, harassment by passengers and police, and frequent accidents. Yet, they receive little recognition or support from the community at large.\nHealth issues are also widespread among rickshaw pullers. Prolonged exposure to air pollution, dust, and noise contributes to respiratory problems, hearing loss, and musculoskeletal pain. Still, most have no access to proper medical care, health insurance, or social safety nets. Their meagre income often forces them to take loans, trapping them in long-term debt.\nThe informal nature of the rickshaw-pulling sector leaves these workers vulnerable to exploitation and systemic neglect. They lack representation, have limited access to justice, and are rarely consulted in policymaking processes that affect their livelihoods.\nThe government and city corporations must take urgent steps to improve the lives of rickshaw pullers. This includes legal recognition, fair licensing systems, access to microfinance, and basic healthcare. \nMd Tousif Raihan\nDepartment of Criminology and Police Science\nUniversity of Chittagong\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Rickshaw pullers deserve better",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/rickshaw-pullers-deserve-better-1749058263",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-06-2025"
    }
]