[
    {
        "full_article": "The Reserve Bank of India’s (RBI) Monetary Policy Committee was sensible to pause its rate cuts, as announced on Wednesday (August 6, 2025). RBI Governor Sanjay Malhotra rightly pointed out that the uncertainties surrounding tariffs are still evolving, and that the 100 bps of rate cuts implemented since February 2025 are still percolating through the system. Mr. Malhotra’s statement was made before U.S. President Donald Trump approved an additional 25% tariff on imports from India, over and above the existing 25% reciprocal tariffs. However, his assessment that the matter is far from over was nevertheless accurate. India is still in the process of negotiating a Bilateral Trade Agreement with the U.S., and the final tariffs are far from decided. In the meantime, Mr. Trump has already indicated that similar additional tariffs — “penalties” for buying oil from Russia — may be imposed on other countries as well, which will impact India’s comparative advantage. Leaving room for another rate cut later in the year when things might be clearer, thus, was the sensible thing to do. The other broad reason why the pause makes sense is that it allows the RBI to see whether such monetary measures are working. A 100 bps cumulative cut in rates over the last six months is significant, and the banking system needs time to pass that on to borrowers. The Governor also pointed out that there is ample liquidity in the system, which means the banks have the money to lend.The question, however, is whether there is enough growth-related borrowing happening. RBI data show that, as of end-June, loans to purchase consumer durables had contracted about 3% compared to the previous year. Growth in housing loans slowed sharply to 9.6% from 36% a year earlier, while vehicle loans too slowed by five percentage points over the last year. In line with this subdued demand outlook, companies too seem to be slowing their borrowing. Loans to industry grew 5.5% in June 2025, down from 8.1% in June last year. Simply reducing rates, therefore, is not enough and that is something the Governor alluded to when he said stronger policy frameworks “across domains, and not just limited to monetary policy”, would be pivotal in achieving India’s growth potential. The government has to intervene in a more focused manner than just increasing capital expenditure across the board. A lot can be done through tax. The Goods and Services Tax rate rationalisation, that was promised several times, is long overdue. A reduction in fuel prices in line with lower oil prices, too, will lift consumer sentiment. The RBI can, for the moment, afford to wait things out. The government does not have this luxury. Published - August 08, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        interest rate\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        imports\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        trade agreements\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        vehicle loans\n                    \n                            /                      \n                        \n                        loans\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        housing loans",
        "headline_1": "​Time for action: On the RBI pausing rate cuts",
        "headline_2": "The Reserve Bank of India did well to pause rate cuts amid the uncertainties",
        "link": "https://www.thehindu.com/opinion/editorial/time-for-action-on-the-rbi-pausing-rate-cuts/article69905834.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "08-08-2025"
    },
    {
        "full_article": "The state visit of Philippines President Ferdinand Marcos Jr. to India that ends on Friday (August 8, 2025), and his meetings with Prime Minister Narendra Modi provided a hard power edge to the two countries, with historical-cultural ties between them, by signing a Strategic Partnership Agreement. On his first visit to India since taking office in 2022, Mr. Marcos has taken a strong position against Chinese incursions in the West Philippine Sea, and has been keen to engage India more closely. Coinciding with his visit, the Indian Navy held its first joint maritime exercises with the Philippine Navy in the South China Sea area. The drills were criticised by China. India has consistently supported the 2016 UNCLOS tribunal arbitration award in favour of the Philippines, calling on China to respect the multilateral order in the Indo-Pacific, and Mr. Marcos appreciated this. Moreover, while India has signed dozens of such Partnership Agreements worldwide, for the Philippines, India is only its fifth Strategic Partner — after Japan, Vietnam, Australia, and South Korea. The Philippines is also the first export destination for the BrahMos missile, and Mr. Marcos is understood to have expressed interest in buying more Indian military hardware. The two sides signed agreements to enhance strategic cooperation, including an exchange of Terms of Reference for all three services and the Coast Guard. They also agreed to free up visas and begin direct flights. There is no substantial bilateral trade at present — $3.3 billion in 2024-25 — but investments are growing as technology and pharma companies have tied up in many areas.The Marcos-Modi meetings sent out a more comprehensive message for India’s ties with South East Asia. The Philippines is the incoming chair for ASEAN in 2026, and the coordinator for the ASEAN-India comprehensive strategic partnership. The invitation to Mr. Marcos was also a way of easing relations that have been riled by Commerce Minister Piyush Goyal’s unnecessarily abrasive remarks in June, where he called many ASEAN countries the “B-team of China”, and mocked the 2009 ASEAN-India Trade in Goods Agreement (AITIGA). The government has since moved to fast-track talks to revise the AITIGA, with talks in Delhi next week. India and the Philippines have separately discussed launching talks for a Preferential Trade Agreement (PTA), indicating India’s intention to keep negotiating for a more liberalised trade regime globally even as it faces the brunt of the U.S.’s tariffs and penalties. The visit is a reminder that India’s interest in peace and security in the Indo-Pacific is not restricted to the Quad grouping, and that it is mindful of strengthening ties with all the countries in the region, especially as it essays the current geopolitical turbulence with bigger global powers.\r Published - August 08, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Philippines\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        history and culture\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        armed Forces\n                    \n                            /                      \n                        \n                        oceans\n                    \n                            /                      \n                        \n                        defence\n                    \n                            /                      \n                        \n                        tourism\n                    \n                            /                      \n                        \n                        air transport\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        ASEAN\n                    \n                            /                      \n                        \n                        trade agreements\n                    \n                            /                      \n                        \n                        international relations\n                    \n                            /                      \n                        \n                        pharmaceutical\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        Japan\n                    \n                            /                      \n                        \n                        USA",
        "headline_1": "​Mending ties: On state visit of Philippines President to India",
        "headline_2": "India and the Philippines are showing intent in improving relations",
        "link": "https://www.thehindu.com/opinion/editorial/mending-ties-on-state-visit-of-philippines-president-to-india/article69906347.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "08-08-2025"
    },
    {
        "full_article": "From childhood we are taught that what we dislike is good for us, and what we like is bad\nFor years I’ve been using homoeopathic eyedrops in the fond hope that the medication will keep cataracts at bay.\nAllopathy dismisses the eyedrops, as it does all homoeopathy, as a mere placebo that has no benefit apart from providing a feel-good factor.\nThe eyedrops come in two formulations, one which contains alcohol and one without. I use the one with alcohol, in preference to the non-alcohol variety, because when applied the alcohol eyedrops induce a stinging sensation which the non-alcohol version doesn’t.\nWouldn’t it make for comfort, not to mention common sense, to use the non-alcohol, non-stinging drops, which don’t hurt? It would make for both. But in this case, as in so many others, comfort and common sense are overruled by the uncommon sense that is drilled into us from our childhood years: that the more bitter-tasting the medicine, the more good it will do us by way of effecting a cure.\nThis bad-equals-good equation applies not just to medical products, but to almost all things. At school we were told that learning boring things, like multiplication tables, all the way up to 16 times 12 is 192, and mugging up history dates like when the three battles of Panipat were fought, were good for building up our mental muscles.\nGrowing up, we are told that all the things that taste nice and which we like to eat, like samosas and jalebis and pizzas and burgers are bad for us, and will give us high cholesterol, and triglycerides, and BP. And all the things that taste bad, like karelas and boiled lauki, are good for us and make us kick serious ass where all that nasty cholesterol and BP are concerned.\nCall it the puritanical ethic of asceticism, or the stern voice of duty, or military school discipline, or the gym instructors’ injunction that there’s no gain without pain, we are programmed to believe that hard is better than easy, tough better than soft.\nAnd that’s no stinging eyewash.\n\n",
        "headline_1": "Bitter medicine",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/bitter-medicine-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-08-2025"
    },
    {
        "full_article": "Trump sold America the dream of greatness built on tariffs, but the math doesn’t add up\nAfter threats and extensions, Trump’s enforced his “reciprocal” tariffs. It’s an economic experiment that will bleed foreign sellers and US buyers before it’s over, but for Trump it’s the foundation for rebuilding American greatness. While campaigning on the ‘America First’ plank last year, he claimed, “This new American industrialism will create millions and millions of jobs.” Will it though? Trump’s 2018 tariffs against China “neither raised nor lowered US employment in newly-protected sectors,” analysts said last year. However, China’s retaliatory tariffs had “clear negative employment impacts” thereafter. It’s easy to see why. Tariffs are all about beating rival products with a price disadvantage. But no matter how hard Trump tries, making things cheaply in America is difficult.\nUS federal minimum wage is $7.25 per hour, and most states mandate much more. So, 40 hours’ work per week, for four weeks, earns at least $1,160. In California and New York, the minimum shoots up to $2,640, but it’s not enough to make ends meet. At California’s living wage of $28.7 per hour, you need almost $5,000 per month. But the minimum wage in Shanghai is only $374 per month. It’s $277 in Delhi for graduate workers, and $189 in Vietnam. How do you bring back low-tech jobs like stitching jeans and making shoes from a $200 per month factory ecosystem to one where $2,000 doesn’t suffice? Especially when the $200 ecosystem has built up the advantage of scale.\nApple CEO Tim Cook announced on Wednesday that every iPhone and Apple Watch sold anywhere in the world will now use glass made by Corning in Kentucky. But Corning has 21 plants in China to cater to the other 81% of mobile phones worldwide, plus tablets and other devices. That’s why China’s price advantage on everything from solar panels to lithium batteries and cars – due to scale – is hard to beat.\nTrump is thrilled by growing tariff revenue and vague investment promises from companies and countries – Japan’s $550bn, Korea’s $350bn – but costly goods, especially non-discretionary categories like medicines, are going to bite US customers. Inflation is already inching up in US, and if India stops buying Russian oil – as Trump wants – the resultant inflationary pressure could be severe. In this scenario, a Trump-Putin meeting that ends the Ukraine war and lifts sanctions on Russia will be in everyone’s interest, India especially. But Trump’s want of tact and Putin’s guile mean we’ll be waiting with fingers crossed.\n\n",
        "headline_1": "MAGAMATICS",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/magamatics/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-08-2025"
    },
    {
        "full_article": "SC right on Matheran’s hand-pulled rickshaws. But the how part of the change looks tricky\nHow many mountains might need to be climbed before Matheran’s 94 rickshaw pullers can be transitioned into running their own electric rickshaws? Supreme Court has given Maharashtra six months to completely remove these rickshaws from India’s lowest hill station, a mostly tribal eco-sensitive zone since 2003 and a getaway for Mumbai residents. SC did well to emphasise that “stressed economic compulsion could not justify degrading labour” – unlike the touristy view of these being a ‘quaint throwback’. Hand-pulled rickshaws and horses are Matheran’s only conveyance. Authorities also find it a challenge to dispose of the daily tonne of horse dung produced – tiny Matheran is also overrun with 460 horses and 200 ponies catering to tourists way beyond its carrying capacity. E-rickshaws successfully run here already, started years ago as a pilot. They’re cheaper than hand-pulled carts or horses, and are a boon for locals.\nIt sounds like child’s play to remove these rickshaws. Yet, there will be challenges. At the most basic level, the question of who will fund the purchase of battery-operated ricks for these 94-odd workers? Will authorities treat them as marginalised ‘victims’ or as gig workers? They should not become victims to an owner-hirer system of e-ricks that will only escalate pullers’ exploitation. It must be ensured licences do not go to middlemen or tour operators. As SC noted, in Azad Rickshaw Pullers Union vs State of Punjab (1980) it had devised an interest-free bank loan scheme for cycle rickshaw pullers. But where are the banks that would, without hesitation, extend loans to hand-rickshaw pullers? SC has said it will brook no govt argument on paucity of funds. On paper, even an end to manual scavenging sounds easy. On ground, rehabilitation from degrading work into new livelihoods has been every govt’s worst failure. SC must keep a bird’s eye view on Matheran.\n\n",
        "headline_1": "Wheels Within Wheels",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/wheels-within-wheels-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-08-2025"
    },
    {
        "full_article": "Consider three seemingly unrelated developments. “You can’t hire Indians, set up factories in China and park profits in Ireland,” Trump said to US big-tech in mid-July, following this by imposing a 25% effective tariff rate on Indian exports to US, followed up with a further 25% on account of India’s Russian oil trade.\n\nMicrosoft briefly stopped providing services to Nayara Energy, a Russian-owned oil refiner in India. India’s flagship fighter programme, LCA, is further delayed as supplies of engines from GE are held up.\nRead full story on TOI+\n\n",
        "headline_1": "In a hostile new world, can our govt save us?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/in-a-hostile-new-world-can-our-govt-save-us/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-08-2025"
    },
    {
        "full_article": "Condemn Sheikh Hasina's rule of over 15 years as much as you want, as there is enough fact-based evidence to do so. (See our recent investigative stories, including the one published on Thursday, August 7). But don't denigrate our freedom struggle, our greatest source of pride, the moment when our people made the biggest sacrifice ever. Our Muktijuddho is indelibly etched in our hearts, minds, and consciousness. True history will never permit its denigration, although contrived history may. But that \"history\" will never stand the test of time. That is the lesson of history.\nWasn't the July Declaration meant to chalk out our future on the basis of the values that the uprising represented? Wasn't it supposed to provide a roadmap of how Bangladesh will achieve the goals that the past oppressive regime prevented?\nInstead, we have another example of rewriting history.\nWhatever may be the stance of independent political parties, the interim government's position must have some authentic base. What Prof Yunus read out as the chief adviser—and which is being proposed for incorporation into our constitution—is but an instance of a \"cherry-picked\" version of our past.\nIn the July Declaration, we have a two-paragraph version of our freedom struggle that gave us an independent country. The two paras include a reference to colonial rule and 23 years of \"authoritarian Pakistani regime.\" We \"established the state of Bangladesh through a bloody Liberation War following the Declaration of Independence on March 26, 1971.\" The following para says \"… the people of Bangladesh made the utmost sacrifice through a long struggle to materialise a liberal democratic state … based on equality, human dignity, and social justice…\"\nThat was the depiction of our 23 years of struggle against Pakistan's military and brutal rule.\nThere is no mention in the declaration of our Language Movement and the first killing of students in the newly formed Pakistan and the birth of \"Ekushey February.\" There is no reference to the historic election of 1970 that gave our political leadership—represented at that time by the Awami League (AL)—the legitimacy to speak on behalf of the people. It was because the leaders were elected that the then political leadership could \"declare\" independence when the Pakistan Army attacked us in the most brutal and barbaric manner. The election was most crucial for us to form the \"government in exile\" and gain international support, without which we could not have carried on with our independence war.\nIn addition, it is shameful that Prof Yunus, as head of the government, read out a document that did not mention \"genocide\" committed by the Pakistan army that started with unparalleled brutality on the night of March 25, 1971. There may be some controversy about the figure of three million people killed, but there is no doubt that hundreds of thousands of innocent men, women and children were indiscriminately killed just because they were Bangalees, citizens of East Pakistan.\nThere were 10 million refugees—the UNHCR called it the \"largest single displacement of refugees in the second half of the century\"—who took shelter in India, where they received food and medicine for the nine months of the war. (We later had many issues with India, especially on sharing water and many others, but their role in support of our struggle for independence will remain a part of history.) Millions more were displaced internally, pushing families into economic distress and leading to widespread disease and death.\nThe declaration also does not mention Mukti Bahini, who are heroes of the most glorious phase of our history. Dhaka University, which is the centre of the July Uprising, was also the centre of the creation and propagation of the Mukti Bahini at that time.\nWhat about the indiscriminate rape of our women by the Pakistani army? Ethnic cleansing was a part of state policy of Pakistan during those crucial nine months. A recent book titled The Vortex: A True Story of History's Deadliest Storm, an Unspeakable War, and Liberation—by Scott Carney and Jason Miklian—adds invaluable evidence to the already established ones.\nIn 1971, Prof Yunus himself was an active member of an expatriate group in the US who, along with others, did invaluable work to propagate the legal and moral justification of our Liberation War. He met US senators, political leaders from both the Republican and Democratic party, and wrote pamphlets and media articles depicting our struggle. What did he say to those American leaders at that time? Wasn't \"genocide\" a part of his story? Is he disassociating himself from his own laudable role in 1971? If not, then why isn't it a part of the document he read out?\nIt is perhaps redundant to note that the man who led and inspired us throughout our nine months of struggle for freedom never found a mention—Bangabandhu Sheikh Mujibur Rahman.\nThe July Declaration, which is supposed to outline the \"New Bangladesh,\" has only few paras, out of 28, that make some references to the future, and that too in the most vague and generalised terms like \"ensure good governance,\" \"free fair election,\" \"rule of law,\" \"economic and social justice.\" There is one para—26—about the environment \"… protect rights of the present and future generations through an environment friendly, climate resilient, sustainable and inclusive development strategy…\"\nThere is no mention of future direction in education, employment generation, poverty alleviation, health for the poor, etc. There is no focus on the downtrodden and the poor. Again, there is nothing—not surprisingly though—for women. They constitute 50 percent of our population and there is not even a mention about their plight.\nWhat stunned us is the absence of any special focus on the youth in the document. It is the youth who gave us an opportunity to build a new Bangladesh. In several conferences, Prof Yunus eulogised the role of the youth and pinpointed their importance in building a future not only of Bangladesh but of the whole world.\nIn para 9 of the July Declaration, Sheikh Hasina's regime is called \"anti-people, autocratic, against human rights that turned Bangladesh into a fascist, mafia and failed state and thereby tarnished Bangladesh's image.\" There is enough ground to accept all the charges, but was Bangladesh a \"failed state?\" Forget everything else, are we not graduating from LDC to a middle-income country status? Didn't this government itself refuse to postpone the \"graduation\" time, as requested by the business community, as we are ready? Is this possible graduation a sign of a \"failed state?\" Are we not \"tarnishing\" Bangladesh's image now?\nIt is our view that once again, we are spending too much time and energy in reference to the past. The real need of the hour is a roadmap for the future, focusing on that crucial promise of the July Uprising. While the detailed programme for the future may come out in the \"July Charter,\" the \"dream of the July revolution\" must be incorporated in the \"Declaration.\"\nWhatever our emotions may dictate, our future, in a most competitive world of the 21st century, must be based on quality education, work ethics, efficiency, productivity, science, and AI-related planning and investing our meagre resources in producing a highly skilled human resource. We are great at envisioning but very weak in realising that vision. Implementation of projects in a cost-effective manner has been eluding us from our very inception. After nearly half a century of independence, our education system remains one of waste, low quality and inefficiency.\nMany scholars, both national and international, ask the question, \"Why are you guys so obsessed with the past? Why can't you let historians work on that while the rest of you work to build the future?\" Repeated observations from scholars of varied backgrounds stuck in my mind and forced me to ponder that question. Then, it dawned on me that not only are we obsessed with the past, but we also think nothing of distorting it. We love to suit it to our own political and ideological perspective, whatever may be the cost in terms of credibility, authenticity and building trust. Even when we repeatedly see that \"contrived history\" falls with the fall of regimes, we have no qualms in blatantly replacing facts with our own fancied version of it. Much of our intellectual community, who toed the lines of this group or the other, are guilty of it.\nWe have suffered enough at the hands of \"tailor-made\" history. The time has come to learn from that mistake and not repeat it. We remember how, with regime changes, school textbooks changed too; how recognised and highly respected authors got dropped because of a particular regime's likes and dislikes. Because we tinker with the past, we are unable to build a future of stability and trust. This time, we should not make that mistake again. In a relentlessly evolving, AI-dominated world, we may not get another chance.\nMahfuz Anam is the editor and publisher of The Daily Star.\n\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our submission guidelines.\n \n",
        "headline_1": "July Declaration: Where is the roadmap for our future journey?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/the-third-view/news/july-declaration-where-the-roadmap-our-future-journey-3958026",
        "news_paper_name": "The Daily Star",
        "publish_date": "08-08-2025"
    },
    {
        "full_article": "In April 2025, when the USS William P Lawrence, a US Navy warship, sailed through the Taiwan Strait, China dispatched its navy and air force to monitor the ship closely, which served more as a warning. Meanwhile, Russia has been conducting military drills with Belarus as NATO fortifies its eastern flank following the accession of Finland and Sweden. We have not forgotten Operation Rising Lion yet, and the cost of it. These events show a clear pattern: in 2025, countries compete more than they cooperate.\nThe idea of rules and shared values guiding the world has always been present, but today's global affairs are mostly driven by realism. Realism is the idea that countries mainly seek power, safety, and their self-interest. Realism is not just an old Cold War idea; it helps explain the ongoing competition, distrust, and careful actions that shape world events in 2025. As new powers rise and alliances become stronger, realism is a crucial way to understand how international relations are developing.\nRealists explain the tension between Russia and NATO as a security dilemma. This simply means that when one country tries to become more powerful, it provokes insecurity in another. Hence, this leads to a cycle of increasing fear and military build-up. Since Finland and Sweden joined NATO in 2023 and 2024, Russia has not only increased its military presence near its western borders, but it has also held more military exercises with Belarus and built closer ties with China. To the West, these actions are aggressive; realism sees Russia's actions as strategic countermeasures within a zero-sum environment.\nRussia sees NATO's growth as a threat to its traditional area of influence and its security. Conversely, NATO's troop deployments and military investments respond to perceived Russian aggression. In realism, neither side fully trusts the other, because both have the power to harm the other, even if they make promises not to. This leads to an unstable situation where peace is fragile and power is always being balanced.\nThe rivalry between the US and China is the biggest power struggle in today's world. In 2025, military tensions in the South China Sea remain high. Both countries frequently send ships and planes to show their power. This extends beyond the military, as countries compete in artificial intelligence, space technology, and computer chips. Both sides are committed to preventing the other from gaining an edge.\nAccording to power transition theory, a realist framework, when a rising power (like China) tries to catch up to a leading power (like the US), conflict or strong competition is almost unavoidable. Though economic interdependence or international institutions may help calm things a little, they don't eliminate the basic struggle for power. Hence, the US-China relationship in 2025 can be best seen as a deliberate power contest driven by survival instinct in an anarchic global system with no central authority to control the world.\nThough the climate crisis is a unifying global challenge, it is still affected by realist dynamics. The US-China climate talks have stalled as tensions rose over Taiwan and technology restrictions. Both countries accuse each other of using climate issues for political gain. At the same time, developing countries complain that they are not receiving the $100 billion in climate finance promised by rich countries to help them fight climate change. In Europe, concerns over energy security after the Russia-Ukraine war have led countries like Hungary, Italy, Germany, and Poland to delay plans to phase out fossil fuels. Efforts to create fair international climate rules or carbon taxes have also stalled because countries fear such measures might hurt their economies. In April, China restricted exports of heavy rare earths, which are essential for making products like electric cars and wind turbines. These complex dynamics show how climate change is now part of global power competition.\nRealism reminds us that in a world without a global governing authority, states prioritise survival and strategic advantage, even in addressing global threats. Climate change thus becomes a new arena of geopolitical competition.\nMiddle Eastern diplomacy in 2025 clearly shows how realism works in global politics. The region's geopolitics are not based on shared values but grounded in common interest. For example, the Abraham Accords have expanded, and Saudi Arabia is carefully balancing its ties with both the US and China. These moves are mostly about protecting themselves from threats, especially Iran's growing power in the region. Saudi Arabia is buying weapons from the US, Canada, Spain, and other European countries and many of these are being used to bomb Iranian-backed Houthis in Yemen. It is a huge humanitarian crisis because the bombings are killing not only the Houthis but also innocent civilians. Yet, Saudi Arabia faces no obstacles in buying weapons because, from a realist perspective, the countries selling them are benefitting financially. What value do humanitarian considerations hold here?\nThe tensions between Israel, Iran, and the US also reflect this power struggle. Iran continues to develop its nuclear programme and supports armed groups in other countries. This has made Israel feel threatened, and the US, losing its strong grip in the Middle East, has taken both public and covert steps to defend its allies. The result was Israel launching Operation Rising Lion; Iran responded with Operation True Promise 3. The US, out of nowhere, launched Operation Midnight Hammer. The world was introduced to some fancy military operation names, but the cost was the injury and death of thousands of civilians, many of whom had absolutely nothing to do with any of it. Iran's threat to block the Strait of Hormuz, raising concerns over global energy security, helped in stopping the war.\nThe US remains deeply invested in the region to deter Iran's expansion while maintaining complex ties with Gulf allies. This triangle is driven less by ideology and more by calculations of security, survival, and regional dominance.\nIran's deepening partnerships with Russia and China are strategies to avoid isolation and gain leverage in a multipolar order. This explains the self-help system of the realist worldview, where survival depends on forming temporary coalitions as an outcome of cost-benefit calculations. In the Middle East, despite years of rhetoric about democracy, the superpowers seem to be using the region as a stage for security and power plays.\nThe idea that global organisations like the United Nations (UN) and the World Trade Organization (WTO) can help countries work together is, of course, a liberal idea. Hence, there is reason to wonder why these organisations frequently fail. From the realist perspective, their failure is inevitable. These global organisations do not have real power on their own; they rely on strong countries to support them. But when national interest comes first, cooperation becomes weak and easily breaks down, especially when powerful countries are competing.\nIf the current trend teaches us anything, it is that global politics are largely driven by power and national interest, where democracy, humanitarian crises, and human rights are often nothing more than convenient terms and an eyewash. This doesn't mean countries can't work together or care about any values, but to really understand what's going on, we have to look at how countries perceive threats and try to stay safe.\nRealism doesn't offer false hope, but it helps us see the world as it really is. In the uncertain and tense world of 2025, that honest view might be the best guide we have.\nMd Sohrab Hossen is senior officer of Inquiry at BRAC. He can be reached at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Realism isn’t dead in global politics, it just isn’t tweetable",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/realism-isnt-dead-global-politics-it-just-isnt-tweetable-3957746",
        "news_paper_name": "The Daily Star",
        "publish_date": "08-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 08, 2025 00:00:00  \nDespite repeated calls from businesses and think tanks to enhance the NBR's revenue mobilisation efforts in a systemic manner, shortfalls in collection have become a recurring issue. A report by The Financial Express, citing official sources, reveals that the NBR must collect nearly 35 per cent more revenue in FY26 than in FY25 to meet its ambitious target. The income tax wing alone is tasked with a 43 per cent increase, reflecting the pressure across all three revenue wings. The targets set for FY26 are: income tax-- 42.63 per cent higher than FY25; value added tax (VAT)-- 30.49 per cent higher, and customs duty-29 per cent higher. To meet the total revenue goal of Tk 4.99 trillion, the NBR needs to increase collections by approximately 35 per cent, compared to Tk 3.70 trillion collected in FY25. Many observers argue that the persistent revenue shortfall is partly due to unrealistically high targets, which are often set without adequately assessing the prevailing economic conditions. Businesses continue to struggle with rising production costs, reduced profitability, and uncertainty, all of which constrain their ability to pay higher taxes. Economists have voiced concerns that such inflated targets may lead to aggressive tax collection measures, placing undue burden on taxpayers. They also point out that the current economic environment does not support such high expectations for tax and duty revenues.\nIn FY25, overall revenue growth was a mere 2.23 per cent-one of the lowest in NBR's history-amid months of political instability. In the final month (June), collections fell 37.6 per cent short of the monthly target, and registered a 19 per cent year-on-year decline. According to NBR officials, this shortfall stemmed from internal disruptions, poor execution of the Annual Development Programme (ADP), weak private investment, and a sluggish business environment, following the July uprising last year. Furthermore, VAT collection saw an abrupt decline, causing revenue growth to fall below 9 per cent year-on-year in May, the lowest in 12 months. Despite these setbacks, the overall growth in revenue collection stood at about 15 per cent, which is still far below what is required to meet the FY26 target. On the customs side, imports rose by 1.4 per cent over the past 11 months compared to the same period last year, while customs duty realisation grew by 13 per cent.\nA critical question arises: will the revenue shortfall severely impact development spending? In response, Finance Adviser Dr. Salehuddin Ahmed noted that the FY26 budget has been framed conservatively, with reduced expenditure plans to account for potential shortfalls. According to Ministry of Finance data, public spending may decline to 12.7 per cent of GDP, and the development budget has been set at the lowest level in four years.\nGiven the circumstances, the government must proceed with prudence and fiscal discipline, ensuring that even with reduced allocations, development priorities are met, and austerity is maintained across governance.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "NBR revenue targets and ground realities",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/nbr-revenue-targets-and-ground-realities-1754583837",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Tashfin Chowdhury   |  \n       August 08, 2025 00:00:00  \n\nAs Artificial Intelligence-based software and tools continue to take over many aspects of professional and personal lives, concerns have been raised by AI experts as well as authorities in various advanced countries regarding the ethical usage of AI. A niche area within this broad subject is media manipulation-specifically, the manipulation of images, videos, audio clips etc. Unscrupulous individuals with knowledge of AI tools develop and spread doctored or fabricated materials through social media platforms and other forums.\nAs AI continues to progress at a rapid pace, these techniques are also evolving. It is imperative for relevant government departments to understand the tools and mechanisms at play so that they can be brought under the purview of cybersecurity laws and effective steps can be taken against perpetrators.\nAI-GENERATED IMAGES: Around the end of last year, some photos of a popular Bangladeshi film actor went viral on social media platforms. Some users shared the content without thinking much. Soon, she had to declare that the photos were AI-generated. Someone had taken her photos and used AI to create new images. As a result, the photos showed her scantily clad on a rooftop.\nThis can be done quite easily using at least four or five different tools, including Midjourney and DALL-E. These can be used to add, remove, or change elements in an actual photo. Photoshop's Generative Fill also uses AI to edit existing photos.\nAs a result, it becomes difficult for anyone seeing such images online to tell whether they are real or doctored. This leads to the spread of misinformation, causing panic and resulting in financial and emotional disruptions.\nEarlier this week, AI-generated images of wildfires in British Columbia caused panic among local communities in Canada. The B.C. Wildfire Service quickly urged concerned families and individuals to download their app, sign up for alerts, and trust only credible media sources.\nDEEPFAKES: One of the most baffling stories of deepfake deception is that of internet sensation Babydoll Archi from India. At one point this year, Archi's Instagram account had over 1.4 million followers.\nThe reason behind her popularity was quite obvious. The account posted videos and images of Archi. In one video, she was dancing to a popular song; in another, she appeared to be standing with an American porn star. This led to rumours that Archi might be joining the American porn industry.\nIn reality, Archi never existed. Her likeness was created using AI, based on images of a homemaker from Assam. This woman's ex-boyfriend, Pratim Bora, used her images after they had broken up in 2020.\nBora, an artificial intelligence enthusiast, created the Babydoll Archi profile. The first uploads to the account were made in 2021, with more content posted in 2023 and onwards.\nInitially, the victim's family was unaware. Later, after they found out, her brother filed a complaint with the police, who arrested Bora. Senior police officer Sizal Agarwal told the BBC last month that Bora used tools such as ChatGPT and Dzine to create an AI version of Babydoll Archi. He then populated the handle with deepfake photos and videos. Though the account started picking up likes last year, it began gaining traction from April this year, Agarwal added.\nFor deepfake videos, AI models-especially deep learning techniques like Generative Adversarial Networks (GANs)-are trained on numerous images or videos of a person. The AI learns how their face moves and sounds, which can then be overlaid onto another video.\nBesides being used to exact revenge on ex-girlfriends and boyfriends, deepfakes have recently been used in many countries ahead of elections to confuse voters and sway public opinion.\nFACE SWAPPING: You've probably come across videos of influencers enacting popular or funny lines from politicians, actors etc., on their social media platforms. Their faces look almost like the person they're imitating in those videos. This feature is available on TikTok and Snapchat as filters. AI maps facial features and blends them seamlessly. Though influencers use this to entertain followers, the same technology can easily be used to vilify a person and falsely blame them for something they haven't said or done.\nJust this year, a scammer used live face-swapping technology during video calls with an older woman. The scammer impersonated a younger, attractive man and tricked the woman into a romantic relationship.\nIn China, a businessman was tricked into transferring over 4.3 million yuan (approx. $622,000) during a video call with someone he thought was his associate. The associate's face had been swapped by scammers using facial landmark detection and lip-syncing to make the fake face look natural during the Zoom call. The victim only realised the fraud after the real associate informed him that no such conversation had taken place.\nVOICE CLONING / AI VOICE SYNTHESIS: Recently, there have been cases of businessmen receiving phone calls from supposed politicians, senior police officials, and others demanding money. Their voices sound exactly like the real person-even the mannerisms are the same.\nAI models are trained on audio recordings of a person's voice. Once trained, the model can generate speech in that voice from any text. It's that simple for tech-savvy scammers and criminals to make money these days!\nTEXT-TO-IMAGE AND SYNTHETIC MEDIA: You may have come across videos on Facebook where a news reporter is reporting from an unknown location about potholes on Dhaka's streets, and in the background, a motorcycle rider speeds toward a pothole and drowns in the water.\nSuch videos or images can be generated from written descriptions.\nSynthetic media is slightly more advanced. AI enthusiasts can combine their knowledge of voice cloning, deepfakes, and AI-generated images to make a whole situation look believable.\nThere have been numerous incidents in recent times. One that comes to mind is the audio clip of British Prime Minister Keir Starmer being verbally abusive to his staff. The clip was viewed over 1.5 million times in 2023 and is suspected to have been generated using synthetic media for political manipulation.\nSOCKPUPPETS: 'Sockpuppets' are fake online identities created by AI and used for various illegal gains. For example, it is widely believed that during the 2016 US election, thousands of sockpuppet accounts were created online. These accounts, posing as Americans, spread divisive content to influence voters.\nOur government departments need to catch up with such AI tools and how fast they are evolving. Besides amending existing cybersecurity laws, Bangladesh could take lessons from advanced countries that are trying to regulate AI usage. For instance, Denmark has proposed new deepfake legislation as part of its digital copyright law. It aims to protect individuals' rights from the impact of AI-generated deepfakes, including both deepfakes of artists' performances and the characteristics of natural persons. Though the proposed amendment to the Copyright Act is likely to affect enterprises' use of the technology, it will also offer protection against misuse.\nSyed Tashfin Chowdhury is a communications professional. \ntashfinster@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "When seeing is not believing",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/when-seeing-is-not-believing-1754584023",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       August 08, 2025 00:00:00  \n\nA disturbing piece of news recently went viral on social media - the hanging and beating to death of a dog in Barisal. Several youths killed the poor creature on camera like it was nothing. The main culprit faced a lenient punishment - Tk. 5,000 fine - awarded by an executive magistrate while three others involved in the cold-blooded murder got off scot-free.\nIt was no isolated incident of cruelty to animals; we often come across such news despite the fact that cases of cruelties against animal are underreported in Bangladesh. In 2024, a horrifying cruelty struck Dhaka's Japan Garden City where 10 stray dogs and a cat were poisoned to death. In another similar incident the same year, at least three stray dogs in Banani DOHS were found dead from suspected poisoning.\nThe agonised deaths of these voiceless creatures underscore their everyday vulnerability. Still, we, as a nation, do not give this issue the attention it deserves which is why we have no data on animal cruelty. No government or non-government agencies track animal cruelty cases specifically. Much of what is known comes from media reports or social discussions.\nBangladesh has a law to fight animal cruelty -- the Animal Welfare Act of 2019, which categorises multiple forms of animal cruelty, prohibiting the culling of strays and restricting the use of animals in entertainment. The law provides for penalties including up to two years' imprisonment or fines up to Tk.?50,000. Animal rights activists consider the statute, superseding the 1920 law, a landmark achievement as it aligns certain provisions with international standards such as the World Organisation for Animal Health. However, animals in Bangladesh are not getting the safeguard the law envisaged mainly because of the weakness in enforcement and lack of awareness. Though the legislature outlines penalties for animal cruelty, it does not specifically mention court procedures. It merely states that it would be enforced through the existing legal system. Since the enactment of the law, only a handful of cases have been filed -- a reflection of widespread public ignorance too about the law. Most people here do not know the maltreatment of animals constitutes offence and some even scoff at those who attempt to protect the animals, labelling them as trivial or eccentric.\nLegal experts believe the Animal Welfare Act empowers mobile courts to enforce it, but the responsibilities are often sidestepped because mobile courts lack resources. The requirement for written complaints to take legal action against animal cruelty often prevents cases from being prosecuted.\nThe country's failure to safeguard the voiceless creatures is not a mere moral lapse but a societal test. Everyone needs to play their respective parts to pass the test. Among those we need first is baseline data on incident frequency, and patterns of abuse to tackle cruelties effectively. Relevant government agencies and rights advocates need to run campaigns to raise public awareness about animal rights and the law on that. A formal institutional rescue infrastructure and easily available veterinary services for animals are also necessary. Required resources should be ensured for mobile courts to ensure that anyone committing cruelty to animals is brought to book and awarded due punishment. The existence of a law is meaningful only if people know it, use it, and transform it into a tool of justice. We need to keep in mind that every life we protect adds to a more compassionate nation.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Cruelty to animals must stop",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/cruelty-to-animals-must-stop-1754584111",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 08, 2025 00:00:00  \nThe growing availability of easy loans and microcredit schemes may seem like a blessing for low-income individuals, but in reality, they are pushing many into a dangerous cycle of debt. Loan apps and quick approval systems often target the poor with minimal background checks, offering fast cash at high interest rates.\nWhile the money provides short-term relief, the long-term repayment burden becomes a trap that's hard to escape. Many borrowers, unaware of the hidden fees and compound interest rates, fall behind on payments, forcing them to take additional loans to repay the previous ones.\nThis cycle leads to mental stress, loss of savings, and in some cases, extreme actions. The lack of financial literacy and regulation makes the situation worse.\nIt is time for stronger oversight and public education. Financial institutions and digital lenders must be held accountable for ethical lending practices. Empowering people with financial knowledge is just as important as giving them access to credit.\nRahim Hossain\nStudent\nBachelor of Business Administration\nNorth South University\nrahim.hossain01@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Easy loans, hard lives",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/easy-loans-hard-lives-1754584139",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-08-2025"
    }
]