[
    {
        "full_article": "The 12-day war between Iran and Israel ended with a tense ceasefire. Israel claims that it has set back Iran’s nuclear programme by years in a ‘historic victory’. But the reality appears to be more complex. Iran has suffered enormous damage — its key nuclear facilities were attacked, much of its top chain command was eliminated, and its air defences proved virtually ineffective. More than 600 people, mostly civilians, were killed. It will take years, if not decades, for Iran to rebuild what it has lost. Yet, victories and defeats in wars are not measured by material losses alone. Despite the losses and a clear power imbalance, Tehran has refused to capitulate. Its government recovered swiftly from the initial shock of June 13, and its sustained retaliatory campaign of ballistic missile and drone attacks exposed vulnerabilities in Israel’s vaunted multilayered air defence system; there were deaths. Prime Minister Benjamin Netanyahu, who claimed early that his campaign could lead to regime change in Iran, was eventually forced to accept a ceasefire, after the U.S. struck Iran’s nuclear plants. U.S. President Donald Trump, who had demanded Tehran’s “unconditional surrender”, announced de-escalation after Iran carried out a symbolic strike on American bases in Qatar and Iraq on Monday night.The war could have far-reaching implications for the regional order. Iran has reasserted itself as a counterbalance to Israel in an otherwise unipolar West Asia. Tehran is likely to rebuild its conventional arsenal, bolster relationships with Russia and China and reset ties in the region. On the other side, Israel’s over-reliance on the U.S. was again laid bare when faced with major conventional challenges. When it launched the war, it knew that it would not be able to destroy Iran’s nuclear facilities on its own. The U.S., which was participating in the defence of Israel by intercepting Iranian projectiles, joined in, giving Tel Aviv an exit strategy. But the U.S., which has burnt its fingers in Afghanistan, Iraq and Libya, did not want to get entangled in another forever war. This left Mr. Netanyahu with no other option but to accept a ceasefire with the regime he wanted to overthrow. U.S. intelligence agencies assess that the Iranian nuclear programme has been set back by only a few months. In effect, the war failed to deliver its objective and has brought the situation full circle: the urgent need for a diplomatic solution. For diplomacy to succeed, the U.S. must engage in serious talks with credible promises of economic benefits for Iran in return for accepting long-term, verifiable limits on its nuclear programme. Second, Washington must rein in Israel. As long as its closest ally continues to bomb its enemies with impunity, order and stability will remain out of reach for West Asia.\r Published - June 27, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Israel\n                    \n                            /                      \n                        \n                        Iran\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        nuclear power\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        espionage and intelligence\n                    \n                            /                      \n                        \n                        diplomacy",
        "headline_1": "Strategic misfire: On the Israel-Iran conflict",
        "headline_2": "Israel must be reined in for peace and stability in West Asia",
        "link": "https://www.thehindu.com/opinion/editorial/strategic-misfire-on-israel-and-the-iran-conflict/article69740643.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-06-2025"
    },
    {
        "full_article": "On the bright side, vaccine coverage globally, between 1980 and 2023, doubled for six diseases including measles, polio and tuberculosis. Also, at 75% globally, there has been a sharp fall in the number of zero-dose children — those who have not received the first dose of the diphtheria, tetanus, and pertussis (DTP) vaccine — during the same time period. The number of zero-dose children is a crucial performance marker and an indicator of vaccination coverage inequities. Despite increased immunisation coverage over the decades, in 2023, at 1.44 million, India, according to The Lancet, still had the second largest number of zero-dose children, and is among the eight countries with over 50% of the nearly 16 million zero-dose children globally. Most of the zero-dose children globally are in countries that are conflict-affected or with limited resources for vaccination programmes — India has neither of the two problems. However, about 23 million babies were born in 2023 in India, the highest in the world; in 2024, China, which has the second highest number of newborns globally, reported just 9.5 million newborns. Though the number of zero-dose children is staggering, when seen in the context of the number of newborns in 2023, the percentage of zero-dose children in India is 6.2%. A study in 2021 found that India had sharply reduced the percentage of zero-dose children, from 33.4% in 1992 to 10.1% in 2016. Before the COVID-19 pandemic, the number of zero-dose children was 1.4 million in 2019 but this swelled to 2.7 million in 2021 and then dropped to 1.1 million in 2022 before increasing to 1.44 million in 2023.As in the 2021 study, a large percentage of zero-dose children are in Uttar Pradesh, Bihar, Maharashtra, Rajasthan, Madhya Pradesh, and Gujarat. There is also a relatively high proportion of them in Meghalaya, Nagaland, Mizoram and Arunachal Pradesh. Over the years, the difference in zero-dose children based on gender, caste, and rural-urban status has reduced substantially. However, prevalence remains high among the poor, mothers with low education, Scheduled Tribes and Muslims. Focus is needed to immunise children in hard-to-reach tribal areas, urban slums where there is a huge migrant population, and in reducing vaccine hesitancy among Muslim households with newborn children. India has much work to do to meet WHO’s Immunization Agenda 2030 (IA2030) — halving zero-dose children relative to 2019. With the number of zero-dose children in 2023 (1.44 million) only about nearly reaching the 2019 level of 1.4 million, India needs greater and sustained efforts to halve this number in the next five years.\r Published - June 27, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        vaccines\n                    \n                            /                      \n                        \n                        children\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        minority group\n                    \n                            /                      \n                        \n                        tribals\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        Caste\n                    \n                            /                      \n                        \n                        Uttar Pradesh\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        Maharashtra\n                    \n                            /                      \n                        \n                        Rajasthan\n                    \n                            /                      \n                        \n                        Madhya Pradesh\n                    \n                            /                      \n                        \n                        Gujarat\n                    \n                            /                      \n                        \n                        Meghalaya\n                    \n                            /                      \n                        \n                        Nagaland\n                    \n                            /                      \n                        \n                        Mizoram\n                    \n                            /                      \n                        \n                        Arunachal Pradesh\n                    \n                            /                      \n                        \n                        poliomyelitis\n                    \n                            /                      \n                        \n                        tuberculosis\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war",
        "headline_1": "Vaccinating India: On zero-dose children",
        "headline_2": "The prevalence of zero-dose children remains high among the poor",
        "link": "https://www.thehindu.com/opinion/editorial/vaccinating-india-on-zero-dose-children/article69740700.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-06-2025"
    },
    {
        "full_article": "Home prices are rising steeply, even as unsold homes pile up. A strange & worrying disconnect\nAverage life expectancy in India was 71 years before the pandemic. Long enough to be a grandparent, but not a homeowner in Mumbai, as TOI reported earlier this week. Even the top 5% – financial outliers – would need 109 years’ savings to fund a 1,184sq-ft, 2-bedroom purchase in the financial capital. A Delhi home seems hardly “affordable” with a commitment of 35 years’ savings. Point is, few can buy a house in India today.\nYet, houses are being built at ever higher price points. In the Mumbai region, builders announced projects with over 1L houses last fiscal, although more than 5L remain unsold. In Pune, 2.4L houses are unsold, 1.1L in Hyderabad, 68,500 in Delhi-NCR. Housing must be the only industry where sellers aren’t bothered by inventory. It’s also the only one immune to the laws of demand and supply. Consider how prices in Hyderabad have jumped 43% in five years despite 177% growth in unsold inventory. Peculiarities of the Indian housing market don’t end there. Houses are expensive not just by Indian salary standards but globally. NYT reported in Feb that the median price of a 4-bedroom Manhattan apartment is $3.7mn or ₹32cr. Plenty of Worli apartments are now in that ballpark. \nHousing is a primary need, so govt must figure out what is pushing prices beyond buyers’ reach. Families stake their future to buy a house somehow, and their steep monthly commitments squeeze demand for other things – cars, refrigerators, TVs, etc. That 1,184sq-ft Mumbai apartment costs ₹3.5cr, on average. A 15-year loan of this size means an EMI of ₹3.6L. But an equivalent loan in US costs only ₹2.8L per month. Costly homes, costlier loans – govt has its task cut out.\n\n",
        "headline_1": "House that?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/house-that/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-06-2025"
    },
    {
        "full_article": "In the khichdi that’s India, a multiplicity of documents to prove citizenship makes sound sense\nNitish Kumar was the first NDA CM to talk down a national register of citizens (NRC) for Bihar back in 2019. His three magic words – ‘Kahe ka NRC’ (whatever for, an NRC?) – set the tone for a quiet demise of a nationwide record of citizens. Census 2027’s headcount won’t include a ‘national population register’, the parent body for an NRC, the theme itself dropped from NDA/BJP’s 2024 Lok Sabha poll manifesto. \nDiverse & fluid | India by design does not mandate citizenship proof, and by extension has no single document as proof of citizenship. Instead, given the nation’s plurality, caste networks and marriage ties, waves of refugee influx, pockets of intense poverty and patchy access to state institutions, New Delhi framed the citizenship law in terms of conditions met, not documentary evidence. An example of this fluidity is in voter rights, normally reserved for ‘citizens’, extended to those born in India to Tibetan refugee parents. A bunch of govt-issue IDs in various combinations can satisfy criteria to prove citizenship.  \nPeopled borders | NRC in Assam showed the challenge it is for many to show they’re Indian. Alleged ‘immigrants’ had legitimate documents, many locals never felt the need to have any. CAA in fact confused NRC in operation. Given India’s layered multitudes of ethnic, language and religious groups, sub-nationality has been more the people’s anchor. Take the Bengali in Dhaka – Indian till 1947, Pakistani till 1971, Bangladeshi then on. Primarily, Bengali. National borders are the most artificial of constructs – ask kith-kin-caste groups at the UP-Bihar-Bengal/Nepal border, villagers at Punjab/Pak border, communities in northeast-Myanmar and Bengal-Bangladesh borders. \nProofs & polls | Amid drives to harden citizenship, it is its shadow, the grainy gray of  ‘illegal immigrants’, the non-citizen, that crops up like clockwork ahead of every state election – Assam to Bengal to Jharkhand to even Maharashtra  – only to curl back post polls. This hardening is newly evident in Manipur. Delimitation in 2008 was put off in Manipur after it raised doubts over 2001 census data. The deferment lapsed in 2020. Now, Meitei groups want an NRC – after two years of conflict – before delimitation, which decides electoral representation. Citizenship serves political purposes that a single documentary proof can weaponise. It is one reason why tech-interface Aadhaar went from being designed as proof of identity for welfare measures, to attempts to make it proof of citizenship, only to return as proof of identity. Nitish Kumar wouldn’t allow lack of certain documents to disenfranchise the Bihari. There’s no harm in rules that accept a multiplicity of documents.\n\n",
        "headline_1": "Citizen kaun",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/citizen-kaun/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-06-2025"
    },
    {
        "full_article": "Thanks to a scientific phenomenon, distance reduces the noise of the news \nDistance is said to lend enchantment to the view, blurring the sight of warts and other eyesores. Distance also lends detachment from the news. \nOn a visit to London I stay tuned to what’s happening back home in India by following the news. There is a familiarity about the news, born out of repetition that makes the word ‘news’ into an oxymoron, a contradiction in terms. \nPerhaps the people in charge of compiling dictionaries should, by deed poll if necessary, officially change the name of news to olds, because much, if not most of it, is the same old, same old. \nOpposition is going at govt hammer and tongs. And to return the compliment, govt is going at Opposition tongs and hammer. \nOperation Sindoor was/was not an unqualified success. The White House did/did not play the honest – or dishonest – broker in effecting a ceasefire between New Delhi and Islamabad. \nGovt, after having opposed a caste-based census all this while, is now in favour of it because it wants to consolidate the so-called Hindu vote/it wants to fragment the Dalit/OBC vote. Ding-dong, dong-ding.\nBut there’s not just a familiarity in the news, there’s also a reduction in its noise level, making it sound less frenetic and frenzied the farther off it is. The scientific reason for this is called the Doppler Effect, after the Austrian physicist, Christian Doppler. \nThe scientist described this phenomenon in 1842, whereby the frequency of sound waves changes as the source of the sound approaches or recedes from the hearer. \nThe whistle of a train approaching a station sounds increasingly sharper and more shrill, the sound waves getting scrunched together like a squeezed accordion, and gets muted as the train passes and the wavelength becomes longer and flatter, like the wrinkles being ironed out of a shirt. \nDistance and flattening wavelengths take much sound out of the fury of the news, and some of the fury out of its sound \nFor this relief much thanks, Herr Doppler. \n\n",
        "headline_1": "Sound effect",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/sound-effect/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-06-2025"
    },
    {
        "full_article": "That a Muslim South Asian may be the next mayor of New York is a story of American identity getting seriously impacted by immigrant demographics. But it’s as much about class as race. A combative Leftie is taking on ‘privilege’ in a town most wealthy ‘New Yorkers’ don’t call home anymore\nImagine New York City. If the first image that comes to mind is Robert De Niro glowering behind the wheel, or Sarah Jessica Parker strolling through the Upper East Side in Sex and the City , or Woody Allen’s neurotic everyman act, then it’s time to shut off Hollywood and smell the coffee and bagels.\nSorry – samosa.\n\nToday’s NYC is very different from what it’s like in the popular imagination. And that’s one reason why the Democratic nomination of Zohran Mamdani for mayor – beating someone as classic New York as Andrew Cuomo – may seem shocking, but isn’t.\nRead full story on TOI+\n\n",
        "headline_1": "Mamdani and the city",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/just-another-blog/mamdani-and-the-city/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-06-2025"
    },
    {
        "full_article": "With a population exceeding 18 crore, Bangladesh ranks as one of the most densely populated countries in the world. It is also the third-largest producer of poultry globally. However, the country's poultry marketing and slaughter systems fail to meet international standards. As demand for chicken rises, poultry markets are expanding rapidly, particularly in urban centres. In local traditional bazaars, live bird markets (LBMs) are a common feature, where chickens are often sold alive.\nIn recent years, commercial farms have established a \"broiler meat chain\" where broiler and Sonali chickens are processed and sold in both markets and supermarkets, with various cuts available. However, there is a divided public opinion on the acceptance of processed meat. Additionally, as Bangladesh is a Muslim-majority country, the slaughter of animals in LBMs follows religious practices to ensure halal food.\nChattogram, the largest city in Bangladesh with a population of over 53 lakh, relies heavily on broiler and Sonali chickens. These chickens are usually raised on farms on the city's outskirts and transported to LBMs by middlemen. At the markets, the chickens are kept in cages or on floors until slaughtered, following a religious call. No pre-slaughter protocols, such as stunning, are observed as they would be in more modern slaughterhouses. Generally, the chickens are allowed to bleed out before their carcasses are processed according to consumer preferences.\nPoultry welfare issues in established slaughterhouses are well-documented and typically include concerns about transport duration, death on arrival, plumage conditions, injuries, and post-slaughter conditions. While these issues have been thoroughly researched, there is a lack of studies addressing the neglect of animal welfare in Bangladesh's LBMs. A recent market-based study in Chattogram aims to analyse the market context and highlight policy gaps in broiler welfare.\nThe findings from this study shed light on disturbing welfare violations in Chattogram's live bird markets. Overcrowded cage systems, lack of access to food and water, poor ventilation, and unsanitary conditions are rampant, raising ethical and public health concerns. The study, which spanned 10 LBMs and 50 outlets, found that 22 percent of outlets left chickens without food or water for over five hours, violating their basic physiological needs. More than 40 percent of outlets lacked proper ventilation, and 96 percent had no exhaust systems, severely compromising air quality and thermal comfort. Additionally, only 24 percent of vendors sharpened their knives daily, prolonging the suffering of the animals.\nInappropriate handling methods, such as catching chickens by their wings or legs, cause injuries, fear, and trauma, indicating a lack of humane practices. These combined stressors contribute to dehydration, weakened immunity, and higher mortality rates, particularly in smaller outlets. The study reveals that welfare shortcomings are systemic and rooted in ignorance, with no regulatory oversight. The lack of animal welfare enforcement results in an increase in diseases and infections. For example, in traditional bazaars, slaughtered chickens and their waste are kept together in the same containers, creating a breeding ground for bacterial contamination.\nFurthermore, although cages are cleaned every few days, they often remain unclean for extended periods, while sick chickens are neglected. Prolonged transportation without proper access to food and water leaves them vulnerable to infections that spread to other chickens.\nThe study calls for urgent policy reforms to enforce welfare standards and improve market practices. It is a stark reminder that poultry are sentient beings deserving of humane treatment, not just units of production.\nDr Md Ridoan Pasha, the leading investigator and a prominent animal welfare researcher at Chattogram Veterinary and Animal Sciences University (CVASU), emphasised the high level of negligence and carelessness towards chickens in the LBMs, causing suffering at every stage, from unloading to slaughter. Alarmingly, few customers or stakeholders seem aware of these serious issues.\nProfessor Dr Mohammad Rashedul Alam, an animal welfare specialist at CVASU, further stressed the need for strict adherence to welfare standards across the poultry supply chain, from farm to LBM. He advocated for hands-on training for all vendors to prevent animal welfare abuses, ensuring both food safety and the well-being of the birds before and after slaughter.\nAddressing the systemic welfare violations in Chattogram's LBMs requires an assessment of lairage practices, rearing conditions, stocking densities, and hygiene protocols, among other factors. Only through comprehensive policy reforms can the welfare of broiler chickens be improved.\nMinhazur Rahman Shihab is researcher at the Institute of Forestry and Environmental Sciences, University of Chittagong.\n\nTanhida Towhid is researcher at the Institute of Forestry and Environmental Sciences, University of Chittagong.\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Chattogram's live bird markets expose disturbing gaps in poultry welfare",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/chattograms-live-bird-markets-expose-disturbing-gaps-poultry-welfare-3926161",
        "news_paper_name": "The Daily Star",
        "publish_date": "27-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 27, 2025 00:00:00  \nThe central bank has announced that it will roll out risk-based supervision (RBS) of banks on a full scale starting from January next year. According to the central bank governor, a pilot programme of the RBS framework is already underway with the trial runs in all commercial banks scheduled for completion by the end of this year. Reports indicate that trial for implementation has already been completed in 20 banks. Speaking at the launch of Google Pay in Bangladesh, the governor expressed optimism that this landmark regulatory shift-the first of its kind in the country-will play a crucial role in bringing greater discipline to the banking sector.\nRisk-based supervision is a modern regulatory approach in which supervisory attention and resources are allocated based on the risk profile of each financial institution. Unlike the traditional one-size-fits-all model of rules-based supervision, RBS tailors oversight intensity according to the specific risks posed by each bank. This allows regulators to focus more closely on institutions or operational areas that present greater threats to financial stability. The core objective of RBS is to identify, assess and mitigate potential risks before they become systemic threats. This involves evaluating each bank's size, complexity, business activities, and internal controls to determine its risk profile. Based on this assessment, supervision becomes more frequent and intensive in high-risk areas, thereby ensuring that regulatory resources are deployed where they are most needed. One of the key benefits of RBS is its proactive stance. Instead of relying solely on historical performance or routine compliance checks, it seeks to uncover weaknesses that may lead to future instability. By emphasising early detection and preemptive intervention, the RBS model enhances the central bank's ability to forestall crises and reinforce the resilience of the financial system.\nDespite its many advantages, transitioning to risk-based supervision is not without challenges. Moving away from the traditional rules-based framework involves a fundamental shift in regulatory culture. Supervisors must develop a deep understanding of the dynamic risk environment in which banks operate. This demands not only a skilled and well-trained supervisory workforce but also robust institutional support-both political and organisational. Furthermore, supervisors must be empowered with appropriate tools and authority to act decisively. They need to continuously update their understanding of evolving risks and refine their supervisory approach accordingly. This makes ongoing training, access to high-quality data, and enhanced analytical capabilities critical to the success of the RBS framework. If effectively implemented, RBS can significantly improve the governance and operational discipline of banks. For regulators, it allows more precise identification of emerging risks and vulnerabilities. For banks, it serves as an early warning system-alerting them to potential pitfalls arising from internal lapses or external shocks, whether caused by misjudgment or deliberate actions.\nAdoption of risk-based supervision marks a major step forward for banking regulation in Bangladesh. While the transition will require significant institutional effort, capacity building, and mindset change, the long-term benefits in terms of enhanced financial stability and systemic resilience are certainly worth the effort.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Risk-based supervision  by central bank",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/risk-based-supervision-by-central-bank-1750955002",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       June 27, 2025 00:00:00  \n\nThe dark episode of the human civilisation involving the Jewish people has become darker with the descendants of the holocaust victims turning the perpetrators of the same crime. A state for the Europe's displaced Jewish was created at the initiative of former US President Harry S Truman under the Balfour Declaration of 1917. The British who had a colonial mandate for Palestine until May 1948 did not approve of creation of either a Jewish or an Arab state there and even opposed unlimited immigration of Jewish refugees to the designated location. But it reluctantly conceded to the US demand. Since the creation of Israel and recognition of the state by Truman on May 14, 1948, America has remained a staunch patron as well as an accomplice of all the evil acts committed by the Jewish state. \nThe Jewish issue is linked to the two world wars. During the World War I, the Balfour Declaration was made by then British foreign secretary Arthur Balfour, which provides for the basis of the Zionist state and also the seed of Arab-Israeli conflict. Although the United Nations Special Commission on Palestine recommended the division of the land into two separate states and adopted Resolution 181to this effect on November 29, 1947, the Palestinian state was left in the limbo. So here is an endemic political problem created by the UK and the US, which gained support from the Western powers under the North Atlantic treaty Organisation (NATO) umbrella. The NATO allies did so in order to restrict Soviet influence in the Middle East and control the fuel oil sources. \nClearly, the US unreserved support backed up by its European allies led to Palestinian uprising called Intifada the first of which was organised during 1987-93, the second during 2000-2005. But it was the Arab-Israeli wars in 1948, 1956 and the six-day the six-day third Arab-Israeli decisive war in 1967 that proved crucial. Now the Arab neighbours like Egypt, Syria and Jordan know their limit and would not be involved in a war against Israel. \nSo Israel knows its enemy Iran well because it is the only country that has been supporting the cause of the Palestinians and the Hamas. Yet it is unbelievable that Israel would have invaded Iran without the green signal from the US. President Donald Trump known for his denial of facts and mistrust of his country's intelligence reports was the main aggressor in this war. In fact, the negotiation on Iranian nuclear programme the US insisted on earlier was a preamble of what was to follow. The US intelligence agencies were categorical in reporting that Iran was not developing nuclear arsenals at its facilities, so did the International Atomic Energy Agency (IAEA). But such reports were brushed off by Trump and bought what Israeli Prime Minister Benjamin Netanyahu harped on the issue in a Goebblesian pattern. It concerned Iran's achievement of nuclear weapon capability within weeks. A white lie it was. \nTrump who calls himself a man of peace, actually used this as a ruse for attacking Iranian nuclear facilities. The use of the largest ever fleet of B-2 bombers for dropping the 30,000 bunker-buster bombs for the first time was yet another needless American military campaign against countries the Jewish lobbies in the US and Israel consider their enemies. After the unprecedented bombing of the Iranian nuclear facilities, Trump's volte face from an aggressor to a peace broker sums up the unstable president's character. Not only did he brag over his success in obliterating the nuclear facilities targeted but also took credit for accomplishing the truce between Iran and Israel. \nCan a party to a war mediate peace? Trump who could not undermine more the international organisations including the United Nations which he hardly considers better than a lame duck thinks he has performed a historic obligation. But had the international conventions and laws been in force, both Netanyahu and Trump would have stood trial for invasion of Iran and the routine killing of Palestinians including those among them seeking food aid from UN agencies. \nThe Palestine Liberation Organisation or for that matter the Hamas would not even emerge had the UN Resolution 181 of 1947 been honoured to create two separate states in Palestine. Now the creators of the problem are posing to be peace negotiator of an unjustified war on Iran. The president of the most powerful nation has no qualms about claiming that the targeted nuclear facilities have been obliterated, although preliminary US intelligence and independent information contradicts his claim. According to this, the three nuclear facilities, including Fordo, hit were not destroyed. They were extensively damaged and the Iranian nuclear programme has been pushed back by only six months. \nAn aggressor who tends to paint him as a peace lover and still trying to steal the show at the NATO annual meeting in the Netherlands hardly deserves the status of the free world's leader. In fact, the majority of his predecessors also had similar contradictory mindset problems. It is because of this, the invasion of Afghanistan and Iraq could happen. Similarly, the Vietnam misadventure was unleashed with the consequence of great tragedies. If the UN had been allowed to function independently and impartially, the 'might is right' principle would not take charge of world affairs. The crimes Israel and the West are committing cannot be condoned. Unless such crimes, particularly against the Palestinians, are legally addressed at the International Court of Justice, the international order will not be equal to the task of protecting the people's rights everywhere on the planet. \nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "When aggressor turns  mediator of peace",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/when-aggressor-turns-mediator-of-peace-1750955169",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       June 27, 2025 00:00:00  \n\nWith the passage of time, advancement of technology and change in focus, vehicle bumpers have gone through massive improvements since the first bumper on vehicles appeared in 1897. At the early stage of automobile industry development, bumpers were made of stiff metals and had mainly an ornamental function. Over the years, the focus shifted to functionality for improving safety and protecting vehicle components while the material changed to a combination of metal and rubber and then to metal and fiberglass composite or plastic. Bumpers of most modern automobiles are made of a combination of polycarbonate and acrylonitrile butadiene styrene. Vehicles that Bangladesh imports have these modern bumpers integrated, but people do not get their safety benefit. Why? Because owners attach additional steel or iron bumpers to the front and rear ends of buses and trucks as well as smaller vehicles like private cars, microbuses, pickups and three-wheelers to ensure that collision, bump, etc; do not damage or dent their vehicles. This is done illegally, tinkering with the manufacturers' original design and totally ignoring the scientific reasons for bumpers as if ordinary Bangladeshi people and half educated technicians understand the technology better than their inventors do! Such mindless modifications have appeared as a deadly threat to road safety in Bangladesh as they turn vehicles into battering rams, especially in crowded urban areas where space is already constrained. Otherwise survivable accidents often end in fatal tragedies because of the extra bumpers. Yes, the bumpers might minimise damage to the vehicle they are attached to in case of accidents, but they cause disproportionate damage to other vehicles, pedestrians and roadside structures. In 2024, 7,294 people were killed and 12,019 injured in road accidents in the country, according to the Road Safety Foundation. Had the vehicles no extra bumpers welded onto them, many of these lives might have been saved.\n Attaching extra bumpers to vehicles is illegal under the traffic laws in effect. Still it is hard to find any vehicle without them. The problem is compounded by several factors. Most transport owners and drivers believe the modifications provide added security to their vehicles, thanks mainly to deep-rooted ignorance about road safety and a lack of awareness about the risks posed to others. Another factor is the lax enforcement of relevant laws. \nRegulatory authorities on a few occasions announced crackdowns on such 'modifications' and conducted sporadic drives with some vehicles being fined for the law violation, but the efforts are often short-lived and lack consistency. Such inconsistency encourages offenders to return to the roads undeterred. Another significant issue is the lack of coordination among the authorities concerned. While the Bangladesh Road Transport Authority (BRTA) is authorised to issue vehicle fitness certification, the traffic police are responsible for enforcing road regulations and local government bodies to oversee infrastructure. The absence of a coordinated approach allows vehicle owners to exploit loopholes and continue using illegal modifications with impunity. A vehicle may pass fitness checks from BRTA while simultaneously violating traffic laws enforced by the police. Workshops which install illegal bumpers with little technical knowledge about automobiles and no oversight from the authorities play a major role in aggravating the situation.\nA comprehensive strategy is needed to address this problem. Enforcement of law must be strengthened. The BRTA and the traffic police should launch joint drives with mobile courts to seize and fine vehicles using illegal bumpers and thorough inspections of vehicles should be ensured before issuing vehicle fitness certificates. Workshops producing and installing such bumpers should be penalized and closed down for repeated violations. Public awareness campaigns are also crucial in this regard. Transport workers and vehicle owners should be brought under mandatory training programmes that include modules on road safety and legal provision for vehicle modifications.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Danger of extra bumpers on vehicles",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/danger-of-extra-bumpers-on-vehicles-1750955225",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 27, 2025 00:00:00  \n\nThe so-called \"common room culture\" in public universities has long been a deeply troubling issue. In these common rooms, which are meant for two or three students, are crammed with eight to ten individuals, making it nearly impossible to study or rest. Basic facilities such as sanitation, ventilation, and personal space are grossly inadequate, creating conditions worse than urban slums.\nBeyond the physical discomfort, this overcrowding fosters social unrest. Tensions rise easily in such tight quarters, leading to constant arguments, group rivalries and even violent clashes. The lack of privacy and dignity erodes mutual respect and breeds psychological stress. As a result, academic focus is lost, and students suffer silently.\nThis practice is not only a violation of students' rights to a safe and healthy learning environment, but it also tarnishes the reputation of public universities. The time has come for university administrations, particularly newly appointed leaderships, to take decisive steps and dismantle the common room culture to ensure dignity and a sound academic environment for students.\nMd. Riyad Uddin \nStudent\nDepartment of Bangla \nUniversity of Chittagong\nriyaduddin.cu@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Stop common room culture",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/stop-common-room-culture-1750955309",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-06-2025"
    }
]