[
    {
        "full_article": "It has been four years since the delta variant of the SARS-CoV-2 virus hit India. The country bore the brunt of the pandemic’s devastating impact, with harrowing scenes of overwhelmed health-care systems, oxygen-supply shortages and even bodies floating in the Ganga in Uttar Pradesh. Reports based on data sourced from the Civil Registration System through RTIs and other means, by The Hindu in particular, besides independent surveys, showed that the toll was clearly staggering and in millions, much more than the official tally. The government’s response was defensive and dismissive; the attempt was to consistently undermine the findings. After maintaining that the reported number of COVID-19 deaths during this period was accurate, the government, through the Registrar General of India, released a report last week that showed that there were 21.5 lakh excess deaths in 2021 as against 3.32 lakh reported COVID-19 deaths. During a pandemic, the bulk of these excess deaths must have been related to the effects of the disease. Besides, lockdown restrictions had resulted in lower fatalities due to causes such as road accidents. The high number of excess deaths was estimated by The Hindu’s calculations to be nearly 6.5 times more than the reported deaths. The fact that this multiple was even higher for Gujarat (44.2), Madhya Pradesh (19.5),Uttar Pradesh (19.5) and Telangana (18.2) suggests that COVID-19 deaths were under-reported significantly in 2021. These were largely due to the fact that deaths due to comorbidities were perhaps not considered as COVID-19 deaths or because those numbers were suppressed in order to paint a rosier picture of the government’s response to the pandemic.The nearly four-year delay in releasing this report, alongside the Sample Registration System Report for 2021, reveals the Union government’s reluctance to comprehensively assess the pandemic’s true impact and its casual approach to publishing critical demographic data. This reluctance in publishing timely information coincides with the fact that India’s civil registration system that tracks births and deaths has become more robust over time with most States reporting the bulk of the deaths that occur, either in institutions such as hospitals or at homes. In some States, this reporting happens with a lag when compared to others, but it is encouraging that registration levels are getting better. But medical certification of the causes of the deaths still remains low when compared to other developing countries such as Brazil. A robust maintenance of registration and certification records is important for public health tools. The delay in release of vital data defeats the purpose of the improvements made in civil registration. Data delayed is also data denied. Published - May 13, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        viral diseases\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Right to Information\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Gujarat\n                    \n                            /                      \n                        \n                        Madhya Pradesh\n                    \n                            /                      \n                        \n                        Uttar Pradesh\n                    \n                            /                      \n                        \n                        Telangana\n                    \n                            /                      \n                        \n                        demography\n                    \n                            /                      \n                        \n                        Brazil\n                    \n                            /                      \n                        \n                        public health/community medicine\n                    \n                            /                      \n                        \n                        health",
        "headline_1": "​A belated admission: On the undercount of India’s COVID-19 pandemic deaths",
        "headline_2": "Civil registration data from 2021 points to significant excess deaths",
        "link": "https://www.thehindu.com/opinion/editorial/a-belated-admission-on-the-undercount-of-indias-covid-19-pandemic-deaths/article69568311.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "13-05-2025"
    },
    {
        "full_article": "A full-scale war between India and Pakistan may have been averted, but the troll army has come out in force to disturb the peace. After India’s Foreign Secretary Vikram Misri announced on May 10 that an understanding had been reached between the two sides to halt all military actions, his personal account on X (formerly Twitter), was flooded with abusive comments which did not spare his daughter. Mr. Misri locked the account, and several diplomats and politicians have condemned the toxic culture in no uncertain terms, pointing out that several red lines had been crossed. Mr. Misri was only doing his job and conveying a decision taken by the political leadership. The Foreign Secretary had been addressing the media since Operation Sindoor began on May 7, in response to the deadly terrorist attack in Pahalgam on April 22, in which 26 people died. The Ministry of Information and Broadcasting (I&B), which had rightly slammed Pakistan for unleashing “a full-blown disinformation offensive” on social media about the ground reality regarding Operation Sindoor, remained quiet about the vicious trolling of Mr. Misri and the doxing of his daughter. Unfortunately, with the phenomenal rise of social media in India but little Internet literacy, there is a pattern of platforms being regularly used for hate speech, abusive comments, and deliberate distortion of facts.The public sphere may have become more participatory, but that does not necessarily ensure civil behaviour. Surveys have shown that women, minorities and marginalised communities are particularly targeted by trolls. The extreme reactions often include rape and death threats. With surveillance now the byword for all tech companies, surely it should not take long to locate and end the online run of trolls. A stringent anti-troll law must be put in place to stop the acute mental and physical harassment trolls can cause. The draft Digital Personal Data Protection (DPDP) Rules, 2025, set to be rolled out this year, prescribe penalties for misuse of personal information. Now, there are only a limited number of provisions under the Bharatiya Nyaya Sanhita and the Information Technology Act to address cyberbullying. The courts have been more proactive by directing quick removal of offending content and also mandating the disclosure of basic subscriber information linked to such accounts. In the Shaviya Sharma case (2024), the Delhi High Court had noted that “there can be no doubt that acts of doxing if permitted to go on unchecked could result in violation of right to privacy”. In a democracy, all voices should be heard but disinformation and misinformation must be stopped with the help of guidelines and the law. Published - May 13, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        government departments\n                    \n                            /                      \n                        \n                        public officials\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        sexual assault & rape\n                    \n                            /                      \n                        \n                        minority group\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        data protection\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        human rights",
        "headline_1": "​Toxic trolling: On India-Pakistan conflict, troll army",
        "headline_2": "Online threats of violence cannot be allowed in the name of free speech",
        "link": "https://www.thehindu.com/opinion/editorial/toxic-trolling-on-india-pakistan-conflict-troll-army/article69567484.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "13-05-2025"
    },
    {
        "full_article": "Can the algo make you switch from coffee to herbal tea? \nIt’s spooky. Weird. Invasive. Has it happened to you? There you are chatting with friends and family about a specific subject and your mobile phone begins to show half a dozen ads for similar products. From holiday resorts to magical meds, airlines to real estate, you are under an audiovisual assault.\nBut, you sputter, my phone was off, closed, no juice, like who is the snitch in the room? How the heck did they figure out what we were talking about? For the first few times you tend to marvel at the ability of technology to win guessing games – wow. But after the novelty wears off, you begin to see it as an invasion of your privacy. If they can print-out your mind with a closed phone, what else do they know about you?\nMore than you know about yourself. It isn’t wizardry, it’s a scientific exercise in gathering data on you and creating a deep profile. Your CV or medical file or HR document is a toy in comparison. This data updates constantly and knows your choices by tracking your calls, your online activity, your social media contributions, your day’s calendar, so it knows it’s your coffee time and just in that timeframe it hits you with a volley of coffee spots.\nCoffee shots are fine but what else has their superframe computer found out about me?  My ambitions, my thoughts, my desires, my secrets all spilling out of the phone. More than that, it then begins to control your likes and dislikes, all your preferences. It is the algorithm abyss and you are allowing yourself to be yanked along. Every click, every TikTok, YouTube, Quora item you see, the wide awake algo is feeding it in until you truly run the risk of responding to the puppet master.\nI realised how dangerous it is when I was watching a movie and an ad came  on and told me my life would be kissed by the sun and butterflies would flutter about if I started having herbal tea of a certain brand. I never have herbal tea but they made it look like the whole tea factory was constructed for me, literally guilting me into buying it. Suddenly, this algo whatever is generating  a new person and you don’t even know it is happening.\nImagine how it orchestrates your priorities. Having you by the short hairs, it tells you what you like, what you need, what you must get. Come the day when it even tells you what to think. Uh oh, already doing that.\n\n",
        "headline_1": "Making a new person",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/making-a-new-person/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-05-2025"
    },
    {
        "full_article": "Three ways the valley can be nurtured back to normalcy\nAs the hot phase of Operation Sindoor winds down, it’s time to refocus on Kashmir – the epicentre of hostilities with Pakistan. The Pahalgam terror attack was specifically designed to disrupt normalcy in J&K. Therefore, Pakistan will try to capitalise on the break created by hostilities. It will keep LoC warm with sporadic firing below a certain threshold, try to push in more terrorists over the summer months, and revert to a multi-pronged approach to stretch our security forces.\nTo counter this India needs to do three things. First, track down the perpetrators of Pahalgam. This is absolutely necessary to restore confidence in the local security apparatus. It also sends out the message that Indian forces will hunt down the perpetrators wherever they are. This iron-clad security promise has to be the bedrock of normalcy in J&K.\nSecond, we need to bring terrorist infiltration to zero. Post-Pahalgam, even a single successful infiltration is one too many. We need enhanced investment in local intelligence, increased security at LoC and IB, and perhaps greater tech-based solutions to create an impregnable defensive architecture. Sure, there are challenges of topography and climate in J&K. We have detailed in these columns how heavy snowfall damages border fencing, batteries for hand-held thermal imagers drain quickly, and replacements are bogged down by bureaucracy and delays. All of these now need to be addressed on a war footing.\nThird, our response should not undermine the fruits of normalcy that residents of J&K had come to enjoy. We must not go back to a situation where security forces clamp down on everything. This would only serve Pakistan’s purpose as scuttling normalisation was its goal. We need smarter security. Plus, those living near LoC, who have suffered the most in recent hostilities, deserve better assistance and protection. The state must show that it cares for everyone in J&K. Maintaining that social compact is also key to defeating Pakistan’s designs.\n\n",
        "headline_1": "Kashmir Calling",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/kashmir-calling-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-05-2025"
    },
    {
        "full_article": "How India Stays Strong Without Starting Fights\nAfter a recent military operation called Operation Sindoor, Prime Minister Modi gave a speech to the country. Even though there had been fighting, he focused on something very important: peace. He reminded everyone that India believes this is not a time for war or terrorism. That shows how deeply India believes in solving problems peacefully.\nTerrorism is one of the worst types of violence. And even when India had to fight back because of a terrorist attack in Pahalgam, it didn’t go looking for war. India made sure the operation only targeted terrorist bases and didn’t hurt regular people. That’s how we know India doesn’t start fights—it only defends itself when it has to.\nModi also said something powerful: “Strength brings peace.” This means that being strong helps keep the peace, because others are less likely to attack if they know you can defend yourself. A top Air Force officer even quoted an old poem that says “Without fear, there can be no love.” In other words, when people feel safe, they can live happily.\nIndia has believed in peace for thousands of years. Our Constitution—the special book of rules that guides our country—also says we support peace around the world. Unlike some countries, India doesn’t start wars just to take over land or resources like oil. Even our nuclear policy says we will never use these weapons first.\nWhen Pakistan tried to say that Operation Sindoor was unfair, India clearly explained it was only to stop terrorists, not to attack Pakistan. India was very careful to protect civilians. That shows how serious we are about peace, even in war.\nA long time ago, after India won a war and had 93,000 Pakistani soldiers as prisoners, we still signed a fair peace deal called the Simla Accord. That’s just how India is.\nInstead of sending out armies, India has shared ideas—like kindness, respect, and peace—through religions like Hinduism, Buddhism, Jainism, and Sikhism. These ideas have helped people around the world live better lives. And even though we’re proud of our traditions, we respect all religions, just like Swami Vivekananda once said.\nIn the end, as former Prime Minister Manmohan Singh said, India’s rise doesn’t scare anyone, because we believe in peace. It’s just part of who we are.\n\n",
        "headline_1": "Defending Peace",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/defending-peace/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-05-2025"
    },
    {
        "full_article": "Modi’s speech and Op Sindoor exemplified India’s long tradition of never being the aggressor\nThat Modi, addressing the nation after a military conflict, put peace front and centre speaks to both his political maturity and India’s instinctive pacifism. This is not an era of war, he said, reiterating what he had famously told Putin. That he added this is not an era of terrorism either, reinforces the peace paradigm. What’s terrorism if not the most reprehensible form of violence? It’s important, therefore, to re-emphasise that the way India conducted itself during Op Sindoor reiterates the first principles of pacifism – that we shall not be the aggressor. Yes, shakti – strength – will be the guarantee of shanti – peace, as Modi said. Earlier on Monday, Air Marshal AK Bharti, quoting from Ramcharitmanas, made a similar point: “Bhay binu hoye na priti (without fear, there can be no love).”\nIndia made peace its civilisational value millennia ago, and in recent history it has been enshrined in our Constitution, which stresses international peace and security. War simply is not an instrument of state policy in India as it is in, say, Israel or Russia. Invading a country for its lithium or petroleum reserves, or territory, would be unthinkable here. Even our nuclear doctrine, unlike Pakistan’s, is clear on the point of no first use.\nSo, while Pakistan tried to paint Op Sindoor as an unprovoked Indian aggression, India declared at the outset it was an answer to Pahalgam, and confined to terrorist bases. When has an “aggressor” taken such pains to ensure the safety of civilian areas, as India did on May 7? Although 53 years have passed, some in Pakistan might still remember how India, after humbling it and while still holding 93,000 of its troops as prisoners of war, signed a generous Simla Accord. That is the Indian way.\nThroughout history, this land has sent out conquering ideas, not armies. Hindu and Buddhist philosophies spread around the world in antiquity, and together with Jain and Sikh teachings are helping the East and the West make sense of their rushed modern lives today. But for all that, we are not religious chauvinists. As Swami Vivekananda said, “We believe not only in universal toleration but we accept all religions as true.” That’s why, to quote another PM, Manmohan Singh, “The rise of India does not cause any apprehensions.” Peace is part of India’s DNA, even or especially when it has to protect itself.\n\n",
        "headline_1": "Defending Peace",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/defending-peace-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-05-2025"
    },
    {
        "full_article": "Under the Bank Resolution Ordinance 2025, the interim government has granted the central bank sweeping new powers to intervene in the banking sector, which continues to reel from the legacy of corruption and mismanagement indulged by the Awami League regime. As a result, the authorities can now take temporary control of any scheduled bank, if necessary, by issuing share transfer orders, provided the transferee is a government entity. The central bank had long sought such authority, as it would grant it greater freedom to intervene in the sector and restore discipline. In that respect, the ordinance marks a positive step forward.\n\nA notable feature of the ordinance is the introduction of \"bridge banks,\" which are temporary financial institutions established to take over failed banks. These bridge banks will ensure the continuity of banking operations during the resolution process by temporarily holding the assets of failed banks until a permanent solution is found. Bridge banks can also act as a buffer, isolating distressed banks from the broader financial system to prevent panic withdrawals or bank runs. \nThe new law also authorises the central bank to act immediately in cases of fraud or gross mismanagement—such as when bank owners divert funds for personal use—by triggering formal resolution proceedings. Under the now-ousted regime, widespread corruption, particularly by bank owners with political ties to the government, seriously undermined the health of many banks. Consequently, at least a dozen of the country's 61 banks are currently believed to be in poor condition, with some surviving only through liquidity support from the central bank. Additionally, the central bank will now have the authority to appoint temporary administrators to manage distressed banks and implement necessary recovery measures. It can also raise capital from new or existing shareholders to strengthen their financial standing.\nA notable feature of the ordinance is the introduction of \"bridge banks,\" which are temporary financial institutions established to take over failed banks. These bridge banks will ensure the continuity of banking operations during the resolution process by temporarily holding the assets of failed banks until a permanent solution is found. Bridge banks can also act as a buffer, isolating distressed banks from the broader financial system to prevent panic withdrawals or bank runs. To support such interventions, a Bank Restructuring and Resolution Fund will be established through government contributions, support from international financial institutions, and risk-based levies on banks.\nOn paper, these additional measures could be useful tools in the central bank's toolkit for addressing the sector's longstanding problems. The need to strengthen the central bank has long been overdue. However, we hope that, beyond reinforcing the legal framework, efforts will also be made to improve the poor track record of enforcing rules and regulations in our financial sector. This is where the focus must now lie—to prevent banks from falling into disarray in future.\n",
        "headline_1": "Strengthening central bank was necessary, it's now its turn to deliver",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/strengthening-central-bank-was-necessary-its-now-its-turn-deliver-3893036",
        "news_paper_name": "The Daily Star",
        "publish_date": "13-05-2025"
    },
    {
        "full_article": "Bangladesh's labour market faces a paradox—while it has a young workforce poised for a demographic dividend, outdated training systems leave many unprepared for the Fourth Industrial Revolution (4IR). With 65 percent of the population in the working-age group, unemployment is rising, affecting around 24 lakh people, including 19.4 lakh youth. Nearly one-third of the unemployed hold higher education degrees, and unemployment is higher among highly educated women. Despite efforts by the Bangladesh Technical Education Board (BTEB) and the National Skills Development Authority (NSDA) to expand technical and vocational education and training (TVET), systemic challenges persist. Many graduates lack hands-on experience, and outdated apprenticeships hinder industry alignment. Employers prioritise experienced workers over TVET graduates, valuing practical exposure over formal qualifications. Without standardised training, workers lack advanced skills, hindering innovation and limiting industries from meeting international standards and driving growth.\nBangladesh's informal skilling system, based on apprenticeships, lacks formal validation and theoretical knowledge, limiting career growth. Institutes emphasise theory over practice, and outdated equipment hampers skill development. Low TVET perception and limited outreach deter students, while ad hoc training reduces adaptability. Integrating formal and informal systems is crucial for building a workforce ready for the 4IR.\nLearning from the German model\nThe German dual education model, also known as the dual vocational education and training (VET) system, which combines classroom learning and workplace experience, offers a potential solution for Bangladesh's TVET challenges. By fostering close collaboration between education and industry, this model ensures job readiness, aligns training with market demands, and enhances employer confidence. With 40 percent of Germans graduating from dual VET, the country has a 95 percent employment rate. For Bangladesh, adopting aspects of this model could help bridge the skills gap and prepare workers for the 4IR, boosting employment and economic growth.\nTo implement this system in Bangladesh, key sectors like manufacturing, IT, healthcare, and hospitality should be prioritised. A sector-specific curriculum must combine theoretical knowledge with practical skills that meet modern industry demands. Strong partnerships between educational institutions, the government, and private companies are vital. Businesses should offer apprenticeships, while schools provide theoretical training. A structured recruitment process must evaluate candidates based on both academic qualifications and aptitude.\nApprentices should receive both classroom and hands-on training, guided by industry mentors. Regular monitoring and feedback will ensure programme effectiveness, while graduates should receive industry-recognised certifications to improve employability. After a successful pilot phase, the programme can be scaled, expanding into new sectors and forming broader partnerships. Continuous refinement of curricula and training methods will keep the programme aligned with evolving industry needs.\nThe German dual VET system succeeds through collaboration. The government supplies skilled labour, reducing youth unemployment. Employers gain a tailored workforce, and vocational schools align curricula with industry demands. Society benefits from economic stability, innovation, and reduced unemployment, making dual VET a cornerstone of Germany's labour market success. Bangladesh can replicate this success to harness its youth potential and ensure sustainable economic growth.\nThe stakes are clear: capitalise on this demographic advantage, or risk squandering it. A robust VET system is key for Bangladesh to tackle unemployment and tap into its youth potential. By aligning education with industry needs, prioritising hands-on training and soft skills, and fostering collaboration, a dual VET model can build a skilled workforce, ensuring sustainable growth and long-term economic stability.\nTraining youth in the dual VET system may seem costly, but current skill development programmes often produce only semi-skilled workers, leading to high dropout rates. Institute-based training lacks real-world exposure, leaving graduates unprepared for industry demands. Despite years of investment, skilled worker shortages persist. Prioritising education is vital for national development. Implementing modern teaching methods, active learning, learner feedback systems, and soft skills development is crucial for Bangladesh's economic growth. Investments in education are a priority to build up any developing nation, and most importantly, implementing modern practices in teaching, learning, and assessment through active learning in the classroom, creating a system for learner feedback and inclusion of higher-order cognitive skills and development of soft skills in the curricula is crucial.\nS. M. Khaled Mahfuz is a development management professional working at Palli Karma-Sahayak Foundation (PKSF).\n\nAnika Nasrin is deputy lead of the education and skills policy team at the Youth Policy Forum (YPF).\nViews expressed in this article are the authors' own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "German apprenticeship model can transform our workforce",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/german-apprenticeship-model-can-transform-our-workforce-3892931",
        "news_paper_name": "The Daily Star",
        "publish_date": "13-05-2025"
    },
    {
        "full_article": "As the nation prepares for its first budget following the uprising, likely to be unveiled within a month, the latest findings from the International Budget Partnership's Open Budget Survey should serve as a wake-up call for the interim government. Bangladesh continues to languish near the bottom of global lists on budget transparency—ranking 37th among 125 countries in 2023, and trailing behind most of our South Asian peers, according to the survey. This confirms what we have long known: the persistent lack of openness and accountability in fiscal governance under the Awami League and previous governments, particularly in the formulation and implementation of budgets.\nIn fact, the whole process of budgeting, starting from the very onset, has been plagued by a top-down approach, with very limited public participation and almost ceremonial legislative engagement. For instance, while many countries publish pre-budget statements—outlining the broad parameters of fiscal policies, economic forecast, and anticipated revenue, expenditures, and debt levels—to encourage discussion, Bangladesh does not do so. Moreover, recommendations from experts are seldom reflected in the proposed or approved budgets, rendering public consultation and any parliamentary discussion futile.\nEqually alarmingly, important materials that can help guide public debate—such as simplified budget summaries, monthly implementation reports, and audit reviews—are either missing or delayed. This trend is deeply problematic. In the absence of meaningful public participation in the decisions affecting their lives—such as which taxes to levy, which services to provide, or how much debt to take on—the whole process becomes authoritarian. The lack of transparency and accountability inevitably fuels inefficiency, waste, and corruption.\nThe question is, how can we expect people to pay taxes faithfully when they do not properly know where their money is going—having had little engagement or impact in the budgeting process—or worse, when they suspect that it is being misused? We must not let this trend continue. The interim government has a chance to demonstrate a clear break from the past, setting the ground for greater budget transparency from future political governments. It must begin by publishing a pre-budget statement to initiate public discussion, and ensure public opinion is properly reflected in eventual decisions. The authorities should also strive to adhere to global best practices at every stage of this crucial public matter.\n",
        "headline_1": "Let this budget mark a break from the past",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/let-budget-mark-break-the-past-3892676",
        "news_paper_name": "The Daily Star",
        "publish_date": "13-05-2025"
    },
    {
        "full_article": "We are concerned about the plight of Chattogram city residents deprived of access to water from WASA. According to a report by Prothom Alo, despite WASA spending about Tk 8,800 crore since 2009 on eight water supply projects, about a third of the residents still struggle for safe water every day. Their number—considering the variations in population figures given by the Bangladesh Bureau of Statistics (BBS) and Chattogram City Corporation (CCC)—would be anywhere between 12 lakh and 21 lakh people, underscoring the severity of the problem. Without any supply from WASA, they are forced to rely on deep tube wells, purchased water, or nearby ponds and other water bodies, leaving them exposed to various risks.\nChattogram WASA has about 98,000 customer connections. Excluding those without WASA lines, the current daily demand is 560 million litres, while daily production capacity stands at 500 million litres. That means WASA is struggling to serve even those connected to its grid. The crisis, according to the above-mentioned report, is most severe in 10 wards: 1, 2, 10, 11, 18, and 37-41. Apparently, WASA connections simply don't exist in over 100 neighbourhoods.\nWhat's equally troubling is that WASA has no master plan to address the needs of a growing city even after six decades of operation. A comprehensive master plan based on accurate data and future projections could be useful in mapping out where pipelines are missing, how much water is required in each zone, and how many treatment plants must be built. Without such planning, the agency has been executing project after project in an ad-hoc manner, which is deeply troubling. We urge the Chattogram WASA to treat this issue with the urgency it demands, as access to safe water is a fundamental right.\nAs things stand, the first step towards resolving the crisis should be to develop a robust master plan. As experts have pointed out, this plan must account for future population growth, area-specific needs, and pipeline expansion to neglected zones. Moreover, given the questionable planning and execution of past projects, WASA must improve its project design and implementation capacity, and also address the mismatches in existing population figures so that everyone benefits from its projects and initiatives without exception.\n",
        "headline_1": "Chattogram Wasa must address the persistent water crisis",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/chattogram-wasa-must-address-the-persistent-water-crisis-3890941",
        "news_paper_name": "The Daily Star",
        "publish_date": "13-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 13, 2025 00:00:00  \nThe warning is dire for Bangladesh. Renowned economists of the country have sounded the alarm bell ringing not for nothing. At a book launching ceremony in the city, they have emphasised the urgency of undertaking economic and institutional reforms because failure to meet the numerous fresh challenges---internal and external---can prove to be an 'existential threat'. With the dwindling or disappearing privileges of LDC status such as concessional finance, preferential trade access and aid, the country will have to navigate a rough terrain of international trade and investment regime, if not a hostile one. In fact, some of the symptoms of what is to come have already been there with the bargain over the fourth and fifth tranches of IMF loan and the fallouts of an armed conflict between India and Pakistan. \nIf the Covid-19 and the Ukraine war that started at a crucial time of global economic recovery first exposed the vulnerability of countries like Bangladesh to external economic and trade-related shocks, their management of internal affairs is no less responsible for the economic downturn they now suffer. Bangladesh, in particular, has faced a double whammy with the oligarchic clique of the time looting huge amounts from the country's banking channel for laundering those abroad. So what has really gone awry could happen because of policy failure and a lack of institutional development. Lutfey Siddiqi, special envoy on international affairs to the chief adviser, finds a paradoxical arrangement between the capitalist or private sector-led economy the country is pursuing and the structure based on socialistic or communist planning model. This assertion certainly demands further explanation. True, the bureaucratic red tapes at several points hinder the freedom free market economy usually allows for business but this cannot be termed a communist system of centralised planning of economic system. The bureaucratic stumbling blocks had to be maintained in the interest of commissions on big-budget development expenditure and bribe for approval of trade-related activities. \nIt is good to know that the interim government has processed 150,000 permits under the new National Single Window system and soon all the 19 required departments are set to be integrated together. Well, this will spare the businesspeople and entrepreneurs the hassle and delay they had to suffer and ease doing business to some extent. But there are other conditions integral to the system like the law and order, particularly the rent-seeking environment still prevailing. If the parasites cannot be eliminated, businesses will never be transparent and orderly. The example of a garment manufacturer Siddiqi cited to show the vicious practice of rent-seeking speaks volumes for the business environment here. Operating in both Bangladesh and Vietnam, the garment manufacturer pays 40 per cent more to Vietnamese workers and still the operation there is more profitable. \nSo, law and order has to be drastically improved to make comparable payments for Bangladeshi workers conditional to their Vietnamese counterparts. In an environment of lawlessness, mere simplifying business procedures will not convince investors to lay their money. Better it would be to start the process at home. The state-owned enterprises proving white elephants can be disbanded or privatised within a given time frame. The bottom line here is to streamline manufacturing and business along with raising efficiency and productivity to stay in competition.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Urgency of economic and institutional reform",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/urgency-of-economic-and-institutional-reform-1747063483",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       May 13, 2025 00:00:00  \n\nGreek dramatist Aeschylus, who died in 456 BC, said, \"In war, truth is the first casualty\".\nLater, in 1917, U.S. Senator Hiram Johnson, made the same observation by saying \"The first casualty when war comes is truth.\"\nIn a parallel universe, where sanity isn't lost to jingoism and anchors aren't screeching war cries, the media on both sides of the border would attempt to act as a communication bridge and simmer down tensions in a volatile situation.\nUnfortunately, the media landscape during the very recent conflict between India and Pakistan revealed the exact opposite. Journalism -- which should have served as a beacon of truth, context, and restraint -- instead descended into a pit of misinformation, war-mongering, and propaganda. The loudest voices were not those of facts, but of fury.\nTruth, predictably, was the first casualty.\nGood journalism relies on facts, not fiction. It questions authority, investigates claims, and seeks to present multiple perspectives. In times of conflict, when emotions are high and the stakes even higher, the media's responsibility is not to add fuel to the fire but to seek clarity and reduce misinformation. It must try to obtain both sides of the story, particularly when misreporting can trigger panic, miscalculation, and catastrophic escalation.\nAccording to the Handbook on Conflict-Sensitive Journalism published by the Friedrich Naumann Foundation, the media in conflict zones must build consensus, correct misconceptions, and humanize the \"enemy.\" Yet during the recent India-Pakistan military confrontation, both countries' media establishments did the opposite -- actively spreading misinformation, dehumanising the other side, and amplifying state propaganda without scrutiny.\nNow, let's us see how Indian media compromised the truth. The incident of downing of fighter jets was totally absent in mainstream Indian media for 24 hours when the entire world was talking over the issue. The Hindu, reputed Daily posted it on its online but that was vanished later.\nFollowing Pakistan's reported air raids and the confirmed downing of Indian jets on May 8, Indian mainstream media was quick to spin the narrative. Before facts could even be verified, television channels had launched their \"Breaking News\" marathons, complete with explosive visuals, patriotic music, and hashtags like #IndiaStrikesBack and #PakistanPayBack.\nSeveral Indian outlets went so far as to report entirely fabricated victories. Made-up airstrikes, false claims of Pakistani casualties, and exaggerated narratives of Indian military dominance flooded TV screens and social media feeds. The tone was not investigative or cautious -- it was triumphalist, dismissive, and in some cases, disturbingly gleeful about the prospect of war.\nThis wasn't journalism; it was theatre.\nMany media outlets appeared more interested in covering the loss of face associated with the downing of India's much-hyped Rafale fighter jet -- embroiled in domestic corruption scandals -- than in verifying what had actually occurred. Just as international reports were confirming the shooting down of Indian jets, a tidal wave of Indian media content aimed to save face: through exaggerated victories, rhetorical aggression, and a whitewashing of military setbacks.\nIt begs the question: was all this just about ratings? Maybe. But it is more likely part of a psychological operation to rally domestic support, distract from uncomfortable truths, and maintain political dominance. What was left behind was not just the truth, but credibility -- both domestically and in the eyes of the international community.\nIf Indian media was busy scripting imaginary victories, Pakistani media was busy crafting its own reality. Numerous fabricated claims made rounds on social media and state-friendly media platforms.\nSeveral Pakistani social media accounts claimed that the Pakistan Army had intercepted an Indian drone in Gujranwala. The image circulated with the claim was exposed as fake by India's Press Information Bureau (PIB); it had been lifted from an unrelated, older event.\nIn another case, viral videos emerged claiming a Pakistani strike had destroyed a military base in Amritsar. These were soon debunked -- the footage in question was from a 2024 wildfire, and had nothing to do with the conflict.\nEven old war footage was recycled. A 2019 video showing Pakistani soldiers raising a white flag to retrieve the bodies of fallen comrades was repackaged to claim it was Indian soldiers at the LoC doing the same. The aim? To portray weakness, humiliation, and moral victory -- not truth.\nThe Pakistani media's eagerness to push state narratives -- even when false -- was matched only by its failure to critically assess the cost of such disinformation. Instead of responsibly informing citizens and urging caution, the media whipped up nationalistic pride and falsely framed events to favour psychological dominance.\nPakistan, like India, has suffered from state-controlled narratives being echoed uncritically by most of its major media houses. This symbiotic relationship -- where the government uses the media for its propaganda goals, and the media rides the wave of nationalism for viewership -- creates a dangerous echo chamber.\nMisreporting in wartime doesn't just distort public opinion -- it can kill. In an era of nuclear weapons, misinformation can lead to catastrophic decisions taken in the heat of public pressure. It reduces the space for diplomatic de-escalation and encourages tit-for-tat responses that can spiral out of control.\nAdditionally, both governments and media houses appear oblivious to the potential backlash when the truth eventually emerges. A public that has been fed a steady diet of triumphant lies will eventually realise it has been misled. This not only damages the credibility of the media but also weakens public trust in institutions and sows long-term cynicism.\nThe May 8-9 conflict is now etched as a textbook example of media failure during wartime. Yet, it must also serve as a wake-up call. Media in both countries must return to the foundational principles of journalism: to inform, not inflame; to verify, not amplify; and to speak truth to power, not echo it.\nJournalists must ask: Whom do we serve -- the people or the powers that be? In war, the cost of getting it wrong is not limited to ratings or reputation. It is measured in lives, in lost opportunities for peace, and in hardened narratives that may take generations to undo.\nBoth Indian and Pakistani citizens deserve better. They deserve to be informed truthfully and responsibly, especially when their lives and futures may hang in the balance.\nAs Friedrich Naumann Foundation's Handbook on Conflict-Sensitive Reporting states, the media must be a force for clarity, peace-building, and empathy during conflicts. That begins with humanising the other side, not dehumanising them. It begins with seeking facts, not fabrications. And it begins with accepting that war is not a spectacle to be rated, but a tragedy to be avoided.\nIn this war of narratives, let us not forget that truth must never be collateral damage.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Indo-Pak war: Journalism vs jingoism",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/indo-pak-war-journalism-vs-jingoism-1747063541",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       May 13, 2025 00:00:00  \n\nChief Adviser (CA) Dr Muhammad Yunus is scheduled to lay the foundation stone of the much-anticipated Kalurghat Rail-cum-Road Bridge on the River Karnaphuli on May 14 next. The 700-metre double-track and double-lane bridge will replace the existing 93-year-old single-lane rail-cum-road bridge. This Tk. 115.6 billion bridge project is expected to be completed by 2030.\nInterestingly, the foundation plaque of the bridge will not bear the name of the CA as the inaugurator of the project, so said the Bangladesh Railway (BR) people related to the project. It could be further learnt that as directed, BR has not included the name of the CA on the foundation stone. The plaque will be carrying the name of the project's executive agency only. In this case, it is the BR. It is no doubt a commendable precedent being set by the CA.\nNow, will politicians who might come to power through election in the future care to take their cue from this modest example being set by the CA? If they remember and try to follow the CA's example, it will spare the officials of such projects a lot of hassle, money, time and energy. In every big project inauguration in the past, the wastage involved was never questioned. It was considered part of the project. Consider the case of inaugurating the Padma bridge project during the autocracy on June 25, 2022. How much did that inauguration ceremony cost? According to an estimate, it was approx. Tk. 89 crore or Tk.890 million. Why was that extravagance necessary? But who would dare to ask that question at that time? \nIt was an extreme case of how far such unnecessary ceremonies can go at the expense of the public exchequer. The massive Padma Bridge project is worth USD3.868 billion or Tk.30,770.14 crore. Though the project cost was borne by the Bangladesh government itself through taking loan from the Bangladesh Bank, the country's central bank, each taka spent was the public's tax money. So, spending that money with abandon to massage someone's ego harks back to the era of medieval kings and queens. During the autocracy, the inauguration culture was rampant to such an extent that different government ministers and party-leaders lost no opportunity to inaugurate something and unbridled rent-seeking by party goons was the standard practice to finance such occasions. Evidently, these were instances of excesses committed during the autocracy. But the culture of inaugurating various buildings and other infrastructure by ministers or government high-ups with fanfare was also a common practice during all previous governments, democratic or otherwise.\nActually, the culture of inauguration with ceremony has a legacy whose origin can be traced back to the colonial past. During that time, the source of colonial master's money was forcible collection of tax from their subjects. They built various infrastructures with that money to suit their purpose. Obviously, the subjects of the colony could not question their masters who had many idiosyncrasies. But when the master left, many local sahibs inherited some of their habits. Love of ceremonial inauguration is one. About a century has passed since the British colonialists left the subcontinent. Meanwhile, the people within the political boundary called Bangladesh experienced their independence twice. Even so, many political leaders as well as government servants have remembered many of the old practices through generations. We believe, the CA of the interim government with his example has tried to facilitate a decent burial to a wasteful tradition. What is more, this tradition has no right to exist for the simple reason that the expenditure made for the purpose is taxpayer’s money. If the July uprising means change, lavish inauguration culture should go.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Wasteful inauguration culture",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/wasteful-inauguration-culture-1747063615",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 13, 2025 00:00:00  \n\nOne of the key drivers of human progress is the acquisition of knowledge, and a primary tool for nurturing that knowledge is the habit of reading. Libraries serve as institutions where this knowledge is preserved and made accessible to readers. In developed nations, libraries are considered integral to education. Despite the rise of the internet and digital technology, the relevance of libraries in fostering genuine intellectual growth remains profound.\nCountries like the United States, the United Kingdom, Japan, and Germany prioritise their library systems. They ensure public access to well-equipped libraries offering not only books but also research databases, digital archives, and quiet study environments. From an early age, students in these countries are encouraged to visit libraries, instilling in them a lifelong reading habit.\nIn contrast, the state of libraries in Bangladesh is far from encouraging. While urban centres host some government and private libraries, rural areas remain largely deprived of such facilities. Many government libraries lack updated collections and fail to offer an engaging environment. Although educational institutions are required to maintain libraries, in practice, many fall short of fulfilling their intended role.\nTo address this, both government and society must step forward. School and college libraries need modernisation. Initiatives like book fairs and community reading circles can spark interest in reading. Moreover, expanding access to digital libraries can help overcome geographical and infrastructural barriers.\nTo build a knowledge-based society, there is no alternative to cultivating the habit of reading. This should go beyond exam preparation and contribute to mental and creative development. Strengthening the library system, as seen in developed nations, can pave the way for a more enlightened and progressive future generation in Bangladesh.\nMaliha Mehnaj\nStudent, Institute of Education and Research\nJagannath University, Dhaka\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Libraries as catalysts for development",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/libraries-as-catalysts-for-development-1747063650",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-05-2025"
    }
]