[
    {
        "full_article": "In the aftermath of the gruesome terror incident in Pahalgam, India must hear clearly the message emanating from those who committed the heinous crimes. By targeting tourists by religion and killing them in cold blood, the terrorists have sought to undermine India’s plurality and what the country stands for. By killing a local Kashmiri who tried to help the hapless tourists, and by targeting people in a popular location that benefits the Kashmiri economy, the attackers have grievously harmed the livelihoods of thousands of Kashmiris dependent on tourism. By choosing to attack unarmed tourists at a time when the U.S. Vice-President was visiting India, they have also sought to undermine the perception that economic activities had returned to normalcy after the tumultuous period following the abrogation of special status for Jammu and Kashmir. The tragic by-product of the killings is now fear of the possibility that such attacks on tourists may recur, and of the economic pain that this would cause ordinary Kashmiris. New Delhi’s and Srinagar’s responses must keep these in mind and work towards the mitigation of fear and send a clear message — the people of India, including Kashmiris, are united against terror.Following the attacks, New Delhi has sought to use strong diplomatic measures available in its arsenal against Pakistan, as it is well known that such terror attacks are almost always carried out by radicalised elements who are trained by Islamabad’s covert agencies. As it turns out, the mere absence of spectacular violence cannot be termed normalcy. Normalcy is a relative term and it is better experienced than announced. While the large-scale violence and militancy that was seen in the 1990s never happened despite the unpopularity of these decisions, the uneasy calm was reflected in the sporadic incidents of terrorism targeting Kashmiri Pandits, migrants, and security forces in new areas that were hitherto bereft of militancy. With significant curbs on political activity, there was little outlet even for demands related to governance for the citizenry. The conduct of Lok Sabha elections and the Supreme Court-mandated Assembly election process allowed for some expression of voices in the Valley, but it is a stretch to say that this was “normalcy”. The Union government must work in concert with the Jammu and Kashmir government, empower Jammu and Kashmir by restoring Statehood, and assert this cohesion to isolate radical and violent elements threatening the livelihoods of Kashmiris and the lives of tourists visiting the serene valley. Published - April 25, 2025 01:48 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Jammu and Kashmir\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025",
        "headline_1": "Sent messages: On Jammu and Kashmir post Pahalgam terror attack",
        "headline_2": "New Delhi must act in concert with Srinagar to isolate terrorists",
        "link": "https://www.thehindu.com/opinion/editorial/sent-messages-on-jammu-and-kashmir-post-pahalgam-terror-attack/article69487987.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "25-04-2025"
    },
    {
        "full_article": "The Supreme Court’s remark on April 23, asking Tamil Nadu Minister for Electricity, Prohibition and Excise V. Senthilbalaji, who has been out on bail since September 2024 in an alleged money laundering case, to choose between his post and freedom was expected. In the last four months, the Court used strong language against the Minister on more than one occasion. Last December, the Court expressed its objection to the return of Mr. Senthilbalaji to the Cabinet a few days after it granted him bail. On March 24, it took a dim view of the lack of response from him to its question raised on February 12 over his continuance as Minister. Mr. Senthilbalaji, in all likelihood, would have anticipated what the Court said now. That two senior advocates, Kapil Sibal and Mukul Rohatgi, and an advocate for the Minister, had to persuade a Bench of Justices A.S. Oka and Ujjal Bhuyan not to issue an interim order till Monday (April 29) is no common event in any court of law, let alone the Supreme Court. The observations of the Bench that it had been a “mistake” in granting him bail and that the conduct of the Minister was “dishonest,” and the statement of Justice Oka to Mr. Sibal that “you [Mr. Senthilbalaji] will ensure that no witness comes to the box”, reflect concerns that a Minister could tamper with evidence and influence witnesses. Clearly, Mr. Senthilbalaji would have done himself a favour by not returning to the Cabinet.Even now, it is not too late for him to resign. If he does not, Chief Minister M.K. Stalin would be forced to act against him. What is at stake is not just the continuance of a Minister, but propriety. After all, the Court had granted Mr. Senthilbalaji bail not on merits, but on the ground that he had undergone an incarceration of one year as an under trial in the case. When it had not given him a clean chit in the first instance, his re-induction into the Cabinet has naturally become a subject matter before the Court, regardless of the correctness or otherwise of the Minister’s claim that “there is not even a whisper of violation of any bail condition.” On September 28, 2024, at the time when he was granted bail, The Hindu had pointed out that “the cause of justice for the victims of the job scandal and a fair trial for the accused would be served well if Mr. Stalin avoids inducting Mr. Senthilbalaji again in his Cabinet until he is cleared of the charges.” The point still holds. Mr. Senthilbalaji should not risk the ignominy of getting dropped from the Cabinet on the recommendation of the Chief Minister. Published - April 25, 2025 01:37 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Dravida Munnetra Kazhagam\n                    \n                            /                      \n                        \n                        state politics\n                    \n                            /                      \n                        \n                        ministers (government)",
        "headline_1": "Power and freedom: On the Senthilbalaji case",
        "headline_2": "At stake is not the continuance of a Minister but propriety",
        "link": "https://www.thehindu.com/opinion/editorial/power-and-freedom-on-the-senthilbalaji-case/article69487993.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "25-04-2025"
    },
    {
        "full_article": "Pak response isn’t much. Kashmiris have condemned terror. Ensure they aren’t targeted outside J&K\nPredictably, Pakistan responded on Thursday to India’s retaliatory measures post the Pahalgam terror attack. Unsurprisingly, given that Pakistan has very few cards to play, its responses don’t amount to much. Take the statement that all bilateral agreements, including the 1972 Simla accord, will be in abeyance. But the accord didn’t prevent Kargil or multiple ceasefire violations by Pakistan. Pakistan’s army has repeatedly violated the sanctity of LoC. So, if Islamabad is now saying there’s no recognising an LoC anymore, it hardly makes any material difference to India. True, suspension of the Indus Waters Treaty by New Delhi has limited near-term punitive power. But as one of our OpEd columnists points out, suspension of the treaty can potentially be very costly for Pakistan. That’s not the case with India vis-à-vis anything Pakistan threatened. What’ll happen from here on is impossible to predict. But whatever happens GOI has an urgent job at hand.\nIt needs to get to the bottom of the intelligence/security lapses that gave free entry and exit to Pahalgam terrorists. The point is not that there should be additional army boots on the ground in J&K. It’s impossible to post security personnel in every tourist attraction or bazaar in Kashmir. The only thing that can thwart Pahalgam-style attacks is an intelligence network that feeds credible information to security forces. The best intelligence systems still rely on quality human intelligence or HUMINT. For that, any force needs some level of connect with at least some sections of locals. It’s relevant here to note that many Kashmiris have openly and clearly condemned the Pahalgam terror attack. Pakistan’s terror planners had clearly hoped that the incident would engender communal discord and reopen fissures in J&K. Instead, from north to south Kashmir, schools, colleges and shops remained closed in protest against what they termed as “murder of Kashmiriyat”. But this message needs to be reciprocated by the rest of India – govts everywhere must take the strictest of actions against groups that harass Kashmiris.\nTo the extent this shows that more Kashmiris today are becoming genuine stakeholders in the normalisation process, it’s good news for Indian intelligence agencies. Note here that Kashmiriyat thrives only in democratic India, not in PoK where Islamabad has carried out ethnic cleansing and engineered demographic change. Therefore, GOI and the entire security apparatus must leverage this moment to quietly seek the support of Kashmiris to strengthen HUMINT. If Kashmiris’ response to Pahalgam stays as it is, the battle against terrorism may get just a little easier.\n\n",
        "headline_1": "LoC isn’t key",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/loc-isnt-key/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-04-2025"
    },
    {
        "full_article": "We no longer want to wait for what we want – we want it immediately, if not sooner\nIn the India where I grew up, patience wasn’t a virtue but a necessity. Wanted a landline phone, the only kind available? Put in an application and wait for a couple of months to get one. A car, one of the only three brands on offer? Get in line and wait for anything up to six months for your turn.\nWanted to know your bank balance? Go to the bank, collect a numbered token from a cashier, wait for your number to be called, and get your passbook updated.\nWhatever you wanted required a lot of patience and waiting time. In the India of then, everything was in short supply, including cash (there were no credit cards). You had to wait, and save up to get what you wanted. You had to learn patience, defer gratification.\nAs a result, when you did get something, you hung on to it for as long as you could. Refrigerators, watches, even clothes, became family heirlooms, passed on from one generation to the next.\nThe India of then has been transformed, unrecognisably, into the India of NOW! In capital letters and with an exclamation mark. Roadside kiosks advertise a choice of quick-delivery apps that can bring home to you anything, from an ice cream, to a fridge, or a fashion accessory, within scant minutes of your placing your order on your mobile phone which, thanks to your handy credit card, you also got the instant you wanted it, which was NOW!\nThe India of NOW!, of instant gratification, has also changed the emotional value we attach to things, assigning greater desirability to the new in preference to the old, be it the latest mobile phone that takes the best selfies, the trendiest of skinny jeans, or the newest laptop, bought instantly on a zero-interest EMI scheme offered by your neighbourhood electronic dealership.\nThe old mobile, jeans, laptop? Donate them to a deserving charity, otherwise known as the raddiwala.\nIt’s goodbye to patience, goodbye to the old, in the good buy of India NOW!\n\n",
        "headline_1": "India NOW!",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/india-now/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-04-2025"
    },
    {
        "full_article": "Taking Chrome from Google is lazy regulation. Getting Google to play fair in its ad biz is smart\nWhen ChatGPT debuted late in 2022, pundits predicted the decline of Google Search. Google’s own engineers were alarmed, because if a chatbot gave clear and concise answers to everything, who would click on advertising links? But almost 30 months later, Bank of America’s research shows daily visits to Google Search are stable, bringing in $198bn – 57% of Google parent Alphabet’s revenue – in 2024. Therefore, it’s interesting that as the US Department of Justice (DoJ) pursues a monopoly case against Google, ChatGPT has evinced interest in buying Chrome browser, the primary way to access Google Search.\nGlobally, Chrome – which comes bundled with Android, the most popular mobile OS – had 66% of the browser market last month. Apple’s Safari browser came next with roughly 18%, but Google is its default search engine also. Alphabet ensures this by paying Apple billions – $20bn in 2022, for example. With about 90% of all searches made on Google, charges of monopolisation are understandable. However, the wisdom of breaking up a company to ensure competition is questionable. DoJ had famously tried to push Microsoft to bundle its rival Netscape Navigator browser with Windows in 1998. Bill Gates likened it to Coca-Cola including three cans of Pepsi in every six-pack. Six years later, that high-profile case ended with a whimper. Microsoft never split.\nMonopolies are no doubt bad for the business ecosystem. While Google, fairly or unfairly, controls online search and advertising, Apple has faced monopoly charges for its App Store fees. Its fight with ‘Fortnite’ maker Epic is back in court. And regulators should step in when dominant players use their position to charge extortionate rates, or throw dissenting partners off their platforms – something that affects content providers, for example, and to mitigate which Google and Facebook have struck deals with those companies. But breaking up big firms is not the answer. Eventually, it wasn’t DoJ but the iPhone in 2007 and Chrome in 2008, and Android phones thereafter that reduced Microsoft’s might. \n\n",
        "headline_1": "It’s not the size",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/its-not-the-size/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-04-2025"
    },
    {
        "full_article": "India can make things difficult for its terror-sponsoring neighbour via a number of hybrid actions, writes a former Lt Gen who served in J&K.\nJust when Kashmir was anticipating its most successful tourist season ever, Pakistan and its proxies struck normalcy a terrible blow. With its CCS decisions yesterday, including putting the Indus Waters Treaty in abeyance and closing the Attari checkpost, India has begun responding to the vicious Pahalgam terror attack.\n\nThere have been several attacks on civilians through the 36 years that the sponsored proxy conflict has raged in J&K. But this attack seems to bear something more venomous than usual.\nRead the full story on TOI+.\n\n",
        "headline_1": "Pahalgam & Pakistan",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/pahalgam-pakistan/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-04-2025"
    },
    {
        "full_article": "Amid persistent economic struggles as well as efforts to remove barriers deterring businesses from investing and expanding in the country, there is no alternative to ensuring a smooth take-off of the much-anticipated third terminal of the Hazrat Shahjalal International Airport in Dhaka. Built at a cost of over Tk 21,300 crore, the terminal is being touted as a milestone for Bangladesh's aviation sector, with the planning adviser recently underscoring its potential to make the airport a regional hub. For this promise to materialise, we must ensure the project doesn't falter on operational readiness, particularly with regard to customs and cargo handling.\nWith over 99.5 percent of the construction work already completed, the terminal is technically close to the finish line. However, a recent letter from the Customs House Dhaka to the Civil Aviation Authority of Bangladesh (CAAB) has raised concerns about a number of issues related to its infrastructure, security, and operational aspects, according to a report by this daily. For example, a key concern raised by the inspectors involves the customs hall, which they say is too narrow with a low ceiling and a capacity of only 300, despite an expected influx of 7,000 to 8,000 passengers at peak hours. This may result in heavy congestion, slow clearance, and poor ventilation. After the terminal's full-scale opening, expected in early 2026, it is estimated that the annual passenger handling capacity of the airport will rise to 2.4 crore from 80 lakh at present.\n\nA key concern raised by the inspectors involves the customs hall, which they say is too narrow with a low ceiling and a capacity of only 300, despite an expected influx of 7,000 to 8,000 passengers at peak hours. This may result in heavy congestion, slow clearance, and poor ventilation. After the terminal's full-scale opening, expected in early 2026, it is estimated that the annual passenger handling capacity of the airport will rise to 2.4 crore from 80 lakh at present.\nCustoms officials have also flagged several issues related to cargo handling. Among them is the lack of designated warehousing for seized or high-value goods, which poses risks of theft, misuse, and smuggling. The placement of the duty-free shop immediately after immigration, without adequate surveillance or access control, also risks revenue leakage. Moreover, the lack of designated space for scanners, physical examination of baggage and consignments, and diversion routes for high-risk baggage may emerge as another big problem, especially given the expected doubling of cargo throughput once the terminal goes live. These and other such inadequacies could further contribute to security risks, unnecessary delays, and even tax evasion.\nWhile acknowledging these shortcomings, the relevant authorities have said that it is not possible to alter the existing infrastructure now, so they are focusing on workarounds as alternative solutions. But the need for resolving these issues cannot be stressed enough either, especially for the sake of a safe, uninterrupted operation of the terminal. We, therefore, urge the authorities to seriously consider the recommendations given by customs inspectors and find ways to implement them.\n",
        "headline_1": "Take steps to ensure smooth take-off of the third terminal ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/take-steps-ensure-smooth-take-the-third-terminal-3879496",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-04-2025"
    },
    {
        "full_article": "Since Prof Muhammad Yunus took over as the head of the interim government, reforms have been very high on the national agenda. The whole country wants it. What is heartening is that even political parties, who are usually opposed to anything that does not originate from them, have worked closely with all the reform commissions and are now engaged in reaching a consensus.\nHowever, one vital area has been left untouched in this discussion: reform of the political parties themselves. The nature, transparency, accountability, and inner democracy of political parties in Bangladesh determine the type of democracy and good governance they would be able to deliver. In fact, it greatly influences the society we end up with. The nature of the political parties who get elected determine to a large extent how the parliament, judiciary, and all its statutory bodies operate. They greatly influence the bureaucracy, almost all government institutions, the budget and its implementation, big business deals, etc. Very importantly, they control whatever oversight functions that are in the constitution.\nThere can be no denying the fact that one of the reasons behind the dismal state of democracy and governance in Bangladesh is directly related to the absence of internal democracy and public accountability in its political parties, especially of top party leadership.\nFrom 1991, which marked the fall of Ershad and restoration of democracy, to 2024—a period of 33 years—we have had either the Bangladesh Nationalist Party (BNP) or the Awami League (AL) ruling the country, with two years of military-backed caretaker rule in 2007-2008. BNP ruled us for 10 years and a few months—one term in partnership with Jamaat—and AL ruled us for 21 years, the last 15 of which were uninterrupted, also with some partners who enjoyed ministerial positions but hardly any significant policy-framing roles.\nToday, BNP is the party that everyone is looking at, talking about, and trying to understand better. History has opened doors for it that nobody expected so soon. In a free and fair election, BNP is most likely to emerge with the largest number of seats in parliament, not only for its wide acceptance but also for the massive rejection of its main rival, the Awami League. Hence, our focus today is on the party which is likely to significantly affect our future and on the person who is its second-in-command, Tarique Rahman.\nNow is the most opportune moment for the BNP to emerge as a modern, democratic, innovative, and future-oriented party that fits in with the new aspirations of the people, especially the youth, and the needs of the 21st-century. The questions that rise in the public mind are: what sort of government will the BNP deliver? Are they fully aware of the aspirations of the people today, especially the youth? How much of democracy, accountability, fair play, and openness will this party present us with? Will it tolerate free media? The most asked question is: what sort of a leader will Tarique Rahman turn out to be? These questions are being raised not by the \"enemies\" of the BNP, but those who sincerely wish them well.\nStudents and their new leadership are absolutely right when they say that unless the constitution is amended, dictatorial tendencies will re-emerge. What we want to add is that amending the national constitution is eminently justified but hardly enough. It will have to be accompanied by changes in the constitution of political parties. This especially applies to the BNP as the party at the doorstep of power. We have carefully studied BNP's 31-point reform proposal titled \"An Outline of the Structural Reforms of the State.\" As the document states, it is a reform proposal of the \"state.\" Some of the points in the proposal are very farsighted and highly relevant. Suggestions of the formation of many \"commissions\" reflect what the interim government has undertaken. However, the proposal totally avoids any question of the reform of the party, which is highly centralised with all authorities concentrated in a single hand. As we have seen from experience—and BNP should, too—without intraparty democracy and accountability, it cannot deliver democracy and accountability in the governance process.\nThe reality is that the existing BNP party constitution makes the chairperson a repository of unquestioned and unquestionable powers. Under Section 1, \"Duties, Powers, and responsibilities of the Chair…\" the document says, \"As the chief officer of the party, the chairman shall control, supervise and coordinate all activities of the party and for that purpose shall have the authority over the National Council, National Standing Committee, National Executive Committee, Subject Committees and other Committees nominated by the chairman and shall do control, supervise and coordinate their functions.\" Section 4 says, \"The Chairman may dissolve the National Executive Committee, the National Standing committee… and other committees nominated by the chairman and reconstitute them….\"\nBNP's constitution gives all power to the chairperson, making him or her answerable to no one.\nSeriously, can such a party run democratically? Do its values depict those of democracy? Can't there never be any dissent within? When such a party wins a majority in parliament, what will be the nature and functioning style of that government? It will totally be \"top-down,\" and the top being only one person.\nHow will the parliament function when such a party commands majority? We know because we saw such a party in power, and we lived under its rule and suffered immensely. If there is no scope for a party activist ever to question a decision made by the party chief, and if the future of that person totally rests on the party boss, will anybody ever dare to dissent? Will such unchallenged powers not give rise to dictatorial mind-set that will most likely find fruition in near future. And if such a party wins majority in parliament and forms the government, won't it be a one-person government, a one-person parliament, a one-person everything? Again, we have seen it, lived under it, and suffered. Can the BNP ignore the widespread demand that we should eliminate all traces of such a possibility recurring? Is it wise for it to do so?\nWe commend Tarique Rahman and BNP for already showing some positive signs in this direction. (I find his speeches sensible and mature. What he said on Wednesday about \"seeking reforms and not revenge on his oppressors\" is highly praiseworthy. He seems to have made the best use of his forced exile in the UK. I also express my appreciation for the use of language both by him and BNP Chairperson Khaleda Zia. The humiliation and injustice inflicted on them by the Awami League and Sheikh Hasina personally could have easily triggered a very justifiable vilification of the latter. Both of them refrained from that and gave political discourse a new dignity and set an excellent precedent). Tarique Rahman's proposal of setting a two-term limit with further re-election prospect after a gap is better than what we have now. His openness to curtailment of PM's power and enhancement of that of the president is also welcome. The idea of an upper house is a refreshing change, but its membership should be proportionate, otherwise it will be a rubberstamp of the lower house preventing it from giving the government guidance.\nHowever, all of the above changes will be mere cosmetic if the real power does not shift.\nHere lies the strong logic for the posts of the PM, the party leader, and the leader of the House not being occupied by the same person. Even if the first two are the same, the PM and the party leader must be separate. Running the party and running the government must be in separate hands. Such a system helps the growth of leadership, assists the PM to be exposed to other views, and alerts them to be sensitive to the party's thinking. Otherwise, it is a one-person show that leads to massive misuse of power, which sometimes the over-empowered leader does not even know.\nTarique Rahman must fully grasp the uniqueness of his opportunity and the complexity of his challenges. We request him to objectively see the existing party power concentration in his hands and create avenues for expression of alternative and even dissenting views within the party structure without any threat to the person or the group concerned. Arguments may be put forward that such a scope will create disciplinary issues. Yes, they may, but without it, the party will be a sterile institution devoid of creativity, vibrancy, and in time filled with sycophants. We saw that happen to the Awami League leading to its detachment from the people. Sheikh Hasina not only destroyed government institutions, she also destroyed her party which had such a rich history and legacy.\nBNP must learn from AL's mistakes. Tarique Rahman is making some timely decisions, and introducing intraparty democracy should be one of his goals.\nMahfuz Anam is the editor and publisher of The Daily Star.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The elephant in the room no one is talking about",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/the-third-view/news/the-elephant-the-room-no-one-talking-about-3879356",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-04-2025"
    },
    {
        "full_article": "Few men sitting thousands of miles away, on another continent, with no direct ties to a country's political parties, can have a significant impact on a revolution, challenge state narratives, and shape public perception in ways unimaginable just a decade ago. Their words can now be amplified by social media algorithms and reach millions in an instant, able to rally support, create dissent, and shift political discourse in almost real-time. This is not a hypothetical scenario anymore; it is our current reality. The recent wave of political awakening, the July uprising in Bangladesh, was heavily fuelled, in part, by various independent digital influencers who dissected state affairs, criticised government decisions, and reshaped public conversations, all without setting foot in the country.\nThis is the power of digitalisation. The internet, once a mere repository of information, has evolved into the most formidable arena for political engagement, where narratives are created, contested, and reshaped in real-time.\nIn today's world, the internet has become an interwoven part of our lives. We are consistently spending a significant portion of our waking hours online. A fundamental shift in human behaviour through the way we communicate, engage, and interact, is being witnessed. A new societal standard has emerged where the internet is the primary source of news, education, and information.\nThe smartphone has taken centre stage as the first point of contact for knowledge, socialisation, and work. Online meetings have replaced many in-person interactions because they are often more convenient. The time saved from not having to prepare, travel, and for physical meetings makes virtual alternatives the preferred choice. This trend has created a digital landscape where industries thrive, relationships form, and opinions shape without the need for physical presence. We are living in a digital society, and the younger generation is driving this transformation at an even faster pace.\nThis change is especially noticeable in the political sphere. Conventional methods and policies are finding it difficult to adjust to this new reality. Political parties that only use conventional strategies, like offline outreach and live rallies, are losing ground. On the other hand, those who utilise digital platforms in addition to real-life rallies are gaining traction and interacting with the public more successfully.\nAn effective illustration of this phenomenon is the July uprising. In recent years, numerous affiliated political parties have made several attempts to mobilise the populace in favour of governmental reform, democratic reforms, and sometimes for their own interests. These attempts, however, were mainly unsuccessful in organising any noticeable masses. However, what established political parties were unable to accomplish for years, a small group of students somehow succeeded in doing.\nThese students resonated with the public because they operated masterfully in the space where most people now spend their time—online. They spoke the language of the digital generation, understood their concerns, and connected with them on platforms that mattered. While jobs and family responsibilities dominate everyday life, the online world has now become the primary space where people engage in discussions, form opinions, and participate in movements.\nBy unlocking this digital space, the student-led movement was able to unite people around a common cause and translate online momentum into real-life action on the streets. Digital presence was not the only winning factor, but it was indeed a great amplifier to keep the momentum of the uprising going.\nNow it doesn't necessarily mean that the value of the old-school on-the-street politics is dead. We cannot forget that despite a large amount of dissent being expressed against the previous government online, the mass people had to come to the streets to actually see the end of the regime. This goes to show that the online presence of the new youth political leaders shouldn't divert them from learning the tricks of the street. If they wish to move forward towards long-term leadership, they will also have to learn quite a bit of the traditional political culture of Bangladesh.\nThis digital transformation is not unique to Bangladesh. We have seen similar movements worldwide, where social media played a pivotal role in mobilising people. The 2010-2012 Arab Spring served as an example of how political dissent could be amplified through digital platforms. Social media sites like Facebook and Twitter helped activists in Egypt and Tunisia plan demonstrations, disseminate real-time information, and mobilise support from around the world.\nMore recently, the Black Lives Matter movement in the United States saw unprecedented digital activism, where viral videos and hashtags (#BLM) brought police brutality and racial injustice into global consciousness. The problem existed throughout modern history, but the consciousness was shaken due to this impactful digital movement. The rise of digital-only political candidates further proves this point. Figures like Volodymyr Zelenskyy in Ukraine, who built much of his presidential campaign through digital engagement, and Nayib Bukele in El Salvador, who uses social media as his primary governance tool, show that traditional political structures are eroding. Voters are increasingly influenced by direct, unfiltered online engagement rather than party machinery and conventional political institutions.\nIf any case validates the power of digital persuasion, it is Cambridge Analytica. While widely condemned for unethical data use, what it truly exemplifies is how digital platforms can shape political behaviour at an unprecedented scale. By leveraging psychological profiling, Cambridge Analytica was able to influence the perceptions of millions of voters during the 2016 US presidential election and the Brexit referendum—in the two most powerful democracies in the world.\nIt was about accuracy, not just false information. Their microtargeting efforts crafted messages that struck a deep chord with people, reaffirming their convictions and influencing them to take particular political positions. This approach demonstrated that policy debates on debate stages and at campaign rallies are no longer the only way to win elections. Rather, the hallmarks of contemporary political warfare now include algorithmic influence, data analytics, and digital strategy.\nThis pattern is also present in Bangladesh. Political parties are dooming themselves if they disregard digital engagement as being less important than traditional campaigning. Voters are actively influencing political messages online rather than merely passively consuming them, which is a stark reality.\nThere are obvious repercussions for political parties that only use conventional structures: they become irrelevant and eventually fail. Parties that don't adjust to new technology eventually lose their base, as history has demonstrated.\nDonald Trump's 2016 victory in the US was propelled by a digital-first campaign that made use of Facebook advertisements, Twitter, and grassroots online activism. Even though Hillary Clinton was a seasoned politician, she was unable to match the Trump campaign's digital energy, which outperformed her in online outreach.\nEven during the 2019 UK elections, Boris Johnson's Conservative Party prevailed thanks to incredibly successful online campaigning, while the Labour Party lost its worst defeat in decades as a result of its inability to fully comprehend the potential of digital mobilisation.\nWhile digital democracy is empowering, it is not without its dangers. The very tools that can fuel political engagement can also be weaponised for misinformation, polarisation, and manipulation. The same algorithms that drive engagement also amplify sensationalist content over facts, creating echo chambers that distort reality.\nFor this reason, regulation is required. The Digital Services Act and the General Data Protection Regulation (GDPR) of the European Union have established a standard for how countries can protect online speech while maintaining the accountability of digital platforms. To stop social media from being abused during elections, nations like Germany have implemented strict laws against hate speech and disinformation online.\nBangladesh needs to follow suit. Political parties must change not only to win elections but also to maintain the morality, equity, and transparency of digital democracy.\nThe future of democracy in Bangladesh depends on how well we navigate this digital revolution. The lessons from the July uprising, Arab Spring, and Cambridge Analytica's microtargeting are clear: the digital space is now the true battleground for political engagement.\nPolitical parties that fail to adapt, innovate, and safeguard digital democracy will be left behind. But those who harness the power of technology while ensuring transparency, ethical engagement, and responsible governance will shape the political future.\nThe digital age is here, and democracy must evolve with it. The question is not whether politics will go digital—it already has. The real question is: can our parties adapt to it?\nAshfaq Zaman is the founder of Dhaka Forum and a strategic international affairs expert.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Democracy in the digital age: Lessons from Bangladesh and beyond",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/democracy-the-digital-age-lessons-bangladesh-and-beyond-3879256",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-04-2025"
    },
    {
        "full_article": "We are shocked to learn of the killing of Jahidul Islam Parvez, a third-year student of Primeasia University, who was stabbed to death in broad daylight on Saturday. That a young life could be so brutally cut short over something as trivial as a \"suggestive\" exchange of laughter is both heartbreaking and alarming. According to media reports, Parvez and some friends were having snacks near the university in Banani when a quarrel broke out after some individuals questioned their alleged mocking of two female students. Although the situation seemed to have been resolved with the intervention of university officials, Parvez was fatally stabbed shortly afterwards. Police have since arrested three individuals, while eight were sued in a case filed by the victim's cousin.\nAmong the accused are two leaders of the Banani thana unit of the Students Against Discrimination (SAD) platform, which prompted rival Jatiyatabadi Chhatra Dal (JCD) leaders—who claimed Parvez as one of their own—to accuse SAD of orchestrating the attack. The SAD, for its part, denied the allegation, accusing Chhatra Dal of exploiting the tragedy for political purposes. This war of words has been distracting, but it does add to the conversation surrounding political violence in the country. Just last month, at least 23 people were killed and 733 injured in over 97 incidents of political violence, according to the Human Rights Support Society. These figures are a sobering reminder of the uphill battle law enforcement faces in containing crimes in post-uprising Bangladesh.\n\nWhat worries us most is the continued vulnerability of general students, even though the political lines on university campuses have been redrawn following the July uprising that ended the long dominance of Awami League's now-banned student wing. The fact that the three individuals arrested by police are only 19 years old also indicates young people's growing inclination towards violence. The activities of teen gangs, in particular, have been a source of concern in recent years, with many—including students—being lured by the promise of quick power and easy money. This is an alarming trend that demands urgent intervention.\nWhat worries us most is the continued vulnerability of general students, even though the political lines on university campuses have been redrawn following the July uprising that ended the long dominance of Awami League's now-banned student wing. The fact that the three individuals arrested by police are only 19 years old also indicates young people's growing inclination towards violence. The activities of teen gangs, in particular, have been a source of concern in recent years, with many—including students—being lured by the promise of quick power and easy money. This is an alarming trend that demands urgent intervention.\nAt this stage, we don't know the exact identity or motive of Parvez's killers. But it is paramount that those responsible be brought to justice through a fair and transparent trial, both for the sake of his grieving family and the safety of general students. A university should be a place of learning and growth, not a battleground for gang activities, petty quarrels, or political vendettas. Government authorities, university administrations, political parties, and society at large have a collective responsibility to ensure that our students can study and grow without fearing for their lives.\n",
        "headline_1": "A tragic reminder of student vulnerabilities",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/tragic-reminder-student-vulnerabilities-3876746",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 25, 2025 00:00:00  \nThe International Monetary Fund's (IMF) insistence on eliminating power subsidies and raising electricity tariffs has got the interim government in a difficult position. These two measures are among the primary conditions for the release of the 4th and 5th tranches of the IMF's $4.7 billion loan. As per the latest IMF review mission, which conducted a comprehensive assessment of Bangladesh's economic landscape, the government is expected to completely remove power subsidies by the 2025-26 fiscal year to qualify for further disbursements from the multilateral body. The IMF has also recommended an upward adjustment in electricity tariffs to reduce the fiscal burden. According to media reports, failure to phase out the electricity subsidy could jeopardise the release of the 4th and 5th tranches of the loan.\n However, the reality on the ground in Bangladesh's power and energy sector starkly by no means corresponds to these expectations. The interim government recently revised the national budget, increasing the total subsidy allocation from Tk 360 billion to Tk 620 billion. Over the years, electricity subsidies have escalated, largely due to the proliferation of independent power producers (IPPs) and rental power plants that operate at high costs. To manage the growing fiscal pressure, the Bangladesh Power Development Board (BPDB) has begun ramping up generation from coal and gas-fired power plants -- seen as more cost-effective options. This shift is part of a broader strategy to gradually reduce dependence on expensive IPPs. Nonetheless, some newly commissioned IPPs have already begun supplying power to the national grid under previously signed power purchase agreements (PPAs), and their outstanding payments remain a financial liability. The BPDB has informed the IMF that it may take a few more years to clear these dues and trim overall subsidies.\n The IMF's call for a zero-subsidy regime stems from its emphasis on building a sustainable, market-driven economy. However, many economists argue that such a model may not be suitable for a power-starved country like Bangladesh. Removing subsidies so soon could have far-reaching consequences, particularly for the manufacturing sector which is highly dependent on affordable energy. The ripple effects could include higher inflation, a spike in production costs, and a decline in export competitiveness -- outcomes that are likely to undercut the very economic stability the IMF loan aims to support. A more balanced and pragmatic approach would be to implement a gradual phase-out of subsidies, allowing industries and common consumers time to adapt. A sudden and complete withdrawal, as suggested by the IMF, may result in economic disruption that outweighs the benefits of the $4.7 billion loan.\n It is crucial for Bangladesh to secure the IMF funds, including the additional $3.0 billion agreed upon recently, but not at the cost of macroeconomic stability. Currently, a high-level delegation from the interim government is in Washington, D.C., participating in the IMF-World Bank annual meetings. Their mission is to negotiate the release of the delayed tranches and to persuade the IMF to adopt a more flexible approach to subsidy reform. There is hope that with careful diplomacy and sound economic reasoning, the delegation can convince the global lender to support a gradual transition that better aligns with the country's current realities.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Eliminating power subsidy more than a challenge",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/eliminating-power-subsidy-more-than-a-challenge-1745506335",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       April 25, 2025 00:00:00  \n\nThe ban imposed on the operation of battery-run rickshaws in Gulshan and Banani took effect from Saturday last. This time the inhabitants of the two posh areas took the initiative for keeping the streets and alleys free from the illegal three-wheelers. On their complaint, the Dhaka North City Corporation (DNCC), the Dhaka Metropolitan Police and the Gulshan-Banani Society jointly enforced the ban. But it could not be enforced before the army intervened to disperse the protesting drivers of the battery-driven rickshaws. The inhabitants of the areas rightly pointed out the unregulated operation of such rickshaws posed safety concerns and also caused traffic jams. \nDuring the unruly protests, the clashes that ensued between the drivers of these particular types of three-wheelers on the one side and the locals, pedal rickshaws and ride-sharing motor cyclists on the other clearly indicate how respective interests can be slid on a collision course. The locals certainly vented their genuine grievance against a growing menace on roads and streets. According to the president of the Gulshan-Banani-Badda Auto-rickshaw Easybike Drivers Association, 8,000 such rickshaws used to operate in the area. \nThe problem of menacing growth of the highly unsafe and trigger-happy three-wheelers is not confined to Gulshan and Banani alone. This mega city with its many other intractable problems has witnessed a booming proliferation of those over the past few months. But it was Nasrul Hamid, a former state minister of power, energy and mineral resources of the deposed Awami League government, who instigated the initial spur to go for conversion of pedal rickshaws into battery-run ones when he eulogised those as 'Bangla's Teslas'. The reference to Elon Musk's electric vehicle is not only inappropriate but can also be considered a joke. \nBefore Hamid's glowing praise, the handful of battery-operated rickshaws that plied on Dhaka streets tried to maintain a low profile and moved rather surreptitiously. His words acted as a blank licence and more of those rickshaws started hitting the road. Still they were mostly a suburban and locality-specific affair. But all other cities, towns and even villages started competing with each other to opt for conversion of the pedal contraption into electric ones. In cities like Dhaka and Chattogram, their explosive growth took off immediately after the July-August uprising and at one stage, the High Court (HC) ordered immediate removal of the battery-run rickshaws from the capital's streets on November 19 upon a writ petition submitted on October 27. In fact, a prior HC order issued in July 2014 banning all unlicensed mechanised and battery-run rickshaws nationwide was still in force. \nIt was, however, the government that filed a petition with the Supreme Court's chamber judge seeking a stay on the HC order and the apex court judge set aside the enforcement of the ban on battery-driven three-wheelers for a month. By December last year, that period came to an end. Since then about four months have passed and the issue has remained not only unsettled but confusing. Meanwhile, this particular mode of communication at a short distance has arrived in all shapes and sizes on the Dhaka streets. \nSome of those have normal rickshaw wheels, others have stronger rickshaw-van wheels, still others have motor cycle wheels and then another type is fitted with pickup van's or microbuses' wheels and the last type runs on three car wheels. Some of those are colourfully decorated and some others are painted in glossy colours. Yet what has been grossly neglected are the aerodynamics of the vehicles and an effective brake system ---two most important factors for ensuring safety. \nThe running amok of a battery-run rickshaw into a ditch in Chattogram City recently has sparked a public protest following the death of a girl child, whose body floated about a kilometre away, in the accident. Reckless driving of these three-wheelers on side streets and alleys often gives a nightmarish experience to their passengers, other commuters and pedestrians alike. \nIf Nasrul Hamid is responsible for inciting 'Bangla's Teslas' to take to the street in an increasing number, this government is no less responsible for its laid-back action on the HC decision. It should have assigned a panel of urban planners and transport experts to determine if the battery-run rickshaws could be allowed to operate in city areas. If allowed, which type and in which designated areas their operation could be limited. Even more importantly, it was urgent to explore how their brake system could be improved to match their speed. Equally important was to fix the number of such three-wheelers.\nNow there is a hotchpotch of assorted types, adding to the transport mismanagement and anarchy. True, drivers are spared from arduous labour they have to put in pedalling a rickshaw, particularly in high summer. But the risk to life cannot be ignored. Had a safe brake system been developed, all pedal rickshaws or manually operated three-wheelers with some adjustments to their body features would wisely be converted into battery-powered ones.\nThis has not happened but the unscientifically designed types are now ruling the roost in urban space. So, the argument that a large number of people now depending on these particular rickshaws deserve considerations is flawed and the excuse must not be advanced to leave the city to be held hostage by these illegal contraptions. Although late, yet these three-wheelers need to be taken off the busy urban streets before they bring the city life to a grinding halt.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Should battery-run rickshaws be allowed to operate or not?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/should-battery-run-rickshaws-be-allowed-to-operate-or-not-1745506396",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       April 25, 2025 00:00:00  \n\nThe set of recommendations, prepared and unveiled by the Women's Affairs Reform Commission last week, has already sparked strong protests, especially by various Islamist parties in the country. These parties, along with several clerics, blasted the commission for a deep conspiracy to destroy the religious balance, family structure and social stability in the country. They have alleged that a number of recommendations contradict the basics of the Holy Quran. One of the main objections against the recommendations concerns introduction of a uniform family law and equal property rights for men and women. \nThe commission recommended promulgation of an ordinance to ensure equal rights for women of all religions in marriage, divorce, inheritance, and maintenance through a uniform family law. It also suggested that at the very least, steps should be taken to draft the law now and implement it on an optional basis for all communities. There is no doubt that such a recommendation is subject to controversy especially in a country having a Muslim majority. \nIn Bangladesh, the Muslim Family Ordinance 1961 is the umbrella law covering all Muslim family-related affairs. Inheritance is also determined according to the law following Quranic instructions. In the Holy Quran, there are clear guidelines for distributing inherited property and assets left by someone. In some cases, there are complexities in calculation which requires strong knowledge to decode the instructions rightly. Taking advantage of these complexities, male members of some families deprive women members of their due shares. To do so, the male members get help from unscrupulous experts on Muslim family law who misinterpret Quranic instructions and relevant Islamic rules. So, it becomes difficult for women to claim and get their due shares in the property or assets inherited by them. Generally, Muslim men receive double the inheritance share compared to women, though the share distributions are subject to number, gender and relation of the legal heirs. It means, there is no rigid rule that men will always get double the women's share. \nTo make the distribution of Muslim's inherited property easy, the government has already introduced an online calculator named the Inheritance Calculator. Using the calculator, it is now possible for anyone to find the due shares of the heirs who are legally entitled to the property left by their predecessor. Again, due to ignorance, many people, especially women in the country, are unable to take advantage of the calculator. \nIt is true that patriarchal mentality and male-dominated guardianship in society are rooted and supported through the misinterpretation of rules and codes of religion. So, it is impossible to change the existing laws and practices suddenly. Instead, what is more important is focus on proper implementation of the existing laws in terms of inherited property and asset distributions. The commission's recommendation on implementing the uniform law as optional for the time being is misleading and subject to legal complexities. Moreover the interim government is not in a position to go ahead with the sensitive and controversial matter, especially when the national election is a key priority. \nNevertheless, if the interim government wants to proceed, it must first pacify the protests and objections through consultation and discussion. There is a need to examine the objections raised by different quarters. Moreover, the recommendations by the commission also need to be reviewed carefully as the so-called radical progressive attitude has failed to consider the ground realities and other complexities in the country. \n One must keep in mind that family-related affairs in Bangladesh are traditionally and generally guided by religious codes and social practices. Generally, people of all religions attach importance to the orders and guidance set by their respective religions. So, any change or deviation from the religion-based codes is not acceptable to most of the people. Misinterpretation of a religious guideline is one thing, while an attempt to modify or change the order is another issue. Against the backdrop, the move to introduce a uniform family law will bring further societal chaos and cause unnecessary tensions. \nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Is a uniform family  law feasible?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/is-a-uniform-family-law-feasible-1745506442",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 25, 2025 00:00:00  \n\nRemittance inflows have become one of the most stable and significant sources of external financing for Bangladesh over the past decade. Growing from approximately US$ 12 billion in 2015 to over US$ 22 billion in 2024-equivalent to around 6.4 per cent of GDP-these funds directly benefit over 10 million families across both urban and rural areas.\nThe impact on household welfare is particularly noteworthy. A substantial portion of remittance is used for education and healthcare, allowing children from recipient families to attend private schools, pursue higher education, and cover routine or emergency medical expenses that would otherwise be financially out of reach.\nIn rural communities, remittance plays a crucial role in helping ease consumption and resilience-building. Households invest in small assets such as livestock, land, or water pumps, which strengthen their ability to cope with shocks like floods, cyclones, or crop failures.\nEncouragingly, a growing share of remittance income is now being channelled into micro-enterprise development. Many returnee migrants and their families are using these funds to launch small garment sub-contracting businesses, local shops, or agro-processing ventures. Microfinance institutions have reported a 30 per cent increase in remittance-backed loan applications over the last five years, indicating rising entrepreneurial activity. These micro-level investments generate wider economic benefits, creating backward and forward linkages in rural economy, new employment opportunities, and increased demand for services such as transport and construction.\nHowever, these benefits are not evenly distributed. Families living in remote areas or without access to formal banking services face high remittance transfer fees, sometimes up to 8.0 per cent that slash their disposable income. Additionally, social pressures to spend on weddings or religious celebrations can lead to over-borrowing.\nIn response, policymakers are expanding mobile-remittance channels, negotiating lower transfer fees-especially in major corridors such as the Middle East and Malaysia-and piloting diaspora bonds to harness overseas savings for national development.\nTo further maximise the developmental impact of remittances, efforts must focus on improving financial literacy, increasing digital connectivity, and linking remittance inflows to formal credit histories. These steps will enhance the ability of remittances to drive sustainable livelihoods, build human capital, and promote inclusive economic growth.\nEsrat Jahan Neha\nStudent \nNorth South University\nesrat.neha@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Impact of remittance inflow on household",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/impact-of-remittance-inflow-on-household-1745506468",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-04-2025"
    }
]