[
    {
        "full_article": "Alluding to intelligence reports of Pakistan’s heavy military activity in areas adjoining Sir Creek, Defence Minister Rajnath Singh has warned Pakistan against any adventurism. Mr. Singh’s statement that “a route to Karachi passes through Sir Creek” is both puzzling and disconcerting, considering the lingering tensions and the absence of diplomacy between India and Pakistan. His remarks drew a parallel with the 1965 India-Pakistan war, when the Indian Army advanced to the outskirts of Lahore. Sir Creek is an uninhabited, largely inaccessible marshland between Gujarat and Sindh in Pakistan, with a complex web of waterways and shifting tidal patterns. It remains a dispute between the two countries. Navigation is extremely challenging and requires expert knowledge of the terrain. On the Indian side, the estuarine region is already under layered security, with the Border Security Force, the Indian Army, the Indian Coast Guard and the Indian Air Force maintaining a strong presence. India considers the area as vital for oil and gas exploration as well as fishing rights. India’s major ports, Mundra and Kandla, located in the Gulf of Kutch, are also in close vicinity. Large-scale ground operations are nearly impossible in the region, which lacks roads, a civilian population and administrative infrastructure. However, during Operation Sindoor, Pakistan attempted to strike military infrastructure with close to 400 drones across 36 locations from Leh to Sir Creek. Indian forces neutralised many of them, but it perhaps signalled the expansion of the front between the two countries.Strategically, opening a front here is disadvantageous for both sides, but conflicts often do not follow reason or logic. Mr. Singh, who was in Kutch to celebrate Vijayadashami with soldiers, had been scheduled to visit Sir Creek but could not due to adverse weather. Addressing troops at the Bhuj military base, he reiterated India’s consistent position to resolve the issue through dialogue. He said Pakistan’s intentions remain unclear, and went on to say that “any aggression by Pakistan in the Sir Creek area will be met with a resounding response that will change both history and geography”. Adding to India’s security concerns are Chinese-backed mining and power projects in the Pakistani part of the Rann of Kutch, near Gujarat. These projects, India fears, could evolve into a strategic-military challenge, if leveraged jointly by Beijing and Islamabad. Considering the volatility in geopolitical situations in many corners of the world, India must tread with care and wisdom. Strategy should be disconnected from domestic politics. New Delhi must do everything under its command — but first, diplomacy — to address its security concerns. Published - October 06, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        espionage and intelligence\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        armed conflict\n                    \n                            /                      \n                        \n                        armed Forces\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        fishing industry\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Gujarat\n                    \n                            /                      \n                        \n                        national security\n                    \n                            /                      \n                        \n                        security measures\n                    \n                            /                      \n                        \n                        diplomacy",
        "headline_1": "Marshland trap: on Sir Creek, Pakistan’s activities",
        "headline_2": "India must address its concerns about Pakistan’s activities with care",
        "link": "https://www.thehindu.com/opinion/editorial/marshland-trap-on-sir-creek-pakistans-activities/article70128108.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "06-10-2025"
    },
    {
        "full_article": "Even before she faces a parliament vote to become Japan’s first woman Prime Minister, Sanae Takaichi has set a record as the first woman to lead Japan’s dominant Liberal Democratic Party (LDP). After defeating her more centrist rival Shinjiro Koizumi in party elections on Friday, Ms. Takaichi, a 64-year-old protégée of former Prime Minister Shinzo Abe, is seen as a socially conservative right-winger. If she wins the parliamentary vote, as expected, she faces more difficult challenges than breaking the decades-old glass ceiling. To begin with, Ms. Takaichi is the latest in a series of Japanese Prime Ministers ousted from office, even as the LDP and its partner Komeito have lost majorities in both houses, and will need to lead a fractious coalition by reaching out to the opposition. Her predecessor Shigeru Ishiba stepped down after the LDP lost its majority, after serving for less than a year. It remains to be seen how Ms. Takaichi, who has spoken of her admiration for former British Prime Minister Margaret Thatcher, is able to emulate the “Iron Lady’s” successes in holding the party and government together. While clearly the most popular party leader at the moment, she is a polarising politician who is known for strong views against immigration, and in favour of revising Japan’s pacifist constitution. She does not project a feminist agenda and has been criticised for refusing to review archaic Japanese laws on married women keeping surnames or on the more contentious issue of female succession in Japanese royalty. The second challenge is geopolitical — Japan’s public confidence in the United States has been shaken by the Trump administration’s actions, including driving a hard bargain on the Free Trade Agreement. Ms. Takaichi is a hardliner on China, which could put her on a collision course with Beijing. Her rise has also been seen with some concern in South Korea, which had begun to warm up to Japan, as her visits to the Yasukuni shrine to venerate Japanese war heroes, and her tough line against war reparations, may be a red flag. Finally, Ms. Takaichi, a former Economic Security Minister, will have to contend with Japan’s long-term economic challenges and demographic decline.In India, her win will be largely seen positively, given her association with Shinzo Abe, whose tenures saw rapid improvements in India-Japan ties. The government will seek to continue its cooperation on many fronts, especially in technology and critical mineral processing. Above all, amidst uncertainty over the Quad summit and Mr. Trump’s commitment to the Indo-Pacific policy, New Delhi will hope to see a strong leader in Tokyo, who will help shore up the geopolitical turbulence that the region now faces.\r Published - October 06, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Japan\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        security measures\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        mining\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Australia",
        "headline_1": "​Japan’s Iron Lady: on the rise of  Sanae Takaichi",
        "headline_2": "Takaichi is a polarising figure leading a fractious coalition",
        "link": "https://www.thehindu.com/opinion/editorial/japans-iron-lady-on-the-rise-of-sanae-takaichi/article70128365.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "06-10-2025"
    },
    {
        "full_article": "Japan’s famed quality of life was immune to political upheavals & govt changes. Takaichi’s win shows that separation is shrinking\nIn her Thatcher-blue suit, ultra-right politician Sanae Takaichi smiled big as she made history, set to become Japan’s first woman PM by mid-Oct. But few expect the 64-year-old social conservative to impact Japan’s deep gender imbalance – whether in its male-dominated politics or society at large. Her promise to appoint more women to govt will be entirely symbolic if LDP continues to frame women’s roles, and policy, around being ‘good wives and mothers’ in an ageing, low-fertility society.\nTakaichi’s rise is really about Japan’s political crossroads. Her win with grassroots support within big-tent umbrella party LDP, with its recent electoral setbacks and accused of lacking vision, shows how the party has absorbed the youth’s far-right surge instead of risking ceding that space to minor hyper-nationalist ‘Japan First’ parties growing popular. Japan simply followed the global trend – the political centre itself shifting right, driven by anti-immigration and anti-liberalism. Takaichi’s victory is seen as unsettling LDP’s partnership with long-time moderate ally, the Buddhist-backed Komeito, while her openness to working with far-right groups will appeal to younger Japanese nationalists. Both Seoul and Beijing are uneasy – as a wartime history revisionist and China hawk, Takaichi is likely to inflame already fraught regional ties.\nUniquely, Japan’s unsettled politics and decades-long economic stagnation haven’t dented its quality of life. GDP barely grew between 2000 and 2019. Per capita income has been flat. Yet infra, healthcare, education and housing remain reliable.  Add to that Japan’s famously low crime rate and value for ‘social peace’. Only, a shrinking young population is on a collision course with growing numbers of foreign-born residents who Japan must import to bolster its working population. Takaichi has promised ‘zero illegal immigration’ and improved ‘social integration’. The hardline politician is LDP’s ticket to a political comeback, but how long she can last without bowing to her party’s old guard remains uncertain. Japan’s become a country to watch.\n\n",
        "headline_1": "Right & Wrong In Japan",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/right-wrong-in-japan/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-10-2025"
    },
    {
        "full_article": "Syrupy HAHK games Kamala and I play                   \nUhu uhu, I coughed discreetly in Madhuri Dixit style, to attract Kamala’s attention as she scrolled her phone with single-minded focus. Her response was neither gentle nor discreet. She jerked around to look at me with alarm and proceeded to plug in the steamer, put off the fan, pull out a blanket and search for the familiar balm that has been rubbed on a million Indian chests, the Vicksit Bharat passed down for generations. \nI had not seen such a vigorous response to a cough since the pandemic. In those conveniently forgotten days, one public cough would often lead to nervous glances, social distancing, blood tests, generalised panic and even a family quarantine. Biwi, please pass the makhana, I sang, continuing my Hum Aapke Hain Kaun musical reference. Biwi was not amused. \nShe leaned over to show me what she had been reading on the phone. ‘We can’t even trust medicines anymore. Cough syrups are being contaminated with diethylene glycol,’ she said and proceeded to school me on the latest news from Madhya Pradesh. I had not seen her so upset when our milk was mixed with water, our petrol contaminated with ethanol and our democracy diluted with discord. \nI assured her that I was not developing an upper respiratory infection or rapidly progressing to pneumonia. My cough had been a theatrical trope to keep her from hogging all the Sunday snacks. ‘Even that muffler man in Delhi had a chronic cough and we haven’t heard from him recently,’ she countered ominously. She chose to conveniently ignore the fact that everyone in Delhi had a chronic cough, which was the result of the seasonal chill and the farmers in surrounding states sending a smoke signal to the lungs. \nKamala was in full flow now. She made me a bitter, strong black coffee mixed with all the herbs and spices in the kitchen and acted like my journey from cough to coffin was spiralling rapidly. ‘You doctors know nothing,’ she said in a syrupy sweet voice, dismissing my years of medical training in one terse comment. Much like Trump blamed Tylenol for autism, he was possibly referring to Kamala’s home remedy when he famously talked about cofveve.  ‘As long as we don’t have to cough up the doctor’s steep fees,’ Kamala said with satisfaction, as she settled down to eat the remaining makhana while scrolling endlessly for more medical masala. \n\n",
        "headline_1": "Cough it up",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/cough-it-up/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-10-2025"
    },
    {
        "full_article": "There’s no place for toxic substances in a medicine factory. So how do they get inside cough syrup? Govts must answer \nHow many more patients must die before India gets serious about diethylene glycol (DEG) contamination in medicines? For US, one incident – the world’s first that cost 105 lives in 1937 – was enough. It was a time when medicines were put on the market without toxicity tests. In 1938, US changed that with its Federal Food, Drug and Cosmetic Act, and has not had any DEG mass poisoning since. But in India, we are in the middle of one more such mass poisoning. Over a dozen children aged below five have been confirmed dead from cough syrup-related kidney failure in MP and Rajasthan in the past few days.\nDust the files of the past five years, and you find 12 children died of DEG-laced cough syrup in J&K, in 2020. In Aug 2022, Uzbek authorities linked cough syrup made in India to the deaths of 65 children. Four months later, WHO linked 66 children’s deaths in Gambia to DEG in cough syrup from India. You would think the previous tragedies – altogether 143 deaths – would have shook the conscience of Indian authorities, and you would be so wrong. DEG in medicines has been killing us for decades. There was the Mumbai incident in 1986 that claimed 14 lives. In 1998, some 150 children were referred to Delhi’s Kalawati Saran Children’s Hospital with acute renal failure, and 33 died. The culprit: cough syrup made by a unit in Gurgaon. \nTo save a few rupees – maybe paise – unscrupulous drug makers or their suppliers substitute glycerin in medicinal syrups with lethal DEG, which is an industrial solvent. And that, partly, is the crux of the problem – hundreds of human lives sacrificed for a few paise per bottle. The other regrettable part is the indifference of our authorities. In the latest case, they hurriedly gave a clean chit on Friday after testing only 9 out of 19 syrups, when the two main suspect brands had not been tested. In the Gambia case, the suspect firm got its licence back the same year. The firm named in the Uzbek case also returned to business this year. There are no consequences, even though each of these tragedies tars the name of Indian generics abroad. DEG deaths are the last thing Indian pharma needs amid global trade tensions. Govts, you seem deaf to dolor, but pay heed to dollar at least.\n\n",
        "headline_1": "Poison & Pharma",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/poison-pharma/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-10-2025"
    },
    {
        "full_article": "My parents enjoyed long drives. Even in the 1960s, when that meant navigating cows and carts that competed for space on the two-lane GT Road. It was, I think, on the way to Barkakana, in the heart of Jharkhand, that we stopped to have lunch at a dhaba in Gobindpur, where I met my first chicken butter masala. Bright orange, streaked with cream and the froth from melted butter, it was like nothing I had ever tasted, heightened by the slightly burnt smell of the fresh rotis from their tandoor. Now I know it was the play between the sweetness from the tomatoes and the cream, the undertow of chili heat and the contrasting bitterness from the kasuri methi and the charred tandoori chicken itself, that gives this dish its enduring grip on my palate. But on that first day, it was just magic.\nI have been to truck stops all over India and beyond, from the bare sheds that failed to stop the howling desert winds somewhere in Xinjiang, to the fake-historic turreted ‘trucker’s castle’ near Frankfurt, if my memory serves me right. I have waited anxiously among the dark shadows behind a shuttered central Indian dhaba for the driver to finish his rest break, listening to the barking dogs and occasional moaning sounds, and enjoyed the hospitality of an unexpectedly well-maintained HP government restaurant well above the tree line near Sissu.\nILLUSTRATION CREDIT: Cheyenne Olivier (France)\nAnd of course, I have many memories of meals. The suspiciously watery maccher jhol on the way to Krishnanagar that turned out to be incredibly delicious. The kindly woman who noticed that I was wasting the wonderful thali she served me in a small shed near Tanjore because I had eaten something more toxic the day before. The many, many alu parathas with achar and dahi that marked the beginning of so many of our field-trips, some light and dense in flavour, some drowned in reused oil. The perfectly fried Wiener Schnitzel in that ersatz castle I mentioned, tasting of nothing but the lemon juice I squeezed on it. The famous (I was told) civet de lapin (rabbit stew with bacon and mushrooms) at a restaurant routiers near Lyon or Dijon, which was a little too gamey for me (I think it was hare and not rabbit, and the server actually told us that, but our French was not up to it).\nThat last meal was at a Relais Routiers, a loose chain of 700 truckers’ restaurants all over France. I read that their inspiration came from an upper-class journalist called François de Saulieu de la Chomonerie, who, in 1934, took a ride on a truck from Paris to Marseilles and wrote about the hard lives of the drivers. For less than 15 euros, Relais Routiers still offers drivers clean showers and a three-course meal, appetizers (grated carrots, julienned celeriac in a mayonnaise sauce, a pâté or two) plus a meaty main course, dessert and, of course, this being France, a glass of wine).\nEven with that necessary break, the days can be long and hard. The US allows a maximum of 11 hours of driving a day, while France caps it at 9. Long-distance freight is paid better, but it means being away from home for days or even weeks, often sleeping in the cab of the truck for nights on end. Cheyenne, who illustrates this column, grew up with a father who drove trucks for part of his life while raising his two little girls alone, so long-distance travel was not an option for him. Instead, he saved as much as he could out of the living allowance the company gave him by carrying a stove and a little fridge with him, so that he could cook himself meals in his truck. To avoid using the restaurant’s showers, he carried a bucket and mug. Which is how, one hot summer day, just as he started pouring water on himself, it happened that the truck sheltering him just took off, leaving the young family seated across wondering what a grown man in very minimal underpants was doing there.\nIn India, of course, we are quite used to taking baths outside, protected by a strategically placed wrap or loincloth. I have many memories of a taxi driver’s stop near our home in Kolkata, where Sikh men would patiently run a comb through their often waist-long hair after their morning ablutions, while enjoying the early morning sun. But it is also true that for the truck drivers, the alternatives are often dire: a particularly precarious toilet in a Barabanki truck-stop still haunts my dreams. Truck drivers might enjoy the occasional marvellous alu paratha or chicken butter masala (though I must confess that my quest to recapture the Gobindpur miracle has systematically failed) but they typically sleep somewhere in their truck or, if the weather permits, outdoors on a rented khatiya (rope bed) in the truck stop. For many nights a week. Truck drivers I have spoken to, mostly in the more rudimentary dhabas across the country, often complain about the life they live: “My mother doesn’t get along with my wife, she misses me,” I recall one telling me. Maybe he was too much of a man to say that it was he who missed the family.\nA widely quoted number that is ascribed to a World Bank report is that there are only 60 drivers in India (or less) for every 100 trucks. It is likely that some of these idle trucks are in need of repair (and some are so old and rickety that nobody wants to drive them) but the ratio has been falling since the 1990s, when there were more potential drivers than trucks. Apparently, a lot of this is because people prefer to drive Ubers and Olas in the cities, which pay roughly the same amount and offer a much less arduous life.\nYet trucks are very much the lifeblood of the Indian economy, carrying 70% of the freight. Building roads and, increasingly, highways and other high-speed roads has been a focus of BJP governments in the past and now — the national highway network has grown by 60% since 2014, and there are many more four-lane highways. I should add that my experience so far is that the promised wonderful roads are mostly indeed wonderful but there is always a bit that is dug up/being improved and that, combined with the increased traffic attracted by the road’s reputation, creates massive bottlenecks.\nBut I assume that can be fixed. The lack of drivers, on the other hand, is a structural issue. The government’s response — creation of more driver training institutes — seems to miss the point that young people don’t want to drive. Higher wages are clearly part of the answer to that, but a lot of the response probably needs to be in terms of public policy. Short-term accommodation in India is notoriously expensive for the quality it offers. Encouraging the creation of clean, safe, comfortable dormitories where men and women can stop for a few hours for a small amount of money will help travellers of all stripes, including drivers. They would also benefit from more policy attention to the quality of the springs and the seats in the truck that give the ride its roller-coaster quality and to the length of the driving day (which is nominally capped at 8 hours, but it is not clear who is enforcing it). They probably consider these a part of a trucker’s life and don’t fully understand how much they hurt, especially in the long run. In particular, new reports suggest that many middle-aged drivers complain of back pains.\nThe fact that trucks are often extremely overloaded (who hasn’t seen a toppled truck on Indian roads?) is a source of stress both to those driving them and everyone else on the roads. Being stressed and tired is often a reason to drink: the Gobindpur dhaba, the six-year-old me had noted with surprise and amusement, was paved with beer bottle tops. I now know what that meant. Enforcing simple regulations — penalties for overloaded trucks and for drinking and driving (which exist but often get waived in return for a small bribe) — would make driving universally less unpleasant.\nRoads with better-rested and less-stressed drivers driving more stable trucks is something all of us who use India’s roads need. In 2023, 1,72,000 people died in road accidents, including some 10,000 children. We know that the victims were often on two-wheelers, but that only tells half the story. Did they get hit by a truck or were they hit while trying to avoid a truck that seemed out of control? How long had the truck driver been driving? When was it last that he got a good night’s rest?\nThis is part of a monthly column by Nobel-winning economist Abhijit Banerjee illustrated by Cheyenne Olivier\n\nRECIPE: Recipe for cheater’s Chicken Butter Masala\nI make this for my kids often, starting with some tandoori chicken that came from a local restaurant. It is quick and tasty, though I doubt anyone will wake up thinking about it,\nsome sixty years hence.\nGet 1 kilo tandoori chicken from a good restaurant with a real tandoor ideally and cut it into small pieces taking care not to shatter the bones. Set aside. In a heavy bottomed saucepan, heat 3 tbsp salted butter till it melts at medium-high heat and throw in 1 tsp cumin seeds, and a bay leaf. When you can smell the fragrance from the roasting seeds, add 2 tbsp ginger-garlic paste, and cook for a minute. Turn heat to low and add in ¾ cup double concentrated tomato paste mixed in ¼ cup water, 1 tsp salt, 1 heaped tsp garam masala and 1 tsp deghi mirch. Cook for 5-6 minutes, till the whole mixture starts to turn brown. Add 1 cup heavy cream and 1 tbsp kasuri methi, mix well and tip in the cut-up chicken. Let it cook for 5 minutes at the same low heat or until the chicken is heated through. Take off heat. Melt 2 tbsp butter till it foams and pour over the chicken. Add 2 or 3 slit green chilis, cover for a few minutes, and serve.\n\n",
        "headline_1": "Meals, miles and midnight stops",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/tasting-economics/meals-miles-and-midnight-stops/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 06, 2025 00:00:00  \nFrequent spells of rainfall over the last couple of months have created ideal breeding conditions for mosquitoes. While all three genera of mosquitoes---aedes, anopheles and culex---have proliferated due to the favourable conditions, the most dreaded one is aedes that causes dengue and chikungunya. The two city corporations and the Directorate General of Health Services (DGHS) have failed to launch any programme aimed at destroying the breeding grounds or containing the spread of the vector-borne diseases. The high incidence of dengue together with its rising death tolls has become a cause for serious concern. Both dengue cases and fatalities may follow the pattern of outbreak of 2023, the worst year on record. But the authorities show no urgency to address this health crisis.\nExperts are warning that the dengue situation may worsen in October due to the continued rainfall. Reports already indicate a sharp influx of dengue patients in hospitals, with the number of cases in September doubling compared to August. Overwhelmed by the daily surge of critically ill patients, public hospitals are struggling to provide beds, forcing many patients to receive treatment on the floors. Dengue patients require special attention and care. But when they are forced to receive treatment lying on hospital corridors, questions naturally arise about the quality of care they receive. This raises serious concerns about the health department's preparedness to handle such emergencies. The dengue crisis has become an annual phenomenon. Then, why do these persistent shortcomings continue and why have these issues remained unaddressed all these years?\nWhat has further complicated the matter is the mutation of the dengue virus. Until recently, DENV-2 had been the dominant strain in Bangladesh, but public health experts have expressed deep concern over the rising prevalence of DENV-3 infections. According to researchers, this shift is extremely dangerous. Patients previously infected with DENV-2 face a much higher risk of death if infected again with DENV-3. Antibodies developed against the earlier strain are ineffective against the new one. Again, while dengue has dominated headlines, its sister disease, chikungunya, has quietly wreaked havoc. Though not as deadly as dengue, chikungunya leaves its sufferers battling relentless headaches and physical pain for months, turning daily life into a prolonged ordeal. So, the shifting patterns of dengue and rapid spread of this new strain, particularly in the capital, serves as a stark warning and urgent wake-up call.\nApart from increasing treatment facilities in all hospitals, the government must take immediate and coordinated steps to control this menace. Residents from different parts of the city have alleged that they have only seen sporadic efforts by city corporations to spray anti-mosquito insecticide. Called fogging, this anti-mosquito drive has ever remained suspect of becoming effective against aedes. There is a need for an intensive targeted spraying of larvicide. An intensive drive focusing destruction of breeding grounds in all areas of the city at a time for a certain period, say a fortnight, involving sufficient manpower and mobilising local people, volunteers and students may help bring tangible results. The campaign should be carried on round the year in order to keep the city free of mosquitoes.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why no urgency to contain dengue?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-no-urgency-to-contain-dengue-1759675571",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       October 06, 2025 00:00:00  \nFollowing a formal request from the interim government, the UN is going to carry out an independent review of the state of the country's economy prior to its graduation from LDC status scheduled for November 2026. The government's request came in response to the country's top business and trade organisations' demand for deferment of Bangladesh's graduation from its current LDC status by five to six years so the economy could get itself adequately prepared to undertake new responsibilities and risks in the post-graduation phase to ensure that the transition leads to lasting success. The post-graduation challenges include, for instance, the loss of duty-free access to its largest overseas export market, the European Union (EU). The preferential treatment that Bangladeshi export goods now enjoy in the EU market would be withdrawn at the end of the three years' post-graduation grace period in 2029. The concern is after 2029, the EU would impose 12 per cent tariff on our export products. That could lead to a 6.0 to 14 per cent drop in exports, the business leaders fear. Exports to Japan and Canada would also face higher tariffs. Obviously, as a consequence Bangladeshi exportable goods would lose their competitiveness in the international market. So, to avoid such prospects, the business community has been pushing for the deferment of the LDC graduation. At a press conference held in late August this year, the trade bodies in favour of deferment expressed optimism that the extended period, if granted, would provide them with greater scope for export diversification, development of skilled manpower in automation and artificial intelligence and thereby build capacity for facing future challenges and thus ensure sustainable competitiveness in the global market. Also, the added concern was that post-graduation, the World Trade Organization (WTO)'s special and differential treatment would end rendering patent rules stricter for Bangladesh's pharmaceutical sector and thereby increase compliance costs. So, if the graduation time is extended by five to six years as requested by trade leaders, Bangladesh could meanwhile get the opportunity to secure trade deals with different countries as well as economic blocs, the business leaders believed. \nThe independent UN review will be carried out by an international consultant in collaboration with a Bangladeshi expert so as to ensure a comprehensive and balanced evaluation of the economy. The review is expected to start within a month and concluded by mid-January 2026. However, according to experts, though the UN review would be helpful for Bangladesh's case for deferment, yet there is no guarantee that it would lead to the expected result. But Bangladesh can still argue in favour of deferment showing that the Solomon Islands' graduation was deferred on the grounds of the island nation's vulnerability to climate change. On the other hand, Angola's graduation was deferred as the price of oil, the mainstay of the country's economy, fell sharply. In that case, there is no reason why Bangladesh cannot make its case, since it is also a nation highly vulnerable to climate change. Moreover, it has recently underwent a violent political change following a student-led upsurge in July 2024. So, the arguments in support of deferment of Bangladesh's LDC graduation seem sufficiently persuasive. Bangladesh can also put the argument to the visiting UN team that the country's readiness in accordance with its Smooth Transition Strategy (STS) is still not satisfactory if only due to last year's violent political transition and uncertain economic situation. \nNotably, Bangladesh's first deferment of graduation until 2026 came through an assessment in 2021. Initially, a transition period of three years was granted, which was later extended for five years as a fallout from the severe Covid-19 pandemic. \nWhile Bangladesh should spare no effort to delay its graduation for a period necessary for its preparation, it should not also forget to intensify its endeavours to diversify its exports base. Unfortunately, during the last two decades, the successive governments failed to make any tangible progress in this regard. However, three projects which have some links to expanding the country's narrow export base have been implemented thanks to the loans provided by the multilateral lenders. These are in addition to the 'One District One Product' initiative taken at the government level. But the immense potential of the leather and leather goods, pharmaceuticals and light engineering products has remained largely untapped. The weakest spot of the Bangladesh's export sector being its practically total dependence on the Readymade Garment (RMG) sector, which earns about 85 per cent of the country's export revenue, needs urgent addressing. Multilateral loan, for instance, from the World Bank (WB) worth US$48 million for an export diversification project, which was implemented between 1999 and 2024, helped diversify only RMG-based exports. Meanwhile, the share of the knitwear subsector grew to US$2.0 billion by 2023-24, which was equivalent to 38 per cent of the total RMG exports volume (valued at US$50 billion in 2024). The second WB-funded project titled, 'Export competitiveness for jobs' worth US$119.12 million has been implemented since 2017 to strengthen competitiveness of the leather, footwear, light engineering and plastic goods. It is worthwhile to note in this connection that the WB project helped create 90,000 jobs. Similarly, an Asian Development Bank (ADB) loan worth US$300 million through 'Skills for Employment Investment Program' is indirectly linked to export diversification by way of improving the light engineering sector. However, experts are of the view that such projects are not enough for diversifying the country's export sector. They, on the other hand, stressed overcoming the country's limitations regarding skilled manpower and technology, logistics, necessary market intelligence and, most importantly, Foreign Direct Investment (FDI). These limitations are holding back the economy's efforts at export diversification significantly. \nConsider the phenomenal growth of our Southeast Asian neighbour Vietnam between 1995 and 2022. In 1995, its overall export was worth US$4.83 billion, whereas in 2022 it was a whopping US$384 billion with which Bangladesh hardly bears comparison. The reason for Vietnam's success lies in its diversification of exports into areas like electronics, automobiles, processed agricultural goods, etc. Bangladesh, on the other hand, at US$4.18 billion in 1995, could earn a revenue of merely US$59 billion in 2022. That is because, we are left with no other options. \nSo, whether Bangladesh succeeds in getting a deferment of its LDC graduation or ignores the UN's reassessment by January 2026, it must redouble its efforts to diversify exports keeping in mind the path taken by Vietnam.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Urgency of diversifying country's exports",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/urgency-of-diversifying-countrys-exports-1759675603",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       October 06, 2025 00:00:00  \nThe breeding season ban of 22 days on catching of hilsha has become effective from October 4 last. This yearly legal restriction was introduced in 2008 for 11 days covering a pre- and post-full-moon period. But a study found that hilsha is used to spawning during the new moon or dark moon too. This prompted the authority to lengthen the ban to 22 days around this time every year. During the early years, the ban produced positive results with the post-ban hilsha catch going up. Until 2019, a continuous uptick in hilsha harvest was reported. But over the past six years, the catch has continued to decline. During July-August, the peak hilsha harvesting period, this year, the catch amounted to 29,519 metric tonnes --a drop by 10,771 tonnes. \nNotably, hilsha spawns round the year and yet its main spawning season is October-November with the secondary spawning occurring in February-March and June-July periods. If there is a lean year after a few years of proliferation, there is nothing to be complained about. But this appears to be not an isolated off-season any more. Something has really gone awry. Or, why should the seasonal ban would not help proliferation of the hilsha population? In the fiscal year 2023-24, the production of hilsha came down to 529,000 tonnes from 571,000 tonnes in the fiscal year 2022-23. The production is likely to decline further in the current fiscal year. \nThe argument that brood or juvenile hilsha (jatka) catching is responsible for the decreased production does not hold because the ban is enforced quite strictly. Ichthyologists indicate that the estuaries of rivers may provide an answer to the problem. Hilsha needs at least a depth of 30 feet water for their movement but now most of the estuaries have become as shallow as 8-9 feet depth of water during the low ebb. Also the pollution of river water is heavier than before. Hilsha is a sensitive fish and it avoids polluted water as much as it can. Or, even if mother hilshas lay their eggs, they do not produce broods in adequate number either due to pollution or even the climate change. \nHilshas are unlikely to opt for other spawning zones located in Myanmar's or India's territorial waters. If that had happened, fishermen in those countries would have reported heavier catches of the fish. The other option for hilshas could be the Persian Gulf. This can as well be ruled out because the estuaries of rivers connected to the Bay of Bengal with all their flaws are better suited for a habitat of hilshas. \nWhether it is shallower water depth at the estuaries or pollution of water or a combination of both limits the proliferation of hilshas should be looked into. If the global warming is behind the increased siltation of the estuaries, this phenomenon should also be studied closely in order to find a solution to the degradation of the breeding zones. This poses a huge challenge to any country. All the neighbouring countries relishing a dish of hilsha or earning foreign exchange from its export will be required to develop a trans-boundary strategy to preserve the breeding zones of this fish. Industries and factories within the neighbourhood must be directed to follow safe disposal of effluent or wastes. \nHowever, if the global warming is responsible for decline in hilsha population, there is little hope of salvaging the situation. The planet is definitely getting more and more hostile to all living organisms. Unless the nations stop using fossil fuels, the climate change will inevitably worsen the crises. All living species will find it harder to stay put. But at least the disposal of plastic and polythene can be made safe and secure. If rivers are spared such pollution, the sea that meets the countries of South Asia will have a better health. Such initiatives can ultimately help save fishes including hilsha from extinction.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Fishing bans fail to  arrest decline in  hilsha population",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/fishing-bans-fail-to-arrest-decline-in-hilsha-population-1759675642",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 06, 2025 00:00:00  \n\nIn Bangladesh, nothing terrifies the poor more than debt. For those struggling daily to secure a single meal, debt feels like a noose - impossible to swallow, impossible to throw off. Loans are often taken to survive: for rice, lentils, salt, school fees, hospital visits, or small personal needs. Yet, these very loans frequently become deadly traps.\nA mother borrowing to buy her child's school supplies may see hope, only to be crushed later by unbearable installment pressure. Bangladesh has a large impoverished population with 27.93 per cent of the people living below the poverty line. Nearly half of all families struggle with food insecurity. To meet basic needs, many are forced into debt.\nFarmers, who feed the nation, often live half-fed lives themselves. They borrow at high interest to plant crops, facing unfair prices and predatory syndicates. Repaying loans becomes nearly impossible; some take their own lives. In Mohanpur, Rajshahi, Akbar Ali hanged himself after failing to repay an NGO loan. In Bogura, Abdul Karim consumed poison under similar pressures. Legal harassment, mounting debt, and lack of support leave poor farmers destitute.\nDebt also fuels social unrest. In Savar, Dhaka, a young man killed his friend over a 1,500 BDT loan. Debt seems like temporary relief but eventually crushes lives. Meanwhile, the wealthy exploit loans as opportunities, forgiven when defaulting, while the poor face shame, humiliation, or even death. Loans intended to help the poor often trap them with high interest. Jobs are scarce, safety nets fail, and prices rise faster than incomes, leaving the vulnerable with no choice but to borrow.\nSolution lies in sustainable employment generation, price control of essentials, capping NGO loan interest, rescheduling loans for disaster-affected farmers, and humane debt recovery practices. Corruption in welfare programs must be eliminated, and high-interest lending sectors dismantled.\nDebt is it is a curse. Each suicide, murder, or legal case reflects a failure of society. If the state does not support the poor now, mountains of debt will continue to crush their hopes and lives. It is time to stand with the poor and give them a chance to live again.\nJobayda Islam Joya\nJagannath University\njobaydajoya25@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The curse of debt for the poor",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-curse-of-debt-for-the-poor-1759675682",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-10-2025"
    }
]