[
    {
        "full_article": "After Bihar, the Election Commission of India (ECI) has now embarked on a Special Intensive Revision (SIR) of electoral rolls in 12 States and Union Territories. Its stated goal is unambiguous — to update the rolls which have been affected by frequent migration, dead voters and other inaccuracies, which have been pointed out by political parties, the Congress in particular. Yet, the experience in Bihar suggests that the process, as envisaged, could risk the disenfranchisement of a significant number of people. It was conducted on a short timeline — roughly a month for enumeration and a month for claims and objections. The most significant change now is the formal provision of a “Notice period” for hearing and verification for about 54 days. The hurried approach in Bihar produced glaring statistical anomalies in the final roll. The gender ratio fell to 892 women per 1,000 men from 907 in the pre-SIR roll — well below recent survey figures for Bihar. Women voters were disproportionately excluded in areas with higher female than male turnout in the general election 2024, particularly in the 18-29 age group under the “permanently shifted” category. High female turnout relative to low registration typically indicates male migration, yet more women were deleted despite the SIR’s stated aim to remove migrants not “ordinarily resident”.These anomalies seem to be built into the ECI’s procedural framework, where the primary onus of verification is unduly borne by citizens and party representatives — Booth Level Agents — beyond Booth Level Officers. Expecting members from parties to ensure the inclusion of all eligible voters is problematic as they are more concerned about political competition. The ECI’s non-response to the anomalies — anyone left out can re-register with the help of BLAs — is inadequate. After the Supreme Court’s intervention, the ECI had to publish lists of all excluded voters with reasons, leading to some correction. An amended model is now being replicated across a larger canvas. While the ECI’s provision for BLOs to make three house visits is welcome, temporary migrants who might be absent during the enumeration window despite remaining “ordinarily resident” by law, could still lose out. The ECI’s stated mitigation, allowing electors to fill the Enumeration Form online, is insufficient. This provision overlooks the digital divide and literacy challenges, placing an undue burden on voters who are not physically present to be assisted by a BLO. As this exercise unfolds, it is incumbent upon civil society, the media and parties to assume a role of intense vigilance lest this affects the integrity of India’s electoral democracy. Published - October 28, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Bihar\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        General Elections 2024\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        politics and government\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        Indian National Congress",
        "headline_1": "Devil in the details: on the next phase of the Election Commission of India’s SIR",
        "headline_2": "ECI’s SIR must not repeat Bihar’s glaring anomalies",
        "link": "https://www.thehindu.com/opinion/editorial/devil-in-the-details-on-the-next-phase-of-the-election-commission-of-indias-sir/article70209533.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-10-2025"
    },
    {
        "full_article": "The Kurdistan Workers Party’s (PKK) announcement that it would withdraw all its fighters from Türkiye to northern Iraq marks a significant step in the peace process between Kurdish militants and the Turkish state. When the group’s imprisoned leader, Abdullah Öcalan, called on the PKK to disarm and dissolve in February, many doubted whether the outfit would honour his appeal. It has been waging an insurgency for decades. But in March, its executive committee declared that “none of our forces will take armed action unless attacked”. On May 12, the group announced its full dissolution, and that its demands could be met through “democratic politics”. Its fighters even held a symbolic weapons destruction ceremony. The group’s demands have changed over the years. An initial demand for an independent state for the Kurds was later moderated to greater rights and limited autonomy for the Kurdish region. But decades of violence, which claimed some 50,000 lives, seem to have blunted the PKK’s appetite for insurgency. Mr. Öcalan has been in jail since his capture in February 1999, while most of the group’s senior commanders operate from northern Iraq, which is periodically bombed by Türkiye. Political groups linked to the PKK have faced sustained crackdowns inside Türkiye.Türkiye’s President Erdoğan has called the PKK’s decision to disarm “an irreversible turning point”. He has also appointed a 51-member cross-party parliamentary commission to chart the path forward. But the rebels are pressing for faster and firmer legislative action that would allow them to join “democratic politics”. Türkiye’s southeastern Kurdish regions have endured decades of military operations, displacement and economic stagnation. They deserve peace. The PKK is still a banned, terrorist organisation in Türkiye and allied countries. For the peace process to hold, Türkiye needs a new legal framework, governing amnesty, political participation, and the protection of Kurdish cultural and linguistic rights as the militants transition into political life. Without clear laws, disarmed PKK fighters could remain stranded in the mountains of northern Iraq, while their supporters at home would feel betrayed. Peaceful resolution of the Kurdish question could offer a template for addressing Kurdish grievances across the region — Iraq, Syria and Iran. Conversely, failure could reignite Türkiye’s conflict and embolden hardliners elsewhere who insist that states understand only force. Mr. Erdoğan should match the PKK’s decision with irreversible measures, including releasing Mr. Öcalan, easing restrictions in the Kurdish region and enacting laws that end the conflict and open a new chapter for Türkiye. Published - October 28, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Turkey\n                    \n                            /                      \n                        \n                        Iraq\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        Syria\n                    \n                            /                      \n                        \n                        Iran\n                    \n                            /                      \n                        \n                        politics and government\n                    \n                            /                      \n                        \n                        conflict, war and peace",
        "headline_1": "New chapter: on Türkiye and the Kurdistan Workers Party’s announcement",
        "headline_2": "Türkiye must ease restrictions in the Kurdish region and release Öcalan",
        "link": "https://www.thehindu.com/opinion/editorial/new-chapter-on-turkiye-and-the-kurdistan-workers-partys-announcement/article70208922.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-10-2025"
    },
    {
        "full_article": "How southern cities connect with northern elections\nThe Blinkit Bhaiyya had provided me with my morning milk and enough material to start an animated discussion on politics. Janu, there are two phases in the Bihar elections, I announced authoritatively to my wife. Kamala looked puzzled for a moment, then bent herself into a tribhanga pose, and countered, ‘First, why are we even talking about Bihar elections in Bangalore? Also, you can’t call people two-faced just because they promise great things in an election rally and then don’t live up to their promises. That’s a universal phenomenon. There are Indian words for that – like jumla and jugaad. We don’t need references to a Roman god! We have a whole pantheon of our own – including Banke Bihari.’\nThere are lots of faces in this election. Some have been around for very long and some have only started making their presence felt recently. Even if it’s mostly Prashant Ki Shor. What about nepotism and dynasty – is that an issue here? I am told in politics there are not only strange bedfellows, there is also an extended family of miscellaneous relatives like at a Diwali dinner. Not just nepo kids, there are nepo brothers and uncles and aunts.\nAs I shared a samosa with Kamala, I reminded her of the famous potato politics of Bihar – Jab tak rahega samosa mein aaloo…Kamala however was very distracted by picking out peas from her samosa and muttered, ‘I wish they wouldn’t confuse us by stuffing samosas with peas and beetroot and broccoli. Keep the samosa sacred!’ Before she started off a rant on sanskaari samosas and our mahagathbandhan began to unravel, I tried to gently change the topic. I said, you can’t just have potatoes in a samosa – people want variety.\nThey want the potato that can be put into a magical machine and turned into gold for the state – employment, law and order, solid infrastructure and good governance. Every election promises these, but finally when it’s time to cast votes, other factors seem to caste a shadow. In spite of there being a ghar ka Chirag and a lantern in the fray, power cuts continue to plunge Bihar into a metaphorical darkness. But Kamala had had enough of our domestic newshour debate and I was left remembering Blinkit Bhaiyya, who had travelled far looking for basic employment, saying wistfully, ‘Zindagi jhandwa, phir bhi ghamandwa.’\n\n",
        "headline_1": "Politicians & Promises",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/politicians-promises/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-10-2025"
    },
    {
        "full_article": "How serious is India about air quality if its capital’s pollution meters conk out on the year’s most polluted night?\nOstriches don’t bury their heads in sand when faced with danger, but some other two-legged creatures do. As TOI reported on Monday, Delhi’s air quality didn’t plummet to ‘severe’ a day after Diwali simply because when crackers started turning the capital into a gas chamber around 10pm on Oct 20, its air monitoring stations mysteriously malfunctioned.\nCracker smoke and particulate matter gradually build up in air, and clear out over many hours next day. As such, post-Diwali air is at its most hazardous from about midnight to sunrise. Until 10pm on Diwali, when air quality had already slipped into ‘severe’ category, all 39 stations were working. Then, as Central Pollution Control Board’s data shows, the information stream dried up. By 1am on Oct 21, only 19 stations were functional; two hours later, 12. It was only around 8am – by when much of the cracker pollution had cleared – that almost all stations became functional again.\nAltogether 163 hours of Diwali AQI data from the peak pollution hours is missing this year, as against only 34 hours of data in 2024. So, nobody knows how bad Delhi’s air got on Diwali, and what impact green crackers had on it. Without strong, dependable data – in terms of both quantity and quality – how do you shape policy?\nUnfortunately, India has not been serious about air quality, even though pollution is estimated to reduce average life expectancy in the country by 5.2 years. It has 13 of the world’s 20 most polluted cities. A small place like Byrnihat, on the Assam-Meghalaya border, has become the most polluted in the world thanks to rampant industrialisation. Delhi has been the most polluted capital for six years in a row. Where WHO recommends PM2.5 – very fine particles – in air shouldn’t exceed 5 micrograms per cubic metre of space, it’s at 124 in Delhi as we write this, a week after Diwali. Meanwhile, China has shown good air and development can go hand in hand – only one of its cities figures in the worst 20 now. The template already exists for India, what’s missing is the will.\n\n",
        "headline_1": "Just Hot Air",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/just-hot-air/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-10-2025"
    },
    {
        "full_article": "Good that EC’s 12-state roll revision incorporates lessons learnt in Bihar. But the commission needs to do more\nAs EC launched the special intensive revision of voter rolls for 12 more states, it also expressed satisfaction with how SIR proceeded in Bihar – zero appeals to the Sept 30 final rolls indicated full satisfaction. But let’s note that anxiety caused by the hastily announced exercise on June 24 was addressed by Supreme Court’s interventions – putting off submission of documents, asking EC to consider Aadhaar. These changes will be part of the new SIR. But…\nMake new rules widely accessible | EC has said while it’ll have additional instructions, the June 24 circular is applicable pan-India. Updated guidelines are available with media and election officials. But, especially because the new enumeration form that the 12 states will use stands altered with new fields, it is essential that EC make all rules available on its website. Elections are about voters, and they must be able to easily access the detailed SOP. It will help make the exercise more robust. The Aadhaar question, for instance, was settled during Bihar’s SIR. The updated SOP includes that, but the now widely available June 24 circular does not. This can trigger further confusion.\nParents’ documents | There’s also confusion on the question of proving citizenship via parentage. Leave aside the fact that the question whether EC can decide on citizenship is in SC. If an individual has requisite authentic documents, can a BLO put off their eligibility basis his/her ‘suspicion’, as written in the June 24 circular? Further, in Bihar, an organisation of young adults who’ve grown up in state care had requested EC to exempt them from the requirement of showing parents’ documents? This issue too is left unresolved. What about such vulnerable groups?\nPoll-bound states | Bihar’s SIR triggered a climate of distrust among opposition states. EC must address this to all parties’ satisfaction. Poll-bound state Tamil Nadu’s CM Stalin has accused state opposition of seeking to disenfranchise working class people, SCs, minorities and women through SIR. In Bengal, there is fear that the ‘infiltration’ bogey will be used to disenfranchise or wrongly add voters. Voter rolls, if weaponised as a poll rhetoric by parties, can create trust deficit among voters. It is on EC to not only protect the fairness and integrity of its processes, but also to be seen to be doing so.\n\n",
        "headline_1": "SIR, Please Note",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/sir-please-note/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-10-2025"
    },
    {
        "full_article": "Clashes between Pak military and Taliban show that Islamabad’s strategy of nurturing militancy has spectacularly backfired. The AfPak frontier is now an open wound\nThe recent cross-border clashes between Pakistan and Taliban mark the collapse of one of Islamabad’s longest-held strategic doctrines – the idea of “strategic depth” and Pakistan’s perception that Afghanistan was its backyard.\nRead full story on TOI+\n\n",
        "headline_1": "End of Pakistan’s ‘strategic depth’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/end-of-pakistans-strategic-depth/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 28, 2025 00:00:00  \nDhaka District's preeminence on account of the capital city it hosts is quite logical. But such a primacy is not axiomatic. In many countries commercial capitals outstrip their administrative capitals particularly on the strength of economic muscle. Even in Bangladesh, Chattogram had the potential of surpassing Dhaka. Now Dhaka's supremacy is both a blessing and a bane. The paradox could not be more glaring when the district's GDP and per capita income are taken into account as against its poverty rate compared with the national average. A new economic analysis based on the Economic Position Index (EPI), only the second homegrown economic index in the country developed by the Dhaka Chambers of Commerce and Industry (DCCI), finds that Dhaka District alone boasted 46 per cent of the national GDP estimated at $462 billion in the financial year 2024-25. Following this, its inhabitants enjoy nearly double the per capita income estimated at $5,164 as against the national average of $2,820. \nThat this striking contrast is due largely to the capital city is understandable. This megacity has not only remained the centre of administration but also served as the throbbing commercial, economic and employment hubs of the nation. Development of the DCCI index (EPI), as its president claims, was necessary to overcome the limitations of local and international indices tracking the business environment. Since the existing indices fail to capture the 'real dynamics and drivers of economic activity, the EPI has been developed to present a quarterly authentic picture. However, the duration of the study of only two months from February to March has its own limitation because seasonal variation of commerce and economic activities cannot be ruled out. Even the number of respondents 654 respondents ---365 from manufacturing sector and 289 from service sector may not present an accurately representative picture. \nBut about the concentration of wealth and opportunities, there is hardly any dispute. This megacity is home to the country's highest number of millionaires. In contrast, it also hosts the largest number of slum dwellers in the country. They and the poor living in all across the district account for the 19.6 per cent poverty rate as against the 19.2 per cent national average. Thus the paradox is not just theoretical but also a stark reality. The poor and marginal segments of the district fare far worse than their counterparts living elsewhere in the country. It can be compared with the darkness right below the lamp. The inequality is more glaring here than in the rest of the country.\nYet the metaphor highlighting disorder concerning concentration of blood in the face depriving the rest of the body applies to the accumulation of wealth in this megacity. It deprives not only the hapless slum dwellers and the poor living in the district but also the entire population sans the fortunate few. To the unease of the economists and development practitioners, the disparities and discrimination are hardly narrowing down. Lately those are rather yawning. Now that the leaders of the DCCI have made the focus on distribution of wealth sharper, courtesy of the (EPI), they should work together with other chambers of commerce and the government to find a step-by-step solution to the socio-economic discrimination. No economy stands a bright prospect on staggeringly unequal opportunities and distribution of wealth.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Dhaka's preeminence and the paradox",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/dhakas-preeminence-and-the-paradox-1761579230",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       October 28, 2025 00:00:00  \nThe border between Pakistan and Afghanistan has always been more than a line on a map. It is a frontier where geopolitics, history, and mistrust converge - often violently. Today, as tensions flare once again along the Durand Line, the prospect of another conflict in this fragile region casts a long and troubling shadow. For South Asia - a region already burdened with poverty, political instability, and developmental setbacks - a new clash between Islamabad and Kabul would be nothing short of catastrophic.\nThe immediate triggers of the current strain are well known: cross-border militancy, allegations of harbouring insurgents, and retaliatory military strikes. Pakistan accuses Afghanistan's Taliban government of allowing the Tehrik-i-Taliban Pakistan (TTP) to operate freely from Afghan soil. Kabul, in turn, claims Pakistan continues to shell civilian areas in the name of counterterrorism. Yet beneath these accusations lies a deeper and more persistent mistrust - one that dates back to the very birth of the two nations.\nAfghanistan was the only country to vote against Pakistan's admission to the United Nations in 1947, rejecting the Durand Line as an artificial colonial creation that divided the Pashtun tribes. Decades later, the ghosts of that refusal still haunt bilateral ties. The rise and fall of the Taliban - twice now - has done little to bring stability or mutual confidence. Instead, it has turned the borderlands into an ungoverned wilderness where both states accuse each other of exporting insecurity.\nBut while these grievances may feel timeless, the stakes today are far greater. South Asia cannot afford another war - even a limited one. It is a region of immense potential but persistent fragility. More than one-third of its 1.8 billion people live in poverty. Food insecurity, climate change, and youth unemployment threaten to erode social cohesion. For countries like Pakistan, Afghanistan, Bangladesh, and Sri Lanka - each grappling with economic distress - even the tremor of regional instability could trigger political and financial aftershocks.\nPakistan itself stands at a precarious crossroads. The country's economy is struggling to stay afloat under an IMF programme, its rupee continues to slide, and inflation remains punishingly high. Any prolonged military confrontation - even a low-intensity border conflict - would derail its fragile recovery, diverting scarce resources from development to defence.\nAfghanistan, meanwhile, remains in dire straits. Since the Taliban's return to power in 2021, the country has been cut off from the global financial system. Sanctions, aid suspensions, and isolation have driven millions into poverty. The United Nations estimates that more than 23 million Afghans - over half the population - face acute food insecurity. In such circumstances, sabre-rattling with a powerful neighbour is not a show of strength but an invitation to catastrophe.\nThe tension also poses serious implications for the wider South Asian region. The fragile peace in the subcontinent relies on a delicate balance: India and Pakistan maintaining their uneasy détente, China's influence being cautiously managed, and Afghanistan not becoming a safe haven for transnational militancy. Should Pakistan and Afghanistan descend into open hostility, all these balances could collapse.\nMilitant groups that thrive in chaos would find renewed purpose. Refugee flows could destabilise neighbouring Iran and even reach as far as Central Asia. Bordering nations like Iran, China, and India would be forced to recalibrate their security postures, while trade routes through Pakistan and Afghanistan - once touted as potential corridors for regional integration - would instead become frontlines of confrontation.\nWhat South Asia desperately needs today is not another war but a Marshall Plan for peace and prosperity. Nearly every country in the region is battling an economic crisis of one form or another. Pakistan, Sri Lanka, and Bangladesh are all under IMF programmes. Nepal's remittance-dependent economy is stagnating. Even India, the fastest-growing major economy, faces rising unemployment and deep rural distress.\nThe South Asian region, by World Bank estimates, could add nearly 2 per cent to its collective GDP through enhanced intra-regional trade. Yet it remains one of the least economically integrated regions in the world. Political mistrust, protectionism, and unresolved disputes have kept borders closed and economies isolated.\nConflict between Pakistan and Afghanistan would push that goal even further out of reach. The Pakistan-Afghanistan border, for all its insecurity, is a vital commercial artery. From fruit traders in Kandahar to truckers in Peshawar, thousands depend on cross-border movement for survival. A closure or militarisation of that frontier would devastate local economies and further impoverish already marginalised communities.\nMoreover, the impact would ripple beyond the immediate neighbourhood. The vision of connecting South Asia with Central Asia through trade corridors - the very logic behind initiatives like the China-Pakistan Economic Corridor (CPEC) - hinges on a stable Afghanistan. If Kabul and Islamabad turn hostile, those investments will wither, and regional connectivity will remain a dream deferred.\nSouth Asia's history offers sobering lessons. The wars of 1948, 1965, and 1971 left enduring scars on Pakistan and India - not only in blood but in squandered opportunity. Decades of hostility diverted billions from education and health to defence budgets. Afghanistan's four decades of conflict, meanwhile, have turned a once-thriving crossroads of civilisation into a humanitarian tragedy.\nAnd yet, the world has changed. In the 21st century, power no longer flows merely from tanks and borders but from innovation, trade, and human capital. East Asia's transformation from a battlefield to an economic powerhouse should serve as a lesson for South Asia. Vietnam, Japan, and South Korea overcame bitter wars to become hubs of prosperity. Why must South Asia remain trapped in its own vicious cycle of insecurity?\nBoth Pakistan and Afghanistan must recognise that their destinies are intertwined - not by choice, but by geography and history. They share ethnic ties, linguistic roots, and centuries of cultural exchange. Their people suffer from the same scourges: poverty, illiteracy, and political neglect. Instead of weaponising their shared pain, they could transform it into shared progress.\nThis will require courage - particularly from the leadership in Islamabad and Kabul. Pakistan must refrain from treating Afghanistan solely through a security prism. Its obsession with \"strategic depth\" has only deepened resentment. Instead, Islamabad should engage Kabul through economic cooperation, infrastructure investment, and humanitarian support.\nAfghanistan's Taliban rulers, for their part, must prove that they can act as a responsible state, not a revolutionary movement. Their reluctance to rein in the TTP undermines not just Pakistan's security but their own credibility as a government capable of maintaining order. The Taliban's pursuit of \"Islamic brotherhood\" must extend beyond rhetoric to tangible measures of trust-building - joint patrols, intelligence sharing, and economic integration.\nRegional stakeholders - notably China, Iran, and India - have a crucial role to play in defusing tensions. China, with its economic leverage over both Pakistan and Afghanistan, can push for restraint and dialogue. Iran, which shares borders and refugee burdens with Afghanistan, has every incentive to prevent further instability. India, while wary of the Taliban, should view peace in Afghanistan not as a zero-sum loss to Pakistan but as a regional public good.\nThe international community, too, must abandon its piecemeal engagement with Afghanistan. Isolating Kabul only strengthens hardliners and weakens moderates. Humanitarian aid and limited financial access should continue - not as endorsements of the Taliban, but as lifelines for the Afghan people. A starving population is fertile ground for extremism; feeding them is an investment in peace.\nThe world cannot afford another war in South Asia. The last one - in Kargil, a quarter of a century ago - brought two nuclear powers to the brink. Today, with both Pakistan and India armed with larger arsenals, and Afghanistan governed by a regime outside international norms, the risks are exponentially greater.\nFor Pakistan and Afghanistan, the choice is stark but simple: confrontation or cooperation. The former will ensure a future of perpetual instability, economic ruin, and diplomatic isolation. The latter could open the door to a new regional awakening - one where South Asia, finally, begins to live up to its promise.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "South Asia can't afford  another war",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/south-asia-cant-afford-another-war-1761579270",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       October 28, 2025 00:00:00  \nHas the Myanmar Army now been gaining the upper hand over the rebels and regaining territory lost to the rebel forces so far? A BBC report says that with the support of China, the Myanmar army has intensified air strikes against the rebel held positions. Earlier, when the Myanmar government forces were losing their fight against the insurgent forces, it was thought that the morale of the military junta in Naypyidaw was crumbling. But this month, it recaptured Kyaukme from the Ta'ang National Liberation Army (TNLA). Previously, the insurgent TNLA forces gained control of the Kyaukme town, which is located on the main trade route from the Chinese border to the rest of Myanmar. Earlier, that town was captured by the insurgent army, TNLA, from the government forces through several months of hand-to-hand combat. That success of TNLA was seen by many observers as the turning point in war by the opposition forces against the armies of Naypyidaw. But this month in just three weeks of fight, the junta army retook the town in which rebel forces faced severe losses as large part of Kyaukme has been razed to the ground by the government forces.\n In fact, since the beginning of the war against the opposition movements and their armed resistance, the junta forces' strategy has been one of 'scorched earth policy'. In this strategy, the attacking army destroys anything that might be useful to the enemy including crops, infrastructure and resources. The Myanmar forces has been doing exactly that against the rebels. The government army has meanwhile recruited more personnel, in most cases by force from among the citizens, into the armed forces. There are also reports of kidnapping of people in addition to mandatory conscription of people of all age groups into the army. Also, there are reports that Rohingya men, arrested by the government forces during their raids into the Rohingya villages, are being forced to join the government forces to fight the rebel army in the Rakhine State. So, the Myanmar government forces have clearly been reinvigorated through Chinese support as China, it could be further learnt, in a bid to give legitimacy to the junta government, wants it to hold an election in December. However, the plan has reportedly been widely condemned since it does not include Aung San Suu Kyi's National League for Democracy (NLD). Notably, the Suu Kyi's NLD won the last election and formed government, but the miliary chief, General Min Aung Hlaing, toppled that government in a coup d'etat in February 2021. In response, the opposition's democratic resistance began resistance movement against the military rule, which the junta government crushed with brute force. The popular resistance against the military junta then started all across the country with which the ethnic rebel groups, who have been fighting against the government for decades, initially joined hands. \nBut the lack, on the part of the resistance movement, of a centralised command is being rather helpful for Myanmar junta forces. The insurgent ethnic rebel forces, too, harbour deep mistrust of the ethnic Burmese majority and their National Unity Government (NUG) formed by the anti-junta opposition groups. Unfortunately, their ragtag 'people's defence forces (PDFs)' comprising local villagers and young people fleeing cities to avoid government repression and recruited for PDFs were no match for the government army. However, in Bangladesh, our main concern is about the fate of the Rohingyas. Though of the 24 townships in the Rakhine State, Aarakn Army (AA) took control of 17, Siitwe, the state's capital, is still controlled by the junta forces. The junta forces are reportedly fortifying their positions there. Bangladesh government should keep close watch on the developments.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Is Myanmar resistance in retreat?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/is-myanmar-resistance-in-retreat-1761579303",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 28, 2025 00:00:00  \n\nOnce, young people dreamt of becoming doctors, engineers or artists. Today, many dream of becoming millionaires overnight. The boy who once tutored or worked a small job to stand on his own feet is now lost in the illusions of gambling. What seems like a shortcut to wealth is, in reality, a dark tunnel leading to ruin.\nThis trend is spreading rapidly across Bangladesh, especially among unemployed youth. With mobile phones, internet access, and easy-to-use gambling apps, temptation is always at their fingertips. Gambling now occurs openly-in buses, tea stalls, even classrooms-on cricket, football, and online games. What begins as curiosity or boredom quickly becomes a dangerous addiction. The thrill of winning triggers dopamine, creating a vicious cycle that leads to repeated losses, debt and psychological breakdown.\nThe consequences are devastating. Families lose savings, jewelry, and financial stability. Young people, once cheerful and hopeful, become stressed, dishonest, and desperate, sometimes turning to theft or even suicide. At the national level, gambling drains the youth-the backbone of the country-hampering productivity, encouraging crime, and slowing progress.\nLaws alone cannot solve this crisis. We need awareness campaigns, rehabilitation centres, psychological support, and above all, opportunities for meaningful engagement. Families, schools, and the media must guide youth towards real dreams-built on hard work, talent, and integrity rather than luck. By creating jobs, developing skills, and fostering positive activities, we can fill the void that drives young people to gamble.\nIf urgent action is not taken, the nation risks losing \nits most valuable asset: its young generation. \nProtecting them today ensures a brighter, sustainable future for all.\nIbrahim Khalil Shobuj\nug2108037@lla.pstu.ac.bd\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Dangerous trap of gambling",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/dangerous-trap-of-gambling-1761579326",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-10-2025"
    }
]