[
    {
        "full_article": "Last week, the Supreme Court of India finally struck down as “illegal” two notifications by the Union Environment Ministry that allowed industrial units to set up, expand operations or change their manufacturing practices without following the due process of taking government permission beforehand. Taking ‘prior’ approval is a sacrosanct principle at the heart of the Environment Impact Assessment (Notification) of 2006. On the surface it appeared that the Centre, or the Union Environment Ministry, had instituted a system that made a mockery of this principle, but there was a rationale, even if it was flawed to some extent. In March 2017, the body issued a notification providing a “one-time” six-month window for industries that did not have the right environmental clearances, to apply for one. In 2021, it instituted a ‘standard operating procedure’ that in effect allowed projects in violation of the laws, but which could not avail of the six-month window, to apply — albeit at the cost of heavy fines — for regularisation. Moreover, all these significant changes were being issued through executive orders, rather than any attempt at amending the underlying Environment Protection Act (EIA), 2006, through Parliament.The Centre’s reasoning was three-fold. First, the process for regularising projects had already been initiated by the United Progressive Alliance government in 2012 and 2013. These were, however, struck down by the Jharkhand High Court and the National Green Tribunal on procedural grounds, and not that these projects were irredeemably violative. Second, demolishing functioning plants that were contributing to the economy and employment could exacerbate pollution and be disruptive. The Centre cited examples of various disputes involving copper mines to pharmaceutical companies where the courts had agreed that a “balanced” approach was necessary in cases involving violations. Finally, it argued that it had put in place a system whereby the industrial units seeking to be regularised would have to pay fines for the period that they had functioned in violation. The Court in its final verdict has rightly, as previous courts have, emphasised the principle of “prior” clearance, though its action may be a little late as it has clarified that companies that had regularised themselves under the 2017 and 2021 orders would be “unaffected” by the judgment. That thriving industrial units in violation of the laws mushroomed is a testament to the collective failure of regional environmental boards to enforce laws. So it stands to reason that making these illegal units pay, under the purported new procedure, would have been a fruitless exercise. The judgment should ideally nip any “crafty” attempts by future governments to condone violations in the name of the economy though it must also trigger on-ground enforcement. Published - May 21, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        environmental issues\n                    \n                            /                      \n                        \n                        United Progressive Alliance\n                    \n                            /                      \n                        \n                        Jharkhand\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        pollution\n                    \n                            /                      \n                        \n                        employment",
        "headline_1": "​Stitch in time: on judiciary and Environment Ministry notifications",
        "headline_2": "Making illegal units pay heavy fines might have limited deterrent effect",
        "link": "https://www.thehindu.com/opinion/editorial/stitch-in-time-on-judiciary-and-environment-ministry-notifications/article69597948.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "21-05-2025"
    },
    {
        "full_article": "In an escalation of bilateral trade-related tensions, India recently announced restrictions on readymade garments and other specified commodities from Bangladesh. The Directorate General of Foreign Trade’s announcement targeting Bangladesh’s vital apparel sector sent an unmistakable signal that deteriorating political relations have now spilled over into economic ties. By specifically denying Bangladeshi goods access to India’s northeast market, New Delhi has delivered a pointed message to Mohammed Yunus, Bangladesh’s interim leader, who during his visit to China in March 2025 had invited Chinese access to India’s northeast through Bangladesh, describing the northeast as landlocked. While India’s discomfiture about Bangladesh-China discussions regarding India’s northeast is understandable, this trade restriction may hurt Bangladeshi businesses, largely dependent on garment export, but will do little to aid New Delhi’s strategic interests. Bangladesh’s recent political turmoil stems from protests against its former elected government, and the interim leadership — struggling with resistant bureaucracy and ongoing instability — has blamed New Delhi due to its perceived close ties with the previous administration led by Sheikh Hasina. The Yunus-led administration’s warming up to Pakistan, and its ban on the Awami League — actions that go against its promises to the international community — have worsened relations. The imperative for New Delhi must be to come up with a deft outreach to other political parties in Bangladesh as they prepare for elections. While Mr. Yunus had announced that elections will be held later this year, there is still no clarity on the date.New Delhi must, in consonance with the rest of the international community, advise the regime to conduct elections quickly. A political gesture of this nature while engaging with multiple stakeholders in Bangladesh’s polity is more appropriate than using restrictive moves related to trade, as this would only heighten the anti-India sentiment being fanned by some elements in Bangladesh after the Awami League government’s exit. Such radical elements, many of whom have little investment in the restoration of democratic processes, could also create fresh law and order problems that could lead to security issues in the northeast. India should carefully lay out its response keeping in mind that while it has to communicate its displeasure to the Yunus government, it also has to maintain working relations with this administration till a popularly elected government takes charge in Dhaka.\r Published - May 21, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        trade policy\n                    \n                            /                      \n                        \n                        trade dispute\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Bangladesh\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        Arunachal Pradesh\n                    \n                            /                      \n                        \n                        Assam\n                    \n                            /                      \n                        \n                        Manipur\n                    \n                            /                      \n                        \n                        Meghalaya\n                    \n                            /                      \n                        \n                        Mizoram\n                    \n                            /                      \n                        \n                        Nagaland\n                    \n                            /                      \n                        \n                        Tripura\n                    \n                            /                      \n                        \n                        Sikkim",
        "headline_1": "​Trade diplomacy: on India-Bangladesh trade-related tensions",
        "headline_2": "Trade restrictions against Bangladesh will not have much coercive value",
        "link": "https://www.thehindu.com/opinion/editorial/trade-diplomacy-on-india-bangladesh-trade-related-tensions/article69597923.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "21-05-2025"
    },
    {
        "full_article": "As the heat index rises, India must do both active & passive cooling much better, for Indians to flourish\nThe planet is getting hotter. Its average surface temperature in 2024 was the highest on record. But temperature is one thing, felt heat another. No thanks to humidity, in cities like Delhi and Hyderabad, “real feel” temperature can be 10°C higher than what thermometers show. This is the heat index. And as it climbs, so does power consumption. Industry voices say demand for ACs has doubled in four years. NFHS 5 found that 40% of urban and 16% of rural households have an AC/cooler. The rest are restrained by the affordability barrier. And yet, the let everybody have cake kind of solution is no solution. It’s well-known how more ACs mean more heat island effect.\nIndia needs to make a big picture revision to both active and passive cooling. The first is a hard technology matter. For example, with an estimated third of AC electricity use going to remove moisture, a US startup is working on metal-organic frameworks that do much more energy efficient dehumidification. Indian engineers need to crack something like this. Window units became affordable in other parts of the world 50 odd years ahead of us. This time, let’s get ahead of the curve. Lee Kuan Yew insightfully said that air conditioning changed the nature of civilisation by making development possible in the tropics. Access to cooling is about having high productivity, good health, good education. It’s about human flourishing.\nNot all solutions lie in the future though. Some lie in our past. Builders have to stop building as if they haven’t even heard of global warming, when traditional Indian constructions hold precious knowledge about heat insulation. Think clay tile walls, mud caulking, ventilating and shading features, even khus curtains. It’s not just about the high-rises. The less privileged find their homes turn from shelter to furnace when the high sun hits the tin roofs. Whether it is the sprawl of this tin across the country or the flooding of Bengaluru at the other extreme, a citizen can be forgiven her despair about whether change is possible. It is, however, essential.\n\n",
        "headline_1": "Escaping the furnace",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/escaping-the-furnace/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-05-2025"
    },
    {
        "full_article": "Could India and Pakistan be unwitting pieces in a devious game of Chinese chequers?\nTwo Chinese generals, Mi and Yu, congratulating themselves on the success of their Operation Springing Tiger.\nMi: Even if I do say it myself, our secret plan worked out very well. In fact, it worked out even better than I had hoped it would.\nYu: It certainly did, didn’t it? All thanks to the predictable actions and reactions of the two players who played our game without even knowing it.\nMi: First, we encouraged one of them to launch a terrorist attack on the other, which didn’t need much encouragement.\nYu: Then the player who was attacked inevitably struck back, which made the first player escalate hostilities.\nMi: Exactly as we planned. With both players engaged in a shooting match, our objective was achieved.\nWhich is to keep all of them on the boil, or in the wok, as it were. Fireworks are always good for business. That stands to reason, right. After all, it was we who invented gunpowder centuries ago.\nYu: So now, more will line up to buy our weaponry, some of it anyway, and apart from exporting cheap phones, and TVs, and laptops, and fireworks, and other gewgaws, we’ll also become a big arms exporter.\nMi: And the best part is that share prices of our arms company went up briefly. And thanks to our insider trading, we made a killing.\nYu: And we can make more of a killing by prompting others to do the killing on our behalf by using our weapons to fight each other.\nMi: We’ve already got some ready-made customers. And we can always drum up more with what might literally be called aggressive marketing.\nYu: I like our plan more and more. Or should I say war and war…?\n\n",
        "headline_1": "Hidden dragon",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/hidden-dragon/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-05-2025"
    },
    {
        "full_article": "Times change but world’s trust in gold as a store of value doesn’t. Good reasons for that\nThere’s a legend – not undisputed – that Roman soldiers were sometimes paid in salt. Hence, the word ‘salary’. With table salt at around 35 cents a kilo, it won’t do today. Even the lowest ranks would need a truck to cart away their wages. But gold, the other ancient store of value, soldiers on. About 15 years ago, Duke University researchers calculated that a Roman centurion – paid 38.6 ounces or roughly 1.1kg of gold per annum – was 30% richer than a US army captain. Since then, the price of gold has risen 3.6 times, which is unlikely to be the case with US army salaries.\nIt’s not surprising then that nothing, from Dutch tulips to crypto, has dulled gold’s appeal. Stocks are a steady parallel, but everything else comes and goes like a fad. Gold is precious because it’s rare – not more than 6 parts per billion in earth’s crust, but up to 8,740ppb in meteorites – but that’s only half the story. Iridium and osmium are even rarer, and pricier, but the world isn’t lining up to buy them. Iridium’s price doesn’t shoot up or plummet with Trump’s mutterings. When gold hit its all-time high on April 22, iridium was at its lowest this year. That’s not to say gold never takes a tumble. It fell big in 1975-76, and in 2008, only to recover and scale greater heights.\nTalking of Trump, gold is also a measure of the madness of his schemes. When he hit China with bigger tariffs on April 9, gold swung up. He took shots at US Fed chief Jerome Powell, gold moved up even higher. When he backtracked, gold swung down promptly. It just goes to show that, when times look bad, ancient gold – not newfangled stocks and derivatives – get our vote of confidence. If gold continues rising, it’s a sign of more instability ahead, some of it Trump-induced. But if Trump makes good on his promise to personally check all the gold in Fort Knox – 4,175 tonnes or some 3.4L bars – there could be a few weeks’ respite.\n\n",
        "headline_1": "Golden rule",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/golden-rule/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-05-2025"
    },
    {
        "full_article": "Congress’s two-day slugfest with GOI was two days too long. After all, veteran Shashi Tharoor’s selection to participate in India’s all-party international outreach post the India-Pak military faceoff was, as insiders pointed out quickly enough, a wrong battle to pick, even if not entirely a ‘non-battle’.\nThe standoff surprised many within Congress. When GOI contacted four Congress veterans – Tharoor, Salman Khurshid, Manish Tewari and Amar Singh – to be part of the delegation on Friday, all of them informed the leadership of the development, with two also conveying they would do as the party wished. And when parliamentary affairs minister Kiren Rijiju spoke to Kharge and Rahul Gandhi to seek their nominees, they immediately replied with four names.\nTrouble started on Saturday when GOI – having decided to do its own thing regardless of what its minister had conveyed to Congress – started announcing its seven delegation heads. One of them was Tharoor.\nCongress spokesman Jairam Ramesh accused govt of playing “cheap politics” and said the party had not nominated the diplomat-turned-MP. Rather, it had chosen Anand Sharma, Gaurav Gogoi, Naseer Hussain and Raja Warring. Tharoor promptly said he would “not be found wanting” in national service. That was throwing a gauntlet at a party already irked by the Kerala MP’s recent defence of Modi govt, especially with reference to Trump’s role in the India-Pak ceasefire.\nRead full story on TOI+\n\n",
        "headline_1": "Tharoor in the world & his party in a funk",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/tharoor-in-the-world-his-party-in-a-funk/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-05-2025"
    },
    {
        "full_article": "After the shocking news of popular actress Nusraat Faria's arrest at Dhaka airport in an attempted murder case and that she was sent to jail, it is a relief to know that she finally got bail on Tuesday. Even in this current environment where arbitrary murder cases are being filed against hundreds of individuals thought to be Awami League sympathisers or beneficiaries, this arrest was particularly jarring.\nNusraat Faria has been accused in an attempt-to-murder case along with 265 other people, 17 of them actors. The victim, who filed the case, suffered bullet injuries on July 19 last year during the student-led mass uprising.\nHow believable is this accusation—that Nusraat was somehow involved in causing the bullet injuries of a man in the Vatara area?\nApparently, the allegations against Nusraat and the 264 other accused include financing the AL during the quota reform protests. First of all, what does this mean? Did they pay money to the AL regime to help them shoot down protesters? Does this not sound illogical, if not ludicrous? If any of the accused have had underhanded deals with the AL regime that benefited them financially, then they should be accused of corruption, and cases can be filed on that basis. But to file cases against hundreds of individuals whose links to the killings of protesters are downright flimsy, if not preposterous, leads to only one conclusion: that these individuals are being harassed due to some link or the other with the AL regime or because of someone's personal grudge.\nIn Nusraat's case, it could be mere professional jealousy, or it may be because she played Sheikh Hasina in a biopic on Sheikh Mujibur Rahman, or both. Does this mean any actor or anyone associated with this movie can be accused of being involved in Hasina's brutal crackdown on protesters? Will this bring justice for those killed or solace to those grieving their loved ones? Can we equate those who actually pulled the trigger and those who ordered them to do so with those who may or may not have had ties to the ousted regime?\nWe are treading on a dangerous path here, where the legal system is being manipulated with the intention of getting revenge rather than justice. This will make the entire legal system questionable and erode people's trust in it.\nNow, why does that ring a bell? Because it reminds us of the arbitrary cases filed against members of BNP and Jamaat-e-Islami by the Awami League regime. According to BNP's case record preservation cell, 141,636 cases were filed against 4,926,494 leaders and activists of the party and its affiliated organisations between 2009 and September 2023. Cases that had been hanging for years were fast-tracked at an extraordinary speed just before the 2024 election to make sure that opposition candidates could not participate. A report by The Daily Star on October 23, 2023 cited a mid-level police officer present at a BNP leader's trial in August 2023, saying that the government (AL) had given clear instructions to dispose of the trials involving BNP and other opposition party leaders before the national election.\nWhile the present circumstances are not under an autocratic regime, the feeling of unease still exists. We really don't know why or how these cases are being filed, who gives the order to arrest, or who will be next.\nAt a function commemorating National Legal Aid Day on April 28, the law adviser agreed that lawsuits were being filed out of malicious intent, to harass people, or to occupy someone's property and businesses. When asked about the case filed against Iresh Zaker, he asked the journalist to expose the plaintiffs and see whether the cases were filed due to enmity or ulterior motives.\nThe home adviser's comments about Nusraat Faria's arrest were hardly reassuring, \"Now, if there's a case against her, what should we do? If we let her go, then you would say, 'Sir, you spared her.'\"\nBoth the law and home advisers have said that though cases have been filed (and there's really nothing they can do about that; anyone can file a case against anyone, it seems), the government has instructed the law enforcement agencies to make sure no innocent person is unnecessarily harassed. Unfortunately, these statements do not translate into ground realities. It seems arrests are made because of rivalry or revenge rather than actual suspicion of committing the crime.\nThe images of a young actress, who wasn't even in the country during the July uprising and who has shown her sadness over the deaths of protesters on social media, being escorted by law enforcers to the court and jostled by the crowd have been distressing, to say the least. Even though she has been granted bail, nothing will erase the trauma of being arrested for attempted murder and spending a night in jail. If the purpose of this ordeal was to punish her for playing the role of Sheikh Hasina in a film, that is just vengeance, not justice. The filing of cases on the basis of personal vendetta must stop immediately. It is making a mockery of our legal system.\nAasha Mehreen Amin is joint editor at The Daily Star.\n\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Nusraat Faria’s arrest sends an ominous message to the people",
        "headline_2": "",
        "link": "https://www.thedailystar.net/news-0/news/nusraat-farias-arrest-sends-ominous-message-the-people-3898936",
        "news_paper_name": "The Daily Star",
        "publish_date": "21-05-2025"
    },
    {
        "full_article": "We commend the government's decision to create a fund to compensate victims of financial irregularities using the money and assets recovered from alleged embezzlers and money launderers. According to the Bangladesh Bank governor, frozen assets of the accused, including shares held in various banks and companies, will also be included in the fund. He further stated that substantial sums deposited in various banks by individuals under investigation or facing trial have already been seized, along with control of shares owned by fugitives and those facing charges. This suggests that the government has already begun to make some progress in recovering stolen assets, which is indeed encouraging.\nThe governor said the fund would be used in the public interest, with priority given to compensating victims—chiefly depositors harmed by financial irregularities. He also stated that it would be used to provide some relief to the poor. Although estimates vary regarding the amount of assets stolen and syphoned out of the country during the Awami League regime, the White Paper on the state of Bangladesh's economy indicates that Tk 28 lakh crore was laundered per year between 2009 and 2023, amounting to $234 billion. That is a staggering amount. For the government to stand any chance of recovering this money, or a substantial portion of it, it must act swiftly.\n\nWhile we are encouraged by the government's actions in locating and recovering stolen assets so far, much remains to be done. We urge the government to act swiftly and in close collaboration with foreign countries and institutions to ensure that most of the syphoned assets are recovered, those responsible are held accountable, and the victims receive justice.\nPreviously, the central bank governor himself acknowledged that the authorities were racing against time to recover the stolen billions, warning that the funds could vanish if not located quickly. More recently, while discussing the progress made by the joint investigation team into 10 business groups and the family of the ousted prime minister, he said new assets were still being discovered and investigated. In the meantime, cases have been filed based on the assets identified so far, and those assets have been seized, although the total value has not yet been disclosed.\nAccording to the chief adviser's press secretary, since the interim government took charge, immovable assets of the 10 business groups and Hasina's family—worth Tk 1,30,758 crore domestically and $164.03 million abroad—have been attached. Additionally, Tk 42,600 crore in movable properties has been frozen. It was further revealed that the central bank is working with foreign institutions through mutual legal assistance to recover laundered money. Even though the entire process—proving that the money was illicitly obtained and tracing it to specific individuals—is complex, there is a strong possibility that foreign countries will be able to assist us.\nWhile we are encouraged by the government's actions in locating and recovering stolen assets so far, much remains to be done. We urge the government to act swiftly and in close collaboration with foreign countries and institutions to ensure that most of the syphoned assets are recovered, those responsible are held accountable, and the victims receive justice.\n",
        "headline_1": "A promising start to financial justice for victims of scams ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/promising-start-financial-justice-victims-scams-3899061",
        "news_paper_name": "The Daily Star",
        "publish_date": "21-05-2025"
    },
    {
        "full_article": "Technology has undoubtedly transformed societies, opened unprecedented doors of connectivity and innovation. Such advancements, however, have their dark sides, perhaps nowhere more glaringly than in economically vulnerable nations. Among the most critical concerns is the unabated growth of unregulated gambling sites on the internet. While countries such as Bangladesh grapple with infrastructural issues and political problems, the spread of such sites, driven by advanced digital promotion and lenient regulatory environments, has snowballed into a crisis with deep social, economic, and moral implications.\nAs of 2023, Bangladeshi authorities had actively blocked many international gambling sites like 1xBet, Bet365, and Mostbet. But political disruption following mass protests in late 2024 opened the door for a new generation of home-grown sites for gambling that are local in focus but global in reach. These hyper-local sites, often promoted via Facebook ads, target local communities with vernacular content and culturally tailored schemes. In contrast with their international counterparts, such sites operate in administrative grey areas, leveraging fractured enforcement to fly under the radar. For instance, ads for sites like BK33 and TK999—in some cases posing as \"investment opportunities\" or \"games of skill\" rather than gambling sites—clog social media feeds, leveraging the lack of digital literacy of many users.\nWhat is noteworthy about such websites is their adoption of new technologies to instil trust. AI-made deepfakes of celebrities or popular cricketers pitch schemes, and AI voiceovers mimicking influential public leaders lend credibility. Worse is, kids and teens in poor households are hired as operators, making gambling popular among their peers. Such tactics exploit socioeconomic despair, and websites provide instant economic salvation in terms of fast loans for people already bruised by the economy due to inflation and unemployment.\nThe prime targets are low-income groups, particularly youths aged 18–30 years, who comprise over 60 percent of the population in Bangladesh. For many, gambling is a catastrophic spiral: losses trigger further betting in a bid to recoup money, compounding debt and depression. The social cost is huge—families disintegrate over money disputes, while students drop out to chase mirage profits.\nAside from individual bankruptcy, such sites threaten the national economy. Most are fronts for cross-border criminal syndicates, draining foreign exchange reserves through e-money laundering. Bangladesh Financial Intelligence Unit (BFIU) in its 2021-22 Annual Report revealed that around $0.59 million was transferred to a Malaysia-based company from Bangladesh in six months for online game coins. By 2024, the Criminal Investigation Department (CID) had approximated that Tk 260 crore was transacted through 1xbet in a year, while Tk 245 crore was traded through Bet365, Tk 230 crore through Mostbet, Tk 140 crore through Bet Winner and Tk 133 crore through Betbuzz. Such outflow tightens already strained dollar reserves, widening trade deficits while weakening the currency.\nBangladesh's main law for combating gambling on the internet, the Cyber Security Act, 2023 (earlier the Digital Security Act), is ill-suited for this crisis. The law is aimed at e-money payments, not broad crimes like false advertising or solicitation of minors. Officials are still in catch-up mode, shutting sites down once fraud is detected, as new sites open up daily. Experts contend that specialised laws, such as an Online Gambling Control Act, are necessary so that platform activities are criminalised, there is surveillance of transactions, and social media sites are held accountable for disseminating illicit advertisements.\nCombating this epidemic involves action on multiple fronts. Governments, initially, must coordinate with technology companies to algorithmically detect and suspend gambling content. Meta, the parent company of Facebook, has worked with India and Nigeria on gambling advert bans; such deals are also needed soon for Bangladesh. Payment gateways like Bkash and Nagad must strengthen due diligence underwriting, suspending accounts related to gambling activity. Finally, social consciousness campaigns—led by influencers as well as at schools—can dissipate myths about \"risk-free\" online gaming, and the extent of the consequences. There should also be support groups for gambling addicts. Unchecked, online gambling will reinforce poverty, destabilise the economy, as well as erode social trust. For countries like Bangladesh, in which digital adoption is outpacing its bandwidth for regulation, the choice is evident: modernise or incur irretrievable damage.\nK.M. Arshad is an undergraduate student of the Department of Economics at the University of Dhaka.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Social media’s role in the online gambling surge",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/social-medias-role-the-online-gambling-surge-3899056",
        "news_paper_name": "The Daily Star",
        "publish_date": "21-05-2025"
    },
    {
        "full_article": "We are concerned about how journalists continue to be targeted through retaliatory cases since the fall of the Awami League (AL) government in August last year. Very recently, 26 journalists were accused in an attempted murder case filed by Rezaul Islam, a lawyer affiliated with the Jatiyatabadi Ainjibi Forum's Chattogram unit. The case, filed on May 13, alleges that the journalists, along with others, were involved in an attack on Rezaul on May 1, 2025. However, many of the accused journalists strongly deny the charges, claiming that the allegations are based on distorted facts. They assert that they are victims of retaliatory cases, similar to previous incidents where journalists were indiscriminately targeted. Such arbitrary filing of criminal cases against journalists undermine press freedom.\n\nIn the case statement, Rezaul alleges that many of the accused are affiliated with the AL, Jubo League, and their associated groups. He accuses them of extortion, murder, and attacking protesters during the July uprising. He further claims that they repeatedly threatened him to withdraw cases filed on behalf of the families of July victims, and that they attempted to abduct him, robbed him, and even hurled a crude bomb at him. However, the journalists accused in the case have narrated a completely different version of events. According to them, Rezaul threatened to disrupt a picnic event via a Facebook post on April 30. On the day of the picnic, May 1, he and his group allegedly assaulted one of the journalists near Premier University. Furthermore, several journalists who were nowhere near the scene that day were nonetheless implicated. Additionally, law enforcement officials have raised doubts about some of the claims in the case statement. The Officer-in-Charge of Kotwali Police Station stated that no reports of a crude bomb explosion had been received in his jurisdiction. The inconsistencies between Rezaul's allegations and the journalists' accounts must be addressed through a fair and impartial investigation, as demanded by the Chattogram Union of Journalists (CUJ).\n\nWe therefore urge the government to conduct a fair investigation into this case and take strong measures to prevent the misuse of the legal system. While the government previously stated that legal action would be taken against those filing false cases, we have yet to see any meaningful steps to this effect. This is deeply concerning. At present, journalists remain imprisoned due to cases filed out of personal or political vendettas. These cases should be resolved through due process.\n",
        "headline_1": "Fairly investigate cases against all journalists",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/fairly-investigate-cases-against-all-journalists-3896941",
        "news_paper_name": "The Daily Star",
        "publish_date": "21-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 21, 2025 00:00:00  \nRising unemployment means the economy concerned is not doing well. Then, unemployment is not just about a figure. The individuals or families whose members are without work know how it hurts. From that point of view, the recently published report on the country's unemployment rate at 4.63 per cent during the October-December period of the current fiscal year (FY2024-25) is concerning. And that is because the latest unemployment rate is one of the highest rates recorded so far by the Bangladesh Bureau of Statistics (BBS). \nBefore sounding the alarm bell, one would do well to keep in mind that the period under survey was also the one that followed the nationwide political unrest and the uprising leading to the ouster of the autocratic regime of Sheikh Hasina. Also, the time was marked by widespread labour unrest especially in the Readymade Garment (RMG) sector. Obviously, these can be referred to as the immediate cause of such a high rate of unemployment during the period in question. At the same time, it is also important to note that the years before the survey period in question, the autocratic regime was marked by what economists term 'jobless growth'. It is a condition when an economy experiences growth in terms of GDP output, but does not lead to a corresponding increase in employment. The apparent reason was that the private sector was investment-shy due to a multiplicity of factors including fast declining foreign exchange reserves with the resulting import restriction, sharp fall in the value of Bangladesh Taka (BDT) against US dollar (USD) and high inflation. Evidently, all these factors together militated against the creation of new jobs in the economy. \nReferring to the BBS Labour Force Survey 2023, a report published in 2024's December 4 issue of this paper said that 2023's employment growth was the lowest in 12 years, as the economy in that year generated only 0.51 million new jobs which was well below the annual average of 1.12 million since 2013. Now, what does the record of 2024's last quarter say? Based on the unemployment rate (of 4.63 per cent), which was also according to the findings of the quarterly Labour Force Survey of the BBS, during that quarter of 2024, around 3.02 million people were out of employment compared to that of the year before. Definitely these are upsetting statistics. But sometimes one needs also to go into the methodological details of how these unemployment figures are arrived at. Notably, the method used to calculate October-December, 2024's unemployment rate was done in line with the 19th International Conference on Labour Statisticians (ICLS). The high rate of unemployment recorded according this latest ICLS standards marks a significant increase from the rate of unemployment at 3.95 per cent recorded during the same period in the previous year. Interestingly, according to the 13th ICLS standards that BBS still follows, the unemployment rate recorded in December 2024 was 3.69 per cent, which is way higher than that recorded a year before. In a similar vein, according to 19th ICLS, the total number of the unemployed has risen to 2.73 million, though as per the 13th ICLS, the number (of unemployed) would be 2.61 million. \nHowever, seeing that the unemployment rates and numbers might vary depending on how unemployment is defined or the particular methods used to calculate those, there is still little room for complacency. As joblessness is the most depressing indicator of an economy, the government should concentrate its highest effort on creation of new jobs both in the public and the private sectors.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Focus should be  on job creation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/focus-should-be-on-job-creation-1747754107",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       May 21, 2025 00:00:00  \n\nThe presence of arsenic in groundwater across almost all regions of Bangladesh is not a recent discovery. In fact, it has been more than two and a half decades since the alarming levels of arsenic contamination were first detected in the country's groundwater sources. A comprehensive assessment at the time revealed that 59 out of the 64 districts in Bangladesh had arsenic levels in their groundwater that exceeded the nationally accepted safety threshold of 50 parts per billion (ppb). This revelation caused serious concern, both nationally and internationally, due to the widespread implications for public health. The health risks associated with consuming arsenic-contaminated water, as well as using it for household chores such as cooking, washing, and bathing, were dire enough to trigger urgent calls for action.\n Although the severity of the issue was recognised, yet the government faced significant challenges in formulating and implementing an immediate and effective response. The scale of the contamination, combined with limited access to alternative safe water sources, made it difficult to take decisive steps aimed at arresting the spread of the problem or preventing other areas from falling under its grip. Over time, although various initiatives were taken, the problem remained unresolved at its core.\n In recent years, the public discourse surrounding arsenic contamination appears to have quieted down. Except for occasional news reports or scattered media coverage, arsenic pollution no longer figures as a national emergency. This silence might misleadingly suggest that the threat has either diminished or been successfully addressed. However, a study conducted by the Human Rights Watch some time ago paints a very different picture -- one that is, in fact, more alarming than what was initially assumed. According to their findings, the arsenic crisis in Bangladesh is far from over. On the contrary, it continues to pose a serious health hazard to millions.\n Arsenic is particularly insidious because it is a \"silent killer\" -- its harmful effects manifest slowly and often go unnoticed until severe health damage has occurred. Long-term exposure to arsenic-contaminated water can lead to an array of serious health issues, including painful skin lesions, various forms of cancer (particularly skin, bladder, and lung cancers), as well as cardiovascular and respiratory illnesses. The Human Rights Watch study estimates that nearly 20 million people in Bangladesh are still consuming water that is contaminated with arsenic. This staggering figure indicates that, despite the efforts made over the past two decades, the prevalence of arsenic contamination has not seen a significant decline. This is particularly distressing considering that millions of wells have been tested, and thousands of new \"safe\" wells have been drilled across the country in an attempt to stave off a public health catastrophe.\n There are also inconsistencies and contradictions in the reports that assess the current state of arsenic contamination. In the early 2000s, particularly around 2003, some well-organised steps were taken to understand and confront the crisis. The government reported that it had tested approximately five million rural tube wells during that period. To guide the public, the wells were painted red or green to indicate whether the water from a particular well was unsafe or safe for use, respectively. While this initiative had a promising start, there has been little analysis since then to determine how effective these measures were in changing people's behaviour or reducing their exposure to contaminated water. One has to question whether these early efforts were sustained over time and whether they were supported by continuous monitoring, public education, or the provision of viable alternatives.\n What is particularly disheartening is the apparent decline in vigilance and urgency. The momentum that once drove the national and international response to arsenic pollution seems to have dissipated. The issue, which once dominated headlines and policy discussions, now rarely features in the national conversation, even though it continues to affect millions of lives.\n Arsenic contamination is most prevalent in shallow tube wells, which are the primary water source for many rural communities. While deeper aquifers typically contain water of better quality, access to this safer groundwater is limited. Government initiatives to install deep tube wells have so far failed to adequately meet the need. Researchers argue that a major breakthrough in arsenic mitigation could be achieved if wells were consistently drilled deeper than 500 feet. If this is indeed a viable solution, then there should be no further delay in expanding safe water projects across the most affected areas. Supplying arsenic-free water to the nearly 20 million people currently at risk must become a priority.\n To make meaningful progress in the fight against arsenic contamination, the government should revisit and reevaluate its past and present programmes. This process should involve a thorough assessment of what has been achieved, what has failed, and why. Only then can effective, evidence-based strategies be developed and implemented. Regular monitoring, public education, community engagement, and robust investment in infrastructure are key components of any long-term solution.\n What is clear from the scope and complexity of the problem is that arsenic mitigation will not be a short-term endeavour. Rather, it demands a long-term, sustained commitment -- a continuous battle against a largely invisible but deadly enemy. \nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Reassessing current state of arsenic mitigation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/reassessing-current-state-of-arsenic-mitigation-1747754177",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 21, 2025 00:00:00  \n\nDhaka has emerged as one of the South Asia's most expensive cities, posing serious financial challenges for newly married couples. With rising inflation, soaring rents, and modest entry-level salaries, managing household expenses on a single income has become nearly impossible. In this context, women's employment is not just beneficial, it is essential.\nAccording to the Bangladesh Bureau of Statistics, urban inflation reached 9.94 per cent in March 2025. The Centre for Policy Dialogue estimates the monthly cost of a modest lifestyle exceeds Tk 47,000 in Dhaka's city centre. Entry-level salaries -- often under Tk 40,000 for first-class government officers -- fall short of covering these basic expenses. A large portion goes to rent, food, transport, and healthcare, leaving little for savings or planning for the future. Many couples are even delaying parenthood due to financial constraints.\nWhen both partners work, the burden becomes more manageable. Dual incomes allow couples to afford better housing, healthier food, and support for elderly parents. It also creates space to plan for children with greater financial and emotional security.\nHowever, enabling women to work requires more than economic necessity. Workplace safety, equal pay, and respect remain pressing concerns. Many women still face insecurity during commutes and discrimination at work. Without addressing these issues, increasing female participation in the workforce will remain an uphill battle.\nIn today's Dhaka, the economic survival and well-being of newly married couples often depend on the wife's ability to contribute financially. Ensuring women can work safely, fairly, and with dignity is not only a family imperative -- it is a social and economic necessity.\nMuhammad Raihan Uddin\nraihan.uddin@bigm.edu.bd\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Dual income, shared burden",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/dual-income-shared-burden-1747754201",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 21, 2025 00:00:00  \n\nFor the past ten months, since the formation of the interim government, citizens have faced a nearly daily ordeal of traffic paralysis. \nWhile organisers claim to schedule such events on weekends to limit disruption, the reality tells a different story. Protests have become a daily source of gridlock, public suffering, and the erosion of public peace.\nPolitical parties and pressure groups often stage rallies on major roads, paralysing traffic for hours. A recent rally on the Dhaka-Aricha Highway caused an 8-kilometer tailback, severely affecting commuters and goods transport. \nSimilar demand protests -- by students, garment workers, or labour unions -- have repeatedly brought vital intersections like Shahbagh, Tejgaon, and Farmgate to a standstill. According to recent reports, Bangladesh witnessed 126 such demonstrations in the first five months of this year, 76 per cent of which were staged by various professionals.\nThese actions, while sometimes rooted in legitimate grievances, disproportionately harm the broader public. Ordinary citizens -- who often have no stake in the disputes -- suffer lost income, missed medical appointments, and heightened stress. With vehicle speeds now averaging just 6-7 km/h and projected to drop further by 2035, Dhaka is fast becoming unliveable.\nBeyond lost productivity, these disruptions impact public health, road safety, and urban functionality. Businesses in Old Dhaka are relocating to avoid the logistical chaos.\nDhaka residents are not asking for much -- just peaceful weekends, predictable commutes, and access to essential services.\nPolitical and protest groups must rethink their tactics. Protests should be confined to designated areas or institutional premises, not busy intersections. Political activity must be decentralised and relocated to divisional cities when possible.\nIt is high time we foster a culture of responsible protest -- one that balances the right to be heard with the public's right to live and move freely.\nAnik Dey\nM.B.A\nDepartment of Finance\nUniversity of Dhaka\nanikdeyfin@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "When protest becomes a source of nuisance",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/when-protest-becomes-a-source-of-nuisance-1747754228",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-05-2025"
    }
]