[
    {
        "full_article": "By informing the Delhi High Court that it cannot be compelled to come on board the Union government’s SAHYOG portal, the social media platform, X, has brought to light a mechanism that could potentially be misused by the government in its attempts to curb content on the Internet. The portal, which has been conceptualised by the government to be a platform that will facilitate coordination among law enforcement agencies, social media platforms and telecom service providers to help in quicker takedowns of unlawful content, seems to be a follow-up to an office memorandum by the Ministry of Electronics and Information Technology, in October 2023, authorising government agencies to block content, under Section 79 of the IT Act. The creation of SAHYOG was disclosed by the Union Ministry of Home Affairs (MHA) in the Delhi High Court last year, in Shabana vs Govt Of NCT Of Delhi And Ors., where the court had emphasised the need for a mechanism to enable real-time interactions between Internet intermediaries and law enforcement authorities in order to address urgent cases. Section 79 of the IT Act provides safe harbour protection to intermediaries so that they are not liable for third-party content hosted or transmitted on or through their platforms provided they adhere to certain conditions. Section 79(3)(b) provides an exception to this protection — if an intermediary receives actual knowledge or is notified by the government agency that certain content is being used to commit an unlawful act, it must remove or disable access to that content quickly, failing which it will lose safe harbour protection.By using Section 79(3)(b) to enable the creation of what is a content takedown portal, the government — as X rightly claims in its petition — bypasses the limited safeguards under Section 69A of the IT Act, which allows content blocking only on specific grounds such as national security and public order, and mandates procedural safeguards such as a designated officer’s approval, written justification and independent review of any such blocking request. X’s claim also justifiably raises the possibility of SAHYOG being used as a tool for unchecked censorship as it will allow for multiple government agencies including Ministries, State governments and local police to have blocking powers unlike the provisions in Section 69A. If SAHYOG is used as the medium to address blocking orders, there seem to be no opportunities for challenging the order, nor are there any procedural protections that are otherwise available through Section 69A. This suggests that the implementation of the portal could be ultra vires and violates the Supreme Court’s judgment in Shreya Singhal vs Union of India. While the Delhi and Karnataka High Courts (X has also filed a petition challenging SAHYOG here) hear the cases, the MHA must provide the full details of the features of the SAHYOG portal for public perusal to ensure that it does not bypass the legal frameworks for online content regulation.\r Published - March 28, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        internet\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        computing and information technology",
        "headline_1": "Back door censor: On the government’s SAHYOG portal",
        "headline_2": "SAHYOG must adhere to the safeguards and procedures in Section 69A of the IT Act",
        "link": "https://www.thehindu.com/opinion/editorial/back-door-censor-on-the-governments-sahyog-portal/article69382221.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-03-2025"
    },
    {
        "full_article": "Despite stringent laws, women remain far from feeling safe in most public spaces. A spate of incidents in just the first three months of 2025 highlights how vulnerable women are — especially in public transport. A 23-year-old woman sustained severe injuries after jumping off a train to escape an assaulter. In another shocking case, a pregnant woman who was allegedly pushed out of a train following an attempted rape suffered a miscarriage. Harassment is a regular ordeal for women in unreserved train compartments and on government buses. Who is accountable for this grim reality when society claims to champion women’s empowerment? In their seminal work, Why Loiter?, Shilpa Phadke, Sameera Khan, and Shilpa Ranade argue that when society says it wants to protect women, it does not strive to make public spaces safer. Instead, it seeks to confine women to homes, schools, or the care of others. Even today, women must constantly consider the time of day they travel, wary of venturing out after dark or before sunrise.A necessary starting point is affirming that women have the right to live and move freely — without fear. While easier said than done, a recent Delhi High Court ruling has set an example. The court upheld the conviction of a man who sexually harassed a woman on a public bus in 2015, calling it a “deeply concerning reality” that harassment in public spaces persists despite decades of independence and tough laws. The court rightly pointed out that judgments in such cases serve as crucial signals to society. Until a harassment-free environment is created, conversations about women’s progress will remain hollow. Equally significant is the Supreme Court of India’s decision to stay an Allahabad High Court order that had outrageously ruled inappropriate touching of a minor did not amount to attempted rape. The top court’s response sends a clear and much-needed message: such “totally insensitive and inhuman” interpretations of the law are unacceptable. The responsibility does not lie with the judiciary alone. Administrative bodies must ensure that streets are well-lit, police are trained to handle cases of harassment effectively, and all vacancies in law enforcement are promptly filled. Without a coordinated, all-encompassing approach to safety, women will continue to live in fear, denied their rightful access to public life. Published - March 28, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        gender\n                    \n                            /                      \n                        \n                        safety of citizens\n                    \n                            /                      \n                        \n                        public transport\n                    \n                            /                      \n                        \n                        sexual assault & rape\n                    \n                            /                      \n                        \n                        railway\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        children\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        police",
        "headline_1": "Women unbound: On women’s safety and public spaces",
        "headline_2": "Public spaces must be always safe for everyone",
        "link": "https://www.thehindu.com/opinion/editorial/women-unbound-on-womens-safety-and-public-spaces/article69382180.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-03-2025"
    },
    {
        "full_article": "In north India the yearly changes of weather are marked by rites of ceremonial passage\nIn north India, spring is a brief interlude between the chill of winter and searing summer. Trees shed their cloaks of leaves and prepare for the heat to come. As though in mimicry, Bunny and I engage in the annual rite of retiring winter clothing into mothballed hibernation.\nThe exercise is punctuated with exclamatory observations. Can you believe this sweater is forty-five years old! I didn’t get to wear this coat all winter, it just didn’t get cold enough!\nWhere are the snows of yesteryear? asked the poet. In more prosaic vein we wonder where are the winters of yesteryear? Whether it’s climate change or the heat island effect, winters in Gurgaon, where we live, have lost some of their wintriness.\nThere is still, however, a distinct division between the nose-tingling nip of winter air, polluted as it is, and the furnace heat of summer.\nThe coming of summer has its compensations. Soon, the amaltas that slept through the winter will waken into bloom, its branches laden with golden clusters, aglow with entrapped sun.\nSummer is also the season of mangoes, the Chausa and the Gulab Khaas, summer’s fury wooed to sweet succulence in their flesh.\nAnd when it seems that the scorched earth can bear the rage of the sun no more, the blessed rains of the monsoon will hopefully come, drenching the parched ground and exuding a smell like no other, which has given the English language that most evocative of words, petrichor.\nWhen the rains depart, leaving behind memories of replenished greenness and waterlogged traffic jams, the days will dwindle towards the ember months, Nov and Dec, and it’ll be time to exhume our winter clothes again.\nI sometimes think of what it would be like to live in a place where it’s never too hot or too cold, never too wet or too dry, and earthly Eden of perfect weather.\nSounds idyllic, but I suspect I’d miss the repeated cycle of unchanging change, of renewed seasons bringing with them their own greetings, and their message of the permanence of impermanence.\n\n",
        "headline_1": "Seasons’ greetings",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/seasons-greetings/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-03-2025"
    },
    {
        "full_article": "Kerala’s chief secy shows how to respond to India’s insidious prejudice about skin colour\nFair and Lovely was rebranded Glow and Lovely a few years ago. Was that some kind of national inflection point? Had we finally moved past our ridiculous colourism? Baah, nothing doing. Kerala chief secretary Sarada Muraleedharan alerted us that this prejudice is in rude health. There are only 36 chief secretaries in govts across this vast country. Calling it a powerful job is an understatement. That all the authority at her command neither protects her from being called “black” nor from feeling hurt because of this, speaks to the seemingly higher power of prejudice, stereotypes and racism, which grows by getting internalised. At the same time, this IAS officer also shows how to take on skin colour fetishists. Not just by hitting Ctrl+Alt+Delete. But also by proclaiming loudly that black is beautiful, black is gorgeous – “I dig black.”\nOn the streets of Mumbai a child will bully another child by calling her the N word. Simone Ashwini Pillai’s post-Bridgerton celebrity has trolls crying how Indians are being stereotyped as dark-skinned. Many an Indian will only appreciate her own skin when she lands among Whites. And what about ‘wheatish’? The foxy matrimonial column staple sums up our obsession with grading skin colour like a paint company palette card.\nHence the importance of public stances such as Muraleedharan’s. For a young girl being told not to play in the sun or to go to the back row of a dance performance because of her complexion, having public role models who look like her matters. The thing with colourism is that unlike many other forms of social injustice, it’s your near and dear ones that hit you the hardest, your own family, your teachers. And mostly you don’t even talk to the other girl or boy who shares your friendship and complexion about what you’re going through. But there’s no psychological safety in silence. Cruel nonsense has to be called out for what it is. \n\n",
        "headline_1": "We the wheatish people",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/we-the-wheatish-people/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-03-2025"
    },
    {
        "full_article": "Movie on police misconduct doesn’t get clearance. Survey showing police misconduct makes same point\nFinding a police procedural film on Indian cops reportedly potentially disruptive to social harmony, censors have sought “pages long” cuts to it, and its release in India is uncertain. Santosh, playing in British theatres, is about a young woman cop, a widow, who must probe a Dalit girl’s murder. It’s in Hindi, was shot in India, was UK’s official entry at the Academy awards, and has won a Bafta and much global acclaim. It’s an “unflinching fictional portrayal”, wrote The Guardian, of the “murkier elements” of Indian police – their violence, caste prejudice, and inherent misogyny – as well as “normalisation of mistreatment and torture by police officers”.\nBut, really, did censors think this was going to come as a shock to Indians – or that India’s cops would find this unfair? How’s this for irony? As reports appeared on Santosh, Common Cause-Lokniti-CSDS’s 2025 report on Police Torture & (Un)Accountability detailed much of what the movie talks about. Over 8,000 cops, constables to IPS officers – in 17 states/ UTs, urban & rural – were surveyed. The findings? One in four police personnel justified mob violence in response to sexual harassment, almost a third – pan-India – fully justified torture (Gujarat police was the most enthusiastic about it, Kerala police the least likely to support it), 30% said third-degree methods are legit, 22% said killing “dangerous criminals” (encounters) was better than waiting for a trial, one in five felt “tough methods” are a must to create fear among public. It’s also cool to rough up “uncooperative witnesses”.\nCops said they needed better infra. But almost 50% advocated for regular preventive arrests, and over 40% supported “special squads with powers of indefinite detention”. Fifty percent felt Muslims are “prone” to committing crimes – same as in 2019. Public pressure to deal with “suspects” with a “heavy hand” significantly influences policing. The survey also revealed that crimes for which fewest arrests are made are offences by public servants and crimes against SCs/ STs. Compliance with arrest procedures? Just over 40% said SOPs are followed, nearly a quarter said procedures are “rarely or never” followed. None of this is entirely unknown; some of it is in the film. What does it all show? That brute force almost always gets a free pass.\nWhat should be our response to such a survey, which echoes many Indians’ lived experience? Radical police reform. What do we get? Censorship demands on a movie that tells a story based on that lived experience.\n\n",
        "headline_1": "Santoshes everywhere",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/santoshes-everywhere/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-03-2025"
    },
    {
        "full_article": "If India’s democracy has to thrive, it cannot do so if our politicians have such thin skins, where a negative reference to Maharashtra’s deputy CM by a stand-up comedian leads to Shiv Sainiks vandalising the venue of his performance. While opposition politicians suddenly rose up to condemn the vandalism and reaffirmed Kunal Kamra’s right to his views on Eknath Shinde, the problem is that practically no politician in India is able to laugh off a joke or satire.\nRead full story on TOI+\n\n",
        "headline_1": "Free speech, anyone?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/free-speech-anyone/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-03-2025"
    },
    {
        "full_article": "Several recent developments have forced us to fear that we are on a self-defeating course. The most damaging development refers to the armed forces, especially the army chief. For quite some time, a section of social media influencers have been attacking the army chief and demanding his replacement because he was appointed as the chief of army staff (CAS) by the past regime. Institutional appointments are an integral part of the governance process, and that should not be questioned just because it happened before the July uprising, especially if it had to do with the armed forces, which are tasked with the vital function of ensuring national security.\nThe latest controversy started with a Facebook post by one of the student leaders of the uprising, Hasnat Abdullah. He wrote on March 21 about a meeting with the CAS on March 11, in which the army chief allegedly suggested that a \"refined\" Awami League, which would renounce the atrocities committed against the students and the people and purge all those guilty of being involved with crimes, corruption, abuse of power, etc, should be allowed to participate in the upcoming general election. Hasnat renounced the suggestion and triggered a social media controversy.\nSeveral questions arose as a result. Why raise it 10 days after the meeting? Why on Facebook and not on the party platform? Why without first discussing with his party colleagues? Hasnat may be young, but he is a political figure of considerable stature and must be aware of the consequences of creating controversy around such a vital institution as the army as well as the person who heads it. Taking advantage of the situation, some others made some vicious, dangerous and outright insulting remarks against the army, the aim of which could only be to create chaos.\nWhatever our armed forces' past mistakes were, their role in giving crucial support to the interim government and the round-the-clock work they are doing to maintain law and order should be highly appreciated. We must realise that without such support, the interim government wouldn't have been able to perform as it did. The accusation that our armed forces are trying take power and that the CAS has his eyes on the takeover has no basis in ground reality as of now, and there are no facts or even remote actions to support this allegation. These are products of deliberate attempts to instigate. Gen Waker-Uz-Zaman has repeatedly stated that the army is eager to go back to the barracks and is reluctant to stay even a day longer than necessary in aid of the interim administration.\nSo, why attack this vital institution that has been and is serving us so well? If the army really wanted power, then the best time for them was between the time Sheikh Hasina fled (August 5, 2024) and the day Prof Muhammad Yunus returned home from Paris and took oath as the chief adviser (August 8, 2024). For three days, there was a total power vacuum, which was the perfect moment for them to make their move. But they did no such thing. I think very few armies in developing countries would have forsaken such an opportunity, and fewer army chiefs would let such an opportunity slip through their fingers, especially when they would not have been blamed for ousting any sitting government. This reminds me of the famous saying by Napoleon Bonaparte, \"I found the crown of France lying on the ground and I picked it up with my sword.\" For those three fateful days, the Bangladesh government was \"lying on the ground,\" so to speak, which was a perfect opportunity for any CAS interested in power to make the crucial move. Gen Waker-Uz-Zaman passed the test of his and his institution's belief—that armed forces should not get involved in the running of a government—with flying colours.\nThe chief adviser, in his address to the nation on Tuesday, indicated that attempts were being made to create instability and warned us about rumours and false information that are being circulated—most likely by the ousted forces. That is not to be unexpected. But what worries us more is that rumours, false information, and distorted facts are being circulated by people who profess to be activists and supporters of the July mass movement. It becomes far worse when people in the leadership of that movement do the same.\nWhat we need most at this stage is stability, followed by accountability of the killing of students and others and a path towards restoration of democracy. The sudden power vacuum created after Sheikh Hasina fled to India and the instant disappearance of not only the existing government but practically the whole governmental structure—particularly the law enforcement agencies—made the situation unstable. The inevitable impact of that on the economy and public safety further contributed to lack of public confidence.\nBut after seven months of rule, Prof Yunus's government can be credited with having brought a sense of stability in the economy. Inflation eased during December 2024-February 2025, dropping below 10 percent over the last two months. Export earnings grew by around 10 percent year-on-year in the July-February period despite political unrest and severe production and supply chain disruptions. A particularly bright spot was the 23.8 percent surge in inward remittance year-on-year during the same period.\nHowever, public safety issues continue to worry citizens.\nRight now, there are two major issues: progress of reforms, and the prospect of election. About the debate as to whether we need reform or election, our position—as we have repeatedly stated—is that we need both and can have both by December this year. By that time, we should have our first fully free and fair general election after 2008—after a gap of 17 years. Much valuable work has been done by the respective reform commissions, and the follow-up work is now in progress to bring about a consensus on them, which will form the basis, as Prof Yunus declared, of the July Declaration, which is expected to give us a direction for future transformation.\nThe BNP, as the biggest political party in the country at the moment, seems to feel that talking too much about reforms is a ploy to postpone the election. While we also want the election as early as possible, we cannot underestimate the importance of reforms. BNP has already agreed to: i) a caretaker government with a tenure of 90 days only to hold a free and fair election; ii) a bicameral legislature with 400 seats in the lower house, National Assembly, and 105 seats in the upper house, the Senate, and a four-year term for both; iii) raise the women's reserved seats to 100; iv) two speakers for the assembly with one from the opposition; and v) limiting the prime minister's tenure to two continuous terms, with a possibility of re-election after a gap. On many others, there are partial agreements.\nMost other important political parties have expressed similar views on the above-mentioned issues. These reforms are very important and consensus seems already in hand. On proposals of other commissions, similar points of agreements exist and the prospects of reaching consensus are quite high as well.\nWe strongly feel that consensus on reforms are well in hand and there is no reason not to hold the election by the year's end. Here, the interim government is guilty of creating confusion. It repeats December and then suddenly brings up June as a possible option. The chief adviser did so in his last speech. Time is ripe for a definite position on the election date. The Election Commission has said it is ready for December. So what is the reason for the ambiguity?\nMahfuz Anam is the editor and publisher of The Daily Star.\n\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Stability is the need of the hour",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/the-third-view/news/stability-the-need-the-hour-3859111",
        "news_paper_name": "The Daily Star",
        "publish_date": "28-03-2025"
    },
    {
        "full_article": "Just the other day, we talked about the highway safety concerns and traffic hassles leading into the extended Eid holiday. An estimated 1.5 crore people may leave Dhaka for their hometowns by Eid day, with similar movements expected nationwide. Amid this massive exodus, one problem that can rival the severity of other travel challenges is the widespread fare irregularities across various transport sectors. According to an estimate by Bangladesh Jatri Kalyan Samity, 98 percent of transport operators are overcharging passengers in the name of \"Eid tips.\" This extortion—which may total a staggering Tk 832.30 crore—is an unfair burden neither deserved by travellers nor expected under the interim government, exposing the failure of existing oversight mechanisms.\nJatri Kalyan Samity has also presented figures for how much would be extorted through each mode of transportation, with long-distance buses and minibuses taking Tk 90 crore extra from 30 lakh passengers and city buses taking Tk 12 crore extra from 40 lakh trips. Between March 20 and 31, it says, approximately 22.74 crore trips are expected across road, rail, water, and air transport in and around Dhaka for Eid-related purposes. On average, an extra Tk 200 is being charged per passenger. These findings are consistent with our own, with a report published on Wednesday highlighting the miseries of passengers on AC buses.\nAs per the report, passengers travelling on AC buses, with the exception of a few, are having to pay more than usual. After visiting various ticket counters and talking to passengers at Sayedabad and Arambagh bus terminals, our correspondents found that the extra fares being charged range from Tk 200 to Tk 1,000. Although the fare hike is not as steep for non-AC buses, most operators, particularly lesser-known ones, are overcharging by taking advantage of the Eid rush. According to the Road Transport Act, 2018, the BRTA is responsible for determining fares for public transport with government approval. Although AC coaches and public transport with special amenities are exempt from this regulation, the authorities can still regulate fares if there are allegations of overpricing—something they have not done.\nAll this shows how unregulated, and unmonitored, Eid fare practices remain. Several factors have been attributed to this, including inflation, a culture of extortion in transport sector, employee Eid bonuses, and owners' profit motives. While this trend has persisted for years, this year it prompted a sense of heartbreak with one passenger saying, \"I thought things would be different this time given that a new government came to power following a mass uprising.\" The government must take stern action to prevent these irregularities. As experts have recommended, it should introduce digital fare collection for better control, use CCTV for fare monitoring, and improve transport governance in general.\n",
        "headline_1": "Take steps to curb Eid fare irregularities",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/take-steps-curb-eid-fare-irregularities-3859106",
        "news_paper_name": "The Daily Star",
        "publish_date": "28-03-2025"
    },
    {
        "full_article": "It is truly unfortunate that even over 53 years after our liberation, we have been unable to create a complete and accurate list of freedom fighters, while many individuals have managed to include their names using forged documents. Reportedly, during the last 14 years, around 6,000 individuals falsely gained recognition as freedom fighters through forgery. Among them were around 400 government officials and employees, including a former secretary at the Ministry of Liberation War Affairs. During this time, institutions connected to freedom fighters—such as the Jatiyo Muktijoddha Council (Jamuka), Bangladesh Freedom Fighter Welfare Trust, and the Muktijoddha Sangsad—faced numerous accusations of corruption and misconduct. But the Awami League government hardly took any action against such irregularities. Sadly, investigations into these cases remain stalled even under the interim government.\n\nReportedly, the ministry has taken only departmental actions against some of the accused government officials and employees. While it cancelled the gazette entries of fake freedom fighters after identifying irregularities, it has yet to take appropriate action against those involved. Furthermore, no initiatives have been taken to recover the allowances disbursed to these fake freedom fighters over the years.\nReportedly, the ministry has taken only departmental actions against some of the accused government officials and employees. While it cancelled the gazette entries of fake freedom fighters after identifying irregularities, it has yet to take appropriate action against those involved. Furthermore, no initiatives have been taken to recover the allowances disbursed to these fake freedom fighters over the years. Meanwhile, several major corruption cases remain unresolved and even uninvestigated. For example, the Tk74 crore corruption case involving the Muktijoddha Sangsad and the forgery of honorary crests awarded to foreign friends and organisations for their contributions to the war—exposed in the media in 2014—remain unaddressed. The same thing happened to the irregularities reported at the Bangladesh Freedom Fighter Welfare Trust.\n\nUnfortunately, instead of prioritising the investigation of corruption and irregularities, the ministry has focused on creating a new list of freedom fighters. The fresh list will reportedly recognise only those who directly fought in the war as freedom fighters, while individuals who contributed indirectly or raised global awareness will be classified as associates. A draft ordinance has already been sent to the Cabinet Division for approval.\n\nWe think making a fresh list will have little impact unless the widespread corruption and irregularities within organisations related to freedom fighters are thoroughly investigated. Corruption at the relevant ministry and the fraudulent gazette listings of non-freedom fighters have severely damaged the credibility and reputation of our liberation war. This cannot be allowed to persist any longer. Therefore, we strongly urge the government to investigate all cases of corruption and forgery and take appropriate action against those responsible.\n",
        "headline_1": "Take action against fake freedom fighters",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/take-action-against-fake-freedom-fighters-3858771",
        "news_paper_name": "The Daily Star",
        "publish_date": "28-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Long wait for tax  digitisation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/long-wait-for-tax-digitisation-1743089080",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Bangladesh's independence is unique but grossly undermined",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bangladeshs-independence-is-unique-but-grossly-undermined-1743089200",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Under-invoicing in garment imports",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/under-invoicing-in-garment-imports-1743089270",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Sreemangal's tranquility is lost-",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/sreemangals-tranquility-is-lost-1743089296",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-03-2025"
    }
]