[
    {
        "full_article": "The lessons of the past should serve as a good guide, especially the learnings from three years of COVID-19. The country’s COVID-19 dashboard has seen some activity in recent weeks, and the total number (since January 2025) of COVID cases is currently at 3961 (as on June 2, 2025, 8 a.m.), and the number of deaths recorded as 32. While a figure in 1000s seems a bit alarming, it is still a small number in a country with a population of over 1.4 billion. It is also important to take a look at the full picture. Not all States have had a day-on-day hike in numbers testing positive for COVID, and all hikes are still in the single or low double digits. Also, 2,188 people have been discharged since, underlining what experts have been saying as the curve rose this year: that the variants causing infection now are Omicron subvariants and that they are neither more transmissible nor do they cause worse disease than in the past.While panic and anxiety might be unwarranted, a sense of caution and precautionary approach are advisable, particularly for those with vulnerabilities and co-morbid conditions. Experience from the pandemic is that people with other pre-existing co-morbidities are disproportionately affected by COVID-19 infection. Common comorbidities include hypertension, diabetes, cardiovascular diseases, obesity, and kidney diseases, and advancing age (post 60 years). People with these conditions must start masking up in public places, and hand wash regularly. Former World Health Organization Chief Scientist Soumya Swaminathan has said the recent immunity from the pandemic will stand in good stead, but again, to take possible precautions including giving boosters or vaccine shots, especially to the vulnerable. This is where the government must step in, as COVID vaccines or boosters are not available in most parts of the country, even urban centres. India, a signatory to the World Health Organization Pandemic Agreement, must first ensure that stockpiles of vaccines and diagnostic kits are created and distributed across the country. Both public and private sector hospitals must ensure that health infrastructure — particularly the availability of medical oxygen, adequate beds and health-care personnel — is in a state of readiness. Another scenario that must be avoided at all costs is the deliberate obfuscation of data on true numbers on infections or deaths as during the pandemic. Instead, transparency and efficiency must guide both the Centre and the States, this time, irrespective of how the COVID curve behaves. But panic is not the same as preparedness: one is debilitating, the other is enabling.\r Published - June 03, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        disease\n                    \n                            /                      \n                        \n                        senior citizens\n                    \n                            /                      \n                        \n                        Hypertension\n                    \n                            /                      \n                        \n                        diabetes\n                    \n                            /                      \n                        \n                        cardiovascular disease\n                    \n                            /                      \n                        \n                        obesity\n                    \n                            /                      \n                        \n                        nephrology\n                    \n                            /                      \n                        \n                        vaccines\n                    \n                            /                      \n                        \n                        hospital and clinic",
        "headline_1": "​ Readiness, not panic: On India and COVID-19",
        "headline_2": "COVID-19 resurgence calls for better preparedness",
        "link": "https://www.thehindu.com/opinion/editorial/readiness-not-panic-on-india-and-covid-19/article69649346.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "03-06-2025"
    },
    {
        "full_article": "The southwest monsoon has made a torrential entry and, expectedly, has wreaked considerable havoc. While the monsoon’s advent from Kerala, and its subsequent journey northwards, is a cause for celebration, given its association with the economy, this is only one branch of the monsoon — the Arabian Sea branch. A day or two after its onset over Kerala, and sometimes simultaneously, the Bay of Bengal branch of the monsoon makes its way from the Andaman and Nicobar Islands and enters the northeastern States first before bringing in rains to the eastern States. Frequently, however, this eastern onset is accompanied by destruction from floods and landslides. This year has been one such instance.In Assam, 10 major rivers were flowing above their danger-level mark and in all, more than three lakh people across 19 districts of Assam have been affected in a wave of floods that has disrupted everyday lives. Tripura also witnessed heavy to very heavy rainfall across many districts over the weekend and is expected to receive an extremely heavy downpour for most of the week. The death toll in rain-induced landslides, floods, flash floods, and lightning across the northeastern region was 30 until May 29 and on a single day, May 31, 22 people had lost their lives according to official estimates. In North Sikkim, landslides have marooned about 1,500 tourists with arterial roads getting blocked from incessant rains. A bus plunged into the swollen Teesta river, killing at least two people, with the rest of the passengers missing. This is only June and history has it that with the monsoon expected to be ‘above normal’, it would not be a stretch to expect a spate of disasters. To be sure, the India Meteorological Department expects that the northeastern States will likely get less than their normal quota of rain, but the base level of monsoon rains in these States is higher than many States in India. This is a reason why extremely heavy rain and associated damage are a hard-wired feature of the monsoon in the northeastern States, even in a year of relative scarcity. The northeastern States also experience a smaller monsoon, between October to December, and thus it becomes all the more essential to craft a plan that accounts for the region’s year-long vulnerability. Historically, infrastructure development in these States has not kept pace with the rest of the country. While challenging geographical conditions are a major reason for this, there needs to be a systematic review involving all the affected States and the Centre to evaluate a sustainable long-term plan to reduce fatalities and the widespread destruction annually. Published - June 03, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Monsoon\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        oceans\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        Andaman and Nicobar Islands\n                    \n                            /                      \n                        \n                        rivers\n                    \n                            /                      \n                        \n                        Assam\n                    \n                            /                      \n                        \n                        Tripura\n                    \n                            /                      \n                        \n                        Sikkim\n                    \n                            /                      \n                        \n                        Meghalaya\n                    \n                            /                      \n                        \n                        Mizoram\n                    \n                            /                      \n                        \n                        Arunachal Pradesh\n                    \n                            /                      \n                        \n                        Nagaland\n                    \n                            /                      \n                        \n                        Manipur\n                    \n                            /                      \n                        \n                        flood\n                    \n                            /                      \n                        \n                        avalanche/landslide",
        "headline_1": "​Monsoon woes: On the southwest monsoon and the northeast",
        "headline_2": "Northeast States need a long-term plan to deal with floods",
        "link": "https://www.thehindu.com/opinion/editorial/monsoon-woes-on-the-southwest-monsoon-and-the-northeast/article69649625.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "03-06-2025"
    },
    {
        "full_article": "AI-powered drones, as used by Ukraine deep in Russian territory, are here. India must invest in R&D \nIn a first-of-its kind operation, Ukrainian forces launched a massive drone attack on Russia’s bomber fleet, reportedly destroying more than 40 heavy aircraft. In what is being dubbed as Russia’s ‘Pearl Harbour’ moment, the strikes took place at airbases thousands of kilometres away from the Russia-Ukraine frontline. The drones were smuggled into Russia and placed close to their targets on trucks. On Sunday, they were activated – exactly 29 years to the day when Ukraine handed over its last nuclear weapons to Russia as part of the Budapest Memorandum. It now appears that the drones were trained on AI algorithms to identify Russian bomber aircraft and hit them in their most vulnerable parts. \nUkraine’s ‘Operation Spider’s Web’ again highlights how much drones have transformed warfare. In the Ukraine war, drone innovation is changing in weeks. If 2024 was the year of First-Person-View (FPV) drones, 2025 till last week belonged to fibre-optic FPV drones – an innovation by Russian forces – that are immune to electronic countermeasures. Ukraine now has levelled up with AI-powered drones. Given these developments, the war has ensured that AI-driven, autonomous weapons systems are no longer decades away. They are here. And it’s not just aerial UAVs, but also sea drones like Ukraine’s Magura and UGVs like Estonia’s THeMIS – mini tank-like tracked platforms – that are increasingly being enabled by AI to perform autonomous swarm or group tasks. China recently unveiled an array of bird-mimicking drones or ornithopters that evade human and radar detection. \nTo stay ahead of the curve India too needs to heavily invest in drone R&D. Op Sindoor gave us enough reasons to pursue this course. Plus, if drones worth just a few thousand dollars can take out millions of dollars worth of bombers, innovation becomes critical. But it also enhances asymmetric warfare and longevity of conflicts. That’s why the second round of talks between Ukraine and Russia in Türkiye, has again failed to produce a ceasefire.\n\n",
        "headline_1": "Game of drones: Season 3",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/game-of-drones-season-3/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-06-2025"
    },
    {
        "full_article": "Credit is laughably easy to filch in a post-truth world\nIn the interest of world peace, it would be prudent to nod politely, smile blandly and let POTUS take the credit for preventing a nuclear holocaust in the nick of time, halting a thousand-year conflict or whatever else he may wish to claim. Such an accommodative attitude is smart management. Let’s face it, in the praise-starved world we live in, almost everyone covets credit, preferably deservedly but all kinds are welcome. \nThere are some who decide to wait their turn, hoping that when the bouquets do come, they are doubled because the intended recipient has been patient and gracious. But Trump has no time for such fripperies. He knows from long experience that good guys finish last, and the meek are not even in the running.\nCredit is laughably easy to filch in our post-truth world. You just need to look authoritative, and act busy, for virtually any accomplishment in the vicinity to be ascribed to you. That’s why this battle between those who do all the work and those who take the credit has been raging in many quarters.\nIt sows dissension at the workplace as it divides offices and factories into hierarchical camps, pitting the junior staff (who do the work) against bosses who inscribe their initials at the bottom of the sheet, and walk away with the credit. The ‘creative’ professions are even more vulnerable. Authors and artists go through sleepless nights, fearing their carefully wrought masterpiece will appear in someone else’s name. As for science, history is awash with experts kicking themselves for being lax when they ought to have rushed to the patent office and got their submissions in order.\nMost of the major discoveries and inventions of science are actually of uncertain parentage. Graham Bell’s phone, Edison’s light bulb, Fleming’s Penicillin and even Einstein’s Theory of Relativity have enough drama behind the scenes to become the subject of whodunits.\nThe names with which we commonly associate landmark achievements belong to those who did a fastest-finger-first and staked their claim early. Perhaps, that’s all POTUS attempted to do. In light of this, does it matter if he adds a truce in Asia to his other long list of ‘accomplishments’, including rebuilding an economy wrecked by Biden, winning for US the 2026 FIFA World Cup, and bringing about peace in Gaza? History has seen worse.\n\n",
        "headline_1": "That’s a steal!",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/thats-a-steal/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-06-2025"
    },
    {
        "full_article": "Patna’s largest hospital is in shambles. The state’s healthcare infra is appalling. And it’s business as usual  \nA 10-year-old child died in Patna’s largest govt hospital for lack of timely admission and treatment. It yet again shows the cratered state of healthcare in Bihar. Brought to Patna for treatment after days at a Muzaffarpur hospital, where she was taken after she was sexually assaulted and her throat was knifed, she waited for hours before admission in Patna Medical College & Hospital (PMCH). The hospital chief said she was registered under gynaecology because – ENT section had no ICU. That hospital authorities delayed taking into their care a child in obvious need of emergency treatment because they were figuring out ENT or gynaecology is moral paralysis. Surely the call on which medicine vertical she was to be admitted under shouldn’t have stalled the start of treatment? Surely doctors recognised this was an emergency? Truth is, it is healthcare in Bihar that is in emergency.\nLook at just health infra. CAG’s report on Bihar healthcare, tabled in assembly last Nov, found there were no emergency operation theatres in any of the sub-divisional hospitals audited, including in Patna. Only half of all ventilators were functional – 43% were in disuse for either lack of staff or the ICU itself being defunct. Patna has fewer than half the doctors it needs – there’s one public doctor for every 11,500 people. In district Araria, it’s one public doctor for – hold your breath – over 56,000 people. Shortage of staff nurses is 18% in Patna and 72% in Purnia; paramedics shortfall is 45% in Jamui, 90% in East Champaran, practically non-existent. \nPMCH is exactly 100 years old – it could have been an institute of repute. Instead, it’s crumbling – CAG reported a 33% to near total 94% shortage of equipment across PMCH’s departments. There’s a 36% staff vacancy in what is Patna’s “best hospital”. Alongside other services, this tertiary hospital has outsourced even its patient registration procedure to private parties. When this is the state of a tertiary care hospital, the decay in subordinate hospitals – subdivisional to block to district to PHCs – is of little surprise.\nNitish Kumar has been CM for a straight decade and counting. He has held the CM’s post for almost two decades. PMCH is being “modernised” – to make it “world class” per Nitish Kumar – under a massive “redevelopment” plan; billed to be “world’s second biggest hospital with 5,462 beds”. Going by this latest tragedy, that’s a cruel joke on the people. What good were those plans to that 10-year-old child?\n\n",
        "headline_1": "Bihar’s shame",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/bihars-shame/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-06-2025"
    },
    {
        "full_article": "Authored by Ashok Vohra\nThe Sanskrit term ‘ stithprajna’ combines ‘stitha’ – steady, firm, and ‘prajna’ – wise, learned. So, stithprajna means a person of steady wisdom. He is the ‘one whose mind remains undisturbed amidst misery, for whom sukha-duhkha, happiness and sorrow; labha-alabhau, gain or loss; jaya-ajaya, conquest and defeat are the same.\nA person, according to Gita, 2.55, attains the status of stithprajna when he ‘discards all selfish desires and cravings of the senses that torment the mind, and becomes satisfied in realisation of the Self, such a person is said to be transcendentally situated.’ A stithprajna turns his mind away from the material allurements and renounces lure of the senses. He is free from raag, attachment; dvesh, jealousy; bhay, fear; krodh, anger. He is indifferent to the uncertainties of life, its vulnerability to reversals and its resilience. He is indifferent to the temporary nature of the results of his actions, nor is he disappointed if he cannot achieve his chosen goals, complete the deeds undertaken by him, or even if his deeds do not yield desired fruits. The performance of actions with all sincerity is the end that gives him satisfaction.\nKathopanishad, 2.3.14, goes to the extent of saying that one who has renounced desires becomes like God: ‘When one eliminates all selfish desires from the heart, then the materially fettered jivatma (soul) attains freedom from birth and death, and becomes Godlike in virtue.’ In the Bhagwad Gita, 2.54, Arjun asks Krishn about the characteristics of a stithprajna. He asks, ‘How does the man of steady wisdom speak? How does he sit? How does he move about?’ Krishn answers that a stithprajna ‘practises self-control’ and ‘discards all selfish desires and cravings of the senses that torment the mind’.\nHis life is both authentic and autonomous.\nIf interpreted in Ludwig Wittgenstein’s terms, stithprajna is ‘the man…fulfilling the purpose of existence who no longer needs to have a purpose except to live. That is to say, who is content.’ For him, the solution to problems of life lies in ‘disappearance of the problem’. This frees him from hope and fear, ‘for life in the present there is no death.’ He knows that the lived world is ‘beyond the control of human will, and therefore he is content with how the world is.’ He lives in the world and accepts it without trying to change it. He contemplates the world as a limited whole as an impartial observer. He realises that he ‘cannot steer the world’s happenings according to (his) will,’ and that he is ‘entirely powerless’. He also realises that he ‘can only make (himself) independent of the world – and so in a certain sense, master it – by renouncing any influence on happenings.’ Krishn’s description of stithprajna also reflects in Rudyard Kipling’s poem If , it reads: “If you can dream – and not make dreams your master/If you can think – and not make thoughts your aim/If you can meet with Triumph and Disaster/And treat those two impostors just the same…/If neither foes nor loving friends can hurt you/If all men count with you, but none too much”.\n\n",
        "headline_1": "Wittgenstein, Kipling and Gita’s Stithprajna",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/wittgenstein-kipling-and-gitas-stithprajna/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-06-2025"
    },
    {
        "full_article": "The issues currently dominating economic discussions in Bangladesh are stagnant growth, high inflation, reduced investments, and apprehensions about a floating exchange rate, among others. But one particular topic that often does not feature in debates surrounding the country's economic challenges is joblessness, despite the alarming level it has reached of late. And this has important economic, social and political implications.\nToday, about 27.4 lakh people in Bangladesh are jobless and the unemployment rate in the country stands at 4.63 percent. During the first half of the outgoing fiscal year, more than 20 lakh people lost their jobs. It goes without saying that because of the way the phenomenon of unemployment is defined and enumerated, the official unemployment figures are underestimations of the real situation on the ground, and thus, the actual joblessness in Bangladesh is much higher than the official figure. For example, the official unemployment among women was reported to be 3.6 percent, but the real figure has been estimated and reported at 9.7 percent.\nSeveral factors have contributed to the high joblessness. First is the sluggish economic growth. Bangladesh's economy has grown by 3.97 percent during the current fiscal year. Excluding the pandemic years, this is the slowest GDP growth rate that the country experienced over the past 34 years. The agricultural sector grew by 1.79 percent during the current fiscal year, nearly half of the 3.30 percent growth rate the sector enjoyed during FY2023-24. The agricultural sector faced significant challenges, primarily due to severe flooding. The service sector growth during the same period dropped from 5.09 to 4.51 percent because of shrinking consumer demand, reduced industrial production, and declining exports in some sectors. As the agricultural and service sectors account for 82.6 percent of the total employment in Bangladesh's economy, the decline in the growth rate of these sectors contributed to the increasing joblessness in the country.\nThe second factor which has accelerated joblessness in the economy is inadequate investment and slow investment growth. The total investment-GDP ratio in Bangladesh has fallen from 30.7 percent last fiscal year to 29.38 percent this year. The corresponding figures for private investments are 23.96 percent and 22.48 percent respectively. The reasons for declines in private investments are uncertainties in the economy, political instability, high inflation, tighter monetary policy, alarming law and order situation, labour unrest, and absence of necessary reforms in various sectors of the economy. For example, in the absence of a clear election roadmap, investors—both local and foreign—are hesitating to come forward to invest more in the Bangladesh economy. Foreign direct investments (FDIs) are also not forthcoming. These are dampening both new investments and reinvestments necessary for running the existing plants. As a result, employment creation has been decelerated.\nHigh inflation is also a deterring factor and negatively impacts investments in three ways: first, by raising the cost of economic operations; second, by reducing consumer demand; and lastly, by making credit difficult to get. Since inflation made the factors of production costly, investors were discouraged from investing. Similarly, on the demand side, as inflation reduced consumer demands, the incentive for investors to invest went down too. Bangladesh Bank pursued a tighter monetary policy by maintaining higher bank rates in order to tackle high inflation in the economy. All these have had dampening effects on investments. With high inflation, there were lower investments and fewer business expansions. This ultimately led to fewer job creation and higher joblessness in the economy.\nLower investments in the economy, accelerated by economic instabilities and political uncertainties led to insufficient and shrinking job opportunities and also reduced entrepreneurial opportunities. In addition, the skill mismatch in the labour markets resulted in increased unemployment. In Bangladesh, the educational system has not been producing graduates with the skills required by emerging labour markets. For example, computer and digital education and experience in this field are now a must in the labour market. But many people lack computer and digital literacy and thus cannot find jobs. The quality of education is also a factor. Institutional factors like corruption, non-adherence to the rule of meritocracy have also contributed to joblessness in the economy.\nThe fundamental question, then, is what needs to be done to create employment in Bangladesh. Measures should be taken both at the policy and institutional level. At the policy level, the first thing that is needed is thinking out of the box. The pursuance of traditional vocational education and training would do some good, but it is inadequate to tackle the challenge of joblessness in today's world. The future world of work is changing fast with digital revolution, where traditional ideas of job creation have become obsolete. Both the content and the modus operandi of the future world of work would require new skill sets and different work organisation and processes.\nTo do that, first, an assessment profile of the kind of skills currently being developed in Bangladesh must be prepared, identifying areas of opportunities and deficits. In preparing such a mapping, the current and upcoming human resource demands of domestic entrepreneurs must be kept in mind. A comprehensive list of future job opportunities and the skills required for those jobs should be prepared. In that context, the new realities of digital revolution must be kept in mind. This assessment would also treat skilled migration as a national priority. Combining these three, a job mapping plan for the country should be formulated and that plan must be made consistent with the overall economic plan of the country. The existing National Employment Policy 2022 needs to be comprehensively revised and updated to reflect the prospects, needs and constraints of the current labour market and the future nature of work.\nSecond, the educational structure of the country including academic programmes, syllabuses, teaching and learning methods, and educational facilities must be evaluated. The objective of this assessment would be to determine whether the country's current educational system can meet its human resource demand as outlined in the job mapping plan. In light of this, the entire educational system must be overhauled, where science, technology, engineering and mathematics (STEM) would be at the core, along with information technology and artificial intelligence. In developing such an educational structure, the focus should be on the history, culture and heritage of Bangladesh. However, the structure should also draw on the experiences of achievements of other countries. Such an overhaul is essential for tackling the skill mismatch in the economy. The system should produce people with skills, and not just with certificates.\nThird, in order to upgrade work skills continuously, necessary training must be pursued to ensure that the knowledge is up-to-date, modern, timely and relevant. Specific programmes may be undertaken to improve skills. These include strengthening industry-academic partnerships, developing on-the-job mentorship, organising affordable in-house training, offering skill-based incentives and bonuses, providing language training programmes, utilising government skill development programmes, and partnering with local NGOs and training providers. Universities must be involved in research and innovation.\nEven though the issue of joblessness is not discussed at par with other challenges of the economy, it remains the elephant in the room. The issue of joblessness should be at the centre of the growth strategy so that Bangladesh's economy may pursue an employment-led growth, rather than a growth-led employment strategy. The central bank may also think of dual targets involving both inflation and employment. When it comes to tackling joblessness, we have to think out of the box as yesterday's strategies would not be able to solve tomorrow's problems.\nSelim Jahan is former director of the Human Development Report Office under the United Nations Development Programme (UNDP) and lead author of the Human Development Report.\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Tackling joblessness requires thinking out of the box",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/tackling-joblessness-requires-thinking-out-the-box-3909761",
        "news_paper_name": "The Daily Star",
        "publish_date": "03-06-2025"
    },
    {
        "full_article": "The extent to which the right to file cases has been exploited in the wake of the July uprising boggles the mind. It was only the other day that we commented on the questionable manner in which a 69-year-old former professor accused in an attempted murder case was treated. The case—filed by a former Jagannath University Chhatra Dal leader who was injured in a clash at the height of the uprising—had several hallmarks of a dubious case, including its lodging after about seven months since the alleged crime and mass listing of accused individuals (193 in total). Yet she was singled out, arrested, denied bail, and sent to jail. As we try to process the role likely played by police and magistrate courts in enabling such cases, we are again reminded of their absurdities by yet another case reported by this daily.\nThe victim this time, strange as it may seem, is a \"dead\" man coming alive. According to our report, Md Selim, a grocer from Mymensingh's Phulbaria, was falsely declared dead in a murder case filed over the July uprising. Lodged by his elder brother, with two other brothers serving as witnesses, the case claims that Selim was shot dead by police in Dhaka's Jatrabari on August 3 and later buried in Gopibagh. It also falsely implicates 41 people, including the ousted PM Sheikh Hasina.\n\nSelim is now fighting a surreal legal battle just to prove he exists, scurrying from office to office, facing severe harassment, and fearing for his life as a potential murder would fit the narrative of his \"death.\" The motive behind this case, as recent police investigations have uncovered, is a family dispute over inherited land. With Selim having no sons, his three brothers allegedly sought to seize his share by exploiting the chaos of the uprising to eliminate him, at least on paper.\nSelim is now fighting a surreal legal battle just to prove he exists, scurrying from office to office, facing severe harassment, and fearing for his life as a potential murder would fit the narrative of his \"death.\" The motive behind this case, as recent police investigations have uncovered, is a family dispute over inherited land. With Selim having no sons, his three brothers allegedly sought to seize his share by exploiting the chaos of the uprising to eliminate him, at least on paper.\nThat the legal system could be weaponised so easily for personal gain, and that such a bizarre case could progress as far as it did, speaks volumes about the merit of many of the cases filed over July atrocities. The incident also raises alarm about the integrity of those responsible for vetting or handling such cases. If an alive man can be shown as dead, and a 69-year-old widow arbitrarily jailed, how many other opportunistic or retaliatory cases have slipped through the cracks? We call on the authorities to urgently review all such politically or personally motivated cases, and hold to account those filing or enabling them. No one must be allowed to exploit the legal system or the July uprising.\n",
        "headline_1": "'Dead' man coming alive is the new face of July case fiasco",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/dead-man-coming-alive-the-new-face-july-case-fiasco-3909296",
        "news_paper_name": "The Daily Star",
        "publish_date": "03-06-2025"
    },
    {
        "full_article": "There is noise everywhere in this country, but no clarity. So many voices, yet no conversation. So much performance, but so little truth. What we are living through is not the chaos of a society falling apart. It is the quiet deterioration of a society unlearning how to live together. A society where fear passes for order, compliance masquerades as virtue, and survival replaces dignity. This is what it means to live in the absence of sanity.\nSpeaking freely has never been easy here, but it is now increasingly costly. In many institutions, students learn not to ask questions but to memorise what is safe. Journalists often prepare their reports with more concern for surveillance than for public understanding. Public servants, when caught between truth and hierarchy, frequently choose self-preservation. These are not isolated choices. They reflect an atmosphere in which honesty feels like a risk rather than a responsibility.\nWant to speak out? First, prove your loyalty. Want to protest? Prove you are clean. Want to demand justice? Prepare to be watched, archived, and named. Today, every voice is measured before it is heard. The system is not terrified of chaos. It is terrified of clarity. It knows how to manage conflict, but not conscience.\nWe are told this is a new beginning. That the regime has changed and the road is open. But even in this so-called transition, selectivity prevails. Some protesters are allowed to march to the Jamuna. Others are blocked on their own campuses. The National Citizen Party gets a platform and a warm reception. Jagannath University students came out with slogans; they went back tear-gassed. Who decides whose slogans count as legitimate speech and whose voices count as disruption?\nThis is not political coordination. It is message control. Even in the aftermath of a mass uprising, the instinct to manage dissent remains stronger than the willingness to hear it. When only some are allowed to speak, to gather, to be seen, we are not building a participatory democracy. We are rehearsing its image.\nIn such a climate, truth becomes a performance. Many people do speak, but in calculation. They weigh what can be said, how it might be received, who might be listening. Fear shapes the sentence before it reaches the tongue. And so we drift into a culture where restraint is mistaken for realism and silence becomes a civic virtue.\nThese patterns are not confined to politics. They shape everyday life. Some teachers hesitate to teach honestly. Some civil servants quietly enable what they once would have questioned. Many young people post online only to delete before dawn. Not everyone does this, but enough do to signal the cost of candour. Some call it strategy. But it is also exhaustion. And sometimes, quiet complicity.\nA functioning society requires not just truth but responsibility. Here too, we are faltering. When a bridge collapses, blame moves in circles. When a woman is assaulted, scrutiny often falls on her choices. When extrajudicial violence occurs, it is rationalised, not investigated. The practice of crossfire killings has gone on for years. In too many cases, the structure of power disperses blame faster than it delivers justice.\nConsider the case of the eight-year-old girl in Magura who was raped and left to die in March. The public grieved. People protested. The child was brought to Dhaka for treatment. The home adviser visited her at the Dhaka Combined Military Hospital (CMH), where she was being treated. She died. The state responded with statements, inquiries, and reassurances. But there was no public reckoning, no one who said, \"This failure is mine.\" What we saw was a technical response to a moral disaster. It was managed, not mourned. What do we call a society where even such a tragedy does not provoke shame among its stewards? We call it dangerously hollow.\nThis is not only about bad actors or broken policies. It is about what we are allowing ourselves to become. A society that is increasingly unable to tolerate disagreement. A public culture that rewards volume over substance. A politics that cannot reflect without spinning.\nSo please, do not ask for calm. Do not ask for balance. There is no balance in a room with one chair and a hundred people. There is no calm in a house where speaking freely is dangerous. There is no peace in a system that survives by keeping its people tired, confused, and scared.\nSanity does not demand perfection. It demands that we accept conflict without hostility, speak truth without fear, and take responsibility without evasion. It requires space for others to speak, even when they say uncomfortable things. And it begins from the recognition that fear may bring order, but it cannot sustain dignity.\nWe have not lost this sanity overnight. We are losing it gradually, through small decisions that wear down our willingness to speak, to think, to act. We stay quiet because it is safer. We look away because it is easier. We normalise what should alarm us.\nAnd if this continues, there will be little left to protect. Not values. Not institutions. Not even the meaning of the nation itself.\nYou want development? Fine. Build roads. Launch apps. Measure the numbers. But understand this: without conscience, there is no progress. There is only movement without direction. A state that functions, but a society that cannot breathe.\nThe present government says it wants reform. But reform is not a press release. If the same reflex to filter speech, manage protest, and silence discomfort remains intact, then reform is not change. It is self-preservation by other means. No real reform can begin until those in power learn to hear what they would rather punish.\nWe do not need heroes. We need citizens. People who will speak before being told what to say. People who will say \"I was wrong\" instead of \"What else could I do?\" People who will ask the dangerous questions, and stay to hear the answers.\nThat is how sanity begins to return. Not through noise. But through truth.\nUntil then, we remain what we are fast becoming. A nation speaking without listening. Marching without direction. Surviving without meaning. A nation that builds everything, except the courage to be sane.\nKazi ASM Nurul Huda is associate professor of philosophy at the University of Dhaka. He can be reached at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "In the absence of sanity",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-absence-sanity-3909306",
        "news_paper_name": "The Daily Star",
        "publish_date": "03-06-2025"
    },
    {
        "full_article": "It is deeply regrettable that even now—nearly 10 months since the August 5 political changeover—dubious cases filed in connection with the atrocities committed during the July uprising continue to make a mockery of our justice system. The latest victim to face the guillotine of such a case is SM Anowara Begum, a retired professor of Jagannath University (JnU) and a freedom fighter. Reportedly, Dr Anowara was sent to jail by a Dhaka court on Thursday, following her arrest the previous day. She, along with 192 others, faces the charge of attempted murder in a case filed by former JnU Chhatra Dal general secretary Sujon Molla, who was injured during clashes in July.\nFiled about seven months after the incident, the case naturally raises questions about not only the motive behind its lodging but also the lack of credible evidence linking the accused to the alleged crime. In fact, all such cases can be distinguished by their mass listing of accused and the incredulous nature of the allegations themselves. And as we have argued before, the lumping together of those who aided or committed the July atrocities and those who merely extended moral support to the Awami League regime is not just legally tenuous; it also opens the door to exploitations, complicates the trial process, and invites question marks over the outcome of ongoing trials.\n\nThe current process for filing cases does not require police officers to verify claims at the outset, allowing anyone to lodge complaints. But officers were instructed not to arrest innocent individuals implicated in such cases. Why, then, did they arrest a 69-year-old struggling widow, who could not possibly have been involved in the crime she was accused of? Why did the investigation officer demand in court that she be denied bail, calling her a flight risk? Why did the magistrate concerned accept it and send her to the Kashimpur jail? And why could the home or law ministry not intervene over the two days when this saga played out? \nThe implication of Anowara, with no known history of violent activism, further reeks of personal/political vendetta as evidenced by the list of the accused, which includes, among others, 10 teachers and five officials from JnU itself. Only fair investigations may reveal whether their selection was random or carefully orchestrated to settle old scores. The question is, why do the police keep accepting or acting on cases that clearly exhibit such red flags?\nWe understand that the current process for filing cases does not require officers to verify claims at the outset, allowing anyone to lodge complaints. But officers were instructed not to arrest innocent individuals implicated in such cases. Why, then, did they arrest a 69-year-old struggling widow, who could not possibly have been involved in the crime she was accused of? Why did the investigation officer demand in court that she be denied bail, calling her a flight risk? Why did the magistrate concerned accept it and send her to the Kashimpur jail? And why could the home or law ministry not intervene over the two days when this saga played out? We cannot just blame the justice system, or those filing dubious and retaliatory cases, if the very people involved in the system keep failing to do their job properly.\nWe talk about these failures mostly when people of some repute are implicated in dubious cases. But what about the many ordinary citizens and professionals whose lives are being quietly ruined? All the talk of police and judicial reforms would be meaningless if such state-enabled injustices are allowed to persist unchecked. Reforms must begin with mechanisms to prevent and penalise the misuse of legal provisions, ensure accountability of police officers and magistrates, and guarantee that no citizen is denied justice or protection from legal harassment. The interim government can no longer look the other way.\n",
        "headline_1": "Stop the state machinery quietly enabling dubious cases",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/stop-the-state-machinery-quietly-enabling-dubious-cases-3907401",
        "news_paper_name": "The Daily Star",
        "publish_date": "03-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 03, 2025 00:00:00  \nAgriculture in Bangladesh has improved appreciably and the main driver of it is undoubtedly technology. Yet the advancement falls short of the quantum leap technology has taken in the developed countries of the world. Japan has long been a pioneer in this field. China with the largest population until a couple of years ago was compelled to introduce innovative technology for raising agricultural production in order to feed its people. The use of the cutting-edge technology has ensured food security for that country. Agricultural scientists in Bangladesh must be credited for developing paddy varieties, vegetables and fruits ---both local and exotic---that can adapt to the local condition. Even in reviving the local stocks of indigenous fish on the verge of extinction, their research and experiment have been highly successful. Where the country's agriculture is lacking in is mechanisation and the use of highly advanced technology. \nAgainst such a background, the commerce adviser's request to the visiting Chinese commerce minister for drone technology for use in agriculture makes sense. Expressing his readiness to cooperate, the Chinese commerce minister made it clear that his country was \"ready to assist Bangladesh in agriculture and digital technology\". He added that the collaboration would specifically focus on \"smart agriculture and drone technology to boost productivity\". If drones are used in warfare with devastating effect, they can as well be used for peaceful and economic purposes. Bangladesh has limited introduction of tilling, sowing machines and combined harvesters but the use of drones in application of fertilisers, sowing seeds, spraying pesticides and monitoring crops is still beyond its reach. Indiscriminate use of fertilisers, pesticides and improper irrigation often marked by use of more water than necessary have remained endemic problems. The simple technology of placing a porous plastic bottle in paddy field to measure the exact amount of water could not as yet be made popular among farmers simply because of the lack of right kind of initiative to give it enough publicity. \nIf manual application of chemical fertilisers and pesticides is replaced by agri-sensitive drone, it can bring about a paradigm shift in crop production. What, however, may stand \nin the way of such technology's wider use is the cost. If the government provides advanced devices such as drones for collective use by farmers, the high procurement cost for an individual farmer can be avoided. Drones can be distributed among farmers by forming their cooperatives, the members of which will pay the price in instalment ultimately to own the digital device.\nAlthough fishery is considered a sub-sector of agriculture, it has ranges and scopes beyond agriculture. One such area is marine fisheries in which the backwardness of Bangladesh is beyond question. Chinese help in developing this sector can prove crucial. Bangladesh will need expertise, technology and, above all, sea-going vessels. Of the unexplored blue economy, deep-sea fishing is a most promising one---particularly after Bangladesh won the cases against Myanmar and India to have a far greater exclusive economic zone (EEZ) with its rights to an extended maritime boundary in the Bay of Bengal recognised. If Bangladesh gets proper fishing vessels, technology and expertise for deep-sea fishing, a new chapter in earning foreign currency will open. So, the technology transfer in the area of agriculture and maritime fishery can be highly beneficial for Bangladesh. So, it is most welcome.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Agrotechnology from China",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/agrotechnology-from-china-1748876608",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       June 03, 2025 00:00:00  \n\nIn recent months, Bangladesh has been visibly active in its bid to attract foreign direct investment (FDI). High-profile investment forums have been organised, numerous trade delegations from Western countries have visited Dhaka, and most recently, a large business delegation from China, led by its Commerce Minister, visited the country. These activities signal the government's awareness of the need for FDI and its willingness to project Bangladesh as an emerging destination for global investment.\nHowever, beyond the banners, receptions, and bilateral talks, there lies a more sobering reality. Economists and entrepreneurs -- both domestic and foreign -- remain largely unconvinced about the true readiness of Bangladesh to absorb and sustain FDI on a meaningful scale. The enthusiasm generated by such events is not translating into actual investment inflows. The scepticism is rooted in several persistent and structural issues -- political instability, bureaucratic red tape, outdated visa policies, and infrastructural bottlenecks like unreliable energy supply.\nForeign investors do not merely look for profit; they look for predictability, consistency, and long-term security. In this context, political stability is paramount. If there is any lingering doubt about the continuity of policies, or if street demonstrations become a frequent feature of urban life, it raises red flags. No matter how attractive the financial incentives may be, investors will hesitate to put their capital in an environment where they fear disruption, vandalism, or shutdowns resulting from political unrest.\nIndeed, political stability is not a luxury -- it is a prerequisite for economic development. Bangladesh's past growth trajectory in the garments and textile sector was bolstered during relatively stable periods when the political temperature allowed industries to function smoothly. But today, if political contestations translate into traffic gridlocks, shutdowns, or even violence, the potential of the country as an FDI destination weakens substantially.\nTherefore, if Bangladesh is serious about attracting sustainable foreign investment, it must go beyond showcasing opportunities and commit to ensuring political calm. Investors do not have the time -- or appetite -- to wade through chaos.\nAnother major deterrent for investors is the country's cumbersome bureaucratic processes, especially concerning customs clearance. Numerous foreign investors have pinpointed this as one of the greatest challenges of doing business in Bangladesh. The customs system is often riddled with procedural delays, a lack of transparency, and arbitrary decision-making. These delays don't just inconvenience business; they cost money -- a lot of it -- and create a general atmosphere of unpredictability.\nIn a globalised economy where the speed of delivery can make or break a business model, time lost in clearing unnecessary hurdles is a dealbreaker. Goods stuck in customs, inconsistent assessments, and multiple layers of unofficial negotiations only dampen enthusiasm. Simplifying, digitising, and depoliticising customs procedures is not a matter of prestige -- it is a fundamental requirement to become competitive.\nAnother baffling policy flaw lies in the current visa regime for foreign investors. Presently, foreign businesspersons often have to renew their visas every three months. This sends a poor signal -- not only of inefficiency but also of a lack of welcome. Investors want to feel valued and secure, not scrutinised or inconvenienced at every turn. The visa process should be overhauled to issue long-term, multi-entry business visas with a straightforward renewal mechanism. Other investment hubs in the region have already moved in this direction -- and Bangladesh cannot afford to lag behind.\nThe structure of Bangladesh's economy, which relies heavily on protecting domestic industries through high tariffs, also needs careful reconsideration. While protectionism can be justified during the early stages of industrialisation, prolonged reliance on it discourages foreign investors who find local production costs inflated and competitiveness low. If domestic products are costlier than imports, there is little incentive for global manufacturers to establish production facilities locally.\nTo attract FDI, Bangladesh must signal that it is open to competition and committed to free-market principles. This does not mean abandoning all protection but striking a balance that encourages domestic industries to innovate and scale up, while making room for foreign capital and expertise.\nIndustrial investment is energy-intensive. Yet, factory owners and industrialists in Bangladesh continue to complain about the unreliable energy supply -- be it electricity or gas. Frequent power outages, poor grid infrastructure, and gas shortages are not just technical hiccups -- they are business risks. When factories cannot run at full capacity due to energy disruptions, the cost of production increases, deadlines are missed, and investor trust erodes.\nAs the country moves towards attracting investments beyond the garments sector -- particularly in high-tech manufacturing, electronics, and heavy industries -- it must prioritise a reliable and expanded energy supply. This includes both conventional sources and renewable alternatives, with strategic investment in power infrastructure.\nA quick glance at regional comparisons further illustrates the challenge. Bangladesh's FDI-to-GDP ratio is a mere 0.75 per cent, significantly lower than India's 1.7 per cent and Vietnam's impressive 4.7 per cent. This is not just a statistic -- it is a symptom of missed opportunities. Vietnam, in particular, has emerged as a global case study in successfully attracting FDI through structural reforms, political stability, and a welcoming business climate.\nThere is, however, an emerging window of opportunity for Bangladesh. With the U.S. imposing tariffs on Chinese exports and many Western firms looking to diversify their supply chains away from China, Bangladesh stands to gain. But capital will not shift to Bangladesh merely on the basis of geography or labor cost. The country must prove that it is a reliable, efficient, and politically stable destination.\nThe frequent high-level visits, conferences, and investment summits are useful in showcasing Bangladesh's potential. But potential alone does not attract investment -- performance does. Foreign investors are smart, pragmatic, and well-informed. They don't make decisions based on ceremonial handshakes or promotional brochures. They conduct due diligence, observe the socio-political dynamics, and analyse systemic bottlenecks before committing their money.\nThus, while the optics of engagement are encouraging, they must be accompanied by real, visible reforms. A stable political environment, streamlined customs process, investor-friendly visa policy, open trade structure, and reliable energy infrastructure are not optional -- they are essential.\nThe government, if it truly seeks to make Bangladesh a serious player in the global investment arena, must realise that sound bites and symbolic gestures are not enough. Structural reforms, political maturity, and administrative efficiency are the only real currencies in this highly competitive global race for capital.\nBangladesh stands at a crossroads. With its demographic dividend, strategic location, and proven industrial base in garments, it has the right ingredients to become a South Asian investment hub. But unless the climate of uncertainty is replaced with stability and reform, the opportunities ahead will remain untapped, and foreign investors will continue to look elsewhere. The time to act is now.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Attracting FDI: Stability is the key",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/attracting-fdi-stability-is-the-key-1748876866",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       June 03, 2025 00:00:00  \n\nTreatment at a major government-owned eye hospital, the National Institute of Ophthalmology and Hospital (NIOH), has been suspended since last Wednesday (May 28).The reports are rather sketchy about what exactly happened that led to total work stoppage by doctors, nurses and other staffs of a specialised hospital in the city. Hospitals are meant to provide emergency service, come rain or shine, to people in need of medical service and are not like other organisatios where you have the freedom to stop work at will. But the NIOH seems to be an exception. Sporadic clashes that broke out on Wednesday left some 15 doctors, nurses and other hospital employees wounded, director of the NIOH, Prof. Khair Ahmed Choudhury, reportedly told the media. \nAccording to him, a group of July uprising patients with eye injuries attacked the NIOH staff. So, the hospital staff went on a strike by stopping work since Wednesday demanding enhanced security. But Akhter Hossain, a July protester, reportedly, denied having attacked the hospital staff. On the contrary, he claimed that they were protesting against irregularities at the hospital and, what he said, the authorities' negligence regarding their treatment. And the doctors, nurses and other hospital staffs had not returned to work for the fifth straight day till Sunday (June 1). On Monday (May 26), prior to Wednesday's reported skirmishes at NIOH, four victims of the July uprising allegedly attempted suicide by taking poison during a meeting at the hospital. However, they were later treated at the Shaheed Suhrawardy Medical College and Hospital. Following that incident on Tuesday (May 27), the July-injured were allegedly engaged in infighting and also kept the NIOH director confined in his office room for one hour and a half. But it all adds to the confusion as to what really went wrong at the eye hospital since May 28 and before. \nMeanwhile, the NIOH director, Prof. Choudhury is learnt to have gone on a week's leave since May 28.\nA team from the Ministry of Health and Family Welfare is reportedly working to end the deadlock and has been requesting people seeking medical service from the NIOH to take treatment from any nearby hospital. This is obviously not an answer to the abnormal situation prevailing at a public hospital. Hundreds of outpatients are being deprived of service. In-patients who were waiting for surgery are worse off as they have to go elsewhere for the critical service. Consider the unacceptable situation the striking medical professionals have created in a specialized public hospital where between 150 and 200 eye surgeries are conducted in a day and some 3000 patients are served including outdoor ones every day. Many of these patients are clueless about what to do after being denied service at the hospital. This is nothing short of anarchy. Whatever had happened at the hospital on May 28 and days before and after in the form of brawls involving hospital staffs and July uprising victims, some 60 to 70 of whom reportedly have been receiving in-patient treatment at the hospital, that should not be enough reason for doctors, nurses and other members of the service staff to abandon the hospital for an indefinite period of time. For a hospital is supposed to work even in wartime. It appears, no one is concerned. As could be gathered, since the reported scrimmage, a large contingent of police, ansars and other members of the law-enforcement agency has been deployed to beef up the security of the hospital. Why the hospital staffs are still not feeling secure to join work? A wait-and-see approach won't do. On the contrary, the government should put its foot down to resolve the crisis at NIOH, address any genuine grievances of the hospital employees including those of the July uprising victims, if any, so the normal work at the eye hospital might resume without delay.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "What's happening at nat’l eye hospital",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/whats-happening-at-natl-eye-hospital-1748876936",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 03, 2025 00:00:00  \n\nMusic is an art form that expresses emotions through patterned and rhythmic sounds. As the world modernises, this sector of entertainment is undergoing significant transformations. While a decade ago we used to purchase cassettes and albums to listen to our favourite artists, now it is as simple as the click of a finger. With increased accessibility to music, the process of composing it has also become more affordable. Thanks to AI and various software, people's voices can be used to create catchy music. Nowadays, songs are heavily influenced by the use of instruments, filters, and visuals. In some cases, a remix can become more popular than the original version.\nIn this era dominated by short content and reels, we no longer have to wait to hear the best and most energetic parts of a song, which encourages creators to produce even shorter tracks. Due to the trend of short-form content, music often appears on our screens without us intending to listen to it. As a result, we frequently find ourselves repeatedly exposed to the same tunes. This repetitive sound can become ingrained in our minds, making it difficult to concentrate on tasks and ultimately overloading our cognitive capacity.\nTasfia Tahreen \nStudent \nIdeal school and college \nshahirintas@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Harmful distracting tunes",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/harmful-distracting-tunes-1748876963",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-06-2025"
    }
]