[
    {
        "full_article": "The National Crime Records Bureau’s annual reports on crime and prison statistics have to be read with a strong caveat — most of the numbers cannot be compared between States because they are largely dependent upon the registration/reporting of crimes in the first place. However, certain national trends and sharp year-on-year changes within States can still reveal meaningful patterns that could demand policy intervention. The recent NCRB report for 2023 — delayed by a year — points to a worrying trend of postponed surveys, reports and even the Census under the current Union Government. But there are also three telling numbers: the 2.8% decrease in murder cases across the country; a staggering 28.8% surge in crimes against Scheduled Tribes (ST), and a 31.2% increase in cyber crimes. While the decrease in murder cases will come as a relief to law enforcement — most of the cases pertain to disputes, personal vendetta or enmity and “gain” — the other two numbers are alarming. The steep rise in crimes against STs is largely due to the ethnic violence in Manipur, with the registered numbers jumping from just one in 2022 to 3,399 in 2023 — which a more effective government could have mitigated. Madhya Pradesh and Rajasthan also recorded significantly high crime rates against tribals suggesting their vulnerability in the central Indian States. This is not a new phenomenon; previous NCRB reports have highlighted higher crime rates in regions with significant tribal populations.With greater Internet penetration across the country, there has been an increase in cybercrime, particularly related to financial fraud and sexual exploitation. Anecdotally, it is evident that these numbers must have gone up even further in the last two years with the greater use of digital financial instruments in daily transactions and investment. While policing has tried to keep up with the growing menace of cybercrime, with specialised cells, the ubiquitousness and deepening spread of digital crimes require more sophistication and dedication by the police to tackle them. Crimes against children rose by 9.2% in 2023 — with the offender known to the victim in 96% of the cases. While the increase could be a function of improved reporting across States, the high number (1,77,335 cases) suggests that States must work on a war footing to sensitise children about these crimes and inappropriate behaviour by adults. A subset of these crimes could also include the application of the POCSO Act in the case of consensual adolescent relationships and this is an area that needs to be carefully handled by the prosecuting and policing agencies. Reported crimes against women registered a modest increase of 0.4%, but this masks a 14.9% spike in dowry-related crimes, pointing to a persistent societal problem.\r  Published - October 11, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        crime\n                    \n                            /                      \n                        \n                        prison\n                    \n                            /                      \n                        \n                        population and census\n                    \n                            /                      \n                        \n                        Reservation\n                    \n                            /                      \n                        \n                        cyber crime\n                    \n                            /                      \n                        \n                        Manipur\n                    \n                            /                      \n                        \n                        Madhya Pradesh\n                    \n                            /                      \n                        \n                        Rajasthan\n                    \n                            /                      \n                        \n                        internet\n                    \n                            /                      \n                        \n                        sexual assault & rape\n                    \n                            /                      \n                        \n                        fraud\n                    \n                            /                      \n                        \n                        finance (general)\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        police\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        children\n                    \n                            /                      \n                        \n                        marriage\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "Crime patterns: On the National Crime Records Bureau’s report for 2023",
        "headline_2": "The 2023 NCRB report shows a sharp rise in cybercrime and crimes against tribals",
        "link": "https://www.thehindu.com/opinion/editorial/crime-patterns-on-the-national-crime-records-bureaus-report-for-2023/article70148719.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "12-10-2025"
    },
    {
        "full_article": "At a time of two wars in the world, a writer described as a “master of the apocalypse” has been awarded the Nobel Prize in Literature for 2025. Hungarian author László Krasznahorkai was chosen by the Swedish Academy “for his compelling and visionary oeuvre that, in the midst of apocalyptic terror, reaffirms the power of art”. The 71-year-old novelist and screenwriter has won many accolades and was a perennial candidate. Often compared to greats such as Franz Kafka, Fyodor Dostoevsky and Herman Melville, his dystopian, absurd and melancholic stories mirror life in Hungary under oppression and beyond in the pre and post-fall of the Iron Curtain era, with a chilling resonance to contemporary times. He gained recognition with his 1985 novel of ideas, Satantango, translated into English by George Szirtes in 2012. It revolves around a group of destitute residents of a collective farm on the eve of the fall of communism, waiting for a miracle, which needless to say would not happen. The tone is set with the epigraph, from Kafka’s The Castle: ‘In that case, I’ll miss the thing by waiting for it.’ Krasznahorkai has collaborated with film-maker Béla Tarr to adapt his works for the cinema. With his second book, The Melancholy of Resistance, he began to be hailed as a postmodern visionary. It was published in Hungarian in 1989, when the wall came down, and first translated into English in 1998.In The Melancholy, a circus comes to a town with the carcass of a giant whale, and sinister happenings follow. His unbroken sentences — like a fellow laureate, Jon Fosse, Krasznahorkai too often omits full stops — are often deemed difficult and demanding. His translator calls Krasznahorkai’s work “a slow lava flow of narrative, a vast black river of type”. Krasznahorkai’s travels to China and Japan in the early 2000s inspired his contemplative novel, Seiobo There Below. The breadth of his oeuvre is evident in the homage he pays to literary giants: Dostoevsky’s The Idiot gets a relook in Baron Wenckheim’sHomecoming; Melville’s ghost haunts Spadework for a Palace: Entering the Madness of Others, a story set in Manhattan. In an interview to writer Hari Kunzru for The Yale Review, Krasznahorkai says “the apocalypse is now”, pointing out that “hell and heaven are both on earth, and they are here now”. About the role of art in the future, he says: “Art is humanity’s extraordinary response to the sense of lostness that is our fate.” By awarding literature’s top prize to Krasznahorkai, the Swedish Academy signals that it is turning to serious but innovative literature and art in a world where little makes sense. Published - October 11, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        award and prize\n                    \n                            /                      \n                        \n                        World literature\n                    \n                            /                      \n                        \n                        Hungary\n                    \n                            /                      \n                        \n                        authors and poets\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Japan\n                    \n                            /                      \n                        \n                        award-winning books",
        "headline_1": "Making sense: On Krasznahorkai and the Nobel Prize in Literature for 2025",
        "headline_2": "Krasznahorkai gets recognition for melancholic stories in an absurd world",
        "link": "https://www.thehindu.com/opinion/editorial/making-sense-on-krasznahorkai-and-the-nobel-prize-in-literature-for-2025/article70148743.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "12-10-2025"
    },
    {
        "full_article": "The IT sector isn’t vanishing. In fact, companies are still signing multi-billion-dollar deals related to AI. But the opportunity pool is shifting\nAsk anyone who entered India’s IT sector in the late 1990s or early 2000s, and they’ll tell you the same story. Getting into a big IT services company was like securing a lifetime guarantee. You joined as a coder or analyst, climbed the rungs patiently, and, more often than not, stayed put for decades. It was predictable. It was comfortable. And for a whole generation, it was aspirational.\nBut the ground beneath that pyramid is cracking. Artificial intelligence, automation, and global market churn are dismantling the very foundation of the model that once powered India’s $280 billion IT industry. Today, companies don’t want armies of engineers filling cubicles. They want a handful of highly skilled professionals — sharp, adaptive, and capable of hitting the mark with precision. It’s not about the biggest army anymore. It’s about who has the most snipers.\n\nThat’s the real story behind the TCS layoffs of thousands of people. On the surface, it looked like a standard case of over-hiring. But scratch deeper, and the picture changes. These weren’t entry-level coders being shown the door. They were mid-level and senior managers — the people who for years oversaw transactions, tracked project progress, and intervened when something went wrong. Why? Because those functions are now being done by AI-powered project management tools — more cheaply, more consistently, and with fewer errors. As Krishnakumar Natarajan, co-founder of Mindtree, put it bluntly: “Organisations will get much flatter because AI-driven development tools are delivering more productivity than we ever imagined.”\nBenching the bench\nThe ‘bench’ was once considered the secret weapon of Indian IT. Companies could keep staff unassigned and then quickly deploy them when new projects came in. But in today’s environment of tighter budgets and razor-sharp margins, the bench feels less like a safety net and more like a waiting room before the exit door. For many, being on the bench now is no longer neutral; it’s a risk signal.\nTime is the ultimate KPI\nTalk to IT professionals today and you’ll hear the same refrain: productivity has been redefined. A senior programme manager shared how his team was tasked with cutting bugs by 75% and shipping 25% more features this year — without any new hires. A mid-career engineer told me he was juggling faster delivery expectations alongside mandatory upskilling in AI/ML, often outside regular hours. The message is loud and clear: output, accuracy, and speed matter more than ever. Your ability to adapt AI into your daily work is not optional anymore. It’s the baseline.\nReloading with blanks\nIf the industry is evolving this fast, then upskilling sounds like the logical answer. And indeed, almost 80% of IT professionals surveyed said they’re investing in certifications. Employers are offering subscriptions and training access. On paper, it looks like the ecosystem is doing the right thing. But here’s the catch. A mid-career engineer told me: “Upskilling programmes have been around forever. But personally, I’ve found them kind of useless. You can find much higher-quality content on YouTube.” The problem isn’t lack of training — it’s the lack of relevance. Teaching thousands of employees the basics of Python or a new cloud tool isn’t enough. Reskilling must be contextual, hands-on, and directly tied to solving real business problems. Otherwise, it’s a check-box exercise that does little to future-proof careers.\nHard skills alone don’t cut it\nThe sharpest IT professionals of tomorrow won’t just be coders or consultants. They will be multidimensional. Some will be AI-augmented builders, using automation to achieve speed and accuracy at scale. Others will be business translators able to bridge the complexity of technology with client expectations. Still others will be specialist generalists — deep in one domain, but agile enough to work across adjacent ones like cloud, security, or UX. But technical skills alone won’t cut it. As one product manager who lost his job after 15 years said, “Hard skills land you the job; soft skills help you keep it.” Communication, empathy, and the ability to lead through uncertainty are increasingly the differentiators in a shrinking pyramid.\nNot shrinking but shifting\nThis is perhaps the most misunderstood part of the story. The IT sector isn’t vanishing. In fact, companies like TCS, Infosys, and Wipro are still signing multi-billion-dollar deals in AI implementation and digital transformation. But the opportunity pool is shifting in character. Industry-wide growth has been stuck in low single digits for the past two years. Global capability centres are competing aggressively. Clients are tightening budgets. And yet, for those who can adapt, the demand for AI fluency, domain knowledge, and consulting skills has never been higher. The future is not smaller — it’s sharper.\nStability to survival\nThis is the hardest truth for IT professionals to accept. The model that gave so many a stable life — mass hiring, career-long promotions, and corporate protection — is breaking down. In this new era, waiting for an employer to reskill you or to shelter you through downturns is not a viable plan. The winners in this new landscape will be those who reinvent themselves; the losers will be those who cling to the old pyramid, hoping it will hold. Remember what Microsoft CEO Satya Nadella said: “The hardest part of AI isn’t the tech. It’s getting people to change how they work.” That’s the challenge ahead for India’s IT professionals. The question is, are you ready to change how you work?\n\n",
        "headline_1": "Not armies but snipers! Why IT professionals must rethink careers",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/voices/not-armies-but-snipers-why-it-professionals-must-rethink-careers/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-10-2025"
    },
    {
        "full_article": "Paaltu Chuha’ is considered an offensive term. The Chhattisgarh high court recently ruled that calling your husband this phrase — loosely translated as pet rat — amounts to cruelty. Had the wife simply realigned a few letters and called him ‘patla chuha’ or skinny rat instead, she may have sailed through. After all, in a world where people are injecting themselves with Ozempic and Mounjaro in the quest for slenderness, the phrase would read less like an insult and more like a compliment. Fit these days is just a euphemism for thin.\nSize does matter. If you are a tampon, a key, a battery or a chappal. But we have extended this parameter to human beings. Especially women. I am not immune to the cult of shrinking waistlines. In fact, I’ve spent a lifetime trying to be a patla chuha, even when I was what could be considered an ‘ideal weight’. Partly because there is a plump 10-year-old constantly living inside my head who was once serenaded with ‘Twinkle, twinkle little star, how I wonder what you are, up above the world so high, like a teapot in the sky.’\nThen came professional pressures. As a young actress, a director asked if I could lose five kilos before his shoot. Considering it was a mere two weeks away, I was tempted to reply, ‘Yes, I can, I just have to cut my left leg off.’ Instead, I decided to push my sluggish metabolism by giving up carbs and taking up running. I measured every parameter: kilos, inches, and ratios like I was an architectural marvel that had to withstand tectonic shifts, not a woman made of soft flesh and strong ideas.\nA woman’s body seems to be a barometer of cultural transitions. During the Renaissance, art celebrated undulating bellies and wide hips. These were signs of prosperity. Victorian corsets shrank waists and freedom. The flapper girls rebelled with their straight lines to match their cigarettes. Marilyn Monroe’s curves and the emaciated models of the ’90s reflected the shifting values of their times. Each generation redraws the outlines of beauty. Ours worships the toned and slender. For women with the time and the means to count macronutrients, hire trainers and procure expensive injectables, thin is now the ultimate status symbol.\n\nILLU CREDIT: CHAD CROWE\nIn the manner of every trend, this will change again. Wait long enough and your body type —whether it’s banana or laddoo-shaped — will become fashionable. Like the pair of slim-fit Levis I have been hoarding for the last 25 years which I try on and use as perhaps a measure of my worth as much as my size after each transition — marriage, childbirth, perimenopause. That no-stretch pair even led to an epiphany and, the title of a book, when unable to zip it up after a bout of Diwali indulgences, I realised that pyjamas are forgiving in nature but it’s jeans that really hold a grudge.\nSo does fat. If my fat stores could speak instead of showing off more dimples than Shah Rukh Khan, they’d insist that they are not villains but a means of evolutionary insurance. Survival of the fittest was never about looking good in a photograph; it was about surviving droughts and famines.\nFor decades, we have been told that being slim is about self-control and discipline. Recent research shows that each body has a range it gravitates towards, influenced by factors like genes and hormones. There was a time I blamed my half-Gujarati genes for storing excess calories on my thighs in almost the same spongy form as our favourite snack-dhokla.\nA slow metabolism, though, isn’t laziness, it’s efficiency. I can eat and move as much as my slim friend and while she burns through every calorie in a flash, I have some left over to tuck away for future use. If I were a car, I would be a shining example of fuel-to-mileage efficiency. Auto magazines would write odes about my engine endurance. Tesla would bid for patent rights, calling me the epitome of engineering.\nThese days, though, weight issues are no longer just a woman’s burden. Men, too, are using injectables and liposuction to get to their six-pack ideal. A twisted step toward equality, where both genders endure torment in pursuit of nebulous perfection.\nWhile a part of my self-esteem may always be tied up with a number on the scale, I can no longer facilitate it through the currency of pain. Strong has replaced slim in my lexicon. Instead of starving, I lunge and squat through my fifties to maintain bone and muscle mass.\nThe tug of war between vanity and genetics will perhaps continue for a lifetime, with each side winning small skirmishes. But survival of the fittest isn’t about fitting in — into jeans, norms or stereotypes. It’s about standing out. While the patla chuhas perfect angles for Instagram reels, it’s the sturdy, dhokla-powered, mota bhais and bens who are running the show — in boardrooms, stock markets, and politics.\n\n",
        "headline_1": "In the age of patla chuhas, long live the mota bhais and bens",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/mrsfunnybones/in-the-age-of-patla-chuhas-long-live-the-mota-bhais-and-bens/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-10-2025"
    },
    {
        "full_article": "Prashant Kishor, the backstage strategist of multiple winning campaigns across the country, is now in the spotlight himself. In Bihar’s bi-nodal political landscape — divided between the National Democratic Alliance (NDA) and the Mahagathbandhan (MGB) — Kishor is being seen as the disrupter. Some political commentators are calling him the X factor of the 2025 Bihar elections.\nHe has set the bar high, declaring that “even if I get 125 seats, I would consider it a defeat” and expects voters to put him “ya to arsh par, nahi to farsh par” (Either I’ll be on the throne or on the floor). Bihar’s politics has often rewarded audacious campaign planks, be it Jayaprakash Narayan’s call for Sampoorna Kranti, Lalu Yadav’s attempt to turn the social hierarchies upside down, or Nitish Kumar’s bid to make governance the centrepiece of his campaign at a time when Bihar was showing the signs of a failed state. Whether Prashant Kishor will join that list remains to be seen.\n\nYet, any careful analysis of the electoral prospects of his Jan Suraaj Party (JSP) must separate credible signals from the hype created around him. After all, as a seasoned election strategist, he has the means and method to amplify his side of the story.\nLimits of a startup\nFirst, what are the possibilities that PK’s party can, on its own, emerge as the single largest party in this election? The short answer: it’s very unlikely. Political start-ups have rarely managed to form the govt or even come second in their first elections. There are, of course, some exceptions such as the landslide victory of NT Rama Rao’s TDP in the 1983 Andhra Pradesh elections, the Asom Gana Parishad’s win in the 1985 Assam elections. AAP in the 2013 Delhi elections emerged as the runner-up and was sworn in with the outside support of the Congress. However, in each of these cases, there were serious political disruptions that led to formation of these parties in the first place. These parties were also built on massive on-ground mobilisation.\nPK did launch his party on Oct 2, 2024 after a two-year padyatra across the state that started from Gandhi Ashram in West Champaran district. He claims his team has visited over 5,000 villages, engaging with local communities to identify key issues, and has a membership base of 1 crore. There is no way to verify the extent of his engagement or party membership, but surely there have been no cataclysmic events in Bihar that could propel a new political force to office in its very first election.\nEarly signals\nSecond, for a more realistic assessment, let’s look at the JSP’s first test in four assembly bypolls in Nov 2024. Though the party lost its deposit in all but one seat, its vote tally exceeded the victory margin in two constituencies. The NDA won all four seats (three of these seats were won by the MGB in 2020). However, the results did indicate that JSP has a spoiler potential, especially if it manages to get the candidate selection right.\nSince then, PK’s popularity has steadily increased in various opinion polls. Data from some polls conducted just before the announcement of dates indicated that if elections were held then, the JSP may garner approximately 10% of the vote, and PK was top choice for chief ministership among slightly more than 20% of respondents. If JSP can keep up this momentum and win the vote share estimated by these opinion polls, it could decisively shift the balance in favour of one alliance, especially in closely contested seats.\nSpoiler potential\nThird, whose chances will JSP hurt more — the NDA’s or MGB’s? The bypolls indicated damage to the MGB but that may not be the best indicator. Incumbent party is more often likely to do better in bypolls, and moreover, JSP effect was largely limited to one constituency in Imamganj, where it won 22% votes. In the upcoming polls, even NDA’s chances could get hurt if the seat-sharing arrangement within the NDA along with the whisper campaign against Nitish Kumar makes JD(U) appear as a party that could be cannibalised. In the end, the real effect of JSP playing a spoiler may largely be driven by the candidate choices parties make.\nSo far, there is no clear signal from opinion polls on which caste group is much more likely to vote for the JSP. He appears to be getting slightly more support from upper castes and Muslims than from OBCs and Dalits. It appears that PK’s campaign, by design or accident, is mobilising the economic anxieties among the more aspirational segments such as school teachers, professionals, small entrepreneurs, educated youth and migrants. For them, Kishor’s anti-establishment pitch resonates precisely because both the NDA and MGB seem like two factions of the same old order that have dominated state politics for the last 35 years.\nSo even if PK’s gambit succeeds in a modest way, then the 2025 Bihar election may be won or lost in margins. And, in the process, it may shift the grammar of politics in a state where caste loyalty is the only thing that matters in an electoral battle. Much will depend on whether this middle layer of Bihar’s society remains steadfastly committed to PK’s insurgency or their other identities (and factors) become more dominant on polling day.\nIn Bihar’s political theatre, Kishore is not just another political entrant; he carries a burden with him. He is a test case of whether election management (PR, strategy, data, etc) can substitute for politics (social coalitions, political alliances, charisma etc). His previous avatar as a strategist did not require him to have a clear ideological image. As a politician, he cannot avoid one. PK is no longer just a planner behind the curtain; he now aspires to be a product with a long shelf life.\n\n",
        "headline_1": "In a state where caste is the constant, can PK be the variable?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/voices/in-a-state-where-caste-is-the-constant-can-pk-be-the-variable/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-10-2025"
    },
    {
        "full_article": "Investors spooked by Trump’s policies have sought safety in gold, but expecting an endless rally would be a mistake\nGold crossed the $4,000 per ounce milestone this week. That’s over ₹1.2L per 10g in Indian market terms, an all-time record. The world’s 7.2L centenarians will remember a time when an ounce – 28.3g – used to be worth $20.7. In fact, this rate largely held steady for a century from 1834 to 1934, when it was raised to $35 and maintained for the next 34 years. Gold was a stable commodity then, and a stabilising influence on the global economy. Now, it’s a hedge, which explains why its price soars at the first sign of trouble.\nThat sign this year is Trump – born in the $35 era and now going on 80. Gold was at $2,700 on the day he was sworn in eight months ago, so it’s gained about 50% already. It hit $3,000 in March when Trump amped up talk of tariffs and spread uncertainty, and has crossed $4,000 now amid delayed US financial data and a US govt shutdown. Goldman Sachs sees it hitting $4,900 by Dec next year – over ₹1.5L per 10g.\nOf course, predictions are based on assumptions and shouldn’t guide action. When gold went from $38 per ounce in 1972 to $850 in 1980, financial advisers would have egged you on to buy more of it. But by 1999, it had crashed to $251. In 2022, gold tumbled from $2,000 to $1,600. What Trump does next will certainly determine gold’s trajectory, but unexpected events can overtake him and the rest of us. Gold crossed $1,000 amid the 2009 financial crisis, and $2,000 during the pandemic. Both times, fears of inflation from massive govt stimulus spending – over $20tn in the first five months of the pandemic – started the dash for the safety of gold.\nLarry Summers, US treasury secretary under Clinton, said investors rush to gold “when they don’t have confidence in the people who are managing the country”. But Trump’s ad hoc policy-making is affecting confidence beyond US borders. That’s why central banks have been lapping up gold too. As savers and investors, the thing to remember is that the surge in gold’s price isn’t organic. Gold is a haven, yes, but this mad rush could end in a stampede.\n\n",
        "headline_1": "Shine Language",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/shine-language/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 12, 2025 00:00:00  \nThe guns have fallen silent in Gaza, at least for the time being. After two ruinous years of Israel's bombing, starvation and deprivation in Gaza, the first phase of a US-brokered ceasefire between Israel and Hamas has come into force. As the Israeli Defence Forces (IDF) withdraw to predetermined lines, tens of thousands of displaced Gazans are returning to the rubble of their homes while the process of releasing all remaining Israeli captives and surging aid into the famine-stricken enclave is set to begin. This is a cessation born of exhaustion and immense suffering, not of victory. Still, this halt in violence is a small mercy for a people who have endured what has been described as the modern era's first live-streamed genocide. In real time on social media, the world has watched as Israel's military, bankrolled by Western nations that claim to stand for human rights, has slaughtered more than 67,000 Gazans since October 7, 2023. Through it all, the Palestinian people in Gaza have endured and the cause of Palestine, therefore, still lives. \nHowever, this fragile truce between Israel and Hamas is filled with ominous uncertainties. The initial phase involving the exchange of captives for prisoners and aid delivery mirrors the pattern of past ceasefires that quickly fell apart. What follows this stage remains uncertain and will likely prove even harder to implement, as it depends heavily on unstable Israeli politics and the untested role of the Trump administration as guarantor. This provides ample reason for doubt. Moreover, the current Israeli cabinet includes figures who have openly spoken of erasing the Palestinian people, and the state itself has a record of breaking commitments. The previous ceasefire, which Israel broke in March after only limited effort to recover the remaining captives, revealed that its real objectives go beyond the hostages and aim at territorial expansion and demographic displacement. It is this pattern of exploiting truces for strategic gain that makes the fear of this deal being merely a pause to arrange a swap not an irrational fear but a logical conclusion. \nThis suspicion is reinforced by the official Israeli narrative which has already begun framing the deal as a simple hostage-release arrangement with no bearing on the war's future. The assurances of regional actors such as Turkey, Qatar and Egypt, who pushed for this orchestrated deal, have historically been insufficient to prevent Israeli violations. Their responses have consistently been limited to condemnation but no real action. As a result, the burden rests heavily on President Trump whose personal guarantee was reportedly a key factor in persuading Hamas to agree. For him to maintain any semblance of credibility as the peacemaker he claims to be, he must stick to his bargain and firmly restrain Israel from abandoning its promises. Global public opinion, once mildly sympathetic to Israel, has now turned sharply against it in light of the scenes of genocide and starvation emanating from Gaza. Letting Israel off the leash once more to frame the mass killing of civilians as self-defence will no longer be accepted by the world and will only accelerate Israel's global isolation instead of advancing its cause. \nAbove all, for this ceasefire to forge a genuine path to peace in the Middle East, it must be grounded in justice and accountability. The world cannot simply move on from the monstrous crimes of deliberate starvation and genocide of civilians in Gaza. International institutions, regional powers and the very governments that armed and defended Israel must ensure that those responsible for war crimes are held to account. Without this reckoning, the moment global attention fades, the cycle is guaranteed to repeat again.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Will this Gaza ceasefire hold?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/will-this-gaza-ceasefire-hold-1760197072",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       October 12, 2025 00:00:00  \nOver the last couple of years, several members of the World Trade Organisation (WTO) have been negotiating issues still not covered by the multilateral trade negotiations under the WTO framework, thereby bypassing the multilateral approach. The result of the move is a rise in talks on plurilateral deals, and at present, there are at least 16 plurilateral agreements under negotiation among various members. \nIn contrast to multilateralism, which involves many participants, plurilateralism involves small groups with more than two but not many participants. In other words, it is a subgroup within a larger group that has a relatively small number of members. In the WTO, when some members decide to negotiate an issue among themselves, which is not of interest to everyone, it is primarily known as plurilateral trade talks. \nUnder the non-discrimination principle of the WTO, any concession or commitment has to be accorded to all members. WTO members may not grant a subset of countries with which they have negotiated concessions better treatment than countries that have not been offered such concessions. The only exception is if members negotiate free trade agreements, be it bilateral or regional, with each other or negotiate a plurilateral agreement. Under such an agreement, a subset of WTO members can agree to specific disciplines that apply only to signatories and need not apply the associated benefits to non-signatories. A plurilateral agreement, however, can only be added to the WTO based on consensus. Thus, the plurilateral option offers a mechanism for groups of WTO members to agree to rules in a policy area that is not covered by the WTO or goes beyond current disciplines, as long as 'the membership as a whole perceives this not detrimental to their interests.'\n\nTo summarize, plurilateral agreements serve as a vehicle for like-minded countries to cooperate in areas not yet addressed by the WTO. They allow countries not willing to consider new disciplines in a trade policy area to opt out. (P-760, The Oxford Handbook on the World Trade Organization, 2014.) This flexibility and the opportunities for like-minded countries to work together in shaping global trade policies through plurilateral agreements can be seen as a positive development in the evolution of the WTO. \nPlurilateral agreements are not a new concept in the WTO or its predecessor, the General Agreement on Tariffs and Trade (GATT). The Tokyo Round talks of GATT in 1973-1975 marked a significant milestone in the negotiation of plurilateral deals. During this period, six codes on non-tariff measures (NTMs) were negotiated, including standards code, government procurement code, subsidies code, customs valuation code, anti-dumping code, and import licensing code. These codes were actually plurilateral deals because only some GATT signatories agreed to apply the new rules. Moreover, three sectoral agreements on bovine meat, dairy products and civil aircraft were also adopted in the Tokyo Round, and these were finally converted into plurilateral deals in the WTO framework in 1994. Again, five of the six codes also become full-fledged multilateral agreements in the WTO, marking a significant shift in the global trade landscape. \nTechnically, various multilateral agreements on the WTO are parts of the broader agreement officially titled as the 'Marrakesh Agreement Establishing the World Trade Organisation.' All other agreements, such as the Agreement on Agriculture (AoA), are incorporated into the Marrakesh Agreement as annexes. There are four annexures in the legal text of the agreement. The first annexure is divided into three sub-annexures: the Multilateral Agreements on Trade in Goods, the General Agreement on Trade in Services, and the Agreement on Trade-Related Aspects of Intellectual Property Rights (TRIPS). The second annexure concerns the dispute settlement mechanism, the third annexure reviews trade policy, and the fourth one addresses plurilateral agreements. Three services protocols are attached to the GATS. Whether these 'protocol' deals in services are plurilaterals or not is debatable. The Geneva Trade Platform does not consider these as plurilateral agreements, whereas Trade Beta Blog includes these protocols in the list of plurilateral deals. \nThere are four types of plurilateral agreements, categorised into two groups based on their structure. One is agreements by equal treatment or discrimination, another is creating obligations or new rules. Any agreement that does not discriminate between participants and non-participants is Most Favoured Nation (MFN) in nature. This means that all participants are treated equally, without any preferential treatment. On the other hand, in any plurilateral agreement, if participants treat each other with preferences that don't apply to non-participants, it is discriminatory. The former one is also known as open plurilateral, and the latter one is closed plurilateral. This distinction is important as it determines the nature of the agreement and the extent of its impact on non-participants. Any multilateral agreement under the WTO framework, however, is always MFN in nature, with limited room for MFN exemptions. \nMoreover, a plurilateral deal may involve only commitments from the participants without adding any new rules, or it may be an agreement for new rules with or without commitments. Commitments are generally listed in a schedule which includes timetables for phasing in the new commitments. \nFinally, a plurilateral agreement may include negotiations with new rights and obligations, or it may only be discussions to clarify concepts and policy issues. \nNow, if the parties who negotiated a plurilateral deal want to insert the agreement into the WTO rulebook, it requires full approval from all members. This process underscores the complexity and significance of consensus in the adoption of plurilateral agreements. Any new set of rules means amending the relevant WTO agreement, or incorporating any new agreement means inserting it into the relevant annexure. For instance, the Agreement on Trade Facilitation (TFA) was inserted into Annexe 1A on February 22, 2017. The insertion is also known as an amendment to the WTO agreement. Again, any amendment requires consensus among the whole WTO membership, which is not easy, highlighting the intricate nature of the WTO's decision-making process. \nAt present, almost all the members of the WTO are parties to at least one plurilateral agreement. Only 12 members of the WTO are not a party to any plurilateral talks. Among them, five are from South Asia, namely Bangladesh, India, Nepal, Pakistan, and Sri Lanka. India has long had a strong reservation about the plurilateral deal and continues to resist any move to incorporate it into the WTO rulebook. The latest example is its opposition to the new plurilateral agreement on Investment Facilitation for Development (IFD) in the package of WTO rules. India, along with South Africa, blocked the inclusion of the IFD agreement in Annexe 4 of the WTO Agreement, which deals with plurilateral agreements, at MC13. Although 117 developed and developing nations backed the IDF, India argued that it is 'illegal', 'non-mandated', 'non-multilateral' and a 'violation of the WTO framework'. Why Bangladesh has yet to join any plurilateral talks is a relevant question now. This column will try to find the answers next week.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The saga of plurilateral trade deals",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-saga-of-plurilateral-trade-deals-1760197162",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       October 12, 2025 00:00:00  \nAfter showing a downward trend for a month or two, inflation rose again in September, renewing concerns among consumers who have been severely affected by high prices over the past three years. Taming this persistent inflation has been one of the top priorities of the interim government. In pursuit of this goal, several measures have been implemented, including a tight monetary policy, a broad reduction in import duties and facilitation of the smooth settlement of letters of credit (LCs) for essential goods.\nAs a result, inflation has eased slightly, hovering around 8.5 per cent over the past couple of months, compared to the double-digit levels recorded a year earlier. Although the decline is modest and falls short of offering meaningful relief to consumers, even the slight improvement is under threat, which naturally raises concern. Bangladesh Bureau of Statistics (BBS) data show that point-to-point inflation actually increased in September compared to August.\nIn comparison, neighbouring countries have achieved more substantial reductions. Sri Lanka, for instance, brought down inflation to 1.5 per cent in September 2025 from around 16.5 per cent in 2023, while Pakistan saw a decline to 5.6 per cent in September 2025 from 31.4 per cent a year earlier.\nThis contrast raises a critical question: why has inflation in Bangladesh remained so persistent despite two years of tight monetary policy? Does this point to inconsistencies in other policy measures? \nOne example is Bangladesh Bank (BB)'s recent intervention in the banking sector. While striving to limit money supply through monetary tightening, BB provided Tk 520 billion to 12 weak banks by printing new money. The move surprised many, as the current BB governor had been a vocal critic of money printing by the previous government and had affirmed that he would not resort to such measures to bail out cash-strapped banks. However, the intervention was deemed necessary to ensure that depositors could recover their funds in the aftermath of systematic looting by the previous government and to protect the economy from the disrepute that would arise from bank failures.\nThat said, one may recall that inflation in Bangladesh had skyrocketed following the Russia-Ukraine war, which drove up global prices for fuel, food, and raw materials, coupled with a sharp depreciation of the taka against the dollar, all of which has increased the cost of import. In this sense, much of the country's inflation is imported. While global markets have since stabilised, the taka's exchange rate remains elevated, rising from around Tk 85 per dollar three years ago to over Tk 122 per dollar today. This depreciation has increased import costs, placing upward pressure on domestic prices.\nHowever, unlike a year ago, there is currently no dollar crisis. On the contrary, BB has been on a dollar-buying spree, purchasing more than $2 billion from commercial banks over the past three months through 14 auctions, supported by stronger remittance and export inflows. This raises the question: Why is BB keeping the US dollar artificially steady? The likely objective is to support exporters and remitters. But what about consumers? Bangladesh is heavily reliant on imports for essential goods such as fuel, food, and industrial goods. Moreover, by keeping the dollar artificially high, the central bank risks undermining its own efforts to curb inflation.\nWhen BB buys dollars from local banks, it injects additional taka liquidity into the financial system. This runs counter to the principles of a tight monetary policy, which seeks to reduce money supply and limit credit expansion to contain price pressures. Moreover, even a slight appreciation of the taka would help lower import costs. The central bank, therefore, may need to recalibrate its strategy to prioritise price stability alongside supporting exporters and remitters.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Inflation that defies reason",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/inflation-that-defies-reason-1760197209",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 12, 2025 00:00:00  \n\nHilsa, the national fish of Bangladesh, is not only a staple in Bengali cuisine but also a vital contributor to our food security, economy, and the livelihoods of countless fishermen. While other fish such as Rui, Katla, Mrigel, and Boal are found in our rivers and canals, Hilsa remains unmatched in demand. From social events to festive occasions like Bengali New Year, Hilsa occupies a special place on the Bengali dining table.\nIn 2017, Bangladesh's Hilsa was recognised as a Geographical Indication (GI) product, further cementing its role as a cultural symbol. The Padma, Meghna, and Godavari rivers, along with the Bay of Bengal, host the largest populations of this prized fish, with Chandpur often referred to as the \"Home of Hilsa.\" Globally, while Hilsa is produced in 11 countries, Bangladesh contributes around 86 per cent of total production. Fishermen here rely heavily on Hilsa for their livelihoods, and exports bring significant revenue in the country.\nHowever, the reproduction rate of Hilsa has declined alarmingly over the last two decades. Many fishermen, driven by profit, flout bans and capture mother Hilsa. Factors such as reduced river flow, pesticide contamination, and plastic pollution further hinder the fish's migration and breeding, leading to declining catches. Some fishermen have even abandoned their profession due to reduced availability.\nProtecting Hilsa cannot rely on bans alone. Field-level surveillance must be strengthened, and the government should equip the naval police and coast guard with modern tools, including fast vehicles, to enforce regulations effectively. Authorities must also conduct regular campaigns to prevent the catching, transportation, storage, and sale of illegally captured Hilsa. Only with coordinated and sincere efforts can we ensure the sustainable breeding of this national treasure.\nRiyad Hossain\nStudent, Govt. BL College, Khulna\nhossainriyad7444@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Safe breeding of Hilsa must be ensured",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/safe-breeding-of-hilsa-must-be-ensured-1760197227",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-10-2025"
    }
]