[
    {
        "full_article": "For the first time since 1931, Census forms will record the caste of Indians, but questions remain on the extent of the impact that the data would have on India’s affirmative action programmes. Decadal censuses, until now, have categorised citizens as SCs, STs and as per religion. In decades of reservation for SCs, STs, and OBCs, there have been concerns about which communities or individuals within these groups are able to access the benefits. The demands for a creamy layer to eliminate the economically better-off sections from reservation quotas, and for sub-categorisation to ensure smaller or relatively more backward communities are not crowded out, have gained moral and political legitimacy. The Supreme Court of India, last August, cleared the way for sub-categorisation within SCs and STs and the Justice G. Rohini Commission in 2023 finished a study to examine sub-categorisation within OBCs. The Court’s judgment was quick to draw a sharp fault line within SC and ST communities on the issue of sub-categorisation and the potential for upset in the Commission’s report has forced the government to keep its findings closely guarded. Caste groupings continue to be a determinant of political and social life and empirical data on these are essential for more effective development planning. However, the search for increased representativeness through slicing and relabelling of social groups could be an infinite process, leaving some group or the other always dissatisfied.The other challenge is the logistics of how caste enumeration should be conducted in a country where community-based claims are numerous. The understanding of what caste is, the difference between a sub-caste and a caste group, and the reconciliation of the understanding of caste names with their morphing according to linguistic and regional variations are issues. This gap in understanding caste was reflected in the SECC 2011 dataset as well, which yielded more than 46 lakh different “castes”. Apart from the fact that there is no repository of all castes except for the lists of SCs, STs, and OBCs, the question of how to classify communities as castes, tribes, or socially and educationally backward classes continues to be litigated in High Courts and the Court in the form of countless petitions for inclusion or exclusion. The decision to enumerate caste can also be an opportunity to arrive at a consensus on these questions. The political diatribe that accompanied caste enumeration exercises in Bihar, Karnataka, and Telangana shows that this could be volatile. The Centre should build consensus on the details, now that all parties are in agreement with caste enumeration in principle. That will keep the integrity of its finding intact and beyond reproach.  Published - May 06, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        population and census\n                    \n                            /                      \n                        \n                        personal data collection\n                    \n                            /                      \n                        \n                        Reservation\n                    \n                            /                      \n                        \n                        Caste\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        Karnataka\n                    \n                            /                      \n                        \n                        Telangana\n                    \n                            /                      \n                        \n                        religion and belief",
        "headline_1": "​Cast of characters: On the caste census",
        "headline_2": "Caste census presents both challenges and opportunities",
        "link": "https://www.thehindu.com/opinion/editorial/cast-of-characters-on-the-caste-census/article69541584.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "06-05-2025"
    },
    {
        "full_article": "The commissioning of the Vizhinjam International Transhipment Deepwater Multipurpose Seaport, developed by Adani Ports and Special Economic Zone Ltd (APSEZ) under a public-private partnership model with the Kerala government, marks a milestone in India’s maritime history. For a country such as India, which relies heavily on foreign ports for handling around 75% of its inbound and outbound transshipment cargo, resulting in an annual revenue loss of approximately $200 million-$220 m, the port presents enormous economic opportunities. Its natural draft of about 20 metres, requiring minimal capital dredging, and its proximity to international shipping routes linking Europe, West Asia and the Far East — the east-west shipping axis — position it as a strong contender to become a transshipment hub. This could potentially bring home a significant portion of Indian cargo transshipment handled by the Singapore, Colombo, Salalah and Dubai ports. Ultra-large container vessels can berth without deviating from their route, thereby saving costs. As India’s first semi-automated port equipped with remote-controlled quay cranes and an AI-powered vessel traffic management system, Vizhinjam will significantly reduce vessel turnaround times. India’s container throughput capacity last year was approximately 20 million TEUs (twenty-foot equivalent units), contrasting with China’s 330 million TEUs. This highlights the need for modern ports such as Vizhinjam along India’s coastline.Following the project’s agreement in 2015, the Kerala government faced challenges, including protests from fisherfolk supported by the Latin Church, natural calamities and the COVID-19 pandemic. Commercial operations commenced in July 2024, with 265 ships, including large mother ships, having berthed so far. In the first phase, the Kerala government invested ₹5,595 crore, Adani Ports spent ₹2,454 crore, and the Union government provided a viability gap fund loan of ₹818 crore — a funding structure that sparked political debate. For Vizhinjam, an all-weather port, to become a game-changer in South Asia’s maritime trade, the Centre and the State must ensure the timely completion of rail and road connectivity, which is crucial for leveraging the port’s full potential. This will facilitate efficient cargo delivery to the entire hinterland of South India. The subsequent development phases, for which APSEZ and the Kerala government have signed an agreement involving an investment of around ₹9,500 crore by 2028, must also be implemented promptly. Warehousing, logistics, and industrial facilities are essential for the port to evolve into a thriving commercial maritime hub.\r Published - May 06, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Kerala\n                    \n                            /                      \n                        \n                        shipping service\n                    \n                            /                      \n                        \n                        Singapore\n                    \n                            /                      \n                        \n                        Sri Lanka\n                    \n                            /                      \n                        \n                        United Arab Emirates\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        religion and belief\n                    \n                            /                      \n                        \n                        natural disasters\n                    \n                            /                      \n                        \n                        loans",
        "headline_1": "​Maritime hub: On the Vizhinjam port",
        "headline_2": "The Vizhinjam port offers enormous economic benefits for India",
        "link": "https://www.thehindu.com/opinion/editorial/maritime-hub-on-the-vizhinjam-port/article69537588.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "06-05-2025"
    },
    {
        "full_article": "Why Trump’s tariff on non-US films will put Hollywood in a creative Alcatraz\nAmerica closed its securest prison, Alcatraz, in 1963, less than a year after three men escaped from it. The decision was based on cost, not hurt pride. Alcatraz then became a tourist hangout and the setting of some popular films, including 1979’s Escape From Alcatraz. Back then, Hollywood could spot a good story, tell it well, and rake in millions. That’s how it became world’s biggest and most powerful film industry.\nOnly twice in the past 50 years has a non-American film topped the global box-office. First in 2020, a freak year, and now, when Chinese animation film Ne Zha 2 has earned over $2bn since its release on Jan 29. For Trump, who announced in Jan he would make Hollywood “bigger, better and stronger”, this is too much. Early on Monday, he declared Alcatraz would be turned into a prison again, and 23 minutes later, slapped a 100% tariff on “any and all movies coming into our country that are produced in foreign lands”.\nThe order isn’t surprising because tariffing is Trump’s answer to all of America’s economic woes. But it’s odd because films aren’t goods. They are like software and services that earn billions of tariff-free dollars for India. Will he tariff services next? India’s GCCs might be worried. The film industry certainly is. Hindi and Telugu films have raked in millions of dollars over the past several years, but with Trump’s typically vague diktat, the cost to US distributors could double. There’s no clarity on what “produced in foreign lands” means. If part of a Hollywood film is shot abroad, is it American or foreign? Does the order also apply to films and series made for OTTs?\nNobody’s denying Hollywood’s decline. Only 20% of American films and TV shows are made there now, and big-name films regularly bomb. Atlanta, New York and Texas are rivals at home, while Mexico – Netflix will invest $1bn there annually to make films and shows – Europe, Australia, Canada, etc, are all wooing American studios with lower costs. By raising a tariff wall, Trump can counter their cost advantage, but US will lose big if other countries tariff its films. Right now, Hollywood earns about two-thirds of its revenues abroad. Avatar, the highest grossing film ever, made 73% from foreign screens, its sequel 70%, and so did Titanic.\nTrump forgets that these three films – among Hollywood’s top four earners – were directed and produced by James Cameron, a Canadian. Kate Winslet, star of Titanic, is British. Hollywood’s biggest strength is that it’s a melting pot of global talent – Priyanka Chopra, Freida Pinto and the late Irrfan included. The last thing it needs is a tariff fortress – its own Alcatraz.\n\n",
        "headline_1": "Bad movie",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/bad-movie/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-05-2025"
    },
    {
        "full_article": "On the blending of birthday & military bling\nWhy can’t boys just keep being boys? Once nine-year-olds used to play with toy tanks, today they drive these around in video games. So heck, when a boy becomes a president and finds his 79th birthday around the corner, of course he’ll treat himself to a real-life parade of tanks. This is Trump, of course. Among the many blessings Lady Luck has sent his way, his birthday, June 14, falls on Flag Day, which this year marks US army’s 250th birthday. He doesn’t want what he sees as the greatest missiles in the world, the greatest submarines, the greatest army tanks, the greatest weapons celebrating all by their lonesome self. He’s gonna glam the whole thing up.\nIn North Korea founder Kim Il-sung’s birthday is referred to as the Day of the Sun and all its bling puts Christmas to shame. Trads are flinching at seeing this authoritarian playbook unleashed in America. But they can take a hike. Trump is a no-holds-barred fan of bling. He’s given the Oval Office a gold-plated makeover and next he’ll de-grass the Rose Garden because he’s seen it getting women’s shoes full of mud. This president breaks the mould. He dismisses pleas for democratic separation of powers and against wasting taxpayer money on personal vanity, as moldy. He’s thrown these into his dustbin. It’s, yes, gilt-covered.\nMany children throw cake at birthday parties but then grow up into sober earnestness. Trump’s inner child is impenitent and brazen. Again, trads see its paroxysms as overcompensation. They keep thinking back to him flaring up once, “Look at those hands, are they small hands?” And now he’s set up MAGA to yodel ‘Happy Birthday to you’ to him in Mohd Rafi style. But with side helpings of fireworks and 6,600 soldiers. The trads had better accept this is just the start. Pay attention to the Trump surrogates and it’s clear there’s much more cooking alongside the birthday parade. Next up, Trump could be up on Mount Rushmore or down on a new $250 bill. What’s the Trumpers’ fave song? Hit me baby, one more time. \n\n",
        "headline_1": "Tank you, Trump",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/tank-you-trump/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-05-2025"
    },
    {
        "full_article": "A message from Ukraine war for India’s strategic & defence purchase plans\nIn a world’s first, Ukraine has said that it has taken down a Russian fighter jet, an Su-30, with a naval drone, once again highlighting the changing dynamics of warfare. This comes after Ukraine had downed two Mi-8 helicopters last Dec in what was then considered the world’s first drone strike on airborne targets from the sea. India would do well to take note of these developments. For, New Delhi operates a fleet of 259 Su-30MKIs – the Indian variant of Su-30. It now has to evaluate whether these fighters are susceptible to drones and what countermeasures can be incorporated to plug any vulnerabilities.\nBeyond that, some fundamental changes need to be recognised to optimise the modernisation of the Indian armed forces. After Ukraine, it’s widely accepted that drones need to be incorporated into defence strategy and reorganisation of the forces. But there are also bigger questions: How much of our future procurement should be focused on acquiring big, conventional platforms worth millions of dollars when we could be facing an enemy with drones worth a fraction of that price? Wouldn’t it be better to invest that money in anti-drone systems or stealth technology? Consider this – the Ukrainian Magura marine drone that took down the Su-30 jet costs just over $265,000 compared to the $50mn price tag for the Russian fighter.\nChina, which is upgrading its armed forces at breakneck speed, recently unveiled what defence experts describe as the world’s first purpose-built drone carrier. Such a platform can launch waves of drones in theatres far away from home base, greatly enhancing the force projection of the operating country. This also radically changes strategic defence calculations. Taiwan, which is constantly at the receiving end of Chinese military intimidation, can mitigate the huge gap in naval power with Chinese PLA if it can also successfully develop and deploy a stealth drone carrier that can potentially inflict significant damage on PLA bases on the Chinese mainland. India too needs to be alert to the emerging threats and opportunities drones present. Investing in and developing drone systems, as well as developing a doctrine on drone warfare, are tasks that can no longer be delayed.\n\n",
        "headline_1": "Drone up",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/drone-up-3/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-05-2025"
    },
    {
        "full_article": "On the exotica of English local elections \nSo you think English local elections are dull compared to Indian ones? Think again. The MP for Runcorn and Helsby, England, did not deliver LED televisions, cookers or gas cylinders to his constituents. However, he did deliver a few punches to someone who was vehemently remonstrating with him about the closure of a local bridge. This little fracas led to his conviction, a suspended prison sentence of ten weeks, and the end of his political career.\nIn the film Sholay, Amitabh Bachchan’s character, while advocating a matrimonial alliance between Veeru and Basanti, argued that Veeru only gambled after a few drinks. Likewise, the MP – a perfectly affable gentleman in normal times – only lost his cool after he’d had one too many. He wasn’t the first to throw a punch though. The late John Prescott, deputy PM in the Blair govt, once floored a protester with a neat left hook, after being pelted with an egg. He later remarked that he’d much rather be punched than egged.\nMuch water has flowed under the bridge – even under the one that led to the downfall of our Runcorn and Helsby lawmaker. And yet, in the wider battle to control 23 councils, more than ten councils have been left with no overall control. Might voter apathy be to blame for this uncertain state of affairs? \nVoter turnout across England averaged 30-40%. In certain parts of the country, only 20% of registered voters turned up to vote. That equates to just 1,000 people – hardly enough to distinguish between an election result and a strong opinion. Those who voted could fit inside a Vande Bharat train and still leave hundreds of seats vacant.\nWith the British public growing bored with both Labour and Conservatives, the Official Monster Raving Loony Party, founded in 1982, has hoped for traction and published 26 policy statements – one for each letter of the alphabet. Example: “Half the grey squirrels will be painted red to increase the red squirrel population.” \nGrey squirrels are the foreign species, red the declining, indigenous ones. The party that’s fared rather well in these elections – Reform UK – shares this preference for the natives. Scientists reject conservation by painting red on grey, but so what? Hull and East Yorkshire has elected a boxer – an Olympic gold medallist, no less – as its mayor. So whatever a scientist thinks, he’ll think twice before egging this mayor.\n\n",
        "headline_1": "Eggs & squirrels",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/eggs-squirrels/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-05-2025"
    },
    {
        "full_article": "This column was first published by Netra News on May 2, 2025.\nMamun Mia was in his garments shop, quietly working away with his shutters half-open, until a stray bullet pierced his chest. Liza Akhter, a 19-year-old domestic worker, perhaps thought her position on the balcony of a 14th floor flat would allow her to safely watch the chaos unfolding on the ground below—until indiscriminate firing ended her life. Siam was shot through the head on his way back home from what turned out to be his last ever shift at the bhaater hotel where he worked. He was only 17 years old.\nThey were only a few of the victims of the brutal and coordinated, state-sponsored violence that the Office of the United Nations High Commissioner for Human Rights (UN OHCHR) estimates killed up to 1,400 people during the July-August mass uprising. In almost nine months since these innocent people were killed, there has been no progress in bringing their killers to justice. No investigation reports have been submitted by the police, and no charges have been framed against their suspected killers. While cases have been filed, the poorly lodged FIRs contain a list of 50-200 accused, with no specific allegations against anyone. There are clear signs that they have been hastily compiled and contain conflicting information: in one of them, newspaper clippings submitted as \"evidence\" imply the killing didn't even happen in the specified city, let alone the thana, while another contains a death certificate from an entirely different part of the country.\nI know all this because my 78-year-old father, cultural activist and former Awami League MP Asaduzzaman Noor, is one of the names in the long lists of accused in these cases. On September 15, 2024, he was picked up from his home at around midnight, and for over seven months now, he has been imprisoned without charge, with no legal explanation on how he can be held responsible for these crimes—committed during the uprising, when he held neither executive nor leadership positions in the government. A common refrain insinuated by the corridors of power has been to bear this quietly, lest things become worse.\nOver this period, I have watched my father become weaker and more frail by the day, be hospitalised with debilitating pain, and still be obstructed from getting bail. I have stood in court as opposition lawyers openly called for \"Baker Bhai\"—one of the iconic characters he played—to be hanged for Awami League's crimes, the presumption of innocence until proven otherwise completely absent from the proceedings. I have been berated for daring to suggest that anyone affiliated with the Awami League could ever be entitled to such a thing as due process.\nI am not so blinded by the injustice of my father's incarceration that I cannot fathom the anger towards the former regime, especially from the students who saw so many of their compatriots killed, and from opposition groups who saw their leaders imprisoned for years on end using the same biased judiciary and repressive practices. Nor am I asking for sympathy, which the atrocities committed by the Awami League have made difficult for anyone to feel towards the party's members. What I do struggle to understand, however, is how a government full of human rights practitioners and champions—led by a victim of judicial harassment and vocal proponent of due process at home and abroad—who are so bent on reforms can continue to be indifferent to such a flawed and ineffective criminal justice system. Should my father be imprisoned indefinitely?\nIs this also not a failure of justice for the victims of the uprising? Does having the victims' cases stuck in the deliberate purgatory of the judicial system, bouncing back and forth between courts, months going by without any movement, contribute in any way towards holding their real killers accountable? How do their families feel about their loved ones being used as pawns in what is being revealed as a blatant game of political retribution?\nThese vague, mass arrest cases have, by this point, seen potentially hundreds of people imprisoned without charge by the current government. While the majority of the senior members of the former regime have managed to escape—the details of how that happened and who conspired to allow it have yet to come to light—it seems that anyone even remotely affiliated with or accused of being affiliated with the Awami League is fair game.\nIn January 2025, Human Rights Watch published a detailed report on the atrocities committed by security forces during the mass uprising, as well as wider human rights abuses committed during the Awami League's rule. There is no way to deny that this truly happened. But what went relatively unnoticed in our media, much less by our interim government, was the concerns it raised about persisting abuses under the interim government, including arbitrary arrests and failure of due process when dealing with the thousands of murder cases that have been lodged since August 5, 2024. Local media have occasionally reported on a number of irregularities in the filing of such cases, including plaintiffs signing reports without knowing who was being accused, identical cases where only the victims' details were changed, and false cases being used for extortion and furthering personal vendettas.\nThis weaponisation of murder cases means that my family lives in constant fear of retribution. Are we allowed to speak up about the failure of justice we see happening in front of our eyes or will we face more cases and repercussions from the government? From the very beginning, there has been a concerted online campaign spreading disinformation about my father and the company he was part of, aimed at fuelling a social media witch-hunt. Recently, this culminated in the inclusion of the company's directors in a single murder case where 408 individuals were accused. Iresh Zaker, who supported and participated in the student-led movement, was named alongside Sheikh Hasina, whose government conducted the slaughter last summer.\n\nI am not so blinded by the injustice of my father's incarceration that I cannot fathom the anger towards the former regime, especially from the students who saw so many of their compatriots killed, and from opposition groups who saw their leaders imprisoned for years on end using the same biased judiciary and repressive practices. Nor am I asking for sympathy, which the atrocities committed by the Awami League have made difficult for anyone to feel towards the party's members. What I do struggle to understand, however, is how a government full of human rights practitioners and champions who are so bent on reforms can continue to be indifferent to such a flawed and ineffective criminal justice system. \nWhile the law adviser's acknowledgement that murder cases are being used as tools of harassment, and claim that the legal system will be prepared to combat this, is reassuring, I cannot help but wonder if this extends to every citizen of this country, or just the perfect victims. When my father was first picked up by the police, the chief adviser's press secretary gave a breakdown of his supposed guilt that was thin on evidence and heavy on populist rhetoric, before my father was even arrested on a crime, let alone given the opportunity of a fair hearing. When such a senior member of the government shows no concerns about judicial bias and conflict of interest—using a platform that he admits is partly official and which he frequently uses to speak for and of the chief adviser, promulgating government talking points—I cannot help but wonder whether we can really expect due process and accountability from this government.\nWhen my father was first arrested, his daughter-in-law, the University of Dhaka teacher Kajalie Islam—who consistently stood by her students during the uprising as part of the University Teachers' Network, even going to the infamous chief of Dhaka Metropolitan Police's Detective Branch, Harun-or-Rashid, to find out the whereabouts of the student coordinators who had been abducted by the police—spoke out about how my father defended her right to participate in protests to people far more powerful than him. She clarified that while that did not absolve him from criticism for his politics, his involvement in politics does not exclude him from accessing justice in a fair court of law either.\nIn the same vein, I will not try to convince anyone that my father went into politics with the genuine belief that it was better to create incremental change and serve your constituents from within a broken system than to expound criticisms that fall on deaf ears from the outside. I am not here to explain that, when a country takes a vicious turn towards the unbridled authoritarianism we were subjected to, there is very little that MPs from peripheral districts can do to reverse that trend, and even less they can do to extricate themselves from the situation without creating significant dangers for themselves and their families. These may very well be considered unacceptable excuses that are disingenuous, naive or lacking in moral courage.\nBut what I will not stop asking for, over and over again, regardless of whatever repercussions may follow, is justice. Real justice for each and every victim of the state-led killings during the Awami League regime, for Mamun, Liza, Siam and all others massacred during the uprising, and justice, equally real and meaningful, for my father, who has the right to be presumed innocent until proven otherwise. He has a right to bail, to a fair and transparent investigation, and for his dignity and fundamental rights to be protected.\nAsaduzzaman Noor has now spent more than 220 days as a political prisoner. I am well aware that this has happened countless times to political opponents during the Awami League regime. I am equally aware and repulsed by the many political opponents who were victims of enforced disappearance, torture, and extrajudicial killing. I am grateful for the silver lining of this dark cloud—that at least I know where he is, that I haven't had to endure the agony of the families of the disappeared. But I am reminded of a big difference in the case of my father. When things like this happened on the Awami League's watch, we were living in an autocracy. This time around, we are not. Are we?\nShuprova Tasneem is a writer and journalist.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "As I seek justice for my father, I want a government that practises the reforms it preaches",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/i-seek-justice-my-father-i-want-government-practises-the-reforms-it-preaches-3887581",
        "news_paper_name": "The Daily Star",
        "publish_date": "06-05-2025"
    },
    {
        "full_article": "We are shocked by the abusive and abhorrent language used at the Hefazat-e-Islam rally by some groups as they outright rejected the recommendations made by the Women's Affairs Reform Commission, calling for its immediate abolition. At a time when the people of the country aspire to build a discrimination-free society, such rhetoric—insulting women—is not only condemnable but also contrary to the values and respect for women in Islam. The demand for the abolition of the commission is also unreasonable and disturbing. Some groups might have reservations about certain aspects of the reform proposals that, as they claim, contradict Islamic values and laws. But to reject all the recommendations without any dialogue—and using such unsavoury language—is reprehensible.\nIs it possible for a nation to progress by depriving half of its population of their rights? Women's participation in the workplace has made huge contributions to the economy. Our garment industry—which is keeping our economy afloat—is almost entirely dependent on the female workforce. Women have played an instrumental role in major political movements, the most recent being the July-August student-led mass uprising. Their contribution in defeating fascism must be acknowledged and fully honoured.\n\nApart from the recommendations that generated outrage among some circles, the commission also made many other vital proposals. It has called on the government to adopt and implement the International Labour Organization's Conventions C189 and C190, which aim to safeguard the rights of domestic workers and ensure protection against workplace violence and harassment.\nThe Women's Affairs Reform Commission was established by the interim government as part of its initiative to promote gender equality and eliminate discrimination against women in society. It has, therefore, put forward several crucial recommendations to empower women and ensure their rights, address the various forms of abuse women face, and suggested multiple protection mechanisms. Apart from the recommendations that generated outrage among some circles, the commission also made many other vital proposals. It has called on the government to adopt and implement the International Labour Organization's Conventions C189 and C190, which aim to safeguard the rights of domestic workers and ensure protection against workplace violence and harassment.\nThe commission also highlighted the need to strengthen or amend several laws to better support victims of violence, including the Prevention of Domestic Violence Act, 2010 and the Guardians and Wards Act, 1890. It proposed introducing a new law on sexual harassment, based on the 2009 High Court guidelines. It also recommended ensuring six months' paid maternity leave, two weeks' paid paternity leave, and childcare facilities in all sectors. Can there be any doubt that all these recommendations are crucial if women are to contribute meaningfully to social and national progress?\nWe, therefore, urge the like-minded parties and groups who held the rally on May 3 to examine the proposals realistically and engage in discussions or debates about the recommendations they find problematic. They should also learn from the experiences of other Islamic nations on how they have navigated similar struggles and upheld women's rights. As the commission's recommendations will be presented to political parties through the National Consensus Commission, there will be scope for further debate—which they should utilise to express their views. However, they must remember that the rights to equality, non-discrimination, and protection from violence and abuse cannot be matters of contention, as these rights are guaranteed to every human being.\n",
        "headline_1": "Reforms are crucial to ensure women's rights",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/reforms-are-crucial-ensure-womens-rights-3887561",
        "news_paper_name": "The Daily Star",
        "publish_date": "06-05-2025"
    },
    {
        "full_article": "In countless homes across this region and beyond, patriarchy does not always arrive with fists raised.\nSometimes, it enters quietly, through questions posed at the dinner table or through softly spoken reprimands. It wears the mask of care, and culture. It whispers instead of shouts. But its impact is no less corrosive.\nConsider the seemingly simple question: \"Why are you wearing that?\" It may seem as a reminder to be modest, when it is actually a warning against autonomy; a message that a woman's body is not her own to dress, express, or even freely exist in. Or take the familiar \"How will you get a good husband if you behave like that?\" As though a woman's entire identity is an audition for someone else's approval. As though her value lies not in her mind or spirit, but in how well she fits the mould of a submissive bride.\nEven the pursuit of financial independence is questioned under the guise of protection: \"Why do you need to work when your father or husband provides for you?\" In many households, this is less a question and more a directive. It places women in a state of dependence, framed as \"spiritual design\", when in fact it is social control.\nBut in today's world, a two-income household is no longer a luxury; it's a necessity. The cost of living has ballooned beyond what a single salary can shoulder. Rent, education, healthcare, transport, food, none of it is affordable anymore on one income alone, especially not in urban Bangladesh.\nSee, denying women the right to work doesn't just limit their independence, it weakens the entire household. Financial resilience, emotional stability, long-term planning -- all of these suffer when a family has to rely on one strained income. Women with careers don't threaten families; they strengthen them and to suggest, in this economy, that a woman shouldn't work is not just outdated, it is reckless and suicidal. Even our agricultural sector depends on women, without whose essential contribution our food supply would practically disappear.\nThe concern then often shifts to reputation with lines like: \"What will people say if you stay out so late?\" Say in the instance of women journalists.\nThis, of course, is never asked of sons. The female body, the female presence, is viewed as something that must be contained and covered to protect the family's honour. When women show ambition or assertiveness, they are met with moral reminders masked as reverence: \"Don't you want to be a good daughter or wife?\", effectively erasing the history of women leaders and entrepreneurs who helped sustain their families.\nAny form of resistance is immediately spiritualised: \"Why are you talking back? That's not how a 'good' woman behaves.\"\nDisagreement becomes impiety. Voice becomes vice. The dismissal of career aspirations is just as calculated. \"Shouldn't you be focusing on your family instead of chasing a career?\" This assumes that family and ambition are mutually exclusive for women, while for men, success outside the home is seen as a \"duty\".\nWomen are told their \"real place is in the house\", as if the walls of a kitchen were ordained boundaries. The idea that \"good women are obedient to their husbands\" circulates freely at family gatherings, conveniently ignoring that obedience was never meant to be the cornerstone of love.\nEven education is treated as a threat. \"Too much education makes women rebellious\", elders sometimes say, often with a laugh, but there is no humour in the intent. Knowledge, after all, is the root of liberation, and they do not want liberated women. \nAnd perhaps most commonly, women are told: \"Marriage completes a woman\". As if without a man, she is incomplete as a human being.\nEven among the so-called sympathisers, women are rarely acknowledged as complete human beings. Instead, they are framed through their relationships to men: \"She's someone's mother, sister, or daughter.\"\nThe implication is clear: respect us not because we are people with our own rights and minds, but because we belong to someone else. This framing reduces us to extensions of others, never as individuals in our own right. It is not compassion; no, sorry, it is another form of control disguised as reverence.\nEven after August 5, after citizens of this country, including men and women, fought against discrimination, words to belittle women were not sparingly used. It began with calling us, whoever spoke for women's rights, \"Shahbaagi\"—a term which was already being used to describe protesting women as \"wayward woman,\" and then later twisted into something more sinister, branding us \"sex workers\"—\"shah**gi.\"  \nThe slur was meant to shame, but more so, to silence. We were painted as immoral, disloyal, or even dangerous simply because we dared to ask for rights that were long overdue.\nWe were branded supporters of a \"fascist regime,\" not because we were advocating for any political party, but because we demanded justice for women. And if we are the fascists for asking for dignity and equality, then what does that make them, for opposing such basic rights?\nThese aren't just sentences or mere words. They are structures. They build walls around women while pretending to protect them. They are spoken with such regularity and confidence that they begin to sound like truth. But they are not.\nThey are the language of control -- scripted, very well-rehearsed, and passed down like heirlooms in households that confuse oppression with devotion.\nAs Moroccan scholar Fatema Mernissi once said, \"If women's rights are a problem for some modern Muslim men, it is neither because of the Quran nor the Prophet, nor the Islamic tradition, but simply because those rights conflict with the interests of a male elite.\" (Mernissi, 1991).\nEgyptian-American activist Mona Eltahawy reminds us, \"The battles over women's bodies can be won only by a revolution of the mind.\" (Eltahawy, 2015).\nAnd Nawal El Saadawi, the pioneering Egyptian women rights worker, declared, \"Women are half the society. You cannot have a revolution without women. You cannot have democracy without women. You cannot have equality without women. You can't have anything without women.\" (El Saadawi, 2007).\nI reiterate: you cannot have anything without women.\nNaziba Basher is a journalist at The Daily Star.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The language of oppression against women",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-language-oppression-against-women-3887331",
        "news_paper_name": "The Daily Star",
        "publish_date": "06-05-2025"
    },
    {
        "full_article": "Quite in line with Chief Adviser Muhammad Yunus's warning about rumours being \"weaponised\" to destabilise the country, we have seen how unrelenting, wide-ranging, and destabilising such rumours have been since the July uprising. This was fittingly reflected in the figures of 2024, which saw misinformation rise by 58 percent compared to 2023, and that momentum has continued into 2025. After detecting 268 instances of misinformation in February and 298 in March, Rumour Scanner, a fact-checking organisation, has now reported 296 cases in April. The persistent nature of those behind this campaign is deeply disturbing, as is the way they continue to find a fertile ground in post-uprising Bangladesh.\n\nLike in previous months, April's misinformation was dominated by national and political themes, with 101 and 95 cases, respectively. Religious, international, and communal topics also featured prominently. Notably, 16 instances of communal misinformation were identified, some originating from Indian accounts, continuing a troubling trend of cross-border disinformation campaigns. Meanwhile, social media platforms remain the primary vectors for spreading such falsehoods. For example, Facebook, the favoured social media platform in Bangladesh, alone accounted for 276 cases, followed by YouTube (54), Instagram (48), X (formerly Twitter, 44), and TikTok (24). Alarmingly, even mainstream media outlets were implicated in 15 separate instances of disseminating misinformation.\n\nParticularly concerning has been the targeting of key political and government figures, which aligns with what Prof Yunus has alluded to as the machinations of the \"defeated side\" intent on manipulating narratives and undermining trust in institutions. Yunus himself was the subject of 29 misinformation cases. Other advisers, including Asif Nazrul and Syeda Rizwana Hasan, were also targeted. Political parties and security forces were not spared either.\nRumour Scanner has also shed light on the mediums being used for this purpose: 138 cases were text-based, 105 involved videos, and 53 were image-centric. Among these, 179 were completely false, 66 misleading, and 48 distorted, but all generally constituting misinformation. Particularly concerning has been the targeting of key political and government figures, which aligns with what Prof Yunus has alluded to as the machinations of the \"defeated side\" intent on manipulating narratives and undermining trust in institutions. Yunus himself was the subject of 29 misinformation cases. Other advisers, including Asif Nazrul and Syeda Rizwana Hasan, were also targeted. Political parties and security forces were not spared either. Among the parties, BNP was the most affected, followed by Jamaat-e-Islami and National Citizen Party (NCP).\n\nWe don't need to remind anyone how hurtful this campaign has been, and it will only intensify as we approach the upcoming elections. This calls for heightened awareness and vigilance from the government and political institutions alike. The press, too, has a huge responsibility as it can stand guard against the circulation of doctored or misleading content by properly informing the citizens. But in the end, no initiative will be enough unless the citizens themselves become aware of the threat. This requires strengthening digital literacy across all demographics so that people can be empowered to critically assess the information they encounter online. There should be countrywide educational initiatives focusing on identifying credible sources and understanding the hallmarks of misinformation.\n",
        "headline_1": "Fight misinformation as a matter of urgency",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/fight-misinformation-matter-urgency-3885241",
        "news_paper_name": "The Daily Star",
        "publish_date": "06-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 06, 2025 00:00:00  \nReinstatement of scholarship for primary students, class V to be precise, makes sense following the cancellation of what was called a competence-based and outcome-focused education system introduced in 2023. With the introduction of the Primary Education Completion (PEC) examinations under the Directorate of Primary Education (DPE) in 2009, the question of holding a separate examination for scholarship did not arise. However, during the transition period, the scholarship exam was reportedly held in 2022 for the last time. Now that the curricula introduced by the deposed government in 2023 have been cancelled to revert to the traditional system, Primary and Mass Education Adviser Prof Dr Bidhan Ranjan Roy Podder discloses his government's move to reintroduce the scholarship examinations for class V students, particularly the most talented among them of this level from primary schools. It emphasises both competition and talent hunt. Then those who excel in the examinations receive financial rewards for pursuance of studies. \nScholar with its Latin and ancient Greek roots 'scholaris'(learning) and 'skhole' (time for learning) respectively has become scholarship with the addition of suffix '-ship' meaning quality or position. In fact, it is nothing less than learning excellence. So, any attempt to encourage learning with financial support is always welcome. But at this point, the difference in awarding financial support between the traditional system of examinations and wider talent hunt on the basis of competence and creative proclivity must not go unnoticed. Also, in the intervening period, financial support was wider when a certain percentage of scores helped more students to qualify for the institutional finance. One of the allegations against the traditional system of education is that students who can better learn by rote instead of assimilating the knowledge score higher in examinations. This can hardly be refuted. There is, moreover, no point asking every mind to conform to a rigid system of education. \nHowever, what is happening in the country in the name of reforming the education system or the curricula, particularly at the lower tiers, is next to insanity. The young learners have been treated like guinea pigs as different governments have frivolously made experiments with education at the primary and secondary levels. It is tragic that the country has failed to introduce a universally acceptable education system for the young learners in the past 54 years and prepare them for the challenges of the new millennium. On that count, the reintroduction of the traditional scholarship examination falls far short of the national expectation. \nAfter all, this is no solution to the problem facing education that has long lost its relevance to the demand of the time. Apart from a select few from the general and madrasha streams of education, the rest find their knowledge and skills incompatible with the market demands. There is, however, no dearth of talents here. This is best revealed by the fact that those students pursuing English medium education achieve enviable scores in O-Level and A-Level among all the candidates from the UK and the British Commonwealth. At home, the systemic failure has been responsible for emergence of distortions in the form of commercial coaching centres, guide books and made-easy short-cuts for passing exams including public ones. There have been several reform commissions but none on education. Why? Is the old system better than the one that was introduced in 2023? An education system has to be accepted or rejected on the basis of its merit, not on any other considerations.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Primary scholarship desirable but not enough",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/primary-scholarship-desirable-but-not-enough-1746459021",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       May 06, 2025 00:00:00  \n\nThe concept of a humanitarian or aid corridor is something relatively new to most people in Bangladesh. Yet, it has emerged as a central topic of national discussion following a recent UN-initiated proposal to channel aid to the famine-stricken Rakhine State in Myanmar, using routes that would traverse Bangladeshi territory. While on the surface, the humanitarian urgency of the matter cannot be understated, the nuances, implications, and possible fallout from such a decision merit careful scrutiny and, more importantly, broad-based national consensus.\nThere is no universally accepted definition of a humanitarian corridor. However, the International Committee of the Red Cross (ICRC) provides a broadly accepted framework: such corridors are usually agreements between warring parties to allow for the safe passage of civilians, humanitarian aid, or the evacuation of the wounded and sick during armed conflict. In this context, corridors can offer temporary relief and help prevent large-scale humanitarian disasters. However, their use must be carefully negotiated and monitored to avoid potential misuse or exacerbation of existing tensions.\nAmid the growing debate in Bangladesh, the interim government has issued clarifications, drawing a clear line between a \"humanitarian corridor\" and a \"humanitarian channel.\" While they maintain that Bangladesh has not entered into any agreement regarding a humanitarian corridor, they admit to being in negotiations with the United Nations regarding the possibility of an aid channel to Rakhine State.\nGovernment officials argue that establishing such a channel could be instrumental in promoting conditions conducive to the repatriation of Rohingya refugees currently residing in Bangladesh. The logic is straightforward: if aid is delivered effectively, and if both the Myanmar government and the Arakan Army uphold their reported agreement to cease hostilities during the aid distribution period, it might foster a fragile but necessary peace. This, in turn, could provide the Rohingya population with the security and basic services necessary to consider returning to their homeland voluntarily and safely.\nTo that end, Bangladesh has reportedly laid out several non-negotiable conditions for the aid channel: cessation of hostilities in Rakhine during the aid period, unimpeded access to aid, non-discriminatory distribution, and a guarantee that aid will not be weaponised. These stipulations are not only reasonable but essential. In the volatile context of Rakhine, where ethnic and political conflicts remain entrenched, even well-intentioned aid can be diverted or manipulated for political or military advantage.\nNevertheless, this issue is far from straightforward. Critics of the aid channel proposal raise valid concerns that should not be overlooked. Chief among them is the security threat such a channel might pose to Bangladesh. If appropriate monitoring mechanisms are not in place, aid could be weaponised or diverted to fuel further conflict between the Arakan Army and the Myanmar military. Such a scenario would not only defeat the humanitarian purpose but could also embroil Bangladesh in a conflict beyond its borders, damaging bilateral relations and exposing the country to retaliatory actions.\nThere is also the danger of setting a precedent. Agreeing to such an initiative without robust oversight could be interpreted by internal or external actors as a sign of weakness or naïveté in Bangladesh's foreign policy and national security strategy. Moreover, even with a temporary ceasefire, there is no guarantee that hostilities will not resume once aid has been delivered. Without sustained peace, the long-term objective of Rohingya repatriation will remain as elusive as ever.\nAn additional layer of concern surrounds the issue of national sovereignty and democratic legitimacy. Many political parties and civil society leaders have questioned the legitimacy of such negotiations taking place under the auspices of a non-elected, interim government. They argue that decisions involving foreign aid operations, especially in a region as sensitive as Rakhine, must be taken by an elected parliament that represents the collective will of the people. This is not an issue to be handled in isolation by bureaucrats or unelected officials, no matter how well-intentioned. At the very least, there must be consultations with political parties across the spectrum to reach a national consensus.\nThis scribe does not oppose the idea of extending humanitarian assistance to suffering civilians in Rakhine. On the contrary, we affirm that as a responsible regional actor and a compassionate nation, Bangladesh should do everything within reason to alleviate the humanitarian crisis. However, such actions must be taken in a manner that preserves national security, respects domestic political processes, and ensures accountability and transparency.\nThe government's rationale -- that preventing another influx of Rohingya refugees is a national priority -- is entirely valid. Bangladesh already shoulders a disproportionately large burden of hosting over a million Rohingya refugees. A fresh wave would stretch the country's already limited resources and further complicate an already difficult situation. However, using aid as a strategic tool to prevent refugee inflow is not a guaranteed solution. If mismanaged, it could provoke new tensions with Myanmar or with internal political stakeholders, further destabilising the region.\nThe proposed aid channel must be subjected to rigorous scrutiny and built on solid guarantees from both the United Nations and all stakeholders involved. The international community must play a proactive role not only in delivering aid but also in ensuring that it is used appropriately and that ceasefire commitments are upheld. Aid without peace, after all, can only be a band-aid on a festering wound.\nMost importantly, this initiative must not proceed without a national conversation. The people of Bangladesh have the right to know what is being negotiated in their name, especially when it pertains to national security and international relations. We urge the government to initiate open dialogue with political parties, civil society groups, and experts in foreign policy and humanitarian law. Holding parliamentary debates or at least convening a special consultative committee could ensure greater transparency and foster public trust.\nIn conclusion, while the idea of channeling aid to Rakhine is rooted in humanitarian urgency and regional stability, it carries serious implications that demand consensus, caution, and comprehensive oversight. Bangladesh must balance its compassion with caution, its pragmatism with principle. Only through national unity and international cooperation can such a sensitive mission succeed.\nLet us not forget that humanitarian intentions, however noble, can falter without a framework grounded in transparency, security, and accountability. For the sake of national security, regional peace, and democratic integrity, consensus must come first-before the first truckload of aid crosses the border into Rakhine.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Consensus a must to channel aid to Rakhine",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/consensus-a-must-to-channel-aid-to-rakhine-1746459103",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       May 06, 2025 00:00:00  \n\nThe report that a teacher at the Chirirbandar Government Model Pilot High School examination centre in Dinajpur's Chirirbandar upazila has been fined Tk. 2000 and sentenced to 7 days' prison for helping a student to answer questions through mobile phone app is shocking. When teachers should set examples before their students, such unprincipled behavior on their part is reprehensible. \nThe report further has it that the teacher in question was sending answers to also 50 other examinees through a WhatsApp group (a community built over the digital platform to interact with members using WhatsApps' Communication and management features). Clearly, it was not an isolated case where the teacher was trying to help his favourite student to perform better in the examination. For, in this case a commercial motive is clear since a good number of other examinees were also getting the answers from the WhatsApp group. The report further adds that another examinee was also expelled from the same centre for cheating during the school final examination. There is no question that the students found cribbing in the exam be punished. And the penalty for the crime the teacher in question had to pay is no doubt well deserved. Publicly shaming is another way of punishing such teachers without scruple. But while coming down hard on the errant teacher and the students found cheating in exam, one needs to keep in mind that corruption in its multitudinous forms is endemic in the education sector. \nCorrupt practices like leaking of question papers, issuing false certificate for students, mushrooming coaching centres and school teachers' involvement with the coaching business etc., during the autocratic regime were pervasive. It is not just that question papers of schools were leaked. Even, college or university level exams were not spared. The competitive exams including those held under the Public Service Commission (PSC) were also not immune from question paper leakages. Such unethical practice by teachers and those on the education board was common. So it would be too naive to think that after last year's July uprising, the world has changed for the better, especially in Bangladesh. And so there is no reason to expect that the culture of dishonest dealings and unscrupulousness in our educational institutions created over the decades would vanish overnight. So, by actions like expelling some students found cheating in exams and punishing a teacher for his misdeed are not going to discourage others from engaging in similar immoral activities. In fact, the entire educational system needs overhauling. First, the schools and colleges in the districts and upazilas must be freed from the influence of the so-called management committees comprising powerful people of the localities concerned. The teachers of the privately-run educational institutions are often made to do the bidding of the local powerful people as the teachers' job depends on their recommendations. And as it is usually the case, these people are corrupt to the marrow. The government-run schools are also not free from unethical practices as noted in the foregoing. If truth be told, corruption starts from the government bodies in charge of education. \nOne might recall at this point what late Dr Akbar Ali Khan, an eminent economist and educationist, once said about our education sector. He said, \"Corruption in the education sector is the root of all kinds of corruption, and it fuels corruption in other sectors.\" Some government bodies in charge of monitoring and ensuring fund flow to the schools such as the Shikkha Bhaban (Education Building), the National Curriculum and Textbook Board (NCTB), Secondary and Higher Secondary Education Boards, etc., that look after Monthly Pay Orders (MPOs), retirement benefits for teachers, procurement of educational materials and so on are the main sources of corruption as nothing, reportedly, moves there without speed money. In some cases, both the corrupt quarters in the education boards in collusion with local vested interests draw MPOs for schools that do not exist in reality. What we are talking here is about an Augean Stables that needs to be mucked out. \nThe question is who is to start doing the herculean task.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Education sector needs overhauling",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/education-sector-needs-overhauling-1746459158",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 06, 2025 00:00:00  \n\nThe administration is the driving force of a state upholding the people's trust and justice. It's primary duty is to ensure equal rights and opportunities for all citizens without prejudice. Unfortunately, discrimination and favouritism are still evident at various levels of the administration. While some regions witness swift implementation of development projects, others suffer prolonged neglect. Complaints from ordinary citizens are often overlooked, whereas requests from influential individuals are promptly addressed. When merit is sidelined and political connections or financial influence determines recruitment, promotion, and access to privileges, talented and deserving individuals are left disheartened, severely damaging administrative efficiency. Consequently, public trust in the administration erodes, and social inequalities deepen. Therefore, building a fair, efficient, and merit-based administrative system demands the complete eradication of discriminatory practices.\nThe administration must truly act as a servant of the people, ensuring that every citizen enjoys equal dignity, justice, and opportunities.\nRashedul Islam Akib\nStudent, Department of Islamic Studies,\nUniversity of Chittagong\nakibh1298@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Eliminate discrimination in service delivery",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/eliminate-discrimination-in-service-delivery-1746459183",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-05-2025"
    }
]