[
    {
        "full_article": "In urging the Union government to work on guidelines to regulate speech on social media, the Supreme Court of India is seeking to empower an executive that is already weaponising the legal limits on freedom of expression. In response to a petition by a non-profit assailing derogatory remarks by online figures against disabled persons, the Court issued instructions that further a problematic trend of the judiciary egging on the state to encroach on legal grey areas with statutory restrictions that undermine constitutionally guaranteed rights. To regard distasteful humour, however disturbing it might be, as a problem to be solved through the courts and by executive rulemaking, is to fall into a deceptive trap of imagined righteousness that progressive democracies should avoid. There are always unpleasant consequences in expanding powers to police speech: partisans wield their powers to ferociously monitor what is or is not appropriate, instrumentalising agencies of the state to suppress art and political speech they do not like; citizens find themselves constantly looking over their shoulder before expressing themselves. Under the overbearing atmosphere of censored expression, truths and ideas that must be reckoned with for a functioning democracy are stifled. People should not have to constantly look against asterisks that set terms and conditions for fundamental liberties. Film producers and directors have been pushed away from exploring subject matters that would help India progress socially, and journalists have been dealing with first information reports for carrying out their professional duties.In recent years, the Union government has, formally and informally, expanded its control of online speech, with the problematic Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021, and an amendment to those Rules that would allow social media companies to be proceeded against for content posted by users that has been flagged by the government. Monday’s (August 25, 2025) instructions seem set to expand those ambitions, which are themselves under challenge with the Supreme Court. Hate speech and speech inciting violence against minorities are criminalised in India, giving disadvantaged groups powerful avenues of recourse when they are legitimately wronged. Handing an executive, which already has a record of mala fide weaponisation of media and speech regulations, more powers would be dangerous in the extreme. At a fundamental level, such judicial pronouncements, which cite “misuse of freedom of speech” as a ground, seem to misperceive the framework of their institutional role: that of a protector of rights under a clear constitutional framework, and not of an unchallenged lord in a feudal society.READ MORE Published - August 27, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        government\n                    \n                            /                      \n                        \n                        media\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        executive (government)\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        disabled\n                    \n                            /                      \n                        \n                        humour\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        arts (general)\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        hate crimes\n                    \n                            /                      \n                        \n                        minority group\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "Imagined righteousness: On conduct on social media",
        "headline_2": "Courts must protect rights of citizens, not allow the state untrammelled power",
        "link": "https://www.thehindu.com/opinion/editorial/imagined-righteousness-on-conduct-on-social-media/article69979599.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-08-2025"
    },
    {
        "full_article": "Sport is at its best when there is a clearly established pecking order and intense competition between the hierarchical rungs. The presence of a dominant and diverse set at the top, followed by a capable and efficient mid-card, and an under-card that can upset the apple cart makes for engaging viewing. However, in recent times, the men’s and women’s tennis tours have seen a hollowing out of the middle. It is particularly stark in the men’s game where Carlos Alcaraz and Jannik Sinner have pocketed the last seven Grand Slam tournaments, talents as effervescent as 2021 U.S. Open winner Daniil Medvedev are threatening to fade away while teenaged phenoms such as Joao Fonseca are rising. At the ongoing U.S. Open, it will be interesting to see if a class that consistently snaps at the heels of the top dogs emerges. The legendary Novak Djokovic, winner of a record 24 men’s Slams, has made three semifinals in as many Majors in 2025. The 38-year-old is still good, but the question is if he is good enough to go all the way. Taylor Fritz and Ben Shelton, No. 4 and No. 6 respectively, are out to end the United States of America’s 22-year wait for a male Slam winner even as Alexander Zverev will be desperate to prove that his No. 3 ranking is not an anomaly.Among women, Aryna Sabalenka, Iga Swiatek and Coco Gauff have combined to win 10 of the last 14 Majors. Though the trio’s hold at the top is not as water-tight as the Alcaraz-Sinner duopoly, they are the players to beat. World No. 1 Sabalenka, a finalist this year at both the Australian Open and the French Open and a semifinalist at Wimbledon, will be eager to defend her title at Flushing Meadows and avoid a Major-less season. Swiatek, who resurrected her career at the All England Club in July after a year-long slump, has continued her fine touch, winning a key U.S. Open tune-up event in Cincinnati. Gauff has had a forgettable time since securing the Roland-Garros crown but the home setting in New York should energise her. It will be intriguing to watch who among Jessica Pegula (2024 U.S. Open runner-up), Jasmine Paolini, Amanda Anisimova, Elena Rybakina — the 2022 Wimbledon champion — and Emma Navarro turn out to be the challengers. Also of interest will be 18-year-old sensation Mirra Andreeva. The Russian won Dubai and Indian Wells, broke into the top-10, made back-to-back quarterfinals at the French Open and Wimbledon, and is now World No. 5. The cream has risen to the top. Will it stay there? READ MORE Published - August 27, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        sport\n                    \n                            /                      \n                        \n                        tennis\n                    \n                            /                      \n                        \n                        US Open\n                    \n                            /                      \n                        \n                        Wimbledon\n                    \n                            /                      \n                        \n                        gender",
        "headline_1": "​Not truly open: On tennis and the U.S. Open",
        "headline_2": "Tennis needs a strong middle tier to see keen contests through two weeks",
        "link": "https://www.thehindu.com/opinion/editorial/not-truly-open-on-tennis-and-the-us-open/article69979649.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-08-2025"
    },
    {
        "full_article": "Tariffs have clouded festive season for workers in export hubs. Here’s how rest of us can help\nHistory will remember Trump’s 50% India tariff as a case of irresistible force meeting immovable object. While he couldn’t weaken India’s resolve, Trump may have forced a strategic rethink here, and a larger pragmatic realignment in the East. The picture will be clearer after Modi’s upcoming visits to Japan and China – fourth and second largest economies, respectively. What is clear, meanwhile, is that India needs to act fast to save its textile, shrimp and other export-oriented industries that employ millions.\nRelative to India’s $4tn GDP, the loss of roughly $40bn worth of exports on account of punishing tariffs might seem insignificant. But this misreads the situation. The sectors hurt most by US tariffs are all labour-intensive. As an example, 3mn jobs could be lost in Tamil Nadu’s textile industry alone. TN accounts for 28% of India’s textile exports and employs 7.5mn workers in just this sector. Early this year, Modi had talked about trebling India’s textile exports earnings from ₹3L cr to ₹9L cr, with a corresponding increase in jobs. Now, the plan is in jeopardy and existing units face a crisis. Other big employers like gems and jewellery, chemicals and seafood sectors are also in for a rough ride.\nWhile states and Centre have promised support to these industries, including finding new markets for them, that will take time. After all, unlike fighter planes, shirts and shrimp aren’t sold at the govt-to-govt level. Orders from new clients could take weeks or even months, and the challenge is to ensure these export-oriented factories continue running in the interim without benching or sacking staff.\nOne way is to heavily tariff imports in the affected sectors, so that apparel from Bangladesh and Vietnam, for example, loses appeal in the Indian market. But India should shun this Trumpian approach. Instead, downstream industries and citizens should consider import substitution now. Modi has been urging all to buy Indian, and domestic demand can certainly keep the lights on in the export hubs. For a few months – until Trump retreats or new export markets are found – businesses should prioritise domestic sourcing over super profits, and consumers should also value the made-in-India label. This is not protectionism but acknowledgement of the role UP’s carpet-weavers, Bihar’s foxnut farmers and Andhra’s shrimp farmers, among others, have played in earning dollars for India. It’s time to pay them back, and ensure their homes are not dark on Diwali.\n\n",
        "headline_1": "Swadeshi Diwali",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/swadeshi-diwali/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-08-2025"
    },
    {
        "full_article": "Why is English so ‘rightwing’?\nWe’ve really taken the Mickey out of Mao. As for Karl Marx, he’s been treated so funnily, he might as well be Harpo. Why, leftist ideology seems to have been Putin its place even in the land where a predecessor’s brave experiment with ‘perestroika’ sadly soon reverted to ‘glasnyet’. So, should we exult over the new global mantra of ‘Right is Might’? Yes, if you lived through the brutal insurgency inspired by Charu Majumdar in late 1960s’ West Bengal. Or if you’ve followed the ‘Rise, Crush, Rise, Repeat’ trajectory of Naxalism 0.1. Aren’t violent ultras vires the Constitution? We should be glad that ultra-thinned Gadchiroli/ Bastar can now experience more pleasurable excitements.\nHowever, mine is a worried ‘no’ about its urban counterparts. Who exactly are these ill-defined ‘danger log’? Why do I keep thinking of Senator McCarthy’s ‘red under every bed’ witch-hunt of the 50s? Or the ‘better dead than red’ mantra of Liberty Prime, the fictitious giant combat robot that in the Fallout video game series is created by US army as a superweapon against China?\nBaap re, should even insignificant me fear the midday knock?\nBecause a dusty ‘Das Kapital’ might still be lurking on my bookshelves?\nBecause my phone would reveal several WhatsApps sent to Maoist ideologue Kobad Ghandy before realising that they weren’t to my caterer with the same first name?\nBecause my laptop harbours some warm reference to ‘Uncle Ho’? He’d wowed us in our Cal college years when strident wall slogan ‘Aamar naam Vietnaam’ vied with ‘China’s Chairman is Our Chairman’ and ‘Naxalbari amader bari’ (our home).\nWell, not a machete-wielding militant, but everyone worth her acne, should be a communist in her youth.\nAlas, left has always been handed a bad deal, from cleanliness to compliments; ‘sinister’ originally meant ‘left’; in the Bible, that’s the side where demons reside. You must put your ‘right foot forward’, else you get ‘left behind’.\nBut, hey, balance is as essential to democracy as to parades. Brigades march ‘Left, right’. So should nations which salute free thought.\n***\nAlec Smart said: “Free speech needs to be freed from politicking.”\n\n",
        "headline_1": "Left in language",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/left-in-language/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-08-2025"
    },
    {
        "full_article": "This Diwali, many Indian workers who make clothes, jewellery, carpets, and even shrimps for export are worried. Why? Because the US has put a huge tax (50%) on Indian goods. This means Indian products are now much costlier in the US, so fewer people there may buy them. Factories in places like Tamil Nadu, Andhra, and Bihar could lose lots of orders, and millions of workers might lose jobs.\nFor example, Tamil Nadu alone has 7.5 million people working in textiles (clothes). If exports fall, nearly 3 million jobs there could be at risk. The same danger exists for shrimp farmers, carpet makers, and jewellery workers.\nThe government is trying to help by finding new markets, but that takes time. In the meantime, these workers need us — the people of India. Instead of buying imported clothes or goods, we can buy Indian-made ones. This way, factories can keep running and workers can keep their jobs.\nPM Modi has often said: “Buy Indian.” For now, that’s the best way we can help. When we choose made-in-India products — carpets from UP, foxnuts from Bihar, shrimps from Andhra — we’re supporting families who depend on these jobs.\nSo this Diwali, let’s light up their homes too by going Swadeshi — buying Indian and keeping the festive spirit alive for everyone.\n\n",
        "headline_1": "Swadeshi Diwali – Why Buying Indian Matters This Festive Season",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/swadeshi-diwali-why-buying-indian-matters-this-festive-season/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-08-2025"
    },
    {
        "full_article": "Right now, India sells many things to the US. But with new taxes (tariffs) making our goods costlier there, some Indian industries may suffer. That’s why India needs to focus more on making things for itself — and the future. One big opportunity? Electric vehicles (EVs).\nMaruti Suzuki is setting up a huge factory in Ahmedabad to make its first electric car, the e-VITARA, and batteries too. These cars won’t just be sold in India — they’ll go to over 100 countries, including Europe and Japan! This shows India can become a global hub for EVs.\nOther companies are also joining in. For example, VinFast, a Vietnamese carmaker, opened its first international EV factory in Tamil Nadu. It came up in just 17 months — much faster than the company’s US plant, which has been delayed for years. This happened because Tamil Nadu gave smart incentives to attract them.\nBut here’s the real challenge: batteries. EVs run on powerful batteries, and making them at home is super important. Maruti’s new plant will make most of the battery parts in India, but we still need to do more. Since lithium (a key battery material) is limited, scientists are also exploring new options like sodium-ion batteries.\nIf India moves fast, it can not only make EVs for its own people but also sell them to the world. That means more jobs, cleaner air, and a stronger economy. \n\n",
        "headline_1": "Time To EVolve – Why India Should Go Electric",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/time-to-evolve-why-india-should-go-electric/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 28, 2025 00:00:00  \nBangladesh's tax regime has so far remained outdated and archaic with both the National Board of Revenue (NBR) and tax payers -- corporate and individual -- either finding themselves at loggerheads or developing a chummy relationship. The net result of this is that those willing to sincerely pay their taxes face unnecessary harassment and often pay more than what is genuinely due while a larger number of taxable people resort to total evasion of taxes or tax avoidance. Here corruption by a section of NBR officials and their willing partners among tax payers are almost equally responsible. It is quite logical that at this crunch time honest businesses find tax rates high while those resort to dishonest practices in submitting their tax returns go away with their offence scot-free. Sure enough, the most important factor here is genuine auditing of corporate financial transactions and audit firms are also not beyond suspicion of malpractices in colluding with both businesses and the dishonest staff of the NBR.\nNo wonder, a Centre for Policy Dialogue (CPD) survey has found, 82 per cent businesses considering the current tax rate unfair, 75 per cent complaining about tax officials' lack of accountability and 72 per cent citing corruption regime in the NBR a serious challenge to business operation. Last but not least is the absence of a fully digital tax filing system. Now all the above complaints made by businesspeople are definitely point to an unhealthy tax environment and it would be interesting to note what the rest 18, 25 and 28 per cent respectively think of the prevailing tax system. Do they consider it satisfactory, positive or supportive to business or would they refrain from expressing their genuine view? Whatever their views may be, the fact remains that the tax-GDP ratio in Bangladesh has seen a decline for the last two consecutive fiscal years. It recorded a decrease from 7.8 in 2023 to 7.4 per cent in 2024. According to the Organisation of Economic Cooperation and Development (OECD), the ratio decreased from 7.3 per cent in 2022 to 7.2 in 2023 -- far below the Asia Pacific (APAC) average at 33.9 per cent. Worse, it declined to 6.6 per cent in 2025.\nThis speaks volume for the inability on the part of the NBR to track down the tax-evading individuals and enterprises. The crux of the problem lies here. The suggestion made by the keynote paper, presented at the CPD event, for lowering the corporate tax to 15 per cent may be reasonable but that does not show the hidden costs of arbitrary imposition of taxes and the complexity of multiple value added tax (VAT) system. These are areas that have to be transparent and leave no scope for malpractices.\nAll this, therefore, point to the need for bifurcation of the NBR into policy and implementation divisions in order to avoid collusion in tax return. In this context, the NBR's decision to keep suspended indefinitely the manual selection of VAT returns for auditing until it develops a proper software to introduce an automated and 'risk-based' audit system for VAT files is a step in the right direction. Hopefully, this will substantially help curb graft in the tax return process.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Tax regime fraught with policy failures",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/tax-regime-fraught-with-policy-failures-1756309488",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Tashfin Chowdhury   |  \n       August 28, 2025 00:00:00  \n\nIn the second week of August, five companies in the United States (US) and United Kingdom (UK) announced plans to slash a total of 7,000 jobs. The companies include the global biotechnology firm CSL, the globally renowned LG Electronics, the US-based and internationally recognised tractor and farm equipment maker John Deere, the Japanese advertising agency Dentsu Group, and the US-based healthcare company CentraCare.\nOn their own, these numbers may seem paltry. However, these five are latest additions to the growing list of more than 3,100 companies globally who announced mass layoffs since the beginning of January this year.\nThe layoffs suggest a paradigm shift in hiring and are being done by senior managements of these companies to restructure their organisations, thus making these more future-ready and in some cases, more profitable. While the wave of layoffs has also reached our economy, strategic and timely steps by the government could ensure that the ripple effect from these do not create havoc in our economy that is still recovering from the aftermath of events of the past 16 years.\nAccording to FastCompany, as many as 800,000 jobs were axed by companies in different sectors globally between January and July this year. The lay-offs are prevalent in a specific group of sectors. Leading the list is the technology sector, where Intel has announced that they will cut 21,000 jobs or nearly 20 per cent of their global workforce. Microsoft has already cut 13,500 till July, Meta has let go of 3,600 employees and Tata Consultancy Services India has cut 12,000 jobs. The other names that have announced lay-offs and furloughs in 2025 include Amazon, Google, CrowdStrike, Bumble and others.\nThe other sectors trailing behind technology include the automotive industry, retail & e-commerce, government departments (US federal agencies, United Nations, USPS and others), healthcare, energy & utilities, financial services, aviation & logistics and manufacturing.\nAs such, the US is leading the pack of countries hit by the layoffs with nearly 257,000 jobs being slashed. Out of the total, more than 171,000 federal employees were laid off due to budget cuts and restructuring, while 64,000 jobs were lost in the retail sector following major bankruptcies of companies such as Joann Fabrics, Party City, and Big Lots.\nThe other countries hit by lay-offs include Japan, Vietnam, Argentina, Pakistan, Indonesia, India, UK, Germany and more.\nSome reasons behind the layoffs are straightforward. For example, the federal agency layoffs in the US occurred due to the Trump administration's government spending cuts. Also, companies began to downsize across the globe following tariffs imposed on them by the Trump administration. The tariffs have reduced profitability forcing companies in several countries to downsize.\nOne of the biggest reasons behind the layoffs is the introduction of Artificial Intelligence. According to a survey by the World Economic Forum, some 41 per cent of companies worldwide expect to reduce their workforces over the next five years because of the rise of artificial intelligence.\nThe other reasons behind the job cuts include post-pandemic economic adjustments and political and policy transitions in most countries.\nFortunately, Bangladesh is yet to be affected by such restructuring of multinationals. There are rumours of silent layoffs occurring in some software and Business Process Outsourcing (BPO) companies. Software developing companies are facing the brunt, as many of their clients are large Western companies currently announcing layoffs in their direct workforce.\nSome financial experts have dreaded that these downsizing measures in the Western countries will significantly hamper the lifestyles of the middle-income households in those countries. As these households are mostly consumers of goods like readymade garments, sweaters, frozen foods, perishable goods and other products, the export sectors of Bangladesh may see a decline in orders this year.\nIn reality, that has not happened. On the flip side, a lower 15 per cent tariff by the US might even push orders from other countries to Bangladesh's export sector.\nBangladesh could add to this trend by appealing to big brands that are moving jobs from Europe and North America to Asian countries. For example, Intel is downsizing its workforce in Europe and moving these jobs to Vietnam and Indonesia. If Bangladesh can convince companies like Intel and others about the lower costs of productions here, some of them may be interested to invest. \nHowever, there are other areas where Bangladesh needs to improve like rapidly cutting down on the time it takes for a foreign company to open an entity in Bangladesh, ensuring uninterrupted access to utilities and internet as well as a politically stable economy.\nFor the last part, Bangladesh could learn a thing or two about the importance of political and economic stability from Pakistan. A Who's Who of the biggest names including Microsoft, Careem, Total, Uber, Shell and others have left Pakistan citing economic challenges and strategic shifts.\nWhile Information and Technology sector in Bangladesh is feeling a bit of the layoff breeze, the Bangladesh government could play its part by announcing incentives for these companies. There could be a collaborative effort between the telecom and IT companies and the government to train Bangladeshi IT professionals in various fields of Artificial Intelligence.\nOnly by staying informed about latest changes and taking pre-emptive steps, Bangladesh could turn its threats into opportunities in the coming years when AI and related emerging technologies will dictate the prosperity of economies.\nSyed Tashfin Chowdhury is a communications professional. \ntashfinster@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Global job cuts and Bangladesh",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/global-job-cuts-and-bangladesh-1756309735",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 28, 2025 00:00:00  \n\nLand grabbers in the country have encroached on some 257,400 acres of waqf land illegally. The actual size may be even bigger. The illegal encroachment of waqf land shows the power of the land grabbers in the country. It is also clear that a section of corrupt government staff are behind the land grabbing. Good news is that the religious affairs adviser recently said proper measures were underway to recover those properties. He also said that the recovered property would be utilised for the greater welfare of society. Waqf properties have long been playing a significant role in supporting spiritual, educational, and welfare activities within the Muslim community.\nWaqf is the permanent dedication of any movable or immovable property by a Muslim for a welfare purpose. So, waqf lands are dedicated by a number of Muslims for pious, religious or charitable purposes. The waqf may also include any other endowment or grant for welfare purposes. The Office of the Waqf Administrator is the key institution responsible for safeguarding, maintaining, and effectively administering waqf properties throughout the country. The government of Bangladesh established the office in 1988 to manage waqf properties. It replaced a smaller organisation formed in 1962 by the Waqfs Ordinance. The government also made an amendment to the ordinance in 2013 making it an act. In the same year, Waqf (Properties Transfer & Development) Special act 2013 was also enacted. Unfortunately, the office is a weak institution. So, it relies on the support from local government, land offices, and law enforcement agencies. As land grabbers are powerful and they have political backing also, it is difficult for the board to take a firm stand. \nRecovering the occupied properties of waqf estates is not enough. It needs routine monitoring operations to check irregularities and encroachments further. That's why the government needs to make all-out efforts to safeguard waqf properties. The government has already taken steps for the digital registration of waqf properties. It will ensure transparency in the rent and lease system. Digital registration will also help stop illegal encroachments. So, its income to support expenditures on social welfare activities will increase. \nSelim Mollah\nNarayanganj\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Recovering Waqf lands",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/recovering-waqf-lands-1756309764",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 28, 2025 00:00:00  \n\nIn today's digital-first world, careers in Management Information Systems (MIS) stand out with their unique blend of technology and business strategy. As companies increasingly rely on data to drive decision-making, professionals who understand both technical systems and organisational goals are in high demand. MIS graduates bring this dual expertise, serving as the critical link between IT departments and business executives.\nFrom designing data-driven solutions to streamlining operations and improving customer experiences, MIS professionals are at the heart of modern organisations. Unlike purely technical roles, MIS careers involve problem-solving, strategic planning, and communication skills, making them ideal for those who enjoy both technology and management.\nWith opportunities across industries like finance, healthcare, retail, and logistics, MIS offers flexibility and a promising future. As automation and digital transformation continue to reshape the job market, investing in MIS education equips the next generation with future-proof skills. It's time to recognise MIS as one of the most promising career paths of our time.\nSafwaanul Haque\nBachelor of Business Administration\nNorth South University\nsafwaanul.haque@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "MIS careers, an opportunity",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/mis-careers-an-opportunity-1756309790",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-08-2025"
    }
]