[
    {
        "full_article": "April’s 69-month low retail inflation and 13-month low wholesale inflation should come as a relief to the public and policymakers alike. For the public, it shows that the easing of prices in the first few months of the year is continuing. For policymakers, it goes a step further in confirming that last year’s alarming levels of inflation are well and truly under control, and that the Reserve Bank of India (RBI) was right to cut interest rates twice in a row. The fall in retail inflation was driven by a contraction of nearly 11% in vegetable prices, and 5.2% in the price of pulses. However, it is important to note that although vegetable prices are lower than last year, this contraction is mainly due to a very high base — vegetable inflation was in the 27%-30% range in the February-April period of last year. Inflation at the wholesale level, too, was driven down by easing vegetable prices, which contracted 18.26% in April. This, too, was on a relatively high base of nearly 12% last April. The base effect aside, it does look like the government’s efforts to bolster buffer stocks of essential food items, conduct open market releases, and ease imports during supply shortages have helped in easing inflation. The other — less positive — factor could have been the liquidity crunch that banks were facing in the first few months of the year. Lower liquidity results in lower amounts left to lend, which squeezes money with companies and the public, and thus can lower inflation. As things stand, even though retail inflation has been decreasing for six consecutive months, its trajectory for the rest of the year will significantly be determined by the monsoon and its vagaries. Similarly, the ongoing tariff uncertainty and threats of retaliation by India will also play a part.The latest inflation data does have some policy implications. The first and most obvious one is that it will likely encourage the RBI’s Monetary Policy Committee to cut interest rates again in June. However, an important consideration for it will also be how the latest GDP growth data — to be released this month end — will look. The other, more immediate step for public sector oil marketing companies is to finally cut fuel prices in line with crude oil inflation in the WPI coming in at a 22-month low. If not, then the government should officially abandon its dynamic pricing policy, where prices are supposedly revised daily. That fuel prices have been virtually unchanged in three years, despite oil prices falling 42% over the period, means the policy is a sham in any case.\r Published - May 16, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        inflation and deflation\n                    \n                            /                      \n                        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        interest rate\n                    \n                            /                      \n                        \n                        fruit and vegetable\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities",
        "headline_1": "​Under control: On the latest inflation data",
        "headline_2": "Low retail inflation is good news for consumers and policy makers",
        "link": "https://www.thehindu.com/opinion/editorial/under-control-on-the-latest-inflation-data/article69579638.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "16-05-2025"
    },
    {
        "full_article": "Until six months ago, Abu Mohammad al-Jolani was a specially designated global terrorist, with a $10 million bounty fixed on his head by the U.S. government. A native of Syria’s Golan Heights and a former member of al-Qaeda in Iraq, one of the group’s most brutal branches, Jolani founded Jabhat al-Nusra, the al-Qaeda’s Syria affiliate, in 2012, during the early stages of the civil war. Thirteen years later, on May 14, Jolani — now known as Ahmed al-Sharaa — met with U.S. President Donald Trump in Riyadh. Mr. Trump, who earlier in the week lifted America’s decades-long sanctions on Syria, praised Mr. Sharaa, saying he was “a tough guy. Strong past... Fighter”. The meeting was a diplomatic victory for Mr. Sharaa, whose Islamist Hayat Tahrir al-Sham (HTS) captured Damascus in December 2024 by toppling the secular dictatorship of President Bashar al-Assad. Mr. Sharaa met Qatar’s Emir in Doha in April, seeking support for his fledgling Islamist regime. He enjoys the strong backing of Türkiye. He was welcomed by French President Emmanuel Macron earlier this month at the Élysée Palace in Paris. And in Riyadh, Saudi Crown Prince Mohammed bin Salman played a key role in facilitating his meeting with Mr. Trump. With regional and international recognition, Ahmed al-Sharaa appears poised to shape Syria’s present and future.The lifting of American sanctions opens the door for Syria to join the global economic mainstream and attract foreign investments. Mr. Sharaa has already invited American companies to invest in Syria’s oil and gas. Money could flow from wealthy Arab monarchies to war-torn Syria for reconstruction and other business opportunities. But one question remains: what kind of Syria are Mr. Sharaa and his fellow Islamists planning to build? Mr. Sharaa has promised to uphold the rule of law, respect women’s rights and protect religious and ethnic minorities. Yet, ever since the HTS captured power, Syria has seen instances of targeted violence against minority communities. In March, hundreds of Alawites, the sect to which ousted President Assad belongs, were killed by Islamist gunmen in the coastal Latakia region. Sectarian tensions remain high in central Syria, where targeted killings and abductions are frequently reported. In recent weeks, Syria’s Druze minority has come under sustained attacks, with community leaders describing the violence as a “genocidal campaign”. The Kurds in the northeast have called for a decentralised, democratic Syria, firmly opposing the HTS’s centralised style of governance. The removal of sanctions and international recognition present a historic opportunity for Mr. Sharaa to steer Syria toward recovery and prosperity. But to that end, he must first stabilise the country internally, dismantle extremist armed groups and adopt an inclusive constitution that guarantees the rights of all citizens. If not, Syria risks following the path of Libya or Afghanistan.\r Published - May 16, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Syria\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Saudi Arabia\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Qatar\n                    \n                            /                      \n                        \n                        Turkey\n                    \n                            /                      \n                        \n                        France\n                    \n                            /                      \n                        \n                        economic sanction\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        religion and belief\n                    \n                            /                      \n                        \n                        national or ethnic minority\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        Libya\n                    \n                            /                      \n                        \n                        Afghanistan",
        "headline_1": "​New beginning: On Syria’s present and future",
        "headline_2": "Syria should dismantle armed groups and adopt inclusive Constitution",
        "link": "https://www.thehindu.com/opinion/editorial/new-beginning-on-syrias-present-and-future/article69579650.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "16-05-2025"
    },
    {
        "full_article": "Trump wants US firms to make only in America. He should get real\nBefore flying out of Doha on board his US-taxpayer-paid Air Force One – not the Qatari gift – on Thursday, Trump mentioned his “little problem” with “friend” Tim Cook’s plan to make iPhones in India. “We’re not interested in you building in India,” he claimed to have told Cook. It’s not a new line. In Feb, he had told “first buddy” Elon Musk that building a Tesla factory in India would be “unfair to us”.\nFour months into Trump’s presidency, it’s clear that manufacturing is at the centre of his vision to make America great again. He wants America to make, and the world to buy like it’s the 1940s or ’50s. Only, it isn’t. US passed the manufacturing baton to China decades ago, mainly because China could make things cheaply. Analysts say manufacturing in America may push up iPhone costs by 25% on account of costlier labour alone. And a finished phone might cost up to $3,500 in US, up from $1,199 now. It would be too expensive for US buyers, and impossible to sell abroad.\nSo, Trump’s belief that manufacturing will help correct America’s trade balance is fallacious. Nor will his other weapon – tariffs – work. While he’s struck a favourable trade deal with UK, and a seemingly favourable one with China, he claimed on Thursday India is “willing to literally charge us no tariff”. In the absence of an Indian confirmation, the claim’s doubtful because India has to protect its farmers. And after the way Trump claimed credit for the India-Pak ceasefire last week, salt is a recommended garnish.\nTrump flew out of Qatar with an order for 160 Boeings under his belt. That’s a win for American manufacturing, but Boeing, although America’s biggest exporter, is worth only around $150bn. Some of the biggest American corporations – Microsoft, Alphabet, Amazon, Meta, Berkshire Hathaway, all of them in the world’s top 10 – are leaders in services. Apple, world’s largest and worth $3.6tn, also derives 25% of its revenue from services, its fastest growing revenue segment. Trump should accept that services is America’s strength now, and stop trying to board the manufacturing bus – or plane.\n\n",
        "headline_1": "Factory act",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/factory-act/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-05-2025"
    },
    {
        "full_article": "His party must punish the MP minister for his comments on Col Sofiya Qureshi, set an example\nSupreme Court will hear today Madhya Pradesh state minister Vijay Shah’s appeal to quash a case against him filed on the direction of MP HC’s Jabalpur bench. The bench had strongly, and correctly, reacted to Shah’s derogatory and “dangerous” comments – “speaking venom” – about army officer Colonel Sofiya Qureshi. It observed Shah’s public comments “encourage feelings of separatist activities by imputing separatist feelings to anyone who is Muslim.” The court listed “prima facie”, Shah’s offences. Thus, the FIR – filed six hours after HC’s deadline – included BNS sections 152 (acts endangering India’s sovereignty, unity, integrity), considered the provision of ‘sedition’, as well as disturbing public tranquillity, acts prejudicial to social harmony, and causing feelings of enmity or hatred. Penalty for any of these includes at least a three-year prison term. If found guilty, Vijay Shah will automatically be disqualified from the House. Yet, the FIR – HC noted with alarm on Thursday – was “obscure”. It had no reference to Shah’s comments. That would allow for the case to fall through.\nWhatever SC decides, Jabalpur bench did well to act on Shah’s comments. It must be noted that the minister’s delayed apology was made worse by his calling the colonel “my sister”. It is time desi politicians understand India’s women are not all their relatives – women are individuals, citizens. Coming especially after his appalling comments, the ‘sister’ descriptor devalued the army officer. To hammer home the message that communally-charged behaviour is a political red line, BJP must make Vijay Shah pay. It is for party leadership to establish disincentives for this brand of politics by exemplary punishment for Vijay Shah. Post-Pahalgam, all of civil society and India’s political class have demonstrated admirable unity. Their collective outrage and collective support for the military have been a balm for a wounded nation. Such solidarity is a lesson for those, like Vijay Shah, who would damage India’s social fabric. Seeds of all communal rifts are sown by politicians. Swift and exemplary action by party leadership can put a stop to such divisive and communally charged politics.\n\n",
        "headline_1": "Vijay can’t win",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/vijay-cant-win/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-05-2025"
    },
    {
        "full_article": "There is a different country within the country which is our hostile neighbour\nI haven’t met Hasan for many years, but I’m sure he lives in the other Pakistan.\nBunny and I first met Hasan in Calcutta in the 1970s. He lived in Dhaka in East Pakistan, and would visit Calcutta for medical checks, and to shop in the city’s New Market. He had a dry wit that made him an engaging conversationalist, and we spent many engaging evenings together.\nWe never discussed religious matters, but I gathered that he was a free spirit, unfettered by rigid dogma.\nShortly before the liberation of Bangladesh, Hasan went to UK, and when the new nation was born, he got a special scholarship to Oxford University.\nWhen Bunny and I went to UK in 1972, to find temporary work there which would enable us to save travel money to see Europe before returning to India, Hasan got me a clerical job at Harrods, where he was working during a college break.\nHe was our friend, philosopher, and guide in London, introducing us to Leicester Square, and Piccadilly Circus.\nA couple of months ago, I got one of his occasional WhatsApp messages saying that he had moved from London to Karachi.\nSeparated by a physical border neither of us can cross, following the escalating tension between the two countries in the aftermath of the murderous assault in Pahalgam inspired by Pakistan’s ISI, I think of Hasan, and of others like him who have friends or family living in India.\nWhat do Hasan and those who have associations of friendship or kinship with us feel about the Pakistan which, behind the cynical mask of democracy, is a military dictatorship with a one-point agenda of perpetuating an institutionalised hatred of India, that has brought it to the brink of moral and financial bankruptcy?\nI believe that so as not to be complicit in the assassination of innocents as happened in Pahalgam, Hasan and those like him inhabit a space of mind and heart, of common decency, and a sense of a shared humanity, which is the other Pakistan.\n\n",
        "headline_1": "The other Pakistan",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/the-other-pakistan/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-05-2025"
    },
    {
        "full_article": "India had a diamond monopoly in ancient times, lab-grown diamonds can restore it \nBlue diamonds, which are rarer than blue moons, made headlines twice in the past three weeks. First, when Christie’s cancelled the auction of ‘Golconda Blue’ in April, and again on Tuesday when Sotheby’s sold ‘Mediterranean Blue’ for $21.5mn in 2.5 minutes. Of the two, GB was the real deal. Mined in India, it had belonged to the Maharaja of Indore once, and was expected to fetch up to $50mn. Not because it was a fistful – 23ct is less than 5g; Ranjit Singh’s Kohinoor weighed 191ct – but because it was the biggest blue diamond ever on the market. South Africa-mined MB, on the other hand, weighs a less atypical 10.3ct or 2g.\nAll diamonds are special, but blue ones more so because they are born 600km under your feet, where temperature and pressure are so high it’s like being in the middle of a nuclear explosion. Actually, nuclear explosions have been known to form ‘nanodiamonds’, but they’re not worth the risk. As for the blue colour, it comes from traces of boron – the same chemical that an Egyptian plane was rumoured to have brought to Kirana Hills after the rumoured nuclear leak at its rumoured nuke silo after a rumoured Indian strike last Saturday\nWhat’s not rumoured but certain is that the future of diamonds lies in labs, not underground. Although manmade diamonds have been around since the 1950s, Modi’s gift of a 7.5ct lab-grown green diamond to the Bidens two years ago declared India’s intent of causing a major upset in the market. Nine of every 10 diamonds are polished in India. Eight of every 10 diamond traders in Antwerp, Belgium – global hub of diamond trade – are Gujaratis. What we don’t have anymore – despite a monopoly till the 1830s – is enough diamond mining. But lab-grown diamonds, which are indistinguishable from Kohinoor and Golconda Blue without deep chemical analysis, and far cheaper, can fill that gap. Diamond snobs might still demand the “real” thing, but don’t bet on it because manmade diamonds, with their relatively tiny carbon footprint, may be more flaunt-able. Besides, they’ll be available in any colour you want, even if it’s black.\n\n",
        "headline_1": "Ready To Rock",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/ready-to-rock/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-05-2025"
    },
    {
        "full_article": "After removing the oppressive and corrupt Hasina government, we were supposed to restore democracy, end all sorts of discrimination, give the country honest and accountable governance, freedom, rights, an efficient and corruption-free bureaucracy, and many other things. \nBut are we doing so?\nWe were angry at Sheikh Hasina because she subverted democracy, establishing which was our dream from the very inception of Bangladesh. We rejected her because of the arrogance and arbitrariness of her person. She totally lost our confidence when people did not matter to her. She failed to sense the people's pulse when a wall of corruption disconnected her party and the people. Finally, she lost power when, instead of listening to the students and the general people, she opted to shoot them down—at least 1,400 of them, with a far higher number of injured, according to UN findings. With all said and done, it was Sheikh Hasina's destruction of democracy that caused her fall. \nHas anything happened recently in Bangladesh that can strengthen our faith that we are moving towards democracy? Is there anything in the present governance process that reflects the people's views, save for those who are adept in the use of social media, possess extraordinary agility to mobilise, can gather quickly, assert their views powerfully, make threats to the government, give ultimatum and see the government wilting under threats? We repeat, we have successfully destroyed Hasina's power-monopolising and freedom-stifling regime. But what have we replaced it with? \nDemocracy does not seem to be our focus today. Because if it were, then shouldn't we have been talking about elections more? Chief Adviser Prof Muhammad Yunus keeps referring to the time frame of December 2025 to June 2026. He has been doing so from the beginning. If he prefers June '26, then he should clearly say so and move in that direction. The debate over the date should now be put to rest. It is harming the credibility of a person we trust and respect, especially because it is well-known that some of his cabinet members are far too enamoured with their present positions, so much so that they want to continue in power, for which they want the election postponed under the guise of reforms. If we look into their respective ministries, have we seen any reforms or even the slightest change in the methods of operation, or some suggestions in this regard to the cabinet? \nThe six major reform commissions submitted their reports on January 15 this year. Yesterday marked four months since their submission. Shouldn't we have had a clearer picture on the agreed reforms by now? We accept that reaching consensus is more complicated than compiling reports. However, we think a clearer picture should have emerged by now because time is of essence, and four months is not too short a period. Yes, there are many political parties, but the ones that have large public support are few. So the situation is simpler than it appears to be. Reaching some sort of agreement on reforms is directly linked with holding the election, and hence the slow pace of reaching it gives birth to uneasy questions. \nThe interim government must be aware of the extent of its mandate and solidity of its tenure. The mandate was for reforms and a speedy transition from an unelected government to an elected one. Prof Yunus did a brilliant job of formulating significant reforms and putting them before the nation and the political parties. And he did so in good time. \nHowever, as for the solidity of its tenure, the interim government doesn't seem to be as aware of its weaknesses as it should be. The only person who can be said to have some sort of people's support is Prof Yunus. He is the only one who, without any voting process, can be said to have been accepted by the people to govern the country for a specific period. But what about the rest of his cabinet members? What sort of public acceptability do they enjoy? It is widely known that when Prof Yunus took the oath of office, he did not personally know many of his cabinet members. In the present cabinet, there are some who have had a long record of public service and professional reputation. But there are others who are not as well-known. Some of them were flown in from abroad and imposed on us without adequate information.\nThe question that is now being raised is about the lack of transparency in this whole process. The chief adviser, of course, determines when he needs additional help. But after his decision, what is the selection process? No public announcement is made and suddenly we are told so and so has joined the government from so and so place, with such and such responsibility. There are instances of an old boys network working here. \nCan Prof Yunus run his time-bound and agenda-laden government with people with such diverse and disparate backgrounds, some of whom have little experience of running a government? I fully acknowledge their expertise and respect them for it, but unless they have experience in navigating through our bureaucratic web, know how to deal with various groups with different agendas, and have personal exposure in handling our specific and sometimes not-so-cooperative cultural traits, they cannot be effective policymakers and much less implementers. \nOthers who have experience of running a government are also not showing the level of effectiveness that is required at the moment. Opening any newspaper or TV channel—of course, we are the villains—will show how urban life has become unpredictable and unaffordable and rural life unsafe. \nWithout questioning anyone's abilities, a look at the portfolio distribution among the advisers gives us an idea of the existing chaos. We have given the task of home affairs—which includes internal security—and agriculture to the same person. Is it doable? Isn't home affairs far too complex and a 24/7 job? When does he have time for agriculture, which is one of the three pillars on which we are surviving, the other two being RMG and remittance? Don't farmers deserve an adviser? Then we put law and expatriate welfare ministries together. As a result, we have a country full of journalists accused of murder, and the legal system has been \"weaponised\" to harass and intimidate a section of the citizens and extort money. The law and expatriate welfare adviser is currently visiting Malaysia and has urged the workers to \"please directly communicate with me\" and collect his email and phone number. Institution-building, indeed. Don't the expatriate community, who gave us around $23 billion last year and nearly the same amount for many years, deserve an adviser of their own? Prioritising indeed. Another adviser has power, energy and mineral resources, road transport and bridges, and railways. Can one person effectively serve so many vital sectors? We have a foreign affairs adviser, a special envoy to the chief adviser on international affairs, and a special assistant on foreign affairs. Do we need three? What have they done so far? For the first time in the country's history, we have a national security adviser with the additional task of advising the chief adviser on defence matters, and Rohingya affairs. His experience on national security and defence matters are totally unknown to the people of this country. His initiative on the \"humanitarian corridor,\" which he prefers to call a \"channel,\" has seriously raised justifiable concerns throughout the country and alarmed all defence establishments, especially as they were bypassed in whatever negotiations or talks that have taken place so far. \nWhat are we to make of all this? We think the present reality and the government's inability to handle everyday affairs, especially on law and governance, give us the answer. As matter stands now, it is Prof Yunus's personal prestige, his well-known commitment, people's trust, and the international community's confidence in him that's helping us overcome the present challenges.\nWe should not take this for granted for too long. The best option is to get ourselves an elected government and restart our democratic journey, however flawed. We are aware that there exists a lot of doubt about our political parties' sincerity and ability to serve the people well. We also doubt their trustworthiness as they have a record of promising the moon and delivering very little. But the only way to find that out would be to elect one. Continuing with an unelected government based on one person's prestige, trust, and goodwill is not a way for a nation to proceed. And this is something a man like Prof Yunus should not permit for long.\nMahfuz Anam is the editor and publisher of The Daily Star.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "What are we building after dismantling the AL regime?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/the-third-view/news/what-are-we-building-after-dismantling-the-al-regime-3895461",
        "news_paper_name": "The Daily Star",
        "publish_date": "16-05-2025"
    },
    {
        "full_article": "At last, even the notion of \"gender equality\" has been challenged. The issue of equality between men and women has been termed by some as \"unacceptable.\" This is what we have arrived at after all these years! Equality has an ethical and moral connotation, not to speak of its economic, social and political importance. Women have fought for it for centuries. It is now a part of national constitutions and international conventions. Last year's mass uprising in Bangladesh had non-discrimination and equality as its cornerstone. Questioning gender equality implies that inequalities are supported. The whole phenomenon is alarming and outrageous. Behind this act lies the increasing trend of animosity and prejudice against women.\nThe expansion of animosity and prejudice is rooted in toxic patriarchy, a sense of extreme supremacy by men, and increasing fundamentalism. Men suffering from these snatch away women's right to self-determination, control them, engage in stifling women's voices, and attempt to limit their diverse identities.\nWomen in Bangladesh are still disempowered on many fronts—economic, political, social and cultural. Most factors responsible for the disempowerment of women in Bangladesh are economic, such as economic dependency on men, lack of land ownership, and limited scope for employment. Some are socio-cultural and religious, such as illiteracy, cultural apathy, intra-household discrimination, purdah or seclusion. And some are political, such as indifference to politics, political parties, and limited participation in the electoral process.\nEconomic empowerment of women is critical for their agency and socio-economic development. In Bangladesh, only 14 percent of the working-age women (aged 15-65) are in active employment and are earning. Less than 10 percent of Bangladeshi women hold managerial positions, while the comparable numbers for men are 88 percent. Furthermore, about 92 percent of employed women work in the informal sector with high gender wage gaps and a lack of benefits. Although the female entrepreneurship rate has been growing, women make up only seven percent of the seven million entrepreneurs in the country and women-led businesses continue to be small.  Only 15 percent of Bangladeshi firms have women as owners or co-owners.\nMost women are concentrated in low-paying, low-productive agricultural activities, and also in unpaid work, which may adversely affect their economic decision-making ability, thus not contributing to economic empowerment. About 30 percent of employed women are involved in unpaid work. Moreover, women spend 25.8 percent while men spend only five percent of their time in unpaid domestic and care work.\nThe majority of Bangladeshi women, regardless of where they live and what their employment status is, say that they hand over most of their earnings to their husbands or other members of their family. Women in Bangladesh have less access to finance as men do not allow them to have access to finance. Only 36 percent of Bangladeshi women have bank accounts.\nEarly marriage continues to impede women's socio-economic empowerment. Currently, almost 51 percent of adolescent girls are married before the legal age of 18. Early marriage limits the capabilities and reduces the opportunities of Bangladeshi women. It is also the most common reason why girls drop out of school. Lack of security is a major dimension of the social disempowerment of Bangladeshi women. Domestic violence is a serious threat to them. The rates of violence against women remain high. According to a 2016 report of Bureau of Statistics (BBS), one in every two married women reported having endured domestic violence during their lifetime. Sexual harassment, acid attacks and suicide are also issues related to their safety and security. \nPolitical disempowerment of Bangladeshi women has its roots in social and cultural norms set by patriarchy. Women are not traditionally expected to have active interests in politics, to be part of political movements, or have some political views, ideas or preferences.  They are not expected to have any kind of voice and autonomy to choose candidates during election times and vote for their preferred candidate, particularly in rural areas. But political empowerment of women is essential for their agency, freedom and socio-economic development.\nThe extreme form of animosity and prejudice against women is reflected in different forms of violence against them. Violence is on the rise in society, and women are being increasingly attacked in various spheres of life. In some cases, those are taking the forms of bodily harm and mental torture; sexual harassments and rape; and in other direct attacks.  The question is why these things happen.\nToxic patriarchy manifests itself through a display of power and anger. It turns men into monsters who hold animosity against women.\nThe extreme fundamentalist ideas emphasise that controlling women is right. It approves the authority of men over women and facilitates \"moral policing\". When such extreme ideas spread in society, the interference of men over women's self-determination increases. Under such circumstances, men will dictate what women will wear, where women can go, and what they are allowed to do. The expansion of a culture of animosity against women has solidified this sense of extreme supremacy of men.\nThe animosity and violence against women have become very common, creating a frightful situation. The state and society will have to take responsibility for these, and so do men. The challenge that has recently been raised against gender equality is a prejudice against equality and an animosity against humanity— a threat to us all.\nSelim Jahan is former director of the Human Development Report Office under the United Nations Development Programme (UNDP) and lead author of the Human Development Report.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Challenging gender equality disempowers women",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/challenging-gender-equality-disempowers-women-3895331",
        "news_paper_name": "The Daily Star",
        "publish_date": "16-05-2025"
    },
    {
        "full_article": "The right to information (RTI) regime in Bangladesh lost momentum with the departure of all three commissioners of the Information Commission following the mass uprising in July-August 2024. However, determined citizens are trying to make do and refusing to give up. Conferring with RTI activists from around the country, we can discern how they are creatively making the most of the situation.\nIn Dinajpur sadar, an RTI applicant was outraged by the quality of public healthcare services at local facilities. Reports of inadequate medical supplies, cleanliness, and insufficient staff were widespread. The lack of transparency regarding healthcare budgets and service standards further exacerbated the community's concerns. Responding to these challenges, she filed an RTI request with the relevant health authorities, seeking information about the allocated healthcare budgets, expenditures, and service standards for local healthcare facilities. To her utter delight, she and others soon noticed a conspicuous change in the quality of healthcare services in the concerned area. The authorities appeared to have immediately undertaken a review of their service standards. Medical supplies were replenished, cleanliness and hygiene were improved, and efforts were made to ensure staffing levels met the established standards.\nThe interim government should encourage all public officials to respond diligently to the citizens' RTI requests by using these examples, pending the appointment of the information commissioners.\nAdapting to the absence of information commissioners, it would be best to focus RTI interventions more on systemic change in governance, which serves public interest, rather than on matters of individual interest. Records show that since the adoption of the RTI Act in 2009, citizens have largely used the law for personal reasons, such as accessing benefits under the government's safety net programmes, obtaining various types of licences, and securing job promotions, among others. Gradually, we have moved on to addressing small-scale transparency issues of societal interest, such as reviewing contract documents for the construction or repair of local roads and ensuring transparency in the tender process.\nThe next level involves invoking the law in matters such as unfair and discriminatory practices, misuse or abuse of power, deprivation of entitlements, corruption in public works, and the implementation of laws and administrative orders.\nWith increased experience, consideration was given to applying the law to address larger national issues. For example, there were thoughts about filing RTI requests to investigate the escalating costs of numerous megaprojects in the country, such as the Padma Bridge. However, fear of official retaliation prevailed. The July uprising spurred hope that the law could now be applied without fear or anxiety, but that hope remains unfulfilled just like the positions of the information commissioners.\nFocusing on transparency and accountability issues of public interest that are aimed at systemic change aligns with the fundamental objectives of the RTI Act. A close reading of the law makes it abundantly clear that its ultimate aim is to change how the country is governed. The idea is to banish the age-old practice of official secrecy and replace it with open governance where citizens can monitor the government's work and hold public officials accountable for their negligence and/or misdeeds. This is best achieved when citizens utilise the law to serve as watchdogs over the work of government offices, monitoring how government policies are implemented and the obstacles they encounter along the way.\nTo advance this objective, the best approach would be to frame RTI requests in a manner that designated officials, charged with dealing with RTI requests, would not feel any personal unease about the request but would rather be inclined to respond positively as part of their national responsibility. Filing multiple applications on the same subject by many applicants may be the trick in this regard.\nTo what issues can this approach of broader societal benefit be applied? A recurring topic is the poor state of the public health sector, which affects ordinary people daily. The absence of doctors in public clinics or hospitals during duty hours, along with their general indifference towards patients, is legendary. Concerted efforts may help change the situation. The first task would be to identify the target clinic or hospital, request the names of doctors assigned to it, and ask for their attendance records. It will be difficult not to respond if there are many requests on the same subject. Success here may be multiplied by similar approaches at other places.\nAnother hot topic is the chronic teacher absenteeism and poor academic outcomes in public primary schools, particularly in rural areas. Citizens may request teacher attendance records, school inspection reports, and student performance data. An approach like this in Nilphamari resulted in disciplinary steps against absentee teachers.\nA perennial problem for the marginalised population in the rural areas is that eligible children of these communities are often denied government scholarships/stipends. RTI requests for a list of recipients from the school or education office, as well as information on the selection criteria and attendance records, should suffice. Such an approach helped uncover irregularities in some cases, and students got their entitled benefits.\nOrdinary citizens often face delays, bribes or manipulation when attempting to register or transfer land. A strategy to address the situation would be to obtain information on the number of mutation applications received and resolved over the past six months and inquire about the reasons behind pending cases. Additional requests for prescribed official processing times and staff duty rosters can also be helpful.\nAllegations of nepotism or bribery in the recruitment of schoolteachers, health workers, and other professionals are also prevalent in many places. Information requests for the list of applicants, selection committee members, and final merit lists may be the trick to cracking the nut. Requesting interview scores and appointment letters is also likely to be helpful.\nThere are numerous other similar issues for which the RTI request strategy may be effective. We hope that the citizens will continue to use the law despite the temporary setback they face due to the absence of information commissioners. Such broader use of the law will build on the gains made over the years by many dedicated RTI users. In the meantime, we urge the interim government to prioritise the appointment of new information commissioners.\nDr Shamsul Bari and Ruhi Naz are chairman and deputy director (RTI), respectively, off Research Initiatives, Bangladesh (RIB). They can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "How to use RTI when there are no  information commissioners",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/how-use-rti-when-there-are-no-information-commissioners-3895256",
        "news_paper_name": "The Daily Star",
        "publish_date": "16-05-2025"
    },
    {
        "full_article": "Under the Bank Resolution Ordinance 2025, the interim government has granted the central bank sweeping new powers to intervene in the banking sector, which continues to reel from the legacy of corruption and mismanagement indulged by the Awami League regime. As a result, the authorities can now take temporary control of any scheduled bank, if necessary, by issuing share transfer orders, provided the transferee is a government entity. The central bank had long sought such authority, as it would grant it greater freedom to intervene in the sector and restore discipline. In that respect, the ordinance marks a positive step forward.\n\nA notable feature of the ordinance is the introduction of \"bridge banks,\" which are temporary financial institutions established to take over failed banks. These bridge banks will ensure the continuity of banking operations during the resolution process by temporarily holding the assets of failed banks until a permanent solution is found. Bridge banks can also act as a buffer, isolating distressed banks from the broader financial system to prevent panic withdrawals or bank runs. \nThe new law also authorises the central bank to act immediately in cases of fraud or gross mismanagement—such as when bank owners divert funds for personal use—by triggering formal resolution proceedings. Under the now-ousted regime, widespread corruption, particularly by bank owners with political ties to the government, seriously undermined the health of many banks. Consequently, at least a dozen of the country's 61 banks are currently believed to be in poor condition, with some surviving only through liquidity support from the central bank. Additionally, the central bank will now have the authority to appoint temporary administrators to manage distressed banks and implement necessary recovery measures. It can also raise capital from new or existing shareholders to strengthen their financial standing.\nA notable feature of the ordinance is the introduction of \"bridge banks,\" which are temporary financial institutions established to take over failed banks. These bridge banks will ensure the continuity of banking operations during the resolution process by temporarily holding the assets of failed banks until a permanent solution is found. Bridge banks can also act as a buffer, isolating distressed banks from the broader financial system to prevent panic withdrawals or bank runs. To support such interventions, a Bank Restructuring and Resolution Fund will be established through government contributions, support from international financial institutions, and risk-based levies on banks.\nOn paper, these additional measures could be useful tools in the central bank's toolkit for addressing the sector's longstanding problems. The need to strengthen the central bank has long been overdue. However, we hope that, beyond reinforcing the legal framework, efforts will also be made to improve the poor track record of enforcing rules and regulations in our financial sector. This is where the focus must now lie—to prevent banks from falling into disarray in future.\n",
        "headline_1": "Strengthening central bank was necessary, it's now its turn to deliver",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/strengthening-central-bank-was-necessary-its-now-its-turn-deliver-3893036",
        "news_paper_name": "The Daily Star",
        "publish_date": "16-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 16, 2025 00:00:00  \nThe recent bifurcation of the National Board of Revenue (NBR) into two separate entities under the Ministry of Finance has come as a surprise, despite tentative moves taken previously in this direction. The newly established Revenue Policy Division and Revenue Management Division will now split responsibilities that were so long handled by a single organisation. The Policy Division will focus on drafting tax laws and setting tax rates, while the Management Division will be tasked with enforcement, audits and compliance. This structural reform is intended to enhance transparency and eliminate potential conflict of interests by separating those who design tax policies from those responsible for implementing them. Such a bifurcation is widely seen as a measure to curb irregularities and reduce opportunities for collusion between policymakers and enforcers. The ordinance that enacted this change also dissolved the Internal Resources Division (IRD), in line with long-standing recommendations from international development institutions and economic experts. The goal is to streamline revenue administration and increase Bangladesh's tax-to-GDP ratio, which remains one of the lowest in Asia at approximately 7.4 per cent. In contrast, the average ratio in advanced economies is 16.6 per cent, and over 10 per cent in many developing countries. To meet its development goals, Bangladesh must raise this figure to at least 10 per cent.\nA statement from the Chief Adviser's Press Wing emphasised that this move is not merely an administrative reshuffle, but a vital reform to build a fairer and more efficient tax system. Separating tax policy from administration is expected to broaden the tax base, reduce inefficiencies, and enhance the credibility of tax governance. The restructuring is aimed at ending a long-standing conflict of interests, where the same authority was responsible for both framing tax policy and enforcing it. Critics have long argued that the unified structure of the NBR compromised the quality of tax policy, favouring short-term revenue gains over fairness and long-term economic planning. Businesses, in particular, have voiced frustration with tax measures that prioritised revenue collection over consistency and growth.\nThe call for structural reform is not new. The International Monetary Fund (IMF) first recommended the separation of the NBR's policy and administrative functions as early as 1993, with the World Bank reinforcing the suggestion in 2007. Over the years, economists, think tanks, and international development partners have echoed these views, urging the government to modernise the revenue system for greater effectiveness and transparency.\nDespite opposition from within the NBR -- where officials have reportedly initiated a pen-down protest -- the wider expert community, including business leaders and economists, largely supports the change. The task forces and committees formed by the interim government have also advocated for this bifurcation. While the restructuring marks a significant step forward, its success will ultimately depend on how well the transition is managed. Ensuring adequate resources, capacity building, and a clear division of responsibilities between the two new entities will be essential for this reform to deliver its intended outcomes.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "NBR bifurcation: Towards fairer revenue regime",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/nbr-bifurcation-towards-fairer-revenue-regime-1747322676",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       May 16, 2025 00:00:00  \n\nIf the ultimate crime is homicide, Bangladesh has perhaps been witnessing a higher incidence of it lately. The recent surge in murder has a fair share in political vendetta. But this has also acted as a powerful provocation for settling scores where personal, family and land disputes are involved. Grisly and bone-chilling all kinds of murders may be to a sensitive and delicate mind, but the general perception of taking away lives has become one of helpless acceptance. \nTwo incidents of murder that took place on Friday and Saturday last ---one in the capital's Shewrapara and the other in Kurigram, a northern district, provide a disturbing insight into the growing mentality of monstrosity. Both are blood chilling and yet the motives differ widely. In the Shewrapara incident, a teenage boy aged only 14 ended up killing two of his aunts (elder sisters of his mother). He came all the way from his residence in Shanir Akhra, Jatrabari with the motive of managing Tk 3,000 he needed for purchasing a second-hand bicycle. On his arrival, his eldest aunt entered the kitchen for preparing sherbet to entertain her nephew but the boy took advantage of her momentary absence to steal Tk 3,000 from her moneybag in the bedroom. Unfortunately for them, she came at the right moment to see his act of theft. As she mildly rebuked the boy and tried to inform his mother, her youngest sister, of his act, the boy took hold of the kitchen knife to stab her and when she cried for help, her younger sister came out from another room to save her. But the boy was quick enough to stab this woman too.\nUp to this, the act could be termed something very rash committed at the heat of the moment. But what he did next is nothing short of the devious performance professional killers would engage in. He brought the cylindrical stone called 'nora' in Bangla, which is used as a grinding tool, from the kitchen to strike both women's heads in order to ensure their death. Then he left and even attended the last rites of one of his murdered aunts in Jhalakathi. His mental plunge into the abyss defies any logic. \nThe Saturday's murder in Kurigram is even more bizarre and sinister. Here parents of a 15-year-old daughter, a student of class IX, killed her in collaboration with the girl's aunt, wife of her uncle (brother to his father) with the ulterior motive of implicating their opponents with whom they have a dispute over 32-bigha land property. The girl was hacked with sharp billhook and rod before leaving the body in a maize field. It is impossible to fathom the depth of darkness and derangement of human mind. \nSince the mass murder of July-August uprising, there has been a shift in the criminally bent people's attitude towards crime including the horrific murder. They consider it an opportunity to go about such morally wrong and legally impermissible acts, taking cues from such rising incidents and advantage of the perceptible laxity on the part of the law enforcement agencies. \nEven this mentality of criminals would not have been a cause for as much concern as it has become with the moral slide and debasement of people who were supposed to have retracted from such heinous acts because of their traditional mental orientation based on moral teaching irrespective of religions; and social values of life's sacrosanctity. This special kind of criminality has had its sway on unlikely mortals with no criminal records--- either personal or of families. Even teenagers have become accustomed to committing homicides like hardened criminals. \nThe rise of teenage gangsters after the model of their senior terror groups who once had built their entrenched underground bastions in the capital city speaks volume for the new twist to the trend of crimes. If the new generation is looking for swaggerish self-importance and influence by way of demonstrating their capacity to kill at will, some of them deliver in a significant number of cases the mortal blow out of nervousness and at the heat of the moment. To do so they have to cross a psychological barrier, a threshold of natural inhibition they inherit from the family and social tradition backed up by moral or ethical standards set by religion, education and culture.\nToday, people, young ones included, can easily overcome the psychological barrier to commit the ultimate crime. To some hired criminals, this is nothing but sport. Leaving them aside, the mental transition of common people for the worse is what makes society full of apprehension. People's confidence in human virtues, social bonds and sincerity of relations erodes beyond repair.\nSociety's incapacity to arrest such mental decay is getting increasingly exposed with each such monstrous act. In both acts of homicide, the objective was material gain---for the boy only Tk3,000 and for the killer parents and their sister-in-law, land property of a significant size. But how their acts undermine human relations and values is a serious subject the nation needs to study before it aspires for establishing an orderly and peaceful society. If the quality of human beings declines so sharply, how can it expect to heal its wounds caused by nasty political rivalries? This nation must go for an introspection to delve deep into its brazen prowling mindset always on the lookout for advancing narrow personal gains no matter if it requires elimination of anyone---rivals or not---on the way. \n \nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Mind behind monstrous  acts of homicide",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/mind-behind-monstrous-acts-of-homicide-1747322735",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 16, 2025 00:00:00  \n\nIt will be hard to find a single patient who, while receiving medical treatment at public health facilities in Bangladesh, did not experience neglect, non-cooperation or some other forms of unexpected behaviour from doctors, other healthcare providers or employees. What patients face at public hospitals sometimes go far beyond these. We sometimes come across media reports of physical assaults of patients or their attendants by hospital employees or guards. Bribing hospital employees for emergency care, admission and medical examinations has become so common that most people take it as the norm.\nThe public healthcare system in Bangladesh is considered a cornerstone of equitable health access for several reasons, chief among them being the low affordability of the majority of the people to buy medical services from private health facilities. But the public healthcare system is grappling with multifaceted challenges, beginning from infrastructural inadequacies to systemic corruption, that compromise patient care. A survey by the Transparency International Bangladesh several years ago revealed that over 40 per cent of service seekers fell victim to irregularities and corruption at public hospitals. It seems that the patients, who are compelled to depend on public hospitals for health services, have no dignity and no right to proper medical services and fair treatment. As media reports suggest, the suffering of patients who require admission begins as soon as they reach public hospital gates where guards lurk to divert them to private clinics mushrooming nearby. The guards, who usually come from Ansar-VDP and are on government payroll, act as commission agents of the clinics.\nMedical negligence and maltreatment sometimes lead to deaths of patients. Incidentally, the cases of patients' deaths due to medical negligence have been more frequent than before in the country at both public and private health facilities. Though well-off patients who die at expensive private hospitals sometimes make headlines, poor patients who die or suffer for negligence at public hospitals often go unnoticed.\nSeveral factors are responsible for the perennial medical negligence in Bangladesh with the major ones being infrastructural inadequacies, huge burden of patients on healthcare providers, the lack of accountability, widespread corruption like other public service sectors and the lack of awareness about the responsibilities of the healthcare professionals and the rights of the patients. Public health facilities here are inundated with patients, overwhelming their capacity. Major public hospitals in Dhaka and other cities witness thousands of patients daily, many of whom are forced to wait in long queues for hours - sometimes even for days - for basic medical services. Patients are often treated on the floor or in hospital corridors due to a lack of adequate number of beds. This overwhelming demand strains the already limited resources, leading to compromised patient care and increased risk of medical errors.\nPublic hospitals enjoy a sort of immunity which allows their staff to be less caring. Drives conducted by regulators at private clinics to examine if they comply with laws and properly serve patients are common, but such drives at public hospitals are seldom seen.\nThe negligence and maltreatment of patients in public health facilities is a pressing issue that undermines the nation's commitment to equitable healthcare. The country needs to enhance infrastructure, confront corruption, foster a culture of accountability and create awareness about the responsibilities of healthcare professionals vis-à-vis the rights of patients for restoring trust in its public healthcare system and ensuring the dignity and well-being of all patients.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Patients in peril at  public hospitals",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/patients-in-peril-at-public-hospitals-1747322787",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 16, 2025 00:00:00  \n\nBangladesh's thriving garment industry is a cornerstone of its economy, yet it produces over 400,000 tonnes of textile waste annually. While sustainability conversations often centre around energy or agriculture, textile waste management remains a largely overlooked issue-despite its immense potential.\nMuch of this waste ends up in landfills or is incinerated, releasing harmful toxins and carbon emissions. However, this discarded material can be repurposed into yarn, insulation, or even stylish up-cycled fashion. Embracing textile circularity would not only reduce environmental impact but also create new green jobs in recycling and design.\nEncouragingly, several small enterprises in Dhaka and Chattogram are already using fabric scraps to craft sustainable items like patchwork bags and recycled denim. With proper government support-including incentives for green startups, skills training, and regulatory oversight-this practice can be scaled nationally. Furthermore, exporting up-cycled fashion could open doors to global markets increasingly focused on sustainability.\nRather than viewing textile waste as a liability, Bangladesh should recognise it as a resource ripe for innovation. With the right policy push, the nation can emerge as a leader in ethical fashion and sustainable industry.\n\nAtikur Rahman\nStudent, BBA Department\nNorth South University\natikur.rahman.nsuf@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Towards sustainable fashion",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/towards-sustainable-fashion-1747322813",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-05-2025"
    }
]