[
    {
        "full_article": "Migration has been a central theme in the Bihar Assembly election campaign, the first phase of which ended on Tuesday (November 4, 2025). Parties have sought to frame the migration debate in different ways, but it is important for the sake of the State and the country to get this correct. The Opposition, led by the Rashtriya Janata Dal (RJD), has blamed the ruling National Democratic Alliance (NDA) for the heavy out-migration from the State to other parts of the country for opportunities; the Bharatiya Janata Party-Janata Dal (United) [BJP-JD(U)] axis, which has been in power for 20 years, is partly in denial of the issue while disingenuously raising the bogey of illegal immigrants in the State. The scaremongering around illegal migrants in the State by the ruling combine would have been laughable but for the cynicism and xenophobia associated with it. For one, the Special Intensive Revision, which was touted by the Election Commission of India as an exercise to purify the electoral rolls, demonstrated that there was no large-scale presence of immigrants in the State.The Opposition ran its campaign on the slogan: ‘Generate employment, stop migration’. As per the 2011 Census, 74.54 lakh migrants from Bihar are spread across the rest of India. It is sad that the BJP, at the highest level, conjured up a phantom of anti-Bihari sentiment in other parts of the country, purely for short-term political gains in an election. Migration of people is integral to human development, and there is nothing inherently undesirable about it. The Opposition has argued that the BJP-JD(U) government has turned Bihar into a supplier of migrant labour and has promised to create local employment opportunities. Creating infrastructure and opportunities should be part of any robust election conversation, but that can be achieved while maintaining a more sanguine view about migration. Bihar has high fertility and a younger population relative to other parts of the country. Regional variations in economic opportunities and demographic trends make the movement of people inevitable. Bihar should focus on its education and health standards and build a highly productive and skilled workforce that adds momentum to its own growth by being part of India’s economic growth. Published - November 05, 2025 12:34 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        migration\n                    \n                            /                      \n                        \n                        immigration\n                    \n                            /                      \n                        \n                        illegal immigrants\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025",
        "headline_1": "Migration debate: On the first phase of 2025 Bihar Assembly election",
        "headline_2": "There is nothing inherently undesirable about outward migration",
        "link": "https://www.thehindu.com/opinion/editorial/migration-debate-on-the-first-phase-of-2025-bihar-assembly-election/article70241263.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-11-2025"
    },
    {
        "full_article": "Our docs, nurses are in demand globally. Why can’t we fix med infra here & also become top med tourism spot?\nIt’s unsurprising yet heartening to see that India’s doctors and nurses are the largest group of migrant health workers in OECD member countries. In 2020-2021, 75k doctors moved to practise in other countries as did 1.2L nurses, per data released in the International Migration Outlook 2025 report. Two points.\n* First, it confirms trends since the turn of the century, and globalisation, that migration of skilled workforce is a mainstay for developed economies to address in the most obvious way the challenges of an ageing population and growing demand for healthcare. To that end, about a quarter of doctors in service in OECD nations are migrants.\n* Second, protectionist anti-migration policies are not in the self-interest of countries. Nations recognise this, and are tailoring policy to recruit healthcare workers from countries like India.\nThe OECD report points to a Belgian project that recruits and trains Indian nurses for the Flemish healthcare system, especially geriatric care. The two-year course’s initial months include training in Kerala where Dutch is also taught. Such initiatives are welcome as are govt-to-govt endeavours such as recruitment agreements with England and Ireland. Over half of Ireland’s nursing workforce in 2023 was trained abroad, the country is home to a robust Indian nurses’ diaspora.\nWhen this is the reality – a high global demand for Indian doctors and nurses – why is the domestic outlook so gloomy? Clearly what is taught in govt medical colleges as well as private ones not focused on profiteering alone (high capitation fees, sham merit, ghost faculty, poor infra) is holding Indians in good stead. The OECD report makes it all the more a priority that govt fix the medical colleges ecosystem – decentralising the all-India entrance exam NEET that over 2.4mn sat for last year, is just the starting point. Take the registration of doctors. Months ago, NMC reported under 1.5L doctors registered in Tamil Nadu, while the state council registered over 2L. For Delhi, NMC had fewer than 31.5k docs but the Delhi council data for 2020 had over 72,600. There are no answers to where 40k docs disappeared. Add to that the statewise skew in numbers of doctors and the massive urban-rural divide in infra and staff.\nIn allowing these problems to fester and at best attempting band-aid solutions, India is underutilising its potential as a top healthcare destination. Ranked 10th globally, India’s medical tourism market is projected to reach $58bn by 2035 at CAGR of 12.3%. Over 6.4L medical tourist visas were issued in 2024. Yet, fragmented care, growing distrust in private hospitals for overcharging and unnecessary procedures, and poor follow-up are marring India’s many advantages.\n\n",
        "headline_1": "What Doctor Ordered",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/what-doctor-ordered/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-11-2025"
    },
    {
        "full_article": "Of all languages, English has the weirdest vocabulary – and it’s getting weirder\n“’Twas brillig, and the slithy toves/Did gyre and gimble in the wabe:/All mimsy were the borogoves,/And the mome raths outgrabe.” – Lewis Carroll.\nLewis Carroll made up words, admitting unauthorised migrants into the community of language.\nAlready playing host to a legitimately resident verbal population, estimated between 600,000 and a million words, English is the most verbose of the world’s languages. It might be likened to a tropical rainforest with the most exotic and esoteric verbal flora and fauna.\nWith 45 letters, ‘pneumonoultramicroscopicsilicovolcanoconiosis’ is generally deemed the longest word in English, denoting a lung disease caused by inhaling volcanic dust.\nHowever, with 28 letters, ‘antidisestablishmentarianism’ is considered to be one of the longest non-scientific terms, connoting the double negative of a view which is against the destabilisation of established norms and is therefore in favour of convention.\nJosefa Heifetz Byrne’s Dictionary of Unusual, Obscure, and Preposterous Words is a delightful compilation collated from a lexical cornucopia of sources covering 6,000 words.\nRanging from ‘aa’, which means a form of Hawaiian lava, and ‘abecedarian’, a person learning the alphabet, the dictionary goes all the way to ‘zzxjoanw’, a Maori drum.\nPublished in 1974, the dictionary needs an Indianised update as with between 125mn and 228mn second-language English speakers, India is the most anglophone country in the world.\nAnd who should be the compiler of such a dictionary, but that apotheosis of authoritative articulation, bespoke bestower of bombastic ballyhoo, expositor of extraordinary expression, supremo of sesquipedalian semantic sententiousness, prestidigitator of polysyllabic prolixity, the wunderkind of waffle?\nWho but the person who could coin a generic term for such variegated verbiage and call them Tharoorisms?\n\n",
        "headline_1": "Words of whizzdom",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/words-of-whizzdom/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-11-2025"
    },
    {
        "full_article": "Trump wants nuke testing. Others want nukes. No winners in a nuclear war. But arms lobby wins in nuclear race \nMad mathematics – that’s what nuke competition is. Nuclear armed countries have enough warheads to destroy the world many times over. But most want more. And it’s no surprise that Trump has ordered resumption of nuke testing. He claims Russia, China and North Korea are doing it. There’s no proof Moscow and Beijing are mushroom-clouding again. Yes, Kim Jong Un is. But he runs a rogue regime. Trump’s real motivation is mad math. Putin is expanding his nuclear weapons delivery systems. Xi wants 1,000 nukes by 2030. But Trump has multiple delivery options too and he can feel damn macho by asking generals to tell him about America’s 5,000 nukes. So, what’s bugging him? Answer: nuke geopolitics is crazy.\nIsrael has nukes but doesn’t deny or confirm it. America lets it be. But Israel’s adversaries think of going nuclear. Other nuke-seeking nations argue that nukes will make them safer – they point to Libya, which gave up nuke ambitions and is in chaos, to Ukraine, which gave up nukes and got invaded by Putin. Even a child knows a nuclear war has no winner. But apparently, govts have a hard time understanding this.\nThe nuclear arms race however has one clear winner – the arms lobby. Backward linkages of nuclear testing directly benefit arms manufacturers. They are in clover anyway, given the number of conflicts going on in the world. Look closely, there’s a pattern. Sow chaos, supply weapons to conflicting sides, which in turn creates more chaos and finally forces warring parties to consider nukes. Globally, the military industrial complex is getting fat on a market worth approx $2.5tn annually. But it wants more. The likes of Trump, who btw wants the Nobel Peace Prize, are happy to feed that greed. And the math gets madder.\n\n",
        "headline_1": "Mad Math",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/mad-math/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-11-2025"
    },
    {
        "full_article": "India’s women cricketers, emblematic of its cultural and geographical diversity, showcase the talents of India Overlooked. Young people who are comfortable in their skin even if they aren’t comfortable speaking English. And BCCI deserves credit for backing them\nThe images, the words and the roar willendure. Captain Harmanpreet Kaur, running on air, arms wide, rapture unbound, after that final overhead catch.\nTeammates Deepti Sharma, Renuka Singh Thakur and Richa Ghosh locked in spontaneous embrace.\nIan Bishop’s word-perfect commentary rising above the crescendo of a heaving stadium, “A victory that will ignite the nation and will create a legacy for generations of young women to follow.”\n\nEveryone awake at that midnight hour felt young and elevated. Memories are made of this.\nRead the full story on TOI+.\n\n",
        "headline_1": "Girls, uninterrupted",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/girls-uninterrupted/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 05, 2025 00:00:00  \nTo say that the communication system of Bangladesh is in a chaotic state is to say the least. One need not be an expert to reach such a conclusion. In fact, it is obvious to anyone commuting within the city or travel to destinations closer or farther from any point in the country. To resolve the crisis a masterplan was formulated a decade back styled, 'National Integrated Multimodal Transport Policy' in 2013. Its objective was to develop an integrated transport network involving road, rail and waterways. Against this backdrop, the Chief Adviser (CA) on Sunday last reportedly, underscored the need for an integrated and balanced development of the country's road, rail and waterways system at an interministerial meeting held at the state guest house, Jamuna, where the 'Central Integrated Transport Sector Master Plan of Bangladesh' was presented. \n At the same time, it was disclosed that three new terminals would be operational in Chattogram port by 2030. In fact, no development can be conceived without having an integrated communication infrastructure that involves all the existing transportation modes of a nation. The CA has rightly diagnosed the existing anarchy in transportation system and his warning in this connection that it would turn into a veritable 'noose around the neck of our economy' unless duly resolved is cogently pointed out. \nIn this connection, the river system of the country merits special consideration. Despite all the concerns and the sense of sanctity expressed about rivers and their water, the fact remains that they are already the worst victims of pollution and depredations, thanks to previous attempts at constructing artificial barriers to normal flow of rivers for flood control or for other purposes at home and the dams and barrages across transboundary rivers built in the upstream region on the other side of the border.\nSo, given the past, bitter experience of achieving development at the expense of nature and the environment and the ultimate price every nation including ourselves has been paying for that in the form of devastating impact of climate change, any fresh move to improve transportation network must take all those factors into consideration. Obviously, the situation calls for taking necessary caution so that the already overstressed rivers are not subjected to fresh efforts at harming the existing river ecosystem. Mention may be made at this point of the preliminary strategic plan that the Roads and Highways Department presented and, which, it has been informed, was developed through coordination among all the ministries concerned. It is no doubt a useful approach contrary to the previous ones missing coordination among the different departments in the government. Against this background, a plan that envisages streamlining the entire communications system by integrating different modes of transport and making improvements and adjustments as necessary is definitely a step forward. \nIt would also be worthwhile to mention here that in many cases in the past, the local population of a particular area where a transport infrastructure project was undertaken was hardly ever consulted. The obvious result was that such transport infrastructures came to no use of the intended beneficiaries and, therefore, proved to be a mere wastage of public resources. In the case of an integrated transport plan thus conceived, the government would do well to keep a provision for inputs from the would-be beneficiaries of the project. That would help make the desired improvements in the communications system through optimal utilisation of existing resources. It is hoped that the interim government would finally be able to give the transport master plan a long-awaited go ahead.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Go ahead to transport master plan",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/go-ahead-to-transport-master-plan-1762273872",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       November 05, 2025 00:00:00  \nWhile rivers across Bangladesh face grave vulnerabilities-encroachment, pollution, siltation, and declining navigability-the situation is particularly dire for the rivers surrounding Dhaka. A couple of them are practically lifeless, having lost their channels altogether. Despite repeated calls for their preservation and the adoption of a 20-year master plan to protect them, meaningful progress remains elusive.\nRivers in Bangladesh are among the most neglected victims of urban expansion and unregulated human activity. Those flowing close to major townships, business centres, and urban habitats have long been subjected to relentless abuse. This is a story as old as the country's development narrative: lawlessness and anarchy, fuelled by greed and, above all, the inability or unwillingness of authorities to rein in the prevailing lawlessness. \nOccasional eviction drives led by the Bangladesh Inland Water Transport Authority (BIWTA) have attempted to recover encroached lands. Yet these sporadic efforts have rarely convinced citizens that the government is fully committed to the task. A lingering cynicism prevails regarding the state's firmness in confronting vested interests and restoring the rivers to their earlier states. \nPast eviction drives were largely disorganised and ineffective. However, the BIWTA's 2019 initiative marked a turning point. It was better coordinated, appeared politically backed, and seemed to reflect genuine intent. On the banks of major rivers around Dhaka-including the Buriganga, Turag, and Shitalakhya-multistoried structures, warehouses, and factories were demolished, and large stretches of encroached land were reclaimed.\nFor a moment, public optimism surged. While some influential quarters managed to evade eviction through political connections or favourable court orders, the overall momentum of the campaign hinted that even these holdouts would eventually face action. Yet, despite its initial success, the drive faltered prematurely. Funding constraints were cited as a key obstacle, raising questions about the government's prioritisation of such a critical issue.\nOne crucial follow-up measure was the demarcation of riverbanks to prevent renewed encroachment. Work began under a project that included installing boundary pillars, constructing protective embankments, building walkways, and undertaking other development initiatives along the Buriganga, Turag, Balu, and Shitalakhya rivers.\nProgress, however, was again slowed by the Covid-19 pandemic. Time and cost overruns forced the BIWTA to seek additional funds, revising the project to include new components such as the construction of 35 kilometres of drains along walkways. Plans also included the installation of 3,850 boundary pillars, 17.75 kilometres of walkways, dredging of 18.21 million cubic metres of earth, and the development of four river stations and 14 jetties for transport services. Despite these ambitious goals, the project's current status remains uncertain, underscoring the chronic delays and a lack of transparency that have long plagued river conservation efforts.\nWhile eviction drives and development works have received some attention, pollution-the most insidious threat-remains largely unaddressed. An estimated Tk 270 billion spent over the past 27 years to improve the Buriganga's condition has yielded little. Experts argue that ill-conceived projects and piecemeal interventions have failed to address the root causes. \nAccording to experts, Dhaka's rivers are mainly polluted by the upstream rivers, and there are about 1,200 pollution points, many originating upstream. Industrial waste, untreated sewage, and rampant dumping continue. The crisis worsened after the 1988 floods when the authorities cut Dhaka off from nearby rivers and wetlands, a move that not only dried up natural water flows but also contributed to chronic waterlogging in the city. Without a comprehensive strategy to tackle pollution at its source, restoration remains a distant dream.\nEqually pressing is the issue of navigability. Many river channels, once vital for transport and trade, have been obliterated by illegal earth filling. The loss of navigability not only disrupts commerce but also cripples urban transport alternatives. For instance, the much-publicised water bus service in Dhaka failed primarily because of shallow riverbeds during the lean season. While there were management flaws as well, adequate navigability could have salvaged the initiative.\nRestoring these channels is not just a matter of convenience; it is a matter of survival for the city. Historically, rivers have been lifelines for urban development, offering natural transport routes, facilitating trade, and providing fresh water for households, industries and agriculture. They also contribute to the cultural and aesthetic fabric of cities. To allow them to wither away is to undermine Dhaka's very foundations.\nIn 2021, a 20-year master plan was drafted to comprehensively address pollution, illegal occupation and navigability. It promised a holistic approach, combining eviction, restoration, infrastructure development and pollution control. Yet, like many well-meaning plans before it, implementation has stalled.\nAt this critical juncture, it is imperative for the authorities to translate plans into action. Dhaka cannot afford further procrastination. With the current interim government's apolitical nature, there exists a rare window of opportunity to enforce measures without the usual political interference. Transparent implementation of the master plan, coupled with consistent funding and accountability, could revive Dhaka's rivers and restore their role as engines of urban life. The need now is for sustained effort, political will, and public accountability. Only then can these rivers-once symbols of life, trade and culture-be revived to serve the capital once again.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Is restoration of Dhaka's rivers elusive?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/is-restoration-of-dhakas-rivers-elusive-1762273921",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 05, 2025 00:00:00  \n\nDespite the sluggish performance of the industrial sector, the overall profitability of Bangladesh's banking industry has surged in 2025. Most banks have shifted their focus from industrial lending to investments in government securities such as treasury bills and bonds. This strategic realignment has resulted in remarkable profit growth for leading institutions like BRAC Bank, The City Bank, Eastern Bank (EBL), Dutch-Bangla Bank, and Prime Bank.\nInterestingly, this rise in profitability has occurred even though the net interest income (NII) of most banks has declined compared to previous years. The preference for government securities is largely driven by their perceived safety, as repayment behavior among borrowers has become increasingly concerning in recent years. With non-performing loans (NPLs) continuing to rise, banks are finding investments in government instruments to be a more secure and stable source of earnings than traditional lending.\nIt is worth noting that treasury bill and bond rates have recently been reduced, with yields now in the single digits. Although the profit margin from these instruments is not significantly high, banks are increasingly investing in them to maintain portfolio stability. However, this trend may create substantial vulnerability in industrial growth due to reduced borrowing in the private sector. Any revision of the repo rate may further influence inflation. Since most bank deposits are short-term in nature, there also exists the possibility of a decline in public deposits.\nBanks generally earn profitability through the spread between the cost of deposits and the returns from interest income and investments. If deposit growth slows, banks may have to borrow through the SDF or call money markets at higher rates, which would further narrow their profit margins.\nAdditionally, maintaining the required Advance-Deposit (AD) ratio could become increasingly challenging. Investment in government securities, though seemingly safe, is actually an unsustainable and temporary way to mitigate risk. Until the upcoming national election, this situation is likely to remain unchanged. Overall economic growth through the private sector may not progress along a satisfactory path, and persistent inflation will continue to affect deposit mobilisation in the banking system. Therefore, it is essential to channel more investments into domestic manufacturing industries with strong and consistent demand. \nKawsik Azad Pronoy\nA banker and business analyst\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Banks’ investment in Govt. securities",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/banks-investment-in-govt-securities-1762273945",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 05, 2025 00:00:00  \n\nEach year, thousands of graduates enter Bangladesh's job market with hopes of securing stable employment only to face limited opportunities and increasing competition. This growing mismatch between education outcomes and labour market realities underscores the need for a paradigm shift - from producing job seekers to cultivating job creators.\nThe current education system remains heavily theory-driven, with minimal emphasis on practical skills, innovation and entrepreneurship. As a result, many graduates emerge academically accomplished but ill-prepared to initiate ventures or contribute to economic diversification. The country's long-term growth depends on harnessing this untapped potential through entrepreneurship-focused education and policy support.\nEstablishing university-based incubation centers, offering startup seed funding and integrating entrepreneurship modules across disciplines could help foster a culture of innovation. Encouraging collaboration between academia, industry and government would further strengthen the entrepreneurial ecosystem. Countries such as India and Indonesia have demonstrated how empowering youth-led enterprises can stimulate job creation, attract investment and enhance national competitiveness.\nBangladesh's demographic dividend presents both an opportunity and a responsibility. Equipping students to become job creators rather than job seekers is not just an educational reform - it is a strategic economic imperative for sustainable growth and self-reliance.\nNusrat Jahan Usha\nBBA, North South University \n nusrat.usha01@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Be a job creator, not job seeker",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/be-a-job-creator-not-job-seeker-1762273963",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-11-2025"
    }
]