[
    {
        "full_article": "Fourteen people, two of them children, were killed and 13 injured in a hotel fire in the Mechua market area of Burrabazar in central Kolkata on Tuesday (April 29, 2025). The fire engines had trouble accessing the congested area. It appears, yet again, that many of the victims were asphyxiated — smoke is as much a deadly killer as the flames themselves. Smoke quickly rises up and escape would require reaching the bottom areas of the building. The six-storey hotel had only one stairway, and the fire that broke out on the first floor cut off escape. One person died after jumping from the building. That there were no other accessible means of escape is, in and of itself, a violation of fire safety norms. On Thursday, a similar tragedy unfolded in Rajasthan’s Ajmer, a historic town. Fire broke out in a five-storey hotel in which four persons died. Some guests tried to jump out of the windows, and fire engines had trouble accessing the congested area.Devastating fires in congested buildings leading to tragic loss of lives and property have become a disturbingly routine phenomenon across India, especially in Kolkata. There, Opposition leaders have rightly listed at least eight major fires in the last decade and half, starting with the AMRI hospital fire in 2011 that claimed 89 lives. West Bengal Chief Minister Mamata Banerjee has spoken about a gas cylinder explosion after the Tuesday fire. She too has talked about there being only one staircase. Ms. Banerjee has characterised such fires as accidents that could not have been prevented. But the tragedies, in Ajmer and Kolkata, were entirely preventable and mitigation could have been far more efficient. Many of India’s cities and inner cities of metropolises continue to see high volume business activities but their safety features are outdated. They do not comply with current fire and structural safety norms. Fire escapes and emergency exits are non-existent and the structures use highly flammable materials from another era. Unlike other metropolises that have seen some redevelopment of inner cities in recent decades, Kolkata seems to have missed that phase. Immediate solutions can include maintaining low-height sidewalks to allow fire engines to get closer to building fronts, retrofitting fire retardant materials in buildings, and considering the use of retractable metallic staircases to serve as emergency escapes outside the buildings after careful evaluation by fire safety authorities. There is also a case for equipping firefighting teams with more breathing apparatuses so more personnel can rescue people in distress in such structures since their limited access routes may be smoke-filled.\r Published - May 03, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        fire\n                    \n                            /                      \n                        \n                        Kolkata\n                    \n                            /                      \n                        \n                        hospital and clinic\n                    \n                            /                      \n                        \n                        disaster management\n                    \n                            /                      \n                        \n                        Rajasthan\n                    \n                            /                      \n                        \n                        West Bengal",
        "headline_1": "​Fire and smoke: On fire-safety norms and buildings in India",
        "headline_2": "Old structures in cities must be made fire-safety compliant",
        "link": "https://www.thehindu.com/opinion/editorial/fire-and-smoke-on-fire-safety-norms-and-buildings-in-india/article69530942.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "03-05-2025"
    },
    {
        "full_article": "After painstaking negotiations, marked by inflammatory exchanges, Washington and Kyiv have signed an agreement that would grant the U.S. access to Ukraine’s critical mineral and oil and gas resources through a joint investment fund. Ukraine has claimed that it would lead to an equal economic partnership, while its actual impact remains uncertain. The idea of a minerals deal was proposed by Ukrainian President Volodymyr Zelenskyy last year to the Biden administration as part of his “victory plan”. His pitch was to open up Ukraine’s vast untapped critical minerals resources (which include lithium, graphite, uranium and titanium, besides rare earth minerals) in exchange for continued American military support and security guarantees. After Donald Trump assumed the presidency, he supported a minerals deal, but an entirely different one. He insisted that Kyiv repay the billions of dollars provided as military and economic assistance during the war by granting U.S. companies access to Ukraine’s resources. At one point, the disagreement escalated into a public spat at the Oval Office between Mr. Zelenskyy and Mr. Trump. But both sides pressed ahead, which culminated in the April 30 deal.For Ukraine, the agreement represents an improvement over Mr. Trump’s previous proposals. There is no reference to aid as debt in the fine print. Under the deal, the United States-Ukraine Reconstruction Investment Fund will finance extraction projects in Ukraine’s resources. Kyiv will share 50% of the revenues from these projects towards the fund. While the agreement omits any reference to past U.S. aid, future American assistance will be considered as capital contributions to the fund — Ukraine will have to repay future aid through resource revenues. More importantly, although Mr. Zelenskyy originally envisioned a minerals deal as a pathway to securing security guarantees from the U.S., the final agreement offers no explicit American security commitments to Kyiv. Ukrainian officials have portrayed the deal, which needs to be ratified by Parliament, as a win-win. But it actually underscores Kyiv’s growing vulnerabilities in a war that shows no sign of abating. Mr. Zelenskyy and his generals are aware that if American support dries up, their embattled forces would be in peril. And Mr. Trump has already rejected Ukraine’s most pressing demand — firm security guarantees. Facing limited options, Ukraine has signed the agreement in the hope that it would at least ensure continued flow of U.S. military assistance in the form of U.S. investments to the fund. But Mr. Zelenskyy’s minerals gamble will pay off only if the Trump administration stays committed to helping end the war. If the war drags on, with Russia forces continuing to advance in the east, the minerals deal would mean little for Ukraine’s security. Published - May 03, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Ukraine\n                    \n                            /                      \n                        \n                        critical minerals\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        rare earths\n                    \n                            /                      \n                        \n                        defence\n                    \n                            /                      \n                        \n                        investments",
        "headline_1": "​Minerals gamble: On the U.S.-Ukraine mineral deal",
        "headline_2": "The pact with the U.S. does little for Ukraine’s security",
        "link": "https://www.thehindu.com/opinion/editorial/minerals-gamble-on-the-us-ukraine-mineral-deal/article69530900.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "03-05-2025"
    },
    {
        "full_article": "Some protesters are seen and heard, others swatted\nThe number 50501 may mean nothing to you, or suggest a pair of jeans, or an internet error, but it made a splash in America on Thursday, which happened to be May Day, a.k.a. Labour Day. Reports say thousands of protests were held all across, from NYC to LA, under the 50501 banner, which is short for ‘50 protests, 50 states, 1 movement’. Typical of modern movements, Fifty-Fifty-One started on social media, and has been aiming at Trump’s policies since Feb. For May 1, the theme was ‘Stop the Billionaire Takeover’, but all causes – tariffs to deportations – were aired. Such mobilisation is not unheard of in America, which was the battleground for an eight-hour workday about 150 years ago. But it’s unusual now when worker unionisation is down to 11%.\nThe irony is that the mecca of capitalism, America, is re-embracing May Day while communist China cares two hoots about workers’ rights. Part of its vaunted efficiency is down to scale, but 12-hour workdays – the ‘996’ culture – and cut-price wages also make American manufacturing uncompetitive. Chinese workers should learn from Trump, who, in his first term, was said to reserve three hours every morning for TV, calls and tweeting, and regularly take “executive time” for more of the same through the day. Meanwhile, Trump might itch to emulate Erdogan, who marked May Day with a lockdown in Taksim Square and a crackdown on protesters. Hopefully, he wouldn’t.\n\n",
        "headline_1": "May Day minutes",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/may-day-minutes/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-05-2025"
    },
    {
        "full_article": "On humanity’s surrender to #Virtuality\nThink of the Bible’s opening verse, “God said let there be light and there was light.” The original act of creation here is communication. Superbloom: How Technologies of Connection Tear Us Apart by Nicholas Carr is not just about how modern communication has failed us. It’s also a reminder that it’s with words we bring ourselves into being and also our world.\nWhen words began to be translated into codes and human messengers got replaced by mechanical ones, efficiency gains in communication were widely viewed with a sentimental lens. Tellingly, the 1865 International Telegraph Conference called itself “a veritable Peace Congress”. \nIn the decades to come, radio and telephone acolytes similarly thought these new technologies would bring nations together and end war. That WW I onwards the 20th century would be the bloodiest one ever proved, the book says, that we had been telling ourselves lies about communication – and about ourselves. Still, with the internet, the smartphone, social media, LLMs, again and again the peace fallacy, as much as the ‘democratisation’ one, would resurface.\nBut think back to the email exchanges in the 1998 romantic comedy You’ve Got Mail – those were expansive, intimate and heartfelt. There was a continuity with the way letters, once upon a time, sustained and deepened relationships. John Donne said, “More than kisses, letters mingle souls.” \nThen our inboxes got overwhelmed. IMs and textspeak happened. In 2006 Facebook introduced News Feed, which replaced personal agency in seeking info about each other with machine agency. We barely flinched. In 2004 when Google introduced Gmail service, this new mailman announced he would read all our mail and use this data however he wished. We said, cool. \nBy now we’ve surrendered so much agency that ‘digital personal assistants’ are less gofer, more doppelganger. Except, they super multiply our ‘connections’ even as social media blurs conversation and broadcasting. What the book explains is the tragedy of communication, where too much of it begins to undermine the very social and personal qualities we look to it to foster.\nA half century ago, Baudrillard coined the term ‘hyperreality’ to describe an existence governed less by reality than by code and simulation. The poppy superbloom from which the book takes its name was a 2019 LA flowering that millions of social media feeds turned into frenzied, farcical mob-like mass mimicry. As if the superbloom never happened and only #superbloom did. \nThe more rapid and shallow our processing of information becomes, the more we depend on stereotypes, which we then retweet, like, share, rebroadcast and amplify. Repetition also becomes a proxy for facticity. \nThis illusory truth effect is what ‘put power into the hands of the people’ sentimentalists did not anticipate. What increases engagement is good business for the tech companies. But don’t just blame the algorithmically generated echo chambers and filter bubbles. Research shows that even a more balanced info diet can stimulate greater partisanship. \nBecause people experience information from outside their echo chamber as an attack on their identity. Because opinions emerge from affiliation, not vice versa. They’re a byproduct of tribal allegiance. Group identity is rooted in emotion, not reason, the book says.\nHow can the real world compete against the programmed delights of the virtual? How can we  resist immaterialism? Let’s begin with a walk or penning a letter. Without the smartphone.\n\n",
        "headline_1": "When the real can’t compete",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/when-the-real-cant-compete/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-05-2025"
    },
    {
        "full_article": "He likely likes controversies ’coz it’s good for business\nDelhi HC said of Ramdev that he “is not in anyone’s control” and that “he lives in his own world”. The judge was earlier aghast at Ramdev’s ads, saying he couldn’t “believe my eyes and ears when I saw this (the videos)”. Ramdev’s company dragged its feet on following court’s orders but finally rushed in to do as required – an apology and promise of no more “such” ads. YouTube still had the ads apparently on a “private” mode for his subscribers. And Delhi HC will check out their compliance of its orders on May 9.\nBut does the baba entrenched in the material worlds of politics and business really inhabit his own world, as HC said? Not really. A more astute businessman than his saffron robes let on, he gambled on waging a new ‘cola’ war with his communally charged attack on a Hamdard product. Reality is, Ramdev can barely wrench himself from the headlines for too long. With full mindfulness, he breezily walks in and out of controversies and court cases. He has little compunction about making religiously coloured statements, getting hauled up in court, or having his company dish out apologies after going slow on compliance. Only for him to do something anew. The company has almost 30 cases against it, mostly for misleading ads. The Supreme Court last Aug closed a contempt case following an apology.\nRamdev knows a tinge of saffron can dish up a winner. But dollops of it can leave a bitter aftertaste in the foods, medicines and consumer goods sectors his business straddles. The brouhaha is all free publicity, and likely only enhances his brand. He also believes he’s likely to wriggle out each time, legally, none the worse for wear. That’s probably the part where that fitness routine kicks in.\n\n",
        "headline_1": "Ramdev’s world",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/ramdevs-world/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-05-2025"
    },
    {
        "full_article": "The business logic behind Ukraine-US minerals pact allows New Delhi to plan a better logistics play for the many products it buys from Kyiv. Ukrainian Black Sea ports will be a vital link\nLike it or not, Trump’s geopolitical business schemes, from Gaza to Ukraine, confirm that the order of international law no longer holds water, and that the world needs new forms of security.\n\nPutin’s conquest campaign in Ukraine laid bare the helplessness of UN and the futility of old international charters, agreements and treaties in face of brute force.\nRead the full story on TOI+.\n\n",
        "headline_1": "It’s a deal, for India too",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/its-a-deal-for-india-too/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-05-2025"
    },
    {
        "full_article": "Quite in line with Chief Adviser Muhammad Yunus's warning about rumours being \"weaponised\" to destabilise the country, we have seen how unrelenting, wide-ranging, and destabilising such rumours have been since the July uprising. This was fittingly reflected in the figures of 2024, which saw misinformation rise by 58 percent compared to 2023, and that momentum has continued into 2025. After detecting 268 instances of misinformation in February and 298 in March, Rumour Scanner, a fact-checking organisation, has now reported 296 cases in April. The persistent nature of those behind this campaign is deeply disturbing, as is the way they continue to find a fertile ground in post-uprising Bangladesh.\nLike in previous months, April's misinformation was dominated by national and political themes, with 101 and 95 cases, respectively. Religious, international, and communal topics also featured prominently. Notably, 16 instances of communal misinformation were identified, some originating from Indian accounts, continuing a troubling trend of cross-border disinformation campaigns. Meanwhile, social media platforms remain the primary vectors for spreading such falsehoods. For example, Facebook, the favoured social media platform in Bangladesh, alone accounted for 276 cases, followed by YouTube (54), Instagram (48), X (formerly Twitter, 44), and TikTok (24). Alarmingly, even mainstream media outlets were implicated in 15 separate instances of disseminating misinformation.\n\nParticularly concerning has been the targeting of key political and government figures, which aligns with what Prof Yunus has alluded to as the machinations of the \"defeated side\" intent on manipulating narratives and undermining trust in institutions. Yunus himself was the subject of 29 misinformation cases. Other advisers, including Asif Nazrul and Syeda Rizwana Hasan, were also targeted. Political parties and security forces were not spared either.\nRumour Scanner has also shed light on the mediums being used for this purpose: 138 cases were text-based, 105 involved videos, and 53 were image-centric. Among these, 179 were completely false, 66 misleading, and 48 distorted, but all generally constituting misinformation. Particularly concerning has been the targeting of key political and government figures, which aligns with what Prof Yunus has alluded to as the machinations of the \"defeated side\" intent on manipulating narratives and undermining trust in institutions. Yunus himself was the subject of 29 misinformation cases. Other advisers, including Asif Nazrul and Syeda Rizwana Hasan, were also targeted. Political parties and security forces were not spared either. Among the parties, BNP was the most affected, followed by Jamaat-e-Islami and National Citizen Party (NCP).\nWe don't need to remind anyone how hurtful this campaign has been, and it will only intensify as we approach the upcoming elections. This calls for heightened awareness and vigilance from the government and political institutions alike. The press, too, has a huge responsibility as it can stand guard against the circulation of doctored or misleading content by properly informing the citizens. But in the end, no initiative will be enough unless the citizens themselves become aware of the threat. This requires strengthening digital literacy across all demographics so that people can be empowered to critically assess the information they encounter online. There should be countrywide educational initiatives focusing on identifying credible sources and understanding the hallmarks of misinformation.\n",
        "headline_1": "Fight misinformation as a matter of urgency",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/fight-misinformation-matter-urgency-3885241",
        "news_paper_name": "The Daily Star",
        "publish_date": "03-05-2025"
    },
    {
        "full_article": "If you haven't watched the show yet, spoilers ahead!\nThe clock strikes six in the morning. A large team of local police barge into the house of 13-year-old Jamie Miller. He is accused of murdering a girl named Katie the night before. At the crack of dawn, his father, mother, and elder sister watch in shock as the police ransack their entire house and take Jamie into custody.\nJamie firmly denies committing any crime. He begs his father to save him. His bewildered parents cannot believe that their well-behaved 13-year-old lad could have killed someone. They try to explain to the police that this has to be a mistake—that they have the wrong house.\nHowever, to the shock of Jamie's parents at the police station, the police present CCTV footage collected from various streets and shops. The footage shows Jamie following Katie after nine o'clock the night before and eventually attacking her. Katie was stabbed at least seven times. There is no doubt: Jamie is the culprit. Now, the police want to know why he committed the murder and where he hid the knife.\nBy now, you must have realised I am talking about Adolescence, the four-episode Netflix mini-series released in March that has taken the world by storm. This is not your typical thriller or murder mystery. It's not the kind of story where the audience is left wondering who the killer is, sitting on the edge of their seats in suspense.\nInstead, we already know who committed the murder very early in the series. But what follows is an extraordinary attempt by the storyteller and director to dive deep into the mind of a teenager and unravel his psychology bit by bit.\nTeen gangs are a terrifying crisis worldwide. In 2022 alone, nearly 550,000 juvenile crime cases were recorded in the United States. The situation is similar in many other countries, including Bangladesh. The struggles of adolescence have always existed, but the unrestricted flow of internet content and the overwhelming influence of social media have intensified the issue. The internet often has a greater impact on teenagers' minds than their school, family, or anyone else. As a result, we witness how an ordinary boy or girl gradually transforms into someone unrecognisable, even to his or her families.\nJamie's father could not understand how the child who once sat at the bottom of the stairs sketching for hours could become so difficult to comprehend. Yes, after facing job issues, he could not spend much time with his family. He would leave in the morning and return home late at night. But hasn't Jamie's mother been there? If Jamie's elder sister could grow up to be so responsible, why couldn't he?\nThis is precisely the adolescent crisis that the director tried to address. In the third episode, during Jamie's conversation with a psychologist, we gradually uncover his mistrust, suspicion, and a lack of self-confidence. We learn that, like other teenagers, 13-year-old Jamie also wanted to experience love. He selectively follows various models on Instagram. Although he isn't very active on Instagram, he is always lurking there. However, he believes he is ugly and that no girl would ever like him. So, when a topless photo of his classmate Katie started circulating, he tried to take advantage of the situation.\nJamie openly admits that he is attracted to girls, that he wants to touch someone if given the opportunity. He even shares how he felt when a girl once touched his lower body. But when the psychologist, Briony, asks questions that he does not like, he becomes aggressive, shouting and breaking whatever he could find nearby. All he wants is for someone to listen to him attentively, without any counterquestions, and to say, \"I am here for you.\"\nTowards the end of their conversation, when Briony tells Jamie that their session is over, he becomes furious. He has just started relying on her. He has just begun speaking. Why is she leaving after listening to him so attentively? So, when he asks her, \"Do you like me?\", I believe every viewer watching this series felt a deep ache in their chest.\nThis series starkly highlights toxic masculinity and the crisis of modern male identity. The core theme of this series is incel culture.\nIncel, or \"involuntary celibate,\" refers to men who, despite desiring romantic relationships, fail to find partners. As a result, they are ridiculed, which further poisons their mindset. Such young men form communities on platforms like Instagram, reinforcing their shared frustrations. They believe that \"80 percent of women are only attracted to the top 20 percent of men,\" who possess \"looks-based hierarchy,\" meaning men must be attractive and wealthy to be desirable. As they face continuous rejection, they become entangled in criminal activities. They systematically spread misogyny and racism. Jamie and his friends fall into this pattern in the show. They are willing to do anything to prove their existence.\nThese teenagers communicate in the language of emojis. In the second episode, Adam, the son of the police officer in charge of Jamie's case, also a student of the same school as him, explains the meaning of various emojis to his father. For instance, when something is liked, people use a heart emoji. But did you know that different colours of heart emojis have distinct meanings? A red heart means love. The purple heart means sexual desire. A yellow heart means interest, as in asking if the other person is also interested. A pink heart means interested, but only sexually. An orange heart means reassurance, as in saying, \"Don't worry, everything will be fine.\"\nCan you imagine? How can a middle-aged mother keep up with all of this? Her child is growing up and no longer enjoys painting. He doesn't like anyone's company anymore. He locks himself in his room. How will she know what he is doing behind that closed door? In the fourth episode, Jamie's mother regrets, \"If only I had paid more attention.\"\nThe four-episode series unfolds as follows: the first episode shows Jamie's arrest and police interrogation, the second explores his school life, the third focuses on his conversations with the psychologist in prison, and the final episode depicts the unbearable turmoil a family goes through when their child turns into a criminal.\nThe third episode has sparked discussions worldwide. The second episode provides a glimpse into how difficult it is for schools to handle groups of teenagers. It reveals how, just two days after a classmate is brutally murdered, students show no empathy. It also offers insight into how extreme bullying can be.\nThis Netflix series has shaken the world. The prime minister of England stated that internet-driven violence must be taken seriously. He even instructed all schools in England to screen this series.\nIf you have children over 10 years old, I think you must watch this series. If possible, watch it together with your child. Try to watch the third episode multiple times.\nAnd no matter what your child is going through, never forget to say, \"I am here for you.\"\nIMDb Rating: 8.3.\nMy Rating: 9.5/10.\nMohammed Norul Alam Raju is a researcher and development activist pursuing higher studies in development policy and management in Belgium. He can be contacted at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our submission guidelines.\n \n",
        "headline_1": "Netflix’s ‘Adolescence’ is a wake-up call on online violence",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/netflixs-adolescence-wake-call-online-violence-3885121",
        "news_paper_name": "The Daily Star",
        "publish_date": "03-05-2025"
    },
    {
        "full_article": "When health fails, hope fades. Whether in a city factory or on a remote river island, when the body gives way, when pain becomes routine and healing remains out of reach, everything else collapses.\nLivelihood, learning, dignity, even the will to dream—this is the daily truth for millions of workers around the world. Sometimes it is geography, people surviving on shifting chars or cyclone-battered coastlines where no doctor arrives. Sometimes it is poverty, when a ready-made garment (RMG) worker must choose between medicine and feeding her family. Sometimes it is deeper still, a systemic absence of nutrition, safety, rest, and knowledge. Often, it is all of the above, together, compounding each other into crisis. Without health, labour cannot thrive. Without labour, societies cannot stand.\nHealth is not a privilege. It is the first right of every worker. It is the foundation upon which livelihoods are built.\nWhen malnutrition, unsafe working conditions, and untreated illnesses persist, industries falter, communities suffer, and futures collapse. Maternal health is especially critical, for it is the worker's body that builds not only today's economy, but tomorrow's generations. In climate frontline regions, where cyclones strike and salinity poisons the land, poverty deepens and workers' bodies bear the heaviest toll. To protect labour, we must first protect life, through nutrition, sanitation, vaccination, safety, and dignity from birth onward.\nEducation is also connected to health. A literate worker knows when a wound is dangerous, when rest is essential, when conditions are unjust. A young girl forced into early marriage is denied not only childhood, but the health and opportunity of a life fully lived. In communities where literacy is scarce, illness spreads faster, and accidents go untreated. Literacy enables hygiene, family planning, and safety awareness, the essentials for a resilient workforce.\nThen comes design, often overlooked, yet deeply consequential.\nA missing handrail on a stairwell can cripple a factory worker. Lack of sanitation spreads disease. Cramped, poorly ventilated workshops expose workers to chronic illness. From flood-resilient plinths to solar-powered villages, from safe workspaces to mobile health clinics, designing for human dignity is not a luxury. It is a necessity. Disaster preparedness, too, must be built into every system. Workers at the margins cannot afford poor solutions.\nFriendship's journey began over 23 years ago in the chars of Bangladesh, where healthcare was not just absent, but unimaginable. We started with a single hospital ship, a small team, and no blueprint. Everyone did everything, from translating prescriptions to washing hospital sheets. We learnt by doing. The ship was a lifeline, but it was only the beginning.\n\nMay we build a future where no worker must sacrifice their body to earn their bread, and where every hand that builds the world is valued, protected, and honoured.\nSatellite clinics followed. Then local women were trained as community medic-aides, bringing basic healthcare to the doorstep. Today, the system includes seven hospital ships, two land-based hospitals, over 750 clinics, and a network of 800 community medics, powered by mobile technology that ensures care even in the most remote huts.\nBehind every number, there is a face: a farmer who can now till his land after cataract surgery; a young woman, once paralysed by preventable illness, now running her own small business; a child with a cleft palate now smiling at school.\nThese are not exceptions. They are the quiet revolutions that define real progress.\nAnd this journey was never walked alone. Across the years, workers, volunteers, medical experts, donors, and community leaders joined hands. They saw not helplessness, but resilience. They came not to give charity, but to build solidarity.\nBecause ultimately, health is the thread. It runs through every right, every livelihood, every aspiration.\nOn this May Day, let us remember that the dignity of work begins with the dignity of the worker. And dignity begins with health—not as a luxury, not as a hope, but as a guarantee.\nMay we build a future where no worker must sacrifice their body to earn their bread, and where every hand that builds the world is valued, protected, and honoured.\nRuna Khan is founder and executive director of Friendship.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our submission guidelines.\n \n",
        "headline_1": "The hands that build the world must be protected",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-hands-build-the-world-must-be-protected-3884771",
        "news_paper_name": "The Daily Star",
        "publish_date": "03-05-2025"
    },
    {
        "full_article": "It is unfortunate that the interim government's directive to remove unfit and outdated vehicles from the streets has received little response from the owners. Reportedly, in late October last year, the government decided to remove expired vehicles from the roads, setting a six-month deadline for compliance. In line with this directive, the Bangladesh Road Transport Authority (BRTA) issued a public notice announcing the removal of buses over 20 years old and trucks/covered vans over 25 years old from Dhaka city. Yet, with the deadline expiring by May, there has been minimal interest from owners in complying with the order.\n\nAccording to the BRTA, over 75,000 buses, minibuses, trucks, covered vans, and tankers exceeded their operational lifespan across the country. One in five buses operated by private companies in Dhaka have no valid fitness certificate. These figures are deeply concerning as outdated and unfit vehicles contribute significantly to road accidents, environmental pollution, and overall chaos in the transport sector. A 2019 study revealed that motor vehicles account for 10.4 percent of air pollution in Dhaka, with most exceeding permissible emission limits. Therefore, the urgency of removing unfit vehicles cannot be overstated. However, the challenge lies in ensuring compliance from transport owners and workers.\n\nDuring the Awami League's rule, we saw how similar removal initiatives failed due to pressure from transport owners' and workers' associations, which were largely controlled by AL-affiliated politicians. But now that a non-political government is in charge, we expect to see a positive change. The adviser to the Ministry of Road Transport and Bridges has stated that after the expiry of deadline, outdated vehicles found operating on roads will be seized and destroyed. But without the owners' cooperation, this will not be easy. The government must, therefore, move strategically.\n\nWhile its offer to assist owners in securing bank loans for new vehicles is a step in the right direction, additional incentives may be needed to encourage compliance. Also, clear directives from the Bangladesh Bank regarding easy access to loans could further motivate owners to replace their old vehicles. Moreover, given how the transport sector is run, political support will be crucial. Since July, most transport associations have been controlled by BNP-linked leaders and activists. Therefore, support from the BNP leadership is essential for the success of this drive.\nOver the decades, successive governments have made lofty promises to reform the transport sector, with little meaningful action. This time, we expect concrete results. The interim government must not fail to deliver on this crucial issue.\n",
        "headline_1": "Remove expired vehicles from the streets",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/remove-expired-vehicles-the-streets-3882921",
        "news_paper_name": "The Daily Star",
        "publish_date": "03-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 03, 2025 00:00:00  \n\nA lack of coordination among stakeholders, absence of transparency as well as inadequacy of information about the actual state of production, storage, transportation and distribution--- in short, supply chain of the country's major agricultural produce potato--- lie behind its market volatility. This year, for instance, the potato farmers had a bumper harvest. But far from making them happy, the abundance of potato is now the cause of their distress. Having no storage facility of their own, they cannot hold their perishable crop for long to get a better price. The cold storage owners, on the other hand, are either asking higher storage fees or refusing to take their cargo for want of space. In consequence, they are forced to sell their produce to the middlemen at throwaway prices or dumping those anywhere to rot. Farmers surviving the shock, would not go for potato cultivation in the near future. This will be bad news for all the stakeholders concerned in the potato market including, of course, the consumers. The end result is that the cycle of oversupply and scarcity of this farm produce with its attendant market volatility continues.\nIn an attempt to get around this persistent crisis in the potato market, the government, the Directorate of National Consumers' Rights Protection (DNCRP), to be particular, reportedly, held a meeting of the stakeholders including cold storage owners' body, administrators of the major potato growing districts and the government agencies involved with production and marketing of potato, namely, the Department of Agricultural Extension (DAE), the Department of Agricultural Marketing (DAM) and the consumer rights body, the Consumer Association of Bangladesh (CAB). As expected, the issues that figured prominently in the meeting included ensuring availability of the production data on potato in real time and sharing those among all the stakeholders based on which the ministry concerned could correctly assess the demand and supply situation of the farm produce. Obviously, that would help adopting appropriate policy about potato such as its production, import, export or planning intervention to stabilise the market when necessary. \nEssentially, the meeting involved instructions to the district administrations to ensure that all the cold storage owners come under the national body, assess district level production of potato and capacity of existing cold storages, modernising data management in collaboration with the cold storage owners' body and so on. But as could be gathered, what the stakeholders' meeting did not discuss was the adversity that the potato growers are currently facing and what measures the government can take to protect them so they might ride out the present crisis and plan for the future.\nWhat is of concern here is that potato farmers are at the receiving end. Farmers alone cannot be blamed for the present bumper harvest of potato. The department of agricultural extension and the marketing wing cannot shrug off their responsibilities. Agriculture ministry's departments concerned are supposed to guide farmers properly and should have been able to predict the prospect of this years' potato harvest vis-à-vis storage facilities. It is exactly here the government's urgent intervention becomes necessary. The government needs to develop its own storage facility so that it could buy the excess production at a fair price to protect them and store potatoes so bought. At the same time, arrangements should be there to help farmers build their own storage facilities according to UN/FAO supplied design. A staple, potato is also part of the country's food security. So, the government needs to design a right strategy for conserving as well as marketing potato.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Prioritising potato,  its growers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/prioritising-potato-its-growers-1746199929",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       May 03, 2025 00:00:00  \n\nDuring Donald Trump's first term as president, his then-senior adviser Kellyanne Conway famously introduced the term \"alternative facts\" to justify a false claim about the crowd size at Trump's inauguration. The phrase was condemned by the US media which saw it as a dangerous attempt to legitimise falsehood as truth. The kind of deliberate untruth that once sparked outrage has since become alarmingly commonplace. Today, falsehoods in their myriad forms ---as rumour, disinformation or outright fabrication--- are dominating the public sphere. Unlike in the past, when false claims spread slowly through words of mouth, today's digital platforms enable the instantaneous and viral dissemination of disinformation. The dual forces of information technology revolution and social media's fast expansion have fundamentally transformed the nature and scale of this phenomenon. Social media now amplify falsehoods on an unprecedented scale, blurring the lines between reality and fabrication. As the old adage goes, a lie travels halfway around the world before the truth puts on its shoes, but in today's world, it circles the globe several times over before the truth even begins the race. \nThe explosion of disinformation becomes particularly evident in volatile geopolitical contexts. For instance, in Bangladesh following the July-August revolution social media platforms were inundated with coordinated campaigns of rumour and disinformation. Rumour Scanner Bangladesh documented 800 distinct false claims in just the first three months of 2025. Many of these appeared strategically crafted to boost morale of supporters of the former ruling party, often through coordinated efforts. However, a significant challenge arises when these narratives, no matter how improbable, are readily accepted by grassroots supporters because they align with their pre-existing beliefs or biases. One such example took place in Noakhali's Chatkhil, where some Jubo League activists staged a public protest in January after online rumours claimed that chief adviser Dr Muhammad Yunus had resigned and fled the country. The demonstrators were later arrested. This goes to show how rumours can lead to real-world actions and consequences. \nDisinformation has become so pervasive nowadays that it sometimes seems as though nearly everyone is complicit in it. Even influential newspapers like The New York Times have not been immune. In 2003, prior to the US invasion of Iraq which was largely justified by claims that Iraq possessed Weapons of Mass Destruction (WMD), New York Times journalist Judith Miller published a series of reports on Iraq's alleged WMD programme. These stories were used by the Bush administration to gain public support for the war but later revealed to be based on fabricated intelligence. Although Miller was forced to resign in 2005, by then the damage was already done as her false reporting contributed to a conflict that resulted in over a million Iraqi deaths. \nThe erosion of public trust in mainstream media is often cited as a contributing factor behind the growing appeal of social media. Traditional outlets are increasingly viewed as compromised due to political bias or reluctance to investigate critical issues or self-censorship for fear of reprisal. This trust vacuum has been filled by social media platforms, where the sheer volume of easily accessible, often unverified content exposes users to rampant misinformation. A recent viral video in Bangladesh exemplifies how false narratives in social media can take hold and sway public sentiment. The video showed an elderly man committing suicide by jumping in front of a train. Facebook posts accompanying the footage claimed he had been thrown out of his home by ungrateful sons after his wife's death. Outrage and condemnation followed. However, later it emerged that his wife was alive and his death was due to mounting debt, not for family issues. This case is just one among many such emotionally-charged false stories that rapidly circulate online and continue to mislead vast numbers of people. \nWhile this story might have had the plausibility to be true given the socio-economic reality, many rumours and misinformation circulating online do not. Yet they are still believed by many. A major part of the problem stems from the largely unregulated nature of major social media platforms like facebook. Users can post and share almost anything, often with no consequences. Worse, concerns have been raised about the platforms' own actions. Meta (facebook/Instagram) has already faced widespread criticism for suppressing pro-Palestine content even though they did not violate platform policies. When the very conduits of information are preventing the truth from coming out, how can users be expected to separate fact from falsehood?\nIn Bangladesh, the minority issue has historically been a fertile ground for disinformation. False reports and doctored images have a track record of inciting violence against minority communities. Now, a concerning trend is observed after the regime change where false information about attacks on minorities is being amplified on social media and in segments of the Indian press even when no such incidents have occurred. Often, unrelated images and videos are publicised online as supposed evidence of violence to provoke outrage. This not only sours bilateral relations but also plays directly into the hands of those who benefit from communal tension.\nThe arrival of artificial intelligence technology has further complicated the landscape. It is now easier than ever to fabricate convincing photos, videos, and audio recordings. Deepfake technology in particular blurs the line between reality and fiction. While some of these fabrications are easy to spot, others are sophisticated enough to fool even the most perceptive audiences. \nFake news is now a global epidemic. However, despite the pessimism surrounding disinformation and rumour, there remains a reason for cautious optimism. People do not enjoy being treated like fools repeatedly. No matter how persistently vested quarters push falsehood, the truth eventually comes out. When people find themselves deceived by fake news one too many times, they may stop ignoring their common sense, the evidence of their senses and experiences. Ultimately, developing mass awareness is the only real way to fight false information.\nshoeb434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Truth on trial in the age of disinformation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/truth-on-trial-in-the-age-of-disinformation-1746199995",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 03, 2025 00:00:00  \n\nThe rampant and unregulated use of loudspeakers and microphones for unsolicited entertainment has made urban life increasingly unbearable. Particularly distressing is the disruption of nighttime tranquility, when loud music and shouting shatter the silence, causing immense suffering to children, students, patients, and working individuals alike. Disturbingly, this nuisance is not limited to night hours; even during the day, without any significant occasion, the unchecked use of loudspeakers and microphones continues. In the name of entertainment, the irresponsible actions of a few often cross the boundaries of personal freedom, infringing on the peace and fundamental rights of many.\nThis ongoing disturbance is severely affecting the social fabric and natural rhythm of urban life. Scientific studies have shown that exposure to loud sounds can have serious adverse effects on physical and mental health. Excessive noise leads to insomnia, high blood pressure, mental stress, hearing loss, and an increased risk of heart disease. It also hinders brain development in children and worsens the conditions of the elderly and patients. Disturbed sleep cycles, caused by nighttime noise, directly impact productivity, concentration and the overall quality of life. If left unchecked, this problem will pose a grave threat to both public health and social stability.\nProgga Das\nStudent, Department of Economics\nEden Mohila College\nproggadas2005@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Invasive loudspeaker",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/invasive-loudspeaker-1746200018",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 03, 2025 00:00:00  \n\nStorytelling is more than just an act of sharing tales-it is a powerful art form that connects, inspires and educates. Like a speaker addressing a captivated audience, the storyteller's role is to engage minds and hearts through meaningful narratives. At its core, storytelling is not only about entertainment but about conveying messages that resonate, motivate, and foster understanding.\nA well-told story relies on essential elements such as plot, character development, and, most importantly, the speaker's ability to emotionally connect with the audience. It is no surprise that many organisations today are urged to cultivate a storytelling culture within their learning and communication practices.\nWe all know the structure of PowerPoint presentations, where bullet points are used to highlight key ideas. Similarly, storytelling uses words and details carefully chosen to leave a lasting impression. When someone listens to a story, various parts of the brain become active. Neuroscience tells us that during storytelling, chemicals like cortisol, dopamine, and oxytocin are released. Cortisol helps us remember important points, dopamine influences emotional responses, and oxytocin fosters a sense of trust and connection. These biological reactions show that storytelling is both an art and a science.\nStorytelling also serves different purposes in different contexts. A military officer might use it to boost morale among troops, while in a business meeting, stories may help explain data, strategy, or corporate values in a more relatable way. In each case, the content must be rich, relevant, and emotionally engaging to capture the audience's attention.\nBeyond all, storytelling is about making meaning. It allows us to see the world through the eyes of others, helping us to learn and grow. As listeners, we form bonds with the speaker and with the content being shared. As speakers, we gain the opportunity to shape thoughts, inspire action, and build understanding.\nIn today's fast-paced world, where communication often feels fragmented and rushed, the art of storytelling reminds us of the power of human connection. It is a vital tool not only for learning but also for bridging gaps in thought, emotion, and experience.\nMd Tousif Raihan \nStudent \nDepartment of Criminology and Police Science\nUniversity of Chittagong\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The art of storytelling",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-art-of-storytelling-1746200040",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-05-2025"
    }
]