[
    {
        "full_article": "Three bills, including one for a constitutional amendment, introduced hurriedly by the Centre towards the end of the Parliament session, are purportedly meant to improve probity and accountability for the Prime Minister, Chief Ministers and Ministers. They will lose their position if any of them is detained by a law enforcement agency in connection with an offence that is punishable with imprisonment of five years or more. Upon acquittal, they could return. Any objective observer would be sceptical of the stated intent of these proposals. The concern expressed by the Opposition and legal minds that the proposals open a new avenue for concentration of power with the Centre is legitimate. The claim that the proposed legal regime applies equally to the Prime Minister too is weak, considering the fact that all investigative agencies are under the administrative control of the Centre. No central agency will ever detain a Prime Minister; but they have already arrested several Opposition Chief Ministers. When viewed against the backdrop of the pattern of the functioning of central agencies, such as the Enforcement Directorate and the Central Bureau of Investigation, the real intent of the new proposals by the Centre appears to be to empower itself with sweeping and arbitrary powers, which can be used against political rivals.The police are eager to arrest. The increasing difficulty in obtaining bail due to harsh provisions in laws such as the Prevention of Money Laundering Act and Unlawful Activities Prevention Act, as well as a judicial diffidence in granting bail is making liberty disturbingly dispensable. Corruption is dangerous for a society, but combating it cannot be at the cost of the principles of justice. Corruption prosecutions have attained an unmistakable political character in recent years. The pattern of an individual being a target of investigation when in the Opposition, but no longer once he or she switches sides to the Bharatiya Janata Party is noticeable. If the new proposals are enacted into law, an elected official can be removed from office by mere police action, and without a fair trial, not to mention a judicial conviction. Considering the certainty that this will, in practice, only apply to State/Union Territory governments, it will also be a violation of federal principles. It is not a mere coincidence that the Centre is seeking to invest in State Governors a veto over any and all decisions of elected legislatures. The existing laws provide for the removal from office of elected officials who are convicted in cases as defined in the new proposals. These proposals amount to holding someone guilty until proven innocent, and also dishonouring the verdict of the people who elected them.READ MORE Published - August 22, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        prison\n                    \n                            /                      \n                        \n                        crime\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        arrest\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Governor\n                    \n                            /                      \n                        \n                        corruption & bribery",
        "headline_1": "​Lawfare politics: On the bills for political probity",
        "headline_2": "Federal principles must not be undermined in the name of improving probity",
        "link": "https://www.thehindu.com/opinion/editorial/lawfare-politics-on-the-bills-for-political-probity/article69960989.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-08-2025"
    },
    {
        "full_article": "Ever since its inception in 1984, the Asia Cup has often been caught in the diplomatic crossfire which engulfs all talk pertaining to India and Pakistan. The imminent one commencing in the United Arab Emirates on September 9 is no exception. A fiery debate has commenced over whether India should play against Pakistan following the Pahalgam massacre and the resultant Operation Sindoor exercise across the border. The decision not to play bilaterals, but okaying tournaments, makes no sense. While the Board of Control for Cricket in India deals with the political slugfest, the Indian team was announced at a rain-battered Mumbai on Tuesday (August 19, 2025). With Suryakumar Yadav leading the unit, the surprise quotient rose when Test skipper Shubman Gill was roped in as the vice-captain. He had done a similar venture earlier under Suryakumar before being shunted out. Gill, who rose to Test captaincy in the wake of Rohit Sharma’s retirement, had a spectacular yield in the recent series in England, amassing 754 runs and leading his men to a 2-2 draw. The recency bias over his form swayed the selectors led by Ajit Agarkar and obviously coach Gautam Gambhir must have given his input. It could also be a hint about Gill becoming an all-format captain in the near future, while for now he leads in Tests, Suryakumar in T20Is and Rohit remains the ODI skipper.A Test captain, often seen as the first among equals when it comes to leading across formats, playing second fiddle to another star in T20Is does look awkward. However, Indian cricket has had various twists and turns when it comes to the leadership hot seat. At one point, Virat Kohli was leading in Tests, ODIs and T20Is before Rohit was gradually made the captain in the shorter formats and being promoted in Tests too. In the past, be it Mohammed Azharuddin or M.S. Dhoni, they had to deal with a string of former captains under their watch. Among the rest, with Rishabh Pant ruled out due to injury, Sanju Samson may get a chance to reiterate his credentials both with the bat and wicket-keeping gloves. All through his career, Samson has been in the shadows as Dhoni, Dinesh Karthik, Pant and Ishan Kishan, were the preferred stumpers. It also remains to be seen if Jitesh Sharma would be fast-tracked bypassing Samson. The squad also gets the booster shot of having Jasprit Bumrah in the fold, and he along with Suryakumar, Gill and Hardik Pandya, will form the nucleus of the team. As defending champion, India gets another opportunity to reiterate its continental dominance even as the face-off against Pakistan and the omission of Shreyas Iyer will dominate prime-time discourse.READ MORE Published - August 22, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Asia Cup Cricket\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        India-Pakistan\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        BCCI\n                    \n                            /                      \n                        \n                        Mumbai\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        Test  cricket\n                    \n                            /                      \n                        \n                        cricket",
        "headline_1": "​Sports and politics: On India, Pakistan and sports",
        "headline_2": "India’s policy on playing Pakistan in sports is illogical",
        "link": "https://www.thehindu.com/opinion/editorial/sports-and-politics-on-india-pakistan-and-sports/article69960458.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-08-2025"
    },
    {
        "full_article": "The Special Intensive Revision being carried out makes the electoral process do a yogic headstand \nI’m glad I don’t live in Bihar. It’s not that I have any particular aversion to that excellent state, but because if I did live there, I might suddenly discover that not only did I not live there but that I didn’t live at all, anywhere, and in fact, I never had, period. \nI might find myself to be not just a persona non grata, but a persona non-existentia, a person without existence, like the non-persons in the erstwhile Soviet Union. \nReportedly, some 65L people in Bihar have suddenly disappeared as though atomised by a neutron bomb.\nHowever, their disappearance has been caused not by a thermonuclear device, but by an SIR, a Special Intensive Revision, which seeks to verify and update electoral rolls to show who is eligible to cast a vote, and from where. \nIt is from these official records that all those dematerialised people have disappeared, as though by a conjuror’s vanishing trick. \nHowever, to make up for all these mysterious disappearances, there have been reported cases of individuals who seem to have got cloned, so that one person has become several, each replica located in different and far removed places, thereby being entitled to vote not once, but multiple times. \nIn a singular instance, a woman voter has been granted remarkable longevity as her official year of birth has been given as 1900, instead of 1990, thereby making her one-and-a-quarter centuries old.\nSuch aberrations, subtractions and additions to the electoral records might cancel each other out so that the overall arithmetic of the ballot box remains the same in what is often vaunted as the world’s most populous democracy. \nNonetheless, sceptics claim that such numerical jugglery amounts to jiggery-pokery, which inverts the electoral process and stands democracy on its head. \nTo those who would ring such alarm bells, the powers that be might well enjoin trustful tranquillity and urge them to learn to take it EC.\n\n",
        "headline_1": "SIR’s asana",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/sirs-asana/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-08-2025"
    },
    {
        "full_article": "Israel is tearing apart Palestine. US is okay with it. Other countries are only saying nice things   \nAs Israel begins its operation to occupy Gaza City with its 1mn residents, the humanitarian crisis in the Palestinian enclave can only get worse. The situation in Gaza is already dire after nearly two years of the conflict. Mass starvation deaths – including those of children – are being reported. Almost all of Gaza has been flattened by the Israeli military, which now occupies 75% of the enclave. Aid into Gaza is down to a trickle thanks to Israel’s restrictions. Yet, the Israeli war cabinet voted earlier this month to authorise the operation against Gaza city, despite reservations by Israel’s military chief.  \nThis clearly shows that Netanyahu and his ultra-right-wing coalition will stop at nothing to demolish the idea of a Palestine state. In fact, troubling measures are afoot in West Bank as well. This week, a controversial construction project that would see the building of 3,400 housing units and practically bisect West Bank was approved by Israeli authorities. Israeli finance minister Bezalel Smotrich called the project a significant step that erases the “two-state delusion”. All of this is being done with the concurrence of US. Note, Hamas recently accepted a new ceasefire proposal that would release 10 living hostages. But Netanyahu has decided to ignore this and move ahead with the Gaza City operation.  \nOf course, Trump can bring Tel Aviv to heel if he wants to. But his MAGA base is against this. Arab leaders, meanwhile, appear to be only expressing concern for Palestinians. Some Arab regimes may not be too unhappy if Tel Aviv ‘makes’ the Palestine ‘issue’ go away. US also is using Israel to make strategic gains in West Asia – remember Syria, Lebanon, Iran – at the expense of Russia, which is stuck in the Ukraine war. As these international strategic games go on, Palestinians are bearing the brunt of IDF attacks. They have been reduced to subhuman conditions as much of the world sheds tears but professes helplessness.\n\n",
        "headline_1": "Hell Gaza",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/hell-gaza/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-08-2025"
    },
    {
        "full_article": "Don’t celebrate Mumbai’s ‘resilience’. Fix its capacity to cope with rains. That stranded monorail said it all\nAn engineer proposing to increase Mumbai’s stormwater drainage capacity to 14 inches or 356mm of rainwater per day, in the 1860s, noted: “I believe no city in Europe…has yet attempted to deal with a rainfall approaching these limits.” Bombay, as it was then called, was clearly ahead of the curve. Now, it isn’t. This year’s first downpour in May sent water gushing into a newly inaugurated metro station at Worli – notable for some of India’s priciest real estate. Reason: inadequate drainage. This week, intense rain not only stalled the city but also left the nation marvelling at images of two monorail rakes frozen in rush hour.\nBecause Mumbai floods at least once every monsoon, it’s easy to be blasé about it. But Mumbai is India’s second most populous city, financial capital, and HQ of a state aiming to hit $1tn GSDP. Monorail is its showpiece infra, kept going at a loss of ₹550cr per year. So the sight of hundreds of passengers being rescued on fire ladders hardly inspires confidence. Govt can of course count on time to erase such irksome memories. For, even New York subway was flooded in a storm last month, and nobody quit that city. But that’s not the point. Nobody can account for freak weather. The Mumbai deluge of July 2005, with over 900mm rainfall in 24 hours, would have been devastating anywhere. But rainfall didn’t exceed 250mm on any single day this past week. With the recommended capacity enhancement, it should have been manageable.\nClimate change has significantly increased the number of heavy rain days in Mumbai. Last year, more than 100mm rainfall was recorded on 21 occasions. After the 2005 flood, the city’s peak drainage capacity was doubled from 25mm to 55mm per hour, but that’s proving inadequate now, and there’s a need to increase it to 120mm per hour in the low-lying areas at least. At the same time, further encroachment of the city’s natural drainage must stop. Because Mumbai’s stretched to its limit, every downpour brings it to a halt through a predictable chain reaction. First, suburban railway tracks flood and train services stop. Then, commuters turn to roads, which get jammed. And this year, the added weight of commuters in those monorail rakes made them lose contact with their power lines. Mumbai can’t wish away the rain but it can fix its drainage, and should.\n\n",
        "headline_1": "Down the drain",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/down-the-drain/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-08-2025"
    },
    {
        "full_article": "Rahul Gandhi has centred his political identity and brand on walkathons from the very first day he threw himself into the task of mobilising crowds. Bihar’s ‘Vote Adhikar Yatra’ that started Sunday last is his fifth big-ticket walkathon. Success of Bharat Jodo Yatra (BJY) from Kanyakumari to Kashmir and from Manipur to Mumbai– completed 508 days ago – forms the backdrop to Bihar’s hybrid mode of walks & drives through 20 districts covering 1,300 km. Read full story on TOI+\n\n",
        "headline_1": "When he walks, who gains?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/when-he-walks-who-gains/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-08-2025"
    },
    {
        "full_article": "We cannot say it vociferously enough that to regain a semblance of global and regional support and strengthen our confidence about our future, holding elections is a must-do. Prof Muhammad Yunus is the best and perhaps only person able to head the interim government, but his government is still an interim one. We must replace it with an elected one, which will come to power through a free and fair expression of public will.\nWhen we hear about the numerous conditions that are being placed by various political parties, we cannot help but wonder whether we really understand the true importance of a national election. We seem to think of it more as an event rather than a process through which people exercise their right to select the leadership that will govern us. We cannot forget for a moment that the polls belong to the people, not to any political party. None of them has any right to declare that elections cannot be held unless this or that demand is met. They have no right to deprive the voters of their fundamental right to exercise their franchise. It is the most basic of rights and every citizen is entitled to it the moment he/she is born. Vote is the symbol of a citizen's political existence.\nThe introduction of the caretaker government system to oversee elections served us well. Under the caretaker government system, we had four elections—1991, June 1996, 2001, and 2008—which lived up to acceptable standards. Though the losing parties always complained about the outcome, they functionally accepted the results and joined the governance process.\nHowever, through a constant process of walkouts, followed by long-term boycotts and even resignations, both the Awami League and BNP stymied the growth of parliament as the House of the People. The frequent absence of the opposition in parliament gave the ruling party the opportunity to make it an extension of the executive branch. Yes, the ruling party must be held responsible for preventing the parliament from playing its due role, but the opposition must also share the blame for debilitating the House by failing to make use of it to ensure accountability and transparency.\nOne of Sheikh Hasina's biggest crimes was manipulating elections and engineering their outcomes. She not only produced fraudulent results but also destroyed democracy, made the institution of people's representatives questionable, and cast doubt on the election, which is the most authentic process through which we can understand people's minds.\nThrough that one action, repeated three times, the previous regime turned parliament into a rubber stamp body and MPs into pliant clerks who, with some honourable exceptions, carried out the boss's wishes in exchange for various benefits, including usurping development funds. The parliament, instead of being the watchdog over the executive, became the latter's lapdog, abdicating all its supervisory and monitoring role.\nIt needs to be mentioned here that an agreement has already been reached among all the parties, including the BNP (with a note of dissent, of course), for setting up a bicameral legislature with an Upper House. BNP wants the seats of the Upper House to reflect those in the Lower House, while the rest want it under the proportional representation (PR) system.\nBNP has been consistently seeking the election as early as possible. Some, if not all, feel that the party's insistence for an early election is based neither on their love for democracy nor a desire to implement people's right to vote, but to cash in on the opportunity that the present situation provides. It is based on the fact that, given the peculiar circumstances, it is most likely to get the majority votes in the polls. So the earlier the election, the better it is for them. The fear is that the longer it stays on the sidelines, the more its reputation will be eroded as a section of their rank and file has already started indulging in practices that dragged the previous ruling party through the mud.\nThe newest political party, National Citizen Party (NCP), feels that the later the election is held, the better the party's chances are to gain people's support. So while it has accepted the election timeline, it wants to see the implementation of the July Charter—produced by the National Consensus Commission—before the polls, and which should have precedence over the constitution or any law. This demand raises fear of unconstitutional behaviour that will set a dangerous precedent. Therefore, we see merit in the question raised by BNP leader Salahuddin Ahmed, \"Can an agreement among political parties be considered as a 'supra constitutional document'?\"\nJamaat-e-Islami also supports the election timeline, but it has presented a new demand that is complicated and challenging, and one that our people are completely unfamiliar with.\nWhile agreeing to having the election in February 2026, Jamaat is demanding that the election for both the lower and upper houses be conducted through the PR process. In the past, whatever percentage of the overall votes that Jamaat got, they did not get as many seats under the first-past-the-post (FPTP) system. Under the PR system, they expect to get more seats. Hence, the demand.\nHowever, a major shortcoming of the PR system is that people don't get to vote for their chosen candidates, but for their parties. Hence, a direct link between a candidate and a voter is not there, which deprives the voter from choosing a specific candidate on the basis of their merit, honesty, capabilities, and human qualities. In our country, people generally prefer to vote for candidates that they know and can hold accountable. An MP's link with his/her constituency is vital, and that is what motivates people to vote.\nWhy is the PR system practised so rarely in the world? Why do most countries prefer the direct election of a candidate chosen by the voters? No country in the world, except Germany and Israel, have the PR system. Nepal, after more than five years of negotiations, has adopted a hybrid system of electing the Lower House of 275 MPs, 60 percent of whom (165 MPs) are elected directly through the FPTP system; the rest (110 MPs) are elected through the PR system. People's preference globally is clear—for the FPTP system as against the PR system. Jamaat must keep this in mind and not impose a system that our people have no experience of, just out of party interest.\nNCP, which has yet to test public trust in them, aligns itself with the PR demand, again thinking that they are likely to get a few more seats that way, putting party interest above that of the nation.\nIf we believe in democracy, which all our political parties claim to do, then we must work together to hold the coming election and make it credible for our people to celebrate and the world to honour.\nOur capacity to complicate matters, especially the political ones, seem to be inexhaustible, even when we know that doing so may affect the process of restoration of democracy by postponing elections. We have seen this happen many times, yet we fail to learn. The election in February 2026 is among the most important challenges that we are going to face, and once completed, it may hopefully pave the way not only for restoring economic and sociopolitical stability but also the implementation of much-needed reform initiatives. Our political parties can either create situations that will impede the election process, or they can adopt a collaborative attitude that will expedite our march towards it. We must not forget that our democratic journey has faltered many times in the past. After 54 years of independence, we cannot further delay or distort our democratic path forward.\nMahfuz Anam is the editor and publisher of The Daily Star.\n\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Political parties must support the election drive",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/the-third-view/news/political-parties-must-support-the-election-drive-3967816",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-08-2025"
    },
    {
        "full_article": "The other day at a meeting, I stood in the doorway, enthusiastically greeting participants. \"Welcome! How are you doing? It's great to see you here!\" My fellow greeter stood quietly next to me. Later, I mentioned to a colleague that others in our group had agreed to be greeters as well. \nWhen I informed her that I had been painfully shy as a child and young adult, she stared at me in disbelief. I often get that reaction. How could someone formerly so shy have become so much of a people person?\nWe (or at least I) could argue all day about which aspects of personality are immutable and which are most susceptible to change. If we don't like certain aspects of who we are, are we forced just to accept them, or can we change our personality? Certainly, limits exist as to what we can achieve, but I would argue that much of what we admire in others is, at least to some degree, achievable.\nIn the many hundreds of applications, mostly from women, that I have received for online and in-person internships at the Institute of Wellbeing, I often see would-be interns requesting the opportunity because they wish to gain skills in public speaking and become more confident. Women, particularly though not exclusively in Asia, are taught to be gentle and quiet. Assertive women are considered aggressive; those who stand up for themselves may be called overbearing. It is difficult to break habits inculcated through a lifetime of explicit messages about the meaning of femininity.\nOn the other hand, are we happy with staying in the background, being embarrassed to express our views, so soft-spoken that we are often overlooked and ignored? Women possess valuable opinions. Women have rights that we need to defend. However well-meaning those who teach us to be soft-spoken may be, that quality can cause extreme harm. Fortunately, as I have suggested, we can change.\nMy own battle with shyness was not brief. Various friends encouraged me along the way. I discovered the merits of spending time with those typically ignored by society and in need of good cheer, be they the homeless or the hospitalised. Seeing how such people valued my company, I learned that my company could be valuable. I befriended those with even fewer social skills than I possessed. I took risks living in foreign countries where people did not speak English and appreciated my efforts at learning their language. Most of all, I refused to remain the way I had been for a good two decades or more; I was determined to change, and I did.\nAdmittedly, some would say I went a bit too far. I am relearning the important art of listening. I try to tame my instincts to take over, to dominate conversations, to assert myself even where I could more appropriately stay in the background. It helps to remember that learning should be lifelong and that there is always room to be a better person.\nImproving ourselves requires work. It can take years. It is easier when we have friends or family members who encourage and support us. But difficult does not mean impossible, and trust me, the rewards of getting closer to what we aspire to are well worth the effort we will expend.\nDebra Efroymson is executive director at the Institute of Wellbeing Bangladesh and author of 'Life Lessons with Bianca: Overcoming Shyness, Dealing with Procrastination, and Other Helpful Advice.'\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "How I overcame shyness",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/how-i-overcame-shyness-3967636",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 22, 2025 00:00:00  \nIt is deeply troubling that the Electronic Construction Permitting System (eCPS) of the RAJUK remains dysfunctional, leaving the country's real estate sector in disarray. For months, developers have been unable to secure design and land clearance approvals, leading to stalling of projects and disruption of employment across the construction value chain. Industry insiders reveal that nonfunctioning of the system has stalled hundreds of projects and caused distress to backward-linkage industries dependent on construction, including cement, steel, tiles, glass and paints. The disruption began in mid-May, when hackers infiltrated the eCPS server and secured illegal approval for a 15-storey building in wetlands located in a height-restricted zone. The RAJUK suspended the system the following day, but the suspension has continued far longer than anticipated, aggravating losses and causing uncertainty.\nThe ripple effect has been severe. Realtors estimate that construction delays have left nearly 43,000 workers -- from engineers and architects to day labourers -- without work. Over 300 allied industries are said to be affected, threatening the livelihoods of hundreds of thousands more. What was expected to be a temporary shutdown has now dragged on for months, raising questions about the RAJUK's preparedness, competence, and accountability in managing such a critical system. Officials admit that the eCPS server is still non-functional. They have reportedly sought technical support from the Bangladesh Computer Council and some even suggested the possibility of reverting to manual approvals if the deadlock persists. While such a move could offer temporary relief, it would mark a setback in an effort to modernise and digitise public services, especially since the eCPS was introduced precisely to reduce bureaucratic delays and ensure transparency in the approval process.\nIf the stalemate continues, realtors warn that mounting financial losses could cripple not only their businesses but also the broader construction sector, which plays a vital role in economic growth and employment generation. Equally concerning is the fact that this is not the first time the eCPS has come under attack. In December 2023, nearly 30,000 files reportedly went missing from the server following a hacking attempt, a case that eventually reached the High Court. Many clients are still uncertain whether their files will ever be recovered. That such a sensitive system, central to urban development and private investment, remains vulnerable to repeated breaches points to glaring lapses in cyber security.\nThe question now is, how does the RAJUK justify this prolonged inaction, despite the serious consequences for thousands of businesses and workers? Technology is meant to simplify, ensure transparency and improve efficiency. But when its management fails and vulnerabilities go unaddressed, the very purpose of digitisation is defeated. The RAJUK must accept responsibility for its failure to safeguard the system and promptly restore normal operations. At the very least, the authority should have had contingency measures in place to ensure uninterrupted services. The construction sector, one of the country's economic lifelines, cannot remain hostage to technical glitches and administrative inertia. The RAJUK must act without further delay to restore the eCPS, secure it against future attacks and ensure that such a crisis will not recur in the future.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Restoring RAJUK's eCPS",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/restoring-rajuks-ecps-1755789113",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       August 22, 2025 00:00:00  \n\nThe release of as many as 1,108 mugging suspects on bail in just past three months is sure to cause many an eyebrow to raise. Some of the gory and gruesome murders of innocent people including members of the business community committed by muggers while looting have struck terror into the hearts of the general public. The overall decline in law and order has ever remained a cause for consternation. True, there was a serious breakdown in the chain of command following the July-August uprising with the law enforcement agencies, the police in particular, playing against the people a murderous role. But the interim government should have set a limit to the social chaos and anarchy. Instead, it gave an impression contrary to what was expected after a certain timeline. It deplorably failed on that count, sending a wrong message for the anti-social, criminal elements, militants and even the defeated forces of the 1971 liberation war. \nSure enough, the mass release of inmates including militants from several prisons hoisted the danger signal but the government's indifferent attitude towards such serious development only encouraged the criminals to carry out their nefarious activities. Admittedly, breakdown of law and order after an uprising or a revolution is a natural consequence. But political sagacity of those whose who are at the helm of affairs should counter such developments methodically and intelligently. The message for the criminals should be unerring that 'thus far and no further'.\nNow, the charges framed against the muggers -- charge-sheeted, caught red-handed during mugging or attacking victims and listed during interrogation --seem to have been weak, out of context and even missing the focal points. The investigation process is unduly slow. Defence lawyers can cite loopholes quite easily to get their clients released on bail. Well, lawyers have their duty to do everything to win the cases in favour of their clients. But what about the prosecutors who are supposed to counterargument logics put forward by the defence? Allegations are there that they are not keen in taking up such cases seriously; instead, they are nonchalant and indifferent to fight the cases and put the hardened criminals behind the bar.\nWhat happens in the process is that the criminals are treated as suspects allowing them to walk out of the prison. Earlier, the nexus of self-seeking political coteries, prison staff, agents and other social parasites enjoyed a chummy relationship because of the awful situation created over the years. Speed money and underhand dealings thrives under such a regime. People hoped that the prison and legal environment would improve with the affairs in this sector becoming transparent and rational. That this has not happened is clear from the report a leading daily carried on its front page recently. The confidence reposed in the interim administration seems to have been utterly misplaced. \nOr, how can such a large number of muggers, the close circuit camera videos of which crimes including stabbing and the most blood-curdling murders went gone viral recently, be freed from jails? Insecurity has manifestly proved to be so corrosive of social psyche and spontaneity of social life and business environment! This government had enjoyed enough public trust that if it were serious, it could make a turnaround in the abysmal law and order. Even the police have admitted the adverse impacts of such large-scale release of accused muggers.\nOn release, they soon return to their notorious profession and the law enforcers have to chase them anew. Thus, time, energy and money are wasted on the same exercise. This is undesirable. Clearly, there is a need for reviewing the bail provisions and at the same time considering such crimes with due seriousness. Repeated crimes cannot be allowed to vitiate the social and business environment. Even domestic and overseas investors give a serious look at the social and legal peace and stability before making investment anywhere. No wonder, Bangladesh has attracted the lowest ever investments, including foreign direct investment (FDI), during the tenure of this interim administration.\nMugging may not be a legal term but it starts from theft to robbery and dacoity in the penal parlance. The difference between and among those three types of crimes is determined by the physical violence, threat to life and the number of criminals involved. Under the section 390 of the Penal Code, a theft becomes a robbery if offenders resort to or cause instant death, use threat to hurt or murder. The same offence strangely becomes dacoity if five or more offenders are involved in the crime. Sure enough, the number of offenders involved in such crimes matter because the passers-by or bystanders dare not protest or resist them. Chances are that more innocent public become victim to their wrath and they can leave the spot of crime with impunity. \nIn the process, the moral standpoints get weakened allowing the anti-social goons to have the last laugh. This is exactly how the social fabrics get disintegrated. Crimes proliferate, forcing honest and transparent business to compromise. When there is a threat to life of small traders and businesspeople from criminal gangs, they have to pay illegal tolls. Even the footpath vendors are not spared. Business becomes costlier with the burden ultimately getting shifted to the general consumers. This explains why ease of doing business in this country is extremely challenging and commodity prices are usually higher than they ought to be. The social parasites are primarily responsible for this with its snowballing effects adversely impacting every area of life.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Mass release of muggers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/mass-release-of-muggers-1755789162",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 22, 2025 00:00:00  \n\nKharshu bus stand area, under Sirajdikhan upazila of Munshiganj, is located just 22 kilometres away from the capital Dhaka, and serves as a busy transportation hub. There are also 15 surrounding villages, many of which have a significant number of expatriates, business owners, and well-off individuals. But there is no nearby bank branch in this area. \nCurrently, the residents of Kharshu and nearby areas have to travel approximately 5 to 7 kilometres to access banking services for deposits or withdrawals, which presents significant challenges and risks. Additionally, there is only one ATM in the area, but it is frequently out of service, leaving account holders with limited options.\nIf a bank branch set up here it would be great benefit for local communities. This would not only provide easier access to banking services but also reduce the risks associated with long-distance travel for financial transactions.\nI kindly request the authorities concerned to consider setting up a bank branch at the Kharshu Bus Stand so that residents can access banking services conveniently and securely.\nBidyet Sarker\nKharshu, PO: Paushar, \nUpazila: Sirajdikhan, Munshiganj\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bank branch needed at Kharshu",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bank-branch-needed-at-kharshu-1755789198",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 22, 2025 00:00:00  \n\nDhaka is no stranger to disasters. Among the most frequent and devastating are fire outbreaks that wreak havoc in crowded neighborhoods, markets, and high-rise buildings. These tragic events raise a critical question: Does Dhaka have a well-equipped disaster management team capable of responding efficiently and saving lives?\nRecent fire incidents have revealed serious gaps in the city's ability to handle emergencies. Fires spread rapidly in densely populated areas, rescue operations are often delayed, and coordination among agencies remains weak. It is evident that the current system is insufficient to protect the lives and property of millions of residents.\nA dedicated disaster management team is essential because responding to emergencies requires rapid and coordinated action. Every minute lost in response can cost lives. Fighting fires, conducting search and rescue operations, providing emergency medical aid, and handling hazardous situations demand specialized skills beyond ordinary firefighting. Equally important is seamless coordination among multiple agencies, as fragmented responses frequently lead to delays, confusion, and preventable loss of life. A trained disaster management team can also play a proactive role in community preparedness, guiding citizens on safety measures and reducing risks before disasters strike.\nMoreover, disaster responders in Dhaka often lack modern training and equipment necessary for complex rescues. Narrow streets, overcrowded buildings, and poorly maintained infrastructure make operations even more challenging. Limited public awareness about emergency procedures further complicates rescue efforts, while fragmented services slow down response times, putting both lives and property at greater risk.\nTo address these gaps, Dhaka must urgently invest in training firefighters, medical responders, and volunteers with modern skills, while equipping them with advanced rescue tools, communication systems, and ambulances. Public education on fire safety and emergency response is equally important. Legal and institutional support, including strict enforcement of safety regulations and well-defined operational protocols, must be strengthened. Regular joint drills and coordinated exercises can ensure that agencies work efficiently together when disasters strike.\nThe repeated fire tragedies in Dhaka are a wake-up call. Without a strong, well-prepared disaster management team, the city remains highly vulnerable. Building such a team is not merely the government's responsibility; it is essential for safeguarding every resident, protecting property, and ensuring a safer future for the capital.\nMd. Farhan Sadique\nBBA \nNorth south University\nfarhan.sadique@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Enhancing Dhaka's disaster management capacity",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/enhancing-dhakas-disaster-management-capacity-1755789225",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-08-2025"
    }
]