[
    {
        "full_article": "Bangladesh Chief Adviser Muhammad Yunus’s remarks, made during his China visit to attend the Boao Forum for Asia conference, have sparked sharp responses in India, amid questions about their underlying intent. Speaking at a round table, Mr. Yunus highlighted the lack of connectivity and trade in the region, referring to the north-eastern Indian States — the “Seven Sisters” — as a “land-locked” area. Ignoring India’s vast coastline, he went on to claim that Bangladesh was the “guardian of ocean access” and called on China to view the Indian States, along with Bhutan, Nepal, and Bangladesh, as an “extension of the Chinese economy”, presenting them as a market and a production base. There were other undertones to his remarks, which were shared on his social media accounts. This was his first visit to China since taking office following the ouster of Bangladesh Prime Minister Sheikh Hasina last August. Tensions with India have persisted over attacks on minorities in Bangladesh and the Yunus government’s demands for the repatriation of Ms. Hasina from India.With no invitation forthcoming from New Delhi, Mr. Yunus’s decision to visit China has been perceived as a diplomatic snub — and possibly a sign that Bangladesh may be shifting its foreign policy orientation. While the Ministry of External Affairs has declined to comment, political leaders have weighed in. Assam Chief Minister Himanta Biswa Sarma called the comments “offensive and strongly condemnable”, suggesting that the remarks were aimed at highlighting India’s strategic vulnerability via the “Chicken’s Neck”. Other regional leaders and members of the Opposition have urged the central government to convey its displeasure to Dhaka. Mr. Yunus could not have been unaware that the timing and the location of his speech would provoke controversy. His remarks reflected a lack of sensitivity toward how the countries mentioned might interpret statements that appear to support China’s economic hegemony in the region. While these comments may have been intended to appeal to his hosts or may have stemmed from his advocacy for regional connectivity, their substance could have been more carefully considered. A more suitable platform for such discussions might have been the upcoming BIMSTEC summit in Thailand, where Prime Minister Narendra Modi and leaders from South Asia to Southeast Asia will be present. Equally significant is that Mr. Yunus received two letters from India this week: one from President Droupadi Murmu extending Eid-ul-Fitr greetings, and another from Mr. Modi on the anniversary of Bangladesh’s Independence Day. Although there has been no formal announcement of a Modi-Yunus meet in Bangkok, it is hoped that both sides will engage on the sidelines to mend the strain in ties and explore a more constructive path.\r Published - April 03, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Bangladesh\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Assam\n                    \n                            /                      \n                        \n                        Manipur\n                    \n                            /                      \n                        \n                        Mizoram\n                    \n                            /                      \n                        \n                        Meghalaya\n                    \n                            /                      \n                        \n                        Tripura\n                    \n                            /                      \n                        \n                        Nagaland\n                    \n                            /                      \n                        \n                        Arunachal Pradesh\n                    \n                            /                      \n                        \n                        Bhutan\n                    \n                            /                      \n                        \n                        Nepal\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Thailand",
        "headline_1": "​Timing and location: On Bangladesh Chief Adviser’s remarks and China visit",
        "headline_2": "Yunus chose the wrong time and place to push for regional connectivity",
        "link": "https://www.thehindu.com/opinion/editorial/timing-and-location-on-bangladesh-chief-advisers-remarks-and-china-visit/article69404315.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "03-04-2025"
    },
    {
        "full_article": "After more than two months of caustic words for Ukraine President Volodymyr Zelenskyy and approbation for Russian President Vladimir Putin, U.S. President Donald Trump appeared to strike a different note in his approach towards bringing the two leaders to the negotiating table. Following a call with Mr. Putin, Mr. Trump said that he was “very angry” with the former when, following weeks of attempted negotiations, Mr. Putin reportedly attacked Mr. Zelenskyy’s credibility instead of discussing steps towards finding peace. Further, Mr. Trump, apparently irate that his campaign promise to end the conflict was losing steam and in danger of remaining unfulfilled, threatened to slap nations purchasing Russian oil with a 50% tariff, unless Mr. Putin agreed to a ceasefire in the near term. The choke point was Mr. Putin’s insistence that Mr. Zelenskyy lacks the legitimate authority to sign a robust peace deal that would not be challenged by any nation; and that in this context the introduction of “temporary governance in Ukraine,” was required, perhaps achieved through “democratic elections, to bring to power a viable government that enjoys the trust of the people…”In terms of his popularity back home, Mr. Zelenskyy had earlier corrected a broadside from Mr. Trump, a false claim that he only had an approval rating of 4%, when in fact Kiev had noted that 65% of Ukrainians trusted their President and his approval rating hovered around 57% in early 2025. Mr. Putin’s claims in this regard, which range from the unfounded statements about Mr. Zelenskyy lacking popular legitimacy to accusing him, a leader of Jewish descent, of enabling Nazi forces in Ukraine, can be understood in the backdrop of Moscow’s reluctance to enter into a peace treaty at a time when its troops have continued to keep up the military pressure on Ukrainian forces and have made substantial territorial gains there. The greater concern for Europe, and perhaps the U.S., might be that Mr. Putin could seek to undermine via influence operations any plan for free and fair elections in Ukraine and thus succeed in getting a pro-Russian candidate installed in Kiev. In turn, Mr. Trump, even if he is not particularly concerned with European security in a post-conflict scenario in Ukraine that might favour Russian interests, may worry that a lucrative U.S.-Ukraine mineral extraction deal might be in jeopardy if Mr. Putin is de facto calling the shots across the region. Regardless of the bluster on all sides, an early ceasefire would have the greatest impact on prospects for lasting peace after more than three years of bloodshed and dislocation. Published - April 03, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        Ukraine\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        peace negotiations\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        European Union",
        "headline_1": "Season of bluster: On Trump, Putin and Ukraine",
        "headline_2": "Trump is finding it difficult to negotiate with Putin on Ukraine",
        "link": "https://www.thehindu.com/opinion/editorial/season-of-bluster-on-trump-putin-and-ukraine/article69404281.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "03-04-2025"
    },
    {
        "full_article": "India’s China policy: get investments in non-strategic areas & remember Beijing can flip any time\nIt’s clear what is driving the recent warming of India-China ties – Trump. Much bilateral diplomatic niceness marked the 75th anniversary of establishment of diplomatic relations. Xi waxed a bit eloquent, saying an “elephant-dragon tango” will serve the interests of both sides. China’s sweet on India because it’s preparing for a likely trade war with US – Trump has already hit Beijing with 20% tariffs on all Chinese imports. It makes strategic sense for Xi to play nice. His officials have even offered to import more from India.\nNew Delhi seems open to the prospect of less frosty relations with Beijing. Following the patrolling pact worked out in eastern Ladakh last Oct – although there has been no reduction in troops on either side – the focus is now on re-initiating practical cooperation. Frankly, India too is looking at headwinds, and not just Trump-driven ones. Domestic private sector investment is down to a decadal low of 33% of all investment. Govt capital expenditure is slowing. And manufacturing, despite the PLI scheme, hasn’t really taken off. Therefore, Chinese investments in India – barring in critical sectors such as telecom, defence equipment parts, energy and transmission, and data-sensitive IT products and services – at this point would be helpful.\nBut given the strategic-security challenge China continues to pose – including the unresolved border issue – how should India play this? For the answer, look to Japan. Tokyo over the decades has built up deep economic engagements with Beijing. Even recently Japan, China and South Korea met and decided to formulate a joint response to Trump’s tariffs. But Japan has long known that given the nature of the Chinese Communist Party and the opaque character of Chinese elite politics, Beijing can flip its position any time.\nHence, the only way to deal with China is from a position of strength. For example, when China ratcheted up tensions over the Senkaku islands in East China Sea in the previous decade, Japan nationalised them. Similarly, India needs to cultivate the capacity to address any Chinese U-turns, be they along LAC or through weaponisation of economic interdependencies. New Delhi must make it clear to Beijing that moves like preventing companies from moving specialised equipment and tech from China to India will be a deal-breaker. Trust some more but verify even more, should be India’s mantra.\n\n",
        "headline_1": "Too tense for tango",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/too-tense-for-tango/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-04-2025"
    },
    {
        "full_article": "A classified conversation on natural vs synthetic experiences\nMr B and Mr T (the eternal sceptic and the ever-hopeful, jargon-loving technocrat) are catching up over chai after their morning walk, perched on the balcony of one of those sleek high-rises that now stand where Mumbai’s textile mills once stood:\nMr B (raising an eyebrow mid-sip): Did you catch that front-page advertisement in Bombay Times day before? Something about an AI-enabled…synthetic…err…contraption. Honestly, makes me wonder – just how deep are you tech fellows willing to take this artificial stuff? Is there no limit to the depths of your synthetic creativity?\nMr T (grinning, utterly unbothered): Ah, Babuji, what you saw is just AI in its entry stage. We’ve barely scratched the surface. Unless we remain open, how will we ever discover the pulse – or the tectonic shifts – that AI can deliver? We’re talking about a more…holistic experience here.\nMr B (spluttering into his chai): Holistic?! My, my…What’s holistic about something that’s both artificial and synthetic? In my day, everything was organic – especially the idea of privacy. Now you’re telling me this synthetic…device could one day command more attention for my Mrs? What value can synthetic deliver? And don’t tell me you’re going to rate performance over time too – complete with dashboards?\nMr T (adjusting his smartwatch): Well, in today’s competitive world, what isn’t measured can’t be improved! Real value lies in metrics. There would be apps with push notifications, live dashboards, leaderboards, maybe even…intimacy leagues. We’re entering the age of gamified gratification.\nMr B (shaking his head): What is this world coming to? In our time, things were simple – natural, organic. Now you people have taken synthetic to a whole new low. I shudder to ask – how much deeper can this go?\nMr T (squinting, curious): Wait…are you referring to the AI-powered…advertisement?\nMr B (confused): No, no. I was talking about the front-page advertisement of the touching letter – written by a father to his daughter about natural vs synthetic diamonds.\nMr T (sighing, with a sheepish grin): Ah. Never mind. For a moment there, I thought you were referring to the other AI-powered offering in yesterday’s Bombay Times…you know, the Force of Man-kind. Two Bombay Times front-pagers in one morning – clearly, the depths are hard to keep up with.\n\n",
        "headline_1": "Depths of AI",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/depths-of-ai/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-04-2025"
    },
    {
        "full_article": "What a US senator’s so-very-long speech and a good waqf debate in LS tell us\nUS senator Cory Booker stood up to speak at 7pm on Monday – Washington DC time – and didn’t sit down until 8.06pm on Tuesday, setting a record. True, most seats were empty for most of Booker’s 25-hour marathon. But even if not everyone listened to him, nobody in the 100-seat Senate interrupted him. The 55-year-old former athlete’s stamina – no bathroom break, for example – helped Americans detect a pulse in the comatose Democratic party. That matters at a time when Trump is riding roughshod over US institutions and the world order.\nChampions of brevity would argue that nobody – not even Tolstoy – could make a meaningful extempore speech stretching to almost half the runtime of a War and Peace audiobook, but Booker’s feat is more than the sum of its parts. And he served rhetorical aces too – attacking Trump, his undemocratic orders, the influence of his semi-trillionaire friend, and the general chaos the two have unleashed. “If America hasn’t broken your heart, you don’t love her enough,” is definitely going down as a quotable quote.\nHours after Booker finished, Lok Sabha took up the Waqf Bill in classic parliamentary spirit. There was debate, some protests, some ribbing – Akhilesh vs Amit Shah – but no walkout. In the winter session, Lok Sabha had lost 65 hours and 15 minutes to interruptions, at a cost of 2.5L per minute – 97.9cr overall. Clearly, decorum is cheaper and more productive for the nation. Democracy works best when everybody gets their say, regardless of how unpalatable their words are, without going to Booker lengths. That’s easy if speakers and mics work as they should. \n\n",
        "headline_1": "Booker prize",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/booker-prize/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-04-2025"
    },
    {
        "full_article": "By Pulkit Sharma\nEmpathy as a virtue was valued deeply by our ancient cultures and there was a time when people worked hard to instil this quality in younger generations. Several mythological legends, ancient folklores and cultural narratives tell us to see beyond narrow boundaries of our ego and connect deeply with joys and sorrows of others, fostering strong bonds and meaningful dialogues. But in recent times empathic spaces in human repertoire have been shrinking fast and getting overpowered by narcissism and apathy.\nA recent study published in the Personality and Social Psychology Review concludes that self-reported empathy in youngsters has been declining since 1980, with an especially steep drop in the last decade. Newer generations are becoming increasingly trapped in their lonely bubbles of self-love, ruthlessly focusing on fulfilling their own desires, wishes and fantasies. More often than not, they display a callous attitude to pain and suffering of others. You can hear them say that why even bother to worry about the world, fret over things beyond one’s control and walk that extra mile to support others.\n\nOur world is grappling with multiple threats including climate change, environmental pollution, extremism, xenophobia, geopolitical aggression, geoeconomic greed, brutal wars, forced migrations, psychopathy and cybercrimes. We forget that we are nothing but a tiny pixel on this vast map and we will continue to exist only if the world exists. If the world disintegrates, our lonely bubbles of narcissism will burst, leaving us in utter fear and misery. We must remember that we are not isolated, self reliant entities. We are deeply embedded in an interconnected existence – we exist because the existence exists. While the existence holds us, nourishes us, protects us and provides for us, the existence also needs nourishment, protection and love and we all must do our bit in maintaining this fragile, symbiotic balance.\nTherefore, we must break free from constraints of our narcissism and develop connections of empathy, affection and altruism with the world around us. Finding ways to reconnect with the world is not very difficult. Spending more time in the real, outside world and carefully observing everything that exists in nature can reawaken our lost curiosity for nature, wildlife and fellow human beings. Meeting new people, interacting with them and attentively listening to their narratives can make us aware of the multiple similarities we share with them and ubiquitous happiness and sadness that run deeply in our veins. It might also make us aware that there are often multiple and divergent perspectives of looking at the same reality. While perspectives change, reality remains the same and an introspection into these perspectives and the one reality reveals how we all are connected to the universe.\nThe Nasadiya Sukta from Rig Veda reveals that there was either an existing or a non-existent Singularity before the creation. There was no sky, air, matter and no water. This One formless thing experienced a desire to manifest itself and therefore it expanded into multiples. We are a part of this formless One and therefore interconnectedness is our true nature. Through empathy we can reconnect with the formless One, and reclaim our true, joyful essence.\nThe writer is a clinical psychologist based in Puducherry\n\n",
        "headline_1": "Exploring interconnectedness of being",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/exploring-interconnectedness-of-being/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Lesson learnt from  Myanmar quake",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/lesson-learnt-from-myanmar-quake-1743601450",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Trump's third term White House ambitions",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/trumps-third-term-white-house-ambitions-1743601519",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Ensuring safe return of Eid vacationers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ensuring-safe-return-of-eid-vacationers-1743601625",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Earthquakes: how ready is Bangladesh?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/earthquakes-how-ready-is-bangladesh-1743601639",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-04-2025"
    }
]