[
    {
        "full_article": "The U.S. decision to impose sanctions on a United Nations Special Rapporteur for her criticism of Israel’s war in Gaza has been called a “dangerous precedent” by the UN and top UN Human Rights Council officials. The comments followed U.S. Secretary of State Marco Rubio’s announcement that Francesca Albanese, a “Special Rapporteur on the situation of human rights in occupied Palestinian Territories since 1967”, would face restrictions as a result of her engagement with the International Criminal Court (ICC). The ICC has already been sanctioned by U.S. President Donald Trump in an executive order, shortly after he took office. While the scope of the sanctions are still unclear, they are understood to include travel and visa bans, and possible asset freezes for Ms. Albanese, who has drawn American ire with a report in June that urged international organisations to prosecute corporate entities and multinationals whose work helps fund the war. Ms. Albanese has frequently accused Israel of conducting the “cruellest genocide” in Gaza, as well as its takeover of the Gaza Strip. She has also been calling for scrutiny of the “Gaza Humanitarian Foundation”, a U.S.-Israeli NGO. The U.S. actions have no doubt been spurred by Israeli Prime Minister Benjamin Netanyahu’s latest visit to Washington, where he announced that his government would nominate Mr. Trump for the Nobel Peace Prize.Amidst the rising death toll in Gaza and no ceasefire or deal for the return of Israeli hostages in sight, Washington’s focus on a UN official is absurd and outrageous. Ms. Albanese’s work is mandated by the UN Human Rights Council, and the U.S. actions undermine the global multilateral world order by calling those actions criminal. It is irrational to hold her responsible for the warrants and orders issued by the ICC and the International Court of Justice, which have heard testimonies from representatives of at least 40 states and international organisations on petitions calling for action against Israel. Mr. Rubio’s contention, that Ms. Albanese should be sanctioned for engaging with the ICC to prosecute U.S. and Israeli nationals “without the consent of those two countries”, is not legally valid. Further, his allegations that she “has spewed unabashed antisemitism [and] expressed support for terrorism” are not borne out by facts. As global outrage over Israel’s killing of Palestinians, and the U.S. support for those actions, grows louder, as well as the BRICS summit condemnation this week, that India too joined, it is time for the U.S. to look in the mirror. The need is to effect an immediate ceasefire, and not in bringing the considerable might of the most powerful country to bear over one individual, in order to silence her voice.\r Published - July 12, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        economic sanction\n                    \n                            /                      \n                        \n                        United Nations\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        human rights\n                    \n                            /                      \n                        \n                        non government organizations (NGO)\n                    \n                            /                      \n                        \n                        award and prize\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Brazil\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        South Africa\n                    \n                            /                      \n                        \n                        international court or tribunal",
        "headline_1": "​Silencing a sane voice: On U.S. sanctions against UN Special Rapporteur Francesca Albanese",
        "headline_2": "U.S. sanctions against a UN official are dangerous and absurd",
        "link": "https://www.thehindu.com/opinion/editorial/silencing-a-sane-voice-on-us-sanctions-against-un-special-rapporteur-francesca-albanese/article69801090.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "13-07-2025"
    },
    {
        "full_article": "English medium education is an aspiration for many Indians, but state policy regarding the medium of instruction has been uneven across time and regions. The ongoing language debate in India, which stems from the renewed efforts of the Bharatiya Janata Party to enforce a three-language policy, has many components, the medium of instruction being one. Educationists generally argue that instruction in the mother tongue helps children achieve better learning goals in their early stages of development. This view is supported by pedagogical research, but it cannot, and does not, operate in isolation from other factors such as constitutional rights and ground realities. India’s linguistic diversity and distribution is such that even the question of what is a child’s mother tongue can often be a contested one. There is also the constitutional question of freedom of expression and choice. In 2014, after a protracted legal tussle, the Supreme Court of India held that a Karnataka government order of 1994 that made instruction in Kannada mandatory until Class four was not valid under the Constitution. For, children have a right to choose, and the state cannot enforce its view on what is good for them. The rights of private educational institutions to offer education as per market demand is another related issue.The National Education Policy that is being aggressively pushed by the Centre has a particularly anti-English edge, which is not in line with popular aspiration. Many States that want to promote their local language and culture also want to promote English education and English as a medium of instruction. In Karnataka, Andhra Pradesh, Kerala and Tamil Nadu, there are aided English medium schools. The demand for English medium education is growing — this includes the Hindi-speaking regions — which is met largely by substandard and expensive private institutions. English skills help individuals and the country in gaining a place in the global services sector. India’s subaltern caste groups in particular seek to empower themselves through English education, which remains a currency for upward mobility. If state schools do not offer English medium instruction, relatively richer families could still access it through private schools. In this context, education becomes a continuing reproduction and even aggravation of social inequalities, which is the exact opposite of its purpose. The fact is that knowledge of English is empowering and convertible for other outcomes. There can be a debate on whether it should be the medium of instruction at the primary level, but a basic test of any policy is in how it advances the ambitions of the most disadvantaged sections.\r Published - July 12, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        education\n                    \n                            /                      \n                        \n                        English\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        Karnataka\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Andhra Pradesh\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        school\n                    \n                            /                      \n                        \n                        language",
        "headline_1": "​English dreams: On language debate and English medium education",
        "headline_2": "Imposing any language as the medium of instruction is unacceptable",
        "link": "https://www.thehindu.com/opinion/editorial/english-dreams-on-language-debate-and-english-medium-education/article69800752.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "13-07-2025"
    },
    {
        "full_article": "A decade ago, the world of dating seemed effervescent. People moved from the humidity of chatrooms, covert, fertile and throbbing to a fluorescent-lit, air-conditioned environment of dating apps. It apparently opened the doors of desire and people could now freely admit to wanting sex and wanting to play. Women could speak with less hesitation of being sexual beings too.\nRather than the elaborate stalking, repressed hints, years-long waiting that had passed for romance, amorous intentions could be stated clearly and people could either swipe right or left. How airy that all seemed and how everyone thought it surely signalled a sexual revolution.\nCut to 2025 and all around us we are all being asked to discuss the crisis in masculinity. Its dark edge is the manosphere, with its cellarful of incels. On the lightest side is one of the most hilarious TikToks in recent times by a French user called @gettothepointbro who broke down why dating a girl who’s been single for some time is not romance, it’s an extreme sport for your self-esteem.\nRead full story on TOI+\n\n",
        "headline_1": "Men are afraid to date. Is manliness to blame?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/voices/men-are-afraid-to-date-is-manliness-to-blame/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-07-2025"
    },
    {
        "full_article": "India is on a path to overtake Japan and Germany to become the third largest economy in the world in the next year or two. Greater size means greater global heft. However, there’s one aspect in which we clearly underperform not just these economies but much smaller ones. India does not have one company that is known across the world for its products – no Nintendo, Sony, or Toyota, no Mercedes, Porsche, or SAP. Why do so few of the products our national champions create dominate internationally?\nOur large domestic market, for example in passenger cars, gives us a base on which to innovate. High tariffs keep imports out. Yet, Indian car exports are modest, focused on niche markets in Latin America, West Asia and Africa, where the durability and affordability of Indian models are prized. Not one car model has been sold in large quantities in the developed world.\n\nIn contrast, China produces some of the leading passenger EVs, dominating every aspect of the supply chain, including autonomous driving systemsand fast-charging long-range battery packs.\nRead full story on TOI+\n\n",
        "headline_1": "Save us from our Champions",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/save-us-from-our-champions/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-07-2025"
    },
    {
        "full_article": "Last year, Indians abroad sent home $129bn, a record. And on Thursday, Italian candymaker Ferrero announced it would buy US cereal giant WK Kellogg for $3.1bn, which is not a record – not even close – for the acquisition of a brand. Brit firm Vodafone’s $190bn acquisition of German firm Mannesmann in 2000 remains on the podium after 25 long years. And America Online’s ill-advised $182bn acquisition of Time Warner the same year remains equally gasp-worthy. Both outstrip Indian remittances by an enormous margin, without factoring in inflation, or involving 35mn-plus emigrants.\n\nThat is the power of brands, and a country that creates conditions for them to thrive is well on its way to becoming a winner. In the Cold War, US and USSR were evenly matched nukes-wise, but US had a phalanx of brands, from Coke to Boeing, while the Soviets said nyet to their own Lada.\n\nLet’s be clear – brands aren’t things. There were scooters, and there was Vespa; razors, and Gillette; denims, and Levi’s. Brands have an X factor that makes them desirable beyond borders. Jaguar and Land Rover were British cars, but so desirable that American Ford bought them. And when Ford fell on hard times, India’s Tata Group took over. So, a brand’s value transcends not only the physical product but also the balance sheet. India has brands, of course, but they are national-level players, inter-district champions. We need some Olympians.\n\n",
        "headline_1": "Name Theory: Ferrero buying Kellogg isn’t just a business story",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/name-theory/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-07-2025"
    },
    {
        "full_article": "Movies caught between censors, govts, courts \nEvery case is different. Punjabi Sardaarji 3: The price it pays for starring a Pakistani actress is forgoing an India release. Never mind that they made it before Op Sindoor, Indian producers lose out. Malayalam Janaki vs State of Kerala:  CBFC decides the titular character suffering traumatic experiences causes grave offence to religious sentiments, because Janaki is another name for Sita. A name tweak is negotiated. Punjabi-Hindi Punjab 95 is a biographical film that has been hanging fire at CBFC since 2022. Its director says that the 127 cuts demanded will make it CBFC’s film, not his. Hindi Udaipur Files: This one was kosher with CBFC but on the eve of its-pan India screening, Delhi high court enabled the objectors to make their case to central govt.\nSo, every case is the same. In India, any hurt-sentiment lobby can derail any film. Courts and govt cannot be relied on to deliver on freedom of expression guarantees. Worse, the statutory film certification body itself is often stepping up to do derailment. Sometimes, its ‘decency and morality’ obsession is reminiscent of Orwell’s 1984 where a Ministry of Truth is constantly un-personing people for thoughtcrimes. At other times, its hatchet jobs remind observers of the ‘blind and aimless fury’ of Lewis Carroll’s Queen of Hearts. Basically, CBFC is carrying on its job too much in tandem with its British Raj roots a hundred years ago. As if in a bizarre transference of the white man’s burden.\nFrom Trump’s tariffs to digital disruption, India’s film industry faces plenty of threats from outside India. At least stop clipping its wings at home. Stop forcing the taste of a few on all. Why assume that citizens are more thoughtless than the censors?\n\n",
        "headline_1": "They all say cut",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/they-all-say-cut/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 13, 2025 00:00:00  \nThe results of this year's Secondary School Certificate (SSC) and equivalent examinations have broken the trend of consistently high scores observed over the past 15 years, registering a significant decline in academic performance across all education boards. The overall pass rate dropped to 68.45 per cent from last year's 83.04 per cent, a sharp decrease of 14.59 percentage points that caught students, parents, teachers and policymakers by surprise. The number of candidates achieving the highest-grade GPA-5 also fell significantly, with 139,032 students attaining this distinction compared to 182,129 in the previous year. Out of approximately 1.9 million students who sat for the examinations, 600,660 students did not pass. The only positive trend that remained consistent with previous years is that girls once again outperformed boys with their pass rate of 71.03 per cent compared to 65.88 per cent for boys. \nOne might have expected that such a sharp decline in examination performance would provoke public outrage, as it could suggest a broader deterioration in the quality of education delivered by schools. However, contrary to that expectation, public sentiment has largely accepted the results as a more accurate and honest reflection of students' academic standing. There is a specific context that helps explain this shift in perception. This year's SSC results are the first to be released following the political transition of August 2024, which brought an end to the Awami League's prolonged tenure in power. During that period, an unofficial policy is believed to have been in place whereby examiners were encouraged, if not pressured, to inflate scores in order to present an image of steady progress in education. The consequence was a generation of students whose results often overstated their actual competencies. Now, under a new political dispensation, education boards have returned to strict merit-based evaluation, revealing the true extent of students' academic preparedness. Khondokar Ehsanul Kabir, chairman of the Dhaka Education Board and president of the Inter-Education Board Coordination Committee, stated unequivocally that answer scripts in this year's assessment were marked without any leniency, and no instruction was given to adjust results for the sake of optics. \nThis return to integrity must be continued. If the stricter standards applied this year are relaxed in future years, the 2025 SSC examinees will unfairly bear the burden of this transitional phase, while their predecessors and successors would not be subject to the same level of scrutiny. The government and education boards must regard this year's results as a necessary course correction and remain committed to a path of transparency and merit-based assessment. Future candidates of the SSC and Higher Secondary Certificate (HSC) examinations must be made to understand that the era of grace marks and inflated scores is over, and that success now depends on genuine academic effort and thorough preparation.\nWhile this year's results showed where educational standards really stand, they also present an opportunity to confront long-standing deficiencies in teaching and learning. Notably, the SSC results exposed both the widespread struggles in teaching core subjects like English and mathematics as well as students' lack of seriousness with studies. Policymakers must address both challenges through comprehensive reform. Greater emphasis should be placed on cultivating student engagement and discipline, alongside strengthening teacher training, enhancing classroom interaction, and investing in educational infrastructure including digital learning tools. Only then can this sobering moment serve as the starting point for genuine improvement in the country's education system.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Return to honesty in SSC results",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/return-to-honesty-in-ssc-results-1752331168",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       July 13, 2025 00:00:00  \nNotwithstanding the tariff blitz initiated by the United States (US) President Donald Trump three months ago, global trade registered a modest growth in the first half of the current year. It remains uncertain whether the pace of growth will continue in the second half of the year, as Trump has escalated the trade war by imposing new tariffs on 14 countries, including Bangladesh. He is also set to announce tariffs on other countries gradually by the end of this month. \nEarlier on April 2, Trump imposed 10 per cent universal tariffs on all trading partners, which came into effect on April 5. Besides, he also announced additional tariffs at various rates on more than 60 trading partners, but later suspended the imposition for 90 days, allowing the countries to negotiate with the US. The 90-day deadline ended on Wednesday, and he further extended the deadline up to August 1. Nevertheless, his announcement of new tariffs on 14 countries came on Monday last or two days before his July 9 deadline, reflecting the uncertainty of Trump's tariff policy.\nTrump argued that he is not imposing any fresh tariffs but reciprocating what the trading partners have been doing for a long time. This concept, termed as 'reciprocal tariff', is essentially a response to what the US perceives as unfair trade practices. The Trump administration strongly believes that trading partners are enjoying trade surpluses with the US due to bad trade practices and at the cost of the US. \nFor instance, Bangladesh has long enjoyed a trade surplus with the US as the country exports more than it imports from the US. By applying a simplistic but flawed formula, Trump initially determined the rate of so-called reciprocal tariffs on trading partners. For instance, the US bilateral trade deficit with Bangladesh was $6.16 billion in 2024. Exports from Bangladesh to the US or imports by the US from Bangladesh totalled $8.36 billion in 2024. So, the result of dividing the deficit by the total imports of the US from Bangladesh is 0.74. According to the Trump administration's formula, the figure means that Bangladesh has imposed a 74 per cent tariff on US goods, no matter how unbelievable it sounds. Trump then halved the value to determine a reciprocal tariff of 37 per cent on Bangladesh's exports. \nIn the latest announcement, Trump imposed 35 per cent tariffs on Bangladeshi products imported into the US. As Bangladesh is currently facing an average import tariff of 15 per cent when entering the US market, an additional 35 per cent tariff will result in a total tariff of 50 per cent on Bangladesh. The high tariff will increase the price of Bangladeshi products by at least 35 per cent, making these more costly for US consumers. So, they will reduce the consumption, leading to a decline in demand for Bangladeshi goods. The net result will be a decline in exports from the country to its largest destination. \nTrump, however, hinted that there is still room for negotiation and Bangladesh needs to work hard to get a reduced rate of tariffs. There is a big problem in this connection due to the unpredictability and inconsistency of the Trump administration. Since January 20, when Trump officially assumed the presidency of the US, he has demonstrated a series of inconsistent moves, puzzling everyone. So, it is difficult to predict whether his administration will stick to any deal after the negotiation or push for sudden change within a short time. \nMoreover, during the last couple of years of Hasina's regime, bilateral relations between Bangladesh and the US gradually turned bitter. With strong backing from India, Hasina continued to ignore the necessity of improving the strategic and economic relationship with the US. A few diplomatic missteps were also there. All these squeezed the routes of negotiation for the greater interest of Bangladesh. \nAs a student-led mass uprising in July last year forced Hasina to flee the country and take shelter in India, after killing some 1,400 people, a window of opportunity opened to streamline the bilateral relations with the US. Nevertheless, it is not an easy task. A complex dynamics is at work. The Yunus-led interim government has been trying to move ahead. According to some observers, Trump's return to power in the US made things tough. \nSome are of the view that the imposition of 35 per cent tariffs on Bangladesh is not driven by economic interests only; some geopolitical factors are also there. They also speculate that a strong presence of the Indian lobby may have played a role in Trump's imposition of higher tariffs on Bangladesh. India has been negotiating a bilateral trade deal with the US, and there is a move from the Indian side to corner its trade competitors to some extent. So, it is not unlikely that India has been trying to encourage or instigate higher tariffs on its competitors. India may face a 20 per cent tariff due to a bilateral trade deal, as it is considering providing further tariff reductions on US products.\nThe World Tariff Profile 2025, released by the World Trade Organisation (WTO) last week showed that the bound tariff rate of the US is 3.4 per cent and the MFN applied rate is 3.3 per cent for all products. The simple meaning of the statistics is that the US is committed to the WTO to enhance the tariff rate up to 3.40 per cent on average, although the country is now applying a tariff at the rate of 3.30 per cent on all products on average. For agricultural products, both the bound and MFN applied tariff rates are, however, higher -- 5.0 per cent and 4.20 per cent, respectively. In other words, the way Trump is increasing tariffs is a clear breach of WTO rules and commitments. \nPresident Trump, however, does not care about his country's commitment to the WTO and its members. He also knows that breaching the obligation will not bring any reprisal to his country from the trading partners through the lengthy process of the WTO dispute settlement mechanism. Moreover, during his first term, he blocked the appointment of jurists for the panel, making the Dispute Settlement Body (DSB) of the multilateral trade organisation partially dysfunctional. \nNow, by initiating a systematic tariff war, Trump is driving the other nations to gradually abandon the WTO as a part of his administration's objective to replace the rule-based global order with the whims of powerful nations. Trump and his team believe in the policy of 'might is right', where a few powerful and big nations will dominate and determine the direction of the global order, including world trade. Tariff is the key instrument of Trump to reset the international trading system, where rule-based multilateralism will get a little space.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Trump out to reset the global trade",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/trump-out-to-reset-the-global-trade-1752331267",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       July 13, 2025 00:00:00  \nIt was, to be honest, necessary to burst the GPA-5 bubble. For years, the number of students achieving the coveted GPA-5 (A+) in both Secondary School Certificate (SSC) and Higher Secondary Certificate (HSC) exams had been escalating at astonishing rates. When the grading system was first introduced at the secondary level in 2001, a mere 76 students attained the top grade. Similarly, in 2003, when adopted at the higher secondary level, just 20 students secured the top score. From those modest beginnings, the number of GPA-5 scorers skyrocketed to a staggering 269,602 in 2022, before declining to 139,032 in 2025. A similar exponential rise in high performers has consistently been observed at the HSC level, too.\nAll the while, one critical question lingered: what has improved in terms of teaching quality, curriculum, or assessment that could justify this exponential growth in the number of high performers? Many observers, however, argued that this hyper inflation of GPA-5 achievers was not a reflection of true academic excellence but rather a symptom of systemic grade manipulation. Their suspicions were officially confirmed this year when education board officials, while announcing the SSC results, openly admitted to having received instructions to grade students generously under the previous administration, only to paint a rosy picture of success.\nThis year, however, marked a stark departure from the past, as the interim government instructed the education authorities to publish results that genuinely reflect students' actual performance. This shift has been cited as the primary reason behind the dramatic fall in this year's success rate. The pass rate dropped to 68.45 per cent, the lowest in 15 years, while the number of GPA-5 achievers fell by 43,097 compared to the previous year.\nWhile this positive move reflecting students' actual performance is a welcome development, steps must be taken to ensure that genuinely outstanding students can stand out from the crowd. Those who score the highest marks in their respective education boards are going unrecognised and unappreciated, and their outstanding performances are lost in a crowd of over a hundred thousand GPA-5 achievers.\nEven at this year's rate, 10.62 per cent of SSC pass students secured the top grade of GPA-5. Of course, there is no harm if a large number of students legitimately reach the pinnacle of academic achievement. Considering the immense effort students invest, the tireless dedication of parents doing everything within their means to ensure quality education for their children, the long hours of intensive tutoring and the proliferation of coaching centers, it is understandable that a substantial number of students would attain GPA-5 compared to the initial years of the grading system.\nBut the problem arises when the system churns out more GPA-5 holders than the combined capacity of all public universities, engineering universities, and medical colleges in the country. Securing GPA-5 leads many students to overestimate their capabilities and become complacent, and parents are led to believe their children are among the very best. This illusion, however, is often short-lived as many of these \"brilliant\" GPA-5 holders fail to pass competitive university admission tests. If those with the highest possible secondary and higher secondary grades struggle to secure a spot at the nation's most reputed institutions, what hope is there for the vast majority who narrowly missed GPA-5, or those with an A or A-? \nOf course, more GPA-5 and SSC and HSC pass students mean more students qualifying for admission in all private universities, which is good for their business and reputation. More tutoring, more coaching and more study aids have together turned learning and education into a thriving business. The supposedly bright students and the so-called great universities have kind of become commodities based on GPA where business, not education, is the central theme. The harsh reality, however, is that upon graduation, about 0.8 million students remain unemployed each year.\nSo, it's time to prioritise practical, skill-based learning through technical and vocational education. Simply churning out degree-holders who are unprepared for the job market serves neither the students nor the nation. So, to restore credibility and ensure fair assessment, the government might consider introducing standardised national tests - similar to the SAT in the United States or China's GAOKAO - as a benchmark for evaluating academic readiness beyond GPA scores.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bursting the GPA-5 bubble",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bursting-the-gpa-5-bubble-1752331373",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 13, 2025 00:00:00  \n\nIn behavioural economics, the symbolic and social value of a gift often outweighs its monetary worth. A gift is not merely a material exchange, it serves to strengthen emotional and social bonds.\nRecently, the Government of Bangladesh sent 300 kg of Hari Bhanga mangoes to the Government of Tripura without any conditions or expectations. This simple yet meaningful gesture carries more weight than a financial transaction. \nIt creates a sense of goodwill and psychological obligation on the part of Tripura's Chief Minister and his administration. In future discussions, whether related to trade, water-sharing, or border cooperation, Tripura is now more likely to respond with empathy and openness.\nThis is a classic example of a \"social contract\" being established through gifting, an unspoken agreement rooted in the natural human tendency to reciprocate kindness. By choosing a culturally significant and high-quality gift, Bangladesh has conveyed respect, friendship, and diplomatic warmth in a way that resonates emotionally.\nImportantly, the mangoes were framed as a symbol of goodwill and friendship, not a transactional offer. This positive framing ensures that the gesture is seen as a form of relationship-building, rather than manipulation.\nFrom a behavioural economics perspective, this was a smart and effective social investment. The pleasant experience of receiving the mangoes is likely to leave a lasting impression on Tripura's leadership, potentially shaping a more favorable and cooperative stance in future engagements.\nUltimately, this event illustrates that diplomacy is not solely conducted through formal agreements or financial leverage. Subtle, thoughtful gestures rooted in human psychology can play a powerful role in shaping international relationships.\nKash Ahsan\nDuaripara, Mirpur, Dhaka\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Gift and behavioural economics",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/gift-and-behavioural-economics-1752331387",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-07-2025"
    }
]