[
    {
        "full_article": "The Election Commission of India (ECI)’s SIR of electoral rolls, being held in 12 States and Union Territories (UT), demands urgent judicial scrutiny due to its implementation and its base methodology. While the Supreme Court continues to hear challenges to the constitutionality of the SIR process pioneered in Bihar, the same flawed approach is being persisted with in other States. Voters are to fill enumeration forms delivered by Block Level Officers (BLO) and match their details against electoral rolls from 2002-2005. Though data from Bihar suggest that the process did not dramatically alter election outcomes, it saw a sharp decline in the gender ratio of the electorate. Other localised distortions also warrant concern. The ECI claims that enumeration forms have been delivered to most electors in the 12 States and UTs, but genuine voters continue to scramble for forms, and confusion persists about the documentation required for enrolment on the draft rolls due next month. The guideline mandating that BLOs visit households appears to be only on paper. The Gauhati High Court, in Dr. Manmohan Singh (1999), interpreted requirements in the Representation of the People Act, 1950 expansively: an ordinary resident is a habitual resident with the intention to dwell permanently — whom any reasonable person would accept as a resident of that place. Operating from this principle, the ECI and the judiciary have historically presumed that any resident adult was, by default, a valid voter.The SIR inverts this presumption. Regardless of having voted earlier, every elector must now prove their legitimacy against old records or documents listed by the ECI. This shifting of the burden, from the state to citizens, risks major disenfranchisement, especially married women and migrants, as in Bihar. As courts have recognised, a strict interpretation of the “ordinarily resident” requirement can vitiate the democratic process. During hearings on Bihar, the Court focused on implementation, placing the onus of protecting genuine voters on party representatives and legal volunteers. It did not examine whether the enumeration form methodology passes constitutional muster, nor did it address persisting inaccuracies in revised rolls — likely a consequence of harried BLOs leaving errors uncorrected. The ECI could have chosen a more patient door-to-door verification to ensure universal adult franchise, complemented by technology-driven deduplication. Instead, it doubled down on an approach that prioritises “purifying” the rolls over protecting the franchise. As the SIR expands, the Court must move beyond procedural oversight to examine the process’s constitutional foundations. What is essential is a clear directive restoring the burden of accurate enrolment to the ECI rather than leaving citizens to prove that they belong on rolls they have been on for years. Published - November 28, 2025 12:30 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        Assam\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        marriage\n                    \n                            /                      \n                        \n                        migration",
        "headline_1": "​Burden of proof: On SIR 2.0 and the voter",
        "headline_2": "The SIR’s enumeration process of putting the onus on residents to prove eligibility is flawed",
        "link": "https://www.thehindu.com/opinion/editorial/burden-of-proof-on-sir-20-and-the-voter/article70331482.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-11-2025"
    },
    {
        "full_article": "As the dust finally settled at Guwahati’s Barsapara Cricket Stadium on Wednesday, India’s dominance as a Test host was lying in a shambles. Seemingly invincible at home and with an aura that made former Australian captain Steve Waugh refer to India as the final frontier, rival units struggled to stay afloat. But empires do crumble and that reality overwhelmed Rishabh Pant’s men as South Africa won the second Test by 408 runs and seized the series 2-0. Last year, the visiting New Zealanders swept the Test series 3-0, and now it is Temba Bavuma’s turn to trigger a coup. The South African captain led astutely, both at Kolkata and in Guwahati, and his men’s excellent performance reiterated their defending champion status in the ICC World Test Championship. Coach Gautam Gambhir is facing intense scrutiny though under his watch India drew the away Test series in England and won the ICC Champions Trophy and Asia Cup. But the sudden vulnerability in Tests at home sticks out like a sore thumb. It is a fact that over the last few years, personnel have changed and India no longer features Virat Kohli, Rohit Sharma, R. Ashwin and Cheteshwar Pujara in Test whites. Meanwhile, Ajinkya Rahane has been dropped and Mohammed Shami is yet to find his way back.Change is inevitable; but India’s downfall in home Tests has been steep. The absence of injured captain Shubman Gill in the second Test was a hard blow, and the rest of the batters failed to raise their game. The adrenaline rush and instant gratification that limited overs cricket offers seem to have dulled the survival instincts of many players. The patience to build a Test innings, the ability to bat for time, and the nuanced way of countering spin, have all waned within the ranks. There is talent in the squad, but the constant shuffling of players and an over-dependence on too many all-rounders have unsettled the playing eleven. Off-spinner Simon Harmer and left-arm speedster Marco Jansen bagged 17 and 12 wickets, respectively, through the series, and exposed chinks in the Indian batting armour. Over the last four decades, India had pedigreed batters at number three and four. Dilip Vengsarkar-Mohinder Amarnath; Rahul Dravid-Sachin Tendulkar; and Pujara-Kohli, have all done duty. It is time to find reinforcements while the batting core will revolve around Gill, K.L. Rahul and Yashasvi Jaiswal. All-rounder Ravindra Jadeja, the last of the stalwarts, is 36. True, transition is a work in progress but spearhead Jasprit Bumrah and his bowling mates must be hoping to have more runs to defend from their batting colleagues. Published - November 28, 2025 12:15 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        cricket\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        South Africa\n                    \n                            /                      \n                        \n                        ICC\n                    \n                            /                      \n                        \n                        Asia Cup Cricket",
        "headline_1": "​Domestic trouble: On Indian cricket and home Tests",
        "headline_2": "Indian cricket’s traditional strengths are now seen as vulnerabilities",
        "link": "https://www.thehindu.com/opinion/editorial/domestic-trouble-on-indian-cricket-and-home-tests/article70330601.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-11-2025"
    },
    {
        "full_article": "Reviews are fundamental to running everything better, from courts to govts to science to tech\nThe Supreme Court must not fret that many of its decisions are being reviewed by other SC benches. Indeed, no one in any position of authority, big or small – newspaper editors will figure in the list of those with very small authority  – should get miffed if their decisions are subject to another scrutiny. Stuff happens all the time – for better or worse. How will decision-making get better without reviews? Courts, parliaments, scientific bodies, they all rely on the power of review to write better judgments, improve upon legislation, and have research pass the test of peer assessment. Imagine a world without review. The hangman would be terribly busy, it would be a not-so-funny comedy of errors of bad law, broken software, dangerous medicine. As it is, there are, these days an alarmingly large number of people who believe WhatsApp univ, which reviews nothing, carries the wisdom of Nalanda, even if they can’t quite tell you where or what Nalanda is.\nReviews have transformed whole countries. One of the most dramatic reviews ever was by India in 1991. Govt discovered its forex wallet, designed as per the best socialist principles, was empty. Liberalisation followed. Industrial licensing? Reviewed. Trade policy? Reviewed. Foreign investment? Reviewed. Cut to the present. Think tech. Recall BSOD. The Blue Screen Of Death hit the world last July. That massive outage knocked out global tech. Windows retired the infamous blue – after Microsoft’s review decided it was time to junk it. Even relationships can course-correct only if there is recognition that a pause & pivot is called for – whether with partners or as parents of teens.\nSo, those in authority mustn’t view a call for a  review as an affront to their ego, or an insult to their intelligence. This comment, for example, went through a process of pre-publication review. But it may read even better after a post-publication review. The same holds for any number of things far more important than a newspaper editorial. Nothing, including SC judgments, is sacred. None of this is to question that homespun American wisdom: if it ain’t broke, don’t fix it. But, if it’s broke, buddy, and it needs fixing, don’t jinx it.\n\n",
        "headline_1": "If It’s Broke, Fix It",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/if-its-broke-fix-it/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-11-2025"
    },
    {
        "full_article": "CWG is returning to India, but what do collapsing basketball poles say about our sporting aspirations?\nIn his heyday, former NBA ace Shaquille O’Neal weighed over 140kg, yet when he slam-dunked, which he did very often – 2,626 times over a 19-year career – basketball frames didn’t collapse on him. Nor do they collapse when NBA players – average weight 98kg – make 11,000-odd dunks every season. How, then, do we come to terms with the deaths of Aman Kumar and Hardik Rathi, wiry slam-dunking teens crushed under the weight of such frames in Haryana, on Sunday and Tuesday?\nLet’s not call them “accidents”, because that pushes both deaths beyond the realm of human agency – factors beyond our control. Did the frames collapse because their steel poles were heavily corroded, and they were no longer fit for purpose? Yes, but that only explains why the frames fell, not the loss of two lives. Aman and Hardik are no more because the authorities – despite being alerted about the rickety condition of the poles – remained unresponsive. Perhaps because repairing or replacing a few feet of steel pipe in a rural sports complex isn’t a major KRA for them, with a ribbon-cutting opportunity at the end.\nVideo of the frame falling on Hardik in Rohtak has horrified the whole country. In losing the two boys we have lost promising players who could have been part of our 2030 Commonwealth Games squad. Basketball is one of the sports under consideration for the Ahmedabad edition of the Games, and Hardik was already a national-level player. For now, officials in Haryana have gone into overdrive, ordering checks across sports facilities, but it’s a cue for other states too. They shouldn’t wait for something to happen in their jurisdiction – as they did with contaminated cough syrup – before swinging into action.\nIt’s good that CWG will return to India after 20 years, and hopes are already pinned on our 2036 Olympics bid. These mega events make sports a talking point, and can draw new talent to track and field. They also repay their vast outlay by rejuvenating host cities. But after the Haryana tragedies, we must ask, are we merely prepping to be glittering venues for big games, or going in with the determination to win big? If the latter, we must prove it to our players and athletes with actions, not words. There’s a lot that needs doing – fixing broken sports infra is only one part. How we select players, train and treat them matters even more\n\n",
        "headline_1": "Pole Position",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/pole-position/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-11-2025"
    },
    {
        "full_article": "We now have proof that our babudom is renowned for its devotion to work\n“I love work,” wrote Jerome K Jerome in his Idle Thoughts of an Idle Fellow. “Come to my study and I’ll show you loads and loads of work which I’ve collected over the years and which I can’t bear to part with. I sit and stare at it fascinatedly for hours on end.”\nHad he been around today Jerome would have established kinship with India’s bureaucracy, our all-pervasive babudom which shares with the English author an attachment to work, a love for labour so great that it cannot afford to part with it at any cost.\nJust how great that love is has now been quantified in a report about a month-long ‘Cleanliness Drive’ of govt offices conducted in Oct.\nAccording to the personnel minister, Jitendra Singh, the sale of the scrap collected in the course of the drive generated nearly 800cr, a financial engine of growth sufficient to buy seven Vande Bharat trains.\nThe clearance of scrap, largely in the form of pending files and other paperwork, freed 233 lakh sq ft of office space.\nThe Union minister said that in the past five years the special Campaign for Cleanliness, which was inaugurated in 2021, earned from the sale of scrap nearly 4,100cr, a literally astronomical figure that he said was enough to fund “multiple” Chandrayaan moon misions.\nThe total space cleared came to 923 lakh sq ft, an area that could accommodate a large mall or a similarly capacious building.\nOur babus obviously are so fond of their files and other paperwork, all safely preserved and tied up with red tape, that they cannot bear to part with them until prodded to do so by ministerial diktat.\nIndeed the revenue so earned, presumably from the raddiwalla, will help in part to pay babu salaries, a consideration that might well induce them to become even more adhesive to their work.\nThe libertarian aphorism goes that that govt is best which governs least. A bureaucratic version of this could be that that babu works best who works least.\n\n",
        "headline_1": "Labour of love",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/labour-of-love-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-11-2025"
    },
    {
        "full_article": "Pundits have pronounced the four new labour codes, notified by Centre last week, ‘revolutionary’. Several trade unions have instinctively marked them anti-labour and vowed to carry out nationwide protests in response.\nBoth are over-reacting. Surely, notifying labour codes five or six years after enactment cannot be greeted as revolutionary. Surely, if 19 state govts have already increased the threshold of retrenching workers without central govt permission to firms with less than 300 workers from the earlier threshold of firms with less than 100 workers, notifying the same provision under the Industrial Relations Code cannot be revolutionary. ‘Finally!’ sounds like a more appropriate reaction.\nRead full story on TOI+\n\n",
        "headline_1": "Labour’s still not decoded",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/labours-still-not-decoded/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 28, 2025 00:00:00  \nBangladesh, long celebrated as a global success story in poverty reduction, now confronts one of its most daunting challenges in nearly a decade. A new World Bank assessment warns that as many as 62 million Bangladeshis are at risk of sliding back into poverty. The WB, through its projection that poverty will rise to 21.2 per cent by 2025, delivers an unmistakable message that the future is far from rosy; and that efforts to curb the prevailing trend would call for multifaceted action plan. \n The findings, presented in Dhaka under the title \"Bangladesh Poverty and Equity Assessment: Navigating the Road to Prosperity\" paint a complex picture of progress, stagnation and growing vulnerabilities. Bangladesh lifted 34 million people out of multidimensional poverty between 2010 and 2022, reducing extreme poverty from 12.2 per cent to 5.6 per cent. Yet the momentum that once defined the nation's poverty narrative has slowed sharply since 2016. The signs of strain are everywhere --- in the labour market, stagnant wages, shrinking manufacturing base and in the inflationary pressures that continue to erode household resilience. One of the starkest concerns highlighted in the report is the weakening of labour income. Between 2010 and 2016, labour income accounted for nearly 90 per cent of progress in livelihoods, buoyed by industrial expansion and modest agricultural growth. But over the following six years, that contribution dropped to barely half. The shift reflects deeper structural changes: urban poverty is rising, job creation in manufacturing has slowed, and agriculture, despite its dynamism, cannot provide the pathways to upward mobility for the country's expanding workforce. The effects are particularly harsh on women, youth, and low-skilled workers. Urban female labour-force participation has fallen from 34 to 24 per cent, while educated young women face some of the highest unemployment rates. One in five young women remains unemployed, while one in four educated young women is without a job. These setbacks speak of broader systemic barriers that undermine the inclusive growth the country needs.\n The WB report also exposes troubling weaknesses in social protection. Despite expanded government spending, targeting remains inefficient: half of the poorest households receive no assistance, while over one-third of the richest do. Subsidies, especially in energy, continue to disproportionately benefit better-off urban groups. For millions teetering just above the poverty line, the absence of an effective safety net means any kind of shock --- a medical emergency, a job loss, a climate-driven disaster --- that could push them into destitution. Climate change threatens to undo decades of rural development with 13.3 million people projected to be displaced by 2050 and agricultural GDP vulnerable to severe declines. \n Experts at the WB report's launch echoed a growing consensus that growth alone is no longer enough. Bangladesh must translate economic expansion into broad-based opportunities through stronger job creation, vibrant manufacturing, skilled workforce, market-enabling reforms, more equitable fiscal policies and better targeted social protection programmes. The path forward requires shaping the country's development architecture against the background of the failings and shortcomings.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Fighting the complex web of poverty",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/fighting-the-complex-web-of-poverty-1764258083",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       November 28, 2025 00:00:00  \nWhen about 2.0 million people of a country fall below the poverty line in a year, it certainly points to that country's economic malaise. But if this follows the previous year's more than three million people's plunge into poverty with no projection of a turnaround in sight, the nation has reasons to be particularly alarmed. In this case, although fewer people in Bangladesh have become poorer in 2025 than those in 2024, it does not indicate that still fewer people will be poorer in 2026. The World Bank's latest report, \"Bangladesh Poverty and Equity Assessment 2025\" released on Tuesday last finds that the poverty rate is going up to 21.2 per cent in 2025 from 20.5 per cent in 2024. The projection is dire with 62 million tottering on the precipitous positions of vulnerability and slipping into poverty. Overall, more than one-third of the population is at risk. \nThe WB has pointed out that the macro-economy has worsened since 2023 and at the same time social inequality has yawned. Pitted against poverty rates of 2024 and 2025, the rise of the millionaires ---not referred to by the WB in the report---can make an interesting reading. In the eight to ten months before September last, this year, 10,980 new millionaires were created. Even in the politically tumultuous year 2024, the number of millionaire bank accounts of Tk10 million at the least increased by 5,173, of which 4,954 in the last quarter. It is also the time when1,657 millionaire accounts disappeared following Sheikh Hasina's exit. \nSo the macroeconomic deterioration may have its seeds hidden in factors not found in copybook economy. The explanation for the unresolved development miracle and social progress in Bangladesh lies in extra economic contexts. In a system that keeps avenues open to favoured elements for their move up the ladder, the poor and neglected have little opportunities, particularly when the accumulated money is either laundered or not in circulation or investment. The economy stagnates in such uncertain times. A decelerated growth is the outcome. This has exactly happened in case of Bangladesh. Thus the GDP growth at 6.0 per cent in 2023 is projected to plummet to just 4.0 per cent in 2025. \nAlthough this country follows free-market open economy, essentially it does the opposite with the businesspeople calling the shot and the bureaucracy perpetuating its stranglehold on the broad spectra of important areas of national interests. It is the lesser mortals who have to suffer the most because they are voiceless. At a time when the public servants are going to have higher pay packages, the ordinary people are being deprived of not only the minimum basic income but are also finding themselves without employments. This is despite the historic lowest implementation of annual development programme (ADP). The systemic discrimination and disparity sink deep. \nNow, these are known facts but what the less known but most important point is how to bring an end to the perpetually systemic arrangement for righting the wrong, allowing equal opportunity for all to move up the socio-economic ladder. This certainly calls for restraining the ballooning of profits and doing away with speed money or graft. When the educated and privileged from business circle and bureaucracy keep the infamous system running to their mutual benefit, the duty of dismantling the bastion falls on the shoulders of young blood. The July-August uprising presented a golden opportunity for the nation to create an exploitation-free society. But this has been squandered by those who were charged to oversee such a social transition. \nAlthough the WB has mentioned the widening inequality in Bangladesh society, it is more a lip service than a serious commitment to uphold the virtue of narrowing down the existing disparities. Macroeconomic stability with trickle-down benefits for the deprived and marginal people would be enough to appease the Bretton Woods institutions like the WB and International Monetary Fund IMF). The archaic system in operation in countries like Bangladesh serves as a breeding ground for moneyed people---a class of oligarchs. Contrarily, the poor and marginal people are consigned to the vicious cycle of poverty. Projects such as social networks programmes may help keep the body and soul of the vulnerable people together but do not allow the new generation from such social settings to break the cycle to lead a dignified life.\n\nWhen the market is monopolised for outrageous profits leading to high inflation, it is the poorer segments of society that are hit the hardest. Thus victims of river erosion and cyclone or floods are relegated to floating people and beggars in urban centres. But if the country could elevate itself to a welfare state, this kind of human tragedy could be avoided. Instead of giving rise to more crorepatis, a state welfare fund would have been created for rehabilitation of the victims of natural calamities. Even climate refugees could be given a better deal for their survival with dignity and a chance for their children to receive education for a livelihood option. There is no alternative to creating job opportunities for the unemployed multitudes. \nUnless this yawning social divide can be bridged by some radical economic programmes with investment in human capital, lives and livelihoods of the extreme poor are not going to change for the better. But the transformation of the mindsets of the bureaucrats and political leaders ought to happen first in order to comprehensively change the social fabric. This is how the today's poor can be transformed into tomorrow's consumers, triggering the momentum of economic and social progress sustainably.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Addressing biting poverty and moribund economy",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/addressing-biting-poverty-and-moribund-economy-1764258171",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       November 28, 2025 00:00:00  \nMuch has been written, discussed about and warned against the vulnerability of Dhaka to major earthquakes. Yet very little has changed in the way buildings are constructed here. Seismologists, who claim that Bangladesh sits on active fault lines, have long been warning that a strong earthquake could be catastrophic, particularly for the densely populated Dhaka city where unplanned construction has been the norm. These warnings often fall on deaf ears. We, as a nation, do not give due attention to any potential disasters until they strike. Public awareness tends to surge after such incidents but we do not take much time to forget them after an initial hue and cry. The recent 5.7 magnitude earthquake, which claimed at least 10 lives, injured several hundred people, and cracked numerous buildings, shook the nation. Many families, particularly in Dhaka, temporarily left the city and several educational institutions suspended class in fear that a bigger disaster might strike at any moment. The fear is not misplaced as Dhaka with countless faulty high-rises, narrow lanes, and congested neighbourhoods has already become one of the world's most at-risk megacities in terms of earthquake damage. The fear has, however, started to subside and we will not hear anything about it months later.\nWhy is Dhaka highly vulnerable to earthquakes? One of the reasons is the pervasive disregard for building construction regulations. The Bangladesh National Building Code is in place to ensure structural integrity. But it is rarely followed in practice. Violations have become a norm - from design and approval to construction and inspection. Developers often use inferior materials and compromise on steel reinforcements and foundation designs. Besides, the approved building height is ignored and floors are added without permission. These flaws make buildings too weak to withstand even moderate tremors. Another aspect - the sheer density of structures - heightens their vulnerability.\nSeismologists and urban planners warn that if an earthquake of magnitude 7.0 or above strikes near the capital could be devastating. A 2015 BUET study estimated that nearly 78,000 buildings in Dhaka were at high risk due to structural weakness. Around 300,000 more buildings were found to have moderate risk factors.\nThe situation is not limited to Dhaka. Rural areas, once dominated by corrugated tin and wood-made homes, are now seeing a rapid increase in the construction of multi-storey structures. Concept of structural engineers and soil testing is absent in the construction of such structures in rural areas as well as in small towns.\nCorruption, negligence and a lack of awareness play the most significant role in this crisis. The approval of building plans often takes place through unofficial means, bypassing technical scrutiny. Besides, the enforcement of the National Building Code is weak because regulatory bodies lack manpower, resources, and in many cases the will to act. Most homeowners lack awareness of structural vulnerability and assume their buildings are safe as long as they look solid from the outside. They do not know earthquake resistance comes from engineering, not appearance. Bangladesh seriously lacks another important thing - comprehensive retrofitting initiative, which can improve safety, sustainability, and performance of buildings. Despite facing recurring tremors, the country has no such initiative at the national level.\nGiving due attention to the risk of earthquakes has been overdue for Bangladesh, which is seeing fast growing urban population, combined with vertical expansion. The country must strictly enforce building codes, conduct structural audits, discourage unauthorised floors, and implement retrofitting initiatives. The capacity and authority of regulators such as the RAJUK should be strengthened so that they can ensure compliance. Public awareness is also essential for a change in the situation.\nThe recent quake should serve as a wake-up call. If we accept it as a wakeup call and act accordingly, we will be able to minimise the loss of lives and property in any event of a powerful earthquake. Otherwise we may lose everything - property and lives of our own and our dear ones.\nrahmasrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Tremors shake the nation, but not its conscience",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/tremors-shake-the-nation-but-not-its-conscience-1764258225",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 28, 2025 00:00:00  \n\n People entering the early phase of their careers are facing several challenges. The job market is stagnant, highly competitive and rising inflation has pushed salaries below real living wages. Many graduates also face strong social pressure to join traditional corporate jobs, even when they have the potential to pursue something on their own. In our society, a low-paying corporate job is often seen as more respectable than becoming an entrepreneur.\nMost corporate workplaces in our country demand long office hours. While a few companies offer two-day weekends, the majority do not. As a result, young professionals are experiencing weight gain, hypertension, sleep deprivation and early onset of lifestyle diseases such as diabetes and high blood pressure. Despite working long hours, salaries often fall short of what is needed to survive in an expensive city like Dhaka. People are forced to borrow and can become trapped in a debt cycle for a long time.\nThis lifestyle also limits the time people can give to their families and personal well-being. Over time, this cycle leads to demotivation and burnout. Although the government makes policies for public-sector employees, it intervenes very little in the private sector. For the sake of society, this needs to change so that people can maintain a healthier and more balanced work-life environment.\nRafid Alam\nDhaka\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why young professionals are burning out",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-young-professionals-are-burning-out-1764258245",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-11-2025"
    }
]