[
    {
        "full_article": "Tamil Nadu and Karnataka are planning to implement a two-language formula for school education, as opposed to the push for a three-language policy in the National Education Policy (NEP) 2020. Both States are inclined towards primacy for local languages, Tamil and Kannada, respectively, and then English in school education. Tamil Nadu has already unveiled its State Education Policy (SEP) while a commission has submitted its recommendations for Karnataka’s SEP. Tamil Nadu has merely reiterated its existing two-language policy, but Karnataka is set to discontinue its three-language policy. The commission has proposed that Kannada or the child’s mother tongue should be the medium of instruction up to Class 5, and preferably till Class 12. Kannada or whatever is the mother tongue and English will be the two compulsory languages. If implemented, this will replace the model that includes Hindi as a third compulsory language. Other recommendations include moving away from NCERT textbooks and developing a Karnataka-specific curriculum and bilingual teaching methods. The Tamil Nadu SEP, which was announced by Chief Minister M.K. Stalin recently, makes Tamil compulsory up to Class 10 across all boards. The NEP proposes a third language which should be Hindi or another Indian language, seen as an attempt to impose Hindi.The Tamil Nadu SEP also commits to promote critical thinking, digital literacy, climate education, and social justice. Apart from a STEAM (Science, Technology, Engineering, Arts, Mathematics) approach, the State also wants to offer special support for tribal students, first-generation learners, and students with disabilities. The government has pledged more support for public education. In fact, uniform high quality public education should be the biggest priority of school education policy for all States and the Centre. The Centre’s ill-advised focus on language turns unproductive and controversial even though it does not insist on promoting Hindi on paper. The three-language policy is also in disregard for the demand for English language learning, and as a medium of instruction across States, including in the Hindi-speaking regions, and Gujarat and Maharashtra. Education policies have been a major driver of the development outcomes in Tamil Nadu and Karnataka, and any attempt to forcibly alter them by central policies would do no good to anyone. Tamil Nadu is fighting for the release of ₹2,152 crore in education funds from the Centre that is rightfully its. There is no harm in learning Hindi or any other language, but when perceived as a political project of domination, its promotion causes resistance. The Centre must give up its language obduracy and focus on several critical challenges in school education. It must work with State governments to tackle them.\r Published - August 11, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Karnataka\n                    \n                            /                      \n                        \n                        language\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        Tamil\n                    \n                            /                      \n                        \n                        Kannada\n                    \n                            /                      \n                        \n                        English\n                    \n                            /                      \n                        \n                        school\n                    \n                            /                      \n                        \n                        children\n                    \n                            /                      \n                        \n                        climate change\n                    \n                            /                      \n                        \n                        science (general)\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        engineering\n                    \n                            /                      \n                        \n                        arts and science education\n                    \n                            /                      \n                        \n                        mathematics\n                    \n                            /                      \n                        \n                        Hindi\n                    \n                            /                      \n                        \n                        Gujarat\n                    \n                            /                      \n                        \n                        Maharashtra\n                    \n                            /                      \n                        \n                        development\n                    \n                            /                      \n                        \n                        government",
        "headline_1": "​Language lessons: On Tamil Nadu, Karnataka and State Education Policies",
        "headline_2": "The obsession with Hindi is diversion from the needs of school education",
        "link": "https://www.thehindu.com/opinion/editorial/language-lessons-on-tamil-nadu-karnataka-state-education-policy/article69916793.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "11-08-2025"
    },
    {
        "full_article": "The decision by Israel’s Security Cabinet to expand the war and seize control of Gaza City is a direct affront to mounting international concerns over the appalling humanitarian crisis in the Palestinian enclave. The world’s leading genocide scholars, along with international and Israeli human rights organisations, say Israel is committing genocide against Palestinians. Two former Israeli Prime Ministers have come out against the war, while most former IDF and intelligence chiefs have called for its end. Global outrage intensified over Israel’s forced starvation, which caused famine and the deaths of children from malnutrition. Even France, the U.K. and Canada, some of Israel’s closest allies, have demanded a ceasefire and promised to recognise Palestinian statehood. Yet, Benjamin Netanyahu, Israel’s discredited Prime Minister, who is facing an arrest warrant at the International Criminal Court, has not paid any attention. He has said that there was no starvation in Gaza even as images of skeletal children have shocked the world. He has gone against the concerns of the IDF’s top command to secure approval from the Security Cabinet for his plan to take control of Gaza. This would extend the offensive into the coastal strip stretching from Gaza City in the north to Khan Younus in the south, where thousands of displaced Palestinians have now squeezed themselves into tents, makeshift shelters and bombed-out buildings.Mr. Netanyahu says that he intends to take full control of Gaza, but does not wish to keep it. He cannot be trusted. In April 2024, he claimed Israel was “a step away from victory”. In March 2025, he broke a ceasefire and resumed the assault, and imposed a blockade on Gaza, which triggered the starvation crisis. Two of his Cabinet colleagues have repeatedly called for Israel to seize Gaza, expel its Palestinian population and resettle the enclave with Jews. The way Israel has been conducting the war and its decision to expand the offensive only reinforce the argument that its intention has always been to take over the enclave, even at the cost of expelling its over two million residents. Israel is able to pursue this course only because of its military, financial and political support from the West, particularly the U.S. European governments must move beyond verbal criticism and adopt concrete measures to hold Israel accountable for its crimes, like they do with other rogue states. And if U.S. President Donald Trump, who calls himself ‘a man of peace’, does not want to be complicit in these atrocities, he should demand that Mr. Netanyahu end the war immediately. Published - August 11, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Israel\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        human rights\n                    \n                            /                      \n                        \n                        France\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        Canada\n                    \n                            /                      \n                        \n                        population\n                    \n                            /                      \n                        \n                        crime\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        international court or tribunal",
        "headline_1": "Graveyard Gaza: On Israel’s Netanyahu and control over Gaza",
        "headline_2": "The West must pressure Israel to end the war immediately",
        "link": "https://www.thehindu.com/opinion/editorial/graveyard-gaza-on-israels-netanyahu-and-control-over-gaza/article69916749.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "11-08-2025"
    },
    {
        "full_article": "A lesson in blinging Trump, from Tim Cook\nWe all expected Trump’s second term as president to be theatrical and whimsical. But none of us expected American companies to be in competition with him. Enter Apple, whose pocket-sized cleaning cloths cost nearly ₹2K, and real products set you back by half your net worth. The posh iPhone maker subtly reminded us that very little is made in America – except Trump’s tantrums. \nIn a move that was definitely the trigger for the recent US back and forth on the tariff on gold bars, Apple presented the US prez with a slab of Gorilla Glass on a gold stand, etched with his name and Tim Cook’s signature. The highlight? The glass was made in America. So was the gold rump holding it. \nNot a single cheesy part of this artistic masterpiece, to celebrate American manufacturing, was from China, India, or any other country on Trump’s vengeance list. \nThis minimalist memorabilia, dazzling to no one except Apple, was peak Apple. It was true to their product philosophy – refinements so marginal that unless your eyes watered from reading the fine print, you would miss that you upgraded to a pricier iPhone, for a change of colour and one millimetre more of display. I know this from constantly comparing models to keep my FOMO in check. \nI was so excited by the choice of ‘Gorilla’ glass that I went over the Apple press release, hoping they would have subtly hinted that the gift was a touching nod to the big boy in the room. But alas, Apple does subtle only for its products. Their press release was plain as day. They announced an extra $100bn in US investments, and said they would “directly hire 20,000 people in US – the vast majority focused on R&D, silicon engineering, software development, and AI and machine learning”. They will nudge their vendors to hasten US manufacturing, but nope the iPhone will still not be made in US. \nThe good news for Apple – and for everyone else – is that nobody reads the fine print. So, for heaven’s sake India, give Trump a golden chappal (our internationally renowned Kolhapuri will do) stamped MAGA, and negotiate zero tariffs. Nothing says charm offensive like a bit of flattery dressed as a lot of business intent.\n\n",
        "headline_1": "Golden chappal diplomacy?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/golden-chappal-diplomacy/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-08-2025"
    },
    {
        "full_article": "There are no good options for Ukraine in Trump-Putin talks, but some may be better than others\nFriday will likely be wet in Alaska when Trump and Putin meet to discuss an end to the Ukraine war. The venue might make Putin wistful, for Alaska, like Ukraine, was once part of the Russian empire, sold to America in 1867 for 2 cents an acre. But the former KGB Lt Col is famously inscrutable, and when asked if he would annex Alaska after Crimea, in 2014, replied: “What would you need Alaska for?”\nAlaska’s either too cold for Putin, or as a realist, he accepts its status as a fait accompli. Likewise with Crimea. He’s held it since a choreographed referendum in 2014, and considers it a fait accompli for the rest of the world. Europe doesn’t, but Trump, whose politics are 100% transactional, might for a deal, which has become a matter of prestige for him. In April, he told Time: “Crimea will stay with Russia…Zelenskyy understands that.” \nBut a Russian Crimea isn’t a fait accompli for Zelenskyy. On Saturday, he made it clear that his people “will not gift their land to the occupier”. It’s a position that Indians can appreciate. Although Pakistan illegally occupied a part of Kashmir over 75 years ago, India will never sign it off. There’s a very clear distinction between de facto and de jure possession. Ukraine’s seal on Crimea’s Russian occupation will permanently end its claim on it. And this is a likely sticking point in whatever deal Trump and Putin thrash out.\nFrom Zelenskyy’s point of view, the fact that he’s been left out of the negotiations, is equally problematic. His people have fought Russia at great national cost for over 40 months. To now buy peace on Russian terms – endorsed by Trump – would be galling. But that might be the only peace on offer when Russia has been gaining ground. Putin’s reportedly offered to end hostilities if Ukraine gives up Donetsk and Luhansk as well.\nZelenskyy’s in an unenviable position. If he rejects a Trump-brokered deal, he might find US military and other aid cut off. Fighting has already taken a heavy toll – Ukraine’s GDP is where it was in 2008, and one of the lowest in Europe. He can swallow the bitter pill now, and take his country on a path of growth, backed by his Western friends. It’s an unpalatable fait accompli, but also a realistic off-ramp for his country. \n\n",
        "headline_1": "Zelenskyy’s off-ramp",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/zelenskyys-off-ramp/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-08-2025"
    },
    {
        "full_article": "Flexibility in retirement age is the way forward, India or West \nAir India pilots will retire at 65, bringing parity between two merged entities – Tatas’ Vistara, and GOI’s Air India that the Tatas bought. But it’s not parity alone, there’s also a shortage of commercial pilots. So, it’s a timely and rational decision. Globally, the world of work is going through a pivotal moment as longevity, declining fertility and manpower shortage are coming together to impact workforce composition and pension systems. The set of reasons driving the leaving-work conversation may be different, but the answer, in India as well, lies in raising the age, given capacity and ability of healthy older workers, and the necessity of easing pension burden.  \nOver half the developed nations are raising retirement age – average age within OECD countries will soon be 66. Germany last Sept incentivised later retirement to balance worker shortage and pension burden. Spain too incentivises postponing retirement – putting it off by a year from the legal age, increases pension by 4%. Incentives increase with each year of postponement, with exemptions for those with more than 38 years and 6 months of worklife. Japan and Singapore re-employ post-retirement, hours and pay negotiated between employee and employer.\nIn India, it has long been argued, wrongly, that pushing back retirement chokes career pathways for large populations of younger cohorts. The truth is, it is a stymied job market and lack of opportunity that’s the chokehold on youth aspirations. State govt after state govt has increased the retirement age of teachers and medical practitioners, because of a shortage of resources. India Inc is doing it regularly. Veterans bring expertise, experience, ability and stability. A large section of urban India lives well past 80, but are benched between 58 and 60 in fit working condition. Economic Survey 2018-2019 noted a higher retirement age was crucial for the viability of pension system, “perhaps inevitable”. The way forward is for retirement age to have as much flexibility as the young would have with workhours, working conditions and workspaces.\n\n",
        "headline_1": "Flying longer",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/flying-longer/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-08-2025"
    },
    {
        "full_article": "Until early August, the tariff sparring between Washington and New Delhi looked like another familiar round over soybeans. With China halting purchases and harvests approaching, it seemed like the US was looking for a buyer in India, as soybean farmers are a key MAGA base for Trump. Then, over just three days, the story shifted — from agriculture to a high-stakes game of geopolitics.\nUnder the pump: US domestic politics and midterms have a lot to do with this pressure on India to cut purchase of Russian oil\nOn Aug 6, President Trump’s negotiator, Steve Witkoff, met Russian president Vladimir Putin in St Petersburg for over three hours. Though billed as “constructive”, the talks yielded no major breakthrough. That same day, the White House announced an extra 25% tariff on Indian goods — lifting effective duties toward 50% — and framed the decision partly around New Delhi’s continued intake of discounted Russian crude. In India, this was perceived as arm-twisting of its sovereignty, but a larger strategy was at play.\nThe urgency in Washington comes from geopolitics as much as economics. The Ukraine war remains a key focus. In recent months, Russia has made incremental gains in Ukraine, giving it little reason to compromise. Official data showed a year-on-year rise in oil and gas revenues earlier this year, giving the Kremlin fiscal space to sustain the war. On another front, BRICS members are pushing for local-currency energy trade pilots. July’s Rio summit saw Brazil and others call for “economic sovereignty” from the dollar. If those systems take root, US sanctions will have less bite. It appears the White House wants to hit Russian revenues while the leverage window remains open.\nThe domestic political calendar makes this even trickier. The midterms are barely a year away and while inflation has eased, it remains sensitive to fuel prices. Even a small Brent crude spike can quickly translate into higher gasoline costs, eroding consumer sentiment and complicating the Federal Reserve’s path to cutting interest rates — a move the administration sees as vital to sustaining growth into 2025. A direct embargo on Russian oil would risk that spike, so Washington needs other channels.\nSince 2022, India has vaulted from a marginal buyer to Russia’s largest swing customer, taking roughly 1-1.8m barrels of crude a day. Unlike private refiners tied to long-term contracts, India’s state-owned refiners can quickly adjust their spot purchases when prices or risks change. If India reduces its spot purchases by 200,000 to 300,000 barrels a day, Russia may have to offer bigger discounts to other buyers, cutting its revenue by billions over a year. This would pinch Moscow’s earnings and avoid a price surge that hurts American consumers. China, a larger buyer of Russian oil, has so far been spared to avoid disrupting US supply chains and ongoing tariff talks. Early signs suggest the tactic is having a marginal effect in India. One major state refiner recently reported a lower share of Russian crude as discounts narrowed. This is the kind of fine-tuning Washington is aiming for.\nFor New Delhi, the irritation is real. It has watched Washington oscillate between warm words and hard edges — like this tariff move that risks raising Indian fuel costs while shielding US consumers. Yet this is also a moment to read beyond the headlines. Pakistan, despite entering this cycle with less leverage, has found its way into Trump’s good books by using a cryptocurrency gambit and backing his bid for a Nobel Peace Prize. This has helped it carve out a tariff deal. India’s own leverage is far greater: market size, strategic geography, technology and defence partnerships, and a pivotal role in energy flows. The smart play is to deploy that leverage to meet Trump’s immediate need in exchange for wins of India’s choosing. When both sides know they hold valuable cards, the game would be to trade them well, rather than escalate.\nThis standoff is about much more than tariffs or a few oil shipments. For Washington, it is a test of whether it can squeeze Russia’s war chest without spiking global fuel prices, hold China in check, and prevent the BRICS bloc from hardening into a true economic counterweight — all while keeping US inflation low enough for interest rates to fall. For New Delhi, it is about using its position as the swing buyer in the world’s most strategic commodity to protect its autonomy, avoid an unnecessary rupture with America, and still extract tangible gains.\nThe outcome will influence far more than trade flows. It will help decide who has the upper hand in setting oil prices, which currencies dominate energy trade, and whether the next global economic order tilts toward US-led systems or a more multipolar, BRICS-shaped architecture. How India and the US play this hand could echo for years in energy markets, currency systems, and the balance of global power.\n\n",
        "headline_1": "Decoding US moves: Tariffs on India aren’t about India",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/voices/decoding-us-moves-tariffs-on-india-arent-about-india/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 11, 2025 00:00:00  \nThe gruesome murder of journalist Asaduzzaman Tuhin on Thursday evening in Gazipur has left both the journalist community and the entire nation shell-shocked. It once again underscores the grave dangers media professionals face in the line of their duty to inform the public, as well as the appalling state of the country's law and order. According to initial police reports, Asaduzzaman Tuhin was filming a crime scene involving a honey trap and a gang of criminals chasing the victim with sharp weapons. When the attackers realised that they were being filmed, they demanded he delete the footage. Upon his refusal, they hacked him to death on the spot. The barbaric killing took place during the busy evening rush hour at Chandina Chowrasta intersection, with many onlookers standing by. The crowd only started gathering around Tuhin's lifeless body once the attackers had fled, pointing to the utter helplessness of common people today.\nEven though the government often tries to claim that the law and order situation is improving, those claims seldom reflect the reality. Criminality has reached such menacing proportions that members of the public are regularly being swindled, mugged, kidnapped, and murdered. This is evident from nationwide murder statistics recorded by the police between January and June this year. According to a report published in a vernacular daily, while from 2020 to 2023 an average of 1,613 murder cases were filed nationwide every six months, the first half of the current year saw 1,933 cases filed. Meanwhile, certain areas have become particular crime hotspots, including Gazipur, where, according to media reports, as many as 103 murders occurred in the last seven months. Thus, the law-and-order issue continues to baffle the nation, with the government claiming improvement while ordinary people suffering endlessly due to the deteriorating situation. \nThe murder of the journalist in Gazipur is linked to the deteriorating law and order, but it is also a direct assault on free press. Following the ouster of the Sheikh Hasina's authoritarian regime, journalists had started reporting with a renewed sense of freedom. The interim government has also pledged its commitment to free press and freedom of expression. However, when media houses are targeted by vested groups who incite mobs, and criminal gangs assault reporters for their work, there is cause for serious concern. A recent report published by the human rights organisation Ain o Salish Kendra (ASK) revealed that from January to June this year, there were 66 incidents of journalists being attacked while on professional duty across the country. During the same period, there were a total of 196 incidents in which journalists faced threats from law enforcement officers and political activists, as well as cases filed against them for publishing news. How can so many incidents of harassment and violence against journalists occur under a government that has pledged to ensure press freedom? True, the government, as it often claims, may not be controlling media houses, but why could it not ensure an enabling environment where journalists can report without fear or favour? Journalists, like people in general, feel threatened when their colleagues are murdered or assaulted.\nThe Home Adviser and senior police officials should take stock of the situation. Although in most recent sensational cases the police have been able to swiftly arrest the perpetrators, these arrests are not working as a deterrent. There are reports of hardened criminals coming out of jail on bail and re-engaging in criminal activities. To address this, the rule of law must be tightened as a matter of top priority. Culprits must be tried in a speedy tribunal and face the full force of the law.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Murdered journalist and some questions",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/murdered-journalist-and-some-questions-1754838014",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       August 11, 2025 00:00:00  \n\nThe interim government's decision to increase food aid through vulnerable group feeding assistance during the lean days of ban on fishing to the fishermen families is a commendable move. Notably, the fishing ban comes on two occasions for 22 days between October 12 and November 2 to protect mother hilsas so they can spawn and for 58 days between April 15 and June 11 in the Bay of Bengal to help preserve marine biodiversity, ensure safe breeding and replenishment of fish stocks, particularly hilsa during its breeding season. \nSo far, each fishermen family has been getting at the rate of 25 kg of rice per month during the 22-day ban on hilsa catching and 40 kg of rice per month for 58-day ban on all types of fishing in the Bay. But now, according to the decision of the Department of Fisheries, it has been proposed that the quantity of rice for the fishermen during the 58-day ban would be increased to 50 kg per month. In a similar fashion, for 22-day ban, too, the rice amount would be increased proportionally for the fishermen families to protect their livelihoods. Undeniably, such steps would help the fisherfolk to somehow scrape through the difficult days without work. \nEvidently, the measures have been introduced to control overfishing which has been behind the near depletion of te indigenous fish stocks. Triggered by rainfall and floods, hilsa migrates to our rivers from the Bay of Bengal to breed during the monsoon season, especially between July and September. Such upstream migration of hilsa also takes place from January to March. But predatory, illegal fishing using trawlers and nets with small size mesh such as gilll net (current net), drift gell net (gulti/kona jal), monofilament gill nets (current jal) and seine nets (ber jal), etc., has been threatening the existence of not only hilsa but also other popular local fish species. \n Adult hilsa stock started to dwindle as its juvenile members (jatka) were being caught recklessly by the fishermen. \nThe successive governments have been using bans, strict action with the help of the administration, local government and Bangladesh Coast Guard (BCG) to stop illegal and predatory fishing. Helping fishing families with food support during the period when fishing is restricted is essentially a kind of incentive so they do not engage in illegal fishing. No doubt, all these actions have been of substantial help to protect the country's indigenous fishery resources, particularly the hilsa stock. However, from time to time reports appear in the media about the dire prospect of hilsa due to river pollution, climate change, possible changes in migratory behaviour of the fish and so on. And, indeed, there are often reports of poor catch in the sea and rivers and delays in harvesting season. But at the end of the day, hilsa finally appears in large numbers to the relief of the fish merchants, though not to the general consumers. \nSo, we still witness abundant supply of hilsa in the capital city's wholesale markets like Karwan Bazar and other hilsa wholesale markets in the country such as Chandpur Boro Station in Chandpur town and Barisal Port Road Hilsa Market. Of course, this testifies to the success of the government measures to protect this national fish from disappearing from our rivers and the Bay. \nHowever, what is the use of having a lot of hilsa in the market, if the general consumers cannot afford it? Should this commodity not also follow the law of supply and demand? But no, to all appearances, hilsa in Bangladeshi markets does not go by this universal rule. For it is always selling at extortionate prices, regardless of the supply situation. The price is forever sky-high, come hell or high water. Why is this strange behaviour of the hilsa market that deprives the common consumers of this national fish? According to reports, this season, hilsa is selling at far higher prices in Bangladeshi markets than in West Bengal of India. Why this should be the case, when the West Bengal's hilsa market depends largely on the supply from Bangladesh whether through official or unofficial channels. \nSometimes the argument put forward by some experts was that it is the difference in the timing of fishing ban between Bangladesh and West Bengal that caused this strange price differences. For instance, in the beginning, Bangladesh authorities would place the fishing ban from May 20 to July 23, while for Indian fishermen, it was between April 15 and June 13. That means, the Indian fishermen were catching hilsa one month ahead of their Bangladeshi counterparts. Obviously, Bangladeshi fishing community was put at a disadvantage vis-à-vis it's the Indian one. And this might have some impact on the pricing of hilsa, though it could not explain exactly why there should be such pricing anomaly when the volume of hilsa catch in Bangladesh waters is far greater than that in West Bengal. However, in the face of demand for aligning the fishing ban regime with that of India, from this year the ban was imposed between April 15 and June11. But has it made any difference so far as price of hilsa in Bangladeshi markets this season amid profusion of supply is concerned? Recent media reports say, a small sized (500-gram) hilsa costs between Tk.1,450 and Tk.1,600 per kg in the capital's retail markets. \nAnd those weighing between 700 and 800 grams are selling between Tk.1800 and Tk.2,000 per kg. For hilsas of larger size, weighing 1kg or more, the price rises from Tk.2,000 per kg to Tk.3,200 a kg, subject to the whims of the hilsa traders. But in the Kolkata markets of West Bengal, a 500-gm hilsa costs between Indian Rupee, INR600 and INR750, which is equivalent to between Bangladesh Taka BDT834 and BDT1042.50 (at the rate of I INR=1.39BDT). Compared to Kolkata prices, the hilsa is between 153 per cent and 174 per cent pricier in Dhaka markets. For hilsas of larger size, the prices escalate proportionately. Clearly, it is yet another syndicate we are talking about that is in control of the hilsa market to the dismay of general consumers. Even two to three decades back, the picture was quite different, particularly in the capital's retail fish markets. Hilsa, though a popular delicacy, it was not among the priciest fishes in the market, despite its supply shortage and low production. It was rather cheap and affordable to the people in the low-income bracket. But things began to change about decade back when prices of hilsa began to rise disproportionately, though its supply increased significantly, thanks to various government measures. But then what's the use of abundant catch of hilsa, if it remains beyond the common people's reach?\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why is hilsa out of reach?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-is-hilsa-out-of-reach-1754838077",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 11, 2025 00:00:00  \n\nCorruption is a persistent problem in emerging nations such as Bangladesh, and finding a solution seems increasingly difficult. Those involved in corrupt practices often remain disconnected from the public, while those with political ties frequently evade justice. Corrupt officials gain power through elections, and the wealthy and influential consistently avoid legal consequences.\nThe media regularly exposes corruption scandals, sparking public outrage. Yet, how can a government effectively manage the state when individuals previously accused of corruption now hold positions of authority and are portrayed as community leaders?\nEradicating corruption will remain challenging until society collectively rejects it. Unfortunately, even the most corrupt individuals often find their way into politics. It is well known that election campaigns in our country cost between 100 and 200 crores of taka. The origins of this funding are rarely scrutinised, and few dare to question it.\nWhile the Election Commission regulates candidate eligibility, the extent of politicians' own financial contributions during campaigns remains largely unknown. The public, however, can discern who is sincere and who is not. Despite existing laws, corruption persists. So, what is the solution?\nThe answer lies with the public. Voters must identify those who misappropriate taxpayer money and reject them through the ballot. Without this collective awareness and action, corruption in Bangladesh will be impossible to eliminate.\n\nMd Tousif Raihan\nGraduate\nDepartment of Criminology and Police Science\nUniversity of Chittagong\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Corruption must be shown zero tolerance",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/corruption-must-be-shown-zero-tolerance-1754838101",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 11, 2025 00:00:00  \n\nSocial Islami Bank PLC (SIBL) was once the flagbearer of Shariah-compliant banking in Bangladesh. However, it quickly gained national notoriety for all the wrong reasons. Billions of taka were unceremoniously siphoned off through questionable loans to a politically influential conglomerate. What was meant to be a bank founded on ethical and Islamic values turned into an institution known for reckless lending. The crisis was so profound and the loss of trust so deep that depositors rushed to withdraw their money, like passengers abandoning a sinking ship. This episode underscores how insecure governance, weak regulations, and political influence can jeopardise the entire financial system.\nYet, a broken bank can be restored if the right measures are taken. One effective approach would be the creation of a government-backed Asset Management Company (AMC) to take over SIBL's toxic and nonperforming loans. This approach is akin to isolating infectious patients in a hospital to prevent disease spread. South Korea successfully employed this model after the 1997 Asian Financial Crisis, and Bangladesh could adopt a similar strategy for SIBL. By cleaning up the bank's balance sheet, SIBL could resume normal operations and attract new, creditworthy customers.\nStrategic recapitalisation is also critical. Bangladesh Bank should invite respected local and international investors to inject capital by subscribing to shares. These new investors must be free of political ties and embody ethics and transparency. Think of them as skilled doctors stepping in to save a critically ill patient. They will restore capital and public trust. Meanwhile, all stakeholders involved in the scandalous activities must be legally removed. An independent board of directors, comprehensive audits, and strict oversight must be mandatory. No board member should have ties to borrowers. SIBL must also commit to full transparency by regularly publishing reports and disclosing the names of large loan recipients, ensuring the bank has nothing to hide.\nAtikur Rahman \nStudent\nBBA Department\nNorth South University \natikur.rahman.nsuf@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Fixing the crisis at SIBL",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/fixing-the-crisis-at-sibl-1754838126",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-08-2025"
    }
]