[
    {
        "full_article": "India carried out precision military strikes across nine locations in Pakistan and Pakistan-occupied-Kashmir early on Wednesday (May 7, 2025). Targets included Bahawalpur, the headquarters of the Jaish-e-Mohammed, and Muridke, a nerve centre of the Lashkar-e-Taiba — terrorist outfits bred by Pakistan to target India. India said the strikes were to destroy the camps used to train terrorists and to “pre-empt as well as deter” more such cross-border attacks following the terror attack in Pahalgam on April 22, 2025 in which 26 people were killed by terrorists who identified the targets by their religion. India’s military strikes were “measured, non-escalatory, proportionate, and responsible”, the government said. In 2019, India had carried out surgical strikes in Balakot in Khyber Pakhtunkhwa in north Pakistan, after the Pulwama terrorist attack. The response this time has been sharper and more resolute. Muridke and Bahawalpur are in Punjab, the heartland of Pakistan’s ruling elite, that has been playing the double game on terrorism. Pakistan has, for decades, used terrorism as a low-cost instrument of war against India, under an umbrella of nuclear blackmail. India has been trying to figure out an appropriate response to this. With Balakot, and now Operation Sindoor, the point is clear — India can have an overt military response in the event of a terrorist attack against it, apart from economic and diplomatic measures. India has also underscored the point that there were no civilian, economic or military targets on Wednesday.Overt military action in response to Pakistan-sponsored terrorism marks a change in India’s strategy under Prime Minister Narendra Modi. How this will change Pakistan’s behaviour remains uncertain. The strikes destroyed terrorist bases, but that setback may not be long term, considering the perennial supply of radicalised youths in Pakistan. Pakistan has not only raised terrorists who target India but also harboured Osama bin Laden, the most wanted terrorist for the West, even while it was claiming to be an ally in the war on terror. Pakistan’s character will have to change if it is to behave differently. India has reached out to other countries, and world powers must use their considerable leverage to coerce Pakistan to act responsibly. The retaliatory strikes apart, the investigation into Pahalgam should continue in full vigour and be taken to its logical conclusion. India should also watch out for escalatory moves by Pakistan and be prepared to respond militarily and diplomatically. The Centre on Wednesday pointed out that the terrorists wanted to disturb normalcy in Kashmir and create communal rift in the country. All political parties have supported the military operation. While strengthening the domestic political consensus on the issue, the Centre should also ensure that elements who try to create communal strife and play into the hands of Pakistan are restrained. Any missteps will carry a great risk. Published - May 08, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        Pulwama attack 2019\n                    \n                            /                      \n                        \n                        Balakot Air Strikes\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Jammu and Kashmir",
        "headline_1": "​Strokes of justice: On ‘Operation Sindoor’ and after",
        "headline_2": "India must be prepared for escalatory action by Pakistan",
        "link": "https://www.thehindu.com/opinion/editorial/strokes-of-justice-on-operation-sindoor-and-after/article69550051.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "08-05-2025"
    },
    {
        "full_article": "Amid a disturbing rate of deceleration in global development and a growing divide between the rich and the poor, India has inched up on the Human Development Index. In the 2025 Human Development Report, ‘A Matter of Choice: People and Possibilities in the Age of AI’, released on Tuesday, India ranks 130 out of 193 countries, from 133 in 2022. It registered an HDI value increase to 0.685 in 2023 from 0.676 in 2022. Coming on the back of two debilitating pandemic years, it can be said that India’s recovery has been strong in the three fields HDI measures: “a long and healthy life, access to knowledge and a decent standard of living”. India’s life expectancy, at 72 years in 2023, is the highest level it has reached since the inception of the index in 1990 (58.6 years). Children, the report noted, are expected to stay in school for 13 years on average, up from 8.2 years in 1990; and Gross National Income per capita has risen from $2,167.22 in 1990 to $9046.76 in 2023. It gave a shout out to programmes such as MGNREGA, the Right to Education Act, the National Rural Health Mission and other initiatives for the improved status, but also sounded a word of caution about rising inequality, particularly significant income and gender disparities.\rThe female labour participation rate may have risen to 41.7% in 2023-24, as the Economic Survey of 2024-25 pointed out, but a stronger ecosystem needs to be built to ensure women join the workforce and are able to retain their jobs. There is a lag in political representation of women as well with no indication yet when the constitutional amendments reserving one-third of legislative seats for women will come into force. Underprivileged girls and boys still struggle to get an education, and until this anomaly is corrected, India’s HDI value will not rise. Though the report highlights that 13.5 crore (of India’s population of 144 crore) “escaped multidimensional poverty” between 2015-16 and 2019-21, income and gender inequalities have pulled down India’s HDI by 30.7%, “one of the highest losses in the region.” The thrust of the HDR this year was on AI and how human beings may benefit from it on development parameters. India, it said, has been able to retain 20% of AI researchers, up from nearly zero in 2019. Going forward, India must leverage AI to deliver on many fronts from agriculture to health care, education to public service delivery. But it is imperative that proper policy and safeguards are in place to thwart the risk that AI may deepen existing inequalities.\r Published - May 08, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        society and human capital\n                    \n                            /                      \n                        \n                        poverty\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        Artificial Intelligence\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        health\n                    \n                            /                      \n                        \n                        Economic Survey",
        "headline_1": "​A step up: On India and the 2025 Human Development Report",
        "headline_2": "As India climbs up HDI rankings, rising inequality poses challenges",
        "link": "https://www.thehindu.com/opinion/editorial/a-step-up-on-india-and-the-2025-human-development-report/article69549433.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "08-05-2025"
    },
    {
        "full_article": "In planning & execution, Op Sindoor was flawless. It’s also a warning to those in Pak considering escalation\nWhen India struck terrorist camps across LoC in Sept 2016, to avenge Uri, the world was surprised. Same after Balakot. Op Sindoor takes payback for terrorism to another level. The rubble of JeM’s Markaz Subhan Allah HQ in Bahawalpur bears the eloquent imprint of Indian resolve. Eight other terrorist camps located 9-30km inside Pakistan-controlled territory also lie pulverised. That this havoc was wrought in a span of 25 minutes yesterday shows how India’s resolve to punish terrorists and their masters has hardened, and its capabilities have matured, under Modi.\nIf the scale of India’s retaliation for Pahalgam is unprecedented, its planning and execution are flawless. After the massacre of 26 tourists in Pahalgam on April 22, calls for a swift Balakot-like response were growing, but govt resisted the pressure, giving the military time and a “free hand” to plan an operation. Meanwhile, it turned the screws on Pakistan by other means, like suspending cross-border trade and the Indus Waters Treaty.\nOperational secrecy was maintained so well that the missiles, when they hit home, literally caught everyone napping. JeM chief Maulana Masood Azhar has acknowledged that some of his close aides were killed in the strike on his Markaz in Bahawalpur. But the significance of these strikes goes beyond the body count. An attack deep inside Pakistan’s Punjab province should make it clear that, when it comes to pursuing terrorists, no place is off-limits anymore. As Modi promised after Pahalgam, they will be pursued “to the ends of the earth”.\nAt the same time, Op Sindoor is a highly measured action. Great care was taken not to hit military or civilian sites. India has emphasised that it struck terror camps in the light of credible warnings of more Pahalgam-like attacks. The intent is “non-escalatory”, but it’s up to Pakistan now to ensure things don’t get out of hand. India does not harbour terrorists, and if Pakistan attacks Indian military or civilian targets, the responsibility for what happens afterwards is on it. So, if Pakistan’s blustering army chief Asim Munir wants a face-saver, he should factor in a hard Indian response. And he shouldn’t count on ‘Iron brother’ China, which, in a careful statement, has merely termed India’s action “regrettable”, and urged “both sides to act in the larger interest of peace and stability”.\nIf Munir and others in Pakistan are wondering who – India or they – has the bigger stomach for a fight, they should look at their stock market, which tanked on Wednesday, while India’s held its nerve. That’s a huge change from 2016, when the Sensex plunged 465 points on news of India’s surgical strikes. This new India is confident and ever ready to pay back in a bigger coin.\n \n\n",
        "headline_1": "9 Strikes, 1 Message",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/249941/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-05-2025"
    },
    {
        "full_article": "It’s an image for the ages. At the first govt briefing about the precision strikes against Pakistan-based terror hubs, Indians got to see a powerful snapshot of the way of life that Operation Sindoor was launched to protect. It was in two languages. Both sexes were represented. Flanking foreign secretary Vikram Misri were two soldiers, both women, one Muslim and one Hindu. Namely, Colonel Sofiya Qureshi of the Indian army and Wing Commander Vyomika Singh of the Indian air force.\nThe particular heinousness of the Pahalgam attack lay in how it segregated the men and the women, the Hindus and Muslims, the tourists from the locals. The intention was crudely clear. To undermine one thing: Indian society’s idea of itself as united and strong. Images of officers Qureshi and Singh told the world how steely, enduring and magnificent this idea of India is. It is possible that the press briefing left Pakistan as stunned as the precision strikes.\nThe confident but sober disposition of the Indian women officers would be foreign, even offensive, to many in Pakistan. Deepening radicalisation hasn’t just deprived women and men of autonomy there, it has brought fractiousness even to Pak army ranks. Their ability to defend themselves has been hollowing alongside what they are defending. In their determined hugging of an imagined past, Pakistanis have kept falling behind forward-looking Indians. As a national identity gets trapped in fear, anxiety and hatred, everything that’s attractive about it drains away.\nThe constitutionality that has arrested the communal arc in India has also enabled the kind of human flourishing that Colonel Qureshi and Wing Commander Singh represent. This inclusivity and excellence is the best part of us. This is what we are fighting to defend. It is pretty special not just in South Asia, but in the whole world. \n\n",
        "headline_1": "Two women officers and the idea of India",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/two-women-officers-and-the-idea-of-india/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-05-2025"
    },
    {
        "full_article": "My grandfather was a devoted, if not particularly gifted, gardener. Our terrace was lined with earthenware pots where jasmines and tuberoses grew in the summer and roses in the winter. Every year, sometime in October, my grandfather would broach his plans for the winter seasonals — this year, we would agree, unlike the last many years, the dahlias will be as large as a man’s hand and the marigolds tight as a child’s fist around an unexpected candy. We would come back from Gariahat market carrying bags of damp earth (“best quality from Hooghly”) and the pomace left after pressing out mustard oil, its potency confirmed by its repulsive odour.\n\nMy job was to empty the pots and break up the clods, reluctantly bringing chaos into the lives of a hundred peaceable earthworms, before mixing our old dirt with the new. One year, when I was eight or nine, I decided to launch an agricultural project of my own. With a spoonful of cement from the kind man who was fixing our terrace, I blocked the drainage hole at the bottom of a pot to have the standing water one needs for rice to germinate and planted a handful of unhusked rice that our cook had found while cleaning the rice and discarded. The grains turned into green shoots that I carefully transplanted in other pots. In due course there was rice, a whole handful that I peeled off the sprigs and proudly brought to our cook to ask him to get them husked and make rice. I still recall the look of infinite contempt that quickly flashed over his face before he patiently explained that there was not enough for one mouthful.\n\nIf this was an appropriate learning experience for a future development economist, Cheyenne’s memory of being lost among the cherry tomatoes seems to presage a future artist. Her father, like my grandfather, found gardening a bit mysterious and frustrating, but this one time the cherry tomatoes went wild in their front yard. Cheyenne, looking for the sweetest of them all, found herself surrounded by plants a foot taller than her, laden with bright red fruits, but no dad in sight. These days, Cheyenne does the gardening, but she has stayed away from growing vegetables. As for me, my one attempt to grow flowers in our then front garden in Cambridge was such a disaster (weeds everywhere, dead plants, poor landscaping) that an obviously irate neighbour came to warn us that we were depressing everyone’s property values.\n\n\nILLUSTRATION CREDIT: Cheyenne Olivier\nMany amateur gardeners find gardening hard. And yet the world over, poor rural families manage to do it successfully enough to make farming the single largest occupation in the world. Nearly 900 million people, more than 10% of the world, farm for a living, by a recent Food and Agriculture Organisation estimate. And this does not include all those, mostly women at least in India, who grow their own chilies and curry leaves, tulsi and lemongrass on a tiny plot of land adjacent to their homes, or in pots on their porch. I have an indelible memory of being somewhere in central Bengal, interviewing a woman whose face was framed by two beautiful, velvet green winter melons ( chaal kumro in Bangla) hanging from the bamboo eaves of her hut. One side of her little house was crisscrossed by creepers that went onto her roof, filtering the sunlight through the mosaic of giant leaves and yellow flowers.\n\nInterestingly, when we surveyed poor families in rural Udaipur district in the early 2000s, while more than 90% said they worked in agriculture, only 17% said farming was the main source of their earnings. This is a pattern that shows up in many places in the world today, very different from how it was, for example, in India 100 years ago.\n\nWhat explains this pattern? Why don’t they give up farming and specialise in whatever else they do that pays most of their bills? Why does almost every poor family we surveyed in Udaipur own some little land? A part of the answer is that in many developing countries like India, living in the city is expensive and/or unpleasant for low-income families. The shortage of decent affordable housing is acute — the choice is usually between crowding into a slum or spending 4-5 hours a day commuting. Many migrants, therefore, prefer to leave their families in their home village and make regular trips back. The land in their village gives them a place to call home, and something for their family to do while they are away (they will often come back for the planting and the harvest).\n\nFor policy makers in many low and middle-income countries, who are often acutely aware of just how inadequate their urban infrastructure is, this continuing attachment to the village takes a bit of the pressure off. Even China, the most dramatic example of large-scale urbanisation in our times, movement to urban areas was strictly regulated through the hukou system (residence registration) to ensure demand for housing did not outpace its supply.\n\nLand ownership also offers a form of social security in places where the state does not offer one. If you lose your job, it is a way to feed the family and survive. In China, in the depression after the Tiananmen Square episode in 1989, a large portion of the urban labour force went back home to cool their heels. Farming is what sustained them. Something similar happened in India and many other countries during the pandemic.\n\nOf course, this requires the households to worry about future uncertainty enough to hold onto the land. It is not clear that they always do: when things are good, they may be tempted to sell the land and take a job elsewhere, but if the job suddenly vanishes, they will still need to be supported by the community or the state. This is another reason why the state may try to force them to hold onto a certain amount of land — that way they have something to fall back upon.\n\nThis might explain the unique position of land as an asset in many countries in Asia, Africa and Latin America. What farmers call their own land isn’t actually theirs to sell, though they might have been farming it for generations. For example, until recently, land in China remained state property to be allocated to households for cultivation based on need. At least in theory, families that were too busy to cultivate their land were meant to lose it to those with unemployed hands. Elsewhere, such as in the northeast of India, but also in large parts of Africa and the Mexican ejidos, for example, the decision to sell land rests with the community. And even where there are no legal restrictions on land sales, as in much of India, there is a strong sentiment attached to land that belonged to the family ( baap-dada ki zamin ), which probably serves a similar purpose. I see that pride on the face of our cook when she offers me a bilati amra (apparently called hog plum in English) that grew in her family’s garden south of Kolkata. With a pinch of salt and some chili powder, it makes a rare healthy snack that I adore.\n\nThere are other commitment advantages to keeping some land in the family: if something happens to the main income earner or he (it is typically a man) simply abandons them, it can provide a minimum sustenance. In Africa, for example, unlike in India, land that a woman brings into the marriage or acquires as a part of her bride-price continues to belong to her even if the man marries again.\nIndeed, this attempt to codify the special social role of land can go even further. A study by my wife and colleague Esther Duflo and Chris Udry from Northwestern University, finds that in Côte D’Ivoire, there are three types of land in each marriage. There is land that the man controls and cultivates, whose produce belongs to him and he might use in whatever way he pleases; land his wife controls and cultivates and whose produce belongs to her; and land, which the father is expected to cultivate, to grow “appreciated crops”, crops that can only be used for the welfare of the children. The main example of such a crop turns out to be yam, which both feeds the family and gets sold in the market, but the money from it can only be used for things like children’s education. This seems to be a way, in a setting where men often marry multiple times, for each wife and her children to have a long-term claim on the father’s time.\n\nBut beyond all this careful social engineering, in a world where women often live very circumscribed lives where they mostly get to do the drudge work and rarely get credit for the results, having a bit of land offers them the pleasure of being able to deliver something delicious and/ or beautiful to the family. I remember the joy with which my aunt, who never worked outside and never had a child, would make karaishutir kochuri (breads stuffed with peas) for us, “with peas”, as she would say with her slightly withheld smile, “from my own garden.”\n\nThis is part of a monthly column by Nobel-winning economist Abhijit Banerjee illustrated by Cheyenne Olivier. \n\nRECIPE: Karaishuti diye begun pora\n(Smoky eggplant salad)\nHere is a recipe for when the peas are at their sweetest…\n Pop 500 gm of peapods and boil the peas till cooked but not mushy (6-8 minutes). Char two eggplants of 500 gm each that have been scored with a sharp knife (or 3 or 4 smaller ones) on a gas fire or under a broiler till the skin is mostly burnt and the flesh is falling apart. Cool. \nDiscard the skin and the stem. Mash the flesh and leave in a colander for any liquid to drip out. Mix with the cooked peas, ½ cup minced red onion, 1 heaped tablespoon finely chopped ginger, 2 thinly sliced green chilies, ¼ cup chopped cilantro, ½ cup finely chopped tomato, 2 tbs mustard oil, and 1 tsp salt (or to taste). Serve with slightly charred bhakris or phulkas.\nILLUSTRATION CREDIT: Cheyenne Olivier\n\n",
        "headline_1": "Urban dreams, rural roots: Why millions still farm",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/tasting-economics/urban-dreams-rural-roots-why-millions-still-farm/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-05-2025"
    },
    {
        "full_article": "We keep inventing names for those who rule – or want to rule – over us\nIs Elon Musk, Donald Trump’s sidekick, the archetypical broligarch? Are broligarchs like him turning America, the world’s most vaunted democracy, into a broligarchy?\nBroligarchy is a word coinage that combines the term bro, the abbreviation for brother, with archy, derived from the Greek word for rule or govt. \nA broligarchy is defined as a govt or administration in which an elite group of extremely rich men, generally CEOs of tech companies, call all the shots in forming national policies.\nWhile Musk has been called the world’s first broligarch, tech oligarchs such as Jeff Bezos and Apple’s Tim Cook are also members of this totemic tribe.\nBroligarchy, first used on Twitter in 2009, made its debut in print in 2024 and is the latest archy to join the hierarchy of those who rule, or want to rule, our lives.\nA monarchy, from mono, meaning one, is a state in which a single person, a king or queen, holds power. An oligarchy is where a small group of wealthy or influence-wielding individuals are in command. \nA patriarchy is the political and social governance by men while matriarchy, which in our male-dominated world is extremely rare, is rule by women.\nDespite this proliferation of archys, we in India seem bent on creating more and more of them. Those of us who would like the country to turn its back on the constitutional provision of secularism might be labelled as advocates of Hindutvarchy.\nProponents of promoting Hindi at the expense of regional languages, want to establish a Hindiarchy, a state of affairs likely to be opposed firmly by those determined to preserve regional rights in a federarchy.\nThe growing demands of some groups who seek to impose taboos against the consumption of specific foods might be deemed to be supporters of a veggiarchy, while their non-veggie opponents might be all for carnivorarchy.\nWith all these conflicting archys, India might truly be said to live up to its description of being a functioning anarchy.\n\n",
        "headline_1": "Archy types",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/archy-types/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-05-2025"
    },
    {
        "full_article": "We are extremely concerned by the eruption of fighting between India and Pakistan in a sharp escalation of hostilities between the two nuclear-armed neighbours following the April 22 Pahalgam terrorist attack, in which 26 people were killed. Reportedly, in the early hours of Wednesday, India launched \"precision strikes\" on what it claimed were nine sites of \"terrorist infrastructure\" inside Pakistan. Declaring the attack to be an \"act of war\" and vowing retaliation, Pakistan also claimed to have downed five Indian Air Force jets during the attack. At least 38 people were reported killed in these incidents—Islamabad said 26 civilians were killed by India's missile strikes and firing, while New Delhi said at least 12 died from Pakistani shelling.\n\nWe must say this turn of events—while not exactly shocking given the recent escalations marked by harsh rhetoric and retaliatory measures from both sides—is as tragic as it is dangerous. If India continues its campaign and Pakistan acts on its pledge of \"corresponding actions,\" there is no telling where this will end and at what cost. It could lead to a wider conflict and inflict untold suffering across the region. The two countries have fought three wars in the past, and the current fighting already promises to be the deadliest confrontation in decades. Even though India claims its actions under the so-called Operation Sindoor have been \"non-escalatory in nature,\" and that \"no Pakistani military facilities have been targeted,\" nationalist sentiments festering within the countries could make it difficult to adopt a reconciliatory gesture or turn away from aggression.\n\nThe momentum for the latest flare-up has been building for some time. In the two weeks since the Pahalgam attack—for which India blamed Pakistan, which the latter denied—both sides took various tit-for-tat measures against each other, including expelling diplomats, suspending visas, closing border crossings, etc. Many expected these developments to escalate to some sort of cross-border strike—as seen after the Pulwama attacks which had left 40 Indian paramilitary personnel dead in 2019. While world leaders have urged restraint and de-escalation after Wednesday's attacks, both countries have yet to show any willingness to take the first step toward compromise or even negotiation.\n\nWe don't need to remind them of the dangers of continuing along this path. The longer they delay meaningful dialogue, the closer they risk edging toward a catastrophic conflict. Moreover, this is not just their problem anymore—it affects all of us in the surrounding regions. Already there are fears, and early signs, of disruptions in many shared sectors and services. It is, therefore, imperative that both governments urgently pull back from the brink, heed international calls for restraint, and engage in direct talks to defuse tensions. The international community, headed by the UNSC, also have a responsibility to mediate and convince them to focus on identifying/pursuing the real culprits, instead of fighting among themselves.\n",
        "headline_1": "We don’t want to see another war",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/we-dont-want-see-another-war-3889101",
        "news_paper_name": "The Daily Star",
        "publish_date": "08-05-2025"
    },
    {
        "full_article": "Two weeks after the terror attacks in Pahalgam, India-administered Kashmir, India launched missiles into Pakistan-administered Kashmir and Pakistan under \"Operation Sindoor,\" described as a precision strike. At the time of writing, India and Pakistan have polar opposite claims regarding the strikes. From Pakistan's perspective, Indian strikes have killed 26 people, including a child, as reported by The Guardian and Reuters. On the other hand, the Indian government said in a statement that attacks were directed at nine non-military targets, and \"terrorist infrastructure.\" \n\nIt is too early, and rather preliminary, to conclude that India-Pakistan tensions have escalated to a \"war.\" But it is also impossible to rule out further escalations, and that uncertainty is what makes the current situation all the more concerning.\nThe scale of the attacks has surpassed historical precedence where the tit-for-tat exchanges did not result in a wider war. Prior to Indian strikes on Wednesday, Indian Prime Minister Narendra Modi had announced on Tuesday, without specifically mentioning Pakistan, that India's water will flow and \"be conserved for India's benefit.\" Withdrawing from the 65-year-old Indus Water Treaty has been India's fiercest diplomatic offensive in response to the Pahalgam attacks, and Pakistan has vowed that any attempt by India to stop water flow would constitute \"an act of war.\"\nPakistani military spokesperson Lieutenant General Ahmed Sharif Chaudhry, in an early morning news conference, said Indian missiles targeted four locations in Punjab, and two in Pakistan-administered Kashmir. Pakistan's Ministry of Foreign Affairs said it summoned the Indian chargé d'affaires in Islamabad, and stated that India's \"blatant act of aggression constitutes a clear violation of Pakistan's sovereignty. Such actions are in contravention of the UN Charter, international law and established norms governing inter-state relations,\" as reported by CNN. India has not yet publicly provided evidence of the claims that Pakistan was directly linked to the terror attacks in Pahalgam, to justify Wednesday's attacks on the premise of self-defence under Article 51 of the UN Charter.\nRetaliating to the Indian strikes, Pakistan has already launched heavy artillery shelling along the de facto border between the two nations, reports BBC. India has claimed the artillery shelling along the de facto border is unprovoked.\nAt least 12 people were killed and dozens wounded on the Indian side in Poonch, local government official Azhar Majid told AFP. Pakistan has also claimed it has shot down five Indian Air Force jets—including a Rafale jet—and a drone. A weapons researcher, Trevor Ball, of Armament Research Services, analysed witness photos from a wreckage site in the village of Wuyan in India-administered Kashmir, and said the tank was likely from a Rafale or Mirage fighter jet, as reported by The New York Times. Though facts and verifications are yet to emerge, both nations' responses have surpassed previous \"non-escalatory\" boundaries. Before Pakistan's artillery shelling, South Asia analyst Michael Kugelman told AP News that India and Pakistan \"are two strong militaries that, even with nuclear weapons as a deterrent, are not afraid to deploy sizable levels of conventional military force against each other.\"\nThe two nations have had flare-ups over Kashmir, and patterns and predictability are important. The Indian airstrikes do not come as a surprise, and neither does the Pakistani response, so far as the actions follow threats both nations have exchanged since the Pahalgam terror attacks. Initially, the response to Pahalgam bore parallels to the Pulwama bombings of 2019, which killed 40 Indian security personnel. Twelve days after the Pulwama bombings, India had launched airstrikes in Pakistan, but according to analysts, the previous military responses in 2019 and 2016 (Uri) were more measured. Asfandyar Mir, a senior fellow in the South Asia Program at the Stimson Center in Washington, told The New York Times that the Indian strikes under Operation Sindoor so far \"have crossed two significant thresholds in its military action,\" by hitting a large number of sites in Pakistan and by striking Punjab. Pakistan's military claims that Indian strikes have hit the densely populated province of Punjab, and are the deepest India has struck inside Pakistan since 1971, according to CNN.\nThe role of powerful nations who would act as mediators, and with whom both nations share relations—namely the US—is key. JD Vance had suggested they would support an Indian \"response\" that would not lead to a larger conflict in the region. One could infer that Vance's statement suggests supporting a kinetic response that would not be overly escalatory. After the overnight strikes, the Indian army posted a video on X, saying \"Justice is served.\" According to The New York Times, India has said its military actions have been \"measured, responsible and designed to be non-escalatory in nature.\" At the White House, US President Trump has so far called the escalation between India and Pakistan a \"shame,\" and said he hoped \"it ends very quickly.\" Trump had said earlier that both are \"friends\" of the US. The UN, Western nations, and China stepped up the calls for restraint for both nations.\n\nBeyond statements, the current escalation requires active engagement and mediation. The rapid escalation has gone far, and renegotiating the Indus Water Treaty, rather than calibrated \"responses,\" must be encouraged by geopolitical actors already navigating two wars and a Cold War between China and the US, with heightening tensions.\nUltimately, a protracted conflict harms both countries. On May 5, Moody's stated that a persistent increase in tensions with India could impair Pakistan's access to external financing and pressure its foreign exchange reserves, which remain well below what is required to meet its external debt payment for the next few years. For India, a full-scale war with Pakistan threatens its geopolitical position in the Indo-Pacific policy, as a net security provider in the region. \"An outright war with Pakistan… would only indirectly put us [India] against China, one of the world's largest economies… which has strategic investments in the Belt and Road Corridor that runs through Pakistan,\" writes Saba Naqvi, a Delhi-based journalist, in an article in Frontline magazine.\nTime and time again, history has shown that wars exact a price. Further military actions from either nation can no longer be rationalised by their governments' need to \"save face\" and flex muscle power to their rival in order to tend to their domestic audience. Both nations stand to lose more than they would gain with outright war, and realising that sooner rather than later would serve their people.\nRamisa Rob is Geopolitical Insights Editor at The Daily Star.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "India-Pakistan tensions and the risks of war",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/india-pakistan-tensions-and-the-risks-war-3889166",
        "news_paper_name": "The Daily Star",
        "publish_date": "08-05-2025"
    },
    {
        "full_article": "In most parts of the world, the phrase \"you are what you eat\" is taken as a serious motivation for health. In Bangladesh, we take it as a threat to that very health. Because if anyone ever dared to analyse what exactly we're eating, they'd need not a nutritionist, but a toxicologist—and possibly a full-blown epidemiology team.\nWelcome to the country, where food regulation is treated like an optional seasoning: nice to have, but not really essential. While other countries spend years developing policies before genetically modified organisms (GMOs) hit the shelves, we prefer the chaos-first, consequences-later model. Why worry about food safety when you can serve a science experiment gone rogue with a side of rice?\nLet's begin with GMOs. Yes, Bangladesh was the first country in South Asia to commercially release a genetically modified food crop: Bt brinjal, rolled out in 2013 with all the subtlety of a government-sponsored watch party. No mass sensitisation. No warning labels. No meaningful consumer consent. Just \"Here, take this magic seed. Don't ask questions. Smile for the Ministry of Agriculture.\"\nSince then, we've been flirting with golden rice, GM potatoes, and whatever Frankenstein crop is next on the donor-funded wishlist. And still—still—there's no mandatory GMO labelling. In most countries, consumers have the right to know if their tomato was edited in a lab, that too edited more than a lot of women's Instagram pictures. In Bangladesh, we believe in destiny. What's meant for you—be it pesticide resistance or organ failure—will find its way.\nThen there's our poultry. Oh, our beloved broiler chicken—the lifeblood of morog pulao, the protein of the proletariat. Except now it's less chicken and more biological anomaly. These birds grow from chick to full-on bodybuilder in six weeks flat, thanks to a mind-bending cocktail of steroids, antibiotics, and hormones. The result? Meat so plump and juicy it could be a Marvel superhero.\nNow, growth enhancers aren't inherently evil. In regulated contexts, they help meet protein demand. But the keyword is regulated, and in Bangladesh, food safety regulations are about as well-enforced as traffic laws on an Eid holiday.\nBangladesh has no national law clearly banning the use of growth hormones in poultry. A 2014 High Court order directed the government to curb their use—but enforcement? Meh. The Department of Livestock occasionally stages media-friendly raids and \"seizes\" some chickens, and then we all go back to business as usual. Meanwhile, illegal feed additives and veterinary drugs are sold openly like candy in the markets.\nAccording to the Bangladesh Food Safety Authority, a significant percentage of poultry farms use antibiotics improperly, including those meant for humans because the cramped, unhygienic conditions are a breeding ground for disease. So instead of cleaning up their farms, producers clean up the symptoms—by turning every chicken into a walking pharmaceutical.\nAnd as if things weren't spicy enough, we've now discovered a brand-new party guest on our dinner plates: Escherichia albertii. This charming little bacterium, a close cousin of E. coli, has been found lurking in raw broiler chicken meat in Bangladeshi markets—and not just in the meat, mind you, but on the workers' hands and tools too. Straight from the chopping board to your bloodstream. No detours.\nIf the name sounds unfamiliar, that's because it's usually found in countries with functioning health surveillance systems. In Japan, it caused full-blown food poisoning outbreaks. In Bangladesh? It caused zero regulatory panic and exactly zero Facebook Live press conferences. We prefer not to scare the public—just silently marinate them at risk and let the bacteria do its thing.\nTo make matters worse, 94 percent of the bacteria samples were found to be resistant to at least one antibiotic, and nearly half were resistant to multiple drugs. That means if you fall sick, good luck treating it. You'll be prescribed antibiotics your chicken has already built immunity to. It's like playing chess with bacteria that read the playbook three moves ahead.\nThe consequence? Antibiotic resistance. We're now raising a generation of humans for whom even basic infections could become life-threatening—because we've been microdosing amoxicillin at every meal. But hey, at least the leg piece is tender.\nThere's also the charming issue of hormone residue. Scientific studies link excess hormone exposure in food to hormonal disorders such as PCOS/PCOD, infertility, obesity, and even cancer. And yet here we are, with no labelling laws, no hormone testing infrastructure, and no meaningful enforcement. You could be feeding your eight-year-old daughter chemically induced puberty in the form of grilled chicken, and you wouldn't even know it.\nAnd let's not forget the environmental side of this disaster. GMO crops like Bt brinjal are supposed to reduce pesticide use. But early field reports in Bangladesh revealed multiple instances of crop failure, plant wilting, and farmers reapplying pesticides anyway. Did the government commission independent studies or launch a monitoring framework? Of course not. In classic style, they doubled down and expanded the programme.\nAs for biosafety? Don't make us laugh. The National Committee on Biosafety exists on paper, but its decisions are opaque, often politically driven, and rarely subjected to public scrutiny. Field trials of GMOs proceed without independent oversight. Cross-contamination between GMO and non-GMO crops? No buffer zones, no containment strategy. We're just hoping for the best—and praying the wind doesn't ruin the rice harvest.\nTrade implications? Massive. The European Union has strict bans on importing unauthorised GMOs. Without clear regulation, Bangladesh risks never entering lucrative export markets. But who cares about billions in trade when you can cut a ribbon at a \"successful GMO harvest\" photo op?\nAnd what about consumers—the people actually eating this genetically tinkered, chemically enhanced, bacteria-coated food? They're kept in the dark. There is no law in Bangladesh requiring producers to disclose GMO content. No hotline to report suspicious food. No public awareness campaigns. No accountability. Just eat your meal and mind your business.\nThis isn't food sovereignty—it's food roulette.\nWhat Bangladesh needs now is an actual policy—not a half-hearted guideline, but a real, enforceable legal framework that ensures transparency, regulation, and consumer rights. Food labelling should be mandatory. Growth hormones and antibiotic use must be tightly controlled. GMO testing should not rely solely on manufacturers' claims. And most of all, the public deserves to know what's going into their bodies.\nBecause for a nation that can spend hours debating whether biryani should have aloo, it's shocking how little attention we pay to the food's origin, quality, or safety. At this rate, we might not just get mutant chickens—we might end up becoming the mutants ourselves.\nUntil then, enjoy your next chicken roast. And if it tastes a little too juicy, a little too perfectly plump, just remember—you're not eating dinner. You're participating in a grand national experiment. No consent, no warning, no exit.\nBon appétit. And good luck.\nBarrister Noshin Nawal is an activist, feminist, and a columnist for The Daily Star. She can be reached at [email protected].\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Bangladesh’s GMO buffet: Eat first, ask questions never",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/bangladeshs-gmo-buffet-eat-first-ask-questions-never-3889051",
        "news_paper_name": "The Daily Star",
        "publish_date": "08-05-2025"
    },
    {
        "full_article": "Despite the critical role played by firefighters who put their lives at risk to rescue victims from catastrophes, it is quite disappointing that the state has failed not only to provide them with due compensation and benefits, but also to equip them properly with safety gear while at work. According to a report in this daily, since independence, at least 47 firefighters have lost their lives in the line of duty, with the highest number of deaths taking place at the BM Container Depot in Chattogram's Sitakunda in 2022, which killed 13 firefighters.\n\nOver the years, our increasingly dense urban spaces, the general lack of fire safety measures, and a failure to enforce building rules and regulations have contributed to a surge in fire incidents in the country. Unfortunately, the capacity of the Department of Fire Service and Civil Defence (FSCD) has not increased at the same pace. Currently, the FSCD has 14,570 members, meaning there's less than one firefighter per 1,000 people in Bangladesh. Sadly, we are not even ensuring proper compensation for them. The compensation they receive from the government and their departmental welfare fund in case of death or injury is inadequate, according to an official quoted by this daily. What's worse is that firefighters do not even have insurance coverage for death, disability, or injury caused while at work. As a result, their families are often left to fend for themselves when a firefighter dies or is maimed.\n\nBesides, not all members have safety gear, including fire suits and breathing equipment. In many countries, trained volunteers often work alongside career firefighters in fire departments. But if we fail to provide proper equipment even to career firefighters, how can anyone feel encouraged to volunteer for such a risky job? Furthermore, there is the issue of inadequate training, which came into discussion particularly after the 2022 chemical-induced Sitakunda fire.\n\nReportedly, the new director general of the fire service has promised to take steps to meet some of the challenges the department faces. We hope that the interim government will consider increasing the department's budget to enhance its capacity and manpower, as well as create specialised units equipped to handle catastrophes such as earthquakes. For both man-made and natural disaster preparedness, there is no alternative to fairly compensating and ensuring the safety and training of our first responders, among whom firefighters play a major role.\n",
        "headline_1": "Prioritise the well-being of our protectors",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/prioritise-the-well-being-our-protectors-3887191",
        "news_paper_name": "The Daily Star",
        "publish_date": "08-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 08, 2025 00:00:00  \nThe recommendations, as reported primarily in the print media, made by the Health Sector Reform Commission look radical and ambitious. But the sector needs such a reconstructive surgery rather than a cosmetic one to cure the system. One of the basic human rights is right to health but this is grossly undermined almost everywhere, only more so in countries like Bangladesh, because of the outrageous social disparities. So the health reform commission has done the right thing by recommending legal coverage for every citizen's primary healthcare irrespective of his/her social standing. Incorporation of such a legal provision will guarantee that no one is denied medical attention. But this cannot be implemented automatically unless the medical infrastructure and other allied paraphernalia are attuned to the proposed healthcare act. Happily, the commission has focused on such details meticulously in order to make the medical marvel happen in the country through gradual implementation of its suggestions. \nThe first bold step would be higher health allocation initially at 15 per cent of the national budget. On the infrastructure side, the union level health and family planning centres have to be transformed into primary healthcare centres. What about upazila health complexes? In urban areas, their counterparts would be established at the ward level. Clearly, the emphasis is to take healthcare to the doorsteps of people at the grassroots level. If the programme can be made effective, it will be decentralisation of healthcare at its very best. The referral system suggested by the commission will then screen the patients with various acute or complicated ailments to district-level hospitals which will have specialised healthcare arrangements. Will the upazila health complexes serve as referral points? But how the medical facilities at the district level will improve their healthcare system is critical. Medical colleges and universities have to be restructured, according to the suggestion, to make them aligned to the World Federation for Medical Education (WFME). For overall supervision a permanent body to be named as the Bangladesh Health Commission will be assigned the job. \nIn fact, the whole gamut of medical system has been brought under the scanner. Medicines will have to be prescribed under the generic names, 25 per cent of which immediately and the rest within next five years in order to end the anarchy in the pharmaceutical sector. Alongside, the hawkish promotional activities by medical representatives, as prevailing now, will be banned. Additionally, establishment of a separate facility to be named a National Institute of Women's Health has also been recommended. \nClearly, a comprehensive analysis of the problems facing the health sector has been made. But still a few things need to be clarified. There is no guideline of taming the vested interest quarters including the big pharmaceutical sharks and commercial private practice. Although higher remuneration and special financial benefits have been suggested, those are unlikely to match the income from private practice by senior medical consultants. Similarly, streamlining the operation of pharmaceutical industries may not be any easy job unless a political government has the motivation and determination to do so. Finally, underlying the health reform commission's exercise is a highly appreciable intent to transform the healthcare system by revolutionising the process of accessing at least primary medical treatment on an equal basis. But the next level of healthcare will still remain unreachable to the poor and low-income people. Yet if the system offers medical treatment on a par with that offered abroad where $4.0-5.0 billion is spent annually by Bangladesh patients, the money thus saved can be reinvested for free treatment of at least a certain percentage of the poor and vulnerable.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Health commission gets it right but execution matters",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/health-commission-gets-it-right-but-execution-matters-1746635401",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       May 08, 2025 00:00:00  \n\nAir pollution in Dhaka has reached such an alarming level that it is now being dubbed a silent killer. The city's air is heavily polluted with fine particulate matter (PM2.5), contributing to a wide range of health issues, including respiratory problems, lung cancer, and heart disease. It has become routine for the Air Quality Index (AQI) to classify Dhaka's air as hazardous, severely polluted, or unhealthy-consistently placing it among the most polluted cities in the world. Clean air has become such a rarity that, according to a study by the Center for Atmospheric Pollution Studies (CAPS), Dhaka experienced clean air on only 31 days over the past nine years. These alarming statistics underline the need for urgent, effective interventions. Yet, rather than addressing the root causes, the city authorities continue to pursue superficial solutions-the latest being a plan to install air purifiers in open public spaces.\nThe Dhaka North City Corporation (DNCC) has proposed installing 50 industrial-grade air purifiers in various locations as a quick-fix solution to the crisis. Officials have claimed that each device would clean and cool the air much like 100 trees. But if that is the case, one must ask-why not plant 5,000 trees instead? Trees purify air over a wide area and offer ecological, psychological, and climatic benefits-advantages that mechanical purifiers simply cannot replicate.\nEach purifier is expected to cost between Tk 5 to 6 million, not including substantial electricity and maintenance costs. While the DNCC administrator has expressed confidence that the initial costs will be met through Corporate Social Responsibility (CSR) funding, the city corporation will remain responsible for ongoing expenses, including frequent filter replacements. According to one estimate, the annual electricity cost for operating these high-voltage machines could be more than enough to cover the expense of planting 5,000 trees.\nMoreover, the effectiveness of these devices in open spaces remains highly questionable. Air purifiers are typically used in enclosed environments such as hospitals, shopping malls, and office buildings. In open spaces, their efficiency plummets due to the constant movement of air. The DNCC claims each purifier can clean up to 30,000 cubic feet of air per minute and remove 90 per cent of fine particles. However, experts point out that even a light breeze-just 2 metres per second-is enough to quickly replace purified air with polluted air, rendering the effort largely ineffective.\nExperience from other countries lends further weight to this skepticism. Delhi's 24-metre smog tower, once touted as a groundbreaking solution, was ultimately declared ineffective by the Delhi Pollution Control Committee. A 2019 test by the Central Pollution Control Board (CPCB) found the impact of such purifiers to be \"very small to non-existent.\" The Rs 20 crore ($2.4 million) tower, which had promised to reduce pollution by 50 per cent within a 1-kilometre radius, failed to show any meaningful improvement within a year. In practice, the benefits of such installations dissipate within a few hundred metres.\nMany, therefore, believe that although the DNCC's initiative may be well-intentioned, it risks wasting time and public resources while creating an illusion of progress. Worse still, it could divert attention from the more pressing task of addressing the root causes of air pollution. There are also concerns about equity and inclusiveness. When many parts of the city still lack essential services such as proper housing, sanitation, and access to clean water, projects focused on installing expensive air purifiers in affluent areas will be both extravagant and discriminatory.\nThe sources of Dhaka's air pollution are no secret. A 2023 study by the Department of Environment (DoE) and the World Bank found that 58 per cent of PM2.5 emissions come from brick kilns, 18 per cent from vehicles, 10 per cent from construction dust, and 14 per cent from open waste burning and industry. Effective mitigation efforts must, therefore, target these sectors through stricter regulation, cleaner technologies, and better urban planning.\nMeanwhile, Kolkata offers a model worth studying. Compared to other Indian megacities like Delhi and Mumbai, where AQI levels remain poor, Kolkata has made measurable progress in improving air quality. And no, it did not rely on air purifiers to do so.\nOne of Kolkata's key strategies has been the promotion of greener public transportation. The city has invested heavily in electric buses and ferries, aiming to deploy 5,000 electric buses and a fully electrified ferry fleet on the Ganges River by 2030. This shift is expected to significantly reduce carbon emissions and operational costs. Since 2008, the West Bengal government has also been phasing out buses older than 15 years.\nTo combat dust pollution, the Kolkata Municipal Corporation (KMC) has introduced mandatory guidelines for construction sites, requiring them to cover exposed areas, keep soil damp, and recycle construction and demolition waste into building materials like tiles.\nThe city has also embraced extensive tree plantation as a core strategy. KMC, in collaboration with NGOs and community groups, has launched urban forestry initiatives to increase green cover. Native species such as Neem, Banyan, Peepal, and Gulmohar-known for their high pollution-absorbing capacity-are prioritised. These efforts have helped reduce urban heat, improve biodiversity, and enhance the overall quality of life.\nKolkata's multi-pronged approach to tackling air pollution offers a pragmatic and evidence-based framework that Dhaka would do well to emulate. Planting trees, modernising transport, regulating construction sites and industrial emissions, closing down illegal brick kilns -these are not quick fixes, but they are sustainable. Real progress will require strong political will, strategic planning, and active public participation. Only then can the city's residents hope to breathe clean air.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why air purifiers can't fix Dhaka's dirty air",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-air-purifiers-cant-fix-dhakas-dirty-air-1746635465",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 08, 2025 00:00:00  \n\nThe proverb \"Water is life\" holds true in every aspect of our lives. When water becomes unsafe for use, it puts people's lives at risk. Residents of Gopibag and Maniknagar in Dhaka city have been facing numerous difficulties over the past few months.\nThe water supply contains insects, worms, foul odours, and various forms of filth. This not only disrupts daily household activities but has also led to several health issues. Parents are particularly concerned about children suffering from stomach problems, diarrhea, vomiting, and other waterborne diseases.\nWater is essential for cooking, bathing, laundry, and cleaning utensils. However, the current state of the supplied water poses a serious threat to public health. Many families are being forced to rely on bottled or filtered water, which is unaffordable for some.\nThe authorities concerned must act swiftly and decisively. Water treatment plants should undergo regular cleaning and inspections, pipeline issues must be addressed, and public complaints taken seriously.\nWe, the citizens of Gopibag and Maniknagar, humbly urge the authorities to take both immediate and long-term measures to ensure access to safe and clean water. Safe water is not a luxury-it is a basic human right that must be upheld.\nPurnasri Debnath\nGopibagh, Dhaka\npurnasri123@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "When bugs float in water",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/when-bugs-float-in-water-1746635487",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 08, 2025 00:00:00  \n\nFrom the narrow lanes of Rampura and Banasree to the main roads of the capital, battery-powered auto-rickshaws and other unauthorised three-wheeled vehicles now roam freely. Despite a High Court ban and the lack of any legal registration, these vehicles continue to operate day and night, blatantly disregarding the law.\nThese unregulated rickshaws have become a new hazard on our roads. They frequently slip into the paths of buses, trucks, and motorcycles, increasing the risk of accidents. At the same time, traffic congestion in Dhaka has reached an alarming level. As if the intense heat and prolonged power outages weren't enough, these vehicles continuously charge their batteries-putting additional strain on an already overburdened electricity supply.\nIt is high time for the authorities to take decisive action. To restore order on our roads and alleviate pressure on the power grid, the operation of illegal battery-operated auto-rickshaws must be brought to a swift end.\nFiad Nowshad Yeamin\nStudent\nDepartment of Media, Communication and Journalism\nCanadian University of Bangladesh\nnowshadyeamin415@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Auto-rickshaw dilemma",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/auto-rickshaw-dilemma-1746635510",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-05-2025"
    }
]