[
    {
        "full_article": "The preliminary report flowing from the investigation into the crash of an Air India Boeing 787-8 at Ahmedabad, on June 12, 2025, has a focal point now. Released in the early hours of July 12, 2025, a month after the accident, the Aircraft Accident Investigation Bureau’s 15-page document has highlighted the fuel control switches of “Engine 1 and Engine 2” having “transitioned from the ‘Run’ to the ‘Cutoff’ position, one after another, with a time gap of one second”. That this happened just after flight AI171 had begun to lift off from the 3,505-metre-long runway, leading to the engines beginning to decrease from their take-off values as fuel starvation hit, has accentuated another detail. How did two separate switches that are guarded by brackets, feature a metal stop locking mechanism and have separate systems for redundancy move to ‘cutoff’? And why? The element of bafflement by one crew member, and denial by the other pilot, over the cutoff, has compounded the issue, more so in the absence of the full and raw transcript of the cockpit voice recording. However, in the midst of the crisis, what must be acknowledged was a display of airmanship, with a partially successful relighting of the GEnx-1B70/75/P2 engines, which ended with the call of May Day.While the key details in the report have evoked appeals by a pilot body for a revamped probe, especially to ‘stop the bias towards pilot error’, the investigation team must now stay the course to ensure that there is a sound, comprehensive and transparent investigation. There has also been focus on an FAA Special Airworthiness Information Bulletin of 2018 that concerns the potential for disengagement of the fuel control switch locking feature, and applicable to the Boeing 787 aircraft family. In a reaction to the preliminary report and its findings, there has been some expert commentary on the topic of crew well-being, but in a counter to this, the Indian Commercial Pilots’ Association has said that “pilots undergo extensive psychological and professional screening... and operate under the highest standards of safety”. However, the subject of Crew Resource Management and Line Oriented Flight Training may need to be revamped, more so with this being an unusual incident of dual engine failure. Finally, despite the preliminary report’s pitch of there “not being recommended actions that concern the aircraft type and the engine manufacturer”, India’s expanding civil aircraft fleet requires greater vigilance in terms of maintenance and operations. Airport funnel zones and obstacle limitations must be reviewed too as it is a given that air crew and passengers have safer flights. Published - July 14, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Airlines\n                    \n                            /                      \n                        \n                        Ahmedabad plane crash 2025\n                    \n                            /                      \n                        \n                        aviation safety\n                    \n                            /                      \n                        \n                        air and space accident\n                    \n                            /                      \n                        \n                        transport",
        "headline_1": "Need for a revamp: On the Ahmedabad air crash probe, aviation safety",
        "headline_2": "India’s aviation industry must review crew resource management",
        "link": "https://www.thehindu.com/opinion/editorial/need-for-a-revamp-on-the-ahmedabad-air-crash-probe-aviation-safety/article69807980.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "14-07-2025"
    },
    {
        "full_article": "The axe has dropped. The Environment Ministry has exempted the majority of India’s coal-fired plants from mandatorily installing Flue Gas Desulphurisation (FGD) systems, which are designed to cut sulphur dioxide (SO2) emissions. In effect, this undermines its own mandate from 2015 that required all such plants — there are about 180 of them now, comprising 600 units — to install these systems. While these were expected to be in place by 2017, only about 8% of the units have actually installed FGD — nearly all by the public-sector National Thermal Power Corporation (NTPC). SO2 is among the gases monitored by the Central Pollution Control Board (CPCB) as exposure beyond a degree can be harmful. Less appreciated is its propensity to form sulphates in the air and contributing to particulate matter pollution. In general, India’s average ground-level SO2 measurements have been below the permissible levels — one among several reasons that there has not been a sense of urgency in implementing FGD norms. The official reasons are the limited number of vendors in India, high installation costs, the potential rise in electricity bills, and disruptions due to the COVID-19 pandemic. While the latest deadlines flew by in 2024, the Environment’s Ministry’s decision — it follows consultations with scientific institutions and new commissioned studies — is a sharp disavowal of the current policy. An expert appraisal committee says that Indian coal is low in sulphur; SO2 levels in cities near plants with operational FGD units do not differ significantly from those without these units, and all of these were anyway well below permissible levels. The committee had said that concerns about sulphates are unfounded. It also argued, echoed by the Minister for Power, that sulphates had a beneficial side-effect in suppressing warming from greenhouse gas emissions. Thus, reducing sulphates would actually worsen warming and compromise India’s climate goals. While IPCC assessments do account for the heat-suppressing action of sulphates, nowhere is it projected as an unalloyed good.A minority of plants, about a fifth — those within a 10 km radius of the NCR; in cities with a population of over a million, or known to be in pollution hotspots — must install FGDs by 2028. This seems to suggest that what determines their installation is the location of a coal plant and not whether FGDs are effective or SO2 is harmful. This is a rare instance when there are different environmental standards within India on controlling exposure to a pollutant. While it is not unscientific to revise understanding of the harms or benefits of substances, this needs debate in the public domain before a policy is changed. Otherwise it amounts to undermining India’s commitment to scientifically informed public health. Published - July 14, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        coal\n                    \n                            /                      \n                        \n                        air pollution\n                    \n                            /                      \n                        \n                        greenhouse gases\n                    \n                            /                      \n                        \n                        health",
        "headline_1": "Smoke and sulphur: On sulphur dioxide emissions, public health",
        "headline_2": "There cannot be different environmental standards within India",
        "link": "https://www.thehindu.com/opinion/editorial/smoke-and-sulphur/article69807534.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "14-07-2025"
    },
    {
        "full_article": "The extremist regime wants tourists. Why shouldn’t it? It’s part of the normalisation of brutality   \nKim Jong Un last month posed on a beach, surfing on the ‘wave of happiness’ that North Korea’s Dear Leader has promised tourists visiting the newly developed Wonsan Kalma coastal tourist zone. The dictator wants more international tourists. So far, small Russian groups are the only package deal North Korea receives. This month, it’s Taliban’s turn to invite tourists to Afghanistan. Wonsan Kalma and Afghanistan are beautiful places. But they are not on tourists maps for good reason.\nTaliban’s ad is made by a tour operator. It starts with a familiar chilling scene of beheadings: men, heads covered, kneeling in front of gun-wielding, presumably, Afghans. Only here, the headcover is yanked off to reveal a grinny White male flashing a thumbs-up sign. A flower tucked in the barrel of a machine gun, a close-up of an M4 rifle with ‘property of US govt’ etched, the 50-second ad flits between making light of Taliban as people who terrorised to stunning footage of Afghanistan. It is as extraordinarily tone-deaf as many of Trump’s Truth Social posts.\nTaliban meanwhile is intensifying its war against Afghan women. Banned from work and education, they’re publicly flogged, refused healthcare unless a male relative’s present, and their movement is fully restricted. Heavily sanctioned Taliban wants tourists to earn some hard cash. But to make a beheading scene part of a promotion targeted at Americans is a cold measure of how normalised brutality is. Will Americans go, though their govt says don’t? Undoubtedly. Indifference to violence is global culture, the unthinkable is routinely normalised. So, for a certain section, what could thrill more than swinging an M4 or Kalashnikov at Afghanistan’s majestic peaks? Reality and rights & wrongs can take a vacation. \n\n",
        "headline_1": "Taliban Calling",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/taliban-calling/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-07-2025"
    },
    {
        "full_article": "Why the unsigned AI 171 accident report patently fails to meet the test of credibility\nIf the sole purpose of investigations is to meet deadlines, Aircraft Accident Investigation Bureau has done well. International rules gave it 30 days to submit a preliminary report about June 12’s AI 171 Dreamliner crash, and it pushed 15 pages past the finish line on Saturday. Unfortunately, most experts have assessed the report to be short on substance. Preliminary reports cannot be conclusive, but they should begin to shed light. Families of the 270 deceased and the rest of humanity are none the wiser.\nThe report’s authors admit: “At this stage…no definitive cause has been determined.” All we know for sure now is that three seconds after takeoff, fuel supply to both engines stopped. Two possibilities arise. A pilot cut it off by flipping two switches – one for each engine. Or that the switches were faulty. Without facts, plausibility is a matter of preference. Are humans more fragile than mechanical devices? Deliberately switching off engines at 650ft is suicidal, yet some would subscribe to this view. The issue with AAIB’s report is that it appears to push this possibility. It says one pilot asked the other why he had flipped the switches, and the other replied he hadn’t. \nWe don’t know the pilots’ exact words, nor who asked and who answered. We don’t know what was said before and after. Just two cherry-picked sentences paraphrased in a way that they slyly implicate the two pilots who cannot defend themselves anymore. If pilot dialogue is material to the probe, so is the fact that seven years ago the US aviation regulator found fuel control switches used in some Boeing 737s – similar to those in Dreamliners – had been installed with their locking feature disengaged. VT-ANB – the lost Dreamliner – was built four years before that discovery.\nAAIB’s report acknowledges this possibility, but doesn’t buttress it like the alternate possibility of deliberate pilot action. The fact that no active airline pilots were involved in the investigation, and that the report was submitted unsigned, raises more questions. As does Western media’s access to these findings two days before their official release. AAIB has met its deadline and may consider its job done, but considering how its “narrative” – the “findings” are ambiguous – has injured the reputations of AI 171’s pilots, it should reveal its findings in detail.\n\n",
        "headline_1": "Not AAIBly Done",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/not-aaibly-done/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-07-2025"
    },
    {
        "full_article": "…or, in Trump-speak, LOSERS can be choosers\nHallelujah! Gazans, says Bibi, must have ‘free choice’. Even at gunpoint. Sometime ago Israel unleashed ‘Gideon’s Chariots’ on the Strip-of-land Gazans consider homeland. Just before this airpower-aided ground blitz, Bibi reportedly suggested folks being rendered homeless would ‘desire’ to ‘emigrate’. It followed that, by choosing to emigrate, they’d be protected from bombardment – by those bombarding them into choosing to emigrate.\nWanting it US-‘owned’, Trump visualises Gaza stripped into a ‘freedom zone’, its residents ideally opting to be cleared out along with the rubble. That way you get a ‘freed-up zone’, so that a Riviera runs through it. Gaza ‘freed’ of Gazans, property (re)developers can ‘zone’ in, building resorts for celebrity sun-tanners. And, consensually ‘zoned out’, Palestinians can ‘free’ themselves from demolished homes, bombed-out hospitals and weaponised hunger. Call it VRS – voluntary removal scheme.\nKudos to Katz, though, for unveiling the grandest (game)plan. Israel’s defence minister wants a ‘humanitarian city’ rising from Rafah’s ruins where 600,000 Palestinians would first be shunted. Followed by everyone else still alive and cart-loadable. ‘Screened’, they’d all enter haven on earth. And, Katz reportedly eyeing an ‘emigration plan’, they’d exit when exiled…to greener pastures, naturally. Aren’t refugees abroad chirpier than dead men walking to food-as-bait sites at home?\nWhere’s ‘choice’ here, you ask. Well, copy-Katz plainly likes Trump’s ‘clean-out’ Gaza project to ‘relocate’ Gazans for – you guessed it – their own good. Here’s Bibi explaining Trump’s ‘brilliant vision’: ‘It’s called free choice. If people want to stay, they can stay, but if they want to leave, they should be able to…’ Remember, for Trump, the best (one-state) solution to conflict is ‘surrounding countries’ welcoming Gaza’s ‘emigrants’. If only immigrants in America found him as MAGA-nanimous. \nSo here’s how Katz’s ‘humanitarian’ (strata)gem promotes ‘free choice’. Round up 2.1mn war-ravaged people caught between Hamas’s atrocities and Israel’s excesses. Herd them into a veritable internment camp. Let them live cheek-by-jowl, face misery and hardship, and have no exit. Then watch them depart, ‘willingly’. Bibi says Gaza shouldn’t be a ‘prison’, but an ‘open place’ where Palestinians (and butterflies?) are free. Well, make that ‘open’ as in open-air prison, where freedom’s just another word for nothing left to choose. \n\n",
        "headline_1": "Gaza Stripped",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/churn-after-reading/gaza-stripped/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-07-2025"
    },
    {
        "full_article": "A decade ago, the world of dating seemed effervescent. People moved from the humidity of chatrooms, covert, fertile and throbbing to a fluorescent-lit, air-conditioned environment of dating apps. It apparently opened the doors of desire and people could now freely admit to wanting sex and wanting to play. Women could speak with less hesitation of being sexual beings too.\nRather than the elaborate stalking, repressed hints, years-long waiting that had passed for romance, amorous intentions could be stated clearly and people could either swipe right or left. How airy that all seemed and how everyone thought it surely signalled a sexual revolution.\nCut to 2025 and all around us we are all being asked to discuss the crisis in masculinity. Its dark edge is the manosphere, with its cellarful of incels. On the lightest side is one of the most hilarious TikToks in recent times by a French user called @gettothepointbro who broke down why dating a girl who’s been single for some time is not romance, it’s an extreme sport for your self-esteem.\nRead full story on TOI+\n\n",
        "headline_1": "Men are afraid to date. Is manliness to blame?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/voices/men-are-afraid-to-date-is-manliness-to-blame/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 14, 2025 00:00:00  \nFlooding has become an unfortunate monsoon ritual in Bangladesh. Each year, with the onset of the monsoon, heavy downpours and flash floods ravage the country, plunging lives and livelihoods in flood-prone areas into a profound crisis. After last year's devastating deluge, which inundated vast swathes of the country, policymakers spoke at length about enhancing flood preparedness through timely river dredging and the repair of embankments. But one year on, despite the government's claim of better preparedness, the reality on the ground tells a different story. The monsoon, once again, has exposed how terribly unprepared the country is in tackling floods. According to a report by The Financial Express, nearly 100,000 hectares of farmlands have been submerged due to onrushing waters, affecting low-lying areas in 21 districts as of Friday. Another report informs that the district of Feni, one of the worst-hit areas during last year's floods, is once again facing severe devastation. This year, more than a hundred villages in the district have gone under water after embankments on three major rivers in Feni broke at 20 different points as of Saturday.\nSo, the question is, why are the authorities still caught off guard, even after experiencing recurring floods year after year? While the wrath of Nature can indeed be unpredictable, much of the destruction could have been avoided through timely, sustainable embankment repairs, proper dredging of rivers and effective early warning systems for timely evacuation. Since three major rivers - the Padma, the Brahmaputra, and the Meghna - flow into the Bay of Bengal through Bangladesh, the country is geographically situated in a highly flood-prone region. This makes it all the more important for the country to develop a comprehensive master plan in line with the science of river management aimed at protecting the riverbanks from erosion and mitigating the risk of flooding. Unfortunately, the state of embankment maintenance has been a cycle of short-term fixes and repeated breaches. Take the case of embankments in Feni district, where approximately 122 kilometers of earthen dams were constructed along three major rivers nearly 50 years ago. Sections of these embankments are patched up almost every year and naturally they continue to collapse due to their fragile and unsustainable repair. Reportedly, during the catastrophic floods of August last year, breaches occurred at 99 points. The authorities later spent Tk 190 million on repairs. Still, this year, the embankments have already broken in 20 areas. To make matters worse, rivers across the country are increasingly getting silted up, and there is little sign of an effective, sustainable dredging strategy. Though billions of taka are allocated each year for river dredging, these sporadic efforts yield no lasting solution. \nExperts have long emphasised that sustainable embankments must be constructed with durable, weather-resistant materials to withstand erosion and damage. The dams should also be environmentally friendly and easy to maintain. Countries like the Netherlands, Japan, and the United States have successfully implemented these long-term, resilient dams. Bangladesh, however, continues to rely on short-term repairs that fail to prevent recurring flood damage. During the Chief Adviser's recent visit to China, he sought Chinese assistance in river management. Yet, so far, no tangible progress has been made in this regard. As the frequency and intensity of floods are increasing and are likely to be exacerbated by climate change, proactive measures, rather than reactive responses, can better safeguard lives and property.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Need for sustainable flood management",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/need-for-sustainable-flood-management-1752424238",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       July 14, 2025 00:00:00  \n\nThe dastardly murder of Lal Chand, alias Sohag, a scrap metal trader of Old Dhaka in front of the Sir Salimullah Medical College (Mitford Hospital) on Wednesday last afternoon has jolted the nation to its core. The killing perpetrated reportedly by some rent-seeking thugs, alleged to have political connections, was witnessed by hundreds of onlookers who, out of fear, did not make any attempt to intervene and save the victim being battered with chunks of concrete to death in broad daylight. What is of concern here is the fear that benumbed the crowd who saw the killing taking place before their eyes. Small wonder that the criminals murdered Sohag, a citizen who earned his keep through hard work, unchallenged and with impunity. Is it that the crowd present at the spot was aware of the connections the hooligans had with the powerful quarters of society? In that case, it harks back to the days of the past regime when common people were under a similar spell of terror to protest any wrongdoing by the goons of the then-ruling party. Since the incumbent interim government is the product of the July 24 upsurge with its limited mandate and without any political ambition, one wonders, who these new crop of gangsters, political or otherwise, might be! However, through their murderous frenzy they were successful in sending a chilling message to the locals. \nSome among the onlookers, however, managed to muster enough courage to film the gory scene of slaughtering on their smartphones that went viral on the social media. \nTo all appearances, there were no law-enforcers around to prevent the murder from happening in the first place and then apprehend the killers.\nOn July 11 last, in another case of similar kind, a group of criminals reportedly ran riot, firing shots and wounding a construction company staff in Pallabi area of the city. As could be gathered, the gun-toting gangsters attacked the builder company's office as they were not paid the asked for amount of Tk 50 million as toll money. \nReports of similar bloody acts of violence against targeted victims carried out by anti-social goons or ransom/rent-seeking gangs across the country including the capital city have been hitting the headlines in recent months. Even so, we have not heard any reports that members of the public who happened to be witness to those acts of violence turned into a violent mob and lynched the offenders. \nThough those incidents of violent crime by rent-seeking terrorists have caused consternation among the public, who often expressed their anger on the social media, yet human rights groups did not come out in a big way in protest.\nBut of late the media and the various human rights activists have been found vocal against what they complained, incidents of 'mob justice' or vigilantism, taking place in the country since the incumbent interim government took power 10 months ago in the wake of the July uprising of 2024. Unsurprisingly, in the event of the violent overthrow of a government through a popular uprising, the masses, who are angry and disenchanted with the existing order, take control of the streets. In such a case law and order becomes the first casualty. We know this from our more than half a century of experience since the war of independence in 1971. History of revolutions also corroborates this view. In the case of the pre-August 5, 2024's autocratic government, it was not only the wrongs committed by the ruling political party of the time that incurred the masses' wrath, the police force was especially targeted by the frenzied crowds, if only for the excesses some overzealous members of the then-police committed against the protesting students and members of the public. The result was, as everyone knows, a severely demoralised police force. So, the post-August 5, 2024 Bangladesh society saw a large number of incidents where mobs took law into their own hands and vandalised some establishments, attacked people suspected of being members or accomplices of the fallen autocracy. Such sporadic incidents of mob justice have been taking place in different parts of the country since the fall of the autocracy. People who are in their late sixties or seventies may recall how elements suspected of being anti-liberation or having committed crimes against humanity faced mob violence under the post-independence war dispensation. Many were killed on the spot, or were handed over to the police if they were lucky. The experience of 20024's July events was in many respects similar to that of post-liberation Bangladesh 54 years ago. Though many were upset by the post-liberation instances of mob justice, there were few reports of outcries from the saner sections of society. However, time has changed and so have the perceptions of the people concerned about the human rights of even the gross violators of human rights during the reign of terror of the previous autocratic regime. It is definitely a commendable development in a society where the people of conscience can still see through the haze of bias, prejudice, faith or extreme partisan loyalty. But such prick of conscience should better not be selective. \nThus the law-enforcers' failure to prevent the events of vigilante justice has continued. Evidently, whatever was left of the largely demoralised police force which was working for the interim government was not able to deliver as they should be able to do under normal circumstances. Even so, there is also no reason to be apologetic about such acts of violence by mobs and the police's failure to stop those from occurring. Equally important is to demand action from the police against the acts of violence and murders being committed by criminal gangs, some of them with political colours. Also, strong social awareness and resistance have to be raised against the new breed of extortionists and political thugs to avert reappearance of yet another spell of the reign of terror that the nation had experienced before the July 2024's mass uprising took place.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Time to unite against  criminal gangs",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/time-to-unite-against-criminal-gangs-1752424344",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       July 14, 2025 00:00:00  \n\nThe killing of a scrap metal trader in old Dhaka has jolted the national conscience. Killings of innocent members of public by muggers, dacoits, anti-social elements including teenage gangs have become so common that the entire country is turning into a death valley. But it is the extortionists who have targeted businesses---from small traders to big merchants ---in order to extract large sums of money. Such killings were there during the previous regimes and there is no let-up, if not shown a rising trend, of extortion-related crimes including killings.\nIn case of the murder of the scrap metal trader in old Dhaka, the manner of taking the victim's life is what has challenged the collective sense of right and wrong. The brutal treatment of a human being and the disrespect for a deceased body expose the diabolical mind behind such acts. This bizarre spiteful way of deriving pleasure from taking life of one who merely refused to comply with their demand for a monthly rate of Tk200,000 cannot but send shockwaves across all levels of society here. Fittingly, there has been a widespread outcry against the extortion and the appalling crime. \nIn this context, the statements made by the law adviser and the home adviser are quite intriguing---one says the case will be referred to the Speedy Tribunal Court for early trial and the other claims legal action has been initiated against those involved in the killing. Are these not too little too late? Indeed, the interim government has miserably failed to address the declining law and order situation in the country. Let alone the earlier vandalism and destruction of a number of infrastructure, when organised attacks were unleashed on some sites of historical importance including the museum on Road 27, Dhanmondi, the War of Liberation Museum located in Agargaon and some religious shrines, the government turned a blind eye to such mob violence. \nThe latest rise in mob culture finds its encouragement from the government's inaction. But there is more to the elements of criminal proliferation. Immediately after the fall of Sheikh Hasina's autocracy, there was a need for restraint on extortion in order to breathe a fresh air into the country's business sector. Indications are clear that both bribery and extortion are still rife in society. What is particularly galling is that a party well poised to take over if an election is held on a level-playing field, has failed to establish its command on leaderships at the grassroots level. \nAllegedly, in the case of the latest murder in old Dhaka, accusing fingers have been pointed to this political organisation. Internecine feuds in the party make regular news. Yes, the high command of the Bangladesh Nationalist Party (BNP) has time and again warned its followers down the rank not to get involved in criminal activities. But all such exhortations seem to have fallen on deaf ears. Why? Are the BNP leaders playing to the gallery? It is reported that the party has by this time boosted its organisational activities in order to face the election. No question about such organisational activities. But does such party organisation not encompass the very basics of how party workers would conduct themselves? Did the party get across a stern message that their field-level leaders and followers can no longer follow the discarded political ways and practices of the deposed party that turned into a monster because of the 15-year long reign? It appears there is many a slip between the cup and the lip. \nBut here was a golden opportunity not only for the BNP but all other parties to mend their political ways in favour of a corruption- and extortion-free country---one that would gradually help reduce discrimination and disparities in society. The poor and marginalised people would have an opportunity to rediscover their rightful place in order to take part in the economic and development activities and share dividends of prosperity accordingly. The anti-trade and anti-entrepreneurship ambience extortion and bribery create should have by now been disposed of. \n \n nilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Extortion and corruption eat into vitals of society",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/extortion-and-corruption-eat-into-vitals-of-society-1752424394",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 14, 2025 00:00:00  \n\nJuly is more than just another month on the calendar. It is a chapter of awakening in Bangladesh's history. It is not merely a time of monsoon rain, but a symbolic season of protest, resistance, and self-realisation. The pages of July are etched with the footsteps of brave students who have dared speak truth to power.\nHistory bears witness to the spirit of youth that defines this time of year. The Safe Roads Movement of July-August 2018 is a powerful example. Shocked by the tragic deaths of two classmates, thousands of students took to the streets of Dhaka in a remarkable show of unity and discipline. They sent a clear message: this country does not belong to politicians alone; the youth, too, are its rightful stakeholders and guardians.\nIn 2024, we saw another surge of civic consciousness. Movements demanding quota reform and protesting corruption in educational institutions once again turned July into a crucible of change. These were not isolated demands; they reflected a broader call for national accountability. Students rose, not just for themselves but for the future of Bangladesh.\nJuly and August remind us: where there is injustice, there will be resistance. Where there is neglect, a voice will rise. These are the months that forge unity of responsible citizens and ignite national consciousness.\nToday's students must not be confined to the four walls of the classroom. They must be nurtured as agents of change and ready to shape the future. July calls upon us to reflect: what role will we play in building the Bangladesh we dream of?\nMonirul Islam\nDepartment of English\nNational University\nmdmonirulislam414864@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "July is the month of reawakening",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/july-is-the-month-of-reawakening-1752424814",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-07-2025"
    }
]