[
    {
        "full_article": "For decades, the women who serve as Anshakalin Stri Parichars (ASPs) in Maharashtra have been performing some of the hardest, yet least acknowledged, labour in the rural health system. For a wide breadth of responsibility, their monthly wage has stagnated at ₹3,000 since 2016, decades behind inflation. They also lack job security, pensions, safety gear and travel allowance. In 2023, a labour court in Nagpur acknowledged that they deserved at least the protection of the Minimum Wages Act but left the decision to the State. In keeping with its verbal-only assurances, the State has even now only promised them ₹6,000 a month by December 2025 — much less than what multi-purpose health workers receive. The indifference is not accidental: ASPs, who predate Accredited Social Health Activists (ASHA) and anganwadi workers, have been easy to ignore because they are poor, rural women. Their neglect reveals a gendered and caste-inflected hierarchy of labour within public health, where skilled work is low status and devalued because of who performs it. Their ongoing protests are part of an arc of agitation following similar sit-ins in Kolhapur, Nagpur, Ratnagiri and Yavatmal. In this regard, their plight resonates with that of ASHAs in other States. ASHAs, created under the National Rural Health Mission in 2005, are the community’s first link to the health system and are also officially classified as “volunteers” rather than employees, compensated only through oft-delayed incentives, amounting to less than subsistence. Across States, ASHAs have repeatedly agitated for fixed honoraria, recognition as government staff and social security, and, like the ASPs’ protests, have borne the same refrain: States cannot continue to build their health systems on the underpaid labour of women.These struggles highlight a structural contradiction. While India relies heavily on women community health workers and attendants to deliver maternal and child health care, immunisation and disease surveillance, especially in rural areas, it refuses to recognise them as workers entitled to minimum benefits and dignity. The reliance is often framed as offering rural women “opportunities” for public service. Yet, in practice, it is exploitation. These women risk snakebite while clearing hospital grounds and death in accidents en route to vaccination duty without insurance or compensation. A health system that does not value the people who keep it functional and link its margins to formal care is bound to sabotage itself. To secure rural health is to secure the rights of those women through living wages, safe working conditions and stable employment. Published - October 01, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        gender\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        Maharashtra\n                    \n                            /                      \n                        \n                        health\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        social security\n                    \n                            /                      \n                        \n                        pension and welfare\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Caste\n                    \n                            /                      \n                        \n                        public health/community medicine\n                    \n                            /                      \n                        \n                        parent and child\n                    \n                            /                      \n                        \n                        disease\n                    \n                            /                      \n                        \n                        rural health\n                    \n                            /                      \n                        \n                        vaccines",
        "headline_1": "​Labour of care: On the Anshakalin Stri Parichars, women community health workers",
        "headline_2": "Women who facilitate rural health care should get better wages",
        "link": "https://www.thehindu.com/opinion/editorial/labour-of-care-on-the-anshakalin-stri-parichars-women-community-health-workers/article70108239.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-10-2025"
    },
    {
        "full_article": "Once widespread across the Gulf of Mannar, Palk Bay, the Gulf of Kutch and the Andaman and Nicobar Islands, India’s dugongs dwindled to a few hundred individuals as poaching, by-catch, habitat loss and pollution compounded the animals’ slow rate of reproduction. But, in the last decade, a series of initiatives have signalled a serious, if still inchoate, effort to reverse this decline. The most visible step was the notification of the Dugong Conservation Reserve in Palk Bay in 2022 under the Wildlife (Protection) Act. Protecting over 12,000 hectares of seagrass meadows, it has become a model of integrated marine conservation. Tamil Nadu’s stewardship, bolstered by the Wildlife Institute of India (WII) and local community participation, has mitigated poaching and encouraged fishers to release dugongs caught as by-catch. Now, the International Union for Conservation of Nature has recognised the reserve as an exemplar, lauding its ecological significance and innovative restoration techniques. WII surveys suggest that the population here numbers over 200, fragile but encouraging progress from the fear of extinction voiced two decades ago. India has also experimented with technologies that widen conservation options, which include drone platforms and acoustic and satellite-based mapping of seagrass beds.Yet, much remains to be done. Even in the reserve, mechanised fishing, port construction, dredging and pollution from agriculture and industry threaten seagrass meadows. Dugongs continue to die in fishing nets. Rising sea temperatures, acidification and storms threaten restoration gains. Populations in Gujarat and the Andamans are also smaller and less protected than in Tamil Nadu. Experts have stressed the importance of cross-border collaboration, particularly with Sri Lanka, since dugongs traverse the narrow Palk Strait. Without shared protection, the recovery will remain local. Funding, too, has been inconsistent: while allocations from the compensatory afforestation fund have helped, the long gestation of dugong populations requires decades of steady investment. These efforts and shortcomings hold broader lessons for the conservation of other marine species that demand intact ecosystems while being directly threatened by human activity. The Palk Bay reserve demonstrates that community engagement with fishers as partners can mitigate by-catch and create local constituencies for conservation. The IUCN recognition underscores how international endorsement can amplify domestic efforts, offering legitimacy and opportunities for knowledge exchange. Likewise, blending traditional ecological knowledge with technologies such as drones and echosounders shows how conservation can bridge tradition with modernity.\r Published - October 01, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Gujarat\n                    \n                            /                      \n                        \n                        Andaman and Nicobar Islands\n                    \n                            /                      \n                        \n                        wildlife\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        habitat (conservation)\n                    \n                            /                      \n                        \n                        conservation\n                    \n                            /                      \n                        \n                        environmental issues\n                    \n                            /                      \n                        \n                        wildlife\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        fishing industry\n                    \n                            /                      \n                        \n                        Sri Lanka\n                    \n                            /                      \n                        \n                        oceans\n                    \n                            /                      \n                        \n                        pollution\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        forests",
        "headline_1": "Swim to safety: On the dugong and conservation",
        "headline_2": "Engagement with fishers can help with marine conservation",
        "link": "https://www.thehindu.com/opinion/editorial/swim-to-safety-on-the-dugong-and-conservation/article70113059.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-10-2025"
    },
    {
        "full_article": "Close scrutiny of Bihar’s post-revision electoral roll will yield pointers that EC should look at \nEC’s final electoral roll for Bihar with 7.4cr voters was announced bang in the middle of Durga Puja/Dussehra festivities that, locals will vouch, have all but put everything else on hold. It’s safe to say it’s only after Dussehra that political reactions and real impact of the special intensive revision (SIR) of voter rolls will emerge. In broad numbers, 21.5L voters were added to, and 3.7L names removed from, the Aug draft list of 7.2cr voters. The draft list had removed 65L names from Jan 2025’s 7.9cr voters – 44L of these EC had said were ‘dead’. Ground reports had exposed errors here. Fact is, the big numbers by themselves mean little. The challenge is for media, activists, voters, political parties and Supreme Court, which is hearing petitions challenging SIR, to see if the suite of problems that cropped up in the conduct of SIR have been sufficiently addressed. This includes the crucial matter of voters’ and political parties’ trust. \nEC’s sudden SIR just months before Bihar’s assembly elections was beset with controversy: one, its poor timing, two, EC’s demand for documents within a very short window in India’s largest document-scarce state, and three, EC’s contradictory and confusing takes on Aadhaar’s legitimacy as a residency document. Matters only worsened with the commission’s brusque approach to operational questions raised about SIR’s administration. Its own rollbacks – first putting off the demand for documents, then accepting Aadhaar on SC’s directive – made SIR a political hot potato. \nUndoubtedly, issues raised made voters acutely aware of what needed done to ensure they were not wrongly deleted. Heightened public awareness went some way in ensuring some disenfranchised – marginalised, women and migrants – even if at great expense of their time and effort, managed to retain their names. Bihar’s final rolls will naturally be closely parsed – who was added, who deleted, where were changes made. All eyes are now on SC as anxieties run high. After all, lessons from Bihar’s SIR will set the tone for the process nationwide.  \n\n",
        "headline_1": "Exam Begins For SIR",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/exam-begins-for-sir/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-10-2025"
    },
    {
        "full_article": "How to make a fortune by using tariffs to manipulate stock markets \nThe MAGAdomo of the White House, Peter Navarro, walks into the Oval Office where Donald Trump is poking pins into a doll labelled ‘Made in India’. \nPeter Navarro: Boss, you should be doing more stuff with your tariffs. \nDonald Trump: More stuff with my tariffs? Why, I’ve just slapped a 100% tariff on pharma, an’ 25% on trucks, an’ 100% on movies, an’ – \nPN: What I meant was that, using your tariffs, you should go short. \nDT: I’m six foot three. How in heck can I make myself short? \nPN: You don’t have to make yourself short. You take a short position on the stock market. You borrow shares from a broker, sell them for a hundred dollars a share, you make a deal to buy the same shares back later at 90 dollars a share, and when the price comes down, you buy the shares for 90 bucks, return them to the broker, and you’ve made yourself a cool 10 bucks a share. \nDT: Yeah, but what if instead of going down the share price goes up to 110 bucks, then I lose money, right? \nPN: Wrong. You guarantee that the share price goes down by unleashing another round of tariffs, which is guaranteed to spook the market and make share prices drop. \nDT: Well, that sure is a short cut to make one helluva lot of moolah.\nPN: When the share price is down, you take a long position and buy the share for 90 bucks, then you roll back some tariffs, which will boost the market, and you sell your 90 buck shares for 110 bucks. You see: short-long, long-short, up and down, like a yo-yo. \nDT: Hey, that’s a great idea. I’ll put a tariff on yo-yos! But won’t all this short-long biz be short-changing that guy called the Common American? \nPN: Don’t worry about that. When he voted you in, the Common American short-changed himself – and that’s the long and short of it.\n\n",
        "headline_1": "Long and short",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/long-and-short/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-10-2025"
    },
    {
        "full_article": "Trump’s tariff on US films made abroad will hurt US studios and viewers more than anyone else. He should can it\nThe first movie Trump acted in – 1989’s Ghosts Can’t Do It – was shot partly in Sri Lanka and Maldives, among other places. And now, he’s threatened 100% tariff on American films made abroad. He’s partly right that other countries have stolen America’s film-making business like “candy from a baby”, but only about the baby – America has had a cry-baby problem for eight months and it’s only getting worse.\nHollywood, in whose defence Trump wants to raise his newest tariff wall, is more than happy to spread candy around. Like any other business, it works with an eye on its bottom line, and costs in America are often too high. Shooting in a foreign locale, despite the flight, hotel and other logistics, can be cheaper, especially when foreign govts are willing to offer single-window clearances and tax breaks. And those savings make the US film industry stronger, not weaker.\nBeyond costs, multinational collaborations are the norm in film-making, because top talent in acting, direction, music, cinematography, etc, is spread around the world. Hollywood would be decidedly poorer without Ridley Scott and Danny Boyle, both British. Or Canadian James Cameron. Post-production work has also gone global. For example, dragons for the fifth season of Game of Thrones were created in Goregaon, Mumbai. India’s VFX and animation industry employs over 250,000, and the number could touch 2.2mn by 2032. Sometimes, two dozen VFX studios in different locations work on a single project. It’s a distributed work model, making cinema a truly global industry.\nFor Indian filmmakers, Trump’s tariff will have one immediate impact, it will double the cost of screening films in US. A market worth up to $150mn a year will be impacted. But for US, the consequences are harsher – production costs will shoot up. Smaller projects that can’t afford top dollar for US workers, nor pay tariffs, will fold up. Cinema tickets will be pricier. Okay, now we come back to Trump’s first movie, shot partly abroad. He got an award for it – Golden Raspberry for Worst Supporting Actor. He’s known to hold a grudge. Hence the tariffs? \n\n",
        "headline_1": "This Will Flop",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/this-will-flop/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-10-2025"
    },
    {
        "full_article": "By Sivakumar Sundaram\nThe feminine is a powerful dimension of life. Without Shakti, nothing in existence would stir. If the masculine is the seed of stability, the feminine is the flow of creation. The two are not opposed forces but complementary like the root and the flower, the sky and the earth, the silence and the song. When one dominates without the other, imbalance is inevitable, competition without compassion becomes destructive, while creativity without discipline drifts without direction.\nNavratri is that sacred pause in the year when we are invited to awaken the feminine within us. For nine nights, nature itself is in transition, old leaves fall, the air shifts, and life quietly prepares for renewal. In our spiritual traditions, creation is cyclical, not linear. Matter dissolves only to reappear in fresh form. Navratri aligns the human mind to this cosmic rhythm, guiding it back to its Source, where both the masculine and the feminine dance in harmony.\n\nKali, fierce yet maternal, embodies this paradox. She destroys not out of anger, but with the impartial force of nature itself, like the cleansing fire that makes way for fertile soil. To see her as fierce and aggressive is to look through the lens of fear. In truth, she is a reminder that destruction, too, is part of creation, and courageis sometimes the most compassionate act.\nAcross cultures, the sacred feminine has always been revered. The Greeks saw it in Gaia; the Earth Mother whose womb sustains life. Indian philosophy recognises the feminine as play of the three primordial gunas: sattva, rajas, tamas. The Mother Divine is not only brilliance but also confusion, not only abundance but also hunger and thirst. She is the fullness and emptiness, the giver and taker, the beginning and beyond. To worship her is to accept life in its totality.\nModern life, however, is tilted heavily towards the masculine: competition, conquest, control. While these qualities build, they also burn when unchecked.\nFeminine energy restores balance bybringing creativity, celebration, and compassion. It softens edges of ambition, turning rivalry into collaboration and anxiety into serenity. During Navratri, this transformation is almost palpable, anger dissolves into calm, fear into peace, weariness into joy.\nThis is why Navratri is not merely ritual but inner science. By raising our pran, our life-force energy, we overcome the inertia of Mahishasur, that heavy resistance within us which clings to comfort and refuses growth. We dissolve the pride of Shumbh and Nishumbh, the twin demons of ego and arrogance that seek to dominate and divide. And we silence the restless pull of Madhuand Kaitabh, those forces of craving and aversion that drag the mind between extremes of desire and denial. When these inner demons are vanquished, the path clears for balance, clarity, and joy. Through devotion, wisdom, and selfless action, the three gunas are harmonised, and the dormant Shakti, Feminine energy of creation and compassion awakens within us, irrespective of gender.\nTo recognise the feminine within is to recognise the Divine in every form, every name, every breath. Navratri is that reminder: that life is not a battlefield alone, but also a celebration. The true victory is when masculine and feminine meet in balance, when power is tempered with beauty, and creation flows in harmony with courage.\n\n",
        "headline_1": "Celebrating the feminine energy during Navratri",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/celebrating-the-feminine-energy-during-navratri/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 01, 2025 00:00:00  \nHospitals and other health service providers in the public sector have long earned infamy for corruption as well as substandard services. Reports on such irregularities abound. One might recall here the Transparency International Bangladesh (TI,B)'s study report of November 2020 during the outbreak of Covid-19. In that study, the corruption watchdog reportedly came up with ample evidences of massive irregularities in the procurement of emergency medical supplies and management of cash programme for the people economically affected by the general holiday ordered as a preventive measure against Covid-19. Against this backdrop, one is hardly surprised at the Bangladesh Public Procurement Authority (BPPA)'s recently published post-procurement review of what it said serious weakness found in procurement practices by key health agencies including the Directorate General of Health Services (DGHS), the Directorate-General of Family Planning (DGFP) and the Department of Public Health Engineering (DPHE).\nNotably, some 30 contracts each from the said health agencies for the fiscal year 2023-24 came under the scanner of the BPPA to see if those complied with the Public Procurement Act and Public Procurement Rules. In particular, the DGHS, which does the bulk of the spending under the public health sector, was found wanting in planning and contract oversight as some 433 instances of procurement delay were observed. Field inspections showed that many medical consignments were delivered but left unused resulting in damage to the equipment in question. Even some pieces of medical equipment so procured were either unnecessary or unsuitable for the purpose. What it all made clear is that the procurement was made without proper needs assessment leading to wastage of public fund. Questions also arose about the process of awarding contracts to the medical equipment suppliers. Unfortunately, it was found that more than 43 per cent of DGHS contracts representing close to 83 per cent of the total contract value were awarded to a single tender where some five suppliers grabbed the majority of the DGHS contracts. Unquestionably, it went against the principle of fair competition. At the same time, it also exposes the vulnerability of the health agency concerned to possible collusion with the contractor and price manipulation against the interest of the common people. \nSo, it is undoubtedly a commendable effort on the part of BPPA to have unravelled some cases of gross and egregious irregularities regarding procurement of medical supplies, some of which involved life-saving equipment. Obviously, such lapses implied potential misappropriation of public money as well as inexcusable wastage of state resources. As is evident from the BPPA's post-procurement review, the government's apparently robust legal and digital procurement framework is rather weak when it comes to its practical execution. In this connection, the BPPA's recommendations for making need assessment mandatory, ensuring stronger contract management, prohibiting pre-delivery payment, preparing procurement schedules with an eye to budgetary allocations and so on are surely to the point. It is one thing to uncover instances of irregularities, but quite another to take appropriate action to rid the entire health sector of the elements responsible for mismanagement and corruption. \nWhat the BPPA has laid its hands on is just the tip of the iceberg. In fact, such a vital sector of the government that looks after the health of the nation is itself afflicted with chronic ailments. Essentially, the health sector, its major service providing agencies in particular, requires complete overhauling-lock, stock and barrel. But so far no serious attempt has been made by successive governments to this end. Now it is time the interim government acted on the basis of the recommendations made by the Bangladesh Public Procurement Authority (BPPA) to rid the public health sector of its deep-seated mismanagement and corruption.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Tackling irregularities, corruption in health sector",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/tackling-irregularities-corruption-in-health-sector-1759244883",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       October 01, 2025 00:00:00  \nWhile a lack of government initiative is often blamed for the sluggish performance of the country's export of services, absence of innovative approaches by the private sector is considered no less responsible. The combined effect of these two factors appears to be keeping the country's service export on a declining trajectory. Despite the vast potential that the sector holds, Bangladesh has not been able to harness opportunities in the global market in a sustainable way.\nThe country's export earnings from services have been sliding over the last three years, following a short-lived pickup even in the post-pandemic fiscal year. This trend, according to officials and trade analysts, has largely stemmed from neglect-both in policy direction and in entrepreneurial dynamism. The service sector has often been treated as a peripheral part of export strategy, with most attention concentrated on merchandise such as garments, leather, pharmaceuticals, light engineering, and agriculture. But in a world increasingly driven by digital and knowledge-based services, such neglect has cost the country dearly.\nNotwithstanding an impressive income in the fiscal year (FY) 2021-22, when the sector bounced back strongly just after the Covid-19 pandemic, Bangladesh failed to maintain the momentum in the years that followed. That year, service exports brought in US$8.89 billion-a record figure and a clear demonstration of the sector's potential. Yet the optimism proved short-lived. In FY2023, earnings fell to $7.50 billion, marking a sharp reversal. The following year (FY2024) saw a further decline to $6.64 billion. In the last fiscal year (FY2025), there was a modest uptick to $6.91 billion, but this still left the sector nearly $2.0 billion short of the FY2022 peak. According to the Export Promotion Bureau (EPB) data, the rise in FY2025 amounted to just 3.96 per cent compared to the previous year-too little to signal any real turnaround.\nThese figures reflect a deeper malaise. Experts argue that government policymakers remain preoccupied with the ready-made garment (RMG) industry and a few other merchandise exports, leaving services to develop largely on their own. But services require targeted policy support and investment in infrastructure, skills, and innovation. The global service market is expanding rapidly, particularly in digital domains such as software, IT-enabled services, fintech, e-commerce support, and online education. Countries like India and the Philippines have captured significant shares of this market by promoting IT parks, outsourcing hubs, and skill-development initiatives. Bangladesh, however, has yet to put in place a comparable ecosystem.\nAt the same time, entrepreneurs of the service sector have also been slow to diversify, innovate and market their products internationally. Too often, businesses rely on traditional areas like manpower exports, sea and air transport, or tourism without aggressively moving into high-growth fields. The absence of structured branding, international marketing, and partnerships with global players has also limited Bangladesh's footprint.\nA closer look at the composition of Bangladesh's services exports in FY2025 sheds light on both strengths and missed opportunities. Among the key sectors, foreign-exchange earnings from education and tourism amounted to $505 million, construction services fetched $750 million, while computer services-including software, data processing, and consultancy-earned $628.5 million. Another $550 million came from computer-data processing and hosting services, which fall under IT-enabled services. Technical, trade-related, and other business services generated $980 million, while sea transport brought in $630 million and air transport $400 million. Financial services, excluding insurance, earned $250 million. These figures underscore that Bangladesh already has a presence in diverse service areas. However, compared to global benchmarks, the earnings are modest.\nThe tourism and education segments are also illustrative. With rich cultural heritage, natural beauty, and a growing reputation for affordable medical and higher education, Bangladesh could attract many more international visitors and students. Yet the earnings of $505 million in FY2025 fall far short of the potential. The reasons are not hard to find: a lack of infrastructure, inadequate branding, poor service quality, and regulatory bottlenecks discourage both tourists and students.\nTo reverse the decline in service exports, both the government and private stakeholders need to rethink their strategies. The government must recognise services as a strategic export sector, on par with garments and other goods. This requires formulating a comprehensive policy framework for export of services, providing fiscal incentives, investing in digital and physical infrastructure and facilitating international market access. Establishing special zones for IT and outsourcing, easing foreign investment rules in services and negotiating bilateral agreements for mutual recognition of qualifications could open new doors.\nMeanwhile, entrepreneurs and service providers must step out of their comfort zones. Innovation, diversification, and aggressive global marketing are essential. For example, Bangladeshi software companies could collaborate with international firms to secure outsourcing contracts. Universities and training institutes could design specialised courses to build skills in areas such as artificial intelligence, cyber-security, and digital marketing-fields that are witnessing explosive demand worldwide. The tourism sector, too, could benefit from partnerships with international operators, better infrastructure and targeted campaigns highlighting Bangladesh's unique attractions.\nUltimately, the future of Bangladesh's service exports hinges on whether the government and private sector can act in concert. The decline of the past three years should serve as a wake-up call. With global demand for services expanding at an unprecedented pace, Bangladesh cannot afford to remain a bystander. \nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Reversing the slide in  service export",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/reversing-the-slide-in-service-export-1759244923",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 01, 2025 00:00:00  \n\n The \"Theory of Organic Evolution,\" proposed by Charles Darwin, marked a turning point in scientific history. Darwin explained how new forms of life emerge through natural mechanisms such as mutations, and how only the fittest survive under the pressure of natural selection. Today, this theory stands as one of the fundamental cornerstones of modern biology, supported by extensive fossil records and a wealth of scientific evidence.\nThe Darwinian school of thought, however, extends beyond science alone. The idea of the \"struggle for existence\" carries profound implications for individuals, communities, and nations. History demonstrates that societies that embrace knowledge and adapt to change tend to flourish, while those that resist progress are often left behind.\nIf Bangladesh aspires for long-term prosperity, it must safeguard scientific learning and ensure an environment where research and free inquiry can thrive. Only by embracing knowledge and innovation can the nation secure its place in an increasingly competitive world.\nShahria Bin Kabir\nIndependent Researcher\nJahangirnagar University\nkabir.ju.003@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Promoting scientific learning",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/promoting-scientific-learning-1759244943",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 01, 2025 00:00:00  \n\nA 2024 white paper prepared during the current interim government estimated annual trade-related outflows from Bangladesh at $16 billion, equivalent to 3.4 percent of GDP-more than the nation's total yearly health budget. \nTBML primarily occurs through mis-invoicing of international trade transactions, or trade mis-invoicing. By fraudulently misreporting the price, quantity or quality of goods, criminals can quickly move substantial amounts of money or value from one jurisdiction to another. Both the importer and the exporter are usually involved in such misrepresentation. TBML also takes place when parties over- or under-ship goods. This includes \"phantom shipments,\" where no product is moved at all. By overstating or understating the quantity of goods shipped or services provided, the buyer and seller can transfer value at the time of payment. Another common method is multiple invoicing of goods and services. This technique involves re-using existing documents to justify multiple payments for the same shipment. Parties engaged in multiple invoicing often use several financial institutions to increase the complexity of the transaction and make detection difficult.\nThe extent of TBML is a serious concern. The Global Financial Integrity estimated the gap between developing and advanced economies' export and import declarations at $8.7 trillion for 2008-2017, a figure that indicates the approximate extent of TBML worldwide.\nFinancial institutions engaged in trade need to be vigilant and implement specific control frameworks to protect themselves from being exploited by criminal actors. Ineffective controls can result in serious consequences: facilitation of money laundering or terrorist financing, regulatory penalties, reputational damage, and even the loss of correspondent banking relationships. From 2019 to 2020, the number and dollar value of AML and Know Your Customer (KYC) fines nearly doubled-from $5.7 billion to $10.4 billion-highlighting the vulnerabilities of ineffective TBML management. In Bangladesh, the problem is even more acute. According to the National Board of Revenue, nearly 75 per cent of domestic money laundering occurs through trade channels.\nTo combat TBML, financial institutions should adopt several measures: conduct risk assessments to identify vulnerabilities based on sectors and jurisdictions; adopt robust due diligence procedures on customers and third parties, including ownership structures, to identify complex arrangements that signal TBML; screen customers and third parties using national and international regulatory and reputational risk analyzers; and provide regular employee training across the organization. A Bangladesh Institute of Bank Management (BIBM) study further recommends establishing a Trade Transparency Unit that combines customs and BFIU data, publishing a public beneficial ownership register, and expanding KYC/AML duties to freight and warehouse operators to help curb TBML.\nAnwar Faruq Talukder\nEconomic Analyst\nanwarfaruq@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Preventing trade-based money laundering",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/preventing-trade-based-money-laundering-1759244965",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-10-2025"
    }
]