[
    {
        "full_article": "The Leader of the Opposition in the Lok Sabha, Rahul Gandhi, has levelled serious allegations of “criminal fraud” against the Election Commission of India (ECI), by claiming that over 1 lakh fake votes were created in the Mahadevapura Assembly segment of the Bangalore Central Lok Sabha constituency in order to ensure a victory for the Bharatiya Janata Party (BJP) in the 2024 general election. His detailed presentation outlining five categories of alleged electoral malpractices demands careful examination, not wholesale dismissal. The Congress leader’s documentation reveals troubling patterns: voters registered multiple times within the same constituency, identical Electors Photo Identity Card (EPIC) numbers across different States, and improbably large numbers of voters listed at single addresses. While identical EPIC numbers across different States are not a significant issue — the ECI addressed these anomalies earlier this year — his claim that party workers found booth slips showing multiple votes by the “same person” in a single booth represents a serious violation of the “one person, one vote” principle, if verified. Mr. Gandhi claimed that these discrepancies were not limited to Mahadevapura but were part of a calculated modus operandi to help the BJP in marginal constituencies across the country. The Congress party had made similar allegations about massive increases in electoral registrations prior to the Maharashtra Assembly election, claiming that these had contributed to the unexpected victory of the BJP and its allies, though without elaborate proof of erroneous registrations as seen in Mahadevapura. Mr. Gandhi’s analysis stops short of proving that these discrepancies directly enabled the BJP’s victory. The BJP won the Mahadevapura Assembly seat in 2023 with a margin of approximately 44,500 votes. The increased margin, to over 1,14,000 votes, in 2024 happened even though the total accretions in the electoral roll were around 52,600 electors and the actual voter count increased only by around 20,000. Establishing a causal link between electoral roll errors and poll outcomes requires more than circumstantial correlation. The leap from documenting registration flaws to alleging deliberate fraud orchestrated by the ECI in collusion with the BJP remains unsubstantiated.The ECI has adopted an unnecessarily defensive stance by demanding that evidence be submitted ‘under oath’ — a requirement that legal experts suggest may not apply in this situation — and attributing electoral discrepancies to the failure by political parties to raise concerns during registration. More problematic is the ECI’s practice of releasing voter information in bulky image PDFs rather than structured, searchable text formats, which hinders verification efforts by political parties and civil society organisations. The ECI’s approach to voter registration relies heavily on self-declarations and lacks robust verification mechanisms. The Mahadevapura controversy highlights the urgent need for comprehensive electoral roll reform through door-to-door verification, the most reliable method. The ECI’s Special Intensive Revision (SIR) exercise in Bihar appears to respond to critics about electoral roll problems. In theory, this should help maintain more accurate rolls. However, rushed implementation and problematic identity verification requirements risk creating new issues related to legitimate voter deletion. Data already show higher deletions among women electors than men in Bihar. Considering that most out-migrants are males, the higher deletion of women electors could indicate that marginalised electors — particularly those who are illiterate (literacy rate of women aged 15-49 years in Bihar was 55% in 2019-21, according to the National Family Health Survey) — have been erroneously excluded in the enumeration process for the draft SIR roll.The broader challenge extends to multiple aspects of electoral administration: lax implementation of campaign finance regulations and the Model Code of Conduct, tallying VVPATs from only small samples rather than statistically significant proportions, inadequate technical safeguards for symbol loading in VVPATs, and the unwillingness to submit the EVM’s technical safeguards to independent expert verification. The ECI’s resistance to retaining CCTV footage from polling booths, delays in publishing final turnout figures, and evolution into an institution viewing criticism as an attack represent a troubling departure from democratic norms. The fundamental issue underlying current electoral controversies is the erosion of institutional trust. The ECI’s credibility depends not merely on technical soundness but also on public confidence in its impartiality and transparency. The process of appointing Election Commissioners needs to follow the Supreme Court’s recommendation to include the Chief Justice of India in the selection panel, currently side-stepped by the government. Mr. Gandhi’s allegations fall short of establishing deliberate fraud. But his party’s findings perform a valuable democratic function by highlighting systemic flaws. The appropriate response requires comprehensive voter roll auditing, enhanced transparency in data sharing, improved technical safeguards including comprehensive audit trails of EVM commands and security protocols for symbol loading, stronger enforcement of electoral regulations, and consultations with political parties. The ECI must embrace the principle that democratic institutions grow stronger through scrutiny. The alternative — continued erosion of confidence in electoral processes — poses far greater risks to democratic governance than any specific allegation of malpractice. Published - August 09, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        politics\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        Bangalore\n                    \n                            /                      \n                        \n                        Lok Sabha\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Maharashtra Assembly Elections 2024\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        democracy",
        "headline_1": "Fix the flaws: On Rahul Gandhi’s ‘stolen elections’ allegation and the Election Commission of India",
        "headline_2": "Voter registration problems demand systemic solutions by the Election Commission of India",
        "link": "https://www.thehindu.com/opinion/editorial/fix-the-flaws-on-rahul-gandhis-stolen-elections-allegation-and-the-election-commission-of-india/article69910219.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "09-08-2025"
    },
    {
        "full_article": "The Reserve Bank of India’s (RBI) Monetary Policy Committee was sensible to pause its rate cuts, as announced on Wednesday (August 6, 2025). RBI Governor Sanjay Malhotra rightly pointed out that the uncertainties surrounding tariffs are still evolving, and that the 100 bps of rate cuts implemented since February 2025 are still percolating through the system. Mr. Malhotra’s statement was made before U.S. President Donald Trump approved an additional 25% tariff on imports from India, over and above the existing 25% reciprocal tariffs. However, his assessment that the matter is far from over was nevertheless accurate. India is still in the process of negotiating a Bilateral Trade Agreement with the U.S., and the final tariffs are far from decided. In the meantime, Mr. Trump has already indicated that similar additional tariffs — “penalties” for buying oil from Russia — may be imposed on other countries as well, which will impact India’s comparative advantage. Leaving room for another rate cut later in the year when things might be clearer, thus, was the sensible thing to do. The other broad reason why the pause makes sense is that it allows the RBI to see whether such monetary measures are working. A 100 bps cumulative cut in rates over the last six months is significant, and the banking system needs time to pass that on to borrowers. The Governor also pointed out that there is ample liquidity in the system, which means the banks have the money to lend.The question, however, is whether there is enough growth-related borrowing happening. RBI data show that, as of end-June, loans to purchase consumer durables had contracted about 3% compared to the previous year. Growth in housing loans slowed sharply to 9.6% from 36% a year earlier, while vehicle loans too slowed by five percentage points over the last year. In line with this subdued demand outlook, companies too seem to be slowing their borrowing. Loans to industry grew 5.5% in June 2025, down from 8.1% in June last year. Simply reducing rates, therefore, is not enough and that is something the Governor alluded to when he said stronger policy frameworks “across domains, and not just limited to monetary policy”, would be pivotal in achieving India’s growth potential. The government has to intervene in a more focused manner than just increasing capital expenditure across the board. A lot can be done through tax. The Goods and Services Tax rate rationalisation, that was promised several times, is long overdue. A reduction in fuel prices in line with lower oil prices, too, will lift consumer sentiment. The RBI can, for the moment, afford to wait things out. The government does not have this luxury. Published - August 08, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        interest rate\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        imports\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        trade agreements\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        vehicle loans\n                    \n                            /                      \n                        \n                        loans\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        housing loans",
        "headline_1": "​Time for action: On the RBI pausing rate cuts",
        "headline_2": "The Reserve Bank of India did well to pause rate cuts amid the uncertainties",
        "link": "https://www.thehindu.com/opinion/editorial/time-for-action-on-the-rbi-pausing-rate-cuts/article69905834.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "09-08-2025"
    },
    {
        "full_article": "GPT-5 gets mixed reviews, but everyone’s trying it\nThey say the worst day to review a new AI model is launch day. Clearly, no one told the internet. Reviews of GPT-5 were flooding in even as Sam Altman was still on stage unveiling it. Honestly, you can’t blame the excitement. Everyone remembers how much their world was shaken by the OpenAI chatbot when it launched in Nov 2022. Altman calls GPT-5 a PhD-level expert in your pocket. By comparison, the previous version was a college grad. And the one before that? A high-schooler. Some early testers say it “absolutely blows”. Others complain it’s more evolution than revolution. Either way, the weight of public opinion on this is still settling. And unlike 3 years ago, today users can test GPT-5 against Claude, Gemini, DeepSeek, Grok…\nActually, want to play a fun game? Ask a question not from one, but four different chatbots. Or do the same with an image command. Obviously all this very serious stuff too. A recent McKinsey global survey finds that generative AI’s effects are still not solid on bottom lines, with more than 80% respondents not seeing a tangible EBIT impact in their organisations. But 71% used gen AI in at least one business function in 2024 compared to 33% in 2023. \nIt’s at the AI companies themselves that the productivity gains are stellar. For example, the majority of code written at Anthropic is already written by Claude. And overall, experts say AI investments amount to the biggest US infra boom since the 1960s, or maybe even the railroad 1880s heyday. In India, Altman said users are doing “really quite remarkable” things with AI. Worryingly, the same cannot be said about India’s AI makers.\n\n",
        "headline_1": "Hello Dr AI",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/hello-dr-ai/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-08-2025"
    },
    {
        "full_article": "Factory jobs are key to health of Indian farming\nIndia did right by not opening its agri markets to US grains, fruit, dairy and fish. Agriculture sustains 42% of India’s population and employs 46% of workers. But as it generates less than a fifth of GDP, most farmers are poor. A recent Nabard report said farming households earn ₹13,661 per month, on average, of which actual farm income is just ₹4,476. The rest is income from other work. Pitting millions of such small farmers against the output of America’s highly mechanised farms would amount to throwing them under the bus. So, when Modi says, “For us, our farmers’ welfare is supreme,” we can’t agree more.\nBut it’s time farmer welfare moved beyond protectionism. The greatest good that govt can deliver to farmers is to free them from the yoke of subsistence farming. Only 2% of US population works in agriculture, 1% in Germany and UK, and 3% in Japan. In 1991, the number was 60% for China and 63% for India. China has brought it down to 22% – below the global average of 26% – but India is now in the league of Afghanistan (45%), N Korea (47%) and Myanmar (45%). \nThere’s no glory in subsistence farming. Population growth has fragmented landholdings to an unviable size. From 2.28ha in 1971, average farm size came down to 0.74ha by 2021. And as TOI reported last month, input costs and inflation have risen faster than earnings from most major crops. Yet, the share of workers in agriculture has grown from 44% in 2017-18 to 46% in 2023-24. That signals a failure of industry to create jobs at the required rate of 7.9mn every year. GOI must address this problem, not for Trump’s deal but to modernise India.\n\n",
        "headline_1": "Field Notes",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/field-notes/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-08-2025"
    },
    {
        "full_article": "Information glut isn’t the real problem of these times\nAnxiety over the hold of technology on daily lives and minds drives everyday conversations – the ills of fake news and misinformation, how politicians exploit algorithms, what social media is doing to our thoughts, to our children and body politic, are analysed to the last byte. Availability of, and access to, information right, wrong and indeterminate is infinite and plentiful. It is a cheap resource. There is no dearth of predictions on the scary outcomes of the stranglehold of this surfeit of information. \nYet all of it misses the reality that we are not living in an Information Age, but in an Attention Economy, argues journalist Chris Hayes in The Sirens’ Call: How Attention Became The World’s Most Endangered Resource. Way more critical than all the muchly debated ills of an information glut is that we have ceded control over who and what has our attention – a finite resource. \nHayes uses American legal scholar Lawrence Lessig’s example of a picnic table to explain his point. Information is the idea of a picnic table in your backyard. Even if others pick up the idea of that picnic table – your information – it doesn’t really impact your own picnic table, it is still yours, you still have it. But, the picnic table itself – that’s attention. So, if your picnic table is taken away – well, that entity has your attention and you don’t have it. \nThat’s how finite attention is. You either control who has your attention, or you’re flitting from one to another. The fight is for your attention. Our capacity to focus is limited, which makes attention a scarce and sought-after commodity. Reality is grainy and grey, so we much better enjoy glitzy tinsel-tinted bright hi-def images and noise – it grabs our attention. \nThe book explores how industries have evolved to capture and monetise our attention. Social media platforms’ and news outlets’ systemic effort to design content and experiences that keep us engaged, often at the expense of our well-being. The book delves into how modern technologies tap into our neurological responses, creating addictive patterns similar to those found in gambling. This exploitation leads to a state where our attention is continuously hijacked, diminishing our ability to engage in deep, meaningful focus.\nThe attention economy thrives on sensationalism. Content that provokes emotional reactions is rewarded, mostly at the expense of accuracy. Hayes argues that propagandists exploit this to manipulate public opinion. This creates an environment where misinformation spreads faster than truth, eroding trust in institutions and making consensus-building nearly impossible.\nAlgorithms tailor content to individual preferences, creating echo chambers and filter bubbles. Such personalisation reinforces ideological divides. Citizens no longer share a common information base. Without a shared reality, public discourse fractures. Society loses the ability to even agree on what needs solving. The public sphere turns reactive. \nHooked to this stream of information/misinformation translates into not paying attention to grainy realities of governance. Digital distraction directly impacts democracy, which depends on citizens paying attention to governance. But attention is hijacked by entertainment and outrage in equal parts. People disengage from civic life. This, the book argues, opens the gates for authoritarian tendencies because fewer people are participating in democratic process or holding leaders accountable. Commodification of attention is more than a cultural or technological issue. It’s a structural threat to democratic society. Our lives are what we pay attention to. \n\n",
        "headline_1": "Our lives are what we pay attention to",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/our-lives-are-what-we-pay-attention-to/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-08-2025"
    },
    {
        "full_article": "He’s left a short window before penal tariffs apply. There’s no question of appeasing him. But GOI can be smartly flexible, like buying more US oil if it’s priced competitively or engaging Russia on the ceasefire issue\n\nTrade disputes are not new. But when commerce is weaponised to dictate foreign policy, rules of engagement shift. In 21 days, Indian exports to US will face a 25% penalty for continued purchase of Russian oil. Combined with existing reciprocal tariffs, Indian goods will face the highest trade barrier in US alongside Brazil, at 50%. Washington has fused trade, diplomacy, and global strategy into a single ultimatum. The message is clear. The stakes are high. The window is closing fast.\nRead full story on TOI+\n\n",
        "headline_1": "India’s 21-day Trump trap",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/indias-21-day-trump-trap/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-08-2025"
    },
    {
        "full_article": "Every time political or ceremonial events take over the streets in Bangladesh, it is the ordinary citizens, \"the mango people,\" who silently pay the price. Small traders, informal workers, and roadside vendors are the first to suffer when traffic comes to a halt, deliveries are missed, and perishable goods go bad.\nThe economic cost of road blockades is not an abstract concern. It plays out visibly, as it did on August 6, when Dhaka was brought to a near standstill by celebratory processions and street programmes. While supporters of political parties waved flags and loudspeakers blared, the city's arteries choked. Delivery vans were stuck for hours, online orders were cancelled, office-goers were stranded, and many daily earners—who often survive on a few hundred takas a day—went home empty-handed. The irony is that even when there is no political unrest, the culture of blocking roads for rallies and commemorations has the same suffocating effect on commuters, small business owners, and informal workers.\nOver 78 lakh SMEs in Bangladesh employ more than two crore people and account for about 27 percent of the country's GDP. These livelihoods are often dependent on road transport. A half-day of blocked streets means halted deliveries, lost inventory, and cancelled sales, especially for perishable goods like fruits, fish, and dairy.\nIn 2023, an Al Jazeera report cited the Federation of Bangladesh Chambers of Commerce and Industry (FBCCI), which stated that the ongoing blockades were causing Bangladesh's economy to lose Tk 6,500 crore per day. This trend persists to this day. And the greatest burden of this loss is borne by the poor, not really by the large corporations or organisers of political parties.\nThe situation worsens for small businesses due to systemic and structural unfairness. Generally, large businesses can adapt as they have warehouses and can use alternate routes. The wealthy can stay home or shift to online services. But the \"mango people\" do not have that luxury. For them, every hour of gridlock is a step closer to poverty. And when gridlock comes not just from political unrest but from celebrations and rallies, the message is even clearer: their time, work, and survival are dispensable.\nThis trend must be reversed. I think the following steps will make a difference: i) creating emergency movement protocols; ii) ensuring stricter regulation of road occupation; iii) protecting informal livelihoods; and iv) enforcing transport discipline. Essential and perishable goods must be allowed passage during all major events, closures, or celebrations, and rallies must be time-bound and limited in scope. Such events should be held in designated zones away from economic corridors. Furthermore, urban mobility plans should ensure that no single event can paralyse the capital's transport for hours.\nAugust 6 was just the latest example—but protests, blockades and other street programmes are a recurring nightmare for small traders and workers. These people do not gain anything from symbolism, and yet they lose the most. If we want an inclusive and just Bangladesh, the \"mango people\" must be given the freedom to move, to trade, and to earn—no less than anyone else.\nDr Mohammad Naveed Ahmed is managing director of Miyako Appliance Limited, Bangladesh, adjunct associate professor at Independent University Bangladesh, and joint convenor at the Dhaka Chamber of Commerce and Industries.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Who pays when the roads are blocked?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/who-pays-when-the-roads-are-blocked-3958321",
        "news_paper_name": "The Daily Star",
        "publish_date": "09-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 09, 2025 00:00:00  \nThere is no gainsaying the importance of keeping a government running effectively within its budget. So, the entire process of procuring its funds, allocating those, monitoring their use and, finally producing financial report are the key areas of fiscal management. Since human bias and errors can prejudice the outcome of this exercise, the need for digitalizing the procedure cannot be overstated. And that is more so when it comes to ensuring the transparency and accountability of the process. According to the global lender, the International Monetary Fund (IMF), comprehensive, transparent, reliable and timely public reporting on the state of public finances is critical for effective fiscal management and accountability. Because, it helps ensure that the government has an accurate picture of its finances when making economic decisions including costs and benefits of any policy changes and potential risks to public finances. More importantly, it provides the legislature, markets and citizens with the information they need to hold the government accountable. \nIn this connection, the body under the Finance Ministry, Finance Division, in short, FD, which is responsible for controlling government expenditure and national budget has recently showcased at a workshop in the city an online digital platform with the acronym, SABRE+ system, developed by it (FD) to, what it said, enhance transparency and accountability in the management of the State-Owned Enterprises (SoEs) and autonomous bodies. Standing for 'State-owned Enterprises and Autonomous Bodies Budget, Reporting, and Evaluation System', SABRE+ system, is designed to streamline the process of budget preparation, financial reporting and performance evaluation for the SoEs and autonomous bodies. To distinguish the special features of 'SABRE+' vis-à-vis other types of online digital platforms, the Finance Adviser of the interim government, Dr Salehuddin Ahmed, who spoke at the said workshop reportedly pointed out that the system in question was more than just a digital tool as it represents a pivotal shift towards data-driven, transparent and accountable governance across the SoEs and autonomous bodies. \nTrue, reliable data and internal control are the sine qua non of good governance. Hopefully, the SABRE+ system will be able to meet the objective by enabling the government to carry out timely evaluation of its fiscal-related activities. It is believed, once implemented efficiently, the new online platform will help avoid discrepancies in budget planning so its financial aspect could be managed well. Definitely, it is a step forward towards transitioning to a framework that is based on performance and compliance. While appreciating the good work that has gone into developing the online system, it is also important to keep in mind that any machine, however smart, requires humans to run it. In that case, unquestionable integrity of the man behind the machine will always remain the first condition to meet before it can deliver without bias and prejudice. \n So, one would like to believe that the development of the new, online digital tool for budget reporting and evaluation would be able to prove its worth through its application in the government sectors for which it is designed. For, according to reports, at the moment, total liabilities with the 101 SoEs and autonomous bodies stand at over Tk.6.39 trillion with 26 per cent of the amount tied to subsidiary loan agreements. There is no question of keeping track of as well as correctly assessing this huge government liability with the help of the digital tool designed for the purpose. As expected, the next step of the government would be to take appropriate measures to rid the public exchequer of this enormous drain on the government exchequer.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Digital platform for transparent fiscal management of SoEs",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/digital-platform-for-transparent-fiscal-management-of-soes-1754666927",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       August 09, 2025 00:00:00  \n\nWhen people from all walks of life rose up against the Awami League regime in July last year, their focus remained firmly on toppling an authoritarian government. With the state forces unleashing violence on unarmed protesters on the streets, there wasn't enough time to consider what political system might follow the crisis. It was only after Sheikh Hasina fled to India on August 5 that the people truly sensed her grip on power had broken and felt free to turn their attention to reshaping the country's political future. In the immediate aftermath of the regime's fall, coordinators of the student-led uprising turned to Nobel Peace Prize-winning economist Muhammad Yunus and urged him to lead the government during this critical period. Given his global stature, clean image and track record, they could think of no one more qualified than him to restore stability, rebuild public trust and initiate reforms in the post-uprising atmosphere. True to their hopes, Dr. Yunus's interim government entered office as one of the most popular and widely supported administrations in the country's history. \nIt is difficult to say for certain how much of that initial popularity still holds as the government completed one year in office and set early February 2026 as the tentative date for national elections. But if public opinion on social media is any indication, dissatisfaction is growing, fuelled by unmet expectations and the slow pace of meaningful reform in a system plagued by inefficiency and corruption. Admittedly, the government's journey over the past year has not been easy. There were multiple attempts to unsettle it and create chaos on the streets, some of which were perhaps inevitable after a mass uprising. However, managing these crises, especially the law and order related ones, was particularly difficult, as the government had to rely on a police force weakened by years of politicisation under the previous regime which left it demoralised and ineffective. \nObviously, the government failed to deliver the fundamental reforms needed in the police, intelligence agencies, security forces and civil service that made up the power structure sustaining the previous autocratic system. While many hoped for a decisive shift from colonial, authoritarian and exploitative governance models of the past, they saw no real commitment or meaningful steps toward such reforms. In fact, the government itself appeared unsure of its ability to drive such transformation. This failure to reform, whether from inability or neglect, has allowed all forms of malpractice to flourish which is the source of public outrage. Today, public conversations revolve around talks of extortion, bribery, corruption, fraud and mob violence because these are the harsh realities people face daily. Many attribute this to the uprising's failure to transform civil service and law enforcement into accountable, citizen-centric institutions. After all, as they understand, rampant extortion and irregularities could not persist in Bangladesh's political reality without the civil administration and law enforcement letting them happen. \nIt is a sad reality that in some places, members of the student-led National Citizen Party (NCP) have been involved in extortion and lobbying. Students hold a privileged position under this administration because they played a key role in overthrowing the previous regime, and now the same cycle seems to be repeating where privileges lead to excesses, and excesses lead to oppression and violence.\nEver since this new government took office, the BNP has been calling for elections because they believe, in the current climate, they are the main contender with virtually no competition. Their leaders have made the demand for early elections their central talking point, insisting that elections alone can restore representative democracy. However, as the 15 years of misrule under Awami League have shown, without real reforms that make those in power fully accountable to the electorate, even competitive elections may become little more than political theatre. As American writer Walter Mosley once said about his own country, \"We have the formal structure of democracy, but not the substance.\" The same can be said of Bangladesh today. The necessary institutions exist and resources are available, but progress remains obstructed by the entrenched interests of those who come to power and benefit from the status quo. This explains why in the post-uprising era, people continue to dread that a change in leadership might simply replace one ruling elite with another. \nSo what happens if the BNP wins power in the February elections? Will they be able to truly champion the people's interests or will they pursue their own agenda just like their predecessors and dominate and control? It is true that the BNP's 31-point charter contains some ambitious ideas for the country's future, however it lacks a clear roadmap for implementation. On top of that, many of these points rely heavily on legislative changes. But as history is our witness, expecting political legislation alone to solve the country's problems is fundamentally misguided. \nMore alarmingly, reports suggest the party is struggling with internal corruption. Media accounts reveal that the BNP has expelled approximately 5,000 leaders and activists since the fall of the autocratic government for disciplinary violations, which often means involvement in extortion or violence. That a party aspiring for power must expel so many of its members suggests that criminal elements are viewing it as their new safe haven. This points to the need for a fundamental shift in both attitude and behaviour. Such changes obviously will not come on its own, because if it were to happen naturally, it would have happened by now. The BNP must take deliberate steps to cleanse itself of corrupt actors and sever the link between money and politics. Otherwise, there is a risk that any electoral victory will just be another chapter in the cycle of hegemony and corruption.\nThis is why the current mass uprising holds extraordinary potential to reshape the nation's direction and fulfil the people's long-standing aspirations. It has generated a momentum for establishing equality and transforming our political culture. But if this historic opportunity is squandered and the forces rising to power repeat the mistakes of the past, the same injustices will return and the uprising will have all been for nothing.\nshoeb434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "July uprising, abiding hopes and harsh truths",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/july-uprising-abiding-hopes-and-harsh-truths-1754667007",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       August 09, 2025 00:00:00  \n\nThe proliferation of motorcycles, driven by various incentives for mobility, has made them a popular alternative to public transport. In the first seven months of this year, a staggering 153,468 new motorcycles were registered across the country, with Dhaka alone accounting for 36 per cent. This figure, however, does not account for unregistered motorbikes, suggesting that the actual figure is even higher. \nUnlike motorcycles, there is no formal registration system for battery-run rickshaws, making it impossible to determine their actual numbers. The streets of Dhaka are inundated with these vehicles, contributing to the daily congestion in various parts of the city. The demand for these motorized vehicles is on the rise, as they offer commuters a faster and more convenient mode of transportation. \nUnfortunately, battery-run rickshaw drivers have also adopted the habit of driving on the wrong side of the road, mirroring the behaviour of motorcyclists. Many of these drivers are known for their lack of respect for others, with some even being involved in criminal activities such as drug addiction, mugging, and snatching. \nAgain, a number of these drivers fled from their home districts, towns and villages and came to Dhaka as they were involved with the political party in power before August 5 last year. As the July mass uprising toppled the autocratic regime of Hasina a year back, leaders and activists of the Bangladesh Awami League (BAL) came under retaliatory attack by those who were previously intimidated by them for their involvement with opposition parties. \nRegular commuters have already experienced the carelessness and arrogance of a section of battery-run rickshaw drivers who drive on the wrong side whenever they get the chance. It becomes impossible to resist them, and attempting to do so brings a mob. Even in many cases, traffic police appear helpless and allow them to drive on the wrong side. \nNevertheless, a lack of adequate and decent jobs in semi-urban and rural areas has also driven many to become battery-run rickshaw pullers and migrate to Dhaka and major cities. So, the influx of these vehicles is linked to the unemployment problem in the country. Another factor is the absence of an efficient public transport system in the country. Except for the metro-rail in Dhaka, the bus-based public transport is inefficient and hazardous. It is disappointing to find that hundreds of dirty and ramshackle buses mark the capital city of Bangladesh, which are continuously polluting the air and causing noise. It is a nightmare for the commuters to travel by these buses, where the seats are congested and the windows are broken. \nDue to a rise in motorcycles and battery-rickshaws, roads and streets in most parts of Dhaka witness gridlock. So, a large number of motor bikers and rickshaw pullers often seek shortcuts on overcrowded roads to save time. By doing so, they disrupt normal traffic flow, amplifying the risk of accidents. \nDespite reckless wrong-side driving, the number of accidents is relatively low in Dhaka, mainly due to an extra cautionary approach taken by private cars, CNG-driven auto rickshaws and buses to provide room for the motorbikes or battery-run rickshaws coming from the opposite side in wrong lanes. However, it's important to note that even a small number of accidents can have severe consequences. The violators, however, do not understand that they not only endanger their own lives but also the lives of pedestrians and others driving on the right side of the road. Instead, they show a blatant disregard for the law and public safety norms. The near-absence of the fear of prosecution also turns them desperate. They are desperate to take shortcuts, and it doesn't matter whether the roads are broad, narrow, or arterial stretches. \nSo far, no effective measures have been taken to curb the bad culture of wrong-side driving. Many see a shortcut as a good way to save time, and so they take it, violating the law, without thinking of the consequences. And this is a traffic problem that cannot be solved by design changes alone. It needs strict and consistent enforcement of laws at various levels along with ensuring an efficient public transport and building a greater public awareness.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Wrong-side driving turns into a menace",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/wrong-side-driving-turns-into-a-menace-1754667057",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 09, 2025 00:00:00  \n\nAs digital payments become the new normal, everywhere we turn, from sleek cafés to clothing stores, we see QR codes are being scanned. For many, this shift is a symbol of progress and convenience. But outside urban hubs and air-conditioned malls, the picture is far less rosy.\nIn the narrow alleys of small towns and city corners, cash still reigns, not by preference, but because countless small businesses have been quietly left behind in the digital payment race.\nTake, for instance, the neighbourhood cobbler who repairs shoes and sells laces. When I asked if he accepted bKash, he gave a shy smile and replied, \"Beti, I don't even have a smartphone.\" A woman who runs a home-based food business told me she abandoned digital payments after one customer falsely claimed to have \"sent the money\" and never paid.\nThese are not isolated incidents. They represent the lived reality of many small entrepreneurs, people who work long hours, serve their communities, and manage tight budgets, but who lack the tools, support, or digital literacy to join this new economy.\nWhile large businesses receive support to digitise, small vendors are expected to catch up on their own. Some don't trust the technology; others fear fraud or lack a stable internet connection. Many simply don't have the confidence to ask a young customer how to scan a code.\nA cashless economy may be the future, but it must be inclusive. This doesn't require another flashy app or marketing campaign. What's needed is basic training in local languages, trust-building initiatives, and practical support to make digital tools truly accessible and affordable.\nProgress is only meaningful when it lifts everyone. If small businesses, the very backbone of our local economies, are left behind, then what we call \"progress\" is merely another form of exclusion.\nBangladesh has a real chance to build an inclusive digital economy. But for that to happen, we must ensure that the men and women running roadside stalls, home kitchens and tiny shops are taken on board.\nAnika Rumman\nStudent, North South University \nanika.rumman.232@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Small businesses left behind in digital race",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/small-businesses-left-behind-in-digital-race-1754667079",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-08-2025"
    }
]