[
    {
        "full_article": "A day apart, two pilgrimages in North India have endured chaos. Eight people died on the steep stairway to Haridwar’s Mansa Devi shrine on July 27, 2025 after a rumour spread that a snapped power line was live. The next day, at Avsaaneshwar temple in Barabanki, monkeys reportedly damaged an overhead cable, sparking panic that killed two persons. Both incidents were triggered by fears of electrocution. Such hazards at temples are not new: makeshift wiring draped over stalls and overloaded transformers are common sights at melas. However, neither shrine had an automatic power cutoff or a public-address system capable of debunking misinformation. The Haridwar probe will almost certainly reiterate older recommendations such as underground cabling and real-time voltage monitoring. However, the threat is incidental. Except for two major stampedes in recent memory (in Bengaluru and Hyderabad), all such tragedies have occurred at religious mass gatherings or in the course of attending them. They occur despite multiple guidelines and court orders due to authorities’ collective desensitisation to risk. On paper, Uttarakhand has a crowd-management manual for the Char Dham and the NDMA’s guidelines say that every event must calculate carrying capacity, stagger entry, maintain redundant escape routes, and hold drills. Yet, at Mansa Devi, the stairway that doubles as entry and exit was used without scheduling, and the only alternative route had much lower carrying capacity.In Uttarakhand and Uttar Pradesh, the response centred on compensation rather than structural reform. The NDMA norms need to be legally binding, with severe consequences for persons, enterprises or businesses that fail to protect lives. At present, States choose provisions from the norms and temple trusts often treat them as optional because pilgrim facilities fall under charitable exemptions in many building codes. Routine ‘darshan’ does not require safety certification even when daily footfall exceeds that of a sports stadium. States also bank on ad hoc volunteers and under-trained guards to manage surges. However, annual drills mandated under the Disaster Management Act are rarely held for regular worship, while funds earmarked for permanent infrastructure are often diverted to festivals. The time has come to eradicate the notion of a simply planned or cheap mass gathering event, religious or otherwise. When footfall exceeds a preset threshold, a single incident-command structure must come into effect. Authorities must deploy overhead LiDAR and AI cameras to calculate crowd density, with real-time alerts to help divert or throttle traffic. Finally, States must ensure that venues publish capacity charts at entrances, conduct and livestream quarterly drills to normalise a safety culture, and certify volunteers in basic life support and crowd psychology. Published - July 29, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        religion and belief\n                    \n                            /                      \n                        \n                        accident (general)\n                    \n                            /                      \n                        \n                        Uttar Pradesh\n                    \n                            /                      \n                        \n                        Uttarakhand\n                    \n                            /                      \n                        \n                        bengaluru\n                    \n                            /                      \n                        \n                        Hyderabad\n                    \n                            /                      \n                        \n                        disaster management\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        Artificial Intelligence\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        safety of citizens\n                    \n                            /                      \n                        \n                        psychology",
        "headline_1": "Culture of risk: On safety and a mass gathering",
        "headline_2": "The notion of a routinely planned mass gathering should be done away with",
        "link": "https://www.thehindu.com/opinion/editorial/culture-of-risk-on-safety-and-a-mass-gathering/article69865528.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "29-07-2025"
    },
    {
        "full_article": "The visit of Prime Minister Narendra Modi to Tamil Nadu had a subtle political message. In his address at the valediction of the annual Aadi Thiruvathirai festival at Gangaikonda Cholapuram to mark the birth anniversary of Rajendra Chola I, he focused on the legacy of the Chola emperor and his father Rajaraja Chola I to underline that contemporary India would be as enterprising as ancient India under the imperial Cholas, in expanding trade, and in guarding India’s sovereignty. The festival was also organised to commemorate 1,000 years of the maritime expedition of Rajendra Chola to south-east Asia as well as the construction of the iconic temple, a World Heritage Site. The grandeur of the Chola dynasty is fascinating to recall, but there are other mundane facets of the Chola rule which are of modern relevance — its water management, tax and land revenue collection, and democratic processes.In creating infrastructure, especially, the Cholas hold many lessons. In recent months, there have been fatal accidents involving civic structures. The resilience of the Brihadisvara temples, which have stood tall for over 1,000 years, could provide learnings. Studies show that the southern peninsula was the epicentre of several earthquakes in the last 200-odd years. Archaeologists are of the view that the superstructure of the temples holds the key to modern building techniques when it comes to seismic resilience. A close study of the temples for structural stability can be of immense value in the contemporary context. Apart from focusing on the heritage and culture of the Cholas, India could try and replicate their success in administration. Management of water resources, especially, could be an important learning. The Cauvery delta, where Gangaikonda Cholapuram is located, may experience floods, with a large volume of water draining into the sea without being harnessed for periods of scarcity. More than 30 years have passed since the adoption of the 73rd and 74th Amendments to the Constitution, but a large number of local bodies, even in the major cities, are functioning without elected representatives. The celebration is an opportunity for an analysis of the functioning of grassroots-level democratic bodies. Mr. Modi announced that the Centre would install the statues of Rajaraja Chola and Rajendra Chola to remind the country of its historical consciousness. But this exercise would have greater purpose if it reminds the country of the administrative acumen of the Cholas, and nudges those in governance to address many of the chronic flaws and problems.\r Published - July 29, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        history and culture\n                    \n                            /                      \n                        \n                        government",
        "headline_1": "Lessons from the past: On the Chola legacy",
        "headline_2": "The Chola legacy includes good governance, not just grand temples",
        "link": "https://www.thehindu.com/opinion/editorial/lessons-from-the-past-on-the-chola-legacy/article69865560.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "29-07-2025"
    },
    {
        "full_article": "When Clive of India was recently spotted in Wales\nFamily holidays are invariably hard work for those with an archaeologist or historian in the family. There’s no basking in the sun with a book and a Margarita, no lie-in or breakfast in bed. The days follow a regular 9-5 routine. Endless aisles of Louvre are navigated, shoes are worn out at Smithsonian, and the mummies of British Museum are practically on first-name terms.\nThere’s always an exception to everything – something that breaks the pattern. A recent visit to Powis Castle in Wales to see the Clive Collection was one such outlier. Yes, Robert Clive – or Clive of India – who laid the foundation of the British East India Company’s reign of Bengal. When he left India, it was with a cool personal fortune of £31mn (today’s value), amassed at immeasurable human cost. That was just the cash and doesn’t include the priceless artefacts that visitors are privileged to see.\nAn impressive collection of Mughal-era artefacts is on display at Powis. It assembles items amassed by two generations of the Clive family: his son Edward served as the governor of Madras. It’s also a reminder of the stealth, guile and deceit of East India Company. But that is history and one shouldn’t quarrel with history.\nThe most stunning display is one of the finials detached from the throne of Tipu Sultan of Mysore – a dazzlingly well-made tiger-head in solid gold, studded with diamonds, rubies and emeralds. Other objects that stand out include the ornately carved palanquin of Siraj ud-Daulah, the last Nawab of Bengal, and the elegant chintz cotton tent that Tipu used during his battles. The multitude of exquisite pieces, both on display and in storage, outnumbers any collection in national museums across South Asia.\nEach object was examined with an intensity the visitors didn’t know they possessed. It was as if their own history lay bare among the ivory-hilted daggers and swords, curved gold-brocaded shoes, and elaborate paintings. The experience was like peering into a time gone by – an epoch otherwise encountered only in school textbooks and dry, one-dimensional history lessons. The affinity they felt towards the objects was difficult to make sense of – like trying to remember the details of a vivid but elusive dream. Nevertheless, standing among Clive’s loot that morning, they heard the echo of battle cries, the neigh of horses and the stomping of hooves. The Indian visitors left Powis with the spectre of Robert Clive trailing behind them.\n\n",
        "headline_1": "Their museum, my sighs",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/their-museum-my-sighs/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-07-2025"
    },
    {
        "full_article": "It’s a public good that’s made India a digital economy. Charging a fee on transactions might scupper it \nThanks to UPI, India leads the world in instant digital payments. Last month, there were 1,840cr UPI transactions worth ₹24L cr. Behind this success lies a tweak that GOI made in Dec 2019. It removed all transaction fees – what banks call merchant discount rate or MDR – on UPI. Until then, banks had charged 0.25% for transactions up to ₹2,000, and 0.65% above. So, when you bought, say, milk worth ₹100 via UPI, your grocer lost ₹0.25. It doesn’t seem like much, but on a low-margin product like milk – 2.5% dealer margin – it’s a 10% hit to earnings. That’s why UPI wasn’t popular for daily needs back then. But with MDR gone, everyone loves UPI. Transaction volumes have jumped 14-fold in five years. \nSo, RBI governor’s recent remark regarding UPI: “Some costs have to be paid…whether collectively or by the user,” needs careful analysis. This isn’t the first time the idea of reinstating UPI fees has been floated, but coming from the guv, it merits discussion, even though the finance ministry last month ruled out restoring MDR. It was responding to media reports on restoration of MDR. North Block termed them “baseless and sensation-creating speculations (that) cause needless uncertainty, fear and suspicion among our citizens.”\nBanks say they lose money on every UPI transaction because they get no return on the IT infra they maintain to process hundreds of millions of real-time payments every day. But the fact is, govt has been compensating banks for running UPI as a ‘public good’ these past five years. It paid a subsidy of 0.15% – 15 paise on ₹100 – on UPI transactions worth ₹2,000 or less last fiscal. Besides, if UPI is such a losing proposition, why has the number of participating banks jumped from 143 at the time of MDR’s removal to 675 now? It’s because banks use UPI to acquire customers for other lucrative products like loans and insurance. \nAlso, IT costs that banks complain about don’t arise from UPI alone – the infra is shared across their services. Still, if RBI and GOI tomorrow agree that UPI hurts the bottom line of banks, they should consider increasing the subsidy to banks, because reinstating MDR would reduce the acceptability of UPI, and increase cash in circulation, which was already at a record high of ₹37L cr in March, and cost the govt ₹6,373cr in printing costs last fiscal. \n\n",
        "headline_1": "Keep UPI free",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/keep-upi-free/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-07-2025"
    },
    {
        "full_article": "England’s cricket captain forgot the rules, was churlish, but some Indian fans read too much into it\nIn The Godfather, Don Corleone famously talks about an offer the other side cannot refuse. In the fading lights of Manchester, Ben Stokes made a cricket’s version of that offer. The England skipper wanted to ‘declare’ India’s innings. But the cessation of a Test cannot depend on the needs and desires of one captain. It must follow the Laws of Cricket, or, to be specific, ICC’s match playing conditions, where Clause 12.7.6 clearly states: “On the final day, if both captains (the batsmen at the wicket may act for their captain) accept that there is no prospect of either side achieving a victory, they may agree to finish the match after.” Simply put, calling off a game must be mutual. The consequent acts of petulance by Stokes and his teammates were downright unsportsmanlike. The match referee should look into it.\nSuch innocence about the game’s laws has happened before. In Bangalore, 1983, Pakistan captain Zaheer Abbas and his side left the field, leaving Gavaskar stranded on 86. Umpires had to bring them back. Gavaskar scored his 28th century. In those pre-internet days, the incident didn’t degenerate into an online scrap. Sunday night, some Indian fans saw evidence of colonial ‘hangovers’ in Stokes. Wrong. Stokes is a New Zealander by birth, and England’s ‘bazball’ progenitor coach Brendon McCullum is a bona fide Kiwi. This was just an outburst born out of utter frustration of having drawn a game that was once firmly in England’s grasp. The needless spat sadly took the focus away from a steely display by captain Shubman Gill’s young India. That needs to be roundly applauded. With the series 2-1 in England’s favour, Oval should see a cracker of a fifth Test. \n\n",
        "headline_1": "Stoking the game",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/stoking-the-game/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-07-2025"
    },
    {
        "full_article": "India is the world’s youngest democracy — and yet, its politics remains stubbornly gerontocratic. This wasn’t always the case. The first Lok Sabha had nearly 26% of its members under 30, almost half were below 45. Since then, however, we’ve witnessed a steady decline in youth representation.\nPolitical parties often don’t contest elections directly at the local level and barriers to entry are lower — this opens the door for younger candidates. Entry barriers at state and national levels rise dramatically where older established loyalists are preferred over younger candidates.\nRead full story on TOI+\n\n",
        "headline_1": "Our unrepresentative people’s representatives",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/our-unrepresentative-peoples-representatives/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 29, 2025 00:00:00  \nAny major industry develops concurrently allowing the opportunity of growth of allied or backward linkage industries. The readymade garment (RMG) industry has also been behind the emergence of such source industries. Textile mills in this country had seen many ups and downs and before RMG took off, their fortunes plummeted. In fact, local textile mills made a turnaround when they started supplying raw materials like knit fabric and woven fabric to the country's burgeoning RMG industry. Now, the happy days seem to be over with local textiles mills failing to meet the RMG demand due to a number of critical factors. Production disruption is certainly the number one issue. But the mills are not doing it deliberately; it is the direct consequence of crisis of natural gas. They are helplessly looking at the declining orders for their materials and growing import from other countries.\nIn such an uncertain and to some extent uneconomic environment, import of knit fabric has surged by 32.18 per cent to 0.51 million tonnes in the last fiscal year. Similarly, import of woven fabric also rose by 16.12 per cent to 0.62 million tonnes in the previous fiscal of 2023-24. Yarn import also saw a rise by 13.35 per cent. It is also interesting that the country also imported 8.35 million bales of cotton last fiscal compared with 7.75 million bales in the fiscal 2023-24. This is an indication that the mills had their preparation to go about the business as usual but circumstances beyond their control have suddenly disrupted the situation. The local textile mills have also been facing another adversity in the form of a slash in cash incentives. According to the president of the Bangladesh Knitwear Manufacturers and Exporters Association (BKMEA), cash-incentive support is virtually non-existent and exporters feel discouraged to claim the facility involving a lengthy process, not to mention the 'harassment'. \nBusiness does not tolerate administrative impudence in this regime of global trade. There are alternative sources available. That exactly has happened and the buyers, moreover, have insisted on import of fabrics from China because of reliability in timely supply. In this context, India's aggressive 'dumping rate' on its fabrics can be an example of how a government promotes the business of that country. It is quite clear that at a crunch time, some desperate measures were needed to promote businesses. Here the government is taking the reverse course. \nNow both China and India are set to take away orders for fabrics ---both woven and knit---from Bangladesh textile mills. Here the foreign buyers' opinions are also proving decisive. Clearly, the prospect for the local textile mills does not look particularly bright. At a time Trump's reciprocal tariff has thrown the world's business in turmoil, there was a need to be on guard against any lapses at the domestic level. Now the textile mills may have to pay a heavier price than they would need if only a steady fuel supply could be ensured. It is the time when the challenge before industries is to survive no matter if the profit is low. If business suffers to the point where garment factories move to foreign countries for their source materials, it also bodes ill for the country's main export good.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Problems facing textile mills",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/problems-facing-textile-mills-1753713894",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       July 29, 2025 00:00:00  \nAs Bangladesh braces for the third round of negotiations with the United States, starting from today (Tuesday), the stakes have never been higher. The escalating tariff crisis, triggered by the Trump administration's decision to impose a nearly 50 per cent reciprocal tariff on Bangladeshi exports -- primarily ready-made garments and leather goods -- has rattled the foundations of the country's trade-based economy. For Bangladesh, this is not merely a trade dispute but a litmus test of its diplomatic acumen, trade resilience, and long-term economic strategy.\nThe first two rounds of talks failed to produce tangible outcomes, leaving exporters, businesses, and policy circles disillusioned and frustrated. Many economists and business leaders have begun to publicly criticise the government's negotiation strategy, calling it inadequate in the face of mounting economic pressure. Against this tense backdrop, the latest round of negotiations offers a glimmer of hope. But expectations are now tempered by urgency.\nIf the U.S. proceeds with enforcing a 50 per cent tariff on Bangladeshi goods starting August 1 -- as declared in a formal letter from President Donald Trump to Chief Adviser Dr. Muhammad Yunus -- the consequences could be economically catastrophic. The ready-made garment (RMG) and leather sectors, which collectively constitute the lion's share of Bangladesh's export earnings and employ millions, will be hit the hardest. A sharp rise in prices would diminish their competitiveness in the U.S. market, which is currently one of Bangladesh's largest export destinations.\nMoreover, such a tariff spike would inevitably cause order cancellations, job losses, factory shutdowns, and potential labor unrest. In an export-driven economy where garments alone account for over 80 per cent of total export revenue, even a marginal disruption sends shockwaves across the macroeconomic spectrum. A 50 per cent tariff is not just a trade policy -- it is a threat to social stability.\nGiven this context, the ongoing negotiations is not simply another round of routine diplomatic engagement. It represents a high-stakes attempt to avert a crisis that could derail years of economic progress. If the U.S. agrees to scale back the proposed tariff to 18-20 per cent -- a figure that is being circulated as a possible compromise -- it would be seen as a major diplomatic victory for Bangladesh.\nMore importantly, such a reduction would provide breathing space for exporters and restore investor confidence. In a volatile global market, predictability and policy stability matter as much as price. A successful negotiation outcome would reaffirm Bangladesh's relevance and reliability in international trade partnerships.\nWhile blame games are counterproductive, it is important to assess why the first two rounds failed to yield results. One factor is timing. The U.S. side, citing national emergency clauses, adopted a unilateral tone from the outset. Their decision was framed as a part of a broader recalibration of trade ties with countries perceived to be benefitting disproportionately. This created an uneven playing field for Bangladesh.\nAnother challenge has been the lack of clarity and strategic communication on Bangladesh's part. Critics argue that the government failed to present a cohesive, data-driven, and forward-looking case in the initial stages. Moreover, the absence of a robust lobbying effort in Washington -- unlike other trade-dependent nations -- meant that Bangladesh's narrative was underrepresented in U.S. policy circles.\nTo its credit, the interim government has not remained passive. Recognising the threat posed by the tariffs, Bangladesh has launched a flurry of diplomatic and commercial initiatives aimed at addressing American concerns and reducing the bilateral trade deficit.\nOne of the key measures has been a proactive shift in import policy. Bangladesh has initiated plans to purchase wheat, soybean, and cotton from the U.S., along with a major procurement plan involving 25 aircraft from Boeing. These steps are expected to narrow the trade imbalance while also creating goodwill in Washington's political economy.\nAdditionally, 600 acres of land have been allocated in the Mirsarai Economic Zone for the storage and maintenance of imported cotton -- signalling the seriousness of Bangladesh's commitment to long-term trade reciprocity.\nThese strategic decisions mark a clear pivot towards rebalancing the relationship and demonstrate that Bangladesh is willing to play by global rules -- provided the playing field is plain and fair.\nHowever, trade balances are not the only issue on the table. One of the major stumbling blocks in the negotiations has been the United States' insistence on stronger protection of Intellectual Property Rights (IPR). The U.S. has accused Bangladesh of failing to curb the circulation of counterfeit goods across a range of sectors, including garments, pharmaceuticals, consumer electronics, and software.\nAlthough Bangladesh is already a signatory to global frameworks such as the TRIPS Agreement, the Paris Convention, and the WIPO arrangements, the U.S. maintains that enforcement remains weak and inconsistent. To address these concerns, Washington has demanded that Bangladesh sign 13 additional international treaties and conventions, along with enforcing 11 new policy commitments -- ranging from legal protection for U.S. goods to stricter anti-counterfeiting regulations.\nThis presents a complex challenge. On one hand, it is crucial for Bangladesh to align with global standards and protect IPR to attract high-value foreign investment. On the other hand, the legal and administrative overhaul required to meet U.S. demands is neither simple nor immediate. IPR reform involves changes in domestic legislation, regulatory infrastructure, and inter-ministerial coordination -- all of which take time and political consensus.\nGiven this multilayered backdrop, what can Bangladesh realistically expect from the third round of negotiations?\nFirst, it is unlikely that the U.S. will revoke the tariff decision entirely before August 1. However, there is a plausible path toward a phased reduction or temporary relief -- especially if Bangladesh can present a credible roadmap to address IPR concerns and continue rebalancing bilateral trade.\nSecond, the government must adopt a more comprehensive negotiation strategy. This includes assembling a high-powered delegation of trade, legal, and diplomatic experts who can respond convincingly to technical queries. Emotional appeals or vague promises will no longer suffice.\nThird, a concrete and transparent action plan must be shared with U.S. negotiators -- one that outlines a timeline for treaty ratification, legal reforms, and anti-counterfeiting enforcement. Even partial commitments, if sincere and time-bound, can help restore trust.\nFinally, Bangladesh must improve its communication efforts -- not just with U.S. policymakers, but also with the global business community. A coordinated outreach campaign showcasing the country's reform agenda, investment opportunities, and commitment to fair trade could shift perceptions and attract allies.\nThe latest round of negotiations will be a defining moment in the evolution of Bangladesh-U.S. trade relations. A successful outcome could stabilise export earnings, protect millions of jobs, and reposition Bangladesh as a responsible player in global trade. Failure, on the other hand, could lead to serious economic disruptions and dent the credibility of the country's diplomatic machinery.\nWhile the road ahead is undoubtedly steep, it is not insurmountable. Bangladesh must stay focused, engage constructively, and act decisively. The world is watching -- not just for how the tariff dispute is resolved, but for how Bangladesh navigates this complex intersection of trade, diplomacy, and economic policy.\nThis is more than a negotiation. It is a defining test of national capacity, and one that Bangladesh must pass -- not just for the present, but for the promise of its economic future.\nmirmostafiz@yahoo.con\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Tariff talks: Positive outcome  a must for Bangladesh",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/tariff-talks-positive-outcome-a-must-for-bangladesh-1753713996",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       July 29, 2025 00:00:00  \nA Bangladesh trade mission, as reported, is scheduled to meet for the third time with the Office of the United States Trade Representative (USTR) in Washington, D.C., on July 29 and July 30 to see if the 35 per cent reciprocal tariff that the Trump administration has imposed on Bangladesh's exports to the US market could be lowered. There is the possibility of holding yet another round of meeting with the USTR on July 31.The US reciprocal tariff rate is set to take effect on August1. So, it is going to be a hectic last minute effort on the part of the Bangladesh trade delegation led by Commerce Adviser along with the National Security Adviser and comprising the commerce secretary and additional commerce secretary as its members. Notably, Bangladesh trade team has, meanwhile, finished two rounds of talks with the USTR following US president Donald Trump's July 8 letter to Bangladesh's Chief Adviser Dr Muhammad Yunus about the imposition of reciprocal tariff at the rate of 37 per cent on Bangladeshi exports to America. With no further reassurance from the USTR during those two rounds of trade talks, except for an exemption of just 2 per cent from original reciprocal tariff so imposed, Bangladesh is trying its luck for the third time. Best of luck! But when added to the currently existing duty at 15per cent on the entry of Bangladesh-origin products, especially Readymade Garment (RMG), into the US market, the total tariff will come to 50 per cent after August 1.\n\nIn response, Bangladesh sent its position paper on July 22 and proposed starting next and final rounds of tariff talks on July 26. However, USTR fixed July 29 as the next date for the resumption of talks. It is further reported that the government is going to purchase 25 more Boeing aircraft to add to Biman's existing fleet. But the Boeing purchase is purely a company level deal between Boeing and Biman, and not part of the intergovernmental tariff negotiations, the commerce secretary is learnt to have explained at a Press briefing. But why then Bangladesh will go for this very costly purchase of so many Boeing-made US passenger planes, since the list price of each of these different models of aircraft range from USD 217.9 million to USD 375.5 million. And that too is taking place at a time when Bangladesh's forex reserves, though now on a better footing than before, have yet to reach a comfortable level to afford such a big purchase deal. Hopefully, during actual purchase or leasing, the list prices may come down substantially due to the commissions offered by the selling company depending on market conditions, bulk purchase and so on. That the purchases will take years to materialise is also a consideration to note. Even so, it is still a challenging move that the government is making just to mollify a difficult trading partner despite what has been said to clarify the intent of the plane purchase deal. True, there was already a purchase order for 14 Boeing planes during the past government and that the present numerical strength of Biman fleet needs improvement.\n But what matters here is if there is real urgency of such purchase deals. What will, for instance, the corruption-ridden public limited company, Biman, do with those additional planes when its main problems are poor management and outdated operational procedures? Is it then surprising that Biman is lagging behind its regional competitors in terms of service quality as well as business performance? It is to be noted that Bangladesh has already offered zero per cent duty facilities on imports of US-origin products including wheat, LNG, etc. That India, Vietnam and Indonesia are buying large numbers of Boeing aircraft from America and getting considerable tariff exemptions from the USTR does not necessarily mean that Bangladesh would win similar favour from the US just by plane purchase when geopolitics is also a factor. It is purely experience, efficiency and keen business acumen that matter in clinching a good business deal, not just goodwill.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "What's in store for US-BD final round of tariff talks?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/whats-in-store-for-us-bd-final-round-of-tariff-talks-1753714132",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 29, 2025 00:00:00  \n\nThe nation is reeling from the devastating crash of a training aircraft into Milestone School and College on Monday afternoon, July 21, 2025. The death toll continues to rise, with official figures now standing at 33 lives lost and nearly 200 injured-most of them schoolchildren. Many of the wounded remain in critical condition across hospitals in Dhaka, with severe burns and trauma.\nThe horror of this incident is beyond words. The aircraft struck the building while classes were in session and children were playing on the school grounds. The fire engulfed parts of the campus within seconds, leaving teachers, staff, and students with no time to escape. Several teachers also died while heroically trying to rescue the students.\nThis tragedy has shaken the entire nation. The grief is deep, and the fear it has instilled in the hearts of parents is immeasurable. We cannot allow such a catastrophe to repeat. It is imperative that the government urgently reviews and implements stricter safety protocols for training flights, particularly around populated and sensitive zones like school campuses.\nLet this be a wake-up call for the authorities to ensure that aviation training does not come at the cost of innocent lives. Our children deserve to study in safety, not under the shadow of avoidable danger.\nMd. Muradul Haque Sardar \nManager- Purchase (Local & Foreign) \nAmanat Shah Group \npurchase.hassml@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The Milestone tragedy",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-milestone-tragedy-1753714149",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-07-2025"
    }
]