[
    {
        "full_article": "At 4%, India’s fiscal 2025 average of Index of Industrial Production (IIP) is at its lowest in the past four years, marking a slowdown in industrial activity. This could be attributed to uncertainties in the global economic outlook leading to tepid goods exports growth, lower than expected consumption demand growth, and a dip in private capital expenditure. While the monthly barometer of the nation’s industrial output, the IIP, grew in March to 3% from February’s 2.7%, this has been mainly on account of a rise in power production, which cyclically peaks in summer. Power output growth almost doubled between February (3.6%) and March (6.3%). But the fall in the IIP, from 5.9% (2023-24) to 4% (2024-25), warrants a closer look at the sectors that have lagged. While mining steeply declined from 7.5% (FY24) to 2.9% (FY25), manufacturing followed with 5.5% (FY24) and 4% (FY25) and electricity at 7% (FY24) and 5.1% (FY25). What is more significant is the degrowth of -1.6% in fiscal 25 witnessed in consumer non-durables from 4.1% in the previous year. Contrasting this with the growth almost doubling in consumer durables from 3.6% (FY24) to 8% (FY25) likely indicates an uptick in urban private consumption, while lingering effects of high food inflation in the October to December quarter of the last fiscal continue to strain rural consumption. Sure, retail inflation was at its lowest in six years at 4.6% in FY25, aided by steep falls in vegetable prices in the last quarter, but this also heavily impacted farm incomes, further straining rural consumption. While a decrease in the RBI’s bank lending rate to 6% in April from 6.5% in January has led to lower capex lending rates across banks, an uncertain economic and trade environment is unlikely to encourage the private sector to raise investment, without substantial domestic consumption impetus from the government.The flat growth in goods exports in FY25 is another area that must concern policymakers as it indicates considerable strain on India’s sprawling small businesses, the MSME sector, that contributes about 45.8% in exports. This sector has witnessed remarkable growth over the past five years, quadrupling in size from about ₹4 lakh crore in FY21 to ₹12 lakh crore in FY25. However, given strained trade relations with the country’s largest trading partner, the United States, India must ensure that the Bilateral Trade Agreement that is under negotiation fortifies India’s nearly 60 million MSMEs, the vast majority of which are classified as micro industries. Consequently, this will protect the over 250 million jobs that the sector provides. Published - April 30, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        industrial production\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        mining\n                    \n                            /                      \n                        \n                        manufacturing and engineering\n                    \n                            /                      \n                        \n                        inflation and deflation\n                    \n                            /                      \n                        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        business (general)\n                    \n                            /                      \n                        \n                        USA",
        "headline_1": "​Growth pangs: On industrial activity",
        "headline_2": "India’s industrial sector requires policy intervention amid global turbulence",
        "link": "https://www.thehindu.com/opinion/editorial/growth-pangs-on-industrial-activity/article69505913.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "30-04-2025"
    },
    {
        "full_article": "When Justin Trudeau resigned as the Prime Minister of Canada in January, it seemed that his party, the Liberals, who were trailing the Conservatives by 25 points in opinion polls, was headed for an electoral debacle. Mr. Trudeau, in power for nearly a decade, had become highly unpopular amid economic woes. Pierre Poilievre, the Conservative leader, built his campaign on a call for change, branding the three consecutive terms of the Liberal party as “the lost decade” for Canada. Yet, in a stunning political turnaround, the Liberal Party beat the Conservatives in the April 28 national election. Two pivotal developments between Mr. Trudeau’s exit and the elections reshaped the country’s political landscape. First, Mark Carney, an economist and former banker, was chosen as Mr. Trudeau’s successor. Mr. Carney distanced himself from Mr. Trudeau’s legacy and reframed the election as an opportunity to rebuild Canada’s economy. Second, Donald Trump’s rhetoric about making Canada “the 51st State” of the U.S. galvanised Canadian nationalism and offered a new purpose and perspective to Mr. Carney’s electoral battle. He presented himself as the best candidate equipped to stand up to Mr. Trump’s threats and tariffs. His record as a successful central banker who led Canada through the 2008-09 recession and the U.K. through the chaotic Brexit years also helped his cause.The results were not entirely disappointing for the Conservatives. According to the preliminary figures, the party won 41.4% of the vote, surpassing its 2011 majority with 39.6% votes. But what happened this time was a more unified consolidation of progressive and liberal votes favouring the Liberals. When Mr. Poilievre talked about a crackdown on fentanyl, opposed tax hikes and threatened to withhold federal funding for universities, non-conservative voters saw these as Trump-style rhetoric, and gravitated towards the Liberal Party. The New Democratic Party, led by Jagmeet Singh, saw its vote share plummet from 18% in 2021 to just 6%, while the Liberals surged from 32.6% to 43.5%. While Mr. Carney deserves credit for the turnaround, he should prepare the country for the path ahead. Despite the Liberals’ surging popularity, they are still projected to fall short of the 172-seat majority mark in the 343-member Parliament. A coalition government dependent on smaller parties could complicate his legislative ambitions. Moreover, Mr. Carney and Mr. Trump agree that the traditional relationship between Canada and the U.S. is over, which means the leaders will have to launch talks for a new economic and security framework. Mr. Carney must also take swift measures to offset the impact of the Trump tariffs and revitalise economic growth, all the while standing firm against American pressure and for Canada’s sovereignty. Published - April 30, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Canada\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        Brexit\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        parliament",
        "headline_1": "Liberal rally: On the Canadian election result",
        "headline_2": "Trump influenced Canada election, but not in the way he imagined",
        "link": "https://www.thehindu.com/opinion/editorial/liberal-rally-on-the-canadian-election-result/article69505349.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "30-04-2025"
    },
    {
        "full_article": "There’s no need to stamp out public debates over what New Delhi should do post-Pahalgam. Politics will inform some debates. That’s natural. Debates, in fact, can be useful as the government considers options\nThe Pahalgam massacre of tourists has unified India in many ways. There is widespread condemnation of terrorists, who were clearly backed by state and/or non-state actors in Pakistan.\n\nAnger among Indians is palpable, and PM gave vent to it when he said the perpetrators and their handlers will face “unimaginable” retribution.\nRead the full story on TOI+.\n\n",
        "headline_1": "Jaw-jaw & war-war",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/jaw-jaw-war-war/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-04-2025"
    },
    {
        "full_article": "English football champions again, the club nearly defines the host city, which takes pride in its working-class ethos. The club “never walks alone” in a city that birthed the Beatles\nTake a stroll from Cavern district to Liverpool docks, the cold breeze blowing from the Mersey River directs your attention to Pier Head and the four ebony statues of the city’s favourite sons. John, Paul, George & Ringo, hands in pockets, appear to be casually discussing their newest tune.\n\nTime travel to the early 60s. Three miles away, at the Anfield of the black-and-white era, heads bobbed to the lilting rhythm of ‘Love Me Do’.\nRead the full story on TOI+.\n\n",
        "headline_1": "Why Liverpool is a great story of football romance",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/why-liverpool-is-a-great-story-of-football-romance/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-04-2025"
    },
    {
        "full_article": "By Dhruva Bhargava\nThe word ‘reconciliation’ comes from the Latin word ‘reconciliare’, which means ‘to make good again’ or ‘to restore’. For amiable living, the restoration and continuation of harmony are essential. However, life is full of ups and downs, certainty and uncertainty. What’s important is how we bounce back, reconcile and continue.\nWe are surrounded by people, situations, and environments that are ever-changing and often independent of our expectations and desires. We feel trapped in such situations against our will. As a result, we either live forcefully or quit unwillingly.\nLiving with or quitting without paying an emotional price is acceptable. However, being immersed in grudges and complaints daily is a forceful living akin to torture. Quitting unwillingly is relinquishing, but with regret.\nIn living forcefully or quitting with regrets, we pay an emotional price. We undergo a sustained feeling of dissociation and despair that silently prevails within and adversely influences our emotional well-being. Overtly, things appear fine, but internally, we endure pain. This is suffering and the root cause of many ailments.\n\nIn other species, needs of hunger, safety, procreation, and shelter are the basis of reconciliation. They struggle hard to come to terms with their surroundings and live in acceptance without grudges and complaints. However, human needs are hierarchical and complex.\nHigher needs are a source of motivation and restlessness. Human beings can imagine, anticipate the future, proactively think and forecast growth. This potential instils a sense of doership and is the source of the secondary or acquired self, the ego.\nDuring childhood, in response to society and family, we develop mechanisms to cope. These mechanisms become our conditioned and deep-rooted behaviour, which constitutes yet another source of the secondary self, with which we identify, feel comfortable, and find it easy to respond to external challenges.\nHowever, we do not always get a favourable outcome. We repeatedly face the choice between forcing ourselves to live with or giving up.\nLiving with or quitting is not problematic, but being unable to free ourselves from the sustained feeling of despair is. Reconciliation, therefore, must happen at two levels, firstly that of ego, secondary self, with Self and subsequently with Others. On the contrary, we attempt to come to terms with others before coming to terms with the Self.\nHence, we desperately engage in changing people and situations around us.\nSelf, with which we came into the world, was free, untainted and pure. But we erroneously took the secondary self for real. The secondary self, with which we deeply identify, is also the cause of suffering.\nReconciliation is not about living forcefully or escaping, but instead being in the situation, in full command, yet being flexible and accepting without resentment or blame towards oneself or others. Things may not turn up as we expect, yet we remain confident, hopeful and responsible.\nWhat is essential is not to suffer the sustained feeling of despair or regret. For this, a healthy ego, based on awareness, is necessary. As we reconcile with our inner Self, we gain awareness, attain peace, balance, and equanimity, and our responses to external situations and vagaries of life undergo a quantum change.\n\n",
        "headline_1": "Mastering the art of reconciliation",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/mastering-the-art-of-reconciliation/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-04-2025"
    },
    {
        "full_article": "On my daughters arranging my future \nOf late the kids have been musing over my departure. Not to a mall or airport but the grand goodbye. I have been an old woman to them from the time they met me. One daughter accompanies me with all the gravitas of a caretaker, giving me a careful onceover before leaving the house: take keys, sunglasses, has mom worn clothes. While privately I believe in my own immortality, they expect me to keel over any minute. Difficult to catch hold of me, they say, as I’m always at a funeral.\nI chose cremation over burial when they asked as if I had given it some thought, but there’s some confusion over my ashes now. My suggestion that these be divided between the two daughters was met with an awkward silence. I broke into childhood memories of a pond in Ollur I used to frolic in, and suggested immersing the ashes there. Too far, ma, was the clipped answer. Okay, I snapped, any lake in Bangalore will do. ‘We could get arrested for littering,’ say they. As they are still grappling with this, I am under strict orders not to perish till it’s sorted. They are also working on a guest list. If I grumble about a friend, they quickly scratch out the name. Henceforth talking highly of everyone I know.\nThe one thing I can do effortlessly and with some amount of speed is ageing. I am now only concerned about spines while reading romances. Find a good mattress, I tell the protagonists. Love happens all the time, but we have only one vertebral column. And while I find older people too free with their health details, I’m fascinated by my own knee pain and limp till someone asks. Some things I’m super sharp about, but some things…what was I saying?\nNobody wishes for a long lingering farewell. Unlike film heroes shot in the head but still able to give a coherent and complete speech, I want to go as an incomplete mystery, where my last words could hint at a homicidal past or at least a large embezzlement. ‘I’m Elena Ferrante’ was a favourite, but she may keep writing novels after I go. ‘You look the type who will have a lot of dramatic things to say on your deathbed,’ says daughter. ‘When you see the light, just walk into it. Don’t start describing it.’\n\n",
        "headline_1": "Guiding light",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/guiding-light/",
        "news_paper_name": "The Times of India",
        "publish_date": "30-04-2025"
    },
    {
        "full_article": "We are concerned about the trend of filing dubious cases against individuals with alleged ties to Awami League, which persists even nearly nine months after the August 5 political changeover. Journalists have been frequent targets of this legal assault. According to a report, at least 137 journalists have been implicated in 32 criminal cases filed in Dhaka, Chattogram, Bogura, and Rajshahi over the July-August events—the latest of them registered at the Mirpur police station on April 20, accusing Sheikh Hasina and 407 others, including 24 journalists, of involvement in the killing of BNP activist Mahfuz Alam Shraban. In addition to murder and attempted murder, journalists have also been charged with unlawful assembly, rioting, abduction, vandalism, extortion, assault, and even genocide and crimes against humanity.\nAs a Supreme Court lawyer has noted, even in places where no student movement took place or no one died, journalists have been falsely implicated. Referring to the case of a journalist couple who were sued for murder, he noted that while journalists may have committed other offences for which they could be booked, a murder charge \"sounds vague.\" The argument that those who aided, committed or enabled July atrocities and those who extended moral support to the regime—through talk shows or speeches, for example—belong in the same bracket is not only legally tenuous; it also opens the door to abuse, complicates and likely lengthens the trial process, and invites question marks over the outcome of ongoing trials. The implication of actor Iresh Zaker in the Shraban murder case, alongside journalists, doctors, businesspeople, and lawyers, further illustrates that anyone is fair game in such a climate.\nThe Shraban case exemplifies how the right to file cases is being abused. Three individuals named as witnesses in the case have said they were unaware of being listed. The case statement lists eight in total, including the plaintiff, and provides the phone numbers of four. This newspaper spoke to all four; three of them denied any prior knowledge of their inclusion. The manner in which the whole case came into being—about nine months after the uprising, at the behest of \"an administrative office in Paltan,\" using false witnesses, and implicating hundreds merely for their \"support\" of Hasina—reeks of both personal/political vendetta and a broader campaign against those even loosely associated with the previous regime. Unfortunately, the current process for filing cases does not require police officers to verify claims at the outset, allowing anyone to lodge complaints. This is why the government's instruction to police not to harass or arrest anyone wrongly implicated offers little hope or protection in practice.\nFor journalists, this trend marks a new chapter in a country where they already routinely face threats, harassment, and intimidation. But it must be countered for the sake of everyone given how widespread it has been. It is crucial to address the underlying loopholes in the case-filing process—by strengthening initial verification mechanisms and disallowing mass, exploitative accusations—and to ensure accountability for any misuse of legal provisions. The government alone cannot address this problem. Political parties, too, must come forward to stop this alarming trend.\n",
        "headline_1": "Stop legal harassment through dubious cases  ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/stop-legal-harassment-through-dubious-cases-3883646",
        "news_paper_name": "The Daily Star",
        "publish_date": "30-04-2025"
    },
    {
        "full_article": "April 29, 2025, marks the 34th anniversary of the devastating super cyclone that struck the southeastern coast of Bangladesh in 1991. Also known as Gorky, it is recognised as one of the deadliest tropical cyclones in recorded history.\nThe storm originated in the Bay of Bengal, intensified, and made landfall near Chattogram with winds reaching up to 240 kmph. It caused a catastrophic storm surge of more than 20 feet high, inundating coastal areas and killing over 138,000 people.\nThe majority of the fatalities occurred in the southeastern coastal belt such as Banshkhali, Anowara, Chakaria, Pekua, and Moheskhali. In addition to the immense human toll, the cyclone left over 10 million people homeless. Overall property and infrastructure damage was in the billions of dollars.\nEven after 34 years, coastal communities in southern Chattogram and Cox's Bazar continue to bear the haunting memories of the cyclone. It became a part of their history and collective memory. People still recall the horrifying experiences of that fateful night, especially when cyclone alerts are raised during the April-May period.\nI was born and grew up in a climate-vulnerable coastal village in Banshkhali, one of the hardest-hit upazila. My mother is still haunted by the horrors of that awful night. She shares with us how the cyclone struck with a storm surge as high as a two-storied building, sweeping away everything in its path. She had never witnessed such an obliteration before. People in the village did not expect the cyclone to hit with such power, rising above the embankment and inundating the villages.\nThere was no internet and no mobile phones at that time. Radio was the main means of getting updates. People heard the cyclone warning and became alert, but they were not prepared for a dangerous storm surge that swept away their homes, trees and everything else that night.\nThe cyclone made landfall during high tide which made the situation worse. My mother was in our home with other family members. She remembers, in a matter of 10 minutes, she lost track of all family members as the sea water engulfed them and washed away everything. It was a scary night with intense storms and salty rain. People were trying to survive holding floating items such as roofs of bamboo-huts and big trees. My mother managed to hold onto a tree and took shelter on it for the whole night. As she clung to the tree, she saw people and livestock floating by.\n\n\nWhen the water started receding in the early morning, she climbed down from the tree. Hungry and devastated, and with nothing but the clothes on her back, she cried and began searching for her family members like everyone else. Everything was flattened and there was water everywhere. She saw countless dead bodies lying face down. No road to follow, no house to go to—the night had changed everything. Some families in our villages were completely wiped out by the cyclone. People were buried in mass graves.\nEven after all these years, whenever a cyclone alert is raised, my mother insists that I seek shelter in an elevated place. Despite the passage of time, the scars left by the cyclone are still fresh in the minds of the coastal people who survived. Over the years, the disaster risks in the coastal communities have increased due to global warming, sea level rise and denser human inhabitance along the coastlines. Little has been done to reduce the disaster risks and improve resilience, especially along the Banshkhali coastlines.\nBangladesh has 580 km long dynamic and diverse coastlines. Our coastal areas have always been highly populated due to their abundant natural resources. However, in this age of climate change, these regions by the Bay of Bengal remain highly susceptible to numerous natural hazards, including tropical cyclones accompanied by storm surges.\nRecent reports indicate that the water in the Bay of Bengal is rising faster than the global average and it is known as a hotbed for tropical cyclones. According to research published by Jeff Masters, a hurricane scientist at Yale Climate Connections, 22 of the 30 deadliest tropical cyclones worldwide have occurred in the Bay of Bengal. A new study published on April 11 by researchers at the Massachusetts Institute of Technology (MIT), highlighted that the catastrophic cyclone, which was once a 100-year event in the Bay of Bengal, could now strike every 10 years—or even more often frequently. In the WorldRiskReport, published jointly by the Institute for International Law of Peace and Armed Conflict (IFHV) of the Ruhr-University Bochum and an alliance of nine German development organisations, Bündnis Entwicklung Hilft, Bangladesh is listed as a \"very high risk\" country, with a score of 27.73 out of 100. This places us among the top 10 most affected countries globally by extreme weather events. \nEvery year thousands of people are being displaced, losing livelihoods in the coastal areas due to various climate effects. In Banshkhali coastlines, since 2005, we have seen dramatic changes including powerful tidal flooding, breaching of embankments, uprooting of trees, erosion of coastal land, displacement of people, high salinity in the rice fields and so on. Many elderly people say they have not witnessed such turbulence in the bay's waters in the last 100 years. Furthermore, mangroves along the coastline have been erased for shrimp projects and salt-producing fields leaving people without adequate natural protection.\nBanshkhali being an outlying upazila has often been overlooked and remained out of focus, particularly its western coastal villages. There are places with broken and poor embankments. Monsoon is approaching bringing with it worry and anxiety. In my village, there is just one cyclone shelter which was built in 1994 with funding from Saudi Arabia. Since then, the population of the village has doubled and vulnerability to cyclones has increased but cyclone shelter number has not increased, remaining insufficient. This is the case in most of the coastal villages in Banshkhali.\nEvery year, cyclones strike us with devasting effects reminding us of the need to build more coastal resilience. While traditional hard solutions are necessary in many areas, nature-based solutions such as salt marshes and mangroves also significantly help by building up and protecting coastlines from tidal surges and erosion.\nLiving along the Bay of Bengal in this era of escalating climate effects requires special climate awareness, adaptation measures and improved disaster preparedness. Youth and social organisations' engagement in tackling climate change on our coastlines should be prioritised.\nParvez Uddin Chowdhury is a development worker and climate enthusiast. He can be reached at [email protected].\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our submission guidelines.\n \n",
        "headline_1": "The scars of the 1991 cyclone remain, so do the coastal communities' vulnerabilities",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-scars-the-1991-cyclone-remain-so-do-the-coastal-communities-vulnerabilities-3882946",
        "news_paper_name": "The Daily Star",
        "publish_date": "30-04-2025"
    },
    {
        "full_article": "It is unfortunate that the interim government's directive to remove unfit and outdated vehicles from the streets has received little response from the owners. Reportedly, in late October last year, the government decided to remove expired vehicles from the roads, setting a six-month deadline for compliance. In line with this directive, the Bangladesh Road Transport Authority (BRTA) issued a public notice announcing the removal of buses over 20 years old and trucks/covered vans over 25 years old from Dhaka city. Yet, with the deadline expiring by May, there has been minimal interest from owners in complying with the order.\n\nAccording to the BRTA, over 75,000 buses, minibuses, trucks, covered vans, and tankers exceeded their operational lifespan across the country. One in five buses operated by private companies in Dhaka have no valid fitness certificate. These figures are deeply concerning as outdated and unfit vehicles contribute significantly to road accidents, environmental pollution, and overall chaos in the transport sector. A 2019 study revealed that motor vehicles account for 10.4 percent of air pollution in Dhaka, with most exceeding permissible emission limits. Therefore, the urgency of removing unfit vehicles cannot be overstated. However, the challenge lies in ensuring compliance from transport owners and workers.\n\nDuring the Awami League's rule, we saw how similar removal initiatives failed due to pressure from transport owners' and workers' associations, which were largely controlled by AL-affiliated politicians. But now that a non-political government is in charge, we expect to see a positive change. The adviser to the Ministry of Road Transport and Bridges has stated that after the expiry of deadline, outdated vehicles found operating on roads will be seized and destroyed. But without the owners' cooperation, this will not be easy. The government must, therefore, move strategically.\n\nWhile its offer to assist owners in securing bank loans for new vehicles is a step in the right direction, additional incentives may be needed to encourage compliance. Also, clear directives from the Bangladesh Bank regarding easy access to loans could further motivate owners to replace their old vehicles. Moreover, given how the transport sector is run, political support will be crucial. Since July, most transport associations have been controlled by BNP-linked leaders and activists. Therefore, support from the BNP leadership is essential for the success of this drive.\nOver the decades, successive governments have made lofty promises to reform the transport sector, with little meaningful action. This time, we expect concrete results. The interim government must not fail to deliver on this crucial issue.\n",
        "headline_1": "Remove expired vehicles from the streets",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/remove-expired-vehicles-the-streets-3882921",
        "news_paper_name": "The Daily Star",
        "publish_date": "30-04-2025"
    },
    {
        "full_article": "We are extremely concerned by the recent incidents in Cumilla city, where around a hundred members of \"kishor (teenage) gangs\" were on the streets in three neighbourhoods wielding weapons such as machetes, hockey sticks, rods, etc, while at least 15 motorcycles circled the streets making loud noises, terrifying residents and visitors who watched helplessly, according to a Prothom Alo report. This happened on Friday during admission exams of a university, which is why there were many parents and guardians of candidates waiting outside. It is disturbing that these young men felt emboldened enough to openly demonstrate with weapons in broad daylight.\nThis was not the first time that these gang members have shown their muscle on the streets of Cumilla city. On January 3, more than 50 members of teenage gangs staged a similar demonstration with weapons in various areas, including near Victoria College. Cocktails were also exploded, creating an atmosphere of panic. Later, police arrested some of the members.\n\nBut such arrests did not deter these gangs, as is evident from the even bigger demonstration on Friday. In fact, while police have said that they are conducting raids to catch the gang members, a few arrests here and there are not enough to stop this deep-rooted problem that has spread all over the country, including Dhaka. According to the police, there are at least 15 active \"kishor gangs\" in Cumilla alone. There are hundreds more all over the country, with Dhaka having the highest number. Since 2017, these gangs have been involved in at least 12 murders. They are also involved in other crimes like extortion, drug peddling, sexual harassment and sexual assault.\nSuch gangs have continued to thrive because of the sense of impunity and often political patronage they enjoy. Violence is a way of showing power and a way to earn the \"respect\" of peers. The lack of role models, financial hardship of the family, and a sense of purposelessness make gang culture all the more appealing to many youths. Youth wings of political parties, such as the Chhatra League, which became notorious for its criminal activities and violence, have been a major catalyst in the rise of teenage gang culture.\n\nFriday's incident should be a wake-up call for us. The government must act swiftly. Police must amplify its vigilance of known hotspots with strict enforcement of juvenile justice laws. At the same time, there must be rehabilitation programmes that address the root causes of gang culture. Educational institutions must teach students basic values of empathy and kindness towards others. Parents, guardians and communities have a responsibility too, to engage with young people, create environments where children and youths are nurtured and where they develop a sense of belonging. Opportunities must be created for skills development so that these young men feel empowered and can dream of a wholesome life that does not involve violence and crime.\n",
        "headline_1": "The alarming rise of teen gangs",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/the-alarming-rise-teen-gangs-3881191",
        "news_paper_name": "The Daily Star",
        "publish_date": "30-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 30, 2025 00:00:00  \nInstances of accepting responsibility for any major lapse including big corruption scandal, even accident, let alone any relatively minor case of lack of service delivery by any ministry during the past governments were few. Rather denial of responsibility at best and blaming those at the receiving end at worst was the dominant government culture. Against such a not-so-inspiring background, the Energy Advisor, who is also in charge of the Road Transport and Railway ministry took the officials of the ministries concerned to task for their lapses regarding service delivery. In particular, he instructed government officials to seek public apology in case of any failure to deliver the required service, adding that the public should be informed of, say, any disruption in power supply or metro rail service, through news scrolls on television. In this connection, he also reminded the government officials of the fact that by providing, for instance, the metro rail service or supplying utilities like electricity to the general consumer, they were just doing what was expected of them and not doing the consumers any favour.\nNotably, on Sunday, April 27, the metro rail service in Dhaka remained out of order for about two hours between 5pm and 7pm. The day before, a national power grid failure caused widespread blackout in 21 southern districts. But in neither case, the public were informed about the service disruptions through any media, nor were they notified about possible resumption time of the metro service or power supply. Even the advisor himself was not informed of Saturday's power supply disruptions. Undeniably, those were instances of serious lapses on the part of the government officials concerned. But what makes it different from the public's past experience is that the advisor in this case has tried to make the public servants, or the government for that matter, answerable to the public for any failure. Commendably, the advisor concerned has also previous record of taking responsibility. In January this year, he took responsibility for the increased number of deaths and injuries from road accidents during the entire period of 2024 compared to 2023.\nRemarkably, the interim government of which he is a functionary assumed power on 8th August 2024. In that case, the interim government was responsible, if any, for the death toll from road accidents from the cut-off point of (August 2024) and not for what happened before. But the departments concerned including the police, the road transport authority and roads and highways department were made answerable for the casualties during the entire year and arrangements were made to compensate for the treatment of the injured. Such acts constitute the duties and responsiibilites of a pro-people government. \nNow, it is up to the unbiased social and political thinkers as well as historians to go into the depths of the the why and whence of this anti-people mindset that got the better of our political class. But there are examples of how some politicians in power in the neighbouring country set example (Lal Bahadur Shastri in the late 1950s) by resigning as railway minister following deaths in a railway accident though he had not direct responsibility for the accident. Those in authority would do well to learn the lessons about taking responsibility from people of character and emulate and practice those in their own spheres of activity. The Energy Advisor's example could set an optimistic tone in this regard.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Culture of taking responsibility",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/culture-of-taking-responsibility-1745938960",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       April 30, 2025 00:00:00  \n\nThe question whether domestic policies alone can effectively boost trade has no easy and simple answers. External factors may determine its course. To understand the impact and limitations of such policies, it is essential to consider them within the broader context of today's global trading environment-an environment shaped as much by external forces as by internal ones.\nIt is commonly acknowledged that the power of domestic policies to stimulate trade has certain limits, particularly when considered against the backdrop of an ever more interconnected and interdependent global economy. Trade today is less about isolated national efforts and more about navigating a web of regional agreements, international regulations, and cross-border market dynamics. While domestic policy frameworks-such as competition policy, export-import (exim) policy, and industrial policy-play a crucial role in shaping the trade potential of a country, their influence is significantly constrained by external variables over which countries, especially developing and less-developed ones, have limited control.\nDomestic policies are generally geared towards creating an enabling environment within the national economy. They aim to ensure price stability, encourage fair business practices, enhance industrial productivity, and create infrastructure conducive to trade. These measures support domestic firms in becoming more competitive, both at home and abroad. For example, a well-formulated industrial policy may promote sector-specific growth, leading to increased production for export. Similarly, competition policy can reduce monopolistic tendencies and improve consumer choice and pricing, thereby indirectly influencing the global competitiveness of domestic firms.\nHowever, this is only one side of the coin. The other side presents a more challenging picture. No matter how sound a country's internal policies are, they often fall short of addressing trade barriers imposed by foreign partners. This includes non-tariff barriers, restrictive standards, subsidies, and protectionist measures that distort fair competition. The imbalance in economic strength and negotiating power between trading partners further complicates matters. Developing countries, for instance, frequently find themselves at the receiving end of trade negotiations, having to comply with rules that do not favour their interests. \nIt is precisely because of these challenges that nations increasingly seek alternative strategies to facilitate trade, such as forming regional alliances or entering into bilateral agreements. These arrangements are often seen as more achievable and less demanding than global trade negotiations. Regional trade agreements (RTAs) and bilateral deals offer a more manageable framework for cooperation--- one in which countries can expect a certain degree of mutual understanding and benefit. Geographical proximity often leads to shared challenges and goals, which can be more effectively addressed through joint efforts. For example, neighbouring countries may have similar agricultural concerns, infrastructure limitations, or energy needs, making cooperation more practical and result-driven.\nThe rise of regionalism in trade, therefore, has been largely driven by the desire for a level playing field-something that multilateralism, despite its broader reach, has frequently failed to provide. Yet, regionalism is not without its flaws. Asymmetries in the economic strength of countries within regional trade blocs have often resulted in unequal benefits. In several such arrangements, smaller or economically weaker members have struggled to keep up, unable to take full advantage of market access opportunities due to their limited production capacity or lack of export-ready goods. These internal disparities can undermine the broader goals of equitable trade and shared prosperity.\nComing back to domestic policies, their role in boosting trade, though undeniably important, must be viewed within these wider limitations. At best, domestic policies can serve to strengthen a country's internal supply base, address inefficiencies, improve product quality, and invest in research and innovation. They can enhance infrastructure, facilitate logistics, streamline customs procedures, and improve the business climate. All of these factors contribute to trade readiness and resilience.\nHowever, domestic policies alone cannot address or overcome the external challenges that come with international trade. These include policy-induced barriers from partner countries, such as anti-dumping duties, phytosanitary standards that act as disguised restrictions, and sudden regulatory changes that disadvantage exporters. No matter how proactive or well-designed a country's internal policies are, they cannot shield it from the shifting landscape of international trade rules that may be tilted in favour of stronger players. For instance, many developing countries have experienced market access difficulties despite liberalising their own markets and aligning domestic policies with international norms. This suggests that mere adoption of trade-friendly policies is not enough to guarantee success in global markets. The external environment, particularly the actions and decisions of trade partners, plays a critical role in shaping outcomes. Without reciprocal openness, supportive international institutions and fair dispute resolution mechanisms, the potential of domestic policies remains unrealised. \nTherefore, while domestic policies form the foundation of a country's trade strategy, they must be complemented by strategic engagement in regional and multilateral forums, capacity-building for trade negotiations and efforts to diversify trade partners and products. Furthermore, building alliances with like-minded countries, investing in regional value chains, and advocating for fairer international trade rules are all critical elements in a broader trade policy framework.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Can domestic policies alone boost trade?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/can-domestic-policies-alone-boost-trade-1745939110",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 30, 2025 00:00:00  \n\nApril 24, 2013, began like any other morning in Savar. Within moments, it became a national nightmare. The eight-storey Rana Plaza building collapsed, burying not just bodies, but humanity beneath its ruins. The cries of thousands, the panic, the dust-covered corpses, the wailing children, and the grieving families went into the making of an outsize tragedy in Bangladesh's history. According to official reports, 1,134 people lost their lives, and around 2,500 others were injured. But this was far more than a structural failure-it was a brutal result of unchecked corruption and government inaction. Twelve years have passed. Still, the pain persists for the survivors and their families. We are left asking: Will justice ever come?\nCracks in the building were noticed in advance. Workers voiced their fears. Yet they were forced to enter. What followed was not an accident-it was a mass killing. Responsibility does not rest solely on Sohel Rana, the building's owner. The entire system failed. Despite initial investigations and arrests, justice remains out of reach. Trials drag on. Witnesses are silenced. The accused continue to walk free under the protection of the powerful.\nIf this country truly valued its workers-the very people who sustain its economy-justice would not have stalled so disgracefully. Garment workers continue to be exploited, their safety routinely ignored. The Rana Plaza collapse broadcast images across the world, turning \"Made in Bangladesh\" into a phrase stained with blood. Back then, we said, \"Justice will come.\" Today, twelve years later, we must admit-we have failed them.\nThis tragedy is not isolated. It mirrors the unaddressed horrors of the Tazreen Fashion factory fire and countless other incidents where workers perished with denial of justice. If this culture of impunity continues, Rana Plaza will not be the last.\nIt is time to wake up. We must hold our legal and justice systems accountable. Workers must have the right to organise strong, independent trade unions. Owners must be held responsible. Above all, the media, civil society, and the public must unite in demanding a change. Only then can we move from darkness towards a just future.\nMst. Mishkatul Islam Mumu\nStudent\nDepartment of Mass Communication and Journalism\nJagannath University.\nmishkatislam102@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Twelve years after Rana Plaza collapse",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/twelve-years-after-rana-plaza-collapse-1745939140",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 30, 2025 00:00:00  \n\nMay Day, observed worldwide, is a day dedicated to workers' rights and international solidarity. It serves as an eternal inspiration for all working people across the globe. However, the workers who struggle under the scorching sun, whose efforts build civilisations, remain largely forgotten. Their voices are often unheard despite their significant contributions to society.\nIn 1886, workers in Chicago took to the streets demanding an 8-hour workday.\nIn 1889, at the International Labour Conference in Paris, May 1st was officially declared as Workers' Day. Now it's International Workers' Day. Sadly, even 133 years later, workers in Bangladesh remain deprived of their basic rights. Workers in the informal sector are particularly vulnerable, without proper legal protections, fair wages, safe working conditions, or social security.\nThe 2024 protests have marked a turning point, as workers and students united to demand changes. This new chapter in the workers' movement has shown that collective action can reshape the nation's political and economic landscape.\nFor Bangladesh to advance, we must ensure workers' rights, eliminate inequalities, and respect their contributions. The time for action is now - to unite and fight for the rights of workers, who are the true foundation of our society.\nFiad Nowshad Yeamin\nStudent\nCanadian University of Bangladesh\nnowshadyeamin415@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Workers' rights in crisis",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/workers-rights-in-crisis-1745939161",
        "news_paper_name": "The Financial Express",
        "publish_date": "30-04-2025"
    }
]