[
    {
        "full_article": "Behind the hazardous cleaning deaths of 150 people in 2022 and 2023, a social audit of 54 of which the Ministry of Social Justice has tabled in Parliament, lies a deleterious business model. Local contractors had hired 38; only five were on a government payroll. The rest were public sector workers ‘loaned’ to private employers, obscuring liability. Progress on this front has lagged despite the Prohibition of Employment as Manual Scavengers and their Rehabilitation Act 2013, court orders, Swachh Bharat advisories, and the 2023 National Action for Mechanised Sanitation Ecosystem (NAMASTE) scheme. A 2024 Parliament reply said 57,758 workers were engaged in hazardous cleaning nationwide but only 16,791 PPE kits were supplied. Fewer than 14,000 had received health cards and only 837 safety workshops had been conducted in 4,800 urban local bodies. There are at least two bright spots, however. In Odisha, identified workers have PPE kits and access to mechanised desludging vehicles and Tamil Nadu has piloted sewer robots in Chennai to clean over 5,000 manholes. Technology and political will can thus deliver the desired results but little has reached most districts. Experts also flagged a near-complete lack of data on rural sanitation workers.India’s real problem is enforcement. Industry members have said most underground infrastructure can be cleaned robotically if capital subsidies and operator training expand, yet government tenders often solicit manual bids. Most emergency response sanitation units are paper tigers. Only ₹14 crore has been released so far under the NAMASTE scheme, insufficient to mechanise sewer cleaning in even one major city. In the event of a worker death, police routinely book the lowest ranking supervisor or classify the death as an accident. The Supreme Court has asked for offending contracts to be cancelled and monetary liabilities imposed on principal employers, but local bodies are still to notify such rules. Two-thirds of validated workers are also Dalits, yet rehabilitation packages rarely include housing or scholarships that might help families exit contemptible occupations. Women who still sweep dry latrines receive even less policy attention. Among other measures, urban local bodies must mechanise sewer-cleaning post haste, and make it a licensed trade, and operating without a valid certificate a cognisable offence. Loans for workers to operate the machines that replace manual entry should be upscaled and linked to guaranteed service contracts from municipalities. Finally, the national government should include septic tank desludging under the Swachh Bharat rural budget and extend NAMASTE profiling to gram panchayats. Published - July 25, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        welfare\n                    \n                            /                      \n                        \n                        human rights\n                    \n                            /                      \n                        \n                        social issue\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        Orissa\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        civic infrastructure\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        local authority\n                    \n                            /                      \n                        \n                        Swachh Bharat Mission\n                    \n                            /                      \n                        \n                        Chennai\n                    \n                            /                      \n                        \n                        dalits\n                    \n                            /                      \n                        \n                        police",
        "headline_1": "Clean house: On India’s septic tank desludging",
        "headline_2": "Septic tank desludging must be mechanised completely",
        "link": "https://www.thehindu.com/opinion/editorial/clean-house-on-indias-septic-tank-desludging/article69850996.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "25-07-2025"
    },
    {
        "full_article": "Between CUET and procedures like those employed by DU, getting into college is stress test on steroids \nIndia is in the middle of the annual harassment of students and parents – aka college admissions. Stressful in the best of education systems, in India the supply-demand mismatch between good colleges and good students makes it worse. And since 2022, CUET has added a cruel twist. It is the unified admission test for over 250 universities. But it remains a cure worse than the disease – this year, too, not only was there a shocking delay in publication of CUET results, the exam itself was marked by faulty answer keys and technical glitches, as well as venue choices that seemed to be aimed at punishing examinees. National Testing Agency, which conducts CUET-UG, should sit for an exam, and answer why even after four attempts, the end result is still a nightmare. \nBut this is only one part of the ordeal for students and parents. The labyrinthian admission process – particularly at prestigious institutes like Delhi University – makes getting reasonable quality education a matter of luck and acute digital acumen. For example, DU’s Common Seat Allocation System (CSAS) requires applicants to upload their details, navigate a complicated subject mapping exercise, input their preferences based on course and college combinations, and then let an algorithm do the allocation of seats. \nNaturally, professional coaching institutes have stepped in to “guide applicants”, for a fee. There’s now a CSAS form-filing ecosystem. Clearly, the admission system is skewed against those who are not digitally savvy or who come from modest economic backgrounds. Considering that 2.39L applicants completed DU’s second-phase admission process, getting the course you want is a game of  gargantuan odds. No major country puts its young through such stress just when they are making one of the most consequential decisions of their life. And no one, of course, will be held accountable.\n\n",
        "headline_1": "Admission impossible",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/admission-impossible/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-07-2025"
    },
    {
        "full_article": "Absence can turn the familiar into the unfamiliar, the unchanged into the changed \nReturning home after being away for two months, I wonder if it is indeed a homecoming. \nI put on a switch to turn on a fan. Instead a light comes on. I try another switch, another light, no fan. Third switch, a fan starts revolving. \nIn the kitchen I can’t find the coffee. I finally discover it, tucked away behind a jar of pickles. \nI turn on the electric kettle to make the coffee, and I can’t find my coffee mug. \nEverything seems strange and unfamiliar. The sizes and shapes of the rooms. The arrangement of the furniture. Was that table lamp always there, or somewhere else? And weren’t there different cushions on the divan than these?\nIt’s as though some mischievous sprite has come into the house, and changed around the furniture and furnishings, rewired the electrical switches so that I don’t know which is which, hidden the coffee and coffee mug just in order to confuse and disorient me and make me wonder if the home I think I’ve returned to is really my home, or that of some perfect stranger. \nI’m not the only one feeling a sense of displacement, of not knowing where I am, or where the things I’m looking for might be. \nBunny says she can’t locate her favourite T-shirt, or the shoes she wears when we go for our daily evening walk. Who has hidden them? The same imp of mischief who hid my coffee and my mug? \nAnd of course the imp playing pranks on us is our own misplaced memory, caused by lengthy absence, which makes us see accustomed things with unaccustomed eyes, puts everyday things in unremembered places, turns routine into the random.  \nAs the initial strangeness of homecoming begins to wear off, it reaffirms afresh our sense of place, and by doing so, our sense of ourselves. \nWe are the ones who made this place a home. And, returning the favour, our home made us who we are. That’s the true homecoming. \n\n",
        "headline_1": "Strange homecoming",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/strange-homecoming/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-07-2025"
    },
    {
        "full_article": "For Indian courts to have a clearer way to judge consent in some Pocso cases, age of consent should be lowered \nSexual contact with a child is a crime in India, punishable – depending on gravity – with at least 3 to 20 years in jail. Pocso, the law meant to protect children from sexual abuse, defines a child as anyone under the age of 18. That’s a problem because adolescents often have romantic feelings, and sometimes have sex. There’s no power asymmetry, no abuse or exploitation involved. That’s why SC in May recommended decriminalising consensual relationships among adolescents of similar age. But GOI disagrees. It told SC on Wednesday that any exception would dilute “the statutory presumption of vulnerability” underlying Pocso.\nClearly, consent has no place in Pocso so far. Yet, a Pocso court on Tuesday granted bail to a 40-year-old Mumbai teacher who was recently found to be in a sexual relationship with her 16-year-old pupil. The court based its order on evidence of a consensual relationship between them. In May, a Pocso court in Surat granted bail to a 23-year-old woman tutor who had sex with her 13-year-old student, abducted or eloped with him, and was found to be 20 weeks pregnant at the time of her arrest. These cases show why the concept of consensuality is so hard to pin down when the young are involved.\nTake another case. When 30-year-old UK teacher Rebecca Joynes was jailed last year on charges of sexually abusing two 15-year-old schoolboys, one of the boys, by whom she had a child, said he had been “coerced, controlled, manipulated, sexually abused, and mentally abused”, and struggled to come to terms with it: “I was completely in denial.” This is clear cut – it was abuse.\nOr the US case of Mary Kay Letourneau, who started having sex with a student when she was 34 and he 13, and had two children by him before he turned 15. That became a major scandal in America in 1990s. Despite her protestations of consent – she eventually married the student in 2005 – US authorities treated her crime as rape. She spent over seven years in jail. \nWhat makes things complicated in India is the unusually high age cutoff for consent. In UK, the panel looking into the grooming gangs scandal, last month recommended that adults who have sex with a child under 16 – age of consent in UK – should always be charged with rape, with no exceptions for “love” and “consent”. Indian courts will have a clearer way to judge such cases if the age of consent is lowered.\n\n",
        "headline_1": "Not 18",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/not-18/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-07-2025"
    },
    {
        "full_article": "What the fake embassy of a fake nation, next door to our capital, says about us & our sarkars\nHindustan in some ways is fakeistan. There are the standard fake iPhones and Guccis and Johnnie Walker , forged Jamini Roys and Labubus. Then there are the more exotic nakli GST notices and caste certificates. But a certain Harsh Vardhan Jain has taken the game to nexxxt level: Creating a fake nation. Out of a standard Ghaziabad rented house, he ran a very very freaky ‘West Arctic Embassy’. Until a UP police special task force busted it, this gentleman presented himself as ambassador of Saborga, Poulvia, Lodonia and other fictional micronations. The creativity of it all is really dazzling con-noisseurs.\nThey say a good conman doesn’t steal your money but convinces you to give it to him. On the big screen, that’s what we love about a Danny Ocean (Ocean’s Eleven) or a Frank Abagnale Jr (Catch Me If You Can). It’s not just that they’re dangerously charming but also that they’ve really cracked human psychology. You have to know people to fool people. No surprise then the ‘West Arctic ambassador’ has really set social media abuzz. Lionising comments like ‘Only respect’ and ‘India is not for beginners’ outnumber horrified ones. Lodonia has acquired its own fan club. It sounds no less enchanting than Narnia. The inventiveness is con-summate indeed.\nAll this applause also explains how such swindles flourish in India. Sure, goggling at those Audis and Mercs, with blue diplomatic looking number plates, is not complicity with the crime. The problem is that various authorities, evidently, share this quality of tolerance. Forged diplomatic passports and MEA stamps tell a bigger tale. That it takes an STF to tell a real embassy from a fabricated one is what’s con-sequential. The only thing about this that ain’t funny is the laxity of security that made the hoax possible. \n\n",
        "headline_1": "The talented Mr Lodonia",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-talented-mr-lodonia/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 25, 2025 00:00:00  \nIt is hardly surprising that the issue of money laundering continues to resurface, as it remains a stark and persistent reality the country is forced to confront without any foreseeable remedy. For long, there have been concerns raised from various quarters, and over time it seems as though this 'concern' is a cyclic expression of frustration and anger. The issue, because of its enormity and scale, has been receiving media focus for quite a while -- set off by rough estimates about the money flown off the country to so called tax heavens and overseas financial institutions. Lately, a government estimate has revealed that the country loses US$16 billion annually through trade-based money laundering alone primarily due to lax oversight of trading operations. The scale of this outflow is staggering. It accounts for around 3.4 per cent of the country's GDP, surpassing even the national budget for public health. The Bangladesh Institute of Bank Management (BIBM), in a study based on surveys across 37 commercial banks, reports that about 75 per cent of all domestic money laundering cases are linked to trade channels. The sectors most affected include textiles, consumer goods, and petroleum imports. \nDespite policy alignment with global anti-money laundering (AML) standards --such as risk-based customer due diligence, price verification protocols, and real-time monitoring -- the actual implementation remains inconsistent. Although the banks surveyed claim to have sanctions-screening and trade-monitoring systems, only 50 per cent use global price verification tools like Bloomberg or Global Trade Tracker, often citing cost as a barrier. Similarly, 90 per cent of banks have vessel-tracking systems, but few rely on established platforms such as Lloyd's or the International Maritime Bureau. While most institutions apply customer risk scoring, only 45 per cent have enhanced due diligence frameworks tailored to trade-specific risks. Moreover, many public banks lack dedicated price verification units, leaving trade officers to rely on subjective judgment -- an approach that severely undermines oversight. The legal framework also poses challenges. Notably, the Money Laundering Prevention Act 2012 does not explicitly list TBML as a predicate offence, although it provides for prosecution and asset seizure linked to illicit trade-related flows. A critical gap lies in the lack of coordination between key regulatory bodies such as the Bangladesh Financial Intelligence Unit (BFIU), National Board of Revenue (NBR), customs authorities, and commercial banks. The absence of real-time data sharing on trade, shipments, and payments creates loopholes that are exploited through phantom shipments, circular trading, and invoice manipulation.\nGlobal best practices provide a way forward. Countries like Singapore, Finland, and Sri Lanka have successfully implemented integrated trade and payment data systems, strengthened beneficial ownership transparency, and structured public-private collaboration. These measures, coupled with proportionate penalties and incentives for clean trade, have significantly improved compliance.\nAddressing TBML is not merely a regulatory obligation but a development imperative. Without urgent action, Bangladesh risks continued revenue losses, distorted trade statistics, and damaging consequences such as Financial Action Task Force (FATF) grey-listing, higher correspondent banking costs, and reputational harm in global markets.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Trade-based money laundering",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/trade-based-money-laundering-1753364762",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       July 25, 2025 00:00:00  \nBangladesh's external trade, especially export, is now up against the wall and the factors behind this are of both domestic and international origin. At a time, when the government's ongoing talks with the current Trump administration of the US, which has imposed a 35 per cent reciprocal tariff on its import of Bangladesh-origin products are in an uncertain territory, the Internal Container Depot (ICD) owners have unilaterally decided to hike up export cargo handling charges to be effective, according to reports, from September 1.\nThis development adds a new layer of complication to an already fragile trade environment, where exporters are reeling under the pressure of increasing global competition, trade policy uncertainties and sluggish post-pandemic recovery in demand.\nThe timing of this enhanced export container handling fees does not seem to be sensitive to the difficulties the country's export trade is at the moment faced with. For, the Bangladesh Inland Container Depot Association (BICDA)'s announcement of enhanced handling fees might further contribute to compromising the competitive edge of the Readymade Garment (RMG), the largest export industry of Bangladesh, in the global market. Given the RMG sector's high sensitivity to cost fluctuations, any increase in logistics-related expenses could erode already thin profit margins and weaken Bangladesh's position against rival exporting countries such as Vietnam, India and Cambodia.\nIn fact, the ICDs, also known as off-docks, which are located in and around the port city, handle 90 per cent of the total export goods by stuffing those into containers before their shipment through the Chattogram port. Also, close to a quarter of the import containers are sent from the port to these ICDs wherefrom the import goods are delivered.\nSo, the positive role played by the ICDs in the country's external trade cannot be overstated. Even so, its decisions to raise container handling charges, often, like this time, made without holding prior consultations with the stakeholders including the ministry of shipping, on various pretexts including fuel prices, labour costs, equipment maintenance, devaluation of the Bangladesh Taka (BDT) against the US dollar (USD), rising bank interest rates, overall inflationary pressure and so on, have led to heightened concerns among the exporters particularly those in the RMG sector. Such unilateral pricing strategies not only disrupt budgeting and planning for exporters but also risk triggering a domino effect throughout the export supply chain - from subcontractors and freight forwarders to international buyers already wary of price hikes.\nThis time, too, the BICDA's tariff hike on export cargo handling will see a 36 per cent to 44 per cent increase in handing fees compared to the existing rates. Also, the handling charges for the empty containers are going to be enhanced by 31.8 per cent. However, the import cargo containers have been spared any handling tariff hike this time around. The apex body of the Bangladesh's readymade garment manufacturers and exporters, the BGMEA, says, BICDA's decision will create a big pressure on the export-oriented industry. The BGMEA has further urged the authorities to consider temporary relief or subsidies to offset the burden on exporters, especially small and medium enterprises that lack the resilience to absorb cost shocks.\nNotably, some days back, the Chattogram Port Authority (CPA) itself proposed a raise in its tariffs by 70 per cent to 100 per cent across 50 service categories. But the CPA's proposal, too, could not come at a worse time, when the export sector, particularly the apparel industry was struggling against rising global headwinds that include soaring energy costs, supply chain disruptions, harsher compliance conditions and falling demands in the overseas markets, mainly in Europe and North America. The convergence of domestic cost escalations and global market contractions is squeezing exporters from both ends, raising serious concerns about long-term sustainability.\nNow, as if to rub salt to the wound, the BICDA has now come up with a declaration of raised cargo handling fees on the grounds that the investment costs of their depots have risen so significantly that their capacity for expansion has become difficult. They also complained that their new ICDs are in financial straits affecting their operational viability. So, to keep those ICDs viable, exporters will have to pay, for instance, at a 60 per cent higher rate for handling a 20-foot goods-laden container and at a 81 per cent higher rate for the 40-foot-high cube containers and 45-foot containers. Other types of cargo handling fees are also going to experience similar raises. Such a unilateral decision to burden exporters with additional costs risks undermining the entire trade ecosystem. The BICDA should have taken a collaborative approach before announcing the hike.\nIn these circumstances, the government needs to intervene so that any decision on container handling charge hike is made through concurrence of all the stakeholders involved. Last but not least, before going for any fresh service charge hike, ICD operators should consider the overall state of the export trade, which is now in a struggle for survival.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "ICDs' handling charge hike to affect export trade",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/icds-handling-charge-hike-to-affect-export-trade-1753364955",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       July 25, 2025 00:00:00  \nHuman lives are unimaginably cheap in Bangladesh. Hundreds of lives slip away every year here not due to natural disasters or foreign adversaries but because, collectively, we undervalue human lives. We lose our most priceless asset in efforts to save a few taka or a small amount of time, cutting corners, or giving pride a place over safety.\nData from the World Health Organisation suggests around 32,000 lives are lost annually in road crashes in Bangladesh. Motorcyclists make up the largest share of fatal accidents with nearly 40 per cent of the crashes involving bikes and 35 per cent of victims being riders. Many travel without helmets or licences because they think wearing the safety gear is inconvenient or it involves unnecessary costs. Similarly, unfit vehicles -- mostly older, worn-out, and without fitness certificates -- ply roads across the country compromising safety because inspection seems optional or their operation is made possible through bribery. Many of the road fatalities could have been avoided had vehicles without fitness licences been kept off the road and basic safety measures like seatbelts, helmets, speed limits, and proper licensing ensured.\nA cultural syndrome plays a big role behind the loss of lives in Bangladesh. In public and private life, we prioritise saving money over safety. Whether it is skipping maintenance on a vehicle to cut costs or using cheap, flimsy protective gear in a hazardous job, lives are regularly traded off for economic convenience. We add unauthorised and unscientific extra metal bumper to every motorised vehicle - be it commercial or private - seemingly to protect our vehicles but that ultimately puts our lives at risk. It is well-recognised that vehicles with metal bumpers cause more harm to those involved in any accident than the ones without such devices.\nJaywalking on busy urban streets is another aspect of compromising safety. Every day, pedestrians risk their lives by stepping into traffic at unauthorised points, exposing themselves to grave danger and contributing to mounting road fatalities. According to media reports, pedestrians account for nearly half of all road crash victims in Dhaka, with more than 1,600 pedestrian deaths reported in 2022 alone.\nAnother tragic pattern in Bangladesh is that we prefer cheaper substandard products to save money. Manufacturers opt for low-priced ingredients or processes to produce goods, even lifesaving drugs, to keep their cost low. And people sometimes prefer expired or counterfeit products knowingly and even medical facilities use low-quality materials. They do not take into consideration that such \"savings\" come at the cost of their own health and lives.\nAgain, countless lives are lost each year in Bangladesh over trivial conflicts -- often involving a small sum of money or petty disagreements. These tragedies reflect the mind-set in which human life is not given the value it deserves.\nWe, starting from individual to the state level, need to understand lives are invaluable which should never be forfeited over money. The saving of a small amount of money compromising safety often ends up incurring far greater losses through accidents, health crises, or reduced life expectancy. As a nation aspiring to grow in peace and dignity, we cannot afford it. It is necessary to shift our attitudes and give lives priority over anything.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Risking lives for pennies",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/risking-lives-for-pennies-1753364985",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 25, 2025 00:00:00  \n\nThe sharp rise in mental health struggles among young people is a growing yet often overlooked emergency worldwide. Across every region, youth are reporting increased levels of stress, depression, anxiety, and emotional exhaustion. What was once hidden within individuals has now emerged as a collective crisis, demanding urgent attention.\nSeveral interconnected factors fuel this distress. Social media platforms create relentless pressure to meet often unrealistic and idealised standards of appearance, success, and lifestyle. Academic competition intensifies as young people face heightened expectations, while the uncertainty of the future-whether economic, environmental, or social-weighs heavily on their minds. Additionally, the psychological aftermath of the COVID-19 pandemic still lingers, leaving many young minds vulnerable and isolated after prolonged periods of lockdown and disruption.\nMental health remains a deeply sensitive subject in many societies, especially across South Asia. Most schools lack proper emotional support systems, and access to professional mental health services is either limited, unaffordable, or socially stigmatized. As a result, many young people feel isolated and helpless, with some tragically resorting to self-harm or more drastic measures.\nThis escalating problem demands swift and serious intervention from educators, health professionals, policymakers, and communities. Mental health awareness must be systematically integrated into school curricula. Educational institutions should hire qualified counselors and regularly conduct well-being workshops to equip students with coping skills. Families, too, must be better informed and supported to provide emotional guidance and safe spaces for their children at home.\nNeglecting this issue today will lead to significant long-term societal damage. A generation plagued by untreated emotional struggles cannot be expected to thrive, innovate, or lead effectively. Ensuring robust mental health support for youth is not only compassionate-it is essential for the nation's progress, resilience, and future.\nYana Islam Rifa\nNorth South University \nyaanarifa25@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Addressing mental health crisis of youth",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/addressing-mental-health-crisis-of-youth-1753365050",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-07-2025"
    }
]