[
    {
        "full_article": "India’s record goods trade deficit in October ($41.68 billion) follows a sequential build-up from September ($32.15 billion), reflecting a disturbing turn in its external trade landscape. The shock from the U.S.’s tariffs has been largely responsible — a full 50% levy that came into effect in August — at a time when the U.S. had become India’s largest single export market (since about 2018-19). But the main cause of the 11.8% year-on-year (YoY) drop in goods exports to $34.38 billion ($38.98 billion in October 2024) and the precipitous rise in imports lies in a record surge in precious metal inflows. Gold imports nearly tripled from last October ($4.92 billion) and inbound silver rose more than fivefold. This suggests that the bullion surge is not merely seasonal but also a hedge against growing economic uncertainty. The rupee’s weakening from about ₹85.6 to a dollar in April to around ₹88.4 to a dollar in October, and the net foreign portfolio outflow in September (leading into a recovery in October) further corroborate the hedging. What is troubling about October’s merchandise data is the steep fall in exports of labour-intensive sectors such as textiles and apparel — cotton yarn and handlooms 13.31%; man-made yarn 11.75%; readymade garments 12.88%, and engineering goods 16.71%. The U.S. has been the largest market for these sectors for some years now. Overall exports to the U.S. declined by 9% YoY in October.The import surge in goods value is partly explained by the depreciating rupee but also strongly suggests the increased use of cheaper imported intermediate goods to keep finished exports competitive, rather than domestic sourcing. The detailed HS-chapter breakdown of imports by commodity and source country will elucidate this further. Meanwhile, the Centre has stepped in with export-promotion initiatives, for ₹25,060 crore over six years, and the Reserve Bank of India has announced relief measures for exporters hit by tariff headwinds. Nonetheless, it is too early to conclude that this shift is structural rather than an immediate reaction to a major external shock. Rerouting of exports, new market access and supply-chain realignment take months if not years. The record October deficit may yet prove to be a blip, particularly if the India–U.S. Bilateral Trade Agreement is concluded swiftly and tariffs are rolled back. The steep drop in Russian imports (-27.73%) and a concurrent rise in U.S. imports (13.89%), suggest an attempt to assuage American concerns of a widening trade deficit, and to reduce Russian crude inflows. Even if the overall deficit persists, despite a thaw in U.S. relations, that would only point to a structural shift in India’s trade portfolio. While painful in the short term, such a shift may ultimately be desirable, as India’s heavy dependence on the U.S. export market has now exposed it to both diplomatic and economic vulnerability. Published - November 19, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        trade balance\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        gold and precious material\n                    \n                            /                      \n                        \n                        currency values\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        textile and clothing\n                    \n                            /                      \n                        \n                        imports\n                    \n                            /                      \n                        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities",
        "headline_1": "Excessive dependence: On India’s external trade landscape",
        "headline_2": "A structural shift in India’s trade portfolio is essential",
        "link": "https://www.thehindu.com/opinion/editorial/excessive-dependence-on-indias-external-trade-landscape/article70295169.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-11-2025"
    },
    {
        "full_article": "Sonbhadra is a name that indicates wealth and good tidings. As a part of a region straddling Uttar Pradesh, Chhattisgarh, Bihar, Jharkhand and Madhya Pradesh — arguably India’s richest in terms of mineral resources though not in human development — this district in Uttar Pradesh is also India’s energy capital. It is home to some 6,000 MW of coal plant capacity — nearly half of all of Tamil Nadu’s. On Saturday, a stone quarry collapsed over nearly a dozen workers in Obra in the district. The death toll is mounting even as hopes are still alive that some may have survived. The State government has ordered a three-tier probe by the district administration, the police and the mining department. An FIR has been filed against the quarry owner alleging negligence of safety protocols. But if there were indeed violations, what was the government doing? State disaster response workers reached the site from Mirzapur, making a case for their local stationing in an area that has over a dozen stone quarries and other mines such as coal along the Vindhyas-Kaimur hill range. Questions have been raised about the level of safety training of workers and them having adequate safety gear.But the problems are deeper and structural. Opposition allegations of rampant illegal quarrying are not fanciful stuff. Stone quarries represent the lowest end of mining, and often the least safety conscious. Stone quarry contractors are often small-time operators. Ideally, micro geological studies need to be done to plan the cutting. These studies will clearly flesh out the weak joints and fracture lines on hill slopes where cutting should be avoided. The government may do broad and general geological studies at the macro level before leasing the blocks. But once contracts are given out, micro studies, say at the square kilometre level, are rarely done by the individual contractors. It is just luck that there are not many more accidents, geologists point out. Blasting design is a science that accurately assesses the size and throw of explosives needed and, therefore, at what distance the explosives should be set off. But explosive size and distance are often just rule of thumb decisions. Such open mines need to be benched — small horizontal plateaus cut along the slope of a hill. This ensures safety and decreases chances of a wholesale quarry collapse, as in Obra. Investigators will need to find out to what extent these basic measures were followed not just at the site but across the region. Ironically enough, some of the best minds and technologies are available at IIT (ISM) Dhanbad. Whether there is political will to leverage them fully in the area is the bigger question. Published - November 19, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        mining\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Uttar Pradesh\n                    \n                            /                      \n                        \n                        Chhattisgarh\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        Jharkhand\n                    \n                            /                      \n                        \n                        Madhya Pradesh\n                    \n                            /                      \n                        \n                        coal\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        technology (general)",
        "headline_1": "​Bad tidings: On India’s quarries and mining",
        "headline_2": "The problems with India’s mines are deep and structural",
        "link": "https://www.thehindu.com/opinion/editorial/bad-tidings-on-indias-quarries-and-mining/article70295193.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-11-2025"
    },
    {
        "full_article": "What links America’s Epstein scandal to Bihar elections? The power of comedy \nAs much as the Epstein saga seems like a bottomless cesspit, its central disjuncture is how many of America’s rich and powerful, have been spotted swimming in it. Such disjunctures are comedy gold, but only if the comic has empathy and moral muscle, besides wit and intelligence. Lesser pens can trivialise the horrific abuse of children for TRPs. Finer ones can make a difficult topic accessible to people, even as they demand political accountability. While usually docile Republicans push Trump to cede ground on the release of the Epstein files, late night US TV has kept up its job of landing endless punches. These make clear how, despite recent setbacks, comedy still remains in better humour in this country than others.\nA lot of it is decidedly non-snobby. On The Daily Show, Josh Johnson described Republicans releasing 23,000 pages of Epstein documents to counter the three emails released by Democrats as “trying to hide pissing yourself by shitting yourself”. And Jon Stewart talked about how near-impossible it is to talk about this saga without sounding  “ejaculate-adjacent”. The verb ‘release’ being Exhibit A. There is an air of ‘vox populi’ about all this. It’s in the hoary tradition of jesters and wise fools. Another aspect of it is, as Shakespeare wrote in Twelfth Night, “What great ones do, the less will prattle of.” But great and less have to be understood as inverse as well. The Epstein files don’t just inveigh Trump and Bill Clinton. Peter Thiel, Noam Chomsky, Larry Summers, Steve Bannon – the Who’s Who featured here are from across the political, financial, academic aisles. When the moral squalor is in high places, political humour enables people to criticise it, whether or not the powerful are finally punished for it. \nIf the Epstein story has shown how humour keeps public attention focused on injustice in America, in India too standup is having a golden moment. Bihar elections, for example, put the spotlight on how many young people from the state are dishing out social-political laughter to packed clubs, from Gurgaon to Bengaluru. This is a new kind of ‘adda’ space – serving conscience plus chuckles. But whereas the worst that US comics have to fear is getting cancelled, here there’s the whole gamut of FIRs, arrests, physical attacks to be dreaded. This is very uncool. Comedy often turns sharper as the stakes go higher. It shouldn’t take uncommon courage to tell a stinging joke.\n\n",
        "headline_1": "It’s Serious, So Laugh",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/its-serious-so-laugh/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-11-2025"
    },
    {
        "full_article": "Hidma’s killing further weakens Maoists. For total victory address tribal grievances, rehabilitate surrendered cadres \nThe killing of top Maoist commander Madvi Hidma in a security forces encounter yesterday marks yet another success in GOI’s ongoing drive to eliminate left-wing extremism by March next year. Hidma was the head of the People’s Liberation Guerrilla Army Battalion No.1, and was said to be responsible for multiple attacks on security forces and state targets, including the 2010 Dantewada attack in which 76 CRPF personnel were killed. Hidma’s elimination, therefore, will further weaken the Maoist armed insurgency. \nHowever, two points need to be recognised. First, it’s true that due to relentless security pressure this year at least 1,225 Maoists have surrendered, more than 270 have been eliminated in security operations, and upwards of 680 have been arrested. This also appears to have bred disunity within the Maoist leadership. Mallojula Venugopal Rao, ideological head and chief spokesperson of CPI (Maoist), has written two letters arguing for a cessation of armed struggle. This is precisely why in addition to security operations this is the right time to address the root causes of left-wing  extremism, including dispossession of land and marginalisation of tribal populations. ST communities are still the poorest in India with around 65mn out of 129mn living in multidimensional poverty. Yet, in many instances they continue to be denied their forest rights claims, are forcibly evicted, and development projects sanctioned in their areas without gram sabha approvals. These issues must be addressed to achieve total victory over left-wing extremists who feed on these grievances. \nSecond, armed Maoists may truly be defeated next year. But the ideology that sustains their movement may evolve and take other forms. GOI and security agencies must be alert to this. A big reason Maoist cadres have shrunk is because of expanded state welfare, which has dented recruitment for ultras. But this is not a permanent solution. Exacerbation of inequality despite welfare could see the movement mutate and find new avenues of sustenance such as transnational drug trafficking. Hence, making tribals stakeholders in their own development and helping surrendered Maoists return to normal life are key to ending the Maoist insurgency once and for all.\n\n",
        "headline_1": "Fading Red",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/fading-red-3/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-11-2025"
    },
    {
        "full_article": "A study reveals that AI sucks up to people more than people suck up to each other \nWhen asked if he were a chamcha of Indira Gandhi, whom he openly and frequently championed, Khushwant Singh reportedly replied that he wasn’t just her chamcha, he was her entire cutlery set. \nHad he been around today, the renowned author and columnist would have been outrivalled in chamchagiri by AI-powered chatbots. \nA recent study conducted by US researchers found that chatbots across 11 frequently consulted Large Language Models (LLMs) such as Google and OpenAI tended to be 50% more given to flattery than human advisers, agreeing with users even when the user was being irrational or obviously biased in opinion. \nCalling this tendency ‘social sycophancy’, which is far more harmful than AI-generated factual errors, the researchers warn that such excessive agreeability, or AI-greeability, could have far-reaching adverse consequences by reaffirming and reinforcing prejudicial ways of thought and behaviour, and creating a ‘feedback loop’. \nThe more a chatbot agrees with me the more I’m likely to use it, and the more I use it the more entrenched I’ll become in my beliefs, erroneous though they might be. \nThe research team conducted two experiments: One in which the participants shared their emotion and psychological issues with a sycophantic chatbot and another in which the participants did the same with a neutral interlocutor. \nThe experiment showed that the participants rated the sycophantic responses as “being higher in quality, expressed greater trust in the model, and said they were more likely to use it again”. \nAs sycophantic chatbots given to prioritising flattery over fact gain in popularity, programmers create more and more of them, a development which sociologists warn leads to validation of one’s own point of view at the expense of others’, causing single-minded assertiveness and the devaluation of empathy. \nHowever, the biggest problem of succumbing to the charms of chamchas is that sooner or later one will get well and truly forked…\n\n",
        "headline_1": "Chatbot chamchagiri",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/chatbot-chamchagiri/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-11-2025"
    },
    {
        "full_article": "Hasina show trial, repression of Awami League & official support for Islamist militia heighten the prospect of civil war in Bangladesh. That and not cosying up to Pak’s jihadist general Munir, should be Yunus’s priority\nSheikh Hasina’s death sentence will have surprised none. She and her family, her party colleagues and her workers across Bangladesh, her friends and foes at home and abroad – everyone saw this coming.\nNobody expected a fair trial, an adequate opportunity of defence for the deposed leader.\n\nRevenge by use of law has become the new normal in post-Hasina Bangladesh and Nobel laureate Muhammad Yunus has presided over Bangladesh’s descent into a vendetta republic.\nRead the full story on TOI+.\n\n",
        "headline_1": "Dhaka’s war within",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/dhakas-war-within/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-11-2025"
    },
    {
        "full_article": "There is a curious weight in witnessing a moment that feels like the culmination of years of waiting, even if the full consequence of that moment may never be realised. The verdict on Sheikh Hasina carries precisely that weight as a symbolic punctuation to a decade of fear, suffering, and quiet endurance. In a country where power so often felt untouchable, where law could be bent to protect those with influence and destroy those without, the decision to hold Hasina accountable is not merely judicial but also personal.\nTo speak of justice in abstract terms is simple. Scholars debate procedure, diplomats discuss optics, international media deliberate fairness, and foreign governments weigh consequences. But those frameworks rarely capture the intimate, almost physical relief that comes from seeing a powerful figure confronted with accountability. There is a long history of people waiting in court corridors that seemed endless, of families pressing photographs into the hands of reluctant officials, of citizens carrying memories of disappeared friends, neighbours, and colleagues, and of loved ones killed in protests. Justice has often been absent, delayed, or warped to suit politics.\nThere is a reason why this verdict feels like a personal win. It is because we have had to live under the shadow of her choices and watch the erosion of the everyday sense of safety, the subtle conditioning of our minds, the quiet fear in public spaces, the erosion of civic confidence. Accountability, even if delayed, restores a sense of moral order. It confirms that cruelty leaves traces that the world cannot ignore indefinitely.\nThis is why the debates framed in diplomatic language feel insufficient. When discussions revolve around whether a death sentence complicates her extradition, whether India will cooperate, or how the United Nations will respond, they obscure the emotional reality for citizens who have spent years negotiating life under fear. For these citizens, this sentence is neither a matter of politics nor of optics; it is a matter of recognition. A recognition that public accountability is possible, even if partially. So, while the world debates the technicalities, the symbolism of the verdict cannot be overstated. For the families of the disappeared, the survivors of forced disappearances and institutionalised cruelty, the families of the around 1,400 people killed in the uprising, and thousands more injured for life, its significance is immeasurable.\nThere is a certain inevitability in our emotional reaction. Those of us who carried the burden of witnessing injustice or suffered directly at its hands feel a sense of vindication. It is as if, at last, the moral ledger has been balanced, even if the numbers can never fully account for the enormity of our losses. Justice, in this sense, is an echo of recognition; an affirmation that what was endured matters, that those who once felt powerless are not entirely unheard. This is historic precisely because it exists in tension with what came before. For too long, the apparatus of the state allowed selective justice to define the rules. Decisions were guided by proximity to power, by allegiance, and by fear. Ordinary citizens—the witnesses, the silent sufferers—were forced to inhabit a parallel reality: a world in which laws existed, but rarely for them. The sentence against Hasina disrupts that parallel.\nOf course, there is no guarantee that this moment will translate into lasting systemic change. The procedural aftermath, the international commentary, and the political manoeuvres that follow will test the depth of this symbolic victory. However, this moment affirms that ordinary citizens, who watched power move like a tidal wave over their lives, have a stake in the moral universe that the law is meant to inhabit. Hasina's sentence does not erase any of their sufferings, but it places them in a moral context where they are no longer invisible. That alone, in a country where invisibility has often been the default condition for those outside power, is transformative.\nPerhaps the most profound aspect of this moment is the way it reframes the imagination of possibility. To see accountability reach a figure perceived for so long as untouchable opens a conceptual space. It allows us to imagine a society in which systems, though flawed, are not entirely devoid of redress. It allows a generation to measure possibility not by fear alone, but by the courage and persistence of those who upheld principle until the moment of recognition arrived. The debate over fairness and proportionality is not insignificant. Legal scholars, diplomats, and international observers will continue to dissect, question, and deliberate over the technical merits of the sentence. That discourse matters in its own domain. Yet for citizens who have experienced the consequences of unchecked authority, those considerations are secondary to the emotional and symbolic resonance of accountability.\nHistory will judge the verdict in its own way, but for those who lived under the shadow of Hasina's regime, the personal significance precedes history. In the end, the importance of the sentence rendered on Hasina is not confined to law or politics. It is a moment that will enter collective memory as proof that justice, even when deferred, can arrive—and when it does, it feels like a personal triumph for all who lived under its absence.\nMaisha Islam Monamee is a graduate from the Institute of Business Administration (IBA), University of Dhaka.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "A historic verdict that carries weight even in absentia",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/historic-verdict-carries-weight-even-absentia-4037886",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-11-2025"
    },
    {
        "full_article": "Emerging from the ruins of the war of independence in 1971 with a devastated economy, Bangladesh has gradually transformed into a vibrant lower-middle-income country, which is poised to graduate from the Least Developed Country (LDC) status in November 2026. Over the years, factors such as remittances, exports, agriculture, small enterprises, microfinance, and the increasing participation of women in the labour force have played crucial roles in poverty alleviation and improving several human development indicators of the country.\nYet, behind the success lies an emerging set of concerns. Income inequality has increased, urban poverty is becoming more complex, and a series of external shocks, including the pandemic, the Ukraine war, global price volatility, climate impacts, and persistent inflation, have revealed deep-rooted structural vulnerabilities. For Bangladesh, the issue is not about the rate of growth, but whether growth can be inclusive.\nBangladesh's fight against poverty has indeed been one of its notable achievements. Rural households gained from expanded irrigation, the adoption of high-yielding crop varieties, better connectivity, and the growth of non-farm enterprises. Women's employment, particularly in the ready-made garment sector, provided millions with stable incomes and greatly increased their independence. Microfinance institutions helped poor households smooth their income, invest in livestock or small shops, and send their children to school. Remittances from migrant workers offered financial stability to rural families.\nHowever, poverty reduction faces specific limitations. Nationwide, 85 percent of workers are employed in the informal sector, characterised by limited job security and a lack of social protection, which makes households very vulnerable to shocks. High inflation, particularly food inflation, has decreased real incomes, causing many families that had escaped poverty to fall back below the poverty line or remain just above it.\nInequality, meanwhile, continues to grow in noticeable ways. According to the Household Income and Expenditure Survey (HIES) 2022, the national income Gini coefficient increased from 0.482 in 2016 to 0.499 in 2022, indicating that income distribution is becoming more unequal. The HIES 2022 shows that the richest of the rich—the top five percent of households—possess 30.04 percent of the total national income, while the poorest of the poor—the bottom five percent—hold just 0.37 percent. In 2016, the top five percent's income share was 27.82 percent, whereas that of the bottom five percent was only 0.23 percent of the total national income.\nBesides, urban–rural disparities remain significant. Cities are expanding through higher-productivity services and industries, while rural communities continue to depend on low-return agriculture and informal employment. Inequities in access to education, healthcare, technology, and financial resources are widening these gaps. Children from poorer households are more likely to attend poor-quality schools, suffer from undernutrition, and have limited chances to develop skills needed for modern labour markets. This hampers human development progress.\nMeanwhile, food security shows a mix of progress and new risks. Bangladesh has more than doubled its food grain output in the past 30 years, thanks to advances in agricultural research, irrigation, and policy incentives. However, food security depends as much on access as on availability. Climate change now poses the greatest threat to that access. Agricultural land is endangered by rising salinity, coastal inundation, unpredictable rainfall, and flash floods. In recent years, while severe and prolonged flooding in rural areas has led to local food shortages and price hikes, low-income households in urban areas also struggled with high food prices, reducing their food intake or meal quality. The paradox today is that Bangladesh often has enough food supplies nationwide, but poor households cannot always afford enough food due to inflation, low incomes, and weak market governance.\nAlthough Bangladesh has a social protection system with around 120 programmes, including old-age allowances, widow benefits, food assistance, and employment support, the effectiveness of this system remains limited. Spending on the social safety net (SSN) accounts for less than two percent of Bangladesh's Gross Domestic Product (GDP). In fact, the SSN allocation accounts for only 1.87 percent of the national budget for the fiscal year (FY) 2026. However, this allocation includes various other components—such as pensions for government employees, interest on national savings certificates, and agricultural subsidies—not targeted at the poor and vulnerable. Excluding these, the share of the SSN allocation stands at just 1.03 percent of GDP in FY2026. In addition to the insufficient allocation relative to the needs of the poor, several limitations, such as targeting errors, overlapping programmes, outdated beneficiary lists, and limited coverage of the urban poor and informal workers, curtail the overall impact. Strengthening the system demands a unified social registry, digital identification and payment systems, improved targeting, and expanded coverage. Over time, Bangladesh will need to increase social protection spending while enhancing efficiency and transparency.\nThe classical Kuznets hypothesis, proposed by economist Simon Kuznets, suggests that inequality tends to rise during early development as economies shift from agriculture to industry, and then decline as more people gain access to education and modern employment opportunities. However, recent evidence indicates that inequality does not necessarily fall automatically. Since the 1980s, inequality has increased in many countries due to skill-biased technological change, financialisation, declining labour bargaining power, globalisation without adequate compensation, and the concentration of wealth among elites. Markets alone cannot address inequality. Policy decisions such as taxation, social protection, labour laws, education, and regulatory measures impact distributional outcomes.\nBesides, the \"capability approach\" introduced by Nobel Laureate economist Professor Amartya Sen in the 1980s shifted the concept of poverty from simple income deprivation to a broader understanding encompassing health, education, empowerment, and agency. The multidimensional poverty framework, now widely adopted globally, emphasises that poverty involves multiple disadvantages, such as poor schooling, unsafe housing, malnutrition, lack of access to clean energy, and social exclusion. Factors like gender, ethnicity, geography, and social class all influence who remains in poverty.\nViewed from these perspectives, Bangladesh's dual reality becomes evident. The country has made considerable progress, but the foundations of inclusive development remain uneven. Bangladesh must now emphasise not only the pace of growth but also its quality, inclusiveness, and resilience.\nThat means investing heavily in education and skills so that young people from all backgrounds can access more productive work. It involves promoting meaningful jobs in manufacturing and services across all cities and lagging regions beyond Dhaka. It also entails adopting a more progressive tax system where the wealthy pay a fairer share to fund public services. Additionally, it includes modernising food markets and employing digital tools to improve transparency in procurement, stocking, and distribution. Finally, it means incentivising private investment in climate-resilient agriculture through salt-tolerant seeds, flood-tolerant rice, efficient irrigation, storage, and insurance.\nAnd most importantly, it involves recognising that poverty and inequality reduction, and food security cannot be tackled in isolation. These issues are interconnected and must be addressed through a coherent strategy rooted in equity, good governance, and strong institutions.\nDr Fahmida Khatun is executive director at the Centre for Policy Dialogue. Views expressed in this article are the author's own. \n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "It is time Bangladesh pursued inclusive growth",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/it-time-bangladesh-pursued-inclusive-growth-4037276",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-11-2025"
    },
    {
        "full_article": "Bangladesh is facing a growing fire crisis. Data from the Department of Fire Service and Civil Defence, compiled by Dataful, shows roughly 250,000 fires occurred nationwide between 1997 and 2018. The trend is accelerating: over 24,000 incidents were reported in 2022, jumping to more than 26,600 by 2024. Over the past two decades, fires have claimed nearly 2,650 lives and left more than 13,000 injured.\nIn recent times, three massive fires in Dhaka and Chattogram have caused loss of life and billions of dollars, starkly revealing persistent shortcomings in safety standards, infrastructure maintenance, and emergency preparedness. However, climate shifts may also have a major role in fire hazards, as seen in other countries.\nRising global temperatures, caused by human-driven greenhouse gas emissions, have increased the risk of wildfires worldwide, as evidenced by the record-breaking US fires of 2017–2018 and in 2024–2025. Experts warn that extreme heat, prolonged droughts, and erratic rainfall will increasingly contribute to large fires across the globe, adding to the risks from poor maintenance and regulatory failures.\nIn January 2025, unusually severe fires swept Los Angeles, fueled by dry conditions and powerful Santa Ana winds. The deadly wildfires were twice as likely and burned an area 25 times bigger than they would have in a world without global warming. Reports suggested that over 50,000 acres burned and around 16,000 structures were damaged, forcing authorities to advise more than 180,000 people to evacuate.\nThe same erratic pattern has made summer blazes in southeastern Europe up to ten times more likely. Between March 2024 and February 2025 alone, more than 3.7 million square kilometres of land—an area larger than India—went up in flames. Over 100 million people were affected, with homes and infrastructure worth $215 billion at risk.\nClimate scientists from World Weather Attribution at Imperial College London say climate change—through reduced rainfall, parched vegetation, and extreme winds—intensified both the severity and likelihood of these fires in the US and Europe.\nAccording to experts, dry weather and dusty winds heighten fire risks by creating highly flammable conditions. Low humidity and parched fuels, combined with strong winds, significantly increase the likelihood and rapid spread of fires, often prompting high fire danger alerts.\nThe May 2025 fires in central Israel were intensified by prolonged heat, drought, and strong winds, which fuelled the rapid spread of fire. Officials linked the extreme conditions to broader climate change trends, showing how firefighting efforts were stretched beyond capacity.\nIn October 2025, the National Weather Service issued a Red Flag Warning as strong winds of 60 mph and critically low humidity drove high fire risk across Colorado's Eastern Plains and Front Range, recalling the deadly East Troublesome Fire in October 2020.\nA recent study published in Nature Cities reveals that rising temperatures could heighten urban fire risks across 2,847 cities in 20 countries, including the US, UK, Australia, New Zealand, and China, threatening buildings, vehicles, and outdoor spaces. Drawing on historical records and Intergovernmental Panel on Climate Change (IPCC) climate scenarios, the research finds that each one-degree Celsius increase in temperature drives a 4.7 percent rise in outdoor fires and a 2.5 percent rise in vehicle fires. High-emission warming can potentially boost outdoor fires and vehicle fires by 22 percent and 11 percent, respectively, by the year 2100.\nUrban areas are particularly vulnerable, as hotter, drier weather directly fuels faster-spreading fires, overwhelming emergency services and threatening infrastructure.\nPollution, urban heat from rapid urbanisation, poor infrastructure, and regulatory gaps are all fuelling more frequent and intense fires, as trapped atmospheric heat raises temperatures, disrupts weather patterns, and worsens drought conditions.\nIn Bangladesh, experts link the higher pollution levels in Dhaka and Chattogram to their dense concentration of industries, commercial hubs, and employment opportunities. As the country's main economic centres, both cities suffer from severe air pollution caused by industrial emissions, traffic, construction, household fuel use, and open-air waste burning.\nThe growing influence of major climatic shifts on urban environments necessitates a focused investigation into the rising incidence of devastating fires across Bangladesh, especially in key cities such as Dhaka and Chattogram. Consequently, a proactive and interdisciplinary approach, merging rigorous scientific analysis with robust policy frameworks, is crucial to understanding these complex dynamics and mitigating the risk of future large-scale emergencies.\nAbdul Kader Mohiuddin is an alumnus of the Faculty of Pharmacy at Dhaka University.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Is climate change intensifying fires in Bangladesh?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/climate-change-intensifying-fires-bangladesh-4037281",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-11-2025"
    },
    {
        "full_article": "It is frustrating that despite the promises of last year's July uprising, where women played a key role, they continue to be systematically sidelined from political power. Over the past year, their participation has also declined across various sectors. A recent discussion organised by a newly formed platform called Women in Democracy has again highlighted this troubling reality. Sadly, the July National Charter has also failed to address women's rights or their political participation in a meaningful way.\nPatriarchal dominance has, in fact, intensified since 2024, as speakers at the event noted. Harassment of women in public and digital spaces has reportedly increased, but political parties have shown little interest in taking up this cause. Women who entered politics after the uprising also face an increasingly hostile environment, ranging from cyberbullying to social pressure. This is most evident in the ongoing debate over women's parliamentary representation. The Election Reform Commission had proposed 100 reserved seats filled through rotation-based direct elections, a system that could have given women genuine democratic legitimacy. However, the National Consensus Commission rejected this proposal, and the July National Charter retained only 50 reserved seats (gradually increasing to 100), mandating that parties nominate just five percent women in general seats (rising to 33 percent by 2043). When women constitute half of the population, can offering them only five percent representation in parliament truly be considered democratic?\nUnfortunately, our political parties seem to remain largely indifferent to women's political participation. The BNP's nomination of only ten female candidates, including its Chairperson Khaleda Zia, for the upcoming national election is a case in point. Reports also suggest that no party has taken meaningful steps to end the long-standing suppression of women activists and leaders within their internal structures.\nDirect elections are crucial because they grant women independence, visibility, and legitimacy, none of which symbolic quotas can deliver. At the national conference of the Forum for Women's Political Rights (FWPR) held on October 9, activists rightly demanded that all political parties be legally required to nominate at least 33 percent female candidates, gradually rising to 50 percent, through amendments to the Representation of the People Order (RPO). Because without binding legislation, parties will continue to prioritise rhetoric over real change.\nThe July uprising ignited hopes among people to end exclusion, discrimination, and undemocratic practices. Yet the reforms enacted since then have fallen short of creating the inclusive democratic culture that people demanded. We urge all political parties, particularly major ones like the BNP, to include more women in decision-making positions. Unless women's participation within parties and their representation in parliament increase significantly, meaningful change in our political culture will remain elusive.\n",
        "headline_1": "We need more women in politics",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/news/we-need-more-women-politics-4036456",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-11-2025"
    },
    {
        "full_article": "We condemn the recent spate of violence seemingly orchestrated as part of Awami League's \"Dhaka lockdown\" and nationwide \"shutdown\" programmes, in reaction to the International Crimes Tribunal's announcement of the verdict date in a case against Sheikh Hasina. In five days since Tuesday, more than 30 arson attacks—mostly targeting buses—and crude bomb blasts took place, with two deaths reported. Comments made by members of the AL on social media, alluding to the \"success\" of the programmes, indicate that the party has been involved in instigating these vicious acts. A driver was burnt alive and a passenger severely injured when a parked bus was set on fire in Mymensingh on Tuesday. Such acts are deplorable, suggesting that the AL, far from being repentant for its horrific role in the killing of over 1,400 people during the mass uprising, continues on a path of creating fear among citizens.\nThe violence has persisted, with several crude bombs detonated in Dhaka on Saturday, alongside arson attacks in three districts. According to a news report, police have arrested four activists of the AL and its affiliated bodies for allegedly engaging in these violent acts. Although law enforcement agencies are on high alert, with the government beefing up security in various locations, there is apprehension that further violence may occur following Monday's verdict in the case against Sheikh Hasina on charges of crimes against humanity.\n\nWhile the absconding leaders of the AL, whose political activities have been banned, appear to be instigating the violence through their supporters, other factors have also increased the likelihood of violence ahead of the national elections. A report in this daily revealed how leaders of the underworld, either recently released from prison or returning from abroad, have become very active, resulting in the recent spate of killings, extortion, and armed clashes in general. Most concerning is that police have received intelligence suggesting that underworld gangs could be hired as \"muscle\" during the elections to intimidate voters and attack rival campaigners. The possibility that the AL may also employ these criminals to create chaos during the elections cannot be ruled out.\nIt is disturbing to note that several notorious criminals have been released from jails since the uprising, while others have dared to return from abroad to resume their activities and \"reclaim territory.\" More than 1,300 firearms were looted from police stations during the uprising, many still unaccounted for. In addition, there has been a reported increase in illegal firearms entering the country through various border areas.\n\nThe government must, therefore, act swiftly to re-arrest identified criminals, initiate targeted operations to recover illegal firearms, and stop their influx across border points. Unless urgent steps are taken, violent crimes will continue, and the situation will become increasingly difficult to control.\n",
        "headline_1": "Stop the surge of violence urgently",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/stop-the-surge-violence-urgently-4036186",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-11-2025"
    },
    {
        "full_article": "There is, perhaps, no starker example of discrimination in Bangladesh than the treatment of its Harijan community. Two hundred years after the British brought them to this land to work as sweepers, we shockingly continue to treat them no better. According to a report in this daily, around 200 Harijans live in damp 10-by-12-foot rooms at the Harijan Colony in Kulaura Upazila, Moulvibazar with their families of five to six people. And although that alone paints an unliveable picture, it barely scratches the surface.\nAcross the country, Harijan people, who spend hours cleaning our cities and municipalities, have been reduced to living lives that would be intolerable in any civilised society. Take, for instance, Rekha Basfor of Sreemangal in Moulvibazar. She leaves for work in the morning after drinking only a glass of water. She cannot afford even the simplest breakfast, as a bun and half a cup of tea cost about Tk 15, while her daily wage is only Tk 33. For her family, she often cooks nothing more than rice and, occasionally, mashed potatoes. Fish and meat are never part of their meals except on rare special occasions, when she manages to gather a little extra money. Reportedly, this \"extra income\" often refers to earnings from drug peddling, as many are being forced into the trade simply to cope with rising living costs.\nAccording to the Bangladesh Harijan Oikkya Parishad, the lowest monthly municipal salaries are alarmingly inadequate: Shariatpur pays Tk 3,000; Madaripur Tk 2,000; Kumarkhali Tk 1,800; Rajbari Tk 2,300; Akhaura Tk 1,500; Kushtia Tk 2,700; Natore Tk 2,100; Bogura Tk 3,300; and Santahar Tk 1,200; Sylhet City Corporation Tk 3,200 (up from Tk 2,200 last July), Sreemangal Tk 1,000 (previously Tk 550), while Kulaura provides the highest rate at Tk 3,800. Despite the variations, what remains glaringly obvious is that none of these amounts constitutes a living wage.\nOn top of this, the discrimination Harijan children face at school, where other students refuse to sit beside them, and in hospitals, where doctors decline to examine them properly, considering them somehow \"contaminated,\" should shame not the Harijan community but us, as a society. This prejudice is also evident in how we expect them to do their work. According to the book Study on the Wages of Urban Cleaners, published by Nagorik Uddog in January this year, 75 percent of workers do not receive protective equipment, and only eight percent have access to healthcare.\nThere are even more damning data illustrating how thoroughly we have failed the Harijan community. It is high time that the government—and society at large—focused on transforming the conditions in which the Harijan community is forced to live a life of continuous deprivation and struggle.\n",
        "headline_1": "A civilised society cannot allow this",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/civilised-society-cannot-allow-4035666",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-11-2025"
    },
    {
        "full_article": "Bangladesh Railway (BR) continues to bleed financially and fail its passengers despite years of heavy investment. According to a recent Bonik Barta report, the government currently spends over Tk 4,000 crore annually on railway operations, with much of it directed towards maintenance, cleaning, and on-board services. Yet, passengers have seen little return from this investment, as complaints about dirty trains and stations, irregular schedules, ticket black marketeering, and technical failures persist. What's more baffling is that investment in the rail sector has increased significantly over the last 10 to 15 years, yet neither its services nor its profits have improved much.\nIn the fiscal year 2023-24, the Ministry of Railways was allocated a total of Tk 19,010.69 crore, including both operating and development expenditure. BR's income fell to Tk 1,845 crore in FY2024-2025—down 4.15 percent from the previous year—marking its first post-pandemic negative growth. While revenues rose slightly in the first quarter of FY2025-26, losses are projected to exceed Tk 1,574 crore for the fiscal year.\n\nMeanwhile, even at the busiest station of the country in the capital's Kamalapur, there are still not enough toilets, waiting rooms, or functioning fans. Existing facilities are unhygienic, and many passengers have little choice but to wait on crowded platforms. Similar conditions exist at regional stations. Inside trains, passengers face broken seats, unclean toilets, and overcrowded compartments, often filled with \"standing\" and ticketless commuters beyond official capacity. Frequent derailments and incidents of coaches detaching mid-journey indicate a serious lapse in maintenance. Such conditions contradict the official claim that the purpose of increased operating expenditure is to improve passenger service.\nExperts attribute the failures to inefficiency and lack of accountability. The railways ministry's adviser further admitted that the maintenance system \"is not functioning properly\" and that many of the workshops lack the required technical standards. Although the ministry claims to have reduced the operating ratio from 2.4 to 1.8, the improvement has not translated into visible benefits for passengers. Furthermore, cases of wasteful procurement, including non-operational track machines and defective train models, have been reported in recent years. These incidents point to a pattern of project design driven more by bureaucratic and procurement interests than by service needs.\n\nTo address these issues, BR must move beyond ad-hoc spending and prioritise structural reforms. Regular technical audits, transparent procurement, and independent monitoring of ongoing projects are essential. Resources should be directed towards maintenance, safety upgrades, and passenger facilities rather than ill-conceived projects. Without strict accountability and long-term planning, even large budget allocations will continue to yield little improvement in railway service or its financial performance.\n",
        "headline_1": "Bangladesh Railway’s service woes persist",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/bangladesh-railways-service-woes-persist-4035521",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 19, 2025 00:00:00  \nThe customs bond facility allows export-oriented industries to import raw materials and intermediate goods duty-free. The condition is that the raw materials and intermediate goods thus imported have to be stored in bonded warehouses and not diverted to the domestic market and that the goods made from them should be exported. But allegations about misuse of the facility abound. Though there has been a fully automated Customs Bond Management System (CBMS) in place since long to benefit exporters by way of enhancing transparency and efficiency in the use of bond-related facility, yet few of the stakeholders have so far used the automated option to obtain online utility permission (UP) from the customs office. Small wonder that harassment, irregularities and illegal transactions in bond-related activities continue, causing genuine exporters to suffer. Clearly, the persisting option of approving UP manually lies at the heart of the mismatch. To get around this problem, the chairman of the National Board of Revenue (NBR) at a recent meeting with the leaders of the garments, knitwear, accessories, textiles and leather-goods sectors is learnt to have finally declared that from December 1 the use of the automated CBMS would be mandatory in view of streamlining the duty-free import of raw materials under the bonded warehouse regime. \nBut questions arise as to why the automated Customs Bond Management System (CBMS) remained underutilised for some 10 months into the launch? Why did most users of the bonded warehouse facility fail to obtain automated UP to conduct their business? It is good to hear, in this connection, that henceforth no paperwork would be entertained and that 100 per cent of the work would be automated. The aggrieved exporters mainly from the apparel sector, on the other hand, have been appreciative of the advantages of the online CBMS with the assurance that abusers of the system would be punished, while those complying with it would be protected. Disputes related to bond operations, it is stressed, would be significantly reduced as CBMS has automated and made record-keeping transparent. Understandably, to avoid embarrassment for many in the business, the demand from the export sector leaders that names of those misusing the bonds should be published remained unaddressed. So far so good. It would indeed be a step forward for the export sector if the bonded warehouse facility is properly utilised after the revenue board's positive move aimed at making the system mandatory from next month. It is believed, CBMS would get the necessary momentum once the tax regulatory authority makes the provision official through issuing a directive.\nIt would be worthwhile to note at this point that the inordinate delay in making the customs bond automation operational had a lot to do with the complexities of maintaining bond licence. Business leaders' emphatically pronounced stance at the meeting that for a few abusers of the bonded warehouse facility, the entire exporters' community cannot be blamed, is well appreciated. In this connection, seeing that many of the business houses are without bond licences, while others would like to surrender their licences to avoid complexities, the authorities would do well to allow them to import raw materials and intermediary goods under bank guarantee. That would help ease compliance and reduce irregularities. \nSince the lack of compliance as well as the apathy of many entrepreneurs in the sector to use the automated bond management system has a lot to do with the discretionary powers in the tax regulator's hand, for instance, regarding imposition of taxes or exemption of the same, the suggestion for vesting such powers in an elected parliament is welcome. It is hoped, the interim government would also look into this aspect of the mandatory automated CBMS.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Implementing mandatory customs bond automation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/implementing-mandatory-customs-bond-automation-1763479928",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       November 19, 2025 00:00:00  \nAs delegates began to gather in Belém, deep in the heart of the Brazilian Amazon, for the COP30 climate summit, reports published in the Global Carbon Budget landed like a thunderclap-reminding the world that rhetoric has far outpaced action. The report, released last week, warns that global fossil fuel emissions are on track to hit a record high in 2025, dashing hopes of keeping global warming below the critical threshold of 1.5°c above pre-industrial level.\nAccording to the international team of scientists behind the study, emissions from oil, gas and coal are all set to rise, pushing total carbon dioxide emissions to an unprecedented 38.1 billion tonnes in 2025-1.1 per cent higher than the previous year. This relentless upward trajectory comes despite the largest-ever global expansion of renewable energy. The reason, the researchers note, is that the world's growing energy demand continues to outpace the transition to cleaner sources.\nThe findings of the study paint a grim picture. The report calculates that humanity has just 170 billion tonnes of CO? left to emit before surpassing the carbon budget that would keep global warming under 1.5°c above pre-industrial levels-the target enshrined in the 2015 Paris Agreement. At the current rate of emissions, that allowance will be exhausted in merely four years. \"That is impossible, essentially,\" said Pierre Friedlingstein of Britain's Exeter University, who led the study. The implication is stark, as he has been quoted as saying, \"the world has missed its narrow window to limit warming to 1.5°c, and even holding it below 2°c-a weaker but still vital goal-will demand far deeper and faster cuts than any nation has so far committed to.\"\nThe sense of urgency is palpable at COP30, hosted for the first time in the Amazon, a region that symbolises both the planet's ecological richness and its vulnerability. The location is not incidental: the Amazon rainforest, often called the \"lungs of the Earth,\" is under mounting pressure from deforestation, fires, and climate-induced droughts. Its health is inextricably linked to the global carbon cycle and scientists warn that continued degradation could 'tip it from being a carbon sink to a carbon source'-further accelerating warming.\nYet, amid the pressing need for collective action, the summit has been marked by notable absences. The United States, the world's second-largest emitter, is not participating, leaving a conspicuous void in global climate diplomacy. The absence underscores a recurring challenge in international climate negotiations: major emitters pledging ambitious targets but falling short on tangible delivery.\nThe report lays bare the gap between ambition and reality. Although renewable energy capacity-particularly solar and wind-has surged to record levels, global dependence on fossil fuels remains entrenched. Many developing nations, grappling with post-pandemic economic recovery and rising energy needs, continue to expand fossil-based power generation. Meanwhile, oil demand has rebounded strongly, driven by transportation and industrial sectors in both advanced and emerging economies.\n\"Collectively, the world is not delivering,\" lamented Glen Peters of the CICERO Centre for International Climate Research, one of the report's co-authors. His comment captures the underlying frustration among climate scientists who have watched decades of warnings translated into only incremental policy shifts.\n The implications of inaction are no longer theoretical. With 2025 projected to be among the hottest years on record, the physical manifestations of climate change-extreme heatwaves, megafires, superstorms, and rising sea levels-are becoming more frequent and severer. For the millions living in vulnerable regions, particularly across the Global South, this trajectory threatens to undo decades of development and amplify humanitarian crises.\nThe political backdrop of COP30 is equally fraught. While the Paris Agreement succeeded in creating a framework for global cooperation, its voluntary Nationally Determined Contributions (NDCs) have proven insufficient. Few countries are on track to meet their own targets, let alone the collective global goal. Wealthier nations have also failed to fully deliver the long-promised $100 billion per year in climate finance to help poorer countries mitigate the impacts of climate change-a point of growing contention in international talks.\nFor Brazil, the host nation, COP30 is a chance to showcase renewed environmental leadership under President Luiz Inácio Lula da Silva, who has pledged to curb deforestation and restore the Amazon's ecological balance.\nAs the summit unfolds, the message from the scientific community is unequivocal: to have any hope of steering the planet away from catastrophic warming, global emissions must begin to decline not in the distant future, but within the next few years. That means phasing out coal, rapidly electrifying transport, scaling up carbon capture technologies, and rethinking patterns of consumption and growth that hinge on fossil energy.\n The COP30 thus stands as both a warning and a test. It is a warning that humanity is perilously close to crossing the planet's vital temperature threshold, and a test of whether political leaders can muster the courage to transform that warning into action. If the world continues along its current path, the 1.5°c dream will soon be consigned to history-and with it, the promise of a stable, livable climate for generations to come.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Grim warning at COP30: Record high CO2 emission",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/grim-warning-at-cop30-record-high-co2-emission-1763479963",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 19, 2025 00:00:00  \n\nStarting 16 December 2025, Bangladesh will fully enforce the National Equipment Identity Register (NEIR), blocking all unauthorised, smuggled, cloned, or unregistered mobile phones from accessing telecom networks. Each device's IMEI will be matched with the user's NID and SIM registration. Phones already in use will be auto-registered, with the main impact falling on new or illegally imported handsets. The government aims to curb an illegal handset market estimated at 40 per cent of total sales and recover Tk 500-2,000 crore in lost revenue. The domestic mobile manufacturing and assembly industry is expected to benefit from improved demand as grey-market competition shrinks. NEIR is also anticipated to reduce digital fraud, with 73 per cent of mobile financial scams reportedly involving illegal or unregistered devices.\nRetailers and grey-market traders face the risk of unsellable inventory, financial losses and potential customer backlash. Consumers must verify their device IMEIs by sending an SMS (KYD <space> IMEI ? 16002), and foreign-bought phones must be registered on the NEIR portal to avoid network denial. Local manufacturers are likely to see increased demand and will need to scale production. Tax and customs authorities can expect reduced duty evasion but will require strong coordination to enforce the system effectively. Telecom operators will need robust mechanisms to check device legality.\nThe rollout of NEIR is expected to stabilise or even lower legal handset prices as grey-market supply declines. Illegally imported used phones may lose value, affecting the second-hand market, while importers relying on informal channels will have to transition to formal, duty-paid systems. Overall, the NEIR rollout marks a major transformation in Bangladesh's handset ecosystem, aiming to improve government revenue, reduce fraud, and strengthen local manufacturing while shifting the market from grey-market dominance to fully legal and traceable supply chains.\nNirjona Hossain \nNorth South University\nBBA department\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Crackdown on illegal phones to benefit local industry",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/crackdown-on-illegal-phones-to-benefit-local-industry-1763479989",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 19, 2025 00:00:00  \n\nThe grave allegations against Professor Ershad Halim of the Department of Chemistry at the University of Dhaka have shaken the very foundations of the education system. Students of the department have filed a case, and the police have arrested the accused professor-an important initial step towards justice. Yet the main concern remains ensuring a fair, transparent and uncompromising investigation into these allegations. The experiences described by the victims-sexual abuse, rape, psychological torment and physical harassment-are not merely unacceptable; they constitute serious crimes and a direct assault on human dignity.\nAnyone found guilty of perpetrating such horrific acts against students must face the strictest punishment. Exemplary and decisive justice is essential to send a clear message and prevent future abuses of authority within academic institutions.\nAuthorities must prioritise the safety and psychological well-being of the victims. Their identities must be protected, counselling support provided and proper legal assistance ensured throughout the proceedings. Simultaneously, strengthening the university's sexual harassment prevention cell and empowering it with real authority is an urgent necessity.\nThe administrative structure of the university must foster an environment where students can file complaints without fear, intimidation, or institutional pressure. Teacher recruitment and promotion processes also require stricter ethical and behavioral screening to prevent individuals with abusive tendencies from holding positions of trust.\nA campus must be created where every student can pursue education free from fear, exploitation and coercion-especially from those entrusted to guide and protect them. Justice must prevail and justice must be visible.\nNusrat Rusha\nStudent \nDhaka University\nnusrat135474@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ensure justice in DU sexual abuse case",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ensure-justice-in-du-sexual-abuse-case-1763480010",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-11-2025"
    }
]