[
    {
        "full_article": "At the 10th edition of the Raisina Dialogue, visiting New Zealand Prime Minister Christopher Luxon — the conference’s chief guest — outlined three major geopolitical shifts shaping the world: the replacement of rules with power, the rise of security over economic considerations, and a move from trade efficiency to protectionism and resilient supply chains among trusted partners. In this context, Mr. Luxon suggested that India and New Zealand, despite their size disparity, could be ideal partners. Both democracies share an interest in ensuring freedom of navigation in the Indo-Pacific. While New Zealand is not part of the Quad (Australia, India, Japan, the United States) and does not seek membership, Mr. Luxon noted the ongoing dialogue among New Zealand, Australia, Japan and South Korea on regional issues. Following talks with Prime Minister Narendra Modi, the two countries signed a defence Memorandum of Understanding (MoU) to enhance military cooperation, staff college exchanges, and naval port calls. They also agreed to restart talks on a free trade agreement, aiming to expand their modest bilateral trade, currently under $2 billion. However, challenges remain, particularly around market access for dairy and agricultural products, which contributed to India’s decision to exit the Regional Comprehensive Economic Partnership (RCEP), of which New Zealand is a member. In contrast, New Zealand’s trade with China stands at approximately $24 billion, despite broader strategic concerns. Connectivity between the two nations received a boost, with Air India and Air New Zealand signing a codeshare agreement that may also lead to the first direct flights between the countries by the end of 2028.Despite the positive tone, Mr. Modi voiced concern over “anti-India activities by certain illegal elements” in New Zealand, referencing protests and a Khalistan referendum held by the ‘Sikhs for Justice’ group in Auckland last November. Although previously discussed between the Foreign Ministers, New Zealand police had ruled the protests to be lawful. In response, Mr. Luxon reaffirmed New Zealand’s commitment to free expression and noted the importance of not importing foreign political conflicts into its diverse immigrant communities. While such concerns are legitimate, raising them publicly risks deepening divisions within the 3,00,000-strong Indian diaspora and overshadowing growing strategic and economic ties. These sensitive issues may be better handled through diplomatic engagement in private. Ultimately, India and New Zealand stand to benefit from greater collaboration — particularly in trade, defence, and regional stability — as two democracies that “book-end” the Indo-Pacific. Published - March 22, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        diplomacy\n                    \n                            /                      \n                        \n                        New Zealand\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        Japan\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        South Korea\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        defence\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        immigration\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        democracy",
        "headline_1": "​Navigating differences: On India-New Zealand ties",
        "headline_2": "India and New Zealand stand to benefit from greater collaboration",
        "link": "https://www.thehindu.com/opinion/editorial/navigating-differences-on-india-new-zealand-ties/article69358263.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "23-03-2025"
    },
    {
        "full_article": "Summer has arrived early in several parts of India. In the last week of February, heatwaves were officially reported in Goa and Maharashtra. States such as Odisha, Telangana, and Maharashtra have already recorded temperatures exceeding 40°C. Throughout most of February, 31 States and Union Territories experienced night temperatures at least 1°C above normal, with 22 States and Union Territories reporting night temperatures that were 3°C to 5°C above normal. Given that February is classified as ‘winter’ by the India Meteorological Department, these are signposts that point toward new climate normals. Scientists have long warned that rising global temperatures — both on land and sea — will result in more intense and frequent heatwaves. This underscores the need for countries and States to prepare for heat events just as they do for earthquakes or floods. However, a recent study by the Sustainable Futures Collaborative, which examined heat-related preparedness in nine Indian cities, found that none had long-term plans in place. Most responses are limited to short-term emergency measures such as providing drinking water, adjusting work hours, and boosting hospital capacity during heatwaves. Crucial long-term interventions such as ensuring access to household or occupational cooling for vulnerable populations, insuring workers against lost income on extremely hot days, improving fire management, and upgrading electricity grids for reliability are missing. Few cities have even begun planning for expanded local weather monitoring, mapping urban heat islands, or training those responsible for implementing heat plans. Other strategies, which include increasing green cover, creating open spaces to reduce heat, and deploying rooftop solar for active cooling, are often carried out without targeting the populations that are most at risk.While global efforts to combat climate change largely focus on cutting greenhouse gas emissions, the limited progress on that front is shifting attention to adaptation — particularly in managing responses to heat. Affordable cooling devices are frequently recommended, but they raise concerns about increased use of ozone-depleting refrigerants. Experts now advocate having sustainable buildings, green infrastructure, and passive cooling solutions, although these too can impact land prices and urban planning. India must develop a comprehensive national heat strategy and embed it within its National Adaptation Plan ahead of the 30th UN Climate Change Conference (COP30) in Brazil in November. Published - March 22, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        weather\n                    \n                            /                      \n                        \n                        heatwave\n                    \n                            /                      \n                        \n                        Goa\n                    \n                            /                      \n                        \n                        Maharashtra\n                    \n                            /                      \n                        \n                        Orissa\n                    \n                            /                      \n                        \n                        Telangana\n                    \n                            /                      \n                        \n                        oceans\n                    \n                            /                      \n                        \n                        drinking water\n                    \n                            /                      \n                        \n                        hospital and clinic\n                    \n                            /                      \n                        \n                        population\n                    \n                            /                      \n                        \n                        fire\n                    \n                            /                      \n                        \n                        solar\n                    \n                            /                      \n                        \n                        greenhouse gases\n                    \n                            /                      \n                        \n                        carbon emissions\n                    \n                            /                      \n                        \n                        Sustainability\n                    \n                            /                      \n                        \n                        United Nations (climate change)\n                    \n                            /                      \n                        \n                        Brazil\n                    \n                            /                      \n                        \n                        insurance",
        "headline_1": "​Heat plan: On Indian cities and heat-related preparedness",
        "headline_2": "India must develop a comprehensive heat strategy ahead of COP30",
        "link": "https://www.thehindu.com/opinion/editorial/heat-plan-on-indian-cities-and-heat-related-preparedness/article69358310.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "23-03-2025"
    },
    {
        "full_article": "A loose global alliance that hates eggheads & loves ‘tradition’\nSix authors (Rita Abrahamsen, Jean-Francois Drolet, Michael C Williams, Srdjan Vucetic, Karin Narita and Alexandra Gheciu) set out to understand today’s most dominant political idea globally. The result is World of the Right: Radical Conservatism and Global Order, a book nine years in the making.\nSome of the analyses, though rooted in events in the last decade, help make sense of current news. When the authors talk of Steve Bannon’s 2017 declaration that a Trump 1.0 goal was “to deconstruct the administrative state”, DOGE pops into mind. When they explain New Right’s global alliance in defence of the “natural family” the logic behind Trump 2.0’s crackdown on DEI is clearer.\nWhat drives New Right? Disdain for experts and anti-intellectualism. It promotes a vague anti-elite discourse that includes praise for ‘tradition’. Its main enemy, of course, is Liberal International Order, LIO, which is pro-globalisation & liberalisation. New Right wants to capture universities, publishers and think tanks, LIO haunts thus far.\nLeftwing politics couldn’t build an internationalism, the book says, but its failure gave rise to a radical global Right, interconnected via a “distinct international dimension to their nationalist populist agendas”. Appearances at global meets are critical for New Right politicians, especially those marginalised in home countries. CPAC conferences, in 1970s, were small meetings of American conservatives. That idea is now everywhere from Australia to Japan, South Korea to Latin America, and also Europe.\nWho goes to these conferences? Bolsonaro, Milei, Orban, Farage, Bannon, Ted Cruz, Tucker Carlson, Ben Shapiro…In 2022, Vance attended Israel’s first CPAC. Japan CPAC “pledged support…within Quad” via an “Asia Pacific Conservative Union”. An AfriForum represents White Afrikaner minority in South Africa. A Madrid Charter seeks Iberosphere: a pan-Hispanic trans-Atlantic identity of Catholic faith. New Right strenuously displays closeness with Netanyahu, the book says, to shelter from accusations of anti-semitism.\nNew Right leaders revel in demonstrating friendships in highly mediatised spectacles – hugs & clasped hands. There isn’t unity, but commonality, which generates “energy and commitment”. So, different, but not disconnected.\nConservatism isn’t a school of thought. So New Right thinkers borrow. Marxist egghead Gramsci has been, the authors show, effectively appropriated. New Right reckons it’s a counter-hegemonic struggle against liberal thought, aka Elite Power. It poses as a pal of “forgotten working classes”. It mobilises groups marginalised by national/international processes of globalisation – economic dislocation, inequality and cultural resentment. This is the Common Cause.\nVagueness is a precondition to building political meaning, articulated in common language of tradition, people, nation, civilisation – similar struggles, different contexts. New Right’s free from Left’s anti-capitalism but it isn’t anti-elite. It wants to create a new elite in its own image.\nLIO’s “managerial elite” is the class of experts and bureaucrats in multilateral organisations – guys who oversee rules-based international order. A class unmoored from cultures, argues New Right, and interested in more globalisation and liberalisation. Therefore, the “struggle” to overturn the “woke-industrial complex”.\nThe book devotes a lot of pages to New Right’s battle against “transformation of culture”. This is code for the modern language of rights: disability, LGBTQ, right to choose, right to die, etc. Rights are seen as destroying cultural distinctiveness. New Right would rather legitimise new forms of exclusion.\nJust like radical chic Left, the personal is political – but for New Right, also geopolitical.\n\n",
        "headline_1": "What’s new about the newly powerful right?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/whats-new-about-the-newly-powerful-right/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-03-2025"
    },
    {
        "full_article": "Why case of HC judge under probe has big implications \nSC moved swiftly in connection with the cash hoard police found at Delhi HC judge Yashwant Varma’s bungalow on Holi. Varma is second in seniority among Delhi HC’s judges, and SC has proposed his repatriation to Allahabad HC. Although, in a press note issued on Friday, it delinked the transfer from the case: “The proposal to transfer…is separate from the in-house inquiry procedure.”\nAs for inquiries, the first by Delhi HC’s chief justice is over and its report has reached CJI Khanna, who may take a call on it on Saturday. If the report supports the allegations, Justice Varma may be asked to resign, or face an inquiry panel.\nThe importance of this case cannot be overstated because, at a time people’s faith in other institutions of governance has eroded, judiciary needs to look squeaky clean. Over the decades, skeletons have occasionally tumbled out of the judicial closet. Calcutta HC judge Soumitra Sen quit midway through the debate on removal motion in Parliament. The charge was misappropriation of funds. Delhi HC judge Shamit Mukherjee quit after he was accused of accepting bribes, and more. Sikkim HC chief justice PD Dinakaran also resigned following allegations of corruption.\nThen there was the cash-at-door case against Punjab & Haryana HC judge Nirmal Yadav. The case blew up after a sum of 15L was wrongly delivered to the house of her namesake, Justice Nirmaljit Kaur, in 2008. Now, as SC probes the cash at Justice Varma’s residence, it should bear in mind the course of this 17-year-old case. In 2009, SC Collegium gave Justice Yadav a clean chit. She was transferred to Uttarakhand HC, where she retired in March 2011. But CBI chargesheeted her on her last day in service, and the case is still on. Justice Yadav’s innocence has not been established. That’s why transferring without exonerating is a bad idea.\n\n",
        "headline_1": "Judging it right",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/judging-it-right/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-03-2025"
    },
    {
        "full_article": "A Husain fetches millions. So does a banana. Go figure\nThe relationship between art and money? It’s complicated. Insofar as the idea of starving artists is alive and well, so is that of art having value above and beyond money. But the way every auction record is celebrated, suggests the money art fetches is its true KRA. Some cases, like that of Husain, are extra complicated by extracurricular issues, legal to political. Now, with a 1954 canvas fetching $13.8mn, his work has set a new record for Indian art. It’s possible this headline will get his work more audience than all the galleries combined.\nAndy Warhol, who called his studio The Factory, also famously said good business is the best art. That isn’t supposed to be taken at face value, anymore than his Campbell’s soup cans are just soup cans. Pundits said those cans were an ambivalent critique of capitalism and consumer culture. In Husain canvases, pundits find anthropomorphisation of modern India, its icons and ordinary persons and everyday scenes.\nBut really, some of this punditry is too much of a muchness. Like the duct-taped banana from Art Basel Miami Beach that rang in at $6.2mn last year. Or the algorithmically generated rendering of code, The Goose, that rang in the same at Sotheby’s in 2023. Sometimes it all seems like richie rich pranksters getting high together. But then, is the fault not in our artist stars but ourselves? Why do we look at the price tag before we see the canvas?\n\n",
        "headline_1": "What price art?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/what-price-art/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-03-2025"
    },
    {
        "full_article": "He has cast himself as hero of southern resistance against delimitation & NEP for a bigger reason: like dad Karunanidhi, he wants to be opposition frontman nationally\nThere will be a sense of déjà vu when chief ministers of the southern states (or their deputies) meet in Chennai on March 22. As they devise strategies to oppose the Union govt plan to increase Lok Sabha seats, it’s not just the delimitation debate that’s making history repeat itself. Leadership is doing the same.\n\nTaking the lead in rallying opposition parties – and reaching out to even the BJP govt in Odisha, a relatively small state that could be disadvantaged by delimitation – Tamil Nadu chief minister MK Stalin is following in the footsteps of his father, as a statesman bringing together regional powers for a common cause.\nRead the full story on TOI+.\n\n",
        "headline_1": "Stalin is now all-in",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/stalin-is-now-all-in/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-03-2025"
    },
    {
        "full_article": "We are alarmed by the rapid decline in groundwater levels across the country, particularly in Dhaka, Gazipur, and the Barind region, due to excessive extraction. According to reports, residents on the city's outskirts are facing acute shortages of fresh water, primarily due to WASA's ineffective management of groundwater. The crisis is particularly severe in areas like Vakurta, Baherchar, Battoli Bazar, Balughata, and Bauta, where numerous pumps installed by WASA about a decade ago have contributed to the depletion of groundwater. As a result, around 20,000 hand-operated tube wells have dried up entirely. Residents of these areas now struggle to access water, with their tube wells yielding water only during the rainy season and remaining dry throughout the rest of the year.\nThe rapid decline in groundwater levels, however, is not confined to the above-mentioned areas—it has impacted numerous other regions across the country, making crop cultivation increasingly challenging. Clearly, this situation has arisen due to our excessive reliance on groundwater and the lack of attention to alternative water sources. A 2022 study analysed 40 years of data from 465 shallow groundwater monitoring wells of the Bangladesh Water Development Board. It examined groundwater usage and levels during the dry season and revealed that due to extensive water usage, the groundwater level in two-thirds of the country is declining. In many areas, including Dhaka, the groundwater levels have fallen by an average of one to three meters.\nFor instance, groundwater levels in Godagari, Rajshahi, which were previously recharged to 16-18 meters during the rainy season in the 1980s, have not surpassed 16 meters since 2010. Due to a lack of water, the Barind Multipurpose Development Authority (BMDA) has limited Boro rice cultivation this year in eight upazilas across three districts of the Barind region—Rajshahi, Chapainawabganj, and Naogaon. In Kaliganj, Gazipur, the groundwater recharge levels have dropped from 6 meters in 1990 to 3 meters since 2015. In Dohar, Dhaka, recharge decreased from 4 meters to 3 meters by 2015.\nThe question is, what can the government do now to recharge the groundwater levels across the country, especially in the capital, where 70 percent of the water supply comes from underground sources? Our water experts provided solutions long ago: minimise groundwater extraction and utilise water from nearby rivers instead. Unfortunately, two crucial projects—the Sayedabad Water Treatment Plant (Phase-3) and the Meghna River Protection Master Plan—aimed at reducing the city's excessive dependence on groundwater, have been stalled for nearly a decade. The government must prioritise and expedite their implementation. Furthermore, it should consider various other methods, suggested by experts, for artificial groundwater recharging. Without immediate action, groundwater levels in Dhaka's densely populated areas could plummet to 100 meters by 2050. Therefore, the government needs to take urgent action to address the issue.\n",
        "headline_1": "Reduce overreliance on groundwater",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/reduce-overreliance-groundwater-3854776",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-03-2025"
    },
    {
        "full_article": "Faridpur-born Humayun Kabir (1906-69) studied at Oxford University, became the secretary of the Oxford Union and was once only four votes short of becoming its president. He was a global intellectual celebrity often sought after for speeches. His lectures at the universities of Wisconsin-Madison and London morphed into books.\nDespite his global reach and cosmopolitan credentials, Kabir was not removed from the lifeworld of rural Faridpur. In his place-centric English-language novel Men and Rivers (1945), he showcases some beautiful and not-so-beautiful aspects of life in his place of birth to a global audience. One of them is char dakhal or grabbing of riverine/shoal islands.\nWhat are generally called bars that emerge in the middle of rivers or adjacent to riverbanks, are called chars in Bangladesh. In \"Charland and Right of the Landless\" (The Daily Star, October 27, 2007), Md Abdul Kader states that in Bangladesh \"the amount of charland due to alluvium is more than two thousand square kilometres.\" Battles over chars in rural Bangladesh have gained proverbial currency, as char dakhal is a household phrase in the country.\nCharlands or sandbars abound in Kabir's Faridpur; they emerge as islands within the channel of the Padma as a result of bank erosion and accretion. Many place names in Faridpur—as in Bangladesh as a whole—are prefixed or suffixed by the word char. For example, Charbhadrasan, Char Jashohardi, Char Madhabdia, Decreerchar, and Majchar are known places in Faridpur. The syllable char in these names suggests that these places were originally sandbanks or alluvial islands which later became human settlements.\nLike Humayun Kabir, Bangladesh's famous artist and painter SM Sultan (1923-94) was a cosmopolitan personality and a globe trotter. After touring countries such as India, Pakistan, Britain, and the US in the early 1950s, Sultan chose to live a reclusive life in a remote village on the bank of the river Chitra in Narail. He lived there from \"the mid-1950s until his death in 1994\" and produced paintings to extol the labour of the peasantry. In his famous 1976 oil painting \"Char Dakhal,\" Sultan shows the intensity of the battle over control of charlands as well as the heroism of peasant warriors.\nThe peasants who fight for charlands in Kabir's Men and Rivers and Sultan's \"Char Dakhal\" are uncouth and rustic. In Sultan's painting, the charland warriors are an embodiment of the strong will and energy of the Bangladeshi peasantry. The weapons they use are conventional and locally-produced arrows, spears, long knives, and round shields. They are not products of modern technology that has brought the destructiveness of long-distance, remote-sensing warfare.\nPowerful local elites seek to establish claims on newly emerging charlands. In a research work titled \"Political Culture in Contemporary Bangladesh\" (2010), Dina Mahnaz Siddiqi says that, generally, battles over charlands involve \"rival landlords, escorted by their private militia wielding sticks as weapons, facing each other off in symbolic and literal battles as each lays claim to the newly emerged land.\"\nThere are two types of river islands over which the battle of char dakhal occurs: newly emerged charlands without any human habitation and old charlands where poor and homeless people have already taken shelter. In the case of grabbing the latter, unjust attempts are made to displace poor peasants and farmers from their houses and fields—external and/or local power-wielders snatch away their livelihood and encroach upon their community and agricultural activities.\nFormed mainly by the sedimentation of silt, char landmasses are fertile, which makes them desirable for agricultural and settlement uses. Soils of char areas are easily arable and can be watered more efficiently and have many other potential agricultural benefits. Therefore, charlands are highly sought after and constitute bones of contention among farmers and village leaders of surrounding areas.\nIn a journal article titled \"Chars: Islands That Float Within Rivers\" (2014), Kuntana Lahiri-Dutt of Australian National University states that, in Bangladesh, some legal framework regarding the acquisition of chars was introduced in 1972 and amended in 1994. However, the practice of char dakhal has now taken different forms and shapes. As Ahmed Humayun Kabir Topu explains in \"Decreer Char on Padma: Where Influentials Control Shoal Land\" (The Daily Star, January 27, 2024):\n\"Once upon a time, local influential people used to hire musclemen to take control of shoal land in rivers. There were fights between rival groups, and the winner would take the land and use [it] for agriculture. Decades later, the practice somewhat still remains the same, only muscle power has been replaced by political influence.\"\nPreviously village leaders and influential groups used brute force to grab charlands, but now political forces exercise their clout to make profits from such lands. Since muscular power is the only factor in determining who establishes control on sandbars, in Bangladesh the term char dakhal has become a metaphor for lawlessness, chaos, and the exercise of undue force and violence.\nThe proverbial practice of char dakhal has now extended to politics in the form of chandabaji (money extortion) as a metaphor for criminal greed. Its pervasiveness has taken a firm grip on various sectors including transport, markets, slums and even university dormitories to be forcibly grabbed and extortioned by political parties and hooligans.\nAs regards char dakhal, Humayun Kabir and SM Sultan demonstrate the valour, heroism, pride, and resilience of the peasantry, but there is no such admirable thing present in the heinous and vile practice of chandabaji. It is full of hypocrisy, cowardice, deception, violence, and fear-mongering. It functions under the guise of political puppeteering and under the patronage of immoral political leaders whose only goal is to go to and stay in power and whose only interest is in racketeering and amassing wealth.\nAfter the change of political power, cowardly chandabajs (extortionists) run away to avoid getting a good hiding by those from whom they extort money. However, unfortunately, they are soon replaced by extortionists of a rival political party that has gone to power or is eagerly waiting in the wings.\nChandabaji undoubtedly contributes to price hike. In order to stay afloat, business people and shopkeepers—who are forced to give money to extortionists—have to increase the price of goods and services that they sell and we buy. Thus, political extortionists extort money from us all. Therefore, the evil of chandabaji is much more pernicious and extensive.\nCreating public awareness about the political structure of chandabaji—which is the political manifestation of char dakhal—is important so that, at election times, people can punish politicians who are on the receiving end of chanda (extorted money). As Humayun Kabir and SM Sultan depicted the lawlessness of char dakhal, we need writers and artists to expose the corruption of sleazy politicians and their henchmen involved in chandabaji.\nDr Md Mahmudul Hasan is professor in the Department of English Language and Literature at the International Islamic University Malaysia. He can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Char dakhal in art and politics",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/char-dakhal-art-and-politics-3854696",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-03-2025"
    },
    {
        "full_article": "Bangladeshi booters are now in Shillong to participate in the AFC Asian Cup 2027 qualifiers. Their opponent is India, who will be playing before a host crowd and the high-altitude chill of Shillong. Against the formidable opponent, the newest member of the team, Hamza Choudhury, has made a rallying cry. In his Sylheti accent, he declared, \"We will win against India.\" This jolt of belief coming from the former England U21 international player, with Premier League experience for Leicester City and Sheffield United, signals something new for Bangladeshi football.\nThe Bangladesh Football Federation (BFF) has been scouting for players with dual nationality for some time now. Danish-Bangladeshi Jamal Bhuyan and Finnish-Bangladeshi Tariq Kazi have been instrumental in reviving our football. According to a football fan page, there are nearly 30 foreign-born players with Bangladeshi roots who could be considered for our national cause. Then again, we need to be realistic in thinking that our diasporic footballers are willing to sacrifice the comfort of developed countries to relocate to a country that lacks basic amenities.\nTo make the imported inspiration sustainable, we need to create an ecosystem for our players. This process includes a long-term vision, building of infrastructure, investment in youth development, and inculcation of national pride beyond political badges.\nWe need to be bifocal, admitting that the optics should focus on both the near and the far, both home and abroad. We must pursue the resources of foreign-born talent as part of a larger institutional strategy. Overreliance on these figures may give the local players the impression that they will soon be replaced by outsiders. We must present the integration of foreign-trained players as the nation's mission to enhance its football sector, benefiting all stakeholders, including the local players. The presence of players like Hamza must serve to inspire local players to work hard for the team.\nThe media hype over Hamza is understandable. If he can seamlessly integrate into our system, he can inspire other Bangladeshi-origin players to join our national set-up. Unless the players find the same professional atmosphere, coaching services, and training facilities, they may not be interested in moving to Bangladesh. For the betterment of both these foreign-born/trained players and our homegrown ones, we must focus on developing our infrastructure. We must ensure that our homegrown players are developed with equal care and attention. Above all, we must avoid any system that prioritises or privileges one group of players over others. A lot will depend on the coach. And we must respect his decision because he is the one who understands team dynamics.\nFor long-term sustainability, we need sports diplomacy that forges strategic partnerships with footballing nations such as Japan, Germany, and South Korea. The government can create bursaries for local talents to train abroad or earn diplomas. Instead of sending officials on foreign tours, we need exchange programmes that facilitate our players' access to elite training methods. Hosting foreign teams for friendly matches can also give our local players the necessary exposure to stockpile their abilities.\nOnce these young athletes have completed their training abroad, they will not only strengthen their skills but also introduce international standards and discipline lacking in our local system.\nWe have not heard anything remarkable about the Bangladesh Krira Shikkha Protishthan (BKSP) in recent years. It requires a complete overhaul. Without a curriculum upgrade and certified, international-standard coaching staff, BKSP cannot become the desired centre of talent cultivation. As part of sports diplomacy, overseas missions can encourage donor countries to further support this institute.\nIn cases of women's football, we have seen how a remote village football academy at Kalsindur in Mymensingh produced a number of footballers who brought us glory in the SAFF championship. Most of our players do not even see a proper football pitch. We need funding and sponsors for turf fields, training facilities, and local academies in every division. Such investment is essential for the growth of football.\nIn the 1990s, there was a sports lottery that helped the federation generate funds. We bought those tickets not necessarily to win a million but to support our sports. I think the federation needs to come up with creative funding projects to build turf in all districts. For talent hunts, there can be an \"adopt-a-player\" scheme, where philanthropic individuals or corporate bodies, through their CSR, can sponsor a young player's career.\nHamza's inclusion should not be the peak of our sporting efforts; it must be the beginning of a long-term journey. For a robust player development framework, we need to identify raw talents from their early teens and offer them advice related to nutrition, mental strength, and career roadmaps. In 2004, I attended a youth recruitment programme while working at the University of London Union. We invited hundreds of students between the ages of 10 and 18 to showcase their potential for the 2012 London Olympics. To be successful in the international arena, there are no shortcuts.\nSports is a career that is full of both thrills and uncertainties. Injury, lack of motivation, or financial barriers often interrupt the career of a promising player. So selecting a player is just one part of the system: a national development system, comprising the federation, local clubs and regional authorities, should take responsibility for curating—not just selecting—talent.\nWe need to recognise the unifying power of sport. In a nation often fragmented by politics and region, football (as well as cricket) has the rare power to bring us together. It is a stage where our dream becomes one. The other reason for investing in sports involves the fact that it answers to one of Bangladesh's greatest challenges: youth engagement. With rising unemployment and disillusionment, sport can become a national platform for inspiration, discipline, and identity.\nWhile we wish our booters the best of luck for their away game in India, we need to renew our commitment to building a footballing culture rooted in professionalism, patriotism, and policy. With thoughtful scouting, strong institutions, global exposure, and nationwide infrastructure, Bangladesh can not only return to its former footballing glory but surpass it.\nDr Shamsad Mortuza is professor of English at Dhaka University.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Building a future for Bangladeshi football",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/blowin-the-wind/news/building-future-bangladeshi-football-3854621",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Public procurement reform ensures fair play",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/public-procurement-reform-ensures-fair-play-1742661377",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Global call for debt reform",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/global-call-for-debt-reform-1742661601",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Time for RMG owners to grow up",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/time-for-rmg-owners-to-grow-up-1742661650",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Empower women's voice",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/empower-womens-voice-1742661664",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-03-2025"
    }
]