[
    {
        "full_article": "In what must be seen as a rap on the knuckles of the Election Commission of India (ECI), the Supreme Court of India ordered it to publish the names of 65 lakh voters excluded from Bihar’s draft electoral roll, and the reasons, following the Special Intensive Revision (SIR) exercise. That it required the Court to compel the ECI to follow the basic principles of natural justice for these voters underscores the pressing lacunae in the institution’s conduct of the SIR and the presumptuous and hasty manner of its implementation. There has been no consolidated list of the excluded electors whose names, the ECI claims, have been removed because they have died, or are untraceable or have fake/duplicate entries. No reasons have been provided against each name. Data analysed by The Hindu and ground reports have highlighted significant anomalies. A much higher number of women (close to 32 lakh) than men (close to 25 lakh) have been excluded despite more men having migrated, and recent death rates having been slightly higher among men too. Reports indicate that several voters have been wrongly identified as dead or had not been enumerated despite having valid voter IDs and proof of residence across areas. The Court’s intervention now provides a meaningful way — the ECI deadline of September 1 to complete the filing of claims and objections is near — for such voters to address their anomalous situations.The Court will continue to hear the case on the SIR which has other problematic elements to it. The constitutionality of the exercise itself, conducted after the ECI’s own summary revision in January, remains to be adjudicated. Also, the ECI still insists that enumerated voters in the draft roll are vetted by Election Registration Officers based on the availability of one of 11 indicative documents, which do not include the more universally available Aadhaar or ration cards. With the Court ordering the ECI to allow excluded citizens to file objections with their Aadhaar card and having nudged it to accept this document in two previous hearings, the ECI must now include the Aadhaar card as an identity document also. The Court’s order also shines a light on the ECI’s use of non-transparent means to conduct the SIR; it has made it onerous for civil society to parse the electoral rolls and it continues to use that ploy even now by refusing to put up the full list of those excluded and the reasons in one place. Universal adult franchise has been a cornerstone of India’s democracy since Independence. The upcoming hearings in the case and the ECI’s actions in rectifying its role in Bihar’s SIR process will go a long way in assuaging serious concerns about the voter enrolment process in the country today. Published - August 18, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        migration\n                    \n                            /                      \n                        \n                        Aadhaar\n                    \n                            /                      \n                        \n                        democracy",
        "headline_1": "​Roll recall: on  Supreme Court and the Bihar SIR exercise",
        "headline_2": "Supreme Court intervention highlights Election Commission of India’s procedural failures",
        "link": "https://www.thehindu.com/opinion/editorial/roll-recall-on-supreme-court-and-the-bihar-sir-exercise/article69943859.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "18-08-2025"
    },
    {
        "full_article": "The much-anticipated summit between U.S. President Donald Trump and his Russian counterpart Vladimir Putin in Anchorage, Alaska, did not yield a breakthrough on the Ukraine war but appeared to narrow the gaps between their positions on how to end the conflict. While Ukraine was the most contentious issue on the agenda, the summit was significant for several reasons. Relations between the world’s two largest nuclear powers have been defined by hostility and mutual distrust. A stable, predictable relationship and the prospect of a new arms control pact — hinted at by Mr. Putin — are critical not just for stability in Eastern Europe but also for broader global stability. Yet, rebuilding Russo-American ties is inconceivable without peace in Ukraine. All sides in the Ukraine war publicly claim that they are committed to peace, but they differ sharply on how to achieve it. Ukraine and its European partners have called for an immediate ceasefire, a demand reiterated by Mr. Trump before meeting Mr. Putin. Russia has resisted calls for a ceasefire, insisting instead on a comprehensive peace agreement that addresses what Mr. Putin calls the conflict’s “root causes”. Mr. Trump appeared to endorse the Russian line when he said “the best way to end the horrific war” is to go directly to a peace agreement.While the downside of the summit was its failure to deliver a breakthrough, the positive side is that it opened a diplomatic path that could lead to conflict resolution. Mr. Trump, who claimed that he and Mr. Putin agreed on “many points”, spoke with European, NATO and Ukrainian leaders after the meeting. Ukrainian President Volodymyr Zelenskyy is expected to visit the White House on Monday to discuss Mr. Putin’s proposal. Mr. Trump also suggested that it is now “up to Zelenskyy” to strike a deal with Russia, “a very big power”. Russia has consistently made three core demands to end the war — recognition for the Ukrainian territories it has annexed and Ukraine’s “neutrality” and “demilitarisation”. Post-summit reports suggest that Mr. Putin is open to freezing the war along the frontlines in the south (Zaporizhzhia and Kherson) provided Russia retains full control of Donbas (Donetsk and Luhansk). A settlement could also involve Russian withdrawal in the northeast (Kharkiv). Ukraine has so far said that it would not concede land for peace. The challenge before Mr. Trump is to sustain the talks aimed at narrowing the differences further to reach a workable compromise. While it makes perfect sense to end the war on practical terms, Mr. Trump should not impose an agreement on Kyiv. Peace would prevail in Eastern Europe only if Ukraine’s security concerns are addressed and it is provided with credible assurances that Russia would not invade it again. Published - August 18, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        summit\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        nuclear policy\n                    \n                            /                      \n                        \n                        Europe\n                    \n                            /                      \n                        \n                        NATO",
        "headline_1": "New start: on the Alaska summit and the Ukraine war",
        "headline_2": "Ukraine’s security concerns must be addressed for lasting peace",
        "link": "https://www.thehindu.com/opinion/editorial/new-start-on-the-alaska-summit-and-the-ukraine-war/article69943872.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "18-08-2025"
    },
    {
        "full_article": "Scholars today wear many hats, old-timers grab many desks\nThe demands of scholarship are such that these may deter ordinary folk. For one, even while undertaking the most serious research in the library, the scholar must fulfil his or her social obligations. Most libraries allow scholars to bring their phones inside and use these with discretion. At times hectic texting by the scholar may give the impression that he is not serious about his work, but the grim expression on his face should dispel such a notion.\nThe day is long. In the throes of work, a scholar may wear many hats. If you lift your eyes and view the laptop screens in the neighbourhood, you may even see a shopping website or a movie playing. It is necessary for the scholar to rest his mind after grappling with a difficult academic challenge. Occasionally, a web page with a stock market trading account seems to pop up, but it is probably a mathematician working on an algorithm, or beta-testing a data exchange tool.\nToday’s libraries are well-equipped and comfortable. Unbearable summer and dreary winter days inspire intense scholarly engagement. On such days, finding a seat in coveted public libraries is extra difficult. Some scholars reserve desks by leaving laptops and books on them. It is a coincidence that the couple you saw strolling near the trees, or sipping coffee outside, returns to claim these desks.\nOne may try to move to the upper floor, but the few desks there are taken over by old-timers who arrive first and leave at the end of the day. \nSuch scholars go through the demanding post-lunch hours with practised ease. One may find someone drooping in front, their eyes closing. But then a finger that moves on the keyboard, and a head that nods just when you thought he was napping, are evidence enough that academic rigour was not abandoned on a soporific afternoon after a sumptuous lunch in the nearby canteen.\nThe scene outside is one that can lift a sagging spirit. It is like a lounge where people talk and exchange greetings, like a ship’s deck minus food and drinks. After a day of study, when the scholar stops here briefly, the eruption of greetings by other scholars makes him forget disappointments such as the congested academic space and limited funding. He says his goodbyes and returns home to a restful evening.\n\n",
        "headline_1": "Library notes",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/library-notes/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-08-2025"
    },
    {
        "full_article": "Trump gets Exxon back in Russian oil sector. Will he still insist on penal duties for India?\nThe Trump-Putin summit in Alaska has raised more questions than answers for India. New Delhi was hoping that a modus vivendi between Washington and Moscow on the Ukraine war would stave off Trump’s threatened secondary sanctions. It was a logical assumption: If Trump and Putin can do business, why can’t India also have a commercial relationship with Russia? But what transpired in Alaska was somewhat strange. While Trump and Putin appeared to agree on a peace deal to end the war – though details are yet to be worked out – there is no word on the secondary sanctions. \nEven more worryingly for New Delhi, Washington has postponed a scheduled meeting of trade officials on Aug 25 that was supposed to clear the air on the secondary tariffs. Those come into effect on Aug 27, doubling tariffs on Indian exports to US to 50%. Interestingly, on the same day Putin met Trump, he signed a new decree that could allow American oil major Exxon Mobil to regain shares in the lucrative Sakhalin-1 oil and gas project. Exxon, before Russia’s full-scale invasion of Ukraine, held 30% operator share in the project. If Exxon actually returns to Russia, Trump’s secondary sanctions on India for buying Russian oil have no leg to stand on. \nThat said, on the bilateral trade deal, India has done well to stick to its guns. Also, before Trump decided to torpedo a deal, New Delhi had been as flexible as possible. But it simply cannot compromise on the farm sector. In fact, no country can afford to play with the livelihood of its farmers. Take Japan. Although Trump forced Tokyo to increase imports of American rice by 75%, it has become a hot-button political issue in Japan with many Japanese buyers vowing to reject the imports. Similarly, for India’s large agricultural sector that employs around 46% of the workforce, opening up to duty-free US agri-imports is impossible. \nHowever, in non-agricultural sectors there is ample room for negotiations. US also needs to keep in mind the larger geopolitical play here. India can be a viable option in the China+1 strategy. But Washington has to cut New Delhi some slack. If it continues pressuring India through tariffs and sanctions, New Delhi will have no choice but to increase its alignment with Brics or even revive the Russia-India-China platform. Note that Chinese foreign minister Wang Yi is beginning a visit to New Delhi today. Trump, therefore, should think hard before trying to drag India over the tariff coals.\n\n",
        "headline_1": "The tariff puzzle",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-tariff-puzzle/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-08-2025"
    },
    {
        "full_article": "As AI companies delete the health disclaimers, the chatbots are running amok playing doctor, doctor\nDoctors may be wishing they could return to the good old days of Dr Google. Because Dr AI is much more formidable competition and foe. What’s dangerous is how a chatbot super personalises vast amounts of health data and then, via conversational intimacy, seduces the patient to take its advice when what’s needed is seeing a real medical professional. In a case reported in Annals of Internal Medicine this month, a man developed bromide toxicity, a rare condition, after consulting ChatGPT about reducing salt in his diet. It advised him to swap sodium chloride with sodium bromide. The thing is, if he hadn’t landed in the hospital, this wouldn’t have gone on record.\nLast month, another US study found that compared to more than 26% of chatbot answers to health queries in 2022, less than 1% in 2025 contain some kind of warning about the LLM not being a doctor. This finding is especially troubling as the Stanford and US researchers used the likes of mammograms and chest X-rays to screen for disclaimer phrases. It indicates how much AI companies are encouraging people to use it for health advice. At the GPT-5 launch event, for example, a person spoke about uploading her biopsy results onto it and taking its help to decide whether to pursue radiation. Actual medical advice is not plain pattern matching. It engages with the complexity of individual medical histories and circumstances.\nAI can be useful in the health sector in many ways. But Indians already pop enough pills prescribed only by their neighbourhood chemist. Substituting professional medical judgement with chatbot advice would worsen their health horribly. GenAI models, even as they become more capable and authoritative, must also use proper disclaimers and safeguard against the dangers of providing diagnosis in place of a doctor.\n\n",
        "headline_1": "Good, bad and sick",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/good-bad-and-sick/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-08-2025"
    },
    {
        "full_article": "When I meet a millennial for lunch, usually I hear tales of complicated romance. Millennials are the last generation still caught up in l’amour with a certain earnestness and sense of genuine surprise at their own repeating cycles.\nBy any standards, 41-year-old B is gorgeous, brilliant, sweet-natured — and very much committed to having a good time. Her definition of a good time is, you could say, Punjabi by nature. It can include ordering every exciting item on the menu and in fact consuming it, dancing a lot, aided or not by substances, travelling, hanging aimlessly with friends, or being sensually steeped in her own intellectual life. It definitely involves a series of amorous adventures, which are the subject matter of intent conversations accompanied by day drinking.\nRead full article on TOI+\n\n",
        "headline_1": "Open-Ended Love? Why He And She Ever Did Part",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/voices/open-ended-love-why-he-and-she-ever-did-part/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 18, 2025 00:00:00  \nThe Dhaka North City Corporation's (DNCC’s) recent call for a moratorium on the sale and conversion of lands in areas earmarked under the Detailed Area Plan (DAP) is most pragmatic. Alongside this, the DNCC has urged restrictions on tax collection in these areas to help preserve the waterbodies, open fields and parks as envisioned in the DAP, which is vital for improving the capital's environment, biodiversity and quality of life. Reportedly, the DNCC has also initiated plans to create water-centric parks in areas such as Badda, Aftabnagar and Mirpur. If implemented, these waterparks would not only serve as areas for water retention but also add scenic beauty and relief to the otherwise lifeless concrete jungle of Dhaka.\nThe DAP, an ambitious urban development blueprint for 2022-2035, designates specific areas as wetlands, including waterbodies, flood flow zones and water retention areas. These ecological spaces are indispensable for flood management, groundwater recharge and maintaining biodiversity. Yet, over the years, most of Dhaka's wetlands have indiscriminately been filled up, exposing the city to irreversible environmental degradation. Once teemed with fish and migratory birds, these wetlands have been reduced to barren land and aggressively occupied by real estate developments or industries. This reckless encroachment has been driven by runaway population growth, poor governance and an unrestrained culture of land grabbing. Tragically, policymakers failed to appreciate that the disappearance of wetlands would have disastrous consequences for both the city's environment and its residents. Only a handful of urban experts and environmentalists have consistently warned against this suicidal trend of destroying the natural reservoirs that sustain life.\nThe situation is no better when it comes to rivers, canals and ponds. These water bodies, once central to Dhaka's drainage and water management systems, have also been subjected to encroachment, pollution and even obliteration. The authorities' inexplicable indifference to this crisis is unpardonable. As a result, a large number of rivers, canals, and wetlands have already disappeared. Even today, the city authorities are engaged in protracted battles with land grabbers to reclaim what remains of the canals that were once lifelines of Dhaka's drainage network. Ideally, a liveable city should have at least 15 per cent green space and 10-12 per cent wetlands. But a study by the Bangladesh Institute of Planners (BIP) found that green space in central Dhaka has shrunk to just 7.09 per cent, while wetlands cover to a meagre 2.9 per cent of the city area. This exposes how urbanisation in Dhaka has gone astray. Unplanned development has been prioritised over environmental balance, and the consequences are evident in the city's declining air quality, comparatively higher temperature, frequent waterlogging and loss of biodiversity.\nIt is, therefore, imperative to take immediate and effective measures to rein inunplanned and chaotic urbanisation. In this regard, the DNCC's latest initiative is commendable. The Dhaka South City Corporation should also follow suit. Conserving wetlands, reclaiming canals, protecting parks, and expanding green spaces are not luxuries; they are the prerequisites for making Dhaka liveable. Only by striking a balance between growth and ecological preservation can Dhaka hope to become a truly liveable and sustainable city. The DNCC's call for action should therefore be heeded with utmost urgency, and more importantly, followed by strict enforcement. Otherwise, the capital's residents will continue to pay the price of shortsightedness for generations to come.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Saving Dhaka's  wetlands",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/saving-dhakas-wetlands-1755444356",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       August 18, 2025 00:00:00  \n\nMyanmar's military junta has dissolved its State Administration Council (SAC) and replaced it with a new interim caretaker setup, the so-called 'State Security and Peace Commission (SSPC)'. On July 31,2025, the February, 2021's coup leader, Senior General Ming Aung Hlaing lifted the state of emergency he had extended seven times to continue his regime's grip on Myanmar since he had toppled the country's elected government four and a half years ago. The aim of this move is to hold what junta leader calls an election 'on the path to a multiparty democracy' in December 2025 and January 2026.Interestingly, the junta on August 1, declared a new state of emergency and martial law on 63 townships across Myanmar including areas where ethnic armed groups and the National Unity Government (NUG) comprising lawmakers and members of parliament of the elected government deposed earlier by coup are now in control.\nClearly, this is an attempt by the Naypyidaw junta to present itself before the world in a new-look package. The election it plans to hold is nothing but a gimmick to hoodwink the world into believing that the new government to be formed after the so-called election will be a democratic one. Now the fact remains that the military junta in Naypyidaw is losing control on substantial parts of the country, especially in the border regions, to the rebels including, for example, the Arakan Army (AA), Ta'ang National Liberation Army (TNLA), Myanmar National Democratic Alliance Army (MNDAA) etc. So, its authority over the country is increasingly coming into question. The rebel ethnic group armies already control large parts of the Rakhine, Shan, Kachin, Karen and Chin states. Also, a large chunk of Mandalay and Sagaingregions have gone under rebel occupation. \nThe Arakan Army (AA), for instance, controls some 270km of the Myanmar-Bangladesh border areas. It has meanwhile captured Paletwaand Buthidaungtowns bordering Bangladesh. In fact, the Naypyidaw junta still maintains control on major urban centres using its airpower such as in Sittwe, the capital of the Rakhine state. \nAgainst this backdrop, the Bangladesh government has to rethink its strategy about who and how to deal with when it comes to repatriation of over 1.1 million Rohingya refugees in the overcrowded camps in Cox's Bazar with reports of arrivals of around 150,000 fresh waves of refugees during the last eighteen months. More importantly, until the ongoing civil war comes to an end, the authority of the current Naypyidaw government will remain questionable. So, even if any deal is reached with the Naypyidaw junta, its acceptability in the future will remain uncertain. Consider the offer made in April this year by the Myanmar authority on the sidelines of BIMSTEC meeting in Bangkok to take back 180,000 Rohingya refugees out of the list of some 800,000 Rohingya members that Bangladesh government submitted in six separate batches to the Myanmar authority between 2018 and 2020. But many Rohingya feared that the move by the Naypyidaw regime lacked necessary political will, security guarantees and restoration of citizenship as a prerequisite for their return. In response to that offer by Naypyidaw authority, King Maung, Executive Director of the Rohingya Youth Association (RYA), according to the news outlet, Rohingya Khobor, for instance, said, \"We are not asking how many will return. If we are sent back without land, rights or recognition, it's not repatriation-it's re-persecution\". 'We want justice, security, and our place in Arakan' Maung added.\nDr Muhammad Yunus, Chief Adviser to the interim government of Bangladesh, recently expressed his intention, as part of intensifying international efforts, to resolve the Rohingya crisis. To this end, three international conferences during this year would be held, he informed. Dr Yunus said this during a recent interview with the Malaysian national news agency, Bernama.\nDr Yunus is learnt to have further informed that the first of the conference would be held by the end of this August in Cox's Bazar, to mark the eighth year of the Rohingya's arrival on a large scale following 2017's ethnic cleansing campaign by the Myanmar government. The second conference will be held in September next on the sidelines of the UN General Assembly meeting. The third conference would be held by the year end in Doha, capital of Qatar.\nMalaysia's leading role in Southeast Asia, especially as the head of the Association of Southeast Asian Nations, (ASEAN), Dr Yunus believes, can play an important role in resolving the Rohingya crisis. It is worthwhile to note that the interim government since its assumption of office in early August 2024 has made a number of efforts towards mobilising international support to resolve the Rohingya issue. Notably, in November 2024, the interim government's lobbying resulted in a UN General Assembly resolution calling for a 'high-level conference' in the second half of 2025 to a 'comprehensive, innovative, concrete and time-bound plan for the sustainable resolution of the crisis including voluntary, safe and dignified return of Rohingya Muslims to Myanmar\".\nGiven the ever-worsening conditions of the Rohingya in the cramped refugee shelters of Cox's Bazar and the international assistance for their sustenance dwindling to a trickle, international conferences are, of course, necessary if only to draw the global community's attention afresh to the near-forgotten Rohingya refugees Bangladesh has been playing host to for too long. \nBut mere talk at conferences will not be enough to ensure resettlement of the Rohingya that sought refuge in Bangladesh as well as at other places in their ancestral homeland. The international community needs also to play a strong role in seeing that the Myanmar civil war ends with transition to a civil government. At the same time, the international community brokering such transition in Myanmar should also include in its talks with the political stakeholders of Myanmar in question the accommodation of the Rohingya refugees and their secure, dignified and rightful return and resettlement in their homeland. \nBangladesh has been hosting about 1.2 million Rohingya refugees not only for the last eight years, but for decades after then-Myanmar government-engineered large-scale violence against and persecution of Rohingya leading to similar repatriation efforts in 1978 and 1992. In fact, pushing Rohingya people into Bangladesh has been a sinister design of successive governments in Myanmar whether civil or military, which betrayed Bangladesh government's weakness in handling the situation. What is necessary is to face them from a position of strength. Of course, it must get the international community on its side through astute diplomacy. \nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Will Rohingya crisis be resolved in near future?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/will-rohingya-crisis-be-resolved-in-near-future-1755444530",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       August 18, 2025 00:00:00  \nFevers have long ceased to be a highly dreaded disease, particularly after cure for malaria and typhoid has become available. The same cannot be said about the various types of fever this country, particularly the capital city is witnessing right now. Dengue has been a killer disease for some years. Chikungunia and zaika have colluded with it to make the matter worse. Add to this the new variant of nagging corona that is reluctant to go once and for all. If these types of ailments are not enough, this year's worst fever bane commonly known seasonal flu has assumed the acronym 'viral fever'. It is not usually a life-threatening disease but it is so painful, life-sapping and its impacts are so prolonging that it severely disrupts normal life. Especially vulnerable and affected are children and the elderly with the latter taking far more time to recover than the younger ones. \nAmong the political ruckus, the voices of the health and family welfare adviser as also the chief of the Directorate General of Health Services (DGHS) are barely heard. But this is a health emergency that no government was found to be so callously indifferent to. More attention was needed to be paid to the types of fever the symptoms of which are more or less similar and but may have developed strains quite different. For example, dengue has become somewhat untraceable with doctors claiming that the disease often eluding RT-PCR, NS1antigen tests and lgM/lgG antibody tests. They suspect a person had dengue only when the patient had far lower platelet counts than what a normal person should possesses. \nThere are few homes in this capital city which are blessed not have a patient of one or the other fever with viral fever and dengue dominating the scene. The problem here is that early detection is next to nothing because the testing facilities are not easily accessible and public health service has never been developed to cope with any such health emergency. It is a glaring failure on the part of the health and family welfare adviser and the DGHS to respond to this emergency. Their ostrich-like evasive action has only made the public incredulous about their capacity to deliver. Administration has nosedived in every walk of life but when there is a thin line between life and death posing to be a pandemic, such an indifference is really unacceptable. \nThere was a need for allocation of special fund for a serious study on such strange strains of fever by reputed health institutes and requesting the International Centre for Diarrhoeal Disease Research, Bangladesh to independently or in collaboration with others to look into the viral and other fevers. The common people are confused and the severe headache, a common feature of the viral fever, makes this year's one all the more fearsome. Those who suffer from the fever become feeble to the point of occasional dizzying bouts and in some cases collapse. \nIn circumstances like this, people need some health guidance and emergency detection of their fever type. But the ministry concerned and the DGHS seem to be oblivious of their duties. They would neither inform the public of what to do and what not to do. In fact, they are totally unconcerned. When there was a need for developing testing facilities and, in serious cases, extended accommodation for patients, the duos seem to have gone into hibernation. Health conditions do not tolerate delay but when patients are not precisely diagnosed, how can physicians treat them? \nCovid-19 has exposed how ill-prepared the world is to any epidemic. This country's puny health budget this year has once again shown, that the poor and the middle-class people have more to rely on their fate than the country's health system. If an assessment of the medical bills, loss of work and energy caused by this latest spate of fevers is accurately assessed, it is likely to be huge. Institutes like the Bangladesh Institute of Development Studies and the Bangladesh Bureau of Statistics may carry out such a study to determine this year's financial and other losses. But the more important thing is to determine the variants of fevers in order to clearly inform the public about their nature and the early remedy. Fumigation now continued in the DNCC in the morning is the worst decision any city corporation has ever taken.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "In the grip of viral  and other fevers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/in-the-grip-of-viral-and-other-fevers-1755444554",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 18, 2025 00:00:00  \n\nThe retail world is undergoing rapid transformation, with technology driving changes at a pace unseen before. At the heart of this revolution lies the Management Information Systems (MIS), which are turning traditional stores into data-driven powerhouses. Every customer interaction, whether browsing a shelf, scanning a barcode, or making a purchase, leaves behind digital footprints. These footprints are no longer just records; they are valuable indications that help retailers understand and predict shopping behaviour. Patterns of buying, preferences for products, and even how shoppers move through aisles are being analysed to redesign the entire shopping experience.\nWhat was once considered innovative has now become the norm. Real-time data enable retailers to respond with incredible speed. Popular products can be restocked almost instantly, while targeted promotions reach the right customers at the right time. Instead of shelves filled with unnecessary stock, inventory is now managed \"just in time,\" saving costs and ensuring that products stay fresh and relevant. Online clicks and in-store steps merge into a unified stream of information, creating a seamless view of customer behaviour. For shoppers, this often translates into shorter waiting times, personalised offers, and an overall smoother experience. For businesses, it means greater efficiency, stronger customer loyalty and improved profitability.\nYet, this shift is not without its challenges. As the collection and use of data become central to retail strategy, so too does the responsibility to manage it wisely. With every piece of information gathered, the risks surrounding privacy, misuse, and data security grow. Customers are increasingly aware of how their data are being tracked and used, making transparency and accountability crucial for retailers. A single breach of trust could undo years of goodwill.\nReal-time retail is the foundation of modern commerce. Stores that can combine speed, efficiency, and trust are the ones that will thrive in this competitive landscape. Those that fail to strike the right balance may find customers walking away, both digitally and physically. \nSafwaanul Haque\nStudent\nBachelor of Business Administration\nNorth South University\nsafwaanul.haque@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Reshaping shopping experience",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/reshaping-shopping-experience-1755444574",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-08-2025"
    }
]