[
    {
        "full_article": "Elections in India feature a larger number of voters from among the poor and marginalised sections when compared to the West, offering them the best outlet to register their views while choosing their representatives. The Election Commission of India (ECI) has done yeoman work in increasing voter participation by easing the registration process, allowing the poor in even less developed States to vote enthusiastically. On Saturday, the ECI initiated a “Special Intensive Revision” of electoral rolls in Bihar ahead of Assembly elections scheduled in October. The objective of ensuring an accurate electoral roll is constitutionally sound as this includes adding all eligible citizens and eliminating ineligible voters such as the dead, those who have shifted and also non-citizens. However, the hurried timeline and the documentation requirements for verification raise serious concerns about the potential exclusion of genuine voters. The ECI has said that Bihar’s Draft Electoral Rolls, as of January 1, 2025, stand at close to 7.96 crore electors. It has also said that 4.96 crore individuals, who were on the 2003 electoral roll, will not need to submit fresh documents, and for their children, only an extract of the 2003 roll can serve as proof for their parents. However, the figure from 2003 is not static. A significant number has either passed away or migrated. The Hindu’s Data Point estimates this attrition to be around 1.8 crore. Thus, the number of living, resident electors from the 2003 list eligible for simplified verification is closer to 3.16 crore. Consequently, the actual figure of those who need to provide fresh documents for enrolment would be closer to 4.74 crore.These individuals would have to prove their elector status within a month when the draft roll is prepared. Their claims and objections will have to be filed within a month after that, which is too short a period. The challenge is compounded by the ECI’s illustrative list of 11 acceptable documents. Bihar has historically lagged in birth registration, with very few in possession of birth certificates. The possession of other “official” documents such as matriculation certificates and government-issued IDs also remain low among a large section of the population, especially the poor and the less educated. The exclusion of widely available documents such as Aadhaar or current ration cards is also puzzling as these are more accessible to Bihar’s marginalised communities. Considering the enormity of the exercise, the ECI should reconsider its approach. Such an intensive revision should be conducted over a much extended period, and for all States, and completed before the 2029 general election, rather than rushing it through before the Assembly election. The integrity of the electoral process demands caution and time, especially when dealing with the fundamental right to vote.\r Published - July 01, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        election\n                    \n                            /                      \n                        \n                        poverty\n                    \n                            /                      \n                        \n                        minority group\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Aadhaar",
        "headline_1": "Roll crunch: On the revision of Bihar’s electoral rolls",
        "headline_2": "The Election Commission’s rushed intensive electoral revision in Bihar risks voter exclusion",
        "link": "https://www.thehindu.com/opinion/editorial/roll-crunch-on-the-revision-of-bihars-electoral-rolls/article69756695.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-07-2025"
    },
    {
        "full_article": "There have been nine stampedes in India in the past 12 months, with six of them at religious gatherings. This includes the most recent one, at the storied Jagannath temple’s annual chariot procession in Puri, Odisha, early on June 29, 2025. Three people were killed and more than 50 injured. Acknowledging “negligence “and “security lapses”, the State government was swift to order a probe. The centuries-old chariot procession is an annual and month-long event between June and July. But the heart of the festival is the nine-day chariot procession, or Rath Yatra, when Lord Jagannath travels with his two siblings, Balabhadra and Subhadra, to their aunt Gundicha’s home. About half a million devotees visit the three-kilometre radius around the temple. While a full investigation is pending, initial reports suggest that tell-tale signs of a stampede were overlooked.On the first day of the yatra, officials paused the drawing of Lord Jagannath’s chariot around 7.45 p.m. because of an ‘unprecedented rush’, allowing only Balabhadra’s and Subhadra’s chariots to move. The Jagannath chariot was moved symbolically and deferred till early on Saturday. In the intervening hours, about 750 devotees were hospitalised due to heat, dehydration, and crowd stress. Eyewitnesses reported that a common exit gate was closed to create a separate “VIP entry,” forcing everyday pilgrims to exit through the same entrance path that was already congested. A single corridor that was being used for the flow in both directions resulted in more congestion, amplifying crowd pressure. The delayed arrival of the chariot also caused a bottleneck outside the Gundicha temple just before dawn. With exhausted pilgrims, merged traffic flows and no exit access, the stage was set for a tragedy. Further, trucks with ritual materials entered this zone at 4.20 a.m. This unexpected movement shattered stalls, toppled devotees and triggered panic. This daily has highlighted India’s tawdry record in crowd management, at religious gatherings, celebrity-studded events, political rallies or post sporting festivities. Given that the climate discourse is at front and centre globally, providing thermal comfort, hydration facilities and taking precautions to shield women, children and the elderly from the heat especially during peak summer should have been woven into the conduct of the rath yatra years ago. As for VIPs, one way is to restrict any privileged entry and to provide access at the beginning or at the end of festivities, allowing other visitors predictable and barrier-free access. But the best way is to end India’s entrenched VIP culture. Published - July 01, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        religion and belief\n                    \n                            /                      \n                        \n                        Orissa\n                    \n                            /                      \n                        \n                        disaster and accident\n                    \n                            /                      \n                        \n                        senior citizens\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        children\n                    \n                            /                      \n                        \n                        heatwave\n                    \n                            /                      \n                        \n                        weather",
        "headline_1": "Sheer negligence: On the Puri stampede",
        "headline_2": "India’s shameful VIP culture has no place in public events",
        "link": "https://www.thehindu.com/opinion/editorial/sheer-negligence-on-the-puri-stampede/article69756161.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-07-2025"
    },
    {
        "full_article": "Trade deal is in farmers’ interest. Boost to manufacturing will create factory jobs, reduce pressure on farming\nIndia has eight more days to close a trade deal with Trump. A delay would be costly because US is India’s largest trading partner, absorbing 18% of goods exports. Without a deal, the tariff on those goods will jump from 10% to 26%, making them costlier. US also needs a deal to crack the Indian market, and right its balance of trade. It produces mountains of soy, wheat, corn and apples that China doesn’t want anymore. So, the interest is mutual. Last week, Trump hinted a deal was imminent: “We have one coming up, maybe with India. Very big one.” FM Sitharaman responded: “Yes, we would love to have an agreement, a big, good, beautiful one; why not?”\nBut there are sticking points. India has 650mn people in farming – almost twice America’s population – to worry about. Most of them are poor, accounting for just 18% of GDP. Easing tariffs on agriculture and dairy would hit them hard. The US demand for access to GM crops is reportedly another red line for India. Reports indicate GOI is keen to not cede ground on the question of farm tariffs. But not having a deal may be costlier long-term.\nFor one, 10% tariff is better than 26% when you are competing against the Chinese, who are tariffed at 30% by US. A trade deal would also make India competitive vis-à-vis other low-cost producers like Vietnam and Bangladesh. It would spur foreign investment in Indian manufacturing. But the benefits go beyond economics. Given Trump’s autocratic style, an overly rigid Indian stance would affect US-India engagement in areas like defence. That’s why other countries have been quick to make concessions. Canada, for example, dropped its digital services tax on Sunday, after Trump made it a pretext for cancelling trade talks.\nIndia has played its cards well so far. Budget 2025 made concessions for US automobile and other imports to soften Trump before he announced tariffs. Modi had a fruitful meeting with him in Feb. Both sides are keen to boost bilateral trade to $500bn by 2030. The momentum must not be squandered. Marginal farmers need protection, but their interests might be better served with a post-deal manufacturing boom that creates factory jobs. The alternative – fewer factory jobs, sans a deal – will only increase the pressure on farming.\n\n",
        "headline_1": "Do the deal",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/do-the-deal/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-07-2025"
    },
    {
        "full_article": "Fadnavis or Thackerays, the language drama does little to actually help the state’s students \nIndian children would be awash in prosperity if everything done in education’s name was actually about it. Maharashtra is the latest to show that, instead, such decision-making is driven by cynical politics. First the Fadnavis govt made Hindi mandatory as the third language from Class 1 to 5, then made it optional, next estranged cousins Raj and Uddhav Thackeray came together in protest, finally govt withdrew the orders, and formed a  committee. Fadnavis’s game to play footsoldier to the Centre and the Thackerays’ to raise fading political capital, were both patently obvious, neither doing diddly squat for students.\nAser 2024 (rural) reports that only 37% of children in Class 3 can read Class 2 Marathi text, moving up a meagre 3 percentage points over the last decade. Have you heard anything from the Marathi-defending political warriors about how to improve this? As for netas who are pumped up about the teaching of a third language, do you ever hear them engage with how teaching resources that fail to impart current reading goals, will deliver significantly expanded KRAs? Of course not. \nMacaulay is regularly flogged for feeding an inferiority complex in India. Today’s language wars are inflicting greater damage on modern India. They are forcing a pauperly lens on what we have inherited in abundance. The idea that the survival of one Indian language hangs on injury to another, is translating into actual violence. It hurts migrants, it hurts national wellness. Villainising English, now a core Indian strength, does the same. There’s a bizarre thought process that China’s decades of double-digit growth can be copied by copying its language chauvinism. This is terribly self-harmful. \n\n",
        "headline_1": "Maha malady",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/maha-malady/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-07-2025"
    },
    {
        "full_article": "…when ‘F’-bombers can’t get peace at any prize\nA Nobel gesture: Pak’s army chief recently backed Trump as peace prize candidate, for supposedly preventing Indo-Pak ‘nuclear war’. Little did he know the Dove would strike Iran (which doesn’t – yet – have nukes) to assist Israel (which doesn’t admit it does). Post-strike, Putin’s pal Medvedev denied (Toma)hawk Trump deserved even a ‘rigged’ Nobel. Little did he know Trump would detonate an ‘F’-plosive, forcing Israel-Iran’s ceasefire.\nDuring Israel-Iran’s 12-day conflict, Moscow fanned nuclear fallout fears. Presumably West Asia won’t be geopolitically radioactive if some – Russia-led? – countries readily ‘supply’ Iran with ‘warheads’, as Medvedev explosively claimed. What about global alarm when Russia endangers Ukraine’s nuclear power plants or threatens nuclear strikes? Well, Ukraine’s paying for trusting post-Soviet and pre-(and-post-)Trump security guarantors more than the nukes it renounced, see?\nMedvedev’s ‘N-word’ provoked a seeming WT‘F’#@!! from Trump, who’d just prevented future WWIII by bunker-busting Iran’s go-nuclear plans. Never mind that, apparently vexed by Ukraine and Gaza, Trump’s likened armed conflict – which invariably involves nuclear bluster – to ‘hockey’ matches. Only, if you can’t referee them, (midnight) hammer them.\nNetanyahu normalising wargames meantime, China could now shoot for Taiwan, South China Sea, disputed borders, even world domination. And Kim Jong-un could target the Korean peninsula and beyond, daring regime changers by trial-running his war toys. Ranging from Seoul-shattering Shahed-series kamikaze drones – their blueprints reportedly sent from Russia, with love – to Hwasong missiles that could reach Mar-a-Lago.\nBTW, did Kim’s military parades inspire Trump’s recent $45mn extravagant-za? And didn’t Trump praise US’s ‘lethal’ ‘N’-subs while bashing Medvedev’s ‘casual’ ‘N’-talk? Answer: Trump and other Bibi-sitters uphold ‘peace through strength’. Practised as might-is-right, nuclear-haves bully nuclear have-nots. Which makes would-be dual-users desperate to sneak into Nukesville. Unlike Trump-wooed Saudi Arabia which openly says it’ll nuclearise if Iran does – and experts say stealth-bombed Iran now stealthily will.\nThere’s no peace prize for guessing why one YUGE peacetime perk is war’s windfalls. SIPRI’s Yearbook 2025 says global military spending surpassed $2.7tn in 2024. Arms revenues of 100 biggest weapons-making and military services firms hit $632bn in 2023. And – manna for ICBM-lobbyists – another nuclear arms race looms. That too, when no ‘great power’ seems (even hopelessly) devoted to ‘D’ for disarmament, a stronger ‘N’-deterrent than the ‘F’-bomb.\n\n",
        "headline_1": "That’s ‘N’-tertainment",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/churn-after-reading/thats-n-tertainment/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-07-2025"
    },
    {
        "full_article": "Bezos’ Venice wedding typifies what spending power is doing to ecologically vulnerable places\nThe Bezos-Sanchez wedding spectacle in Venice cost $50mn. Plus the $3.5mn Bezos donated to – or ‘tipped’, as some said – the city’s local institutions. For context, Sanchez’s 30-40 carat diamond bauble is estimated upwards of $5mn. The only blip were protests, residents against Venice authorities’ reckless push to over-tourism, disregarding climate concerns (pollution from luxury yachts), impossibly high rents (Venice is tailored for ultra-rich, not residents), and elitism. The demonstrations forced a venue change for the three-day spectacle’s biggest event. Locals griped about the takeover of their city. In 2019, Uttarakhand town Auli struggled with man and machine to clean up 240 quintals of waste, left behind after a Gupta Bros family wedding. They offered to pay for the full exercise. But throwing money doesn’t make the problem go away. The problem is authorities’ unresponsiveness to residents’ concerns and scientists’ cautions, Cultural and environment redlines are crossed to chase tourists. \nThat’s at the rich end of the spectrum. Among the masses, pilgrimage turned tourism has meant a sharp uptick in accidents during pilgrim-festivals – yesterday’s Odisha stampede a case in point. Even simple trips turn into giant bling events in ecologically fragile regions. Garbage that mountaineers leave behind on Everest is well-documented. Boisterous walkathon pilgrimages such as the kanwar yatra, music blaring jaunts inside Ranthambore/Jim Corbett, weddings inside reserves and sanctuaries, there is nothing to stop the experience-seeker. Even those who would run away from it all do so in unsustainable ways – SUVs, air-conditioning in the hills, food wrappers, water bottles, trekking gear are bare essentials. In the last few years state govts and courts in southern states have restricted the scale of commercialisation for tourism. For instance, given the carrying capacity of Western Ghats roads – per TN govt 20,000 vehicles enter the Nilgiris every day – vehicle entry caps were imposed. In Coorg, estate conversions into resorts were stopped. Are the Himalayas the children of a lesser god? \n\n",
        "headline_1": "Match made in hell",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/match-made-in-hell/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-07-2025"
    },
    {
        "full_article": "We are shocked and outraged by the heinous treatment of a woman in Muradnagar, Cumilla. The woman—in her twenties and a mother of two—was not only subjected to rape but was further victimised when she was beaten, had her clothes torn off, and filmed by some local men. These individuals, at least four of whom have been subsequently identified and apprehended, uploaded the video online, sparking widespread outrage on social media. To some extent, it is this outrage that may have accelerated the authorities' response in apprehending the rapist, who reportedly had a history of stalking the victim. If visibility or outcry is the deciding factor here, one cannot help but wonder how many incidents of rape and torture go unnoticed and unresolved across the country, with victims ultimately receiving no justice as public attention shifts elsewhere.\nIn this particular case, alongside the public outcry, we have also witnessed a most distasteful barrage of mudslinging and slander against the victim—another, sadly familiar, response. Such vilification often silences victims while the perpetrators, who really should be the ones feeling the heat, walk away scot-free. We have also seen various political factions attempt to weaponise the suffering of the woman, who belongs to a minority community, for their own petty gains. Their lack of empathy or even concern for the victim of an egregious crime, trying instead to rationalise it, is shocking. Trying to examine the details of a crime is one thing, but having no regard for a victim and her right to justice, or worse, trying to justify the crime itself, is another. This was evident in the revealing of the Muradnagar woman's identity and the treatment she was subjected to afterwards. It sheds a troubling light on certain sections of our society, especially their attitude towards women.\nWe welcome the statements issued by the government, condemning the crimes committed against her and promising swift justice. The High Court's directives for the government to ensure her safety, to remove all videos, audios, and photos related to the incident from digital platforms, and for the relevant authorities to submit a compliance report within 15 days must be enforced strictly. Moreover, the court rightly issued a rule asking relevant departments why their failure to prevent the disclosure of the victim's identity, videos, and audios on social media should not be declared illegal.\nHowever, what we must also ask is, why does there have to be an outcry every time before such necessary actions are taken? Why can't victims receive the justice they deserve without being dragged through the mud, their privacy destroyed, and their character questioned in the court of public opinion? Is this how a proper, humane justice system should function? We demand that the Muradnagar victim be provided with the justice, protection, and respect that society and the justice system owed her all along, but have so far failed to deliver.\n",
        "headline_1": "Cumilla rape case exposes deeper failures",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/cumilla-rape-case-exposes-deeper-failures-3929241",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-07-2025"
    },
    {
        "full_article": "The stark image on the Time magazine's recent cover lingers like dust on the tongue: Iran's ageing Supreme Leader, Ayatollah Khamenei, his visage eroding, crumbling into the barren sands of a vast, indifferent desert. It's a potent metaphor—perceived fragility, shifting foundations, time grinding icons into nothingness. Yet, gazing upon this calculated vision of decay from Western media, a more unsettling question arises: Has the West, so fixated on the crumbling edifice of others, forgotten how to build dreams of its own? Has it traded the soaring cathedral of collective aspiration for the bomb shelter of dystopian anxiety?\nThe accusation that the West has \"forgotten to dream\" points to the atrophy of grand, positive, unifying narratives that once propelled the planet. Recall the electrifying surge of the Space Race—humanity stepping onto the Moon, a triumph of audacious imagination made manifest. Think of the muscular optimism of post-WWII rebuilding: forging welfare states and institutions from rubble, fuelled by belief in progress and shared prosperity. These were collective stories, imbued with faith in the future's positive possibilities, achievable through concerted effort. They embodied positive futurism—not merely preventing catastrophe, but imagining desirable worlds. They hinted at transcendence, reaching beyond material comfort towards human betterment and exploration.\nStep into today's landscape, however, and the air feels thinner, the horizons dimmer. The West navigates shadows. Popular imagination is saturated with dystopia: climate apocalypse, AI domination, societal collapse, zombie plagues. While often intended as warnings, their sheer volume creates a background radiation of despair, drowning out visions of a better world. This pessimism permeates Western political discourse, now reduced to perpetual crisis management—threats of terrorism, migration, adversaries; reactive scrambles over pandemics, inflation, polarisation, civil unrest. The electoral cycle shrinks the horizon to the next poll. Where is the soaring rhetoric for the next fifty years? Where is the leader articulating a future worth striving for—beyond mere survival?\nThe ground feels unstable. Economic realities—stagnant wages, yawning inequality, housing crises, evaporating mobility—have fostered entrapment and diminished expectations. The focus shifts from shared prosperity to security and retention. At the same time, techno-pessimism has replaced late-20th-century wonder. We see surveillance capitalism eroding privacy, social media fracturing minds, AI threatening jobs and agency. The digital promise has tarnished.\nFrancis Fukuyama's The End of History, flawed though it was, proclaimed liberal democracy's victory—a notion now in tatters. The West faces potent ideological challengers—Chinese authoritarianism, home-grown illiberal populism—while grappling with internal democratic decay. Confidence in the Western model as an aspirational endpoint has eroded. This is compounded by a palpable decline in trust in government, media, science, and religion—the scaffolding for shared dreams. Without belief in mediating structures, how can a shared future be forged?\nMoreover, vital struggles for individual rights and identity justice, while essential for equity, can inadvertently fragment the collective gaze. The intense focus on specific redress, as necessary as it is, can render broad, unifying aspirations either impossible or suspect. And looming over all are the twin existential threats of climate catastrophe and nuclear annihilation—long, cold shadows under which ambition seems naïve.\nYet, declaring the Western dream extinct is to surrender to the despair we diagnose. Look closer. The most potent expression of collective yearning is the climate movement. Born of crisis, its calls for a Green New Deal go further: they are ambitious visions of radical transformation. It's a dream not just of survival, but of a cleaner, fairer, more sustainable world. A form of positive futurism, forged in necessity. Similarly, social justice movements embody powerful dreams of radically equitable, inclusive societies that actively shape culture.\nEchoes of older ambitions persist, albeit altered. Space exploration rekindles—now billionaire-led endeavours to reach the Moon or Mars. Yet they feel more like elite, technocratic pursuits than galvanising public dreams. Niche techno-optimism lingers in Silicon Valley, dreaming of AI curing disease or delivering renewable abundance, often critiqued as naïve or elitist.\nPerhaps the key shift is decentralisation. Grand, monolithic narratives are scarce, but countless grassroots dreams flourish: hyper-local community building, urban farming, cooperatives, open-source innovation, and sustainable living experiments. The dream lives on—fragmented, localised. In arts and culture, while dystopia reigns, subcultures nurture niche utopias. Solarpunk imagines lush, sustainable tech futures; visionary artists craft hopeful alternatives. Dreams are increasingly reframed as resilience and adaptation—less about conquering nature, more about building robust communities to weather complex storms.\nThis raises hard questions. Is this decline uniquely Western? China promotes its \"Chinese Dream,\" India pulses with development narratives, Russia defies sanctions to build a sovereign economy, Africa buzzes with innovation. Yet all grapple with their own anxieties—inequality, environmental collapse, volatile politics. The human struggle for hope is universal.\nWere past grand dreams unproblematic? Far from it. Enlightenment progress was entangled with colonialism and exploitation. American Manifest Destiny fuelled genocide. Uncritical techno-optimism ignored ecological limits. Their decline may be a necessary reckoning with those shadows. Their exclusivity and destructiveness make us wary of simplistic visions. Is dystopia inherently negative? Not always. It can be diagnostic—a stark mirror, a motivator for change. Focusing only on positive dreams risks dangerous escapism.\nAnd the \"small dreams\"—of security, family, community, and meaningful work? Dismissing them is elitist; they are the bedrock of dignity. But a thriving civilisation needs both: proximate comfort and a transcendent horizon.\nWe must interrogate our systems. Does a media industry, fuelled by clicks from fear and outrage, suppress positive vision? Does late-stage capitalism—obsessed with short-term shareholder value, commodification, and endless growth on a finite planet—inherently stifle the long-term, collective imagination needed for better futures? The machinery grinds down our capacity to dream big.\nIs there a generational divide? Are Gen Z and Alpha, raised amid climate warnings, precarity, and digital saturation, more pragmatic, focused on justice and sustainability as non-negotiable, sceptical of grandiose past promises? Or are they still searching for collective hope?\nSo, has the West forgotten to dream? The answer is both lament and recognition: it's a profound shift, not a void. The character of dreaming has transformed. Grand, unifying techno-utopian dreams have receded. In their place: defensive dreams that are focused on preventing catastrophe—climate collapse, democratic decay, pandemics. They are born of necessity, powerful, but reactive. Then comes fragmented dreams, a vibrant tapestry of localised aspirations—community resilience, social justice, and cooperatives. They are rich and vital, yet lacking a unifying thread. Then there are critical dreams born from critique—radical equity, restorative justice, and systemic transformation. They act like potent engines for change, yet struggle to articulate a purely positive, shared future.\nUnderlying all this is a crisis of confidence. Faith in inevitable progress, in institutions' capacity to deliver a better future for all, has been shaken. We face unprecedented complexity: the Gordian knot of climate change, staggering inequality, tech disruption, geopolitical instability, democratic fragility. Grand dreams can feel like castles on sand in an earthquake zone.\nYet, the capacity persists, in the climate movement's urgency, social justice's moral force, grassroots builders' quiet persistence. The potential for renewal is real. The crucial question: can these diverse, often defensive or fragmented strands converge? Can the West weave nuanced, inclusive, compelling visions—not escapist fantasies, but realistic pathways towards something better? Dreams that promise not just survival, but flourishing?\nThe Time magazine's cover showed an image dissolving into sand. The challenge is not merely to mourn decay, but to remember how to dream in sandcastles. To envision structures of hope that point towards a horizon worth reaching. To reclaim positive futurism—not as denial, but as the essential light for navigating darkness. Our future depends on diagnosing the desert and rediscovering the collective will to imagine, and build, the oasis. The dream isn't dead; it's dormant – waiting for a narrative bold, inclusive, and honest enough to awaken it.\nZakir Kibria is a writer and policy analyst. He can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The desert and the dream: Can the West remember how to hope?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-desert-and-the-dream-can-the-west-remember-how-hope-3929191",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-07-2025"
    },
    {
        "full_article": "In recent years, the term \"lad culture\" has become a byword for a particular brand of hypermasculinity embedded within the social fabric of British university life. It's a culture defined not by camaraderie or confidence, but by coercion, misogyny, and a toxic entitlement that undermines the values of inclusivity and respect that higher education ought to uphold.\nHowever, the lad culture isn't exclusive to any single geography. Wearing different clothes and speaking in different accents, this culture is present in elite Bangladeshi institutions as well. Across university campuses, this male peer culture often escapes scrutiny, yet quietly shapes everything from classroom dynamics to campus safety. The performative masculinity glorifies dominance, belittles empathy, and trivialises women's voices and experiences. Often dismissed as harmless banter or \"just what lads do,\" this culture masks deep-rooted issues that merit serious scrutiny.\nWhile it may wear the face of fun, lad culture is frequently underpinned by attitudes that trivialise consent, devalue emotional intelligence, and encourage performative bravado at the expense of others. At its worst, it contributes to environments in which sexual violence becomes excusable, and victims are ignored or blamed.\nOriginally coined in the UK, the term refers to a group dynamic among young men that normalises sexist \"banter,\" casual misogyny, sexual harassment, and emotional repression. Think drunken initiation rituals, objectification, silencing of female peers in class, or dismissive attitudes towards consent.\nIn Bangladesh, while the behaviours may differ—as alcohol-fuelled rituals are rare due to legal and cultural constraints—the mindset is disturbingly familiar. The group of boys monopolising canteen space with crude jokes, \"locker room\" Facebook groups, the implicit belief that a man's worth lies in conquest or control—these are all manifestations of the same script, rewritten for a different context.\nLad culture here often intersects with class privilege and institutional power. In both private and public universities, male-dominated student politics, seniority hierarchies, and faculty-student dynamics often create spaces where women are objectified, excluded, or dismissed. What binds these expressions globally is the consistent theme of male entitlement: entitlement to space, to attention, to silence others, and most dangerously, to women's bodies.\nToo often, responses to lad culture amount to a checklist: a workshop during Freshers' Week, a poster on a wall, or a policy buried deep in a university handbook. These are not unhelpful, but they are insufficient. What's needed is a cultural shift that starts with leadership. Senior university figures must acknowledge the problem publicly and commit to change not just as a matter of liability, but on principle. This includes robust reporting mechanisms, transparency in handling complaints, and firm disciplinary consequences for perpetrators.\nAt its core, tackling lad culture is more than curbing bad behaviour; it's about reimagining masculinity by creating space for vulnerability, kindness, and mutual respect within male peer groups. It also means challenging the notion that feminism and male well-being are at odds. Lad culture harms men by pressuring them into emotional repression and hollow bravado that often conceals deeper struggles with mental health and identity. It restricts men, forcing them into a narrow mould of masculinity that discourages vulnerability, emotional openness, and respectful relationships. It creates peer pressure to act out, stay silent, or conform, even when it goes against one's better judgement. But that script can be rewritten.\nThe goal is not to demonise young men but to empower them to be better allies and equity partners, not bystanders or passive observers. Change won't happen overnight. But neither will it happen without concerted effort, uncomfortable conversations, and the courage to disrupt long-held norms.\nThe tragedy is that universities are meant to be places of transformation. They are meant to challenge outdated norms, not reinforce them. Yet, when lad culture thrives unchecked, higher education institutions risk becoming echo chambers of patriarchy, rather than catalysts for progress.\nIn the Global South, where access to education is expanding rapidly and youth populations are driving cultural change, this becomes urgent. Our universities have the chance to lead not by imitation of Western models, but by forging new paradigms of respect, inclusion, and gender justice.\nTo do that, universities must act, not react. Addressing lad culture requires a full-spectrum response. University administrations must publicly acknowledge the problem and take a clear stance. This includes implementing and enforcing transparent policies on harassment, bullying, and discrimination with meaningful consequences. Grievance committees must include diverse representation and operate with transparency and empathy. Gender education shouldn't be an extracurricular add-on. Universities should integrate discussions of power, privilege, masculinity, and consent into their curricula across all disciplines.\nSome of the most effective interventions are student-led. Programmes like \"Good Lad Workshops\" in the UK, or \"Boys for Change\" initiatives in South Asia, have shown how peer education can shift attitudes without shame. These efforts need funding, recognition, and institutional support. Universities should incentivise inclusive and creative student life that encourages mutual respect.\nChallenging lad culture isn't about waging war on men. It's about building better, freer, safer communities for everyone. Lad culture negatively impacts men more than we think or understand, and while policy matters, the real battleground is culture.\nMahapara Sanjana is a legal expert and academic. She can be reached at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Confronting lad culture in our universities",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/confronting-lad-culture-our-universities-3929141",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 01, 2025 00:00:00  \nThe withdrawal of the National Board of Revenue's shutdown programme has been greeted with a sigh of relief by all concerned, particularly the business community. It was businesses which suffered the most due to the two days' stoppage of export-import activities at all land and sea ports of the country. Thanks to the business leaders' mediation, the protesting NBR officials and employees under an umbrella named NBR Reform Unity Council and the government agreed to find an amicable solution to the problem arising out of the bifurcation of the apex tax body. That both the government and the strikers have found reasons to relax their rigid stance on the issue has presently saved the day for all stake-holders but this may not guarantee a permanent solution unless the NBR side finds logic in the proposed separation of the organisation. \nHowever, averting a collapse of the country's entire gamut of international trade is enough achievement. Opening the avenue for further negotiations now keeps the option clear for appreciating the split of the NBR in two entities on the part of the striking officials and employees and manoeuvring by the government to accommodate suggestions or demands with merit, if any, from the revenue board. Meanwhile, the declaration of the NBR service as essential is a clear signal from the government. The five-member advisory panel formed to look into the matter and negotiate with the representatives of the protesting NBR staff will have an opportunity to review all justified demands. But there is hardly any scope for compromising the fundamental principle of dividing the body allowing one part to formulate policies and the other part assigned to the task of tax collection. Funnily, the strikers tried to mislead the public by hoisting a banner in which they claimed their protest was in the interest of the state meaning the republic and against dissolution of the unified revenue board. \nFirst, there is no question of dissolution of the NBR. The interim government has taken pains to streamline the body and introduce clarity in order to turn an underperforming and, to go by public complaints, corrupt government agency into a bifurcated efficient and vibrant organisation. Since there is no bar to transferring employees and officers from one organ to the other depending on their knowledge, skill, efficiency and experience, the NBR staff has little to grumble about. The problem with the entrenched interest groups is that they are reluctant to change their old ways. Self-interest is blinding for organised groups which tend to wrest as much favour as possible through arm-twisting.\nThe country is passing a phase of acute economic and social crises. Reportedly, the bread winners of a segment of families -- the monthly income of which is within the range of Tk12,000-20,000 -- have to invariably skip their main meal. When government officials claim their protest is to secure the interests of the state or the people, it smacks of outrageous hypocrisy. No, the NBR employees and officials or for that matter their counterparts in the secretariat have not taken up any pro-people programme, rather those are geared to advancing their narrow interests. Yawning social disparities are vitiating society at large and even the student leaders who spearheaded the July-August movement with the clarion call for establishing a discrimination-free society are found muted on the issue.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Withdrawal of NBR strike: What next?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/withdrawal-of-nbr-strike-what-next-1751295864",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       July 01, 2025 00:00:00  \n\nThe darkest chapters in a nation's history are often written not by foreign enemies but by its own ruling forces. In Bangladesh, the scourge of enforced disappearances under the previous Awami League regime has emerged as one such shameful chapter -- a terrifying manifestation of state-sponsored violence, abuse of power, and the collapse of democratic accountability. Today, as the nation stands at a critical juncture in its political transition, the demand for justice is louder and more urgent than ever. And justice delayed in this case, as history repeatedly warns us, would be justice denied -- not just for victims, but for the very soul of the Republic.\nSoon after the fall of the Awami League government on 5 August 2024, the interim government acted with commendable resolve by forming the Commission of Enquiry on Enforced Disappearance. That commission recently submitted its second interim report, bringing to light findings that are as explosive as they are distressing. The report does not merely narrate individual acts of abuse -- it exposes an entire architecture of violence, linking the disappearances directly to the political and military high command.\nAccording to the Commission's findings, key political figures -- including Sheikh Hasina, General Tariq Siddiqui, the former Home Minister, and other senior officials -- were embedded in the strategic decision-making layer that had the authority to order abductions and extrajudicial killings. These were not rogue operations. These were calculated acts of terror designed to silence dissent, intimidate the opposition, and crush voices of resistance -- executed with military precision and political approval.\nThe report further revealed the existence of a clear chain of command: from the top civilian leadership to senior military officers and down to the operational ranks. Tragically, many of these mid- to senior-level officers, who could have served as critical witnesses, are now absconding. Their absence severely undermines the possibility of getting full truth and poses a major impediment to ensuring justice.\nThose officers who were strategically placed between the political command and the executing forces were in the best position to confirm that the orders for these crimes came from the highest levels of civilian authority. Their testimony would not only help to hold individual perpetrators accountable but also shield the broader institution of the military from unjust collective blame.\nBut their disappearance now threatens to cut off that essential link. This absence does not merely frustrate legal proceedings; it provides space for denials, disinformation, and ultimately impunity. It also risks painting the entire security apparatus with the brush of criminality, when in truth, responsibility lies with a handful of powerful individuals.\nThe Commission's findings show that even after the democratic opening provided by the regime change, a culture of silence and non-cooperation persists. \nFor instance, a former intelligence officer reportedly told the Commission that their unit had nothing to fear because, though they detained individuals incommunicado, they did not \"engage in other forms of misconduct.\" Such logic reflects a dangerous normalisation of illegal detention and a deeper institutional tendency to minimise or obscure wrongdoing.\nThis attitude not only frustrates justice but re-traumatises the families of the disappeared. Their anguish -- already immeasurable -- is deepened by the knowledge that those responsible are either in hiding or being shielded. The prospect of truth, accountability, and closure continues to be postponed indefinitely. That this is occurring after a change of government, when there was hope for transparency, makes it especially tragic and unacceptable.\nThe Commission has documented further disturbing developments. On 6 January 2025, the International Crimes Tribunal (ICT) issued arrest warrants for eleven individuals, including senior military officials formerly associated with the Directorate General of Forces Intelligence (DGFI). These individuals, the report reveals, were directly responsible for operations at the Joint Interrogation Cell (JIC) -- widely known as Aynaghar -- where many disappeared individuals were last seen alive.\nBased on the clear command structure, it is beyond reasonable doubt that these crimes could not have occurred without the explicit knowledge of DGFI leadership. Accordingly, the Commission requested the cancellation of their passports in November 2024 -- a request granted by the Ministry of Home Affairs. At the time of issuing the warrants, many of these accused were reportedly still residing in Dhaka Cantonment. However, none of the warrants have been executed to date.\nGiven that their passports were revoked, their escape raises grave questions about collusion or negligence within the security apparatus. Were they allowed to flee? Did someone within the chain of command deliberately turn a blind eye?\nThe Commission rightly warns that the failure to bring these crimes to justice will not only haunt the families of the disappeared but also erode the credibility of some national institutions. Indeed, the damage is already underway. Those within the forces who support reform and justice are finding themselves demoralised. If the senior officers can abscond without consequences, why should lower-ranking personnel believe in reform?\nThis absence of accountability sets a perilous precedent. It implies that political leaders and security officials can orchestrate the disappearance, torture, and murder of citizens -- and then escape justice simply by evading summons or hiding behind institutional shields. Such impunity is a direct threat to democracy, the rule of law, and human rights.\nJustice for the victims of enforced disappearances must be more than a slogan; it must be an uncompromising national commitment. The interim government must take decisive and transparent steps to locate and arrest the absconding security officials, using all intelligence and law enforcement tools at its disposal.\nThe authorities must hold accountable those who facilitated their escape, whether through inaction or active collusion.\nWitness protection should be ensured so that lower-ranking officers feel safe to testify about their orders and experiences.\n The government should engage international human rights bodies, including the UN Working Group on Enforced Disappearances, to lend support and legitimacy to domestic efforts.\nHistory is watching. So are the victims' families, who have spent years in despair, often holding on only to the hope that the truth will someday be known and justice served. If this hope is crushed now, it will not be a mere policy failure -- it will be a moral collapse.\nMore than anything else, the enforced disappearances under the previous regime represent a betrayal of the social contract between the state and its citizens. Unless justice is done -- and seen to be done -- that contract remains broken. And in a broken republic, no one is truly safe.\nThe victims of enforced disappearance are not just statistics. They were sons, daughters, fathers, journalists, political opponents, and activists. They had names, dreams, and rights. To abandon them now is to abandon the very ideals upon which our Republic is founded.\nJustice must not only be pursued - it must be delivered. And it must be delivered now.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Enforced disappearances: Justice must be done",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/enforced-disappearances-justice-must-be-done-1751295918",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       July 01, 2025 00:00:00  \n\nOur very familiar and favourite summer fruit, mango, has been put in a new light by highlighting its health benefits in recent media reports. People of this part of the world have been cultivating this fruit for at least 4,000 years. So, the people of Bangladesh hardly need to be reintroduced to this popular fruit. And they will eat this fruit no matter how many types of micronutrients, anti-oxidants, fibres, vitamins etc., it may or may not contain. But sometimes discovering some great qualities in an otherwise ordinary thing may increase its value to the public. One may recall how the commonplace amloki (botanical name, Phyllanthus emblica), also known in English as Indian gooseberry, became a much sought after medicinal fruit after late Dr Badruddoza Chowdhury, when he was a famous practising physician, praised it (amloki) for its high vitamin-C content. Notably, Dr Chowdhury used to present a popular programme 'Apnar Doctor', on BTV where he popularised Amloki for its many medicinal properties. However, later he turned to politics and became president of Bangladesh (November 14, 2001- June 21, 2002) .\nBe that as it may, mango is a different case altogether. Though it cannot be made more popular by singing its praises afresh, some people who earlier were not a great admirer of this fruit may now consider it positively given its health-giving attributes. A report, for instance, says that the vitamin B6 that mango contains improves mood, memory and cognitive function. It also helps manage stress and anxiety as it increases production of serotonin, the so-called 'feel good' chemical in the body that helps regulate many bodily functions, including mood, bowel movements and sleep. To the modern mental health conscious men and women, this is definitely good news. Also called the 'king of fruits', mango may now catch many young people's fancy who would otherwise avoid eating any kind of fruit whether indigenous or foreign.\nBut more than its health benefits, mango has also been used in the past as part of the so-called 'mango diplomacy' to improve diplomatic ties with neighbouring countries. Diplomacy apart, mango's potential as a foreign currency earner through export is yet to be fully exploited. Though Bangladesh produces some best varieties of mango with their exquisite taste and smell in abundance, it is yet to make its mark as a major mango exporting country with Mexico exporting more than 421,000 tonnes of mango every year. Other mango exporters include Thailand, Brazil, Peru, Netherlands, India, Pakistan, Vietnam, Spain and Ecuador.\nObviously, mango's is a competitive international market and the government should keep this in mind while promoting its export overseas. \nAccording to the Department of Agricultural Extension (DAE), Bangladesh produced over 23,50,000 metric tonnes of mango by bringing about 2,03,000 hectares of land under cultivation in FY21. In FY23, the production rose to over 27,00, 000 metric tonnes. However, in the FY24, the total production was over 25,00,000 metric tonnes. Compared to production, the export performance of mango cannot be said to have been very impressive so far. According to a report of this paper, some 3100 tonnes of mango were exported in FY23, but it fell to 1,321 tonnes in FY24. However, Mohammad Arifur Rahman, Project Director of the Exportable Mango Production Project (EMPP) under the DAE, reportedly told the media that the government was going to export 4,000 tonnes of mango within the next three months and that meanwhile some 600 tonnes have been shipped to 25 countries. The largest destination of mango so exported is the United Kingdom (UK), or more particularly, England, the official further informed. Evidently, the main consumers of the exported mango are the members of Bengali diaspora in the UK. Last year, around 1,320 tonnes of mango were exported to 21 countries, it could be gathered. In terms of exported volumes, the major export destinations of Bangladeshi mango include the Middle Eastern countries, Europe, Canada in North America, Singapore and Hong Kong of Soitheast Asia and the Far East.\nBangladeshi mango also needs rebranding to unlock its full export potential.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Untapped potential  of mango",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/untapped-potential-of-mango-1751295973",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 01, 2025 00:00:00  \n\nIn recent years, our lives have been significantly dominated by social media scrolls and 10 - 15-second videos. Our attention spans are shrinking every day, and with them, our ability to engage with thoughtful, long-form content. Instead of books or articles, we are now consuming information in bite-sized, flashy formats for instant gratification.\nThis shift isn't just a cultural trend; it's a crisis for critical thinking. When this shallow content becomes the norm, context and informed perspectives suffer. This decline in reading habits particularly impacts our younger generations. They are growing up in an environment where scrolling replaces reflection.\nAs writers and content creators, we have a responsibility in this situation. We have to resist the pressure to oversimplify and instead advocate for substance. Thoughtful writing, whether in the form of blogs, editorials, or even social media posts, still has the power to spark change, inform the public, and preserve intellectual curiosity.\nIf we can encourage meaningful content creation and rekindle the love of reading, we can shape a smarter, more thoughtful generation. The future of writing shouldn't be about speed, it should be mindful.\nAmena Akter Farhana\nEconomics Department\nGovt. Titumir College\nfarhanaaktheramena@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The death of deep reading",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-death-of-deep-reading-1751295997",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-07-2025"
    }
]