[
    {
        "full_article": "At the midnight hour on a magical Sunday, Harmanpreet Kaur and her incredible women made their tryst with destiny. India was finally crowned world champions in women’s cricket. It was a journey marked by a long history of angst and joy, shaped by the sweat and dreams of pioneers such as Shantha Rangaswamy, Diana Edulji, Mithali Raj, and Jhulan Goswami. In a high-stakes final befitting an ICC World Cup, India prevailed over South Africa by 52 runs at Navi Mumbai’s D.Y. Patil Stadium, which turned into a teeming mass of raucous energy. This moment is as epochal as it was for Kapil Dev and his men in 1983 when they seized the World Cup at Lord’s. That caused a seismic shift in the way cricket was perceived and administered and paved the way for India to become a commercial behemoth. A similar turn of events awaits Harmanpreet and company, and women’s cricket at large. The coach, Amol Muzumdar, too had his moment. A domestic giant, he never got a chance to play for the senior men’s team as his career ran parallel to the likes of Sachin Tendulkar and Rahul Dravid. Harmanpreet’s feisty women ensured that their mentor finally understood what it means to prosper at the highest level.Having faltered in the 2005 and 2017 World Cup finals, India also had to contend with the pressure of playing at home. When three league matches were lost on the trot against South Africa, Australia, and England, the knives were out on social media. Still, the team persevered and every game produced a new star — Pratika Rawal, for instance. In the final, Shafali Verma and Deepti Sharma turned in an all-round show, while Smriti Mandhana was as solid as ever. Earlier, the turn towards glory happened in the semifinal when Jemimah Rodrigues anchored an astounding chase against defending champions Australia. Her unbeaten 127 is one of the greatest knocks in Indian cricketing history. If India performed the giant killing act towards the climactic phase, so too did South Africa, as England discovered in the semifinal. In skipper Laura Wolvaardt, the Proteas have a splendid batter and her two tons in the semifinal and final were high on class and pugnacity. But the biggest takeaway is this: Indian women have found their place on cricket’s biggest stage. Published - November 04, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Women’s Cricket World Cup\n                    \n                            /                      \n                        \n                        cricket",
        "headline_1": "Women’s world: On India’s victory in the World Cup",
        "headline_2": "The World Cup win came after a long struggle on and off the field",
        "link": "https://www.thehindu.com/opinion/editorial/womens-world-on-indias-victory-in-the-world-cup/article70236318.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-11-2025"
    },
    {
        "full_article": "Kerala, known for its exemplary record in social and human development, and for healthcare systems comparable to those of developed nations, achieved another milestone on its 69th formation day, on November 1 — the eradication of extreme poverty. This resulted from a four-year, meticulously planned programme involving a gamut of agencies,  spearheaded by the local self-government department, alongside extensive community participation. It was during the first Cabinet meeting of the second LDF government led by Pinarayi Vijayan in May 2021 that the Extreme Poverty Eradication Programme (EPEP) was launched. Successive State governments deserve credit for Kerala’s people-centric development and decentralised planning, which ensured that poverty reduced from 59.8% in 1973–74 to 11.3% in 2011–12. NITI Aayog’s National Multidimensional Poverty Index (2023) stated that Kerala was the least impoverished State, based on the headcount ratio. Just 0.55% of Kerala’s population was multidimensionally poor — far below the national average of 14.96%. Instead of relying on self-enrolment, the government deployed nearly 4 lakh trained enumerators, supported by a robust local body system and Kudumbashree workers, to identify the abjectly poor. After several levels of vetting, 64,006 extremely poor families — comprising 1,03,099 individuals, many lacking basic documents — were identified based on the four-point criteria of access to food, health, means of livelihood, and housing. A uniform solution was inadequate for such diverse needs, necessitating an experiment in welfare governance: the preparation of custom-made micro plans for each identified family and the provision of essential support such as identification documents, housing, livelihoods, regular medicine, cooked meals, palliative care and, in some cases, organ transplants.Combating poverty is a never-ending task and criticism of the claim of erasing extreme poverty — particularly regarding the plight of the tribal population — is inescapable. The State government has launched EPEP 2.0 to prevent relapse and to ensure that no new household falls into extreme poverty. The LDF has pledged to tackle all forms of poverty in mission mode. Critics of the ‘Kerala Model’ have often cited stagnant growth and rising unemployment as evidence of its perceived failure. The State has accelerated major infrastructure projects and high-tech green industries to bridge the deficit in these areas. It has also been skilling the educated to alleviate joblessness. The EPEP shows that progressive governance can be rooted in welfarism and growth simultaneously, without compromising social safety or sustainability. The largely community-driven model may not be flawless, but it is self-evolving and strengthens democracy at the grassroots. It presents an alternative development paradigm — a Kerala story worth propagating. Published - November 04, 2025 12:15 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Kerala\n                    \n                            /                      \n                        \n                        poverty",
        "headline_1": "A Kerala story: On eradication of extreme poverty",
        "headline_2": "Eradicating poverty should be seen as a never-ending task",
        "link": "https://www.thehindu.com/opinion/editorial/a-kerala-story-on-eradication-of-extreme-poverty/article70236347.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-11-2025"
    },
    {
        "full_article": "India’s Women’s World Cup winners show what can be achieved if more daughters get their fair shakes at greatness\nLooking around the stadium stands on Sunday, one pairing really stood out – that of fathers and daughters. They seemed to be basking particularly bright in the glow of what was happening on the field: Women in Blue fighting to lift their first ICC World Cup. In this team, supporting fathers’ role is a golden thread running through several backstories – Harmanpreet Kaur to Smriti Mandhana, Pratika Rawal to Shafali Verma. The father-daughter relationships represented by these players and this audience inspire hope precisely because these are not the norm. Far from it.\nConsider Chandrika Chaudhary, an 18-year-old from Gujarat’s Banaskantha who scored well in NEET, allegedly killed by her father as he didn’t want her going away to medical college and falling in love.Or 25-year-old Radhika Yadav, a tennis coach in Gurugram, allegedly shot dead by her father as he didn’t like her running a sports academy. These are random recent examples of a familiar headline. Maybe these are not the norm either. The vast majority of fathering happens between these two extremes. But the norm is conservative for sure, which means it actively stops daughters from reaching their full, free potential.\nDaughters continue to be weighted down with all kinds of oppressive ideas of family ‘honour’, even where they get educational and work opportunities. There’s the cute Papa ki pari dynamic. The same father who encourages his daughter’s MBA still expects her to prioritise marriage at a certain age, that too per his choice. In the end, the fence he has preserved stays higher than the bridge he has built. That means for every CEO, scientist, artist, sportswoman who credits her father for creating space for her ambition, countless daughters remain tied inside often tyrannical conventions. Their dreams are crushed to guard their ‘reputation’.\nOften the fathers’ excuse is that they’re guarding their daughters from an unsafe world. And it’s true that govts to sports bodies, our institutions are failing to make public spaces safe for women. But that’s zero justification for the abuses within the family. A father should give a daughter seed capital for her start-up on the same terms as her brother. She should be as free to live in a far engineering hostel as him. Or pursue a brilliant career. Forcing her mind and body into narrow domesticity isn’t just individual loss. All of India is poorer for every innovator, entrepreneur, leader who never gets to be because she’s a woman. Sunday was a glimpse of what would come true if more fathers were more enlightened.\n\n",
        "headline_1": "Message To Fathers",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/message-to-fathers/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-11-2025"
    },
    {
        "full_article": "Why those who succeed great business creators must not be assessed as ‘true’ legatees\nThere’s contestation around Ratan Tata’s legacy. Hardly surprising. This always happens upon the passing of those very few people who can be credited with creating something special. Remember, though, that debates and worries about legacies and legatees rest on the assumption that the key remit of a successor is to be ‘true’ to the ‘vision’ of his great predecessor. This is a problematic assumption. It assigns less value to the core remit of the successor: grow the business. Tim Cook didn’t constantly worry whether he was being true to Jobs’s ‘vision’. But he’s turned Apple from a premium device-maker to a massive, multifaceted company, with businesses ranging from payment services to an Oscar-nominated TV and film production studio. He’s acquired more than 100 companies. Cook will never be a Jobs. But he’s more than done his job.\nThe legacy question will matter less if exceptionally talented leaders were indifferent to it. Acquiring such indifference isn’t easy. But it’s not impossible. Remember, if you worry about your legacy, your core team will amplify it, and your successor will have even more to worry about. That’s surely not good news for the great thing you created. Worries about legacies can produce seriously negative outcomes. Even for countries. British political elite’s obsession with being faithful to the Churchillian legacy burdened a small island country, which no longer had an empire it could exploit, to act like a big global power. Thus Brexit. And thus Britain’s stalled economy and its occasional tragicomically unsuccessful attempts to get noticed on big stages. China moved past Mao’s legacy, India upended Nehruvian economics – both benefitted.\nThere’s something called Founder’s Syndrome, which happens when talented creators refuse to see that the world has changed. The legacy question is a variation of this. If successors are evaluated as ‘true’ legatees, they will try to protect what’s old, while new things keep happening around them. New beginnings require definitive endings.\n\n",
        "headline_1": "The Legacy Question",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-legacy-question/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-11-2025"
    },
    {
        "full_article": "Some aunty national friends review Sunday’s win\nKamala was ecstatic – for once she had sat up late with her friends to watch a cricket match – and had her tryst with destiny at midnight. She cheered every catch and shouted for every boundary. I even got punched a few times as the available mascot of misogyny. ‘Why do men imagine that women know nothing about cricket?’ the wife demanded aggressively as I took on a well-deserved tirade on behalf of every Indian male.\nShe threw everything but the kitchen sink at me, in response to the trolling that the team faced after three straight losses earlier in the World Cup. ‘It’s just a game – not even a gentleman’s game anymore! And every game will have its share of wins and losses. When will cricket fans understand that women’s cricket is played with as much sincerity and dedication? And that every loss need not relegate the woman sportsperson to The Great Indian Kitchen.’\nKamala had decided to use the bulldozer approach against toxic masculinity and prevalent patriarchy, while her aunty national friends nodded in approval. ‘You gave up on the semi-final match when they had a huge total to chase but they stayed focused and achieved the impossible.’ We had watched that post-match press conference and commented on the display of vulnerability. ‘Oh Jeez, when Virat speaks about depression or anxiety, it’s taken as a sign of emotional maturity. But if Jemimah does the same, it’s a girl crying after an important match. Men can cry and women can too – it’s a high-pressure game and like a pressure cooker, it’s good to let off steam.’ The kitchen references were back, but I was careful not to comment, in case I got bludgeoned with a rolling pin.\nMost of us can name several prominent male cricketers but for the first time the names of these tough young ladies are being mentioned with pride. These victories should also help to break the victim blaming after every untoward incident that involves a woman – she should inform the authorities before stepping out, she should dress a certain way, she should not be out late at night, she should not be on the cricket field! The Girls in Blue are breaking more than colour stereotypes. They are saying women can stand the heat and get out of the kitchen whenever they choose, onto whichever field they choose.\n\n",
        "headline_1": "Maiden Over",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/maiden-over/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-11-2025"
    },
    {
        "full_article": "Handle with humour, not hubris. Irony most welcome\nEvery few decades, humanity wakes up to a new species disguised as its own offspring. It answers to the same surnames and yet speaks an alien dialect of emojis, acronyms, and irony. Today we call them Gen Z, though earlier centuries had other names for their precocious rebels, heirs, heretics, hippies, or, as elders universally muttered, ‘What is the world coming to?’\nEvery generation forgets how little respect it once had for the one before. Each assumes it has reached the peak of wisdom, only to discover, decades later, that the next has climbed a little higher but with louder music. Socrates complained of youth corrupted by conversation, Shakespeare of lovers who wrote too much verse, and our own elders of those who WhatsApp too much and now they only voice message.\nIn truth, the baton of civilisation has always been passed through rebellion. Every new generation is born with better tools, faster thumbs, and low on patience. Gen Z’s battlefield is the comment section; they speak fluent emoji accompanied by filters, hashtags, irony. The young have always been impatient with hierarchy and hungry for change, it’s the natural law of evolution: the species survives because it dares to think different.\nThey multitask between activism and aesthetics, sarcasm and self-care. They are aware of every issue, sometimes of nothing deeply. But before we judge their impetuousness – recall Ishit ‘Rudeboy’ Bhatt and the social-media storm that followed – let us admit we created their impatience. We handed them an endless buffet of ‘digitopaedias’ and then complained when they questioned our dinner-table wisdom.\nIt is, after all, difficult to preach patience to a generation that measures time in buffering seconds. Beneath their bravado lies brilliance. They may roll their eyes at rules, but they instinctively fact-check our sermons, though one is never sure of the motivation behind the algorithm claiming the ‘fact’.\nSo let us retire the sermon and begin a conversation to learn the language of listening. Because every attempt to command the next generation ends as it always has: with rebellion, ridicule, and reels. The truth is that evolution has no pause button. Each generation grows up faster, learns sooner, errs earlier, and matures later. They will make their mistakes, just as we did, only in higher resolution and with more followers watching. So the next time we despair at their slang, remember: they aren’t ignoring us, they’re just buffering.\n\n",
        "headline_1": "The Next Gen manual",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-next-gen-manual/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 04, 2025 00:00:00  \nFor tens of thousands of people, Dhaka City's iconic infrastructure as well as service is the metro rail. In the context of long tailbacks on the city's roads and streets, the service metro rail renders is refreshing and this is despite the occasional irregularities caused by technical malfunctions. In a megacity like Dhaka where movement of vehicles is hardly speedier than normal walking, the time taken to commute from Uttara to Motijheel or between stations is many times shorter than commute by any other vehicle on streets. But only recently have the general public become aware that not everything is fine with the metro rail's system. The killing of a pedestrian near the Farmgate metro station following the fall of a bearing pad on him brings the safety issue to the fore. If bearing pads weighing 140-150 kg are set in between the pillar and viaduct to control a train's movement and absorb shock and vibration can slip from its position, it indeed is a cause for serious concern. \nThis leads to public apprehension that all is not well with the iconic system. Now reports carried in the media confirm their apprehension. There are defects and lapses galore. According to one report, the Dhaka Mass Transit Company Limited (DMTCL), responsible for operating the metro, has identified as many as 45 flaws and shortcomings in the system. Although, some officials of the DMTCL have assured that those problems are unlikely to cause major accidents, passengers are unlikely to be convinced, particularly after the fall of the bearing pads. Notably, another bearing pad also came off from the Farmgate segment about six months ago. That the DMTCL prepared and sent a report, informing the contractor and consultants of the various faults and discrepancies in May last, it was not made public. A similar intimation was given to them in September, seeking redress to the various problems or inadequate performances. A few of the problems were half-heartedly taken care of but there was no lasting solution. \nInvolved here is a technical issue. The defect liability periods (DLPs) ---varying from one party to another but not exceeding one to two years---for most of the parties are now over. So the liable parties are not legally bound to respond to the DMTCL's call for repair and readjustment. Why did the DMTCL not initiate inspection of the safety systems either on its own or by a third party much earlier? A comprehensive inspection should have been carried out to find the various problems before the handover for operation of metro rail. \nExperts voice their concern that the commissioning of the metro rail without readying the required human resources is to blame for certain lapses in the system. The contractors have also taken advantage of the rush in commissioning by supplying some lower quality parts or instruments which have already been rusting. If displacement of bearing pads can occur and force suspension of metro rail operation, problems like rusting can as well cause disruption. A rusted instrument can also come off and end up causing a mishap. Before the problems become further complicated, it is wise to negotiate a deal on the safety issues with various parties involved with the project.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "How much flawed is Dhaka's metro rail?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/how-much-flawed-is-dhakas-metro-rail-1762184805",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       November 04, 2025 00:00:00  \nIt was a bright afternoon on October 26, 2025, when tragedy struck once again in Dhaka's Farmgate area. A bearing pad from the city's metro rail infrastructure fell from above, fatally hitting a young man named Abul Kalam Azad. He died on the spot-leaving behind a grieving mother, a devastated wife, and two bewildered children. Several others were also injured in the incident. No amount of government compensation can ever make up for the loss of a human life.\nThis was not an isolated accident. In September 2024, another bearing pad had detached from a metro rail structure in Dhaka. That time, no one was killed, but train operations were suspended for 11 hours. A committee was formed to investigate, as is customary after such mishaps. But it appears that because there was no loss of life, the investigation was treated as a mere formality. Otherwise, it is inconceivable that a similar accident would occur just one year later-within the same project and under similar circumstances.\nThe recent tragedy is far graver because it involved the loss of human life. And this raises serious questions about the integrity, accountability, and professional standards behind the country's most ambitious urban transport project.\nIn developed countries, consulting and design firms involved in large-scale infrastructure projects are required to purchase high-value insurance coverage for every project. This insurance ensures that if a structural failure occurs or if a design is found faulty, the insurer compensates the victims and bears the costs. In many cases, even globally renowned engineering and construction firms have gone bankrupt after being held liable for such failures.\nSuch stringent systems compel consulting firms to double- and triple-check their designs to eliminate technical faults. These checks are part of a culture of accountability-one that Bangladesh's infrastructure sector desperately lacks.\nThe question now is: who should investigate this tragedy? The answer lies in independence and expertise. The investigation team must include structural and civil engineers who have practical experience in metro rail design, construction, and safety auditing-but who have never been involved in the current project. Their detachment from the project is essential to ensure impartiality.\nAlongside technical experts, the committee should also include a non-technical professional-someone capable of coordinating the investigation and integrating findings into a coherent, objective report.\nTo prevent such disasters from recurring, Bangladesh must form a powerful and credible investigative team composed of both local and international experts. Since Japanese technology was used in the Dhaka Metro project, one or more Japanese specialists should be included in the team. They would bring valuable knowledge of Japan's design codes and safety standards-something no outsider could fully replicate.\nHowever, any Japanese expert or firm that has previously been associated with the Dhaka Metro project should be excluded to avoid a clear conflict of interest.\nBeyond design issues, the investigation must also probe whether there were lapses in the construction phase. Even the best design can fail if poorly executed on the ground. Substandard materials, compromised workmanship, or oversight negligence can all contribute to catastrophic failure.\nIf engineers, consultants, or contractors have relevant experience in metro projects elsewhere-but no prior involvement with the Dhaka Metro-they should be considered for inclusion in the investigative process. Only such a team, combining credibility and competence, can produce a report that the public can trust.\nReports suggest that the Bangladesh University of Engineering and Technology (BUET) had earlier raised objections regarding the quality of the bearing pads used in the metro rail project. However, those warnings were allegedly brushed aside, and the questionable components were still installed.\nIf this allegation proves true, it represents a serious failure of governance and technical oversight. The new investigation committee must take this claim seriously and determine how and why these safety concerns were ignored.\nSome experts have argued that vibrations and added pressure in the curved section of the track may have caused the bearing pad to dislodge. This explanation, however, is unsatisfactory. Curves are common features in metro rail systems worldwide-from Tokyo to London-and yet such accidents are almost unheard of. Except for catastrophic natural events like Japan's 1995 Kobe earthquake, bearing pad failures in metro systems are extremely rare. The fact that it has happened twice in Dhaka in just two years points unmistakably to deeper structural or design flaws.\nIf Japanese metro systems have not experienced such accidents, why has this occurred repeatedly in a project executed with Japanese technical assistance in Bangladesh? The government must scrutinize the competence and credibility of the foreign contractors and consultants involved.\nWere they truly qualified and experienced, or were compromises made during their selection due to external influence or bureaucratic pressure? Bangladesh's experience with major infrastructure projects-where contracts are often influenced by lobbying rather than merit-demands that such questions be asked boldly and answered transparently.\nA public infrastructure project funded by taxpayers and foreign loans cannot afford such opacity. The selection process for design consultants and contractors must be re-evaluated to ensure technical merit prevails over personal or political connections.\nImmediate measures are needed to inspect all bearing pads installed throughout the metro rail network. A comprehensive structural inspection should be carried out to identify visible and potential weaknesses. Any defective components must be replaced without delay, and bureaucratic hurdles must not stand in the way of public safety.\nThis task should not be seen as routine maintenance; it is a critical emergency measure to prevent another tragedy.\nBangladesh's rapid urbanisation demands modern transport systems, but it also demands a shift in mindset-from project completion to project integrity. Infrastructure must not only be built fast but built safely.\nThe current tragedy should serve as a wake-up call to move beyond bureaucratic investigations and cosmetic reports. What the country needs is a transparent, technically sound, and accountable process that ensures such avoidable deaths never happen again.\nIn Japan, where many of Dhaka's metro engineers were trained, safety is not a slogan-it is a culture. Every nut and bolt, every concrete beam and bearing pad, is checked and rechecked. Accountability is embedded in every stage-from design to delivery.\nFor Bangladesh, this tragedy offers a painful but necessary opportunity to learn and reform. The government must ensure that future infrastructure projects-be they metro lines, flyovers, or expressways-undergo independent audits and are insured against design or construction failures.\nAbul Kalam Azad's death should not be another statistic lost in official paperwork. His family deserves not only compensation but justice-justice in the form of systemic change.\nThe investigation must not end with a few low-level scapegoats. It must identify whether negligence occurred at the design, construction, or oversight level—and hold accountable those responsible, regardless of their position or affiliation.\nOnly through such uncompromising pursuit of truth can Bangladesh begin to restore public confidence in its megaprojects.\nUntil then, every concrete pillar and bearing pad hanging above the city's crowded streets will remain not just a part of Dhaka's skyline-but a reminder of the lives that hang precariously beneath it.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Safety measures must to restore confidence in metro rail",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/safety-measures-must-to-restore-confidence-in-metro-rail-1762184845",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       November 04, 2025 00:00:00  \nLead poisoning has been a serious public health issue in Bangladesh since early 1990s affecting mostly children. Suspecting that burning of leaded-gasoline was a source of lead pollution in the environment, in 1999, the government of the time banned the use of leaded gasoline. Now, informal lead-battery recycling plants are found to be the worst source of lead pollution in the soil, water and air. And since children can absorb lead in their body more readily than adults, they are more vulnerable to lead poisoning and in greater numbers. In a 2022 study high 'blood lead levels' (BLLs) could be detected in 40 per cent of the children under the study. \nStudies by Pure Earth, Global Alliance on Health supported by USAID and others found that more than 36 million children, about 60 per cent of all children in Bangladesh, have high BLLs due to exposure to the hazardous heavy metal arising from unsafe battery recycling practices. But now it is not only humans, farm animals are also not immune from lead poisoning. A recent report says that chemical wastes from an illegal battery recycling plant in Digri Char area under Sadar upazila of Jamalpur have for the last one month polluting local environment including croplands and grazing pastures for farm animals. According to reports, tragedy struck farm animals owned by landless farmer, Hekmat Ali, when on the morning of October 28, he found that four of his cows had died while eight others fell critically ill. \n\nIt is suspected that the animals ate grass and water contaminated by acid waste from the battery recycling plant dumped on the local grazing fields. Locals further reported that their farm animals including goats and poultry birds such as ducks and hens had also died for similar reasons. The poor farmer who, as could be learnt, sold milk of the cows as part of his family's livelihood. But what was the Department of Environment (DoE)'s office in Jamalpur doing all the while when toxic acid and burnt materials from the illegal battery recycling plant in the Mirzapur village had been leaving a devastating impact on the animal and plant lives or, in other words, the ecology of the village and its surrounding areas including the river Brahmaputra? It could be further learnt that the battery recycling plant in question has not obtained any clearance from the district's DoE office. Strangely, the DoE officials of Jamalpur were not even aware of the illegal battery recycling plant's existence until the deaths of the farm animals were reported. But then what was the local administration doing? Jamalpur Sadar UNO under whose jurisdictions the illegal plant operates was also reportedly not aware about the battery recycling plant as she was attending a training course. But then one wonders how the illegal battery recycling plant's month-long operation that was severely affecting public health as well as the health of livestock population of Digri char area escaped notice of Sadar upazila UNO office's other members.\nIt is clearly an instance of gross negligence on the part of both DoE and the local administration. And if this is the story of a single informal battery recycling plant, then who knows where the used batteries of some 7 million three wheelers, according to a government estimate, running across the country are being dumped? Is there any policy to monitor those unregulated battery recycling plants in the country? \nIn April 2025, according to the Bangladesh's Department of Environment (DoE), it reportedly shut down 16 illegal lead smelting sites and destroyed six furnaces near Dhaka. This is about only a few illegal lead smelting sites around the capital city. One can only hope that the government would be able to track and take necessary action against all the unreported and unregulated battery recycling plants spread across the country.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Unregulated battery recycling plants",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/unregulated-battery-recycling-plants-1762184926",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 04, 2025 00:00:00  \nBangladesh's city line is changing rapidly, from expressways to metro rails- we have got it all covered. This rapid development, while contributing to faster, safer, and cheaper commutes, has led to a series of fatal accidents resulting primarily from structural failures and lack of accountability. These casualties, growing in number by each day, raise severe concerns regarding road safety in Bangladesh.\nThe most recent casualty occurred on October 26, 2025, when a large bearing pad fell from the elevated metro line onto the street, killing one pedestrian and injuring two in Farmgate, Dhaka. A similar incident had occurred, near the same area, on September 18, 2024, in which there had fortunately been no deaths. Another fatal occurrence took place on August 15, 2022, when a heavy girder fell from a crane onto a private car in Uttara and killed five members of the same family, including two children. \nNot too long ago, in July 2025 a woman fell into an open drain in Tongi, Gazipur and her dead body was discovered 2 days later. Two such deaths occurred in 2020, five in 2021, three in 2023, three in 2024, and two so far this year. Another tragedy unfolded in February 2021 when a woman died after a brick fell on her from an under construction building in Dhaka's Demra area. These incidents are not isolated events, but reflect a shocking pattern of negligence by the concerned authorities and the government. While infrastructure mishaps mostly consisted of potholes and bumpy roads in the past, now they have morphed into unforeseen mechanical failures leading to fatalities. It appears that the development of our country's infrastructure is coming at the cost of people's lives and safety. Despite warnings from experts and investigations, such recurrences are a cause of great alarm. Swift action should be taken to identify and address the causes of these repeated accidents. In the meantime, public confidence can be restored by holding those responsible accountable.\nAisha Siddiqa and Tasnim Faruk\nBashundhara Residential Area\nDhaka\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Development or death traps?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/development-or-death-traps-1762184953",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-11-2025"
    }
]