[
    {
        "full_article": "The abrupt decision by Jagdeep Dhankhar to resign as the Vice-President of India raises several questions about the relationship between the executive and Parliament. Also in focus are the dynamics within the ruling BJP. The Vice-President is also the chairman of the Rajya Sabha. Mr. Dhankhar is the first Vice-President in the history of the Republic to resign this way — some of his predecessors who resigned before completing their term had the reason of moving on to get elected as the President of India. While his resignation letter cites health reasons, it is clear that his decision was driven by other factors which remain speculative at this point. What is evident is that some of the developments on Monday had snowballed into a situation in which Mr. Dhankhar found exit to be the only viable path. He was active in his duties as the Chair, on the first day of the monsoon session of Parliament, and his office had also announced his public engagements for the week. After a health incident earlier this year, Mr. Dhankhar had returned to active public life, but nothing that had happened on Monday (July 21, 2025) necessitated a health-related decision. However, his decisions and statements on Monday citing parliamentary rules were in conflict with the script that the government had prepared for the removal of a Delhi High Court judge on charges of alleged corruption. His relationship with the executive had been souring for a while, but his position on judicial accountability, and the relative roles of the Lok Sabha and the Rajya Sabha in seeking it, turned out to be an inflection point, as it appears.Mr. Dhankhar’s conduct as Chair of the Rajya Sabha during the last three years has been controversial. His partisan approach led to a motion for his removal by the Opposition, another first in parliamentary history. He questioned the inclusion of the words ‘secular’ and ‘socialist’ in the Constitution, publicly aligning with the RSS’s call for a debate on them. He has been a champion of parliamentary supremacy in the context of judicial independence and vocal about corruption in the judiciary. While seeking to uphold the supremacy of Parliament and to draw a line of acceptable conduct for the judiciary, he entertained an Opposition move to impeach Justice Shekhar Kumar Yadav of the Allahabad High Court who had made communally charged remarks in public. Mr. Dhankhar acknowledged receiving a motion signed by over 50 MPs for Justice Yadav’s removal and said he was verifying their signatures. He had also accepted an Opposition motion for the removal of the Delhi judge. Mr. Dhankhar had few options other than what he did, going by the rules. But that put him on a collision course with the government. His resignation weakens India’s parliamentary democracy. Published - July 23, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        democracy\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        executive (government)\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Rajya Sabha\n                    \n                            /                      \n                        \n                        health\n                    \n                            /                      \n                        \n                        Lok Sabha\n                    \n                            /                      \n                        \n                        Parliament proceedings\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        judge\n                    \n                            /                      \n                        \n                        corruption & bribery",
        "headline_1": "​Agony of exit: On the resignation of Jagdeep Dhankhar",
        "headline_2": "Jagdeep Dhankar’s resignation as Vice-President is a setback for parliamentary democracy",
        "link": "https://www.thehindu.com/opinion/editorial/agony-of-exit-on-the-resignation-of-jagdeep-dhankhar/article69843485.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "23-07-2025"
    },
    {
        "full_article": "Three months after their uneasy revival of electoral ties, the AIADMK and the BJP are yet to find common ground on the nature of government that would be formed in Tamil Nadu were the National Democratic Alliance (NDA) to win next year’s Assembly elections. Union Home Minister and the BJP’s principal electoral strategist, Amit Shah, had unilaterally declared in April that a “coalition government” would be formed — a stance that he has reiterated multiple times — and that the BJP will be a part of such an arrangement. However, the AIADMK leader, Edappadi K. Palaniswami, who passively watched Mr. Shah make the announcement, has yet to endorse the idea. He has maintained that the AIADMK would secure an absolute majority on its own. In an interview with The Hindu, he has argued that the people of Tamil Nadu are averse to coalition governments and that the AIADMK would meet their expectations for single-party rule. Just days ago, he had declared, “we are not naive” to share power. He has clarified that the remark was made in response to the DMK’s “orchestrated campaign” that portrays the BJP as intent on “swallowing” up the AIADMK. He has also insisted that efforts to create discord between the BJP and the AIADMK would fail and that the alliance remains “cent per cent” intact.Historically, Tamil Nadu, unlike the other southern States, has never had a coalition government. The DMK and the AIADMK have relied on allies for vote transfers and electoral victories but have avoided sharing power. In a State where regional parties have effectively curtailed the influence of national parties, voters remain wary of any perceived attempts by national parties to dominate regional parties. Against this backdrop, Mr. Palaniswami’s reluctance to endorse power-sharing ahead of the polls is understandable — there is no guarantee that he will maintain this stance later. He has also sent mixed signals. On one occasion, he did not directly rule out parting ways with the BJP were a more electorally viable ally — such as actor Vijay’s Tamilaga Vettri Kazhagam — to emerge. But he knows that he cannot dictate terms to the BJP, whose backing for his leadership cannot be taken for granted. Mr. Shah has subtly reflected this uncertainty by shifting his phrasing — from saying that the NDA would fight the election under Mr. Palaniswami’s leadership to describing it as under the “AIADMK’s leadership”. Regardless of these evolving political dynamics, effective coordination between the cadres of both parties — essential for voter outreach — cannot be achieved when the leadership appears to be pulling in different directions. It is a recipe for confusion and chaos.\r Published - July 23, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        election\n                    \n                            /                      \n                        \n                        Assembly Elections\n                    \n                            /                      \n                        \n                        All India Anna Dravida Munnetra Kazhagam\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        National Democratic Alliance\n                    \n                            /                      \n                        \n                        Dravida Munnetra Kazhagam\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Tamilaga Vettri Kazhagam",
        "headline_1": "Different directions: On the AIADMK and the BJP",
        "headline_2": "The AIADMK and the BJP are taking conflicting positions on power-sharing",
        "link": "https://www.thehindu.com/opinion/editorial/different-directions-on-the-aiadmk-and-the-bjp/article69842901.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "23-07-2025"
    },
    {
        "full_article": "A brief history of weapons, wars, and the military-industrial complex \nTwo Stone Age men, Stone Ager 1 and Stone Ager 2.\nStone Ager 1: Where did you get the thing you’re holding? \nStone Ager 2: I was in the forest and there was a storm and a branch fell on my head and almost knocked me out. So I took it, thinking it’ll be a jolly useful thing come next weekend when we go to bash up the next-door tribe. \nSA1: That’s a good thing to bash people with. I’ll go to the forest, too, but what if there’s no storm to make a branch fall on my head? \nSA2: Hmm, that could be a problem. Let’s go to the Shaman. He’ll tell us what to do. \nThey go to the Shaman, the wise man who sees everything, past, present, and future, but sometimes doesn’t know which is which. \nShaman: Okay. So what you’ve got here is what’s called a weapon. Specifically, a club. And you don’t have to wait for storms. You just break off the branches.\nSo the two go to the forest and break branches and go back to the Shaman. \nSA1: Now what do we do with all these extra weapons we’ve got, Shaman? \nShaman: You sell them for meat and furs to other tribe members who want them. And then you sell the rest to the next-door tribe. \nSA2: But won’t the next-door tribe use them to bash us with?\nShaman: Of course they will. That’s the whole point of having weapons; you’ve got to have wars to use them. That’s what’s known as the military-industrial complex. \nSA1: But won’t there come a time when people won’t want wars, but want to do other things, like make friends on Facebook.\nShaman: Don’t worry about that. Wars will never end. You can get man out of the Stone Age, but you’ll never get the Stone Age out of man…\n\n",
        "headline_1": "Arms and the man",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/arms-and-the-man/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-07-2025"
    },
    {
        "full_article": "Judgy folks wanting to jump into other people’s affairs are a global phenomenon, India to the West\nBusy old fool, unruly sun, why dost thou thus, through windows, and through curtains, call on us? John Donne complained in 1633. Thankfully, the zone of intimacy has won giant protections since then. Wouldn’t you say that lovers are hugely better off today? Private life has many shields from judgy state and society, which the poet characterised as a nosy sun. Their nosiness is super persistent though. And it keeps smoking out new tools. Like social media and kisscams. When that camera caught that couple at the Coldplay concert, the first heckling was from Chris Martin himself, about them having an affair. Strange thing is how this wokest of woke metrosexual instinctively responded with smirk and snark.\nBrown aunties and uncles obviously don’t have a copyright on being all up one’s private business. Shown the trail by the Coldplay star, helped along by amoral algos, first Wisconsin, then America, then the entire world swiftly got into the game of sitting in moral judgement of the two people captured on a jumbo screen. Appetite whetted, the titillated chase continued with other people sharing lives with those two. Adulterous women used to be paraded in the market square. That impulse to shame evidently hasn’t passed on.\nIndia did get around to decriminalising adultery in 2018. It was a late, late recognition that consenting adults have the right to be left alone with their sexual choices. But the spectre of the crime merrily lives on in our courts. In divorce, alimony, child custody, property division cases. It’s even finding new conspirators, from WhatsApp chats to secret recordings. It’s no one’s point that infidelity can’t cause a genuine crisis in a relationship. But that’s a matter for the people involved. Even if you just happen to get caught in someone else’s camera, it doesn’t become everyone’s business. \n\n",
        "headline_1": "Adultery? Be adult",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/adultery-be-adult/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-07-2025"
    },
    {
        "full_article": "Given his office, the way Dhankhar quit left much to be desired, no matter what provoked the decision\nSome would say his resignation on the first day of Rajya Sabha’s monsoon session was in keeping with Jagdeep Dhankhar’s penchant for controversy that marked his three-year tenure as vice president. But that’s not the point. Dhankhar’s abrupt exit was not in keeping with the unwritten but well-understood demands of a constitutional office. Delhi’s power corridors and the media will continue speculating for a few days at least what made V-P quit so suddenly. What will be forgotten is the principle – given the office he held, Dhankhar shouldn’t have preferred drama over decorum. His many rhetorical jibes against higher judiciary’s conduct make his own unprepossessing manner of departure rather ironic. This critique stands whatever Dhankhar’s real reason was – needless to say there’s, justifiably, complete cross-party and cross-commentariat consensus that his ‘health’ wasn’t the push factor.\nThe one important job V-Ps have is presiding over RS. It’s always a crucial remit in Parliament, but more so when politics is so fractious. Dhankhar, it would be more than fair to say, didn’t always come across as an even-tempered and even-handed presiding officer. Nor did he always observe the rhetorical temperance expected of holders of constitutional offices. But even then, it doesn’t take much to know that resigning right at the beginning of a parliamentary session that will decide on a matter as grave as impeachment of an HC judge, is simply not on. The larger point is that we no longer naturally assume that constitutional office holders will maintain the dignity of their office. Dhankhar’s is perhaps among the more eye-catching examples. But sadly, it is, by no means, the only one.\nWhoever BJP picks as its new V-P nominee – he/she will win given NDA Parliament numbers – won’t have a very high bar to jump over to be considered as an improvement on his/her predecessor. But the new V-P can do more, even in today’s no-prisoners-taken political atmosphere. Parliament will function better if opposition feels less frustrated. In a Westminster system, the dice is heavily loaded in favour of treasury benches anyway. That means presiding officers are vital for giving opposition a robust voice. Dhankhar’s last act, allowing an opposition motion that reportedly caught BJP by surprise, was likely not informed by high parliamentary thought. But, minus his motives behind that decision, that’s a good practice for a V-P.\n\n",
        "headline_1": "DHAXIT",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/dhaxit/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-07-2025"
    },
    {
        "full_article": "So, no one’s guilty of 2006 serial train bomb blasts, which changed commuters’ safety perceptions forever. But what commuting choice is there? Even if overcrowding is scary\n\n187 people were killed. 19 years have passed. 10 years have passed since the first judgment. And no one is guilty. That’s where things stand after Bombay high court yesterday found that the prosecution has “utterly failed” – and acquitted everyone in the 2006 Mumbai serial train blasts case. In 2015, a MCOCA court had convicted 12, giving 5 of them a death sentence.\nRead full story on TOI+\n\n",
        "headline_1": "6 mins that changed Mumbai, 19 years that changed nothing",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/6-mins-that-changed-mumbai-19-years-that-changed-nothing/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 23, 2025 00:00:00  \nGrief and shock benumb this nation with the Saturday's excruciating death of dozens of innocent and unsuspecting students of Milestone School and College's primary section in Uttara. Death descended out of the blue when a training fighter jet of the Bangladesh Air Force rammed into the building for primary students instantly exploding into a massive fireball that turned into an inferno when came in contact with spilled jet fuel. The fire consumed angelic young souls and left many more with burn injuries. This is a monumental tragedy without precedence in this country's history because the victims are mostly underage children. The parents and guardians of both the deceased and injured as well as the survivors of the crash are suffering the ultimate bereavement and trauma. It is inconsolable. \nNow the question is, if this jet crash was avoidable or not. Aviation experts and veteran pilots are of the opinion that flights of training fighter jets in a mega city zone are a potential invitation for air crashes. Use of the same runway by commercial planes and fighter jets is undesirable too. With speed about three times that of the commercial planes which fly at speeds between 805-965 km/h, the supersonic machines also take off and land at higher speeds. Particularly, trainee pilots should not be allowed to use the runway of any busy airport. It is time such training exercises are operated from other airports less busy and away from densely-populated urban centres. \nReportedly, training fighter jets like the one involved in the crash were bought from China are too aged to be used in other countries. In fact, a number of similar crashes have taken place involving these aging planes over the past years in which the pilots in most cases died, while in one case the pilot went missing never to be found as the jet crashed in the sea. The latest one has proved the deadliest of all, claiming not only the life of the pilot but also lives of many unsuspecting victims. One would like to believe that the Monday's crash would at least force those concerned to replace the remaining fighter jets of this gone-by generation with new ones. That is necessary not only for the sake of saving the lives of the pilots, but also to avoid collateral deaths like the ones that happened on last Monday. \nApart from such deaths, the threat posed to the lives of a pilot should be eliminated by any cost. A fleet of such old generation jets is unlikely to guard the country's airspace against any violation by enemy aircraft. Also saving the lives of pilots trained at the cost of millions of taka from the exchequer cannot be overlooked.\nSo, there is a need for taking a long view not only of the aircraft used for the country's air force but also of the commercial planes. Right now Bangladesh is reportedly negotiating a deal for purchasing passenger aircraft from a much maligned company as part of reciprocal tariff bargain. This is unacceptable. Both the civil aviation and the air force must develop their fleets with advanced and well-maintained aircraft. The old ones should rigorously be checked either for use or putting them out of commission. \nMeanwhile, let the nation remember and pray for those precious souls whom their near and dear ones have lost forever.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Uttara tragedy overwhelms the nation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/uttara-tragedy-overwhelms-the-nation-1753198154",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       July 23, 2025 00:00:00  \nExpansion of the existing bonded warehouse facility for export-oriented industries has been under discussion for quite some time. Given its pivotal role in ensuring uninterrupted availability of raw materials for manufacturing export goods, the importance of bonded warehouse cannot be overstated. Over the decades, the system has served as a crucial pillar for the country's export growth, especially for the readymade garments (RMG) sector. However, despite its clear merits, the system has also shown vulnerabilities that call for significant reforms-chiefly, in the areas of management, transparency and oversight.\n In this context, recent newspaper reports indicate that the government has renewed its interest in digitising the bonded warehouse system. Preparatory steps have reportedly been taken to this end. Years ago, the National Board of Revenue (NBR) had earlier formed a committee to propose amendments to relevant sections of the Customs Act to support automation of bond management. The committee submitted its report, suggesting a legislative and regulatory framework necessary for full-scale automation. \n The NBR first undertook a project to automate the bonded warehouse system in 2017, originally targeted for completion by June 2021. Due to unsatisfactory progress, the project's timeline was extended until June 2023. However, whether the implementation has kept pace with the extended timeline remains unclear.\n The bonded warehouse facility in Bangladesh emerged as a substitute for the Duty Drawback system in the late 1980s. Its inception, though promising, was accompanied with concerns about operational efficiency and susceptibility to misuse. Primarily introduced to support the garment sector, the system enabled exporters to import raw and packing materials without paying customs duties upfront, provided these materials were used in the production of exported goods. This provision significantly eased cash flow constraints for exporters and allowed them to remain competitive in global markets.\n Along with back-to-back Letters of Credit (L/Cs), the bonded warehouse system helped transform Bangladesh's apparel industry into a global export powerhouse. Yet, from the beginning, the system lacked robust mechanisms to prevent abuse. Customs officials were supposed to maintain a 'passbook' that recorded all imported materials and tracked their subsequent use in exports. In theory, this was to ensure both accountability and transparency. In practice, however, these objectives have often not been realised.\n Over the years, the bonded warehouse facility has been dubbed by critics a \"happy hunting ground\" for unscrupulous actors. Despite the existence of rules and oversight mechanisms, allegations persist that raw materials imported duty-free are frequently diverted to the local market. The pilferage not only compromises the integrity of the export system but also creates unfair competition for domestic producers.\n It is against this backdrop that the push for digitising the bond management process has gained urgency. Automation is expected to bring the much-needed transparency, reduce manual errors, and curtail opportunities for manipulation. Nevertheless, reports until recently suggested that progress on the automation front remained slow and fragmented. The involvement of multiple stakeholders-exporters, the Bangladesh Export Processing Zones Authority (BEPZA) and the Bangladesh Bank (BB)-adds layers of complexity to the implementation process.\n Although the RMG sector continues to be the primary beneficiary of the bonded warehouse facility, there is a compelling case for extending this facility to other prospective export-oriented sectors. Industries such as pharmaceuticals, leather, frozen foods and light engineering also rely heavily on imported raw materials. Many of these sectors have been long-time aspirants for inclusion under the bonded system, as it would significantly reduce their cost burden caused by long lead times and high working capital requirements.\n In this context, automation could serve as a game-changer. A digitised bond management system would not only curb misuse but also build confidence in the integrity of the process, encouraging the NBR to widen its scope. More sectors coming under this umbrella would ultimately strengthen the country's overall export base.\n\n However, transitioning from a largely manual system to a fully digital one will not be without its challenges. Given the deeply entrenched manual processes, teething problems are to be expected. These may include resistance from users unfamiliar with digital tools, gaps in digital literacy and the need for strong coordination among various government and private stakeholders.\n To mitigate these challenges, a well-structured trial phase is crucial. Rather than adopting a piecemeal approach, the authorities should consider piloting the system on a limited scale. This would allow time to identify bottlenecks, collect feedback, and make necessary adjustments before a broader rollout. Effective training and capacity building for all stakeholders-especially customs officials and exporters-will also be essential to ensure a smooth transition.\n Looking forward, the government must treat the automation of the bonded warehouse system as a priority reform. With Bangladesh set to graduate from its Least Developed Country (LDC) status and diversify its export base, efficient and transparent export facilitation mechanisms will be vital. \n By embracing digitisation and expanding the scope of the facility to emerging export sectors, the country can further enhance its global trade competitiveness and lay the foundation for a more inclusive and robust export regime.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bonded warehouse needs automation for expansion and efficiency",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bonded-warehouse-needs-automation-for-expansion-and-efficiency-1753198259",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 23, 2025 00:00:00  \n\nThe future of a nation depends on its children. If we cannot ensure their safety within our education system, we risk a bleak and uncertain future. The tragic incident that happened on 21 July, when a Bangladesh Air Force fighter aircraft crashed on a Milestone School and College building in Uttara, Dhaka, has laid bare the glaring lack of emergency preparedness in our schools. \nIt is deeply concerning that most schools in Bangladesh do not have functioning fire extinguishers. Where extinguishers exist, they are often outdated or non-operational. Emergency exits, if present at all, are sometimes kept locked. Even more alarming is the fact that neither students nor members of the staff receive training in basic fire safety procedures. Fire drills are rarely held, meaning that in a real emergency, confusion reigns, costing precious lives.\nToday village schools are getting two- to four-storey buildings and those schools are particularly at risk of catching fire and turning into tragic spots unless wiring is done well and regular maintenance carried out. \nWorryingly, our national curriculum includes no lessons on fire safety or emergency response. There is no instruction on how to use a fire extinguisher, where to assemble during a crisis, or whom to notify. These are basic, life-saving skills that should be considered essential knowledge for every student.\nFire safety systems must be made mandatory in every school. This includes installing and maintaining operational fire extinguishers, conducting regular emergency drills, and providing training for teachers and staff. Emergency response education should be incorporated into the national curriculum at all levels of schooling.\nStrict compliance with the National Building Code and fire safety regulations must be enforced in new school buildings, and vulnerable older structures must be renovated urgently. The Fire Service and Civil Defence Department should be formally involved with school-based awareness and training programmes.\nMd. Shamim Mia\nStudent, Fulchhari Government College\nJumarbari, Saghata, Gaibandha\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Need for mandatory fire safety training in schools",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/need-for-mandatory-fire-safety-training-in-schools-1753198282",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 23, 2025 00:00:00  \n\nThe United Nations was created to stop wars and bring peace to the world. But for decades, mass killings have continued in Gaza, Palestine. The thin, starving bodies of children are painful to see, yet the Western world still supports this terrible destruction. We can all see what happened to Syria, Iraq, and Libya. The UN did not even try to stop it. In such a reality, what is the reason to open a UN Human Rights Office in Dhaka? This is our country, and decisions should be ours. If this office is set up, Bangladesh's power to make its own decisions will become weaker. They will interfere in many matters in the name of international human rights standards.\nWe already have our own National Human Rights Commission. Why not make it stronger instead of bringing in a UN office? Most countries that host such offices are war-torn or fragile states like Syria, Libya, and Tunisia. Bangladesh is not one of them. So, is there a plan to make us a proxy state? If people are not alert, we may suffer for years. This office will also send a negative message to the world - that Bangladesh is in deep crisis. Investors may lose confidence, and our South Asian rivals may be happy.\nAt present, the UN has human rights offices in 16 countries, most of which are badly affected by civil war and terrorism. South Korea has one field office, and Ukraine has a small mission, both reflecting fragile situations. We want human rights, but they must fit our reality and culture, not trap us in dependence. That is why we call for this plan to be reconsidered.\nFiad Nowshad Yeamin\nStudent\nDepartment of Media, Communication and Journalism,\nCanadian University of Bangladesh\nnowshadyeamin415@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Should Dhaka host a UNHR office?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/should-dhaka-host-a-unhr-office-1753198295",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-07-2025"
    }
]