[
    {
        "full_article": "Effective crowd management at mass gatherings demands the cooperation of organisers and attendees. However, when popular film stars attempt to convert their frenzied fan base into political capital, crowd management and safety are often compromised. This was tragically demonstrated in Tamil Nadu’s worst political rally disaster, that left 40 people, including children, dead, at Velusamypuram in Karur during actor-politician C. Joseph Vijay’s campaign, on Saturday night (September 27, 2025). Since September 13, 2025, when the Kollywood megastar launched his “weekend-only” roadshows, promoting his fledgling Tamilaga Vettri Kazhagam (TVK) as an alternative to the ruling Dravida Munnetra Kazhagam (DMK), restrictions have been breached and common sense sidelined. Mr. Vijay has resisted police restrictions, labelling them as a political move to stifle his growth. The TVK even approached the Madras High Court, which, concerned over the damage to public properties caused by his supporters, wanted the government to collect deposits from political parties as collateral. From the comfort of his campaign caravan, Mr. Vijay did little to prevent crowds along his route from joining in, paralysing traffic and delaying his arrival at meeting venues by several hours. Youths climbed electricity poles, transformers and rooftops, and clung to trees, and families held up vulnerable children just to catch a glimpse of the actor. Yet, there was no effective corrective action either from the organisers or the police personnel.At Karur, the crowd, which was modest at noon, the scheduled time, swelled by the time he reached at 7.20 p.m. as supporters gathered after work hours. When they surged forward to hear him speak, many fainted or were crushed due to compressive asphyxia. Police say there was a significant mismatch between the turnout projected by the TVK — 10,000 people — and the actual turnout — over 27,000. The government responded swiftly to the tragedy, arranging medical aid, overnight autopsies, and the prompt handing over of the bodies to grieving families. Chief Minister M.K. Stalin, who arrived in Karur past midnight, did the right thing by not politicising the tragedy and instead entrusting the probe to a commission of inquiry. The commission must look beyond the TVK’s lapses and examine whether the police had acted independently, especially in denying the TVK its preferred venues to accommodate a larger gathering. Going forward, Mr. Vijay and the police must act to prevent such tragedies. The actor must make more frequent appearances to dispel the aura of mystique and abandon the practice of using roadshows as a show of strength. And the police must insist that all massive political meetings be held in open, spacious venues and not in dense locations. Published - September 29, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        accident (general)\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Tamilaga Vettri Kazhagam\n                    \n                            /                      \n                        \n                        Actor\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        police\n                    \n                            /                      \n                        \n                        students\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        inquiry\n                    \n                            /                      \n                        \n                        death\n                    \n                            /                      \n                        \n                        disaster management\n                    \n                            /                      \n                        \n                        Dravida Munnetra Kazhagam",
        "headline_1": "​An avoidable tragedy: On the TVK rally, the stampede in Karur",
        "headline_2": "Police must not allow roadshows in dense locations",
        "link": "https://www.thehindu.com/opinion/editorial/an-avoidable-tragedy-on-the-tvk-rally-the-stampede-in-karur/article70105447.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "29-09-2025"
    },
    {
        "full_article": "By announcing 100% tariffs on imports of branded and patented medicines, with effect from October 1, U.S. President Donald Trump has weaponised access to health care in America, where prescription drugs account for about 10% of household medical care spending. The caveat of a 15% tariff cap on imports from the European Union and Japan, which the U.S. has clarified that it will honour, blunts the announcement, as these two jurisdictions account for nearly three-fourths of pharma imports. Much of this trade consists of patented medicines such as the Danish-made weight-loss and anti-diabetes drugs, Wegovy and Ozempic. The impact on patients needing specialised cancer or rare disease drugs could also be severe. There will also be a likely impact on the U.S.’s health insurance sector, as firms would attempt to pass on higher prices of specialty and patented medicines on to policyholders. An Ernst & Young study found that a 25% tariff on patented drugs would raise annual drug costs by about $51 billion. The countries most exposed are those left outside the exemptions. The U.K., Switzerland, and Singapore — hubs for pharma manufacturing — face the prospect of a 100% tariff burden, which could make their products expensive.India’s sprawling generics industry has, for the moment, been spared. Generics account for 90% of prescriptions dispensed in the U.S. but about 13% of spending. India exported more than $10.5 billion worth of formulations to the U.S. in FY25. Any tariff expansion to cover generics or biosimilars could, therefore, deal a blow to one of India’s most successful export sectors. There is also lingering uncertainty over whether Active Pharmaceutical Ingredients (APIs) will be caught in the tariff net. India and China dominate global API supply. The U.S. itself remains a leading producer of innovative medicines, exporting billions of dollars’ worth of drugs worldwide. How the new tariffs on imported patented drugs will interact with the price competitiveness of U.S. exports remains unclear. Mr. Trump’s move came despite objections from the influential body, PhRMA, which warned that tariffs would raise costs for patients without addressing structural supply chain issues. For Americans, this decision will almost certainly push up retail drug costs for advanced therapies. For the world, the move is a reminder that global supply chains forged in the post–Second World War order are being reshaped by new political realities. Nations heavily dependent on U.S. demand must accelerate alternative trade alliances and diversify export markets. This is now a necessity for India’s pharma sector as well.\r Published - September 29, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        prescription drugs\n                    \n                            /                      \n                        \n                        generic drugs\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        health\n                    \n                            /                      \n                        \n                        European Union\n                    \n                            /                      \n                        \n                        Japan\n                    \n                            /                      \n                        \n                        pharmaceutical\n                    \n                            /                      \n                        \n                        imports\n                    \n                            /                      \n                        \n                        cancer\n                    \n                            /                      \n                        \n                        disease\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        Switzerland\n                    \n                            /                      \n                        \n                        Singapore\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        Drugs",
        "headline_1": "​Weaponising health care: On the Trump tariffs on imported medicines",
        "headline_2": "Americans will see medical bills shoot up due to Donald Trump’s actions",
        "link": "https://www.thehindu.com/opinion/editorial/weaponising-health-care-on-the-trump-tariffs-on-imported-medicines/article70105428.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "29-09-2025"
    },
    {
        "full_article": "By Muni Pranamyasagar\nIn the infinite rhythm of existence, nothing happens without a cause, and nothing disappears without leaving its trace. Karm and rebirth are not two separate truths – they are two pulses of the same eternal heartbeat. Without karm, there can be no rebirth; without rebirth, karma remains incomplete. Birth itself is not an accident. The body may be formed by the union of mother and father, but the light of consciousness that animates it is carried forward from the karmic impressions of past lives. These impressions, sanskars, travel with the soul like a subtle fragrance, unseen yet unmistakable. This is why a newborn instinctively knows to drink milk without being taught. Such instincts are not lessons of this life; they are the memories of a journey before this beginning. To deny rebirth is to deny the soul and the law that governs it. If fruits of our actions were confined only to the present life, the moral order of the universe would collapse.\nWhy strive for goodness when evil often seems to bring immediate pleasure, and noble deeds might lead to suffering? Law of karm assures that every cause finds its effect even if it takes lifetimes to unfold.\n\nLook at the world. Differences in skill sets are not random; they are blossoming of seeds sown before. The body is shaped by biology, but the life within it is shaped by karm – by the subtle vibrations created through our thoughts, words, and deeds. Karm works through what may be called chain and change. The chain preserves continuity of the soul’s journey; change arises through new karmas we create in each moment.\nWe may not see our past lives or the ones yet to come, but we are in the middle of a long, unbroken sequence, preceded by countless yesterdays and followed by countless tomorrows, until we attain liberation.\nTo reject karm and rebirth is to invite moral emptiness. Without the knowledge that every action will return, there is no true reason to cultivate patience, compassion, or restraint. But when this truth is accepted, life becomes more deliberate. One begins to act not for immediate gain, but for the purity and freedom of the soul.\nRebirth is not punishment; it is an opportunity to attain Self-realisation. It is the continuation of our journey towards liberation. Each life is a classroom where old karms can be burnt and new, nobler ones can be sown like seeds that blossom in future. The cycle ends only when all karmic bonds are dissolved and the soul shines in its original, pure, and blissful state. Thus, karm, rebirth, and the soul form an inseparable triad. Ignore one, and the whole structure collapses. Recognising this truth transforms how we live – making each action conscious, each choice meaningful, and each moment a step towards liberation. Life is not a single page; it is a vast scripture written across lifetimes. And the ink is karm. What we write today will be the story we live tomorrow.\n\n",
        "headline_1": "Law of Karm: Every cause finds its effect",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/law-of-karm-every-cause-finds-its-effect/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-09-2025"
    },
    {
        "full_article": "GOI must engage protesters, even if they demand a lot\nExplanations for “the bloodiest day” in Ladakh remain sharply divided between govt and protesters. But one thing on which there should be consensus is what BJP leader and former Ladakh MP Jamyang Tsering Namgyal has written in his letter to the Lt Governor, “Ladakh stands at a fragile juncture.” The mood in the Himalayan desert region has darkened a lot since it became a separate Union Territory after the abrogation of Article 370. At the time, Namgyal himself gave such a passionate parliamentary speech welcoming these developments that it went viral. Engineer-innovator Sonam Wangchuk, who inspired 3 Idiots, also welcomed them heartily. Wangchuk has now been arrested, with govt linking Wednesday’s mob violence and arson to his “provocative” speeches.27\nNone of this, of course, explains why four unarmed protesters died with multiple bullet wounds that day. Even those who don’t appreciate how Wangchuk’s been talking up a Gen-Z revolution of the Nepal type in Ladakh, should recognise that over-strong police action is the opposite of a solution in this case. Yes, the big local asks of both statehood and inclusion in the Sixth Schedule are difficult to meet. With its 3L population Ladakh has zero chance of getting statehood when it’s still denied to J&K. As for the Sixth Schedule, no govt, whatever its political stripe, is likely to open this Pandora’s box. If it did, Manipur would be ahead of Ladakh in the line. But GOI has a time and tested way of walking situations back from crisis, which is to really get into engage mode.\nGovt told a parliamentary committee this year that none of the 1,275 gazetted posts in Ladakh have been filled since 2019. Wangchuk and others’ talk of Ladakh becoming another Tibet is of course utter nonsense – one is without even a fraction of persecution of the other. But Ladhakis’ fears of becoming climate refugees are connected to real environmental vulnerabilities that need to be taken very seriously. Hearing and calming by the Centre is the need of the hour.\n\n",
        "headline_1": "Listen To Ladakh",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/listen-to-ladakh-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-09-2025"
    },
    {
        "full_article": "Trump tariff on pharma is a nudge to diversify markets\nIt isn’t clear whether Trump’s 100% tariff on imported “branded or patented” drugs will affect India, but markets turned cautious on Friday. Pharma stocks fell between 1% and 5%. The tariff isn’t entirely unexpected – Trump has been talking about imposing it since April. In July, he threatened to tax imported pharmaceuticals at 200%. In Aug, he said the tariff could go up to 250%. What stumped the market was the timing, as he had earlier hinted at starting with a “small tariff” and peaking in 12 to 18 months.\nThe impact on India will depend on how “branded” is interpreted. US is India’s biggest pharma market, buying roughly $10bn worth of drugs last year. But these are largely low-cost generics, including drugs for cardiovascular and neurological disorders. Experts believe these off-patent formulations – even if shipped under a brand name – may be exempt from the new tariff. However, clarity on this point will emerge only after US issues enforcement rules.\nFor Trump, making US aatmanirbhar in medicines has been a priority since his first term. According to a White House release, US makes 40% of its finished drugs, but the share of locally made APIs is just 10%. This explains the exemption offered to pharma firms setting up plants in US. But the abruptness of Trump’s decisions – like with H-1B visas last week, and the penal tariff on India in July – is unsettling. Countries like Ireland, Switzerland, and Germany, which supply high-value branded and patented drugs, will clearly bear the brunt of his latest tariff. But if branded generics are also taxed, 40% of India’s pharma exports will be at risk. Even if Indian generics are spared for now, Trump’s sword will hang over them. So, the search for new markets should begin immediately.\n\n",
        "headline_1": "Vitamin T",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/vitamin-t/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-09-2025"
    },
    {
        "full_article": "What the life of tree teaches us on survival strategies\nHumans can brag about their ability to control nature, but the reality is we’re powerless in the face of heatwaves, floods, wildfires and natural phenomena. Survival needs collective strategies against threats – and mutual aid goes beyond the species barrier. \nThat’s what forests show us. Collaborate amid competition. Collaborate across species. But humankind, writes Laurent Tillon in Being An Oak: Life as a Tree, “resists co-evolution with the microbes that have shaped us into our species, consciously risking gradual decline in collective immunity through isolation and excessive sterilisation.”\nBut we get ahead of the story – the story of Tillon’s oak, his friend and confidant. Of discovering who the tree – at least 240 years old – is, in forest Silva, near Paris. The tree that showed Tillon the nature of nature – challenges in sourcing nutrients, the fight to grow tall, keeping the canopy safe, and competing and coexisting with a million creatures – plant, animal and microbe. It’s never easy. It’s never hopeless either. \nAn intricate lattice of stories with incredible detail shows the oak’s relationships with other trees, beetles, woodpeckers, salamanders, foragers, lizards, wolves, and humans. “Trees that live in a community make up a super organism whose powers are immeasurable”, Tillon writes.\nBy the 17th century, oaks provided wood for building boats, to meet maritime ambitions of King Louis XVI, also the first to engage in ‘forest management’. Over centuries, railways, cities, industry – all needed wood from the forest. This oak’s life was at risk from the minute it was born, around 1780, an acorn, with a plantlet and a radicle inside, organs provided by the parent oak. \nA fieldmouse grabs and runs with the acorn as it falls to the ground as winter loot – only to forget about it. A good crop of acorns means field mice eat up all the acorns, damaging them, the abundance driving them nuts. So the oaks pull back on producing acorns the next season. Rodents’ population plunges – the plant world, says the book, outwits/ fools the animal – a phenomenon called ‘masting’. That’s just one strategy. \nOnce the acorn strikes root, it is rooted for the rest of its life. Tillon’s oak can’t move at all. “This will be his calling for the rest of his life”. Roots don’t grow randomly – “the tip of each is a veritable homing device. Nothing happens by chance.” It’s not that the oak gives an order, but in chemical and electrical messages still a secret to scientists, stimuli are received for roots to head downwards and a plantlet to vie towards light. Caterpillars time their emergence from eggs when the oak is about to bud. Yet the oak’s branches too appear to hold off on budding – to make it harder for caterpillars to attack.\nThe young oak knows the approach of fungi is an act of aggression, but local “bacterial diplomacy” ensures all three strike up a relationship of nutrient and information exchange, to signal deficiency and danger, for all time to come. These early “breach in defences” only help the oak mount an efficient immune response against attacks through its life. Collaboration and a perpetual learning of strategies – relationships within competition.\nThat’s the lesson for humans.\n\n",
        "headline_1": "Oak Culture & Humans",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/oak-culture-humans/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 29, 2025 00:00:00  \nThe slow and partial implementation, including non-implementation, of the Annual Development Programme (ADP) has long been a recurring problem. Despite repeated calls from experts and persistent media coverage, the story of sluggish execution repeats itself year after year, with little sign of improvement. The Planning Ministry itself has acknowledged several systemic challenges behind this chronic failure, including flawed project formulation, a shortage of skilled project directors, poorly conducted feasibility studies, inconsistent data and delays in land acquisition and utility relocation. These issues came under discussion at the Wednesday's inter-ministerial meeting chaired by Planning Adviser Dr Wahiduddin Mahmud. Apart from this, corruption remains a major factor behind project implementation delays, as has been pointed out time and again. It is an open secret that a section of corrupt contractors deliberately procrastinate in project implementation to inflate costs. Such chronic delays, corruption, and inefficiency must no longer be tolerated. \nThe meeting also reviewed ADP performance in the last fiscal year and explored corrective measures for the current one. Documents presented revealed a set of recommendations from the Planning Commission, ranging from strengthening agency-level capacity and setting aside dedicated budgets for Development Project Proposal (DPP) preparation to creating a pool of trained project directors and offering certification courses in planning, public financial management and procurement rules. Equally important are the flaws in feasibility studies and data gaps that plague project formulation. To address this, the commission suggested engaging qualified professionals or institutions for feasibility studies, making independent peer reviews mandatory, and including risk assessments, demand forecasts and environmental and social impact studies. For persistent delays in land acquisition and utility relocation, it recommended separate dedicated projects, with prior ownership verification, acquisition plans, no-objection certificates and environmental clearance made mandatory before approval.\nThese proposals are timely, as the overall implementation of the Revised ADP in the last fiscal year stood at Tk 1.53 trillion, or 67.85 per cent of the Tk 2.26 trillion allocation, the lowest in more than a decade. In contrast, implementation in the previous five years ranged between 82.11 and 92.74 per cent. The health sector was the worst performer, with the Health Education and Family Welfare Division spending only 15 per cent of its allocation, and the Health Services Division just over 21 per cent. Education fared little better, with nearly Tk 16 billion left unspent by the Primary and Mass Education Ministry. Such underperformance is not a mere statistical concern; it carries heavy costs for the economy and society. Timely implementation ensures that funds are injected into the economy when they are most needed, generating multiplier effects that drive growth. Conversely, delays slow down momentum, raise project costs and reduce the overall impact of public spending. The stakes are even higher in today's economic context. With the private sector hesitant to invest amid uncertainties, ADP implementation could provide the much-needed stimulus to the economy. Moreover, the delay also means losing external funding, as development partners often withdraw or redirect their commitments when deadlines are not met. Ultimately, timely implementation of the ADP is not just about meeting financial targets; it is about delivering visible development outcomes that improve people's lives, strengthen public trust in governance and move Bangladesh closer to its long-term goals, including achieving the Sustainable Development Goals.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Streamlining ADP implementation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/streamlining-adp-implementation-1759072439",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       September 29, 2025 00:00:00  \nDengue, a vector-borne killer disease, remains largely unaddressed by the government. Of course, the hospitals are doing their best to treat the patients brought in critical conditions. But such patients usually succumb to their conditions despite the best of doctors' efforts. This year many children have already been orphaned or parents lost their babies to the deadly dengue. The most shocking part of the dengue-related death is that the victims or their close family members are caught quite unawares by dengue fever. In fact, in most cases, dengue comes with fever, which the patients often ignore or just take paracetamol tablets thinking that would be enough to treat the condition. But within a week, their conditions worsen, the patients begin to feel very weak, may even suddenly start vomiting. When rushed to hospital, it is too late. The death comes as an unexpected shock for the victim's family members. The reason is that the victims are not aware that they are carrying the deadly dengue virus. There is every possibility that the area where the patients live is an aedes mosquito-infested one. Now, had the local government bodies like the city ward, municipality, city corporation, etc., carried out enough awareness campaign, involved the local residents in destroying the breeding grounds of aedes mosquito, the residents would be inspired to check every corner of their houses and alleys of the residential area for possible breeding place of the aedes mosquito and destroy those. Even if there still was a case detected, early hospitalisation could save the patient's life.\nBetween January and September 26, 188 people have already died of dengue, while 44,693 have been hospitalised across the country. As already noted, according to the Directorate General of Health Services, many of these patients are quite in the dark about the severity of dengue and as such seek medical help only when the disease reaches its critical condition. The DGHS data further say, 81 per cent of the dengue patients who died this year were hospitalised after three or more days of fever. By analysing such 114 cases of dengue-related deaths, it could be inferred that 74 per cent of the deaths occurred within 48 hours of hospital admission and half of those deaths taking place due to Dengue Shock Syndrome. Close to 43 per cent of the cases had comorbidities, the DGHS analysis further revealed. \nThat dengue, or the aedes mosquito responsible for the deadly disease, is no longer a capital city-based one has been amply demonstrated by its spread to Barishal, the second most dengue-hit division this year. According to DGHS reports, so far, out of the eight administrative divisions of the country, Dhaka and Barishal division together account for three-fourths of the dengue-related deaths and nearly equal number of hospitalisations. Notably, Sylhet and Rangpur divisions remain the only divisions that have no recorded dengue-related deaths so far. However, there is also no room for complacency for this, since it is not due to any special measures against dengue adopted in these two divisions that they have been spared dengue-related fatalities so far. In fact, the dengue-vector, which has already spread out of Dhaka to Barishal division this year, can do so in other divisions. If no nationwide drive against dengue is launched meanwhile by the government's appropriate agencies, it is a matter of time before the disease will extend its deadly tentacles to other divisions, too. In this connection, entomologists have warned that if infected people carrying the deadly virus from Dhaka or Barishal, travelled to those places, then the virus may be transmitted to those divisions, too.\nIn fact, four other divisions including Chattogram, Rajshahi, Mymensingh and Khulna reported their share of caseloads and deaths. Interestingly, thus far, with Dhaka as the epicentre of dengue outbreak, traditionally, Chattogram occupied the second hotspot of dengue in terms of the number of hospitalisations and deaths. But this year, Barishal division, or more particularly Barguna district, seems to have replaced Chattogram. This September has so far proved to be the deadliest month with 60 dengue deaths reported in just three weeks surpassing July's record of 41 fatalities, which was previously considered the peak. Similarly, hospitalisation rate is also the highest in this month with the related figure reaching around 45,000 till 27th of this month. Though there is no clear-cut pattern regarding the rise or fall in the rate of dengue transmission or fatalities, there is also no respite from hospitalisation nor fatalities from this mosquito-borne disease. In absence of a well-coordinated comprehensive approach to combat the menace of dengue, new areas will see the spread of the disease with its attendant sufferings and deaths. There should be, as public health experts consistently advised, aggressive vector-control measures in place along with systematic patient tracing, and expansion of hospital capacities to handle dengue-patients. The dengue situation may any time turn for the worse and even spiral out of control, according to the public health experts. \nIn this connection, to meet any emergency, the DGHS has reportedly issued a 12-point directive across the country with instructions to prioritise dengue treatment as the number of cases and fatalities continue to rise. Now these are the measures the DGHS is taking and hospital authorities responding to within their abilities. But hospitals can treat a patient after s/he is infected with dengue. But it is beyond their power to prevent dengue from happening. So, the responsibility naturally goes to the local government bodies. But what have they been doing so far? Their job usually end with spraying insecticide with fogging machines. But researches have shown that the insecticides being used under the dengue eradication programmes are not effective in destroying the primary dengue vector, the aedes mosquito. But the authorities concerned, local government bodies to be specific, have made no serious attempt so far in that direction. In 2019, a major dengue outbreak took place in the country that spread to the rural areas. But preventive measures were lacking at that time. The situation has far from improved either during the intervening years. Community-level awareness is now at its lowest level. Therefore, urgent steps are required to combat the vector from breeding, growing and spreading. Meanwhile, vaccination programme for children against dengue should be launched, with free inoculation for them in rural areas. \nThe dengue situation is worsening. Under the circumstances, the government from its highest level should consider dengue an emergency and act accordingly. \nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "An emergency, dengue calls for urgent action",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/an-emergency-dengue-calls-for-urgent-action-1759072523",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       September 29, 2025 00:00:00  \nOf the 106 private universities in Bangladesh, 28 had no allocation for research. The annual report of the University Grants Commission (UGC) of Bangladesh for the year 2023 has revealed this disquieting development. Even the funds other varsities set aside for the purpose were too little. Some of those highest seats of learning reportedly spent in the range of Tk 5,000 to Tk 40,000. The highest expenditure made by the BRAC University amounted to 60.43 million only. In 2022, as many as 85 universities had provision for expenditure on research. \nThe 2023 saw the number drop but remarkably, the overall expenditure on this head surpassed that of the previous year. As against the expenditure of Tk 1,393,148,000 in 2022, the amount went up to Tk1,650,085,000 in 2023. This is a clear indication that the passive attitude towards research and innovation by some of the universities was counterbalanced by others to some extent. Yet it must be admitted that this is cold comfort for not only private universities but also the public ones. \nEven the premier and the highest Quacquarelli Symonds (QS) ranked University of Dhaka placed at 584th position, has only Tk 2.157 million allocation for research in its 2025-26 fiscal year. This accounts for 2.08 per cent of its annual budget ---a slight increase from the previous year's 2.07 per cent. Credit goes to faculty members and researchers of the DU for making it to the list of the world's top 2.0 per cent scientists 2025. As many as 35 academics earned this distinction---25 more than only 10 of them in 2024. With limited fund and facilities, the faculty members have worked wonder by their dedication to study and research. When the university is making screaming headlines for activities unrelated to academia, there are still faculty members who go on working silently in pursuit of furthering the horizon of knowledge and making a breakthrough on the research front. \nNow other universities should follow suit. The deplorable ranking by Bangladesh universities is not for nothing. Indifference to scholarly pursuit is certainly to blame for lower grading. One of the prime reasons for neglecting research is the commercialisation of education. Privatisation of higher education has given some privileged quarters a great opportunity for making quick bucks. A few of such universities earned infamy for issuing certificates without following the rigorous course of teaching, training and assignments, let alone dissertations. This kind of scams vitiated the higher education regime. \nThere is a clear mention of allocation for research in the Private University Act, 2010. The UGC also failed to get its acts of monitoring and supervision together. Of late, the UGC authority has increased its monitoring and drafted guidelines in order to ensure transparency and accountability in the expenditure of research funds. Yet, it falls short of what needs to be done in creating an atmosphere for competition among universities in outlaying money for advancing research programmes. Funds made available for research are certainly not enough. \nThe government alone cannot offer enough funds even to the reputed public universities. There is a need for collaboration between such universities and the corporate world. With the climate change taking a heavy toll on life and livelihoods, indigenous research has become a sine qua non. Research programmes and technology transfer that take place, according to experts, are a decade old in most cases. Also the special geographic position and conditions vary widely. Therefore many countries have put emphasis on local research aimed at addressing such specific problems encountered by them. Bangladesh cannot afford a long wait for solution to its problems and rely on developed countries to do the task for it. \nIt is because of this academic and industrial/business collaboration should be more intense and positive. Let the talented pool of human resources have an enabling environment here. Instead of leaving the country for developed ones, they can chase their dreams in the land of their birth. Satyendra Nath Bose made his ground-breaking discovery at a time when the DU had hardly any facility for research. Now that Bangladesh has come a long way off in terms of progress in business and industrial ventures, pooling research funds ought to be a wise option to the mutual benefit of all concerned.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Universities with no allocation for research",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/universities-with-no-allocation-for-research-1759072551",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 29, 2025 00:00:00  \n\nIn Bangladesh, the journey from policy to people is critical for building financial resilience. While we've made progress in financial inclusion, insurance penetration remains below 1.0 per cent of GDP-among the lowest in Asia. This leaves millions of households vulnerable to health emergencies, natural disasters and property losses.\nInclusive insurance can change this reality. When insurance products are simple, affordable, and powered by technology, they can reach farmers, informal workers and low-income families who are often excluded from traditional coverage. Global experiences show that inclusive insurance strengthens household resilience and supports national goals such as poverty reduction and economic stability.\nHowever, policy frameworks alone are not enough. The real challenge lies in translating these policies into people-centered solutions. Awareness, trust, and innovative delivery models must be built at the community level so that protection becomes a reality-not just a policy ambition.\nTo achieve this, we must go the last mile. Only then will inclusive insurance help turn financial resilience from a distant policy goal into a lived reality for every Bangladeshi. This is essential for building a more secure and sustainable future.\nNasrin Ferdous\nInsurance Professional\nNon-Life (General) Insurance Sector\nferdousnasrin4@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Insurance can ensure financial resilience",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/insurance-can-ensure-financial-resilience-1759072569",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-09-2025"
    }
]