[
    {
        "full_article": "The government’s push this year to spur consumption in the economy is a much-needed policy re-prioritisation at a time when several other engines of growth are either flagging or plateauing. The economy is a composite of household consumption, private investment, government expenditure and net exports. Of these, only government expenditure has witnessed robust growth over the past few years, thanks to the Modi government’s infrastructure push. It has also made available interest-free loans to States to do the same. However, as Finance Minister Nirmala Sitharaman has indicated in the last two Union Budgets, even though the Centre will increase its capital expenditure, it will not be at the blistering rate of 30%-35% that the early post-COVID-19 pandemic years saw. The government has other developmental and defence priorities that need funds too. It is time for the private sector to step up its investments. Private investment has grown, but not nearly at the rate needed to move India from 6%-6.5% growth to the more than 8% needed to meet the targets. Given that industrial capacity utilisation has not crossed 80% since March 2011, the only way to induce more private investment is to increase demand substantially. Net exports, especially merchandise, are struggling due to the global uncertainty around trade, and the U.S.’s 50% tariffs imposed on Indian imports. That is, demand from abroad is petering out, which leaves household consumption to do the heavy lifting.There are two ways to encourage people to spend — increasing their incomes and lowering prices. The GST rate reforms, with effect from September 22, are a significant step in executing the latter. According to a study published by FICCI, more than three-fourths of rural monthly expenditure will attract either nil or 5% GST rates. This was previously 56%. For urban Indians, this proportion has been increased from half to two-thirds. On the income side, the government tried to put more money in people’s pockets by reducing income-tax rates in Budget 2025. This was a welcome and necessary step, although it is not enough to encourage a change in spending behaviour. People are more likely to save than spend that extra amount. The other way disposable income will rise substantially is if companies decide to increase wages. However, apart from a few niche sectors, India has an oversupply of labour, and wages will simply not grow fast enough. There is also a skill deficit that needs to be urgently addressed. This is the unfortunate predicament that the Indian economy finds itself in: consumption is the only driver of growth that is largely immune to global factors. But it also has high inertia, needing relatively more fiscal investment before it can get a jump-start. Published - September 23, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        government\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        Union Budget\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        development\n                    \n                            /                      \n                        \n                        defence\n                    \n                            /                      \n                        \n                        investments\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "​Consumption conundrum: On the Indian economy’s predicament",
        "headline_2": "Household spending can boost the economy, but it needs a jumpstart",
        "link": "https://www.thehindu.com/opinion/editorial/consumption-conundrum-on-the-indian-economys-predicament/article70080624.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "23-09-2025"
    },
    {
        "full_article": "The Supreme Court of India recently reaffirmed that secularism is a fundamental principle and part of the basic structure of the Constitution of India. While this is a welcome restatement, it is concerning that the Court has to periodically reiterate this foundational aspect of Indian nationhood. The need arose from a misguided petition that sought to communalise a moment of celebration for all Indians. The Karnataka government had invited International Booker Prize-winning Kannada writer Banu Mushtaq, who is Muslim, to inaugurate the Mysuru Dasara festival at the Chamundeshwari Temple — which she did on Monday. This festival, a State-sponsored cultural event that is not purely religious, serves as an occasion for all communities to come together and share in the joy of the festival. The petition filed in the Court alleged that Ms. Mushtaq’s participation violated Articles 25 and 26 of the Constitution, which guarantee freedom of religion. A Bench of Justices Vikram Nath and Sandeep Mehta rightly dismissed the petition, clarifying that the Dasara festival is a State event, not a private religious ceremony. The Court emphasised that the State cannot discriminate based on religion when organising public events and questioned whether the petitioner had even read the Constitution’s Preamble, which unambiguously promotes equality and secularism. The Karnataka High Court had previously upheld the government’s decision, stating that a person of one faith participating in the events of another does not violate anyone’s constitutional right.The constitutional right to practise and profess religion cannot be interpreted as a right to restrict others from participating in a faith’s practices. Restricting participation in any public gathering based on religion is indefensible in a pluralistic society. Although some places of worship still limit access to certain groups, such practices remain a source of legal and ethical debate. Those who perceive a threat to their religion from someone who is voluntarily and happily joining its festivities are either cynical or cunning. In fact, over many centuries and across different geographies, festivals and pilgrimages have united India’s diverse population, often transcending social barriers. The acceptance of this shared, mixed cultural heritage is a common thread among all Indian political parties, even amid their disagreements. However, a new group of political opportunists is exploiting this harmony by creating communal rifts, turning the logic of coexistence on its head. As the Supreme Court has demonstrated, these individuals need to be held accountable.\r Published - September 23, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        authors and poets\n                    \n                            /                      \n                        \n                        minority group\n                    \n                            /                      \n                        \n                        Mysore\n                    \n                            /                      \n                        \n                        festivals\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        Karnataka\n                    \n                            /                      \n                        \n                        religion and belief\n                    \n                            /                      \n                        \n                        culture (general)\n                    \n                            /                      \n                        \n                        politics",
        "headline_1": "​Basic structure: On the Mysuru Dasara festival",
        "headline_2": "There can be no restriction in a public event on the basis of religion",
        "link": "https://www.thehindu.com/opinion/editorial/basic-structure-on-the-mysuru-dasara-festival/article70080897.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "23-09-2025"
    },
    {
        "full_article": "Kamala and Trump agree on H-IB-hit Indian men\nKamala is always irritated when I step out of the house on a Sunday: “You’re constantly chatting with the neighbours, or walking aimlessly around the area like these middle-aged uncles with no clear goal in life. Can’t you find something to do at home?”\nSo I plonked myself on the sofa and began reading the newspaper for the nth time. I had only left the obituary columns untouched. Several people started to look vaguely familiar on that page and so I read out the interesting ones aloud to Kamala just to clarify that we had not missed any deaths among family and friends. “You are the most morbid man in the world – nobody reads the obituaries with as much relish as you!” But like Gen Z checks social media to see what’s happening in their friends’ lives, Gen X scans these columns for life-changing events. Literally doom scrolling.\nThe front page had equally depressing news of some US visa fees being hiked yugely. To be or not to be H-1B, Shakespeare might have said if he was around. By the time a clarification was later issued that this was not an annual fee, panic and anxiety had already spread across the Indian diaspora. “It’s like raising GST and then lowering it again in an attempt to undo the damage,” Kamala said cynically, snacking on her cheaper caramel popcorn. Our neighbour NRI Naresha has cancelled his son’s wedding next week because of the uncertainty. Many of our friends are worrying that their kids won’t visit them this Diwali or Christmas.\nBut how about looking at this sunny side up? With Trump’s hefty visa fees adding a double whammy to his trade tariffs, Indians abroad now have a fresh chance to demonstrate their patriotism and love for their country – in their country.\nIn fact, like other Indian men on a Sunday, the story of the lives of non-resident Indians abroad trapped in geo-political storms beyond their control, can now be summarised in Raj Kapoor’s song from Jis Desh Mein Ganga Behti Hai – “Aa Ab Laut Chalein”, or Let us now return.  They also have the option of expressing their feelings by singing a version of the John Denver classic: “Country roads take me home. To the land I belong. Mera India.” And this may even be the subliminal message in India’s official entry for the Oscars this year. It’s serendipitously titled, Homebound.\n\n",
        "headline_1": "Homebound best be",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/homebound-best-be/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-09-2025"
    },
    {
        "full_article": "GST 2.0 can do wonders for the economy if industry passes on its full benefit to consumers as lower prices\nFrom promise to delivery, GST 2.0 ranks among India’s quickest reforms. Modi had promised a “Diwali gift” on I-Day, but it’s arrived a month early with Navratri. And while he’s cast it as ‘Bachat Utsav’ – savings fest – lower GST rates are really a spending stimulus. They could be transformative because India has never had such low indirect taxes before. Not under the Raj, nor during the dalliance with “socialism”, or even three decades of liberalisation. The biggest change is of mindset, though. For the first time, cars, ACs, large refrigerators and TVs are not seen as luxuries or sin goods, but as necessities. \nIn fact, govt is counting on you to buy many more of these, so that revenue lost per unit is more than made up by increased sales volumes. The finance ministry has estimated a hit of ₹48,000cr in the unlikely scenario of sales remaining stagnant. But for sales to increase, the generous tax cuts must be passed on as lower prices to customers. If ads over the past week are an indication, manufacturers and sellers are keen to oblige. This is understandable because sluggish demand has saddled manufacturers with idle capacity. Reports early this year said 50% of handset manufacturing capacity in India was unutilised. That’s an extreme case but the problem is general. In April, Maruti decided to go slow on its new 1mn-cars-per-year Gujarat plant due to tepid sales growth.\nSo, lowering prices to boost demand is in industry’s interest. It can kickstart the virtuous cycle that leads to new capital investments, jobs and scale – which is crucial for competing with China in the global market. Already, carmakers have slashed prices substantially. Small cars, which had become unaffordable after post-BS6 price hikes, are back at their 2019 price levels. Not every industry is so high-profile, however, and it’s hard to keep track of prices of every product. But one sector that’s being keenly watched is insurance, where govt has removed GST entirely on health and life products, hoping to increase their penetration. After conflicting signals, and pressure from govt, insurers have promised to pass on the full benefit, but there’s also talk of increasing premiums to account for the loss of input tax credit. While that may be necessary, insurers must guard against charging more than what’s fair, to not miss the GST 2.0 bus.\n\n",
        "headline_1": "Pay it forward",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/pay-it-forward/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-09-2025"
    },
    {
        "full_article": "Global critique of Israel is getting sharper. But what does it matter if US keeps backing Netanyahu?  \nCanada, Australia and Portugal joined UK in recognising Palestinian statehood over the weekend. This came ahead of the UN summit co-hosted by France and Saudi Arabia yesterday that focused on Israel’s war in Gaza and the elusive Two State Solution to the Israel-Palestine mother conflict. All of this makes clear a growing international momentum against Israel. The Gaza conflict is homing in on two years with Tel Aviv showing no signs of relenting. Meanwhile, Israel is expanding its settlements in West Bank. This will ensure there is no contiguous Palestine state. Thus, there’s increasing realisation that Israel is using the Gaza conflict to erase the possibility of a Palestine state itself. \nThat means defeating Hamas, the ostensible goal of Israeli military operations in Gaza, is only a pretext. Had it not been so, Tel Aviv would have had no problem in signing up to a plan that would hand over post-war Gaza to Palestinian Authority (PA). But Tel Aviv has been deliberately gutting PA and withholding the latter’s taxes, crippling its essential functions. This has even prompted Germany – an Israel ally – to consider sending financial aid to PA. \nOf course, Israel gets away with all this because of solid US backing. American Jewish and Evangelical lobbies have huge influence in US politics. Therefore, Trump can politically ill afford to dump Israel, even though he was reportedly unhappy with Netanyahu for striking Hamas leaders in Qatar. Which means UN can pass all the resolutions it wants in favour of Palestine statehood, but it won’t make much of a difference to Israel or the Gaza conflict. There might be a split in the Western camp over Israel, but this isn’t enough to rein in Tel Aviv. Even growing economic boycott of Israel may not move the needle. Israel’s actions are truly showing the limits of multilateralism. The international community can only profess helplessness. \n\n",
        "headline_1": "Helpless together",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/helpless-together/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-09-2025"
    },
    {
        "full_article": "There’s billions of man-hours of civic work waiting to be done in our cities. It’s an opportunity to employ unskilled labour, boost income and demand at the bottom of the pyramid, and boost growth in times of global uncertainties\nThis week marks a month since Trump’s penal tariff on India came into force. It’s also started with worrying news about sky-high fees for H-1B visa applications. Since 70% of these visas – 2.8L last year – go to Indians, there’s a cloud over the employment, dollar earnings, and remittances, of India’s elite STEM workers. All told, $87bn worth of goods exports and substantial services earnings may be hit.\n\nRead full story on TOI+\n\n",
        "headline_1": "Economic shocks? Get potholes filled",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/economic-shocks-get-potholes-filled/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 23, 2025 00:00:00  \nNo sooner did the public administration ministry kicked up a row over the purchase of luxury cars for ministers of the next elected government than a dilemma over imported duty-free luxury cars follows. This time, though, the disposal of 42 such special cars does not involve complexities. Imported by ministers and members of parliament (MPs) of the dissolved 12th assembly, the cars have been lying idle ever since their arrival at the Chittagong port. Those who imported the luxury vehicles taking advantage of duty-free facility fled the country. The National Board of Revenue (NBR) then put up 24 of those vehicles for open auction in order to sell those and earn Tk 1.75 billion in revenue. But there was no taker. Each vehicle cost Tk96.7 million but the NBR would have disposed those of if 60 per cent of the reserve value of Tk96.7 plus 25 per cent tax could be garnered from the open sale. Thus calculated the floor price would have come to 72.5 million for each one. \nThis incident exposes the undue provisions for outrageous privileges and perks members of the cabinet and the pliant bureaucrats enjoy. In a poor country like Bangladesh, the avarice of the power wielders knows no bound. They consider themselves the monarchs of the land and wasting public money on material possession and comfort hardly pricks their conscience. Since former autocrat HM Ershad had made the provision for duty-free import of cars for ministers and MPs in 1988, not only ministers but also members of both the ruling and opposition parties have taken advantage of it. Before election the opposition party/parties duly took a stand against this facility but on return to power or in opposition they conveniently forgot their promises. Instead of following a pro-people approach to public transport, they have always explored avenues to serve their coterie interests. \nNow that the auction prices have been far too low and the NBR can in no way realise the expected tariff from the below par sale, the revenue authority has made a wise decision. It will hand 30 of the vehicles over to the government. What about the rest 12 has not been made clear. Their conditions are not likely to be any different and if all the vehicles are added to the government's transport pool, the overenthusiastic public administration ministry's move to purchase luxury cars should be stopped once and for all. The vehicles will be procured virtually at no cost of the exchequer. \nCertainly the idea of preserving these expensive cars for use by the cabinet members of the next government is quite sobering. But the rationale behind this should not be a guiding principle for import of similar expensive cars. People in power must rein in their privileges and perks. Even the rich and elite class of society became quite used to flaunting their special status when they drove their luxury cars, blaring hooters. The privileged and powerful have failed to lose touch with the common people. If people in power do not go for a radical change in their mindset, the discrimination in society will continue to widen. Let the abuse of government pool's cars come to an end with the installation of the next elected government.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "NBR makes the  right decision",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/nbr-makes-the-right-decision-1758551875",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       September 23, 2025 00:00:00  \nFor Bengalis, Sarodiyo Durga Puja is not just a religious festival. It is a season of colour, music, artistry, and togetherness. Across towns and villages, city streets and riverbanks, the goddess is welcomed home with fanfare, her clay idols crafted lovingly by artisans who inherit centuries-old traditions. In Bangladesh, where Hindus form the country's largest minority, Durga Puja has always carried a special resonance.\nMembers of the Hindu Community have been celebrating the festival for time immemorial openly and joyfully, with their Muslim neighbours joining them in crowds at the mandaps. It became more than a festival for one community -- it grew into a national celebration, a showcase of Bengal's composite culture, and a symbol of the communal harmony that has been the lifeblood of this nation.\nBut in the past two decades, this spirit has been tested. Isolated incidents of vandalism or violence at Puja mandaps -- sometimes fuelled by rumours, sometimes by mischief -- have drawn disproportionate attention. Although statistically nominal in a country with tens of thousands of Puja celebrations, these incidents revealed a crack, however small, in the otherwise solid edifice of communal coexistence. Opportunistic political forces seized on these fissures, amplifying them to claim that Bangladesh was unsafe for its minorities. That narrative was always exaggerated, but it has gained traction in the age of digital manipulation.\nSince the formation of the interim government in 2024, this propaganda has intensified. Social media platforms have been flooded with fake images and doctored videos purporting to show attacks on Puja mandaps. Many of these originated from sources outside Bangladesh but were circulated locally to inflame tensions. The malicious campaign was clear: to tarnish the country's image, to instil fear in the Hindu community, and to suggest that the state is unable -- or unwilling -- to protect its minorities.\nThis year's Durga Puja comes with a heightened responsibility. It is not just about the celebrations but also about safeguarding a tradition that embodies Bangladesh's core identity.\nDurga Puja is the largest religious and cultural festival of the Bengali Hindu community. The preparations begin at least a couple of months ahead of the event. More than 30,000 Puja mandaps are expected to be erected this year.\nBut what makes Puja unique here is its inclusivity. Muslim neighbours visit the mandaps, share sweets, and join cultural programmes. Local businesses contribute to the celebrations. Politicians of all parties attend pandal inaugurations. The festival thus transcends religious boundaries -- it is a marker of national identity. As one elderly devotee in Dhaka once remarked: \"When the dhak drums beat, we all belong to the same rhythm.\"\nThis inclusivity is not accidental; it is also rooted in the liberation struggle. The spirit of 1971 was secular and pluralist, rejecting the communal politics of the past. \nYet history is never static. Over the past 20 years, communal harmony has faced new pressures. Attacks on Puja mandaps in certain districts -- sometimes linked to local land disputes, sometimes instigated by extremist groups -- have shaken confidence. Even when such incidents were localised and rare, they were seized upon by vested quarters to portray a broader pattern of insecurity.\nIn reality, for every isolated act of vandalism, there were hundreds of examples of solidarity: Muslim neighbours guarding mandaps at night, local youth groups ensuring order, district officials mobilising resources to support Puja committees. But those positive stories rarely went viral. Instead, sensationalist or fabricated claims dominated headlines and feeds.\nIn recent years, the weaponisation of social media has made the problem worse. A single manipulated video can trigger outrage across communities, eroding trust. Last year, a widely circulated photograph purporting to show an idol desecrated in Bangladesh was later traced to a festival in another country altogether. By the time the fact-checks came, the damage was already done.\nFaced with this challenge, Bangladesh's interim government has moved decisively. Chief Adviser Professor Muhammad Yunus, in a recent dialogue with Hindu community leaders, reassured them: \"Durga Puja is not just the festival of one community -- it is the festival of all Bangladeshis. Your celebrations are part of our shared heritage, and it is our solemn duty to ensure they take place with joy, dignity, and full security.\"\nHis words reflect not only empathy but also a recognition that the festival's protection is a test of Bangladesh's democracy itself.\nThe Home Adviser echoed this commitment with a more practical emphasis: \"We have deployed additional forces at all Puja mandaps across the country. Coordination cells are working at district and upazila levels. Intelligence monitoring has been heightened to detect and prevent any attempt to create mischief.\" \nSuch statements are welcome. But they must be backed by visible action -- police patrols, swift responses to rumours, accountability for offenders. Security cannot be symbolic; it must be effective.\nWhat gives Bangladesh resilience, however, is not only state actions but the moderation of its people. Despite provocations, the majority of Bangladeshis remain committed to communal harmony. In village after village, Muslim households contribute to Puja funds. In towns, imams and priests exchange visits. Local committees comprise members of multiple faiths.\nThis is the real Bangladesh: one that refuses to be divided. As civil society voices have argued, the spirit of liberation was built on pluralism. To undermine that is to undermine the nation itself.\nIt is worth noting that Durga Puja in Bangladesh stands out compared to some other South Asian contexts. While communal violence has scarred parts of India in recent years, and political polarisation has cast shadows over religious festivals in Nepal and Sri Lanka, Bangladesh's Puja has largely retained its inclusive character. \nThis difference should be celebrated, but not taken for granted. The same forces that fractured harmony elsewhere -- fake news, opportunistic politics, religious extremism -- are at play here too. Vigilance is therefore essential.\nPolitical leaders across the spectrum must resist the temptation to instrumentalise religious events. Elections may loom, but exploiting communal sensitivities for electoral gain is a dangerous path that risks unraveling decades of harmony.\nThis year's Puja will unfold against the backdrop of Bangladesh's democratic transition. The interim government has promised free and fair elections. Ensuring peaceful Puja celebration is therefore not only about protecting a minority festival; it is about proving that the state can guarantee equal rights and dignity for all citizens, regardless of faith.\nIn that sense, the festival is a litmus test. If it passes peacefully, it will send a message to the world that Bangladesh's pluralist spirit remains intact, despite the storms of propaganda and the pressures of transition.\nThe responsibility lies with the state, yes, but also with every citizen. Bangladeshis must stand together, as they have for decades, to ensure that the beat of the dhak drums this October is not drowned out by discord but amplified by solidarity.\nAs the Chief Adviser put it, \"Your celebrations are part of our shared heritage.\" Protecting that heritage is not just about the safety of one community. It is about the safety of Bangladesh itself.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Upholding the spirit of communal harmony",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/upholding-the-spirit-of-communal-harmony-1758551909",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       September 23, 2025 00:00:00  \nFinally, the United Kingdom, Canada and Australia have given formal recognition to the state of Palestine on Sunday, September 21. The three staunch supporters of Israel-they still are-have decided to accept the Palestinian people's right to statehood. So, what prompted the British Prime Minister Kier Starmer to make a break with his government's past stance? \nThe apparent reason, as the British PM argued, is Israel's failure to agree to a ceasefire in the Gaza war and its (Israel's) not meeting conditions including committing to a long-term sustainable peace process that delivers a two-state solution and allows more aid into the (Gaza) enclave. However, the main reason for Starmer's shift in stance is the growing public opinion against Israel's acts of mindless brutality in Gaza. In Britain, in particular, Starmer's labour government is facing intense public criticism for his stubborn and continued support for Israel so far. So, it is clearly a move on his part to placate public resentment. And, of course, Starmer's decision to recognise Palestinian state goes against the position of his strongest ally, President Donald Trump of America who is dead against any move in this direction. In any case, Mr Starmer has definitely taken a certain amount of political risk by making Trump unhappy. \nWhen Israel is carrying out a genocide where the victims are mostly children and women amidst an artificially created famine, what is actually required of the UK's premier is a strong condemnation of what Israel is doing in Gaza and at the same time issuing of sanction against Israel so none of these three countries including the UK can send any military aid to Israel. Otherwise, any half-hearted approach to the issue of Palestinian state will only further encourage Israel to continue its occupation of the West Bank and its ongoing operation in Gaza.\nSo, to put a stop to all these, the three countries should stop all moral and material support for Israel. If the UK, Canada and Australia can take such a stance, then that would definitely help restrain Israel to some extent. Even so, with US's unqualified support for Israel still in force, not much could be achieved with these countries' recognition of the state of Palestine. Now, if France also gives recognition to the state of Palestine as it has already declared, then four out of the five permanent members of the Security Council including China and the Russian Federation will be in favour of Palestine. But still America's veto can torpedo any move made on behalf of Palestine. Now when these three Western allies of Israel declared their decision to recognise a Palestinian state, Israel was carrying out its offensive towards the central Gaza forcing thousands of Gazans out of their shelters and killing and maiming scores of Palestinians.\nSo, one wonders what is the use of this recognition of a Palestinian state for the Gazan children whose parents and siblings have been massacred by Israeli bombs and bullets? What is the use of a formal recognition of a Palestinian state for those Palestinian people who are still on the run and have no guarantee that they will survive another day under the relentless pounding of Israeli artillery shells and aerial bombardment? \nAgainst this backdrop, to add any meaning to their act of recognising a Palestinian state, the British, Canadian and Australian leaders should be able to prevail upon the Israeli government to stop its extermination campaign of the Palestinians in Gaza. For, if there is nobody in Palestine to enjoy the fruit of statehood, then how can the Western leaders hope to foresee two states-Israel and Palestine-living peacefully side by side! Most importantly, if Israel continues to defy all international rules and norms, doesn't give a damn about UN resolutions, International Court of Justice (ICJ)'s orders and so on, then how is the international community going to implement its decisions about a Palestinian state?\nThe international community needs to take a stronger and more proactive stance to add meaning to their recognition of a Palestinian state.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Adding meaning to the recognition of Palestine",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/adding-meaning-to-the-recognition-of-palestine-1758551990",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 23, 2025 00:00:00  \nRecently, we saw protests in Dhaka by frustrated graduates who couldn't secure employment after graduation and rising tuition rates. It underscores an unappealing truth: our focus on four-year university degrees is leaving much too many young adults without employment while crucial industry sectors are facing shortage of skilled workers.\nBangladesh produces over a million graduates annually, yet many end up in low-paying, unrelated jobs. Germany and Vietnam have proven the might of vocational training, combining school theoretical training with work apprenticeships in response to labor market demands. Bangladesh must do the same.\nUniversities are still crucial for churning out doctors, engineers, and innovators. But vocational training needs to be regarded as an equally valued, adequately funded route to prosperity. Upgrading training facilities, synchronising study programmes with industry demands, and glorifying skilled trades as honourable, lucrative careers is needed.\nOur young people deserve better than dead-end degrees. Diversifying education will translate frustration into possibilities-and build the workforce to power Bangladesh's next growth chapter.\nSafiqul Haque Eifty\nDepartment of International Business and Marketing\nNorth South University\neiftyhaque@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Re-evaluating obsession with graduation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/re-evaluating-obsession-with-graduation-1758552014",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-09-2025"
    }
]