[
    {
        "full_article": "The call for the removal of the words “secular” and “socialist” from the Preamble to the Constitution of India is no longer a fringe fantasy. With someone as senior and influential as the Rashtriya Swayamsevak Sangh (RSS) General Secretary Dattatreya Hosabale making a public statement in support of the idea, it has now acquired a new urgency and prominence in national politics. The words “secular” and “socialist” were introduced through the 42nd Amendment to the Constitution, during the Emergency under Prime Minister Indira Gandhi in 1976. And the Janata Party government, which included RSS-affiliated leaders, that replaced Indira Gandhi and reversed a lot of the changes made in the Constitution during the Emergency let these words stay. These concepts were so central to the Constitution of the new Republic that its original authors did not think it was even necessary to use these words in the Preamble. When a conflict over India’s national identity began to emerge during the 1970s, Indira Gandhi thought it would be appropriate and also politically rewarding to make these amendments. The Hindutva camp never really opposed these concepts historically. Gandhian Socialism was a part of the core tenets of the Jan Sangh, the earlier avatar of the Bharatiya Janata Party (BJP). Hindutva proponents accused their rivals of following ‘pseudo secularism,’ and by implication, claimed to be genuine secularists.The words “secular” and “socialist” have attained meanings specific to the Indian context over the years. Secularism is not a rejection of Indian civilisational heritage or any religion, but a commitment to equal treatment of all faiths by the state. Indira Gandhi had been viewed as someone pandering to Hindu sentiments. Socialism is not about hostility to private property or enterprise, but a pragmatic appreciation of the fact that the state must take proactive measures to tackle poverty and expand opportunities for the deprived sections of society. The words ‘secularism’ and ‘socialism’ reflect a broad consensus in Indian politics that has held for decades. There is nothing to be achieved by raking up a meaningless debate on these words. Perhaps the debate itself is the objective: to push a divisive agenda without providing any ideological, legal or practical reasoning for this demand. India’s challenge is not about these two words, but its continuing struggle to tackle discrimination, poverty and underdevelopment, which are often influenced by the caste and religious origins of its citizens. The Sangh Parivar, and the BJP, could serve the country better by focusing on these challenges rather than wasting energy on divisive debates on settled semantics.\r Published - July 05, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        constitution\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        poverty\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "​Settled semantics: On the Preamble and divisive debates",
        "headline_2": "Nothing of worth will be gained by removing two words from the Preamble",
        "link": "https://www.thehindu.com/opinion/editorial/settled-semantics-on-the-preamble-and-divisive-debates/article69773039.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "06-07-2025"
    },
    {
        "full_article": "The eighth anniversary of the Goods and Services Tax (GST) in India, on July 1, coincided with the poorest tax collections the indirect tax system has seen in some time, highlighting the need for structural changes in the system. The latest GST collections stood at ₹1.85 lakh crore in June 2025, the lowest in four months. This amount was just 6.2% higher than the collections in June 2024, the slowest growth rate in four years. Looking past the gross collections, the data show that once refunds are accounted for, the growth in the government’s actual collections was just 3.3%. Further, the revenue from domestic transactions, excluding imports, was an anaemic 4.6% higher than in June last year — barely faster than the average rate of inflation since then. Being a consumption tax, a dip in GST collections reflects a dip in economic activity. But it also reflects inefficiencies in the system, which must now suitably be addressed eight years on. A common demand is for fuel to be included in GST. There is, however, strong resistance to this from State governments, since fuel and alcohol are the few sources of revenue States have with them that are independent of the Centre. However, this cannot be reason enough to perpetually keep these items excluded. It is ‘one nation, one tax’ after all, and it is high time that the goal was achieved in full. As for the revenue hit to States, the Centre must accede to their request for a higher share in central taxes. The Centre must also stop increasingly relying on non-shareable cesses for its revenue. For their part, States must resist the temptation to use this higher amount on election-oriented untargeted freebies. Trust goes two ways.The other popular reform is a reduction in the number of GST rates. This, too, is overdue, and the GST Council’s fitment and rate-setting committees are examining the issue. Connected to this is the question of what is to be done with the GST Compensation Cess, which is levied over and above the 28% slab. It was originally intended to compensate States for any losses arising out of GST implementation for a period of five years. It was then extended until March 2026 to repay the loan taken by the Centre to pay this compensation since the COVID-19 pandemic had disrupted revenues. The Centre should avoid the temptation to subsume this cess into the broader GST rates. Instead, with its job done, the cess must be removed. Taxation is not just a covenant between the Centre and the States. It is also one with the people. Removing a cess that is no longer needed will not only garner public praise but could also spur some sorely needed urban consumption. Published - July 05, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        loans\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        imports",
        "headline_1": "Cease the cess: On the GST and reforms",
        "headline_2": "Low GST collections speak to the need for structural reforms",
        "link": "https://www.thehindu.com/opinion/editorial/cease-the-cess-on-the-gst-and-reforms/article69772997.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "06-07-2025"
    },
    {
        "full_article": "Cultures that fetishise food stick women in the kitchen for hours on hours. Gender parity takes off where the cuisine is functional, UK to Germany, overcooked cabbage to sausage\nThere’s a pungent paradox simmering in the world’s most celebrated kitchens: the better the cuisine, the worse the gender politics that come marinated with it. Somewhere between turmeric and tears, food becomes a trapdoor – one that opens only under female feet.\nThe hypothesis isn’t flambéed for effect. It’s slow-roasted in history: behind every mouthwatering national dish is a woman whose labour was ritualised, romanticised, and eventually rendered invisible.\n\nBecause once a culture begins to fetishise food, it quietly starts domesticating the female body – one rolling pin at a time.\nRead the full story on TOI+.\n\n",
        "headline_1": "Gender’s gourmet trap",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/genders-gourmet-trap/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-07-2025"
    },
    {
        "full_article": "Public outrage has muted Delhi’s drive to push out old cars. Bigger problem is that clean air policies are fashioned without scientific insight or robust data. Some actually hurt the environment\nPublic backlash has forced the Delhi government to walk back from its initiative to impound ‘end of life’ vehicles. But before this, the sudden outrage over the directive to stop refuelling diesel vehicles older than 10 years and petrol vehicles older than 15 years was somewhat amusing.\n\nMany seemed to believe this was a new crackdown.\nRead the full story on TOI+.\n\n",
        "headline_1": "Virtue signalling doesn’t control pollution",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/virtue-signalling-doesnt-control-pollution/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-07-2025"
    },
    {
        "full_article": "EC’s revision is more confusing than comforting\nEC’s assurances about the efficiency of its Special Intensive Revision of Bihar’s voter roll aside, the ground reality is that many ordinary voters are confused, more so since state poll commission is in overdrive just months before elections. \nBad timing | The issue’s bigger than opposition concerns. The main problem is the rushed schedule. Not only is monsoon the wrong time for such a revision in the flood-prone state, it is distressing for residents, stressful for poll workers, and inaccuracies can be costly. First booth level officer’s multiple visits to each potential voter’s residence – first to give a pre-filled or empty form then to collect it with or without documents on a case-to-case basis. Second, given Bihar’s patchy documentation, getting hold of documents can be tough. Third, if a potential voter fails to ensure BLO has his/her form and documents, they won’t be included in the new voter roll. Fourth, BLOs must collect, verify, collate, scan ID documents and upload all of it within weeks for an estimated 7cr people. Fifth, having a month for ‘claims & objections’ after the draft roll is published on Aug 1 misses the point. It means voters must make themselves available away from their work in other districts and states, first for BLOs in July, then in Aug if excluded. How many Bihari workers have that luxury?\nFaulty logic | EC has cited rapid urbanisation, migration, and inclusion of undocumented immigrants for springing this on Bihar. The first is unrelated to the emphasis on birth certificates. For the second, residency proof is required to remove inter- and intra-district duplication. What acceptable residency document does a migrant show in his work-town? As for the third, whether the issue can be fixed by Sept 30 (deadline for final voter roll) and is big enough in Bihar to offset the high probability of disenfranchising ordinary voters is debatable.\n\n",
        "headline_1": "Roll muddle",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/roll-muddle/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-07-2025"
    },
    {
        "full_article": "Faiz’s work endures because its core is humanism\n It started like many love stories. An 18-year-old in Sialkot fell in love with a neighbour, most likely an Afghan woman. With no courage to express his feelings, he went on to Lahore for higher study, and she got married. A lecturer of English in Amritsar, haunted by his unfulfilled romance, Marxism drew him in. As a pioneer of the subcontinent’s political poetry, a towering figure in Urdu, winner of Lenin Peace Prize, implicated in a leftist conspiracy to overthrow Pakistan’s Liaquat Ali Khan administration, a supporter of Iran’s Islamic Revolution but not an Islamist and finally restless and self-exiled in Beirut after Zia executed Bhutto — Faiz would go on to say that it was the early two phases that shaped the poet in him, leaving behind a legacy that still gives voice and expression to the voiceless.\nAur bhi dukh hain zamane mein mohabbat ke siva, rahaten aur bhi hain vasl ki rahat ke siva, mujh se pahli si mohabbat mere mehboob na maang (The world has other problems and there are other comforts than a lover’s warm embrace. So, my love, don’t ask I love you like I once did). That’s how Faiz married romance and politics.\nHe became friendly with Mahmud-uz-Zafar and his wife, Rashid Jahan. In 1932, he with four Oxford-educated friends published a collection of short stories and a play in a collection named Angarey (Fire). The stories, mostly feminist, attacked conservatism and talked about equality and freedom. The book was banned immediately, but these stories led to the Progressive Writers Association in India, of which Faiz was an integral part.\nThere was a brief break in his poetic career when he joined the army during the Second World War. A decorated officer, he resigned in 1947 to become the editor of The Pakistan Times, a left-leaning, English-language newspaper. Disillusioned by the communal violence during Partition, on Pakistan’s Independence Day, he wrote, ye daagh daagh ujala ye shab-gazida sahar, vo intizar tha jis ka ye vo sahar to nahin (This light, stained by darkness, is like the dawn tainted by dusk. This is not the dawn we waited for).\nIn 1951, he, along with left-leaning army officers, was arrested for an officially termed ‘leftist conspiracy’ to overthrow the Liaquat Ali Khan govt. From jail, he published two books, Dast-e Saba (The Hand of the Breeze) and Zindan Namah (Prison Chronicles). Faiz refused to give up on hope and from the prison cell, wrote, qafas udaas hai yaaro saba se kuchh to kaho. kahin to bahr-e-ḳhuda aaj zikr-e-yar chale (The cage is sad and silent. Say something to the breeze. For god’s sake, let’s talk about my beloved).\nReleased after four years, his world had changed. Pakistan had signed SEATO and CENTO and moved away from the Soviets, a country he drew inspiration from, and joined America, which he despised. The next few years were relatively peaceful. Bhutto appointed him cultural advisor to the Ministry of Education and at his initiative folk stories and art from different parts of Pakistan were documented.\nIn 1974, he accompanied Bhutto to Bangladesh and on the request of Sheikh Mujibur Rahman composed, Ham ki thahre ajnabi itni mudaraton ke baad. phir banenge ashna kitni mulaqaton ke baad (Despite the hospitality, we remain strangers, and who knows how many meetings it will take to become friends again).\nBut the peace was short-lived as Zia arrested Bhutto, and Faiz self-exiled to Beirut to become the editor of Lotus – a magazine established to promote non-Eurocentric Asian and African writing. The Magazine’s Beirut office was inaugurated by Yasser Arafat. His friends have noted that he felt estranged and uprooted and longed for his people. The result was, Mere dil, mere musafir, hua phir se hukm sadir, ki vatan-badar hon hum tum (My heart, my traveller, the order is issued again and we are exiled again).\nHis most enduring work Hum Dekhenge is, at its core, a poem of dissent. If some critique it as anti-Hinduism, it is anti-Islam as well.  Hum Dekhenge was published in the book Mere Dil Mere Musafir and was inspired by the Islamic revolution in Iran, which Faiz supported. Experts are divided about the message of the poem. The theme is inspired from the Quran’s Surah al-Waqi’ah – the inevitability of Qayamat (doomsday), when the earth will tremble and the mountains will shake, and in the poem’s climax, the literal translation would state that idols are removed from the Kaaba to establish the rule of Allah.\nBut it’s been argued that these lines can also mean ‘When every idol – false gods and tyrants – will be removed from the house of God, which is earth.’ His support for Iran’s Islamic revolution didn’t make Faiz an Islamist – he was charmed by the people’s power to fight the army and depose the Shah.  \nIn the climax of the poem he says, Utthega anal haq ka nara, jo mai bhi hu or tum bhi ho. Bus raj karegi khalke khuda jo mai bhi hu or tum bhi ho. Anal- Haq means ‘I am the truth’ and Faiz imagines that this slogan will be raised by everyone. In Semitic religions like Islam, Judaism, and Christianity, there’s a strict duality between God and creation – God is separate and transcendent. In contrast, the Sufi anal haq resonates with the Advaita concept of Aham Brahmasmi or “I am one with God”. By this interpretation, the message of this poem is that human beings themselves are the ultimate truth – divinity is within humanity and hence the divine right to self-rule.\n\n",
        "headline_1": "Poetry & politics, in love & war",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/poetry-politics-in-love-war/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-07-2025"
    },
    {
        "full_article": "We are deeply concerned by the continuing stalemate at the Khulna University of Engineering and Technology (KUET), where academic activities have remained suspended for about four and a half months now. As one may recall, on February 18, two student groups—Bangladesh Jatiotabadi Chatradal (JCD) and Students Against Discrimination (SAD)—clashed over demands to ban student politics on the campus. In the aftermath of the violence, students demanded the resignation of the then VC, pro-VC, and director of students' welfare. The prolonged protests, including a hunger strike by students, eventually led to the removal of the VC and pro-VC. Although a new VC was appointed on May 1, he resigned on May 22, citing pressure and a lack of support from the KUET Teachers' Association. Despite a directive from the Ministry of Education to resume academic activities from May 4, the teachers' association has continued to boycott all academic and administrative responsibilities.\nAmid such a situation, it is the students who are suffering the most. Since the 2024 July uprising, campuses across the country have witnessed recurring unrest, where students, teachers, and administrators clashed over various grievances but meaningful solutions were rarely achieved. KUET has become a major example of this. The academic future of its 7,565 students now remains in limbo, and the newly enrolled first-year students—originally scheduled to begin classes on April 24—have yet to start their academic journey. However, the teachers' association has clearly stated that without the appointment of a new VC, the current stalemate cannot be resolved. They reiterated their demand for disciplinary action against certain students and \"outsiders\" who allegedly harassed faculty members during the earlier unrest.\nMeanwhile, with both the VC and pro-VC positions remaining vacant, the university's administrative and financial operations—including salary disbursements, project payments, and academic decisions—have come to a standstill. Reportedly, more than 1,100 teachers, officers, and staff members have not received their salaries since May. In addition, all infrastructure development projects may soon come to a halt unless a new VC is appointed. Furthermore, if the university fails to utilise its allocated revenue budget, there is a risk that the funds will be forfeited. This situation is deeply worrying.\nWe urge the government to immediately resolve KUET's prolonged crisis by appointing a VC and pro-VC through proper procedures. It should listen to the concerns of both teachers and students and take initiatives to solve the underlying issues through meaningful dialogue. Most importantly, the government must ensure that all academic activities, including classes and examinations, resume without any further delay.\n",
        "headline_1": "Don't let Kuet stalemate drag on any further",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/dont-let-kuet-stalemate-drag-any-further-3931506",
        "news_paper_name": "The Daily Star",
        "publish_date": "06-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 06, 2025 12:00:00  \nThe interim government's initiative to launch a comprehensive reform process through the National Consensus Commission (NCC) is a response to the growing public demand for structural change and democratic renewal. It is encouraging that political parties, through NCC-hosted discussions, are beginning to rise above partisan divides and find common ground on key reforms vital for building durable democracy. A tangible result of this emerging consensus is the recent agreement among major political parties to curb the misuse of presidential clemency and decentralise the judiciary, two contentious constitutional issues that have long fuelled public distrust and centralised power. This development, revealed by NCC vice-chairman Professor Ali Riaz, follows discussions with representatives from 30 political parties and marks a collective step towards institutional accountability and judicial accessibility. \nUnder the current Article 49 of the constitution, the president holds unchecked authority to pardon, suspend or commute any court sentence. In practice, this authority has often been misued for political ends including the controversial pardoning of individuals convicted of serious crimes. The proposed amendment would retain the president's clemency power but make it subject to clear legal criteria and procedures. This change would bring Bangladesh in line with global norms that limit executive discretion and promote accountability. Similarly, decentralising the judiciary by establishing permanent High Court benches addresses a critical bottleneck in the legal system. The justice system is now struggling with a massive backlog of several million cases, causing trials to take an average of five to ten years. Compounding the issue, centralisation of higher judiciary functions in Dhaka places an undue burden on citizens living in remote districts. Amending Article 100 to establish permanent High Court benches in each division would ease this burden. It would improve access to justice and help close the longstanding gap between the judiciary and ordinary citizens. \nThe significance of these consensus-based steps must be understood within the context of broader reform agenda enabled by the mass uprising of July 2024. That uprising, and the sacrifices made during it, made clear that the people of Bangladesh no longer accept a political order where power is concentrated, unaccountable and shielded from public scrutiny. In conversations, public forums and national dialogues, a collective demand for democratic transformation emerged. The NCC is now engaging with political parties to channel these aspirations into concrete reforms. Alongside clemency and judicial structure, the NCC discussions have led to tentative agreements on other key issues including the caretaker government system, term limits for the Prime Minister and the creation of a second chamber in the legislature. However, disagreements persist on other matters including the structure of the upper house and appointments to constitutional bodies.\nIn a multiparty democracy, ideological and policy differences are natural. Democracy does not demand uniformity, but it does require that all actors move forward together. At the same time, it is essential to ensure the current negotiations do not unravel over divisive side issues. This July offers both a symbolic and practical opportunity to finalise what many hope will become the July Charter. Such a charter would not only honour the martyrs of the 2024 uprising but also reaffirm a shared commitment to a just and inclusive democratic state. The recent consensus on presidential clemency and judicial decentralisation proves that differences can be bridged through dialogue and compromise. Political parties must now resist the lure of short-term advantage and build on this progress by finalising concrete legislative proposals. Any delay, indecision or retreat would risk undermining this historic opportunity to secure a democratic future.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Unity for durable democratic reform",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/unity-for-durable-democratic-reform-1751727326",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       July 06, 2025 00:00:00  \nAnother fiscal year, 2025-26, to be precise, began on Tuesday with a mix of legacy burdens and achievements in the country's economy. Moving forward and achieving the desired economic growth and inflation targets by the end of the year will not be easy since there are a number of challenges. In the national budget for the new fiscal year (FY26), the finance adviser of the interim government set a modest target of 5.50 per cent growth of gross domestic product (GDP). The government wants to keep the rate of inflation at 6.50 per cent in FY26. How realistic are the targets? One needs to analyse the relevant issues, external as well as domestic, to find the answer. However, there are reasons to be hopeful of a significant growth in the upcoming fiscal year. \nIn the just-concluded fiscal year (FY25), the GDP growth rate stood at 3.97 per cent, as per the provisional estimate of the Bangladesh Bureau of Statistics (BBS). The interim government expects the rate to be 5.25 per cent in the final count. It is not unlikely that the final growth rate in the last fiscal year will exceed the five per cent mark, as the country entered a relatively stable period compared to the previous fiscal year (FY24) when the growth rate was recorded at 4.22 per cent. \nIn FY25, the economy experienced two sluggish phases, which reduced the growth rate. First, it was an election year, and the 12th national parliament election took place in the middle of the fiscal year. On the eve of the election, economic activities slowed down due to uncertainties about the post-election situation. It was widely known that the last national polls was yet another farcical election under the authoritarian regime of Sheikh Hasina. The regime engineered the election to stay in power for another five years. \nHistorical trends have shown that GDP growth typically declines during election years compared to the previous fiscal year. Since the revival of democracy in 1991, following the fall of Ershad's autocratic regime, the trend was visible until 2008. For instance, GDP growth was 5.10 per cent in FY01, which decreased to 3.80 per cent in FY02, the election year of the eighth national parliament. The trend, however, was reversed during the tenth and eleventh parliament polls held in 2014 and 2018, respectively. The GDP growth rate increased to 7.0 per cent in FY14 from 6.60 per cent in FY13 and to 7.88 per cent in FY19 from 7.32 per cent in FY18. As both polls were held in the middle of the respective fiscal years, the economy overcame the pre-poll sluggishness during the post-poll period, contributing to a rise in growth.\n\nIt is, however, essential to note that both the tenth and eleventh national elections were marred by controversy for various reasons. The Hasina government scrapped the constitutional provision for holding elections under a caretaker government in 2011 with the 15th constitutional amendment. The main reason was to make the path of being re-elected again and again without any hindrance. In the absence of a caretaker government, the Hasina-led Awami League took complete control of the administration and marginalised the main opposition, the Bangladesh Nationalist Party (BNP), by forcing it not to take part in the election. Mass rigging was recorded in these two elections. In a similar vein, the national election took place in the middle of FY24, and Hasina was re-elected as the Prime Minister for the fourth time at a stretch.\nBut things did not go as planned after the election as student-led protests spread gradually across the country. Initially, the protest movement was launched to abolish the quota system in government jobs. Soon, it turned into a mass movement against corruption and intimidation by the Hasian regime. Therefore, the second half of FY24, or the post-poll period, was unstable, and the economy did not recover from the pre-poll sluggishness. Although the mass movement turned into a mass uprising in July, the first month of FY25, the previous months, especially the last quarter of FY24, were volatile, with the GDP growth rate dropping to 2.14 per cent from 4.62 per cent in the third quarter of the fiscal year. The ultimate result is a sharp decline in overall GDP growth in FY24 to 4.22 per cent from 5.78 per cent in FY23.\nNow, the economy has weathered the most turbulent period in the first quarter of FY25, following the mass uprising that compelled Hasina to step down and flee the country to seek shelter in India on August 5 last year. The country also sank into chaos and uncertainty for the time being, although people in general were jubilant and hopeful for a better future. The GDP growth rate decreased to 1.96 per cent in the first quarter of FY25 but then significantly rebounded to 4.48 per cent in the second quarter. The Yunus-led interim government has taken several steps to restore the economy over the past few months. Economic activities also started to pickup and the final outcome will depend on socio-political stability in the country. \nThe core challenges to achieving the modest target of GDP growth in the current fiscal year include higher inflation and uncertainties in global trade. The annual average rate of inflation is still above 9.0 per cent, while the monthly inflation rate has also been above 9.0 per cent (as of May 2025). The annual average inflation rate jumped in FY23 to 9.02 per cent from 6.15 per cent in FY22, reflecting monetary mismanagement and a distorted supply chain due to rent-seeking activities in the market during the Hasina regime. Inflation increased further in FY24 to 9.73 per cent. These challenges are significant and need to be addressed for the economy to thrive. \nBangladesh Bank, under the new leadership after the interim government took charge, has intensified its battle against inflation by implementing persistent rate hikes. The tight monetary stance necessitated a temporary sacrifice of growth to contain inflationary pressures. The step had paid off slowly, as the monthly inflation rate started to decline since November last when it was 11.38 per cent. The rate has dropped below 10 per cent since January this year. \nAs the central bank prepares to formulate and announce the Monetary Policy Statement (MPS) for the first half of FY26 (July-December), it is already seeking suggestions and opinions from individuals and institutions. The new MPS will likely set the target to keep the inflation ceiling at 6.50 per cent in sync with the FY26 budget target. It means the economy is unlikely to stay in the 'low-growth high-inflation' cycle for the third consecutive year.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Economy in a new fiscal year",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/economy-in-a-new-fiscal-year-1751727647",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       July 06, 2025 00:00:00  \nRepeated, haphazard road digging by various agencies and delays in repairing those dug-up roads have long been a chronic problem in Dhaka. In recent months, however, the situation has worsened, particularly in Dhaka South, seemingly due to the prolonged administrative deadlock at Nagar Bhaban over the mayoral controversy. Numerous roads across the city have remained in a dug-up condition for months, and with the onset of the monsoon, they have become virtually death traps.\nTake, for example, the Mugda-Manda area, where the main road as well as various other small roads were dug up for widening and laying underground utility lines. Similarly, the main road from Dakhin Khan to Begunbari Bridge in Sabujbagh area has remained in an excavated state for nearly a year. While residents welcomed the development work, considering the need for better infrastructure and utility services, the excessive delay in completing the projects has left them in a dire situation. After the initial digging, many of these roads have been abandoned in a broken, unusable condition for months, with no sign of repair. Vehicles are barred from using these roads due to the ongoing construction, forcing locals to walk long distances or take lengthy detours for their daily commutes. Worse still, no one knows when the torment of this delayed development work will end. \nA photograph published in Saturday's issue of this paper gives a glimpse into the suffering of city dwellers, which shows a motorcycle overturned on a dug-up road on RK Mission Road in the Tikatuli area of Dhaka South. Besides, rickshaw wheels frequently get stuck in open pits, and pedestrians are seen tripping over loose soil and debris. Besides the risk of accidents, the consequences of unrepaired roads include heightened air pollution, severe traffic congestion, business losses, and difficulty in transporting critically ill patients to hospitals from the affected areas. Is anyone held accountable for excavating the city roads and leaving them in a dug-up condition for an extended period?\nThe 2019 Road Excavation Policy outlines that excavation should be done in small sections, work must be completed within 15 days, roads should be reinforced with sand and bricks immediately, and debris must be cleared within 24 hours. Furthermore, the policy requires that both the road and its surface drains be cleaned thoroughly once the work is finished.\nHowever, these policies are hardly enforced. While utility service providers such as WASA, DESA, and Titas Gas claim they pay advance fees and secure permission before digging, the responsibility of repairing the roads lies with the city corporations. But the city corporations procrastinate, leaving the roads in disrepair for extended periods.\nEven more troubling is the complete lack of coordination among the various agencies digging up the roads. It is not uncommon to see the same stretch of road being dug up by multiple agencies, one after the other, due to the absence of any central coordinating authority. As recent news reports inform that the Badda Link Road to Norda-Baridhara stretch was repaired just a month ago, and surprisingly, another agency is now digging it again. This kind of mismanagement is not just frustrating, it's outrageous.\nIn addition, deadlines are routinely ignored. A recent report highlighted that WASA began digging a road on Bepari Lane in Bara Moghbazar three weeks ago, with a completion deadline of two weeks. However, only half the work has been completed so far. Meanwhile, the roadside pits and rubble continue to cause severe inconvenience to commuters, pollute the environment, and intensify gridlocks.\nThere's also a darker side to this saga. Allegations are rife that dishonest contractors and officials benefit from this continuous cycle of digging. The more they dig, the more they earn. Public inconvenience seems to matter little.\nThe people had high hopes from this post-uprising 'new Bangladesh', but their hopes are now dashed as corruption in various government offices and local rent-seeking continue unabated. It is high time the government took a decisive action. A central coordination body must be established to regulate and monitor all road excavation activities in Dhaka, which should be empowered to ensure compliance with the law, streamline project scheduling, and hold agencies accountable for delays and negligence. Without a clear strategy and strict coordination, Dhaka's roads will remain trapped in an endless cycle of digging and disorder, while the people will continue to suffer.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Endless suffering of road digging",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/endless-suffering-of-road-digging-1751727695",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 06, 2025 00:00:00  \n\nBangladesh continues to face numerous challenges - social, economic, and cultural - that hinder its overall progress. While we have adopted more advanced methods and solutions in recent years, our position in the global economic landscape remains weak.\nTo drive meaningful changes, the equal participation of both men and women in the economy is essential. Although women's involvement in the labour force has increased, in many households across Bangladesh, the burden of earning still falls solely on the father. This traditional structure often places immense pressure on a single individual, limiting the family's financial and social growth.\nIn this context, we must encourage a cultural shift. If young adults aged 18 and above are encouraged to work part-time while pursuing their education, they can contribute meaningfully to the household and the broader economy. However, social taboos continue to restrict this progress. For instance, when girls from upper- or middle-class families choose to work-whether in offices, stores, or any professional setting-they are often judged or shamed. This mindset is both outdated and counterproductive.\nTo build a truly progressive Bangladesh, we must reject these harmful stereotypes and promote the idea of shared responsibility within families. Economic self-reliance for all family members-regardless of gender or social status-should be normalised and celebrated.\nBreaking free from rigid class-based expectations and fostering an inclusive work culture will not only reduce economic dependency but also strengthen the foundations of our society. A nation thrives when every individual has the freedom and opportunity to contribute.\nLamia Chowdhury Esha\nDhaka\nlamia.esha@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Shaping a progressive Bangladesh",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/shaping-a-progressive-bangladesh-1751727709",
        "news_paper_name": "The Financial Express",
        "publish_date": "06-07-2025"
    }
]