[
    {
        "full_article": "In yet another press conference, Congress leader and Leader of the Opposition in the Lok Sabha Rahul Gandhilevelled serious allegations against the Election Commission of India (ECI) and the Chief Election Commissioner of India. He accused the ECI of inaction in a case of fraud involving electoral rolls in the Aland constituency in the run-up to the 2023 Karnataka Assembly elections. While his allegations in an earlier press conference, on electoral roll inconsistencies in the Mahadevapura constituency in Karnataka, did not really add up to the definite existence of a ploy to aid a particular party, his accusations on Aland are a smoking gun — that attempts were made at manipulation, to the Congress’s disadvantage, in a close contest with the Bharatiya Janata Party. The Aland findings, brought out first in an investigative report in The Hindu earlier this month, did not pertain to any actual effect on the elections. This is because the ECI did manage to stop the fraudulent deletion of nearly 6,000 voters after miscreants filed Form-7 applications designed to remove the names of legitimate voters. But Mr. Gandhi’s allegations, taking off from The Hindu’s report, are centred on the fact that a CID probe into the fraudulent activity has been stalled due to the ECI’s refusal to provide access to crucial technical documentation, leaving investigators unable to follow the digital footprint of the fraud, buried in a maze of shifting IP addresses and phone numbers.The ECI’s reaction is puzzling — it acknowledges that fraudulent attempts to delete voter names were made and that it had shared details with the police investigating the case, but it does not address the core allegation about not responding to the CID’s repeated requests for “destination IP and destination port” data, which are necessary to pinpoint device data and, in turn, the identity and location of the fraudsters. Without this, it would be akin to finding a needle in a haystack. The ECI must respond specifically to these allegations and to the requests made by the Karnataka CID. It should also work to prevent Form-7 misuse, especially to stop voter removal by third parties. At a time when the ECI’s credibility has taken a hit — largely of its own doing given the manner in which it has gone about the Special Intensive Revision (SIR) in Bihar — its dismissive reaction to the serious allegations in the Aland case is unnecessary and counter-productive. Mr. Gandhi and his party should not limit their critique of the ECI, the SIR process and inconsistencies in electoral rolls to rhetoric and a regurgitation of known data. They must do more to raise public consciousness about the need to have a fair and just electoral process. Published - September 20, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        Karnataka Assembly Elections 2023\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        investigation\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        police\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        judiciary (system of justice)",
        "headline_1": "Quit stalling: On Aland, Rahul Gandhi’s press meet, the ECI’s response",
        "headline_2": "The Election Commission of India must aid in taking forward the probe on Aland electoral roll fraud",
        "link": "https://www.thehindu.com/opinion/editorial/quit-stalling-on-aland-rahul-gandhis-press-meet-the-ecis-response/article70070671.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-09-2025"
    },
    {
        "full_article": "The signing of a mutual defence agreement between Saudi Arabia and Pakistan, which declares that “any aggression ... shall be considered an aggression against both”, is a moment of consequence for both countries as well as for West and South Asia. Saudi Arabia, the custodian of Islam’s two holiest mosques, and Pakistan, the Islamic world’s only nuclear power, have always enjoyed a special relationship. Pakistan has trained Saudi forces for decades, while the kingdom has provided generous financial assistance, including help for Islamabad’s nuclear programme. With the agreement, this partnership has now been institutionalised. Yet, its timing, announced a week after Israel bombed Qatar, underlines the shifting sands in the Persian Gulf’s security landscape. For decades, its monarchies relied on solid security guarantees from the U.S. But with the U.S. focus shifting away from West Asia, the durability of the old framework has come into question. When Saudi oil installations were attacked by Iranian allies in 2019, the U.S. did nothing. Israel’s attack on Qatar, which hosts America’s largest base in West Asia, seems to have expedited the realignment.In the Abraham Accords, the U.S. tried to bring the Arab monarchies and Israel closer to build a common front against Iran. Four Arab countries, including the UAE, signed up, and Saudi Arabia was expected to follow. But the Hamas attack of October 7, 2023 and Israel’s Gaza war, which has spilled into other countries, have derailed the process. With the Pakistan agreement, Saudi Arabia is sending a clear signal to Washington and Tel Aviv that it is diversifying its security alliances. For Pakistan, which desperately needs Saudi financial assistance, closer defence ties at a time when Gulf monarchies are rattled by Israel’s unchecked militarism, are an opportunity to present itself as a security provider. For India, which fought with Pakistan in May, the agreement could complicate its manoeuvres in West Asia. As India has taken a pro-Israel tilt, Arab monarchies seem to be hedging their bets, even if that means overlooking India’s concerns. Yet, it is not clear whether the agreement offers Pakistan’s nuclear umbrella to Saudi Arabia or an immediate Saudi response if Pakistan comes under attack. Risks of entrapment come with the agreement: Pakistan could be dragged into West Asia’s polycrisis or Saudi Arabia could be pulled into the tensions in South and Central Asia. India must prepare for rapid changes in West Asia’s security order. It might be tempted to double down on its tilt towards an isolated, dangerous Israel. That would be a mistake. Instead, India’s long-term focus should be on promoting stability in the region, and maintaining a strategic balance among all pillars of its West Asia policy. Published - September 20, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        defence\n                    \n                            /                      \n                        \n                        Saudi Arabia\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        armed conflict\n                    \n                            /                      \n                        \n                        armed Forces\n                    \n                            /                      \n                        \n                        nuclear policy\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        Qatar\n                    \n                            /                      \n                        \n                        imperial and royal matters\n                    \n                            /                      \n                        \n                        United Arab Emirates\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        diplomacy",
        "headline_1": "Shifting sands: On the defence agreement between Saudi Arabia, Pakistan",
        "headline_2": "India’s West Asia policy must maintain a strategic balance",
        "link": "https://www.thehindu.com/opinion/editorial/shifting-sands-on-the-defence-agreement-between-saudi-arabia-pakistan/article70070190.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-09-2025"
    },
    {
        "full_article": "Plenty, because we aren’t so different from wheat and yeast\nThe periodic table sorts 118 elements into rows and columns. Two dozen of these are manmade, the rest are building blocks of everything across the universe. Similarly, amino acids are the building blocks of life. All living things – from a virus to a blue whale – are assembled from just 20 of these. Dive into a cell, and the nucleotides or building blocks of DNA – A, T, C, G – are also identical across plants and animals. \nThe ancients had grasped this unity via philosophical reasoning. The Gita, for instance, urges you to see “one undivided imperishable reality within all diverse living beings”. Nikolay Kukushkin, neuroscientist and self-described “molecular philosopher”, discusses this unity with scientific rigour in his book One Hand Clapping: Unravelling the Mystery of the Human Mind. \nKukushkin studies “the miracle by which molecules form memories”, and the book’s title references a Zen ‘koan’ or riddle: “If two hands come together and make a sound, what is the sound of one hand clapping?” From a Zen perspective, there is only one hand. Duality arises from the idea of observer and observed. By extension, Kukushkin says, “The boundary between human and the rest of the world is not real.” As for the notion that humans are the acme of evolution – perfection – it is deeply flawed. There are many special things – like photosynthesis – that we can’t do. And whatever exceptional qualities we have are a result of the properties and “essences” of nature that developed before us.\nAt the molecular level, life could not have existed without carbon’s unique tendency to form multiple strong bonds with other atoms. In the living world, where would we be without proteins – long chains of amino acids – that do everything but replicate themselves? Even our memories are formed through their action, Kukushkin says.\nOur journey from single-celled organisms can be summed up as the story of natural selection. But what is it? A randomness that chooses long necks for giraffes and hard shells for coconuts? Kukushkin says, “Selection is built into the logic of the universe.” Instead of “God” designing every single living being, here’s nature laying down what will or won’t work under certain conditions.\nAt the cellular level, nature follows rules set billions of years ago. When nutrients are abundant, a protein called mTOR turns on to promote cell growth; when they are depleted, a protein called AMPK turns off cell growth. This is true across the board from fungi to humans. There’s another protein called MAPK that yeast uses to adapt to a salty environment, and humans to form memories. \nAnd talking of memories, our minds are so complex, we can get lost in our own maze. We are prone to subjectivity, bias, and confusion between reality and imagination. “Our brains…are not even trying to determine what the world really is,” Kukushkin says. Rather, they are always trying to “align reality with expectation”. Remember “The Dress” from 2015? Some saw it as blue-and-black, and others as white-and-gold, depending on whether they thought it was shot in natural light or artificial light. And now our biases and  expectations are colouring AI, not because we want them to, but because of the properties of carbon, amino acids, etc that have shaped us. We are, after all, the sound of one hand clapping. \n\n",
        "headline_1": "What’s Bread Got To Do With Memories?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/whats-bread-got-to-do-with-memories/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-09-2025"
    },
    {
        "full_article": "Courts are now best guardians of free speech\nLondon used to be world’s free speech capital. Speakers’ Corner in Hyde Park was open to all. Even “Indian nationalists…Communists, Trotskyists,” in Orwell’s words. Not anymore. Author Sally Rooney skipped an award ceremony this week because she’s “potentially facing arrest” for supporting the activist group Palestine Action. On the political right, Irish anti-transgender activist Graham Linehan was arrested for three X posts as soon as he returned from US early this month. It seems Britain is playing nanny to keep the peace. Free speech is in trouble in US too. TV host Jimmy Kimmel just had his show cancelled for riling MAGA.\nSo, the fact that in India, three HCs have greenlit Jolly LLB 3 – a courtroom drama deemed disparaging by some lawyers – over the past two weeks, feels like a mini triumph in this atmosphere. In fact, Bombay HC’s remark to the petitioners – “Don’t worry about us” – should be a cue for the lower rungs of judiciary that are less accommodating of free speech. All said, it’s a fundamental right of every Indian, even if tempered by “reasonable restrictions”.\nUS does not have such a caveat, yet executive overreach is showing the limits of its First Amendment. Trump has already sued NYT, WSJ and Penguin Random House on vague charges. He’s also weaponised Federal Communications Commission to bear pressure on media. In an increasingly polarised world, govts often throw their weight behind partisan voices and narratives while reacting sharply to the rest. It then falls to courts to restore balance by taking a stand for freedom of expression.\nIndia’s Supreme Court has a good record in this respect. More than once this year – Imran Pratapgarhi and Ranveer Allahbadia cases come to mind immediately – it has protected free speech. In a defamation case early this month, it advised politicians to have a thick skin. Which is exactly what Trump and MAGA, and everyone else out to silence unpalatable views, need to hear.\n\n",
        "headline_1": "Jolly Good",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/jolly-good/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-09-2025"
    },
    {
        "full_article": "Why are crowds in India so often unruly?\nIt’s hardly surprising that India loves crowds. With 1.4bn people – a significant number of whom live cheek by jowl – crowds are an everyday part of life. But sometimes the way they behave is strange, like how easily they degenerate into melees. Yesterday’s launch of iPhone 17 sales saw crowds breaking into fisticuffs at locations like Mumbai. This, even though the phones could have been bought online and delivered within 10 minutes.\nTo be fair, boorish crowd behaviour isn’t unique to India. Think of England and continental Europe’s football hooliganism. Crowds indeed take on a life of their own in certain social situations, from sports and entertainment to religion and politics, with individuals gathered in large numbers losing all sense of order. According to some social scientists and psychologists, this is because in a crowd our behaviours shift in their sense of responsibility. People either feel empowered to behave in a way they normally wouldn’t, or are pressured into behaving like others. So, if some want their iPhone 17 first, there will be others who will question why they shouldn’t beat them to it, quite literally.\nOf course, all of this is also learned behaviour. The Japanese were able to maintain perfect calm and queue up even during the 2011 massive earthquake and tsunami. But Indians seem naturally drawn to crushes. They know how to queue, but never in a straight line.\n\n",
        "headline_1": "Crushing Question",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/crushing-question/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-09-2025"
    },
    {
        "full_article": "It was the best of times, it was the worst of times – Dickens encapsulated the vibes of the Industrial Revolution better than anyone else. A somewhat similar vibe is resonating across India’s geo-economic landscape today. Trump and his advisers dominate the airwaves, but scratch the surface and the picture is maddeningly more complex than Trump’s “dead economy” outrage.\nRead full story on TOI+\n\n",
        "headline_1": "What the Indian government needs to do to counter effect of US tariffs",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/what-the-indian-government-needs-to-do-to-counter-effect-of-us-tariffs/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 20, 2025 00:00:00  \nThe high temperatures people have been experiencing in recent years have left harmful impacts on their health as well as work efficiency. Global temperature has been rising relentlessly due to burning of fossil fuels and destroying environmental balance through clearing of forests and filling up of wetlands in the name of so-called development. Deliberate and callous human actions are primarily responsive for the climate change. For Bangladesh, it has already passed through the tipping point so much so that, according to a recently released World Bank (WB) report, the country now ranks second in exposure to elevated temperatures. Notably, the WB report is based on the analysis of national temperature and humidity trends between 1976 and 2023. Also, the global development funder used findings from a survey of 16,000 people to arrive at its findings. \nIn this context, the capital city of Dhaka has been identified as a global hotspot for urban heat. But what does that mean when it comes to the day-to-day lives of the people exposed to such extreme heat? Again going by the same WB report, since 1980, the maximum temperature in Bangladesh has risen by 1.1 degrees Celsius. But subject to factors like humidity, air temperature, wind speed, etc., the actual feeling of heat, or what is called, 'feels-like-temperature' that people actually experience is as high as 4.5 degrees Celsius. So, when added to the outside air temperatures which often crosses 37 degrees Celsius, its impact on working age population through productivity loss is immense. The report further says that in 2024 alone, Bangladesh lost 250 million workdays to extreme temperatures, which resulted in economic losses that is projected to be between US$1.33 billion and US$1.78 billion. The amount is between 0.3 per cent and 0.4 per cent of the GDP of Bangladesh. At this rate, by 2030, Bangladesh stands to lose 4.9 per of its GDP due to loss of productivity, thanks to extreme temperatures. The loss to economy can be assessed through various yardsticks. But loss to physical and mental health due to illness like diarrhoea, persistent cough, other respiratory diseases plus exhaustion, heatstroke, depression and anxiety etc., is, in a word, immeasurable. It has been found that in summer, cases of diarrhoea and persistent cough double compared to winter. Similarly, depression and anxiety that increase with heat are more prevalent during summer.\nMoreover, women have been found to be more vulnerable to heat-induced conditions like exhaustion and heatstroke. Like different genders, temperatures affect older men more than younger ones. For instance, depression increases with age, while anxiety peaks at around 50 to 60 age group. So, in summertime, more human productivity is lost than in winter. Understandably, the loss to human capital under such extreme conditions is important from economic considerations. \nThe situation calls for taking urgent measures so that people, their livelihoods and the economy could be protected against the rising heat risks. In that case, preparedness against the extreme heat has to be enhanced. In fact, the extremely high temperatures which may see further rise in the coming years have to be accepted as a fact of life and commensurate innovative measures have to be devised to deal with those conditions. National preparedness should involve a multisectoral approach to deal with heatwaves and equipping healthcare system so that it can address and cope with heat-related diseases. As part of measures to prevent as well as adapt to the rising temperature, green spaces must be created in a city like Dhaka, which has already been experiencing significant urban heat island (UHI) effect due to dense built-up surfaces, high population density and loss of green and water spaces.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Dealing with problem of extreme temperature",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/dealing-with-problem-of-extreme-temperature-1758290277",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       September 20, 2025 00:00:00  \nOne of the fundamental strengths of a country's democracy is the trust its people have in their courts. For democracy to function, citizens must believe that the judges who interpret the law and deliver judgments on disputes are free from pressure by the government or any other influence. This faith forms the bedrock upon which the pillars of rights, liberties and the rule of law are built. Chief Justice Dr. Syed Refaat Ahmed has recently reminded us of this basic truth. In a speech he said if the judiciary is not independent, no reform can hold its ground. This is a powerful idea that deserves our full attention. How many grand buildings a country has or how powerful its leaders are is no metric to determine the strength of a democracy, but the independence of judiciary is.\nAcross the globe, the autonomy of judicial administration, including the appointment, transfer, and promotion of judges, is seen as essential to a free judiciary. This extends not only to apex courts but also to the administrative mechanisms that govern subordinate courts as well. In Bangladesh, however, this autonomy is undermined by the absence of a fully functional secretariat for subordinate courts under the Supreme Court. Evidently, this gap is not the result of scarce resources but rather a deliberate preservation of executive dominance. Over the years, successive governments have quietly retained control by centralising administrative power in the Law Ministry, even though constitutional safeguards that vest those powers with the judiciary remain only on paper.\nHowever, a major step towards redressing these problems was taken on September 2, 2025. On that day, the High Court gave a landmark ruling ordering the creation of a separate administrative body, or secretariat, for the lower courts, to be run by the Supreme Court itself. It also restored the original wording of Article 116, which stated that \"the control and discipline of persons employed in the judicial service and magistrates exercising judicial functions shall vest in the Supreme Court\". This move takes away the government's long-held power to appoint, transfer, promote and discipline lower court judges, and gives it back to the Supreme Court, where it was meant to be from the start. It is a major breakthrough, a chance to finally remove decades of harmful executive control over the judiciary. To understand the magnitude of this decision, one must face the difficult history of how such control was imposed and protected. The 1972 Constitution, born from a liberation struggle, was wise to this peril. It explicitly placed the administration of subordinate courts under the Supreme Court, a direct lesson learnt from the painful experience of the Pakistan era when executive-controlled magistracies were used to harass political opponents.\nThat is why this verdict of creating separate administrative body is the culmination of decades-long efforts rooted in our constitutional history. The original 1972 Constitution vested authority over subordinate courts in the Supreme Court via Article 116. But the Fourth Amendment in 1975, a product of its authoritarian time, brazenly transferred this power to the President, effectively handing the reins of the judiciary to the executive branch, where they have remained lodged in the Law Ministry for fifty years. The government only had to pretend to consult the Supreme Court, while really holding all the power. Later amendments, including the Fifth and Fifteenth, spoke of consultation but in reality kept the system where the Prime Minister's office, through the ministry, had the final say. It is not hard to see how this could be a problem. If a government official can decide whether a judge gets a promotion or is moved to a remote district, that judge might feel pressured to rule in a way that pleases the government. This undermines the very idea of fair justice. In 1999, in the Masdar Hossain case, the highest court saw this danger and ordered the government to fix it. They gave twelve directions, including setting up a separate secretariat. But for over two decades, successive governments simply ignored these orders. They liked having this power too much to let it go.\nThe new High Court ruling tries to break this long-standing cycle. It declares that the changes which gave the government this power were against the constitution's basic principles. By declaring the alterations to Article 116 unconstitutional and striking down the 2017 Disciplinary Rules which further entrenched executive influence, the court has done more than just interpret the law. It has reaffirmed a constitutional morality that places the judiciary beyond the grasping reach of the government of the day.\nSo, what would this separate secretariat actually do? Think of it as the judiciary's own human resources and management department. Right now, all those decisions are made by government employees in the Law Ministry. A new secretariat, run by the judiciary for the judiciary, would hopefully hire staff, manage budgets, and handle the promotions and transfers of judges based on merit, not political connections. This would create a vital buffer. It would allow judges to focus on the evidence and the law, without worrying that a ruling against a powerful person might damage their career.\nThere are, of course, challenges. The government could appeal the ruling, delaying it for years. Following the appeal, a review can also be sought. There may be a lack of political will to finally give up this control. Even if the secretariat is created, it must be done right, with clear rules to ensure appointments are based on merit.\nThe High Court has handed the nation a key. It is a chance to finally fulfil the promise of justice that was made when this country was founded. It is a chance to ensure that in every courtroom, the only thing that matters is the law. The government must now show that it believes in democracy and the rule of law by accepting this ruling without delay. The people deserve a justice system they can believe in.\nshowaib434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The long road to judicial independence",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-long-road-to-judicial-independence-1758290311",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       September 20, 2025 00:00:00  \nA few months back, the result of a decade-long survey in India revealed that 55 per cent of Indians regularly use harsh, abusive or cuss words, with Delhi emerging as the most abusive state at 80 per cent. The nationwide 'Gali Index' (or index of scolding) showed that over half the country uses abusive language casually. The survey, conducted between 2014 and 2025 by the 'Gaali Band Ghar' campaign, found that verbal abuse, particularly against women, is a normal thing in most of the households of the country. \nThe survey's findings are not just interesting, but also deeply disturbing. They reveal a pervasive verbal aggression that challenges the perceived progress of Indian society. The fact that both men and women freely use abusive language is not a casual habit, but a pressing social problem that demands immediate attention from all quarters.\nThough no similar survey has been conducted in Bangladesh by any national organisation, it is highly likely that the situation here is not anyway better than in India. From house to street, the use of abusive words by a sizeable number of people is a common thing in the country now. Most of them use slang, curse words, disrespectful terms and hateful jargon along with rude attitudes and abhorrent behaviours, often casually. Apparently, they find nothing wrong in it. In other words, the use of abusive language or swearing becomes a normal thing for many and it becomes difficult to counter them by logic.\nThe question that arises is what fuels this surge of abusive language, which is vitiating our society. The use of abusive terms or hateful words in everyday conversations is often a reflection of various underlying intentions. People resort to such language to vent their frustrations, air their grievances, express their disappointments, and assert dominance. In some cases, abusive words are exchanged in a friendly manner or among friends and comrades. However, the societal impact of this verbal aggression cannot be overlooked. \nDaily stress, bad traffic, and a fast-paced life in Dhaka often lead to disappointment and anger, prompting many to resort to using curse words. The class difference is also critical in this connection, and the use of rough language is widespread among the so-called lower-class individuals, such as rickshaw and van pullers, bus drivers, beggars, and street vendors. In many cases, they go for cuss words targeting those who are better off. For instance, rickshaw and van pullers regularly use abusive language against private car drivers and passengers as a means to express their anger for being deprived of such comfort and luxury. \nThere is, however, no doubt that the terrible traffic in Dhaka is good enough to fuel anger and frustration among the millions of daily commuters. Being helpless, they apply abusive words to vent their disappointment and, in many cases, against those who are comparatively weak. In some cases, the use of bad words leads to physical abuse and violent acts. The entire issue is linked to a culture of bad governance and mismanagement in the country. \nAgain, several educated and cultured people are not immune to using profanity or rebuking others with harsh words, especially when they face obstacles. Instead of being patient or trying to resolve the issue amicably, they become rude, thus making the situation worse. \nSome psychologists argue that using abusive language is not always bad, as 'swearing is an emotion-based coping mechanism that makes people feel more resilient.' They also add that swearing helps alleviate pain and makes one stronger; that 'abusive profanity replaces physical violence.' The positive aspects of using abusive language, however, do not justify its encouragement. \nOverall, the use of abusive language is a complex interplay of social dynamics, as identified by researchers. This underscores the urgent need for counselling to help individuals manage their emotions effectively. As chronic use of abusive language scars both the abusers and the abused psychologically, it is necessary to address the underlying emotional triggers. \nFinally, the use of abusive language is linked to broader socio-economic conditions. This highlights the crucial role of social reforms in addressing the issue. Without addressing the conditions or fixing the prolonged flaws, it will be difficult to contain the spread of vulgar language.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Chronic use of abusive language",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/chronic-use-of-abusive-language-1758290340",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 20, 2025 00:00:00  \n\nThe recent IMF report and its emphasis on \"data-driven adaptability\" for achieving global growth should serve as a wake-up call. As global supply chains, trade tensions, and climate disruptions are increasingly quantified in terabytes-often long before their real-world impacts are fully felt-it is concerning how many business school graduates still view data competence as desirable but non-essential.\nThe demand is clear: LinkedIn has reported a 40 per cent increase in positions requiring data literacy, and McKinsey states that data-driven companies are 23 times more likely to successfully attract customers. In international business, data are not filler content-those are a key determinant of market leadership.\nCertainly, soft skills such as cross-cultural negotiation and relationship-building remain essential. However, intuition alone is no longer sufficient; it must be backed up by data-driven evidence. Leaders who ignore data risk falling behind.\nTo prepare tomorrow's leaders, data literacy must be embedded in global professional education. The ability to read and interpret analytics should become as second nature as negotiating a business deal. The most successful future leaders will be those who apply data as effectively as they build strategic alliances.\nSafiqul Haque Eifty\nDepartment of International Business and Marketing\nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Business will depend on data literacy",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/business-will-depend-on-data-literacy-1758290367",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-09-2025"
    }
]