[
    {
        "full_article": "After violent protests that left 74 dead, Nepal’s elected government has fallen, with its Parliament dissolved and former jurist Sushila Karkileading an interim government until the 2026 elections. While the Gen Z protesters had legitimate grievances including poor governance, entrenched corruption and intolerance of critical views, seen in the ousted CPN-UML-led government’s banning of 23 social media websites — the transition itself was blatantly unconstitutional, violating Article 76 of Nepal’s 2015 Constitution which permits dissolution only after failed Prime Minister appointments. Yet, considering the exigent circumstances, there is little purchase for judicial review of the steps taken last week. Notably, the President did not dissolve the upper house, the National Assembly. More troubling were the protesters’ egregious actions which included burning Parliament and the Supreme Court (destroying vital documents). Nepal is expected to suffer severe economic losses besides governance issues due to the destruction of property and documents. The targeting of democratic institutions suggests an assault on Nepal’s post-Constitutional order — institutions established after the painstaking constitution-writing process that followed the much-needed ending of a decade-long civil war in 2006, overcoming an anachronistic and discredited monarchy and which included marginalised sections beyond Kathmandu valley’s power structures — even if there was half-hearted or ineffective implementation of the Constitution’s spirit and letter.The interim government must bring the criminals to justice as any inaction will lead to a normalisation of violence threatening all institutions that were set up to fulfil the promises of deeper democratisation and Nepal’s transformation into a republic. Even if Gen Z protesters claim that impostors carried out the violence, their continued reliance on online forums, such as Discord, for decision-making reveals immaturity and an unrepresentative nature. The reliance on online forums, which feature anonymity, frivolity and impersonation, and the fact that there is no guarantee that these views are representative of the many marginalised groups suggest that giving into the demands from these unaccountable groups uncritically could be hazardous. The failures of mainstream leaders — the K.P. Sharma Oli-Sher Bahadur Deuba-Pushpa Kamal Dahal troika and their coteries — cannot justify discrediting democracy or the polity itself, as some protesters have made it out to be, echoing anti-social and destructive pro-monarchic elements. One outcome is that the entrenched leadership of mainstream parties could be compelled by party members to give way to fresh blood. Meanwhile, the interim government must protect Nepal’s institutions and constitutional achievements while building the stage for free and fair elections — this is the surest path to safeguarding the promise of a democratic, plural and republican “Naya Nepal”.\r Published - September 19, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Nepal\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        corruption & bribery\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        crime, law and justice\n                    \n                            /                      \n                        \n                        political parties",
        "headline_1": "Troubled transition: On the Nepal protests and after",
        "headline_2": "Interim government in Nepal must resist illegitimate demands",
        "link": "https://www.thehindu.com/opinion/editorial/troubled-transition-on-the-nepal-protests-and-after/article70065930.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-09-2025"
    },
    {
        "full_article": "The Supreme Court of India has broached the possibility of prosecuting farmers, caught setting fire to their fields, to prepare for winter sowing or rabi crop. ‘Stubble burning’ is a major contributor to air pollution in Delhi, Uttar Pradesh, Punjab and Haryana, particularly in October and November, when the southwest monsoon has receded and adverse meteorological conditions trap toxic particulate matter emissions from vehicles, industry, garbage burning and agricultural waste. While the causes and the ways to reduce particulate matter pollution from agriculture are known, the efforts by the Centre to tackle the long-standing problem have been half-hearted. The creation of the Commission for Air Quality Management (CAQM), a central body with the power to reach out across the borders of Punjab, Haryana, Delhi, Uttar Pradesh and Rajasthan, was a positive step and an acknowledgement that air pollution in one State cannot be tackled without the cooperation of others. However, the four-year-old statutory body has failed to exercise its powers in a manner that is independent of political pressure. Take the example of its recent order to ban the sale of petrol and diesel in the National Capital Region to ‘end-of-life’ vehicles, from July 1. A public outcry in Delhi and its political leaders — largely on technical grounds — and the Court’s intervention, forced its implementation to November this year, that too beginning with parts of the NCR that are not a part of the Delhi municipalities. In stubble burning too, the CAQM has not been able to impress upon the judiciary that stubble burning was due to recalcitrant farmers, limited enforcement by Punjab and Haryana and the structure of agricultural economics that left the average, debt-ridden farmer with little choice. In recent years, it has emerged that Punjab has been claiming a reduction in farm fires when it was in fact increasing. The CAQM chose not to disclose this.In the absence of a transparent mechanism to evaluate and address an issue and being cowed down by imagined political repercussions, it is not surprising that suggestions such as to “jail farmers” to act as a deterrent to others are being bandied about. While no section of citizens — farmer or industrialist — can be considered to be above the law, creating better incentives, enforcing existing laws and being transparent about what is realistically achievable are more advisable steps than ‘carrot and stick’ approaches.\r Published - September 19, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        air pollution\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        Uttar Pradesh\n                    \n                            /                      \n                        \n                        Punjab\n                    \n                            /                      \n                        \n                        Haryana\n                    \n                            /                      \n                        \n                        Rajasthan\n                    \n                            /                      \n                        \n                        petrol\n                    \n                            /                      \n                        \n                        diesel fuel\n                    \n                            /                      \n                        \n                        local authority\n                    \n                            /                      \n                        \n                        politics",
        "headline_1": "Holistic approach: On dealing with North India’s stubble burning",
        "headline_2": "India needs a multi-pronged strategy to deal with stubble burning",
        "link": "https://www.thehindu.com/opinion/editorial/holistic-approach-on-dealing-with-north-indias-stubble-burning/article70065958.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-09-2025"
    },
    {
        "full_article": "A naive and sentimental lover’s lament for a lost ill-starred romance \nFor more than 20 years Kathmandu was our favourite getaway.\nOur Kathmandu connection began in 1970 when Bunny and I first visited it, largely thanks to the ardent advocacy of Desmond Doig, editor of JS magazine, and my boss, who was an unofficial ambassador-at-large for the Himalayan kingdom and its capital. \nAnd we fell in love with Kathmandu. We fell in love with the glowing warmth of Nepali hospitality and the beaming smiles of the people. We fell in love with the city’s teeming, winding, alleyways dotted with ancient Hindu and Buddhist shrines, and full of unexpected twists and turns, like a magical tale in a storybook. \nWe fell in love with its cosmopolitan comingling of ageless East and wanderlust West, of long-haired hippies haunting Freak Street and yellow-robed lamas chanting Om Mani Padme Hum under fluttering prayer flags.\nWe loved the cavernous Kashtmandap temple said to have been built in the 12th century from the wood of a single tree, and from which Kathmandu is said to have derived its name. \nWe loved its Thamel district, crammed with second-hand bookshops and cafes like Vishnu’s Chai And Pie Palace and Mike’s All-Day Breakfast. We fell in love with its surrounding frieze of the eternal snows of the Himalaya. \nWe formed close friendships with Kathmandu people. Like Brian, who took us river rafting on the Trishuli river to his tented camp called Brigand’s Bend, and Caroline, whose restaurant served the best Quiche Lorraine we’d ever tasted. \nLike all love affairs, ours with Kathmandu had its heartbreaks. The palace massacre of 2001, the great earthquake of 2015, which left the country devastated. \nThe recent political earthquake that struck Nepal, changing it perhaps beyond recognition, has brought home to me a sense of complicity, a betrayal on my part. \nI’d seen Kathmandu as a Never-Never Land of escapist romance, blinding myself, wilfully, to the reality of the volcanic anger seething within at the corruption and callousness of the ruling elite which erupted with fiery intensity. \nAs Kathmandu smoulders in the embers of revolt, smoke gets in my eyes.\n\n",
        "headline_1": "Kathmandu, mon amour",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/kathmandu-mon-amour/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-09-2025"
    },
    {
        "full_article": "New defence pact seems insurance for Riyadh against Tel Aviv. India shouldn’t worry\nSaudi Arabia and Pakistan signing a strategic mutual defence agreement has got regional players, including India, taking note. The agreement states that any aggression against either country will be treated as aggression against both. Coming on the heels of Israel’s attack on Qatar and the subsequent Arab-Islamic summit hosted by Doha, the Saudi-Pak pact is being viewed by many as Riyadh’s insurance policy. After all, Gulf Arab states have long relied on US for security, hosting multiple American bases and military personnel. But as Qatar found out last week, that wasn’t enough to deter a strike from Israel against Hamas negotiators meeting in Doha.  \nHence the enhanced Riyadh-Islamabad security cooperation. The two sides anyway long had military-to-military training and exercises. But the two big questions are will Riyadh now fall under Islamabad’s nuclear umbrella, and will the Saudis directly come to Pakistan’s military aid should the latter have another conflict with India. On both counts the answers are probably no. First, the pact doesn’t seem to specify nuclear assistance to Riyadh. Second, India-Saudi strategic relations have grown tremendously over the last few years with Modi visiting Riyadh for the third time in a decade this April. Given this dynamic, it’s unlikely that the Saudis will jeopardise their relations with New Delhi for Islamabad’s sake.  \nAt maximum, the deal is a backstop for both Riyadh and Islamabad. But what’s interesting to note is the latter’s supple diplomacy since the conflict with New Delhi this summer. Pakistan has managed to get into Trump’s good books. China is an all-weather ally. Türkiye aided it during India’s Op Sindoor. And now the pact with the Saudis. But even though this does show that Pakistan isn’t diplomatically isolated, it doesn’t solve its fundamental economic and governance problems. Pakistan is still seen as a basket case, albeit with nuclear arms. Diplomacy, however, will see countries pursue their own interests. India should do the same and focus on its own strengths. \n\n",
        "headline_1": "Saudi-Pak Sunni Axis?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/saudi-pak-sunni-axis/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-09-2025"
    },
    {
        "full_article": "UK royally flattered Trump. Democracies should find virtue in simplicity \nOn Wednesday, while BBC aired Brazil prez Lula’s view that Trump isn’t “emperor of the world”, the British establishment tried hard to convince him otherwise. Charles and Camilla showed him around Windsor Castle, gave him a horse-carriage ride, and fed him at a state banquet in St George’s Hall. That’s part of playing “royal” in the 21st century, whether you are raja of an erstwhile Indian state, making a living off a hilltop castle-turned-hotel, or the Windsors, maintained at the expense of the British public. Royalty – gun salutes and bearskin hats – is little more than theme park entertainment now. And the customer – Trump, in this case – must be satisfied. By the look of it, Trump was pleased as punch with his royal treatment, and a day of pageantry helped UK net $204bn worth of US investment promises. Mind you, they are only promises.\nFor UK, which was already a distant second economically – with less than a third of US GDP – by the time of the first US presidential visit in 1918, royal charm offensives, such as the one unleashed on Trump, are a necessity. Without colonies, it’s just a small, ageing island state. It’s already slipped to sixth place in terms of nominal GDP, behind India, and the economy has remained lacklustre since Brexit. So, good for it that Trump and many other world leaders still hanker for the trappings of royalty. But considering that WWII and the age of empires ended 80 years ago, simplicity should have become the reigning virtue by now. \nBut you have to be cut from a different cloth to resist the lure of royal validation. It’s hard, but not impossible, as Gandhi showed by striding into Buckingham Palace in his loincloth and shawl in 1931, leaving Churchill snarling: “half-naked fakir”. Centuries before him, Marcus Aurelius, himself an emperor, had warned against outward pomp and appearance. A state that holds pomp and show dear, although democratic in principle, reveals its admiration for autocratic tendencies. The king must be bigger than his subjects. If they walk, he must ride a horse, and if they are saddled, he must procure an elephant. That’s the principle of one above all. But in a democracy, the leader is one among equals, and adopting the ceremonials of a bygone age risks contaminating new ideals. Gandhi was ahead of his time, but 80 years is long enough for the rest to catch up with him.  \n\n",
        "headline_1": "Don’t pomp up",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/dont-pomp-up/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-09-2025"
    },
    {
        "full_article": "SC gives deadline for appallingly delayed Maha-wide local polls. But polls are overdue in 61% of urban bodies \nMaharashtra state election commission got its deserts from Supreme Court on Tuesday. “Inaction and incompetence” is a fitting description of its record over the past five years when elections to 27 of 29 municipal corporations became overdue. Terms of five corporations ended in 2020, of 18 others in 2022, and the rest in 2023. Mumbai, India’s financial capital, has gone 42 months without an elected local body, when rules allow a maximum gap of six months. Local self-govt remains suspended in thousands of municipal councils, zilla parishads and village panchayats also. This gross neglect is impossible to condone, especially after the poll body made light of SC’s Sept deadline to clear the backlog. Now, it’s got four more months, and a warning of “no further extension”. \nOne can hope, therefore, that Mumbai, Pune, Nashik, etc, will have elected corporations by Feb next year, but the larger, pan-India, problem remains unaddressed. Data shows elections to 61% of urban local bodies across 17 states are overdue. Tech capital Bengaluru last held municipal polls in 2015. And across India, civic polls are delayed by 22 months, on average. This undermines the whole idea of self-governance. Our cities and towns are a mess – as the monsoon just reminded us for the umpteenth time – because people don’t have a say in civic matters. State govts can run cities through administrators, but it takes councillors and corporators to bring people’s concerns into town halls.\nEven otherwise, India’s urban local bodies are weak by design. Many functions that should be under them are delegated to other state govt bodies. The biggest weakness is financial, though. On average, municipal corporations fund less than 30% of their expenditure from their own revenues. World Bank estimates Indian cities will need $55bn per year, for the next 20 years, to build infra, but all they can rustle up is $18bn. That shows up when roads and houses get flooded because drainage has not been expanded for decades. SC’s order will get the poll process rolling in one state, but the big fix for local self-govt – and people’s living conditions – has to come from the states.\n\n",
        "headline_1": "Mumbai & elsewhere",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/mumbai-elsewhere/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-09-2025"
    },
    {
        "full_article": "Having seen over the decades how those in charge have botched the list of Bangladesh's freedom fighters, leading to the frequent inclusion of \"fake\" beneficiaries and exclusion of genuine candidates, it shouldn't come as a surprise that a similar botchwork is in play with the listing of July uprising martyrs. Yet, it does. The preparation of such a high-impact list under a political government may lend itself to politicisation and exploitation, but a non-political administration should, ideally, be able to handle it more efficiently. Sadly, nothing has been ideal about it so far, as per an an investigative report by Prothom Alo.\n\nThe report reveals that of the 834 individuals currently listed as martyrs, at least 52 do not meet the legal definition of a July martyr. The July Uprising Martyr Families and July Warriors Welfare and Rehabilitation Ordinance, 2025 clearly states that only those killed by state security forces or ruling party affiliates during the uprising would qualify as a martyr. But the current list includes 35 people who died in arson-related fires, three in road accidents, two from illness, one from electrocution, and several killed in personal disputes or clashes unrelated to the uprising. Even three policemen, a Chhatra League leader, and one who was involved in July attacks on protesters have been added to the roll of honour.\n\nOf the 834 individuals currently listed as martyrs, at least 52 reportedly do not meet the legal definition of a July martyr. The July Uprising Martyr Families and July Warriors Welfare and Rehabilitation Ordinance, 2025 clearly states that only those killed by state security forces or ruling party affiliates during the uprising would qualify as a martyr. But the current list includes 35 people who died in arson-related fires, three in road accidents, two from illness, one from electrocution, and several killed in personal disputes or clashes unrelated to the uprising. Even three policemen, a Chhatra League leader, and one who was involved in July attacks on protesters have been added to the roll of honour.\nThe absurdity of this situation becomes further evident when you consider that five of the names belong to individuals who died in incidents occuring after the Awami League government's fall on August 5. Many of the families Prothom Alo spoke with admitted that their relatives did not die from injuries caused by atrocities during the uprising, but they received benefits anyway. Some even confessed that they enlisted their names to access government compensation. As we know, each listed martyr's family is entitled to a lump sum of Tk 30 lakh, including through savings certificates. There is also a monthly stipend of Tk 20,000, and the prospect of getting flats in Dhaka. The allure of these provisions has clearly created avenues for abuse and deception.\n\nNeedless to say, this undermines the credibility of the entire exercise, stripping a solemn state recognition of its sanctity. The question is, how could such glaring discrepancies slip through the vetting process by the Ministry of Liberation War Affairs, particularly the Directorate of July Mass Uprising? This cannot be a simple clerical mistake; it points to the complicity of corrupt officials and the manoeuvring of opportunists. Apparently, the government has instructed deputy commissioners (DCs) to re-verify the list, but such reactive measures cannot undo the damage already caused, nor do they absolve those responsible for trivialising the sacrifices of the true martyrs.\nWe urge the government to immediately suspend all benefits to disputed names until proper verification is completed. Independent committees must be formed to ensure thorough re-vetting, and the updated list must be published with case details to restore public confidence. The July uprising is a watershed event in our history, and to taint its legacy with a manipulated list would be a betrayal to those who truly fell for freedom.\n",
        "headline_1": "How did so many fake names enter the July martyrs’ list?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/how-did-so-many-fake-names-enter-the-july-martyrs-list-3986971",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 19, 2025 00:00:00  \nIn what is being hailed as a landmark intervention in the country's banking sector, the interim government has launched formal procedures to merge five financially distressed Islamic banks into the country's largest state-owned Shariah-based banking institution. As part of the arrangement, administrative teams will be deployed to manage the five banks. While their boards of directors will technically remain in place, their powers and functions will be suspended. The banks slated for merger are the First Security Islami Bank, Union Bank, Global Islami Bank, Social Islami Bank, and Exim Bank. To support the transition, the government has pledged Tk 200 billion in fresh capital, though the Bangladesh Bank estimates the total requirement at Tk 352 billion. The remaining shortfall is expected be mobilised through assistance from development partners.\nThe merger marks the most ambitious restructuring effort in Bangladesh's banking history. Officials have described the step as essential to avoid a costly liquidation process and to restore market confidence in Shariah-compliant finance, which commands a large and growing customer base. At the same time, the move exposes the gravity of the crisis afflicting privately run Islamic banks, many of which became deeply entangled with politically connected business groups accused of siphoning off funds. Since the change of government in August 2024, the Bangladesh Bank dissolved the boards of these banks and replaced them with new ones. Forensic audits revealed staggering levels of mismanagement, with non-performing loan ratios surpassing 90 per cent in three of the institutions. Against such a backdrop, consolidation is being viewed as the only viable path.\nThe banks had earlier submitted restructuring blueprints of their own, but those were dismissed by regulators as unrealistic. Four of the lenders-First Security Islami, Union, Global Islami, and Social Islami-were closely controlled by the Chattogram-based S Alam Group, which allegedly borrowed aggressively from them and diverted funds through shell companies. The Exim Bank, meanwhile, was long dominated by the former chairman of the Bangladesh Association of Banks. The broader context is equally troubling. According to an Asian Development Bank report published last month, Bangladesh now carries the highest ratio of bad loans in Asia, with defaults accounting for 20.2 per cent of total lending in 2024. The stock of distressed assets stood at $20.27 billion, up 28 per cent year-on-year, placing Bangladesh among the countries with the region's \"most fragile banking system.\"\nWhether the consolidation will actually restore stability, however, remains uncertain. Critics argue that the infusion of government funds and the shift to state ownership may not by themselves restore public confidence or instill the operational dynamism required for revival. Experience shows that state-owned banks in Bangladesh have historically underperformed, weighed down by inefficiency, political interference, and weak governance. For now, the hope is that the interim government will proceed cautiously, ensuring that the merged institution is managed with professionalism and transparency. Otherwise, what is intended as a solution could risk creating yet another unwieldy public-sector bank-potentially the country's largest but also the most problematic.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Merger of the  sick banks",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/merger-of-the-sick-banks-1758211742",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       September 19, 2025 00:00:00  \nThat Dhaka City has long become an overturned cauldron in months marked by high temperature is known to its inhabitants. It is because they experience the scorching heat at its merciless sizzling worst. Now the World Bank in its report titled 'The unsustainable life: The impact of heat on health and the economy of Bangladesh' points to a worst case scenario likely to unfold within a short time. By 2030, the global warming poses a risk to unsettle both life and livelihoods. Although the maximum temperature in the country has not risen beyond 1.1 per cent, the 'feels like' temperature soared 4.5 degree Celsius with the consequence of fatigue on the part of the working class in particular leading to undesirable ailments. \nSuch health problems are linked to performances by people engaged in different occupations and the economy in general. The WB reckons that the consequent economic losses could in between $1.33 billion and 1.78 billion representing about0.3 to 0.4 per cent of the country's gross domestic product (GDP). Loss of human productivity is no good news for a country struggling to employ its vast army of the unemployed. \nSadly, Bangladesh with its carbon emission staying far below the threshold is the 7th most vulnerable country in terms of climate change. Here the country can take some measures to offset a number of the adverse impacts of the unpredictable and tumultuous ecology now sparing not even the rich and developed countries in the world. But in the global context, the reversal of global action courtesy of US President Donald Trump certainly leaves hardly any room for improving conditions in poorer and smaller countries all across the planet Earth. \nGiven such conditions, 65 per cent higher rise in the heat index for Dhaka compared with the temperature increase registered for the rest of Bangladesh presents a dismal picture. Yet in this disturbing picture, there lies some solution to the problem. Dhaka has turned into a veritable hellish urban conundrum thanks to rapid depletion of its green space with denudation of 47 per cent of its dense green cover between 1989 and 2020 with the conversion of land into built-up areas from 1999. By this time, its green space had dwindled to just 5,600 hectares from 12,745 hectares.\nIn contrast, Dhaka's total area grew by 19 per cent as against the population growth by nearly 77 per cent. Such an overcrowded city with little green space and many of its mindless use of construction materials for building such as glass walls known for heat trapping has made the situation even worse. Filling up water bodies like ponds, canals and use of water retention areas for housing have significantly contributed to the city's warming up beyond limit. What a pity, the environmental concerns have been undermined by the commercial interests of real estate business. Dhaka City's original Detailed Area Plan (DAP) has undergone changes at least twice in order to accommodate the demands from the real estate business. Even the last one is under pressure for bringing about change to it. \nThe way Dhaka has been maltreated over the decades points to the fact that it may not be a liveable city at some point. True, Dhaka is not the whole country but as the administrative and commercial hubs, its importance cannot be overstated. Yet policy failure and ill planning of the city's space has rendered it messy and inefficient on most of the counts.\nSure enough, decentralisation of administration and important infrastructure such as educational institution and hospitals could remarkably ease the pressure off. Why should patients rush to Dhaka for better healthcare if such facilities could be available at districts and upazilas? Similarly, if village and union schools and colleges offered quality education, there was no need for students to frantically look for admission to a reputed school or college in the capital. Some of the departments under the ministries could also be shifted to suitable locations in districts and even smaller towns. \nIf and when large cities have a reasonably smaller size of population, the heat-trapping mechanism can well be taken care of. One of the suicidal practices is the extraction of underground water which is no longer replenished because of a lack of uncovered grounds on the surface of urban centres. In case of a powerful earthquake, the consequences may be cataclysmic for mega cities like Dhaka. \nBefore the heat domes that give people in the affected areas nightmarish experiences also descend---as they did in Canada and some northern parts of the United States of America (USA)--- on this small geographical entity, even this land can take a lesson from its own past. The entire country can opt for creation of green covers by planting more and more trees. Fruit orchards have been developed significantly. But the highways, district roads and the networks of upazila connecting villages can be used for planting indigenous trees including fruit trees. Brigades of local people can be formed to take care of such trees so that the lion's share of the benefits helps them economically. To offset the 'wet bulb' heat syndrome also, there is no other alternative to developing maximum green spaces all over the country.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Life and livelihoods in Dhaka at risk of collapsing",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/life-and-livelihoods-in-dhaka-at-risk-of-collapsing-1758211775",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       September 19, 2025 00:00:00  \nJuvenile crime was not alien to Bangladesh society. But it has become a major social problem in recent years with the emergence of organised Kishore (teen) gangs that often intimidate residents, extort shopkeepers, trigger violence, and sometimes take lives.\nLaw enforcement agencies have identified over two hundred gangs active in cities, mostly in Dhaka and Chattogram. A 2024 newspaper report, quoting police and researchers, mentioned that the gangs have a total number of members of over 1,300. The political turbulence that emerged last year gave rise to the activities of the gangs. The activities, however, somewhat subsided after joint forces started operating, but still they are emerging in some places.\nThe phenomenon of Kishore gangs is not confined to slum areas or to school dropouts, it reaches into ordinary neighbourhoods, sometimes pulling in students who seem otherwise to have normal lives.\nThe question is why teenagers are attracted to gangs and violent acts. The answer is not simple. There are multiple reasons behind it. Criminologists and social scientists attribute the phenomenon to poverty, social exclusion, broken family structures, the politics of harbouring criminals, the collapse of community oversight and the culture of impunity. Children who face neglect are more likely to seek shelter from such gangs that promise attention, protection, money, or identity. Traditional community oversight once existed strongly in our society, playing a key role in barring anyone from the community from being involved in criminal activities. Such oversight has diminished over time.\nIn Bangladesh society, everyone understands there is a direct link between teen gangs and local power-brokers. Elected local government representatives being accused of protecting or employing gangs to do criminal acts like intimidation, extortion, and murder corroborate the understanding. When young offenders understand that violence wins them patronage from influential people and that power and money come from displays of force rather than achievement, they are likely to choose the short-cut course. There remains hardly any way to stop them in such a situation.\nSocial media also offer incentives for young offenders. Gang members' viral videos flaunting power might encourage others to get involved in such activities. The absence of a well-designed juvenile correction system in Bangladesh also contributes to juvenile crime. The system that now exists here lacks adequate psychological services, education or skills training. Studies show that confinement without meaningful rehabilitation increases the risk of young offenders being involved in crimes again.\nNow the question arises, can the problem of teen criminality in Bangladesh be addressed? It can be but the task is challenging. Policymakers, communities and families need to treat it as a long-term social challenge rather than a short-term law-and-order nuisance and act accordingly. First, all concerned need to give emphasis on community-based prevention through strengthening family support and expanding school counselling. Political parties should adopt a zero-tolerance policy for their leaders who protect offenders while law enforcers should bring those harbouring offenders to book.\nThe juvenile justice system should be overhauled with the focus on rehabilitation. The government should invest in making courts child-friendly and in training officers dealing with the juveniles. Mental-health services for adolescents must be scaled up. Media can play a critical role in solving the problem. Initiatives ought to be taken to celebrate positive youth role models. Schools, religious institutions and youth clubs should join hands in promoting civic values.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why teenagers get involved in crime",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-teenagers-get-involved-in-crime-1758211802",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 19, 2025 00:00:00  \n\nIn various cities of India, some wonderful cafés called \"Garbage Cafés\" have been established. This idea is truly inspiring and remarkable. Those struggling with food insecurity usually come to these cafés, but here no money is needed for food. Instead, old plastic bags, food wrappers, or water bottles are exchanged for breakfast or lunch. These cafés are operated by the municipal corporations. For example, by giving one kilogram of plastic waste, one can get a full meal consisting of rice, lentils, two dishes of vegetables, roti, salad, and pickles. In exchange for half a kilogram of plastic waste, one can get breakfast. \nPlastic waste and hunger are also serious concerns for us. In our country, many destitute people collect different types of plastic waste from various places and exchange them at local scrap shops for a fixed price set by the vendors. As a result, these destitute people often face losses and are even tricked in the process. Moreover, in many cases, small plastic items like bottle caps or pen tips remain in the environment due to the absence of proper guidelines, further contributing to pollution. If such initiatives like \"Garbage Cafés\" could be taken by city corporations in specific areas, then not only would the marginalised and homeless be ensured food security, but people of all classes would also become more conscious about protecting the environment.\nThere are 129 wards under the two Dhaka city corporations-54 in Dhaka North City Corporation and 75 in Dhaka South City Corporation. Initially, the project could be launched in selected wards of the city corporations as a pilot study to assess its strengths, weaknesses, and potential. Once evaluated, it could be expanded nationwide. This initiative would simultaneously tackle hunger and reduce pollution. \nNafew Sajed Joy\nPostgraduate\nUniversity of Dhaka\nnafewsajedjoy@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Garbage Cafés for tackling hunger and waste",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/garbage-cafes-for-tackling-hunger-and-waste-1758211826",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-09-2025"
    }
]