[
    {
        "full_article": "The diplomatic actions against Pakistan taken on Wednesday (April 23, 2025) by India’s Cabinet Committee on Security in reaction to the Pahalgam terror attack are a measured set of responses that indicate a larger escalation could follow. The decisions such as to cancel visas given to Pakistani nationals, suspend consular operations, and to close the Attari border Integrated Check Post (ICP) carry New Delhi’s message that it does not wish to engage with Pakistan above the absolute minimum levels required. Some of these measures had followed previous attacks including Pulwama (2019). The decision to put the Indus Waters Treaty (IWT) in abeyance until Pakistan acts “credibly” against terror groups means that India will enforce its earlier decision to suspend all meetings of the Permanent Commission that oversees implementation of the treaty, end site visits by Pakistani water teams to India and continue with hydropower and desilting projects along the tributaries — measures to which Pakistan had raised objections. Pakistan’s response is an attempt to mirror Indian measures, without even trying to address the anguish in India. Nor does it indicate it is willing to track down the perpetrators, despite the fact that The Resistance Force (TRF), which claimed responsibility for the attack, is a front for the Pakistan-based LeT. Islamabad has also cancelled visas, cut mission strength and has shut down all trade. Pakistan has threatened to suspend other bilateral agreements including the practically defunct 1972 Simla Agreement, which had most notably converted the ceasefire line into the Line of Control and abjured third party mediation on Kashmir. It also suggested that India’s suspension of the IWT would be seen as an “Act of War” if it meant water flows to Pakistan are reduced, and threatened tit for tat strikes if India conducts military operations that harm Pakistani citizens.All signs indicate the stage is being set for further escalation in tensions and a possible military standoff. Prime Minister Narendra Modi’s message from a rally in Bihar is the threat of punishment “beyond imagination”. New Delhi is reaching out to countries around the world, Foreign Secretary Vikram Misri is briefing foreign envoys, while senior Ministers have briefed Opposition leaders on the cross-border links. Given geopolitical currents, revulsion at such targeting of innocent tourists, and a broad understanding of India’s stand on the issue of cross-border terrorism, it is unlikely that other countries such as the U.S. will press New Delhi to restrain its next steps. The government must continue to take all stakeholders, especially the Jammu-Kashmir government into confidence. Pakistan could benefit from reconsidering its disadvantageous position, and even now, show that it is willing to work against terror groups, and avert the impending escalation. Published - April 26, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Pulwama attack 2019\n                    \n                            /                      \n                        \n                        rivers\n                    \n                            /                      \n                        \n                        act of terror\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        USA",
        "headline_1": "​A gathering storm: On India’s diplomatic actions against Pakistan",
        "headline_2": "Pakistan must eliminate the terror groups working on its soil",
        "link": "https://www.thehindu.com/opinion/editorial/a-gathering-storm-on-indias-diplomatic-actions-against-pakistan/article69491676.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-04-2025"
    },
    {
        "full_article": "The U.S. and Iran are currently engaged in rare high-stakes diplomacy. They have held two rounds of talks, in Muscat and in Rome, with Oman as the mediator, about Tehran’s nuclear programme. A third technical round has been confirmed for the coming days. However, tensions still remain high between the Trump administration and the Islamic Republic. It was Donald Trump, during his first term, who sabotaged a functioning multilateral agreement that had significantly curtailed Iran’s nuclear programme. Ever since, Iran has accelerated its nuclear activities. While it has not yet decided to build a nuclear bomb, most assessments agree that it has the capability to do so within weeks. At the same time, Iran’s regional influence stands diminished as a result of Israel’s attacks on its so-called axis of resistance and other regional shifts such as the fall of Syria’s Assad regime. Israel is pressing for an attack on Iran’s nuclear facilities, but Mr. Trump, according to American reports, has vetoed those plans, for now.\rMr. Trump has adopted a classic carrot-and-stick approach. He said he wanted a deal with Iran but with a warning that if talks failed, there would be bombing. He has also launched a massive aerial campaign against Yemen’s Iran-aligned Houthis. In addition, the U.S. has ramped up its military presence in West Asia besides moving B-2 bombers to the Indian Ocean region — all aimed at signalling to Iran that U.S. threats should be taken seriously. But despite the combined military might of the U.S. and Israel, any attack on Iran would be catastrophic for regional security and global economy. Iran’s nuclear facilities are scattered and underground, making them extremely difficult to destroy. It was precisely because there was no viable military solution to the Iran nuclear issue that world powers chose the path of diplomacy in 2015, a path Mr. Trump had abandoned in 2018 for no good reason. Nevertheless, despite the challenges and geopolitical pressure, the recent initiation of talks by Mr. Trump and Iran opens a rare window of opportunity to resolve the issue once and for all. For diplomacy to succeed, the U.S. should act as a responsible global power that is committed to preventing weaponisation of Iran’s nuclear programme, rather than as a partisan patron seeking to destroy Iran on Israel’s behalf. Iran, for its part, has signalled that it was open to scaling back its nuclear activities in exchange for the removal of sanctions and threats. The 2015 agreement, which limited Iran’s enrichment capabilities and uranium stockpile, could serve as a reference point for a deal if talks progress constructively.\r Published - April 26, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Iran\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        nuclear policy\n                    \n                            /                      \n                        \n                        Syria\n                    \n                            /                      \n                        \n                        Israel",
        "headline_1": "​Carrot and stick: On the U.S. and Iran talks",
        "headline_2": "The 2015 accord must be revived to prevent Iran going nuclear",
        "link": "https://www.thehindu.com/opinion/editorial/carrot-and-stick-on-the-us-and-iran-talks/article69490823.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "27-04-2025"
    },
    {
        "full_article": "Only a kinetic response from India will raise the cost of backing terrorism\nA lush meadow in Pahalgam was soaked in innocent blood this week, marking the most painful terrorist blow to India since 2008. As investigators confirmed Pak’s role in the massacre, 22/4 became another grim reminder that its western neighbour remains India’s primary adversary.\n\nStrategic neglect is not an option.\nRead the full story on TOI+.\n\n",
        "headline_1": "Why Pak army must now feel the heat",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/why-pak-army-must-now-feel-the-heat/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-04-2025"
    },
    {
        "full_article": "To function as a nation-state, Pakistan need not inject hate into Islam\nPope Francis will be buried today but his footprint in history will stay forever. In fact, Pakistan’s army chief Pope’s message and delete, delete, delete, his Muslims-are-not-Hindus hate message. Of course, Muslims aren’t Hindus, nor are they Jews, Christians, or Buddhists or, whatever. Shias aren’t Sunnis either. Yet, as Pope Francis reminded us, we are “one” across religions.\n\nIn saying this, Pope fast forwarded the Catholics into the 21st century by holding firm to Jesus’s core message.\nRead the full story on TOI+.\n\n",
        "headline_1": "What Pope could’ve taught Gen Munir",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/what-pope-couldve-taught-gen-munir/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-04-2025"
    },
    {
        "full_article": "By KV Raghupathi\nEven though Basava was an impassioned reformer over 800 years ago, his religious and social thought still has a profound impact on us. He condemned blind beliefs, superstitious rituals, sectarian practices, and dogmatic rigidities that afflicted Indian culture during his lifetime.\nBasavanna’s bhakti philosophy emphasised direct, personal devotion to Shiv, rejecting external rituals and caste distinctions, and promoting a more egalitarian society. He urged Self-cultivation over traditional temple worship.\nThere are a thousand of his vacanas – repository of his spiritual journey’s documented experiences – that act as a living guide for those seeking devotion.\nAs a fervent supporter of bhakti, he established the Sat-Sthala system – each sthala is a stage in spiritual evolution – which consists of samarasa, union of soul with God; bhakti in aikya, devotion in unity;naisthika-bhakti in maheshasthala, steadfast devotion; avadhana bhakti in prasadi, that is ,vigilant, alert and mindful devotion;anubhav bhakti in pranalingi, direct experience of the Supreme; bhakti in sarana, anand, bliss in surrender.\n\nThus, bhakti keeps on evolving and assumes a cosmic depth in his philosophical system facilitating union with the Divine.\nVatsalya, filial devotion; madhurya, spousal love; sakhya, friendship; dasya, service; and shanti, peaceful relationships, are the five modes that are engrained in his bhakti which includes worshipping Linga, symbol; yearning to realise aruhu, Divine Consciousness.\nThe bhakt ascends the six steps with the aid of eight astavarnas – guru; linga; Jangama, living embodiment; prasad; padudaka, water from the feet; vibhuti; rudrakshi; mantra – on the Satsthalapath. The bhakta embraces these ashtavarnas as important representations of inner purity and unbreakable armour for his protection.\nBasavanna’s trividha-dasoha, triple worship, is the epitome of bhakti philosophy, a perfect example of the synthesis of bhakti, jnan, and karm. It begins with dvaita, duality and progresses to the final fulfilment in advaita, nonduality, where worship, worshipper, and the worshipped integrate into one.\nBasava bhakti is not an intellectually spun-out system of thought; nor is it dry as scholastics philosophy. It has a distinct and an admirable feature of the gospel of Divine Love which embraces both thought and action. He strikes a balance between pravrtti, participation in worldly activity, and nivrtti, withdrawal from all activity.\nIt is a perfect balance between outer and inner life.\nA revolutionary saint, Basava remai ned actively engaged with the world, accepting and respecting it. For him, renunciation did not entail giving up life and adopting an ascetic lifestyle. He accepted the world and achieved perfection. For him, this mortal life is holy and worthwhile.\nOne must live here and live well, and at the same time attain spirit which is beyond mortal life. He did not believe in tall stories and hair-splitting speculation and subscribed to the view that woman, gold, and land were the lures of maya. According to him, restraining sense should be effortless; suppression and self-mortification are useless.\nHis Anubhava Mantapa, socioreligious academy, threw open its doors for the poor, marginalised communities, and women allowing them to pursue their spiritual goals.\nHe supported women saints such as Akkamahadevi, Akkanagamma, Neelambike, Gangambike, Lakkamma, Lingamma, and Mahadevamma, who experienced elevated spiritual attainments.\n\n",
        "headline_1": "Basavanna’s bhakti: A vision of love, equality",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/basavannas-bhakti-a-vision-of-love-equality/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-04-2025"
    },
    {
        "full_article": "Student scores, labour productivity dip with rising temp\nBy the end of this century, sea levels will be a foot higher than in 2000. The average person is 31 years old today, and given that global life expectancy is 73.5 years, they may be dead by 2068. So, why should we worry? Didn’t Keynes say, “The long run is a misleading guide to current affairs”?\nBut climate change is affecting us now. It has a bearing on your mood, your income, your children’s grades. University of Pennsylvania economist R Jisung Park drives home these points in his book Slow Burn. Take income first. It’s an acknowledged fact that income inequality is rising. The rich – who live, travel and work in air conditioned spaces – are getting richer, but the poor have stagnated in a hot and sweaty place. A study by University of Chicago economists found that worker productivity in India declined 2-4% for every degree Celsius rise in temperature above the comfortable level. If the “mean temperature” at the workplace crossed 25℃ – which could mean day temperature of 30℃ and night temperature of 20℃ – output fell 32%, or almost a third.\nNow, people who make bricks, weave cloth, etc, get paid per piece of product made, so while they suffer in the heat, their daily earnings drop. That’s not fair, but they can’t stop working because they aren’t qualified for white-collar work. Their children could break out with good education, but as Park shows with data, heat is making this harder.\nWhen researchers correlated 4.5mn exam results of students in New York City schools with the temperature on exam day, they found that student performance fell by 3-4 points on days when temperature exceeded 32.2℃. This is a small penalty for someone who usually scores 95%, but a setback for a child who passes with low marks. Park says “average” students are 10% less likely to pass on a hot day than on a cool day.\nNow, poorer students – children of those poor labourers – typically are at a disadvantage because their homes are crowded, noisy, lack ventilation, and get hot and stuffy. So, passing exams with good marks, and getting into good colleges with scholarships, becomes almost impossible. Heat, indirectly, stalls upward mobility.\nGenerally speaking – leaving out exceptions like Singapore and UAE – “hot” countries have 8% lower per capita income for every 1℃ rise in average temperature, Park says. Even within US, hotter municipalities tend to be poorer. That’s important for us because places like Mumbai will have 100 extra days of mean temperature over 32.2℃ by 2060, relative to the pre-industrial age.\nBeyond income and education, heat makes us more error-prone. Data from 150,000 tennis matches shows players were 7% more likely to double-fault on hotter days. Analysis of 500 helicopter crashes showed a strong correlation between temperature and human error. And a British navy experiment in the 1950s revealed that errors in reading Morse code jumped from 11-12 per hour in the 29.4-32.2℃ temperature range to 95 per hour at 40.5℃. Oh, and people start honking sooner at traffic lights on hotter days, and rates of rape and murder inch up with heat too. A warming planet clearly isn’t a good place for your average Joe, and Jane.\n\n",
        "headline_1": "Hotter planet makes social mobility harder",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/hotter-planet-makes-social-mobility-harder/",
        "news_paper_name": "The Times of India",
        "publish_date": "27-04-2025"
    },
    {
        "full_article": "We are deeply concerned by the escalating tensions between India and Pakistan, as both countries exchanged fire across the Line of Control in disputed Kashmir, following the recent terrorist attack in Kashmir's Pahalgam that resulted in the deaths of 26 tourists. As the Indian government has accused its long-standing adversary, Pakistan, of supporting \"cross-border terrorism,\" relations between the two countries have plunged to their lowest level in years. Denying any involvement, Pakistan called the Indian attempts to link Pakistan to the Pahalgam attack \"frivolous\" and vowed to respond to any Indian action. Both nations have since introduced a series of retaliatory measures against each other. While we strongly condemn this heinous attack in Kashmir—the worst of its kind in a quarter of a century—and expect those responsible to be brought to justice, we also urge both countries to refrain from actions that could escalate the situation.\nReportedly, India has taken some strong measures following the attack. It has formally informed Pakistan of its decision to suspend the Indus Waters Treaty of 1961, closed the main land border crossing, downgraded diplomatic ties, and revoked visas for Pakistanis. Indian Home Minister Amit Shah also urged state chief ministers to ensure that no Pakistani remains in India beyond April 27. In response, Pakistan has closed its airspace to Indian airlines, expelled Indian diplomats and military advisers, cancelled visas for Indian nationals (except Sikh pilgrims), and shut down its side of the main border crossing.\nIt goes without saying that any further escalation will have far-reaching consequences for both nations. And it will be particularly disastrous for the economy of Kashmir, which is heavily dependent on tourism.\nThe UN has emphasised that issues between the two nations should be resolved peacefully through meaningful mutual engagement, a view we strongly support. A proper and thorough investigation is essential to identify and punish those involved in the recent terrorist attacks. However, even before such an investigation is carried out statements from India's water resources minister, pledging that \"not even a drop\" of water would go to Pakistan, and Pakistan's warning that halting the water supply from the Indus River would be an \"act of war,\" are deeply concerning.\nWe hope both these nuclear-armed nations will renounce retaliatory actions and resolve their disputes at the negotiating table. With Pakistan reportedly proposing an international investigation and expressing willingness to cooperate, India should consider such an initiative. Finally, we urge both nations to avoid actions that could destabilise the entire region and instead focus on diplomatic solutions for the greater benefit of both sides.\n",
        "headline_1": "A call for restraint",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/call-restraint-3880701",
        "news_paper_name": "The Daily Star",
        "publish_date": "27-04-2025"
    },
    {
        "full_article": "Development aid as we know might as well be a corpse we are trying to re-animate, without much luck or success. The latest slashing of the overseas aid budget coming from the United States, by shuttering USAID, the primary agency for channelling American foreign aid, is being considered by many an extinction event for the aid sector. To put things into perspective, the US government is the single-largest aid donor in the world, accounting for more than 40 percent of all humanitarian aid in 2024. The fate of USAID may still be decided in a bitter and long-drawn court battle, but it has not stopped the Trump administration from cancelling 90 percent of USAID's existing contracts, all but making the agency's funding commitments utterly irrelevant.\nOther global players in foreign aid—although less callously, but succumbing to pressures to beef up security in their own backyard—are cutting back on their development spending as well. Britain, in a bid to raise defence spending, decided to lean into the overseas development fund. France's cash-poor minority government is considering cutting aid budget by at least a third. The Germans, recently coming to spotlight by mobilising considerable resources behind climate financing, are also becoming thrifty. So, although the American approach is needlessly chaotic and borderline inhumane by cutting funding support from HIV patients and people dependent on food aid, this penurious era of development funding is an alarming trend for the sector.\nIt begs the question: what is the future of foreign aid and what happens to people and countries dependent on it?\nThe roots of modern foreign aid can be traced back to the middle of the 20th century, when aid agencies were formed to support the newly independent colonies of the Western powers. During the Cold War, aid was also used as a tool to prevent the countries of the global south from vacillating towards the Soviet sphere of influence. Afterwards, bilateral foreign aid was often linked to democratic reforms as policymakers in the West believed that autocratic leaders were holding the countries back in poverty. However, in the early 2000s, aid spending took a more universalist approach—some might remember the adoption of the Millennium Development Goals by the UN—focusing on human capital and increasing investment in education and public health. From 2004 to 2014, aid spending increased by 75 percent, leading to growth in the so-called non-profit industrial complex.\nBut even after significant investments, foreign aid failed to deliver the economic holy grail of growth. The 78 poorest economies in the world experienced slower growth from 2014 to 2024 compared to the decade leading up to 1970 when foreign aid was emerging. Researchers have found little to no evidence that foreign aid leads to broad-based economic growth on a national scale, which was also confirmed by the World Bank. But then are we asking the wrong question? Is the economic growth of a country really the objective of foreign aid? Aid should focus on achievable goals: helping specific populations in targeted ways, rather than chasing the elusive overhaul of the country's economy.  \nBangladesh has had an interesting relationship with foreign aid. It supported large-scale immunisation programmes in the 1980s and 1990s, bolstering the public health infrastructure and acting as a critical enabler of positive health outcomes in areas of child and maternal mortality, child health, vaccination programmes, and curbing the impact of infectious diseases such as tuberculosis and malaria. It also gave rise to huge development organisations, such as Grameen, BRAC, ASA and Proshika, that stepped in to fill the gap where state capacity ended. Critics of foreign aid argue that it is a dangerous bargain, which enables the government to abdicate its core responsibilities in favour of NGOs, who due to funding dependence can often be tied to the interest of foreign nations and individuals. Be that as it may, the history of this fairly unique government-NGO partnership in Bangladesh is replete with examples of success in the fields of health, education, sanitation and economic development. In terms of targeted support to a vulnerable group: one of the most transformational models that came out of Bangladesh is perhaps the Graduation Approach. Nobel Laureates Abhijeet Banerjee and Esther Duflo extensively researched this approach pioneered by BRAC and found it can reliably lift people out of extreme poverty and keep them from falling into poverty again. Yet, the scepticism towards foreign aid and the way it is provided is very much grounded in the reality of the aid structure.\nWinston Churchill famously said, \"Never let a good crisis go to waste.\" Perhaps the development sector can also take this crisis as an opportunity to reflect and change the way it operates. It is fair to say that short-term project-based approaches, so commonplace in international development, failed to generate the sort of transformational change people expect from impactful programmes. A five-year project is hardly an answer to generational problems like climate change, which would require widespread global cooperation and very targeted support to countries like Bangladesh that are at the forefront of climate shocks. The same thinking can be applied to development funding. The funding must provide more catalytic longer-term funding to organisations that are running impactful programmes on the ground. Another idea, gaining steam, is to improve coordination among countries to ensure that the richest individuals and large multinational corporations pay their fair share of taxes, which could easily fill the gap left by the US. Estimates indicate that imposing a minimum annual tax of two percent on billionaires' wealth could generate up to $250 billion per year. The aid sector must show its willingness to shift away from its over-reliance on directives from foreign donors and instead focus on designing evidence-based, long-term initiatives that drive systemic change, rather than continuously moving from one project to another.\nThe cuts throughout the sector, precipitated by a rightward shift in governments globally, and the increasing perceived security risk is going to leave blood in the water. How the international development sector responds to these monumental changes would test the strength of character of its leaders and how adaptive the organisations and its people are. The moment might be in favour of populist leaders looking at the world through a zero-sum lens, but it doesn't have to remain that way forever. The rest of the world doesn't need to follow the US example. There is still a place for global cooperation and concerted efforts to ensure that the most vulnerable people are not left behind the veil of jingoistic posturing. For better or worse, the rest of the international community will have to chart their own path going forward, without hoping for isolationist leaders to change their worldview anytime soon.\nRakib Avi is a development worker and a graduate research assistant at the University of Georgia.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Are we witnessing the death of foreign aid?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/are-we-witnessing-the-death-foreign-aid-3880536",
        "news_paper_name": "The Daily Star",
        "publish_date": "27-04-2025"
    },
    {
        "full_article": "As the genocide in Gaza continues, Antony Loewenstein, an independent journalist, film-maker, and best-selling author of The Palestine Laboratory: How Israel Exports the Technology of Occupation around the World, speaks to Priyam Paul of The Daily Star debunking how Israel's surveillance technology, the military-industrial complex, and global dynamics perpetuate the suffering of Palestinians.\nWhat experiences shaped your interest in writing your book?\nI am a Jewish Australian-German. I was born in Melbourne, Australia in 1974, and brought up in a relatively liberal Jewish home. However, believing and supporting Israel was pretty much a part of the regular, daily discourse. It was not rammed down my throat, but it was pretty standard for many Jewish people to support Israel, because of our own history. For instance, my own family came from Germany and Austria. Majority of my family members were killed in the Holocaust; the ones who escaped, mostly in 1939, were spread around the world, including Australia. Therefore, the idea of a so-called safe-haven for Jews—as we were told—was Israel, which made sense to me when I was a child.\nOf course, what I was not told while growing up was that there were millions of Palestinians who have been under occupation for decades, and they are suffering because of that safe haven and supposed Jewish liberation. When I discovered the truth myself, it really made me deeply uncomfortable since I was a teenager and it continues to unnerve me to this day.\nWhy and how have the military-industrial complexes of both Israel and the US become so deeply intertwined, and in what ways have they operated similarly over the years, particularly to perpetuate the occupation and systemic erasure of the Palestinian people?\nThe US is Israel's biggest funder, armour, political supporter, diplomatic backer, and ally. This has been the reality since 1948, when Israel was established. It massively accelerated after 1967 when Israel took control of the West Bank, Gaza, and East Jerusalem, and it has been the case long before Donald Trump became president again earlier this year.\nHuge amounts of weapons that Israel uses are often tested and trialled in the US first. When the US is giving billions of dollars of so-called aid and military support every year to Israel, a significant amount of that money goes to certain districts in the US to back specific weapons or defence programmes. It is also worth mentioning that although the US-Israel relationship is very close, it is dysfunctional. Both nations massively spy on each other. We are not aware of the exact number of spies that both nations use on the other, but there is a desire on both sides to get the most accurate insider information about each other. So, the two nations are supposedly best of friends, but they also don't completely trust each other.\nIn your book, you wrote, \"Israeli history can be split into two eras: before and after 1967.\" Could you elaborate on the implications of the Six Day War for Israeli policy and explain what led to such a drastic historical and political shift?\nAfter 1967, Israel took control of the West Bank, Gaza, East Jerusalem, and the Golan Heights, and there was a perceived need within Israel to justify and defend those military actions and what became a brutal military occupation against the occupied Palestinians who lived there. Although Israel, for years before 1967, had used Palestine as a laboratory, it massively expanded after that. From the late 1960s, but certainly into the 1970s and pretty much to this day, roughly 50 or so years later, Israel often uses the occupied Palestinian territories as a way to prove to other countries how effective they are at suppressing Palestinian dissent or their self-determination.\nA large number of other countries, military figures, police forces from the US, along with parts of Europe and Asia, often travel to Israel to observe firsthand the reality of what the occupation means for Palestinians and then take back that experience and knowledge, often to develop defence relationships and contracts relevant to their own conflicts. The previous repressive administration in Bangladesh also sought Israeli tech to spy on dissidents of the state.\nTo what extent has the world changed with Israel's global reach in surveillance—through arms sales, mobile tracking technologies, and its influence over social media platforms where Palestinian content is often censored?\nIsraeli technology has massively influenced surveillance around the world, although there are obviously other countries that produce surveillance technology, including the US, China, and many countries in Europe. Israel is a global leader in surveillance technology and possibly among the top one or two biggest providers of surveillance worldwide.\nThe most prominent of these technologies often comes from the software company NSO Group and its tool, Pegasus. However, there are others, such as Paragon. They are sold to various governments, dictatorships, democracies, police forces, and intelligence services.\nWe are told that they are used to fight \"terrorism and crime,\" but actually they are often used by those states with clearly the knowledge of both NSO Group and the Israeli government, to go after dissidents, critics, and human rights activists. And one of the ways that Israel—particularly since Benjamin Netanyahu became prime minister many years ago—has been using these weapons and surveillance technologies is as a diplomatic tool.\nIt is a way for Israel to make so-called friends. Israel says to a country, that we will sell this incredibly powerful spyware that will enable you to monitor your dissidents and people you don't like, but in return, we would like you to do certain things for us. For example, voting in a certain way in the United Nations or supporting Israel in some other way.\nHow do you evaluate the events of the Hamas-led attack on Israel on October 7, 2023, and Israel's ongoing large-scale assault on Gaza?\nThe Hamas attack on Israel on October 7, 2023, in many ways, should have revealed to the world that Israel's surveillance and military tech has failed miserably. From the Israeli perspective, more than 1,200 Israelis were killed and all their defences disappeared. Hamas was able to overwhelm Israel's defences.\nHowever, the reality is that many of the same companies that had been used by Israel before October 7, 2023 to provide apparent defence to Israel from Gaza and Hamas are now some of the key players in Israel's genocide in Gaza. I am talking about Elbert, Israel's biggest defence company, and others. They are using, leveraging, and testing massive amounts of weapons in Gaza. One of the most prominent examples of this testing includes killer drones, so-called quadcopters, artificial intelligence (AI), which did exist and was used before October 7 as well.\nHowever, Israel has massively increased the use of this AI warfare in Gaza after the Hamas attack. So, a huge number of Palestinian civilians who have been killed in Gaza since October 7, 2023 have been chosen by the so-called AI warfare tech with barely, if any, human oversight. This is because Israel's main mission in Gaza has never been about destroying Hamas or going after terrorism. Rather, it has been about destroying Gaza and making it unliveable.\nWhat role can the global public opinion play in addressing the long-term Palestinian cause, especially when international pressure often fails to bring about meaningful change?\nThe two-state solution for Israel and Palestine is over and dead, and arguably was never going to happen. Because for decades, the Israeli politicians—and I would say many, if not most, of the Israeli Jewish public—have shown little interest in giving up the occupied territories that they control. The Israeli settler movement, which is not the majority of the Israeli public but certainly the most politically powerful, has essentially taken over the state. There is no political pressure within Israel for a two-state solution, and there is frankly no international pressure either.\nThe US, even before Donald Trump, essentially was allowing and supporting Israeli actions in the West Bank, Gaza, and beyond. The Europeans are mostly distracted with their own issues, with Ukraine and now Trump. The Arab countries talk about a two-state solution, but they are mostly keen on maintaining good relations outrageously and shamefully with Israel and the US. So, what I fear is that, in the short to medium terms, we are going to see what kind of already exists, which is a one-state apartheid system, where Israelis have full rights, while Palestinians remain second class citizens.\nAntony Loewenstein's book The Palestine Laboratory: How Israel Exports the Technology of Occupation around the World is set to be translated into Bangla and re-published soon. \nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "‘Israel's main mission is not combating terrorism, but destroying Gaza’",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/geopolitical-insights/news/israels-main-mission-not-combating-terrorism-destroying-gaza-3880496",
        "news_paper_name": "The Daily Star",
        "publish_date": "27-04-2025"
    },
    {
        "full_article": "Amid continued focus on economic crises, dollar shortages, and political developments, one topic that perhaps impacts our long-term future the most—the nutrition level of our children—hardly comes into discussion. Children, especially those under five years of age, have no voice in the public realm, whether in politics, policy planning, or in our parliament. As a result, a crisis of nutrition among children is quietly in the making.\nAt a roundtable discussion organised jointly by The Daily Star and icddr,b, experts noted that there has been some improvement in this regard in recent years, but given the prevalence of stunting and wasting among children under five, Bangladesh may not meet the Sustainable Development Goals' (SDG) targets by 2030. Besides, statistics and percentages often hide the real picture. Take, for example, the stunting rate among children under five, which came down from 41 percent in 2011 to 21 percent in 2022—it does not really convey the reality of the millions who are still stunted.\n\nWhen these children become adults, the deprivation of proper nutrition during their most crucial development years is likely to haunt them for the rest of their lives. According to experts, 80 percent of brain development occurs between birth and three years of age. As such, even if an adult increases their nutrition intake, they will not be able to reverse the harm done from lack of nutrition in the early years.\nWhen these children become adults, the deprivation of proper nutrition during their most crucial development years is likely to haunt them for the rest of their lives. According to experts, 80 percent of brain development occurs between birth and three years of age. As such, even if an adult increases their nutrition intake, they will not be able to reverse the harm done from lack of nutrition in the early years.\nOne of the main causes of malnutrition among children under five is deprivation from breast milk. Sadly, in Bangladesh, the rate of exclusive breastfeeding has come down from 65 percent in 2018 to 55 percent, according to the most recent data. Reasons include inadequate campaigns to raise awareness on the importance of breastfeeding, an increase in caesarean deliveries, aggressive marketing by powder milk suppliers, an increase in the number of working mothers, and lack of space for nursing at workplaces. Child marriage, which remains quite high in Bangladesh, can also lead to malnutrition among mothers and children under five.\nIronically, we are not just depriving our children of proper nutrition; we have allowed toxins to seep into our food chain through excessive use of plastics, chemical fertilisers, and pesticides, harming their health and nutrition in the long run. Therefore, we must not only increase budget and manpower—especially at the grassroots—for nutrition programmes and raise awareness about breastfeeding and antenatal care. Child marriage must also be stopped, along with the use of harmful chemicals and plastics that toxify our food chain. It is time for an urgent call to action.\n",
        "headline_1": "Ignoring child nutrition today will cost the nation tomorrow",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/ignoring-child-nutrition-today-will-cost-the-nation-tomorrow-3879131",
        "news_paper_name": "The Daily Star",
        "publish_date": "27-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 27, 2025 00:00:00  \nThe government's decision to return 12,000 acres of forestland in Cox's Bazar to the Forest Department reversing previous allocations to various agencies offers a reason for optimism. The fact that such a vast expanse of forestland from Bangladesh's already limited forest cover was handed over to different entities with official approval exposes how little environmental preservation was a priority for past governments. While much more remains to be done to safeguard the forests of Cox's Bazar, this current move indicates a shift in attitude and a growing political willingness to correct past wrongs. \nA recent report published in this paper quoted environment adviser Syeda Rizwana Hasan as saying that 700 acres of illegally occupied forestland in Cox's Bazar have already been recovered, which suggests a strong start for the anti-deforestation campaign. The adviser also noted that construction on 150 acres of forestland illegally occupied by an individual has been stopped and 20 acres allocated to a football academy are being reclaimed. There is also ongoing initiative to return land on Sonadia Island that had been allocated to the Bangladesh Economic Zones Authority (BEZA). These specific developments, while encouraging, also brought to light the troubling reality that many of the encroachments and forest clearings were carried out by government departments and agencies themselves. Entities meant to serve the public interest and protect national assets have, ironically, emerged as primary drivers of forest destruction. Cox's Bazar which is home to the critically endangered Asian elephant and numerous other species including deer, wild pigs and monkeys has lost a quarter of its forest cover due to these encroachments. The reckless destruction of these habitats in the name of infrastructure and departmental expansion is a textbook example of development being pursued at the cost of ecological survival.\nThe crisis of forest encroachment extends well beyond Cox's Bazar. Forests are shrinking from the Sundarbans to the Chattogram Hill Tracts due to a confluence of factors including illegal logging, agricultural expansion and uncontrolled industrial activity. Even the iconic Sundarbans, a UNESCO World Heritage site, has witnessed an alarming drop in tree numbers over the years. Rampant extraction of resources is pushing the Sundarbans towards irreversible ecological decline. Forests, especially those along the coast, have historically served as natural barriers against extreme weather events in addition to their critical function in preserving ecological balance. It is hard to comprehend how any logic of development could justify the removal of such critical protections. \nPast attempts to reclaim forestland through eviction drives have frequently been undermined by powerful land grabbers who secured status quo orders from the courts. To avoid a recurrence of such setbacks, the government must act with full transparency and resolve. One crucial step would be the public release of a comprehensive and easily accessible list of individuals and institutions responsible for illegal forest occupation, an action that could serve as a strong deterrent. Furthermore, a zero-tolerance policy must be enforced to ensure that not a single inch of forest land is encroached upon going forward. The environment adviser's commitment to returning the 12,000 acres of forestland in Cox's Bazar to the Forest Department must also be fulfilled without further delay. Once recovered, the land should be swiftly reforested to help restore ecological balance. At the same time, legal and administrative action must be taken against those who have benefitted from forest plunder, those who shielded them, and those whose negligence or wilful inaction enabled this abuse.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Reclaiming Cox's Bazar forests",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/reclaiming-coxs-bazar-forests-1745677051",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       April 27, 2025 00:00:00  \nGlobal trade is going through a turbulent year due to United States (US) President Donald Trump's tariff coupled with policy uncertainty. Least Developed Countries (LDC), especially export-oriented ones like Bangladesh, will face severe repercussions due to their concentration of trade on a small number of products as well as their limited resources to deal with setbacks. \nThese are the general observations made by the latest Global Trade Outlook and Statistics report, released in the third week of this month by the World Trade Organization (WTO) Secretariat. It said that the volume of world merchandise trade is expected to decline by 0.2 per cent in 2025 under current conditions, meaning suspension of Trump's reciprocal tariffs for three months. The situation will aggravate if the US president ultimately withdraws the suspension and applies his reciprocal tariffs. There will also be a broader spillover of trade policy uncertainty (TPU). Both these could lead to a sharper decline of global goods trade by 1.50 per cent in global goods trade and hurt export-oriented LDCs, added the WTO report. \nTo project the impact of reciprocal tariffs and TPU on trade and gross domestic product (GDP) globally and regionally, WTO conducted a modelling analysis of TPU, providing four cumulative trade policy scenarios. It showed that global trade might decline by 0.5 per cent to 4.3 per cent under four scenarios: only US TPU, actual tariffs, reciprocal tariffs, and TPU spreads. Under the third and fourth scenarios, LDCs' global trade may drop by 0.40 per cent and 0.90 per cent, respectively, while LDCs' combined gross domestic product (GDP) is likely to drop by 0.07 per cent and 0.74 per cent, respectively. \nInterestingly, LDCs are projected to see their exports rise in the second scenario when LDCs' global trade may increase by 0.90 per cent. \"The reason is that some LDCs - for example, Cambodia, Bangladesh and Lesotho - can expand their exports to the United States because their exports are highly dependent on products for which China currently has a large import share in total US imports, such as clothing and textiles, as well as electronic equipment,\" said the WTO report. That's why these LDCs may benefit from shifting demand towards their products. The WTO report categorically noted that the recent rise in tariffs and uncertainty is projected to positively impact merchandise trade flows of LDCs in the current year as export volume may grow by 4.80 per cent, and import growth should be 7.60 per cent. \nUndoubtedly, it is a glimmer of hope for the LDCs. These countries are generally among the most vulnerable to external economic shocks. It is to be noted that the value of the global merchandise exports of the LDCs surged by 5.60 per cent to US$275 billion in the last year from $ 260 billion in 2023 when LDCs global exports had declined by 2.0 per cent from $266 billion in 2022. The surge slightly increased the share of LDCs in world exports at 1.12 per cent, an all-time high, in the last year, which was 1.09 per cent in 2023. Merchandise imports of LDCs also jumped by 3.20 per cent to $349 billion from $338 billion in 2023. Earlier in 2022, LDCs global import stood at $361billion in 2022. The share of LDCs in world imports also increased slightly to 1.41 per cent in 2024 from 1.39 per cent in 2023 but matched the previous peak of 1.41 per cent in 2022.\n\nAt present, 37 of the 166 members of the WTO are LDCs. The total number of LDCs is 45, as per the United Nations (UN) list, of which 15 are at various stages of graduation. Of these, three LDCs, Bangladesh, Lao PDR, and Nepal, will be graduated by the end of 2026. \nAs the Trump tariff is mainly designed to hit China, there will be a decline in Chinese exports to the US market. The WTO report projected that most regions will see a fall in exports to the US, with the most significant reduction for China (77 per cent). However, the report also highlights a promising trend-Asia (excluding China) and in particular LDCs are projected to take over some of the lost market share of China facing higher tariffs. This presents an opportunity for LDCs to expand their global market presence. \nIn other words, trade diversion will benefit the LDCs, and their combined exports to the US may increase by 22 per cent in the current year. As a result, LDCs' export share to the US market will stand at 3.2 percentage points, while China's share will drop by 10.50 per cent. US is the third largest market for LDCs combined exports while China and European Union (EU) are the first and second largest destinations respectively. \nAt present Bangladesh is the leading exporter of LDCs as country shares more than one-fifth of the LDC's total exports. Again, the US is the leading market for Bangladeshi goods, and the country's exports to the US stood at $8.36 billion in 2024. Last year, the country also faced an average of 15.70 per cent import tariffs in the US market. Trump imposed a 37.50 per cent reciprocal tariff on imports from Bangladesh in the first week of this month, along with various tariff rates on some other countries. Although he later suspended it for three months, it is uncertain about what he will do ultimately. \nAs predicted by the WTO, the potential trade diversion from China presents an opportunity for Bangladesh, although it is difficult to estimate. Theoretically, trade diversion occurs when 'tariff causes imports to shift from low-cost countries to higher-cost countries.' In other words, trade diversion is undesirable due to its 'concentration on production in countries with a higher opportunity cost and lower comparative advantage.' However, Trump's tariff may fuel trade diversion from China for the time being. It is crucial for Bangladesh to seize this opportunity and strategically enhance its exports to the US market.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Trade diversion may  benefit LDCs",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/trade-diversion-may-benefit-ldcs-1745677135",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       April 27, 2025 00:00:00  \nThe World Bank's Bangladesh Development Update, released on April 24, painted a gloomy picture of Bangladesh's economic outlook, warning of rising poverty, deepening inequality, and slowing growth. It indicates that an additional 3 million people may fall into extreme poverty this year, with the extreme poverty rate feared to rise from 7.7 per cent to 9.3 per cent. Meanwhile, the overall national poverty rate is forecast to increase from 20.5 per cent in 2024 to 22.9 per cent in 2025. \nAccording to the World Bank report, income inequality in Bangladesh, measured by the Gini index, is projected to rise from 33.4 in 2022 to 36.1 in 2025. The Gini index ranges from 0, representing perfect equality, to 100, indicating maximum inequality.\nTo check the growing poverty and rising income inequality, the government will have to implement some targeted measures in the upcoming budget. Rising inequality and pervasive discrimination are not inevitable consequences of development; rather it is the result of deeply flawed economic policies that favour the interests of the elite leading to a skewed distribution of wealth and opportunities. As a result, inequality kept widening through various mechanisms, such as discriminatory taxation systems that disproportionately burden the poor, exploitative labour practices that permit extremely low wages, and widespread corruption and irregularities in the implementation of government programmes, including social safety net programmes. Additionally, inadequate investment in crucial public services such as healthcare and education has also limited the access of the disadvantaged to these essential services, exacerbating existing inequalities. \nTo address rising inequality, a government taskforce on Economic Strategy Redesign has rightly recommended the implementation of a progressive taxation system. Historically, Bangladesh's tax structure has been regressive in nature. For example, in the last fiscal year, indirect tax collection accounted for 66 per cent of the total tax revenue. This heavy reliance on indirect taxes like VAT and supplementary duties, which apply uniformly to goods and services regardless of the income level of consumers, disproportionately affects the poor and increases inequality. It is, therefore, imperative to pursue a progressive taxation system by increasing direct tax collection from wealthy individuals and corporations while reducing the burden of indirect taxes on the common people. Then there is a need for bolstering social security programmes, which can play a crucial role in mitigating economic inequality.\nAnother potent tool to fight inequality is equal opportunity to education, which can empower children from poor and disadvantaged families to improve their socioeconomic status. Regrettably, chronic neglect of public education and unchecked commercialisation of education have not only blunted this crucial tool but also exacerbated existing inequalities. Access to quality education, a fundamental right enshrined in the Constitution, is increasingly becoming a privilege for the wealthy. The rising cost of educational materials, high tuition fees for private tutoring, and the overall commercialisation of education have made quality education a luxury.\nTo a large extent, access to quality education is being determined by the financial capacity of the parents, rather than by the merit of the students. If the poverty of parents becomes a barrier to their children's education, those from disadvantaged backgrounds will be perpetually denied the opportunity to improve their socio-economic situation. This will not only perpetuate and widen existing economic and social inequalities but also hinder the nation's overall progress. Therefore, ensuring equality of opportunity at all levels of education is crucial for building a discrimination-free Bangladesh. This requires a significant investment in improving the quality of public education, making it accessible and affordable for all children, regardless of their socioeconomic background. Meanwhile, the health sector is also becoming increasingly commercialised. This has resulted in escalating healthcare expenses, forcing many people to deplete their life savings or incur significant debt to meet their emergency medical expenses. \nThe current interim government, which emerged from a popular uprising against discrimination, is undertaking various reforms across political, administrative, and institutional spheres. However, the core issue that fuelled the July uprising - the need to build a truly discrimination-free Bangladesh - appears to be relegated to the backburner. The government is expected to lay the foundation for a truly just and equitable society so that the sacrifices made during the July uprising do not go in vain.\naktuhin.fexpress@gamil.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Protecting basic rights of  the poor, their children",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/protecting-basic-rights-of-the-poor-their-children-1745677181",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 27, 2025 00:00:00  \n\nThe amount of generational conflict is growing over time. A generational conflict arises when one generation blames another because the other cannot stand it. We coexist on this planet right now. One person does not understand technology, while another cannot function without the internet. Some people manage their livelihoods, work for a living, and live normal lives without any knowledge of technology. They resume their work in the morning. People who are familiar with technology and are acclimating to life in the past are one kind of person involved. The other group frequently depends on technology constantly. We refer to this as Generation Z (Gen-Z). They will inevitably include technology.\nPeople of all three kinds are part of the society in which they live. One generation is isolated from the next. We therefore consider generational conflict to be a common thing. However, we lack the understanding to maintain the normalcy of this kind of intergenerational conflict. We cannot listen to another generation, nor do we act following or in response to it. Bringing people together and bridging the generational divide can be achieved through storytelling, conversation, singing, and gathering under a tree's shade. All of these ways, however, will be lost. Every generation tastes different. One generation finds it difficult to coexist with another. This process is ongoing. Nowadays, young people are confined to their own lives and avoid elders. That is due to a variety of factors. Among them is their refusal to respond to inquiries. \nThey believe that when they are asked questions by the elderly, they might be overcome with shyness. For this reason, they are unwilling to confront the older generation. In contrast, older people portray themselves to younger people as knowledgeable. Young people should treat older people with respect, and older people should act modestly towards younger people. \nWith songs, stories, and small talk, we can bridge the generational divide.\nMd Tousif Raihan\nStudent\nDepartment of Criminology and Police Science\nUniversity of Chittagong\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why is generational distance increasing?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-is-generational-distance-increasing-1745677197",
        "news_paper_name": "The Financial Express",
        "publish_date": "27-04-2025"
    }
]