[
    {
        "full_article": "The Supreme Court of India’s proceedings on free-roaming dogs represent an earnest, even if inadequate, attempt to reconcile competing claims of compassion and safety. On August 11, 2025, the Court had directed the Municipal Corporation of Delhi to round up strays and confine them in shelters. Eleven days later, it changed course, permitting release after vaccination and deworming, and that aggressive or rabid animals be retained. India bears one of the world’s heaviest burdens of rabies and anthropological accounts are clear that this threat shapes daily life, limiting children’s movements and forcing families into repeated medical expenses. Rabies also disproportionately kills those least able to navigate the health system. While the Animal Birth Control Rules were updated in 2023, experience shows that without 70% sterilisation coverage, they are ineffectual. The August 11 order was significant because it acknowledged that the present framework, however well intentioned, is inadequate for India’s dense settlements. Objections that shelters will be overcrowded and disease-ridden and that permanent impoundment will precipitate an ecological imbalance confront the same issues that undermine the Rules. Properly resourced and regulated shelters can be managed with veterinary standards, space norms and transparent oversight. India already maintains similar institutions for cattle on a large scale. But if canine facilities are in squalor — which may have motivated the Court to change course — it will be due to the same administrative neglect and policy fragmentation between States that have kept sterilisation coverage from crossing 70% in any major city, and which have been keeping alive fears of other species migrating into the ecological niches dogs once occupied.Street dogs are woven into India’s urban fabric, even offering companionship to the homeless. Such perspectives deserve a place in cultural discourse but cannot override the human right to access public spaces without fear of injury. Compassion is not annulled if dogs are removed from public roads; they must still be compassionately rehomed, sheltered and, when incurably aggressive or ill, euthanised humanely. A modern statute must replace the outdated Prevention of Cruelty to Animals Act 1960. It should classify dogs as adoptable, shelter-bound or unfit and mandate municipal shelters with minimum standards. Crucially, governments should count stray dogs across States and determine the true cost of maintaining shelters rather than chronically underestimating it. This system should also have the support of the national veterinary cadre, better waste management and penalties for abandoning pets. Without these measures, urban India will keep trading visible menace for invisible neglect.READ MORE Published - August 25, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        animal\n                    \n                            /                      \n                        \n                        local authority\n                    \n                            /                      \n                        \n                        Delhi\n                    \n                            /                      \n                        \n                        disease\n                    \n                            /                      \n                        \n                        vaccines\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        urban planning\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        waste management",
        "headline_1": "Practising compassion: On the stray dogs issue, Court order",
        "headline_2": "Underestimating the cost of animal shelters undermines them",
        "link": "https://www.thehindu.com/opinion/editorial/practising-compassion-on-the-stray-dogs-issue-court-order/article69971796.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "25-08-2025"
    },
    {
        "full_article": "For months, international rights groups, aid organisations and doctors who served in Gaza have warned that the enclave was on the brink of famine. Heartbreaking stories and images of starvation poured out as Gaza’s civil defence groups repeatedly told the world that children were dying every day due to malnutrition. But Israel, waging a genocidal war in Gaza for the past 22 months, dismissed these reports as lies, while its western allies did little beyond expressing token concerns. Last week, the Integrated Food Security Phase Classification (IPC), a UN-backed body, confirmed that an entirely “man-made famine” is unfolding in Gaza’s largest city and its surrounding areas, the first officially declared famine in West Asia. At least one in five households faces extreme food shortages, while a third or more of all children are acutely malnourished. The IPC also stated that at least two in every 10,000 people die daily from starvation or the deadly combination of malnutrition and diseases. Yet, if anyone expected such a devastating report by a reputed organisation to have had an impact on Prime Minister Benjamin Netanyahu’s war-thirsty regime, they were mistaken.Israel has long imposed restrictions on goods entering Gaza, that has been under Israel’s blockade since 2007; it tightened those restrictions after Hamas’s October 7, 2023 attack. But in March 2025, after Mr. Netanyahu broke a ceasefire, Israel imposed a total three-month blockade on all goods entering Gaza. When it began allowing a limited amount of food, a new U.S. and Israel-backed organisation, the Gaza Humanitarian Foundation (GHF) replaced the previous UN-led food distribution system. The blockade, along with Israel’s direct control of food distribution, plunged hundreds of thousands into acute hunger. When desperate, hungry Palestinians rushed to the limited food centres run by the GHF, they were shot down by Israeli troops and GHF volunteers in the name of crowd control. The UN estimates that more than 1,300 Palestinians have been killed at food centres since May. Despite mounting international outrage and allegations of war crimes, and Hamas’s acceptance of the latest ceasefire proposal put forward by Qatar and Egypt, Israel has intensified attacks on Gaza city in preparation for a new offensive. What is unfolding now in Gaza goes far beyond Israel’s stated aims of defeating Hamas and releasing hostages. The growing body of evidence points to an intent to destroy Palestinian life and society in Gaza itself. The most brutal of crimes are being committed against 2.3 million people — in full view of the world. The world cannot allow Israel to continue devastating Gaza any further.READ MORE Published - August 25, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        human rights\n                    \n                            /                      \n                        \n                        Palestine\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        famine\n                    \n                            /                      \n                        \n                        United Nations\n                    \n                            /                      \n                        \n                        food\n                    \n                            /                      \n                        \n                        crime\n                    \n                            /                      \n                        \n                        war\n                    \n                            /                      \n                        \n                        Qatar\n                    \n                            /                      \n                        \n                        Egypt",
        "headline_1": "Man-made famine: On the state of Gaza",
        "headline_2": "The world must stop Israel from annihilating Gaza through starvation",
        "link": "https://www.thehindu.com/opinion/editorial/man-made-famine-on-the-state-of-gaza/article69971810.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "25-08-2025"
    },
    {
        "full_article": "India did the right thing by not signing a  bad US trade deal. Tariffs will pinch, but only in the short term  \nAfter seven months in White House, Trump has picked his ambassador to India, but it’s a divisive choice. Those for Sergio Gor say he has Trump’s ear. So much so that Trump spiked Elon Musk’s pick for Nasa chief on his advice. Those against say the 38-year-old has zero diplomatic experience, and shouldn’t be cutting his teeth in the world’s most populous – and nuclear-armed – region. India has greeted the news cautiously, even as Trump’s heralded Gor as “someone I can fully trust to deliver on my Agenda”. \nThe emphasis on “agenda” is Trump’s, and with just two days remaining for his 25% penal tariff – White House is calling it “sanctions” now – on India to come into force, nobody has a handle on Potus’ geopolitics. A president who can strain an easy relationship to satisfy his ego – he’s claimed more than 40 times that he mediated the India-Pak ceasefire – defies analysis. But maybe there’s a method to Trumpness. Maybe it really is about using India as a lever against Putin. His trade adviser Peter Navarro’s recent tirades – describing India as Kremlin’s “laundromat” most recently – suggest this.\nBut as India has pointed out time and again, the US argument is self-serving. When America was worried about a global oil shock at the start of the Ukraine war, and the resultant Western sanctions on Russia, it urged India to buy shiploads of Russian oil. Besides, China, the other major buyer of Russian oil, has not faced Trump’s heat on this account after rattling its own rare earths sabre. In short, Trump’s moral posturing is nothing but bullying in the garb of principle. \nSo, India has done well to resist US pressure for a trade deal that treads on its red lines of agriculture and dairy. This has cast a cloud on the short term, but there are silver linings. EAM Jaishankar has said trade negotiations are continuing, and US secretary of state Marco Rubio on Saturday described India as “one of the most important relationships our nation has in the world”. Even Navarro prefaced his vitriol with “I love India.” The higher US tariffs that Indian exports will face from Wednesday will impact Indian manufacturing, and jobs, to an extent, but GOI is alive to this challenge, and is looking at “quantum, not incremental” reforms, as Modi said at the ET World Leaders Forum on Saturday. India’s short-term pain might lead to long-term gain after all.\n\n",
        "headline_1": "Beyond the noise",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/beyond-the-noise/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-08-2025"
    },
    {
        "full_article": "…Yet botched probes & low conviction only help those accused of dowry murders \nThe case of the 26-year-old woman in Greater Noida, burnt to death by her husband in front of their 6-year-old child, is but a comment on the system that abandoned her. Married into this family in 2016, she endured relentless dowry demands and violence. Yet, her parents still married off her sister into the same household. Why would they do that when one daughter was already being tortured? What regressive social practices invisibly control these villagers who own Scorpios and can expect ₹36L and more in dowry? Did either sister ever stand a chance of living a safe life? Truth is that in very many pockets – per NCRB’s crime records UP, Bihar and Haryana still lead the charts – dowry is anything but past practice. These sisters had no access to law or state/NGO protection. They were simply married off and abandoned to violence.\nQuestion before the state, police and courts is, why shouldn’t men like brothers Vipin and Rohit feel confident they can brutalise their wives? After all, the law sets no deterrent. In 2022 – the last NCRB report – conviction in dowry death trials of that year was 33%, but conviction is just 2% calculated against all dowry death cases pending trial – 60,577. A pendency of 94%. Forensics are broken – reports abound of untrained sanitation workers conducting autopsies because doctors refuse. Pause and consider what that means. Meanwhile, tired claims that anti-dowry laws are “misused” only serve to embolden perpetrators.\nThink – the first FIR in this case did not even invoke anti-dowry provision BNS Sec 80. That speaks volumes. Is misogyny baked into the system, or was police intimidated? Nothing short of an honest, rigorous investigation and swift, exemplary punishment will do. A nation that aspires for global leadership cannot tolerate young women being killed for dowry on the edge of the national capital in the 21st century. \n\n",
        "headline_1": "They shouldn’t dare…",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/they-shouldnt-dare/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-08-2025"
    },
    {
        "full_article": "A dog-human half-realised love story\nI spotted Blacks on his familiar perch late last night. I hadn’t seen him for a fortnight. I was worried. You can easily guess why. I knew he had benefactors in our housing complex. But I had also heard he had been roughed up by those who neither liked him nor his ilk. I walked up to Blacks. His eyes lit up in recognition. I hugged him longer than I normally do. It was as much in relief as in joy. Ours is a half-realised love story. Also, an old one. I figured after our early meetings that Blacks valued his independence. That part was non-negotiable. It was, therefore, going to be an open relationship. \nHe turned up every night, sometimes very late, avoiding the prying eyes of a gentleman downstairs who disapproved of all canines, barring his own. I discovered, to my surprise, Blacks ignored canned food, preferred milk to meat. “Yeh toh sanyasi nikla,” a neighbour told me. Right through the long Covid months, when rumours of dogs carrying viruses fuelled an irrational scare, life was tough for strays like him. \nThen we moved to another block in the same complex. Blacks stopped visiting us. To him, we had migrated to another country. But we kept meeting. Not over dinners anymore. Just as friends. To hug and paw. I like to believe our hearts nested against each other like Russian dolls. Nights were safer for these brief rendezvous. Like the country we live in, our apartment is polarised over everything. Dogs are no exception. Some years ago, one group protested against community dogs; the other side formed a human chain in support. I have found personal dogs more unpredictable. Trapped inside 1,200 sq ft apartments for most of the day, a few big ones occasionally get capricious outside. Strays are different. \nThey are realistic and adjusting. They know the world is owned by humans and they must subsist on tender mercies. They survive hunger, violence, the unkindest cut life throws at them. Only one out of five street puppies attains adulthood. Life makes them hardy. But they also fall headlong in love, like teenagers with bungee-jumping hormones. Their unconditional affection makes you a better version of yourself. And unlike humans, they never forget acts of kindness. Blacks certainly remembers everything even though we lead separate lives now. If only humans could be like dogs.\n\n",
        "headline_1": "Meet Jogi Blacks",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/Addictions/meet-jogi-blacks/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-08-2025"
    },
    {
        "full_article": "The signals from Beijing and Delhi are unmistakable. The India-China relationship is being stabilised and rebuilt after it literally fell off the Himalayan cliffs in 2020. While the impetus is a predatory US, Modi and Xi Jinping had cleared the decks during their Kazan summit last October.\nThe collapse of the relationship was the result of many forces of history playing out simultaneously — a dramatic powershift from a US-centred unipolar order to a more plural multipolar world; the intense struggle between the US and Eurasian great powers to shape this changing balance of power; and the spillover effect of that tumultuous geopolitics on India-China relations.\nFor India, the central dilemma of China policy during this period of flux has been whether to pursue a strategy of audacity or one of prudence. ‘Always more audacity,’ Winston Churchill is quoted as saying, but a state can choose one of these options but not both at the same time. India has oscillated between the two impulses, resulting in a precarious geopolitical situation over the past decade.\nThe regional setting is now more complicated than ever: a highly militarised northern frontier, China-Pakistan military cooperation that has transformed in ways that could tip the geostrategic balance, and if this was not enough, the US has worked to undermine Indian authority in the subcontinent and exploit it during moments of geopolitical vulnerability. If this were a momentary storm destined to pass, then simply riding out this phase might suffice as a strategy. But the unprecedented economic, technological and military transformations underway will not allow the old world order to restore itself. This is the moment to regain lost initiative and arrest the geopolitical risks that could unravel India’s rising power.\nIs there a way to craft a China policy that can shape a more favourable strategic environment?\nHistory offers lessons. Adversarial states have in the past, after bouts of fierce competition and conflict, chosen prudence over rivalry: US-China normalisation in the 1970s, the Sino-Soviet rapprochement in the 1980s. In both cases, bold policy choices that were domestically unappealing reset relations.\nDo those conditions exist in India-China relations today? There is no compelling external force or factor that can drive these two states to bury the hatchet; at least not yet. While both benefit from multipolarity, in practice, Indian and Chinese international visions are still too insular and underdeveloped to enable a shared discourse on world order. Most crucially, the material asymmetry — even after factoring in India’s limited external balancing options — greatly complicates any quest for a grand bargain with major give and take between India and China.\nThere is no Nixon-like moment around the corner, nor a Deng Xiaoping sort of statesman waiting in the wings in the Indian political scene to redefine the national line as part of a new world order vision. Remember Deng chose a strategy of prudence over audacity and then ensured its political continuity for over three decades despite many twists and turns along the way.\nSo, what we are left with instead is attempting normalisation but without an overarching vision. As the China policy debate unfolds, there are three central themes that stand out.\nFirst, India’s undeclared goal to be a pillar of a US-led collective security system in Asia is no longer viable. The reasons are obvious — US hegemony has collapsed, India lacks the surplus material strength to underwrite security commitments beyond the subcontinent, and integrating into US-led alliances implies a major loss of sovereignty and geopolitical control. The West is not interested in India’s opinion on how their alliance system should be reformed or redesigned to accommodate an independent India.\nSecond, the post-neoliberal globalisation chapter for economic interdependence is still being written. While the major economies will be its main authors, India still holds many cards. With competitive advantages of market scalability, human capital and industrial infrastructure, India can negotiate a mutually advantageous economic relationship with China. The door needs to open wider, not in a piecemeal tactical way but with a broad blueprint. If done properly, multilateral aspects like BRICS can also be steered in more concrete ways that benefit India and the region.\nThird, despite their differences, both India and China have a vital interest in geopolitical peace on their overlapping peripheries. A typical grand bargain may not be possible, but a degree of convergence can be built based on the mutual recognition that India and China have distinct policy priorities and geopolitical roles. In other words, they can give each other some room to focus on their respective geopolitical and socio-economic priorities. This could be the starting point for the next leadership conversation.\n \n\n\n",
        "headline_1": "Chill gives way to thaw but India, China must go beyond piecemeal fixes",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/chill-gives-way-to-thaw-but-india-china-must-go-beyond-piecemeal-fixes/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-08-2025"
    },
    {
        "full_article": "We remain deeply concerned by the unfolding man-made famine in Gaza. On August 22, the Integrated Food Security Phase Classification (IPC) system officially declared a famine in Gaza City and nearby areas, warning that it could soon spread across the entire enclave. This is the first time the IPC has declared a famine outside of Africa. According to this global hunger monitoring coalition, around 514,000 people—nearly a quarter of Gaza's population—are already experiencing famine. This number is expected to rise to 641,000 by the end of September.\nOver the past 22 months of this unjust war, Israeli forces have destroyed a significant part of Gaza's vital infrastructure, including hospitals and bakeries, blocked humanitarian aid, and targeted and killed desperate Palestinians seeking food aid. But despite overwhelming evidence of the deliberate starvation and obstruction of aid, Benjamin Netanyahu has dismissed the IPC's findings as an \"outright lie.\" This denial is deeply disturbing, albeit not surprising any more.\nIsrael has been going ahead with its plan to seize Gaza City despite international outcry. Its ongoing bombardment continues to claim lives daily. A classified Israeli military database reportedly shows that the vast majority of Palestinians killed so far are civilians. During this war, nearly 200 journalists have also been killed, according to Reporters Without Borders. The recent deaths of four Al Jazeera journalists—including 28-year-old Anas al-Sharif—have again triggered global outrage. These targeted killings have made it clear that Israel is deliberately targeting journalists to suppress the evidence of its war crimes. Netanyahu's dismissal of the IPC famine report further suggests an attempt to prevent global awareness of the humanitarian crisis and hints that Israel wants to expand its offensive in Gaza no matter what.\nAccording to UN aid chief Tom Fletcher, the unfolding famine was entirely preventable, but \"because of systematic obstruction by Israel,\" food could not get through to Palestinians in need. UN Secretary-General António Guterres demanded a ceasefire, saying that the ongoing crisis must not be allowed to persist without accountability. World leaders must, therefore, raise their voices in unison and demand immediate and unhindered delivery of humanitarian aid into Gaza.\nThe famine in Gaza must be averted at any cost. As food and medicine sit idle at border crossings, innocent civilians, including children, face deadly consequences. The IPC's projection that over 132,000 children under five will be at risk of death from acute malnutrition by June 2026 is a stark warning that the international community must act now. It must increase pressure on Israel to agree to the ceasefire proposal from Egypt and Qatar, rather than escalating its military action. The people of Gaza deserve more than sympathy; they deserve action.\n",
        "headline_1": "Prevent Gaza famine at all costs",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/prevent-gaza-famine-all-costs-3969551",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 25, 2025 00:00:00  \nListing profitable state-owned enterprises (SOEs) and multinational companies (MNCs) on the stock market can bring multifarious benefits provided that the job is done in a substantive and meaningful way. First of all, it can remedy the lack of market depth, even if partially, as the market has become stagnant due to the slow growth of listed companies. For more than a decade, the bourses have been literally flooded with more bad stocks than good ones, causing the investors to suffer repeated losses and abandon the market en masse. So, listing of profitable SOEs can inject a new life into the ailing market by enhancing the depth of the market and boosting investor confidence. \nAt the same time, it would directly benefit the SOEs themselves. Allegations of financial mismanagement and misappropriation have long dogged these entities. Public listing would require them to operate with greater transparency and professionalism, subject to regular disclosure of their financial status and governance standards. This could go a long way towards ensuring accountability, improving efficiency, competitiveness and long-term profitability. In many countries, the listing of state-owned enterprises has led to enhanced performance due to increased scrutiny and better management practices. For all these reasons, offloading the shares of SOEs could be a win-win situation for both the capital market and the enterprises themselves. However, this has so far remained a pipe dream. Although policymakers have long been tinkering with the idea, only a handful of SOEs have been listed to date.\nAgainst this backdrop, the government's instruction to ministries to promptly offload shares of profitable SOEs and government-owned shares of multinational companies (MNCs) offers a glimmer of hope. Reportedly, the Chief Adviser recently directed that necessary steps be taken to reduce government shareholding in these companies and include them in the capital market. Subsequently, officials prepared a list of profitable SOEs and MNCs for offloading their shares. It must be noted, however, that such moves were repeatedly initiated by past governments but failed to materialise, primarily due to alleged procedural complexities and the procrastination of officials managing these enterprises. Repeated reminders from high-ranking government officials during the past regime were all in vain.\nThe main point of contention has not been the decision to offload SOE shares, but the percentage of the stock to be made available to the public. It appears that a section of the bureaucracy and policymakers want to retain control of such enterprises even after they are publicly enlisted. If ordinary shareholders do not represent at least a 51 per cent stake in the publicly listed SOEs, they have no real say in the running of such enterprises. That means annual general meetings will be little more than an eyewash, with management approaching court and nothing tangible happening in terms of profitability or accountability. It is, therefore, high time to take concrete steps to divest the SOEs in a meaningful way. The manner in which it is done will determine whether the government is serious about turning things around for both the SOEs and the wider stock market, which urgently needs more blue-chip companies.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Urgency of listing SOEs on stock market",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/urgency-of-listing-soes-on-stock-market-1756051656",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       August 25, 2025 00:00:00  \n\nInflation rate in Bangladesh, which was 8.55 per cent in July, marked a 0.07 percentage point increase from that of June. However, the government in its budget for FY2025-26 expressed the hope that the inflation rate could be brought down to 6.5 per cent sometime in FY26. Whatever the future expectations, considering the rising trend of the prices of essential consumer goods, there is hardly any sign of decline in the inflation rate for now. And that is more so given the recently published Economic Update & Outlook of the General Economic Division (GED) of the Bangladesh Planning Commission. It says that the price of rice, the staple of the essentials, plays the key role in driving up the overall inflation in the economy. \nNotably, the rise in inflation rate in July compared to that of its previous month was accompanied with a simultaneous increase in food inflation by 0.17 percentage point pushing it to 7.56 per cent in July. The GED update further informs that the contribution of the rice prices to the rise in July inflation was significant. In this connection, the different types of rice contributed differently. For instance, the medium variety of rice contributed 24 per cent while the coarse rice contributed by 18.39 per cent respectively. However, there is yet another category of rice, the so-called fine type, the price of which also saw an increase, but that did not affect the general public much, because their main consumers were the people belonging to the middle and the higher income segment of society. However, the impact of the increase in the price of coarse rise on society is significant as this variety of rice is consumed mainly by the low-income section of the population. The GED update points out that price hike of all the three categories of rice have witnessed a price increase by around 15 per cent on an average, during the past months. The finer variety, for example, remained pricey over the 12 consecutive months, while the coarse and medium category experienced price escalation since December last year. So, according to GED, in pushing up the consumer price inflation in last July, rice prices' contribution was 50 per cent. Going by the market data provided by the Trading Corporation of Bangladesh (TCB), in July, the price of coarse rice in the capital city was between Tk 55 and Tk 60 per kilogram. Year-on year, it marked an increase by 7.48 per cent. Similar was the case with the prices of medium and finer varieties of rice. Against this backdrop, the government has decided to purchase 1.4 million tonnes of Boro rice locally during the four months between April 24 and August 31 of this year. \nIn the past fiscal year (FY2024-25), imports of rice, according to the central bank, Bangladesh Bank (BB) data, saw an unprecedented rise at the cost of US$682 million to the state exchequer. Compared to the rice imports of the previous fiscal, FY2023-24, which was worth US$25.40 million, FY25's imports marked close to 2,600 per cent rise over that of the previous fiscal (FY24). The BB's data were reportedly compiled based on the commodity-wise import statistics provided by the customs department. These imports were made both by the government and the private sector against the backdrop of devastating floods in August and September last year that caused an estimated damage of Aman crops to the tune of 1.0 million tonnes in 11 districts of Chattogram as well as in Sylhet and Mymensingh divisions, according to the Department of Agricultural Extension (DAE) data. Clearly, rice imports on such a staggeringly high scale in FY25 compared to those of the previous fiscal was made in a bid to enhance food stock and stabilise food-grain price in the market and thereby reduce inflationary pressure. But the trend of importing more rice has been showing no sign of letup seeing that as late as last Thursday (August 21), trucks carrying Indian rice started to enter Bangladesh through Benapole land port thereby resuming such import after a four months' pause since April last. According to reports, the import of mainly the coarse variety of rice from India is being made to stabilise rice market in the country. In this connection, it may be recalled that the food ministry on August 13 announced that it would allow some 242 private importers duty-free import of 0.5 million tonnes of rice and effect their supply in the market by September 30 so that the unstable rice market could be tamed. Since rice price is the main factor pushing up the inflation rate, it is hoped that the overall impact of it all would be a decline in the inflation rate. \nBut it is not just rice, the country's imports of overall food grains which included wheat (whose import, however, saw a significant decrease in FY25 by 20.1 per cent compared to that of FY24) also witnessed an overall rise by 12.1 per cent, according to the BB data. Other imports of food items included edible oils, sugar, milk and milk cream, spice, etc., which also recorded a 15.3 per cent rise in FY25 compared to those of FY24. So, one can arguably expect that adequate supply of rice and other foodstuffs in the market would contribute to containing inflation. But the real picture does not corroborate the fact.\nThough the inflation rate considerably declined last month to 8.55 per cent when compared to that of July 2024 at 11.66 per cent, the country still lags behind the performance (in bringing down inflation) of its neighbouring countries in South Asia. In Sri Lanka, a country in severe financial crisis in 2022, saw its inflation reaching a year-on-year peak at 69 per cent in September of that year. Later it fell gradually. The price of essentials, meanwhile, has dropped to 0.03 per cent. Similar is the story of Pakistan, which saw over 35 per cent inflation rate in 2023, which, of late, has come down close to 4.0 per cent. In India, the inflation rate has declined sharply to 1.55 per cent. in Nepal, it is at 2.72 per cent. So, why is Bangladesh still struggling despite a drastic fall in price in Thailand compared to a year ago. \nAfter all the imports of rice and other foodstuffs, those are still dear in the market with their levitating impact on inflation. This is beyond reason. Do economists and experts of Bangladesh have an explanation?\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Food price, inflation  defy reason",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/food-price-inflation-defy-reason-1756051710",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       August 25, 2025 00:00:00  \n\nWhen all roads lead to one destination, the consequent rush is unavoidable. In Dhaka, usually the commercial or administrative hubs are located at a stone's throw distance. Then the stadiums too are destinations of sport-enthusiastic fans, particularly on mega sports events. But one area of city life's regular rush that escapes notice is educational institutions, schools in particular. The problem here is the concentration of some reputed schools and colleges in some select areas. \nHeavy concentration of reputed educational institutions has its attendant ills. More people set up kindergartens and preparatory schools for tiny tots, promising their extensive and targeted schooling will help the learns to get admitted to their parents' desired institutions. However, this is just a part of the problem. Coaching centres also have a mushrooming growth. Sometimes, more adventurous and intriguing ones bring out coloured posters of students who have successfully passed out from their facilities and been placed in top positions in medical college, engineering universities and universities like University of Dhaka (DU).\nSo, the proliferation of educational institutions continues and there is also an unwritten competition for residential accommodation as close-by as possible among the families fortunate enough to have their wards admitted to educational institutions in such localities. So the rush gets heavier in the morning, at noon and also in the evening. But not all families are equally fortunate enough to reside in the area within walking distance or around tit. Some have to commute long distance to get their boys and girls attend classes on time. Those who have private cars at least enjoy the luxury of comfortably travelling but not without hassles. Dhaka roads are infamous for waterlogging on account of a small shower and the cars too get stuck in the long tailback. \nNow the atrocious urban-rural divide is commonly known but the divide within a city or cities in this country also prevails quite pronouncedly. Urban planning has neglected rational distribution of schools, colleges, universities, administrative and commercial hubs, hospitals and health clinics. One positive development happened in recent times. This is the relocation of private universities to their own campuses away from Dhaka. Yet a few are still struggling to provide the right geographical space and an environment suitable the institutions of higher education. \nIn advanced countries, not only are the highest seats of learning well distributed but also the schools are made to maintain a more or less uniform standard. Paris is divided into boroughs and no student can get admitted to schools located to one other than his/her own. This is how they limit city rush. This country has gone for concentration of its top set-ups in every area of life in Dhaka. This has to be gradually decentralised in the interest of not only economy but also in the interest of its people. This is the central point of reducing social discrimination. The best way to address the problem is to bring about some kind of uniformity in the standard of primary and secondary education in schools. \nOn this count, no government ever has made any serious attempt. But time has come for making move to this direction in order to bridge the yawning gap in educational standards and opportunities. Also, the location of educational institutions should be selected on the basis of accessibility and peripheral areas. One of the criteria ought to be the system of decent bus service instead of allowing private cars to cram the city streets. True, all this cannot be done overnight but if the government proceeds under a well-crafted plan, things can get better within a time limit. Hopefully Bangladesh will prioritise bridging the educational gap in the national interest.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Decentralisation and standardisation of school education",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/decentralisation-and-standardisation-of-school-education-1756051893",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 25, 2025 00:00:00  \n\nGeneration Alpha, born roughly between 2012 and 2025, represents today's youngest children. Though aged 10-13, many display behaviors that feel inconsistent with their age - alternating between confidence and deep insecurity, often labelled as \"overly sensitive.\"\nSeveral factors contribute to this heightened sensitivity. From birth, they are exposed to digital devices, spend little time outdoors, and have fewer opportunities for real-life socialisation. Urban lifestyles, busy parents, overindulgence and the COVID-19 pandemic have further increased screen time and reduced direct human interaction.\nThis hypersensitivity is not merely harmless. It can lead to emotional volatility, shorter attention spans, frustration over minor setbacks, weakened family bonds, and dependence on instant gratification. A child constantly told \"you are the best\" may struggle to cope with criticism or failure, while lack of outdoor activities limits teamwork, problem-solving and resilience.\nAddressing this issue requires balanced parenting - a combination of love and measured discipline. Parents should show affection while avoiding the urge to fulfill every demand immediately, teaching patience instead. Encouraging children to handle tasks appropriate to their age, such as organising their belongings, helps build independence. Participation in sports, cultural programmes, and group activities develops social skills, resilience and the mentality to accept defeat. Reducing screen time in favour of reading books, practising art, music, or other constructive hobbies nurtures creativity and focus. Finally, acknowledging feelings while guiding children to handle frustration calmly fosters emotional resilience.\nA famous saying reminds us: \"Children of today are the future of tomorrow.\" To ensure a strong, balanced next generation, we must combine affection with boundaries. Loving wisely, rather than overindulging, is the key to raising the Generation Alpha to thrive in an increasingly complex world.\nLaboni Akter Kobita\nJagannath University, Dhaka\nlaboniakterkobita6@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Generation Alpha: Highly sensitive",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/generation-alpha-highly-sensitive-1756051923",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-08-2025"
    }
]