[
    {
        "full_article": "The Prime Minister Dhan-Dhaanya Krishi Yojana (PMDDKY), a scheme approved by the Union Cabinet, is to be implemented through the convergence of 36 existing schemes across 11 Departments. According to Union Agriculture Minister Shivraj Singh Chouhan, the scheme seeks to address the “disparities in productivity” between States, and even among districts within a State. The Centre’s pet schemes such as the Pradhan Mantri Kisan Samman Nidhi (PM-KISAN) and the PM Fasal Bima Yojana (PMFBY) as well as relevant State schemes, to be identified by the District Dhan Dhaanya Samitis, will be subsumed in the PMDDKY. Local partnerships with the private sector will also be promoted under the proposed scheme, which will begin in October during the rabi crop season. The scheme is to get an annual outlay of ₹24,000 crore for six years. Modelled on NITI Aayog’s Aspirational Districts Programme, the Centre will identify 100 districts based on low productivity and cropping intensity and less credit disbursement. The hope is that the scheme will result in higher productivity, value addition in agriculture and allied sectors, local livelihood creation, leading to increased domestic production and self-reliance. This convergence of schemes must be viewed in the background of decreasing public spending on agriculture. The Parliamentary Standing Committee on Agriculture, in the latest report on Demands for Grants, had observed a continuous decline, from 3.53% in 2021-22 to 3.14% (2022-23), 2.57% (2023-24), 2.54% (2024-25) and 2.51% (2025-26), of the allocations for agriculture as a percentage of total Central Plan outlay.This aggregation of all schemes under one umbrella suggests that the Government wants uniformity in running the welfare, financial and technical schemes in the agriculture sector. It is keen to add States’ measures too in the new scheme. It remains to be seen how effective such uniformity will be on the ground as further decrease in public investment in agriculture could be disastrous. Private-public partnerships should be for the larger good of self-reliance, particularly in the production of foodgrains, edible oil and pulses. The progress of area coverage under kharif crops, released last week, points to a decrease in the sowing of oil seeds and popular pulses. Though it promotes national uniformity, it is welcome that the new scheme will function based on ‘District Plans’ that will be aligned to the national goals of crop diversification, conservation of water and soil health, self-sufficiency in agriculture and allied sectors. For the PMDDKY, the Centre will monitor 117 key indicators of progress on a monthly basis. But to make it more participatory, States, local self governments, primary agriculture cooperative societies, agriculture universities and organisations of farmers and traders must be involved in this process. Published - July 19, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        agriculture\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        welfare\n                    \n                            /                      \n                        \n                        finance (general)\n                    \n                            /                      \n                        \n                        technology (general)",
        "headline_1": "​All in one: On the Prime Minister Dhan-Dhaanya Krishi Yojana scheme",
        "headline_2": "Agriculture needs more public spending, not just one umbrella scheme",
        "link": "https://www.thehindu.com/opinion/editorial/all-in-one-on-the-prime-minister-dhan-dhaanya-krishi-yojana-scheme/article69828378.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-07-2025"
    },
    {
        "full_article": "For many cricket lovers in Bengaluru and Karnataka, the one lingering disappointment was the persisting failure of Royal Challengers Bengaluru to win the Indian Premier League (IPL) trophy. Virat Kohli may have been king across the world but in the IPL he was not, until a dramatic change of fortunes at the very end of his career. The cup win in 2025 was to be the crowning glory of Kohli, RCB, and, eventually, Bengaluru itself. But tragically enough, the stampede at the M. Chinnaswamy Stadium during the victory celebrations on June 4 upended that glory. In its probe of the stampede that killed 11 and left 71 injured, the John Michael D’Cunha Commission has come down severely on the RCB management and the police. It has pinpointed the cause as “not regulating the entry into the gates and making reckless announcements with regard to the entry into the stadium”. It has named many and recommended legal action against them while discussing how such gatherings can be made safer and the medical backups that may be required. But its terms of inquiry were limited and missed the bigger picture. Blame must be apportioned to all stakeholders who just did not think of the consequences of calling for such a large gathering and going ahead with it without the permissions and arrangements. The police must be faulted for not beefing up the arrangements at the stadium’s entry and exit points. But it may not be fair to blame them for allowing the event — it had practically become a fait accompli as the administration was going along with the celebrations and the euphoria.The stadium event was among the three planned that day. As if to kick off the celebrations, Karnataka Chief Minister Siddaramaiah felicitated the team in an open-air event outside the Vidhana Soudha in the morning. These celebrations set the tone for what unfolded that day. To their credit, the police did refuse to allow the planned victory parade on an open bus. And at the Vidhana Soudha, where only a few among the lakhs who had gathered got to see their favourite stars, an announcement was made that people could proceed to the stadium which has a seating capacity of just 32,000. In a broader sense though, the stampede was a reflection of the realities of urban life too, where massive flash crowds can generate from communities sharing a common passion and kindled by social media. Urban planners and managers have little clue on how to handle such mobilisations, which have resulted in stampedes at religious, social and cultural events, leading to the loss of hundreds of lives.\r Published - July 19, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        cricket\n                    \n                            /                      \n                        \n                        Indian Premier League\n                    \n                            /                      \n                        \n                        bengaluru\n                    \n                            /                      \n                        \n                        accident (general)\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        urban planning",
        "headline_1": "Taking responsibility: On the stampede in Bengaluru",
        "headline_2": "Karnataka government must share the blame for the stampede",
        "link": "https://www.thehindu.com/opinion/editorial/taking-responsibility-on-the-stampede-in-bengaluru/article69828011.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-07-2025"
    },
    {
        "full_article": "Earlier this week, the Amarnath Yatra, which witnessed a record turnout this year, was suspended after a woman was struck by a falling rock. Three weeks ago, a tourist bus carrying pilgrims to Badrinath fell into the Alaknanda river, killing four and injuring several other passengers. Around the same time, landslides along the Yamunotri route killed two on the way to the shrine. A day later, a helicopter heading to Guptkashi ferrying pilgrims from Kedarnath crashed, killing all seven on board. The recent Jaganath Puri Rath Yatra attracted more than 14 lakh visitors but the crush of people left three dead.\nWhy are religious festivals, yatras and temple tours now so congested and prone to tragedy? How has the private act of devotion turned into a noisy, lethal affair of crowd management? Can religion practised at such a monumental scale even be considered sacred anymore?\nInconvenience was once a crucial hallmark of any pilgrimage. In earlier days, when the Char Dhams were not connected by four-lane highways, when Vaishno Devi could not be approached by helicopter, and when the Tawang Monastery in Arunachal Pradesh didn’t have luxury hotels at its doorstep, people walked. They trekked long distances on torturous mountain paths with narrow footholds, often camping in forests or along routes with barely any facilities. So selfless was the devotion that no pilgrimage was too arduous or painful. People moved slowly on foot, the old and infirm on horseback, making a journey in hope and uncertainty. God required the tedium of distance, patience and discomfort. Without it, what was the point?\n\nHoly Rush: Every year, the crowds increase as do reports of landslides and mishaps\nToday, travel to two of the country’s most venerated places has changed dramatically. The approach to the Kashi Vishwanath temple in Varanasi was once through a torturous medley of narrow, disjointed streets that made the passage a difficult pilgrimage of discovery. Since the construction of the Kashi Vishwanath Corridor, the walk has been broadened, linking the city road approach to the river with a mix of local commerce — sari emporia, restaurants, sweet shops, and minor hotels. So too with Ayodhya. You fly out to the newly built airport, stay at a pre-booked hotel, visit the temple, eat out at a choice of restaurants, and live in relative comfort. Much the way you would at Disneyland or Niagara falls. Both places, more curated tourism than inconvenient pilgrimage.\nPerhaps this is inevitable, given the sheer numbers. In 1980, the annual number of visitors to Vaishno Devi was nine lakh. Now, the figure stands at almost a crore. The Amarnath Yatra saw one lakh devotees in the first six days before its suspension due to landslides. These phenomenal increases are not just a reminder of population statistics, but point to the increasing commercialisation of religion. Pilgrimage has become a kind of spiritual bucket list, a series of checkboxes on life’s tourist map: Two Char Dhams done, two more to go. Ayodhya—checked. Next up, Amarnath and Kailash Mansarovar.\nAdd to that the relentless pace of urbanisation in India’s hill regions and the growing incidence of extreme weather events, and you have a recipe for more landslides, avalanches, swollen rivers, and flash floods. State govts will fall back on standard make-shift measures: widening trails where possible, proposing better crowd management, and increasing security personnel along routes. But without imposing controls on the number of pilgrims, these efforts amount to little. What’s needed are strict caps on the number of daily visitors to match available facilities. More important is the removal of all forms of quick-access conveniences like ropeways or helicopter services so that pedestrian trails become the only option to sacred sites. Finally, there is a need to shut select temple and pilgrimage locations where excessive footfall is causing structural damage to buildings and the environment.\nNow that commerce is deeply entwined with religion, the line between pilgrimage and tourism has all but disappeared. The sacred is increasingly packaged as a spectacle—easy to reach, easy to consume. As a result, more people will continue to flock to temples, shrines, and sacred rivers. But in the process, their sanctity may be lost forever.\nSoon, the hills around Rishikesh are going to be added to another yatra on the pilgrimage map. A small, insignificant ashram that the Beatles visited in 1968 with Maharishi Mahesh Yogi is to be refurbished into an international tourist attraction. Will Paul McCartney and Ringo Starr come for the inauguration? Will the Ambassador car they travelled in be upholstered with new seats? Some forgotten pilgrim places are best left forgotten or, at best, marked by a small plaque on a wall.\n\n",
        "headline_1": "The perils of pilgrimage in the age of the spiritual bucket list",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-perils-of-pilgrimage-in-the-age-of-the-spiritual-bucket-list/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-07-2025"
    },
    {
        "full_article": "A controversy of sorts erupted recently after home minister Amit Shah’s declaration at a book launch in Delhi that “those who speak English will soon feel ashamed — the creation of such a society (in India) is not far away.”\nThe comments attracted widespread criticism from the opposition, which accused Shah of pushing the RSS’s agenda of cultural domination. Congress leader Rahul Gandhi said the BJP-RSS did not want underprivileged children to learn English and make progress to become equal.\nSo, what does it mean when a powerful politician hints at shaming people for speaking the language of colonial masters? Is it an unpleasant yet necessary process of the much-needed linguistic decolonisation of our minds, as Shah claims?\n\nCredit: Chad Crowe\nOr is it clever political messaging meant for the vast majority of aspiring young men and women from small towns and villages who speak in the ‘vernacular’ and hold an irrational grudge against the English-speaking class living in metropolitan India?\nJust to contextualise, the etymology of the word ‘vernacular’ is interesting: it is derived from the Latin word ‘verna’, which means a slave born in his master’s house. One of the other variants derived from ‘verna’ is ‘vernaculum’ — a low-bred person or proletarian.\nI was made aware of my ‘vernac’ identity many years ago when an acquaintance hurled the word at me as an insult. He spoke rather fluent English and kept referring to Hindi speakers as ‘vernacs’ — a derogatory term to describe those who speak in the vernacular. I, on the other hand, was trying to argue with him in Hindi — the language I am most comfortable in.\nBut my combative antagonist was not willing to stoop to my level by answering in the language of the general hoi polloi. Around the same time, I was offered a job in an upmarket English-language news magazine. But my excitement came crashing down in the very first editorial meeting.\nWhile colleagues were rattling off story ideas in their clipped accents and perfect diction, peppering their pitch with public school jokes, I forgot my well-rehearsed lines when my turn came, and could only manage to mumble a few words in Hindi.\nSuddenly, a thick pall of oppressive silence fell in the editor’s room. I could see embarrassed faces all around me; some colleagues looking down at the floor to avoid eye contact. The sacrilege had been committed.\nA yokel had sneaked into the ‘Exclusive Club of the English-speaking Gentry’ and defiled it with his lowbrow ‘vernacular’, or so I thought. That was my first embarrassing encounter with linguistic shame.\nDr Lori Gallegos, professor of philosophy at Texas State University, defines linguistic shame as something that “involves feelings of embarrassment, a sense of inferiority, and attitudes of self-reproach that arise in relation to the way one speaks.”\nShe equates linguicism with other forms of discrimination, like racism and sexism. Apart from direct linguicism, which is still practised in some South Asian convents and public schools, there is another form of discrimination where “people implicitly view those who do not speak English as uneducated or unintelligent.”\nPM Modi himself faces this kind of glottophobia regularly when he is mocked for mispronouncing an English word or phrase. Amit Shah’s son, Jay Shah, is also trolled for his lack of fluency in English. Against this backdrop, Shah’s unapologetic reverse linguicism — though one is not justifying it — becomes somewhat understandable. Ironically, Shah was echoing the sentiments expressed by the celebrated Kenyan-American Marxist writer Ngugi wa Thiong’o, who died last month.\nThiong’o shunned the English language back in the 1970s and declared that in future, he would only write in his mother tongue, Gikuyu. It was his way of protesting against the imposition of the language of the colonial masters, which he described as a “cultural bomb”.\nSo, when the wider Sangh Parivar eulogises India’s past, it may appear to be rejecting the effect of the ‘cultural bomb’ as described by Thiong’o, but there’s a big difference between the two.\nWhile Thiong’o sees English and many other European languages as an assault on native African languages, the Hindutva narrative is more selective in its approach. Urdu, an out-and-out Indian language, is as much an anathema to them as English.\nA more troubling thought is how such rhetoric could encourage the right wing’s vast army of foot soldiers — often drawn from under-educated and poor marginalised castes who resent the English-speaking elite.\nSome of them have taken on the role of cow vigilantes who patrol highways. This foot soldier could now potentially have another assignment as a bhasha rakshak dal (defenders of language) vigilante — going from room to room in Delhi Gymkhana or the swanky clubs in South Mumbai, or inspecting seminar halls in universities and the India International Centre to check if the speakers are ashamed enough while delivering a speech in English.\nShould that dystopia become a reality, will the angreziwallas be then forced to form secret societies where one could only whisper in a language that shall not be named?\n\n",
        "headline_1": "Revenge of the vernac! Time to mind your angrezi, mister",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/revenge-of-the-vernac-time-to-mind-your-angrezi-mister/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-07-2025"
    },
    {
        "full_article": "“What’s in a name?” asks the Bard, dismissively.\n“What things are called is unspeakably more important than what they are,” counters Nietzsche, while not disputing the sweet smell of a rose by another name.\nNietzsche was not talking about cricket, but he had a point. Consider the Pataudi Trophy, awarded to the victor of India-England Test series contested in England. Starting this summer, the winner will receive the Tendulkar-Anderson Trophy. But why not the Anderson-Tendulkar Trophy? Robotic alphabetic convention can neatly sidestep national pride issues, as with the Border-Gavaskar Trophy. Presumably, the ECB recognised where power resides and compromised. Vastly different from the height of the Empire in 1932, which is when our story unfolds.\nIftikhar Ali Khan was the eighth Nawab of Pataudi, now part of buzzy Gurgaon. Pataudi was a poly-athlete who made his mark at Oxford—he read history at Balliol—by clocking 100 metres in under 10 seconds when that meant something. He went on to earn Blues for hockey and cricket. Pataudi had attitude to complement his talent. In the 1931 annual Varsity Match at Lord’s, Alan Ratcliffe scored an impressive 201 for Cambridge in the first innings. “A fine innings, but I can go one better,” said the Nawab. He did. An unbeaten 238 which Wisden called “majestic” while noting Pataudi’s “perfect judgement and timing.”\nAfter scoring 1307 runs for Oxford at a Bradmanesque average of 93, the 22-year-old Pataudi made his England debut against Australia, playing his first Test at Sydney in early 1933. He batted at Number 4 and scored 102. According to Wisden, he played with “quiet authority” and his innings was “one of the best seen by an English batsman in Australia that winter.” In a team that included all-time greats Sutcliffe and Hammond. After the match, Pataudi asked Aussie umpire George Hele for a bail as a keepsake. Hele did better and offered him a match ball. The grateful Nawab presented Hele with a gold wristwatch. Noblesse oblige.\nBut the Sydney Test was historic for a different reason. For the first time, MCC captain Douglas Jardine deployed his controversial ‘Bodyline’ strategy. Led by Bradman, the Aussies had won the Ashes in 1930, with the great one scoring two double centuries and a triple hundred. The English were unaccustomed and sore losers. To combat the greatest run machine in history, Jardine, the patrician from Winchester and Oxford and captain of the MCC, became a thuggish street fighter. Worse, he deployed Harold Larwood, his strike bowler and a coal miner’s son, to do his dirty work. Since they couldn’t get him out, England decided to intimidate Bradman by bowling at his body—in an era without helmets—with a packed leg side field. Aussie wicketkeeper Bert Oldfield suffered a cracked skull. Captain Bill Woodfull was hit above the heart but refused to retaliate. “There are two teams out there. One is playing cricket. The other is not,” he famously said. Bradman ducked into a short ball and was bowled off his body at Melbourne, but scored an unbeaten century in the second innings and averaged 57 for the series anyway.\nHammond was privately critical but did not raise his voice. Gubby Allen refused to bowl at the body, but the ‘Englishman’ who confronted Jardine most directly was our man from Gurgaon. He refused to field at leg slip and did not join team huddles when Aussie wickets fell. “I see His Highness is a conscientious objector,” quipped Jardine, mockingly.\nJardine did not eject Allen, who was as much establishment as he was, but turned his ire on Pataudi, who was not just colourful but, in the eyes of the Bombay-born Jardine, coloured. He dropped Pataudi. At the end of the tour, the Nawab had this to say about his captain. “I am told he has his good points. In three months, I have yet to see them.”\nShamefully, the MCC made Larwood the scapegoat and demanded he apologise. Larwood refused, saying he merely followed orders. He never played for England again. Ironically, he emigrated to Australia where Jardine remains the most vilified Englishman. Bradman, of course, kept on doing Bradman things.\nThe rule changes following Bodyline survive. Only two fielders can be behind square on the leg side and onfield umpires can intervene to prevent dangerous bowling.\nAs for our hero, he captained India against England at Lord’s in 1946 and became the only player to represent both England and India. But at this point he was 36, and past his prime. His legacy was proudly maintained by the dashing ‘Tiger’ Pataudi. Like his father, Tiger was a middle-order batsman—evidently, nobility favours batting over bowling—who led India to its first overseas Test victory. There is no record of Tiger presenting gold watches to umpires, but, remarkably, he played 46 Tests after losing his right eye in a car accident at age 21.\nTendulkar and Anderson are names writ large in record books and will never be forgotten. But the Pataudi name stands for something that, in the words of Nietzsche, is “unspeakably important”. We should remember it.\n\n",
        "headline_1": "The Pataudi Trophy has a new name, but we should remember what he stood for",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/voices/the-pataudi-trophy-has-a-new-name-but-we-should-remember-what-he-stood-for/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-07-2025"
    },
    {
        "full_article": "Fasting, personalised nutrition, regular exercise\nLongevity is the new new holy grail. Naturally, therefore, the market offers magic diets, pills and exercises promising a sure-shot path to healthy nineties – and beyond. Thing is, the science of longevity is still largely a mystery. Outlive: The Science & Art Of Longevity by Peter Attia breaks it all down helpfully. Turns out we intuitively know some of the hows, but we don’t quite get the whys.\nThe problem, Attia says, is with the approach of current medicine – described as Medicine 2.0 – that has become very adept at staving off death by months or years, but not prolonging lifespan or healthspan. This is because modern medicine intervenes too late – when disease has already taken root. What’s needed, per the book, is Medicine 3.0, which identifies markers of disease based on a person’s unique genetic and medical history, and intervenes way before actual disease sets in. This approach has the potential to change the last bits of most people’s lives – 70s or 80s – into productive disease-free years or even bestow us with a bonus decade that could see us make it to healthy nineties.\nWhat’s needed though is a system-wide reorientation. Greater medical focus on prevention. And tweaking health insurance so that it covers preventive treatments. Sounds a lot. But the effort is well worth it, the book argues. It addresses the Four Horsemen of bad health – heart disease, cancer, neurodegenerative disease, and Type 2 diabetes and related metabolic dysfunction. Understanding how to keep them at bay is key.\nThe book offers plenty of scientific clues. For example, one possible longevity gene that has emerged in multiple studies of centenarians is FOXO3 and its variants. The gene actually regulates other genes that maintain cellular health. And guess what! FOXO3 tends to be more active when we are slightly deprived of nutrients or when we are exercising.\nSimilarly, rapamycin, the miracle molecule that was discovered on remote Easter Island but is now a mainstay of transplant medicine, works on the intracellular protein complex called mToR, which plays a key role in longevity at the cellular level. When food is plentiful, mTOR is active and cells go into growth mode. When food is scarce, mTOR is suppressed and cells go into recycling or cleaning mode, making them more resilient. This bit of science on cellular mechanisms supports the logic of fasting to promote health.\nExercise is the most powerful longevity drug, the book says. But it’s not about strength training vs cardio. Instead, think about the 10 physical activities you want to be doing in your eighth or ninth decade and work back to determine how much fitness you should have now. To lift a 20kg suitcase overhead when you are older means being able to lift a 40kg suitcase now. Exercise can reverse both physical and cognitive decline. And almost any kind of exercise is better than none at all. High aerobic fitness and strength are linked to longer lifespan. The more aerobically fit you are, the more your body will be able to use oxygen to generate ATP – the chemical that powers our cells.\nAttia warns against a dogmatic approach to diet and wants the term replaced with nutritional biochemistry. Each of us reacts to food molecules in a different way. So the same diet can produce different results. Hence, nutrition has to be highly personalised and pegged to our own unique health parameters. Decode yourself, eat right, do the brisk daily walk – live long.\n\n",
        "headline_1": "How To Live Long, Minus Disease",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/how-to-live-long-minus-disease/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 20, 2025 00:00:00  \nThe Supreme Court's recent move to make company court proceedings fully digital is a much-needed step toward a more efficient and honest justice system. With paperless processes already introduced in one court and soon expanding to the other two courts that deal with company matters, it is clear there is a genuine commitment to using technology to make things better. Even today, handling disputes in court often involves endless paperwork, chasing after missing files, bureaucratic delays and, unfortunately, opportunities for unfair practices. Consequently, many people in the country take advantage of these loopholes and come to view and treat the law as a mechanism for prolonging disputes instead of resolving them. Digitising company courts as a solution to some of these long-standing problems may therefore prove to be not only effective but also a timely step toward bringing the delivery of justice into the modern age. \nAt the moment, just three High Court benches handle the legal affairs of more than three lakh registered companies in the country. These benches are overloaded with over 20,000 pending cases, along with other types of legal disputes they have to contend with. This creates a long wait for justice. Making matters worse, the traditional system is plagued by corruption at nearly every stage of the process. Whether it's getting a case onto the cause list, having an order typed or simply collecting a signed copy from the judge's chamber, bribes are often demanded at every turn. Shockingly, even the morning submission of hearing slips, approved by judges, often turns meaningless as bench officers allegedly drop cases from the day's list. Digitisation, in this context, could be a game-changer. When all case records and procedural steps are logged online, there is little room for tampering. Judges can then oversee case progress directly and keep tabs on the process in real time. On top of that, storing documents digitally eliminates the need for physical storage, thus saving valuable space. It would also reduce printing costs for both lawyers and clients. \nThis move toward digitisation should be just the beginning. If it works well in company courts which it should, it must be expanded to other parts of the judiciary including the lower courts where millions of cases remain stuck for years. As the saying goes, justice delayed is justice denied, and for far too long, delays and corruption have made people lose faith in the court system. That said, going digital alone would not solve the backlog problem. It can certainly make things run more smoothly and help reduce the delays, but with too few judges, the pile-up of cases won't simply go away. Only through the appointment of extra judges can the judiciary realistically expect to reduce the backlog and ensure timely dispensation of justice.\nThe drive for digitisation must go hand in hand with efforts to make justice more accessible by decentralising the courts. Many residents in remote areas struggle to attend proceedings in district-level courts, leading to delays and higher expenses. Gradually shifting lower courts to the upazila level and establishing High Court benches to every divisional headquarter could solve this issue by bringing justice closer to communities. This would save time, cut travel costs and make the legal system less intimidating for ordinary citizens. If people can bank on their phones and access healthcare in their villages, why should seeking justice require such long journeys? A court system that is both digital and decentralised can ensure a justice delivery process that is easier, faster and fairer for them.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Justice goes digital",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/justice-goes-digital-1752937625",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       July 20, 2025 00:00:00  \n\nAre the foreign investors sensing a gradual improvement in the country's business climate? Did the much-hyped four-day investment summit in April instil some confidence in foreign businesses to invest in Bangladesh now? These two questions seem pertinent in light of the data released by the central bank'for the third quarter of the past fiscal year (FY25) regarding foreign direct investment (FDI). It showed that the net inflow of FDI jumped significantly in the third quarter (January-March) of FY25. \nThe big jump is presented in the newspapers with various attractive headlines, as if something significant has happened. One daily writes: ''FDI hits 2-year high in Jan-Mar''; another heading goes like this: ''FDI surges despite economic headwinds.'' Central bank statistics showed that the net inflow of FDI stood at around $864.63 million in Q3 of FY25, which was 114.31 per cent higher than the net FDI in the same period of FY24 and also 76.31 per cent more than the amount in the immediately preceding quarter, Q2 of FY25. The latest quarterly net FDI is the highest amount of quarterly FDI in the last five years. It also indicates an improvement in the foreign investment situation, although some caution is necessary regarding interpretation of the jump.\nAs the full-year FDI data is not available for FY25, one needs to review the data for the first three quarters or first nine months of the fiscal year and compare it with the previous fiscal years to get a broader picture. Bangladesh Bank statistics showed that net FDI in the first nine months (July-March) of the past fiscal year stood at $1459.36 million (or $1.46 billion). It is approximately 26 per cent higher than the same period of FY24, mainly due to a surge in FDI in the third quarter of FY25.\nCentral bank data further showed that FDI surged after a decline in two consecutive fiscal years (FY23 and FY24). Although FDI data for the last quarter of FY25 is yet to be available, it is clear that the full-year FDI will be significantly higher than the previous year, as the nine-month FDI in FY25 has already surpassed the yearly FDI in FY24. Bangladesh Bank statistics also showed that net FDI in FY23 declined by 6 per cent to $1.60 billion from $1.71 billion in FY22 and further dropped by 11.80 per cent in FY24 to $1.41 billion. \nThe latest surge in FDI is unrelated to the investment summit or the various activities of the Bangladesh Investment Development Authority (BIDA). Speaking to the media, the BIDA chairman made it clear that the investment promotion agency played a limited role in the recent rise in FDI inflows, as most of the decisions had been made earlier. His acknowledgement is admirable, as people got used to a culture of taking all the credit by politicians and bureaucrats without doing any real work. \nThe Q3 of the last fiscal was a comparatively stable period after the post-July disruptions. The first quarter of FY25 passed through the most unstable period in recent Bangladesh history. In this quarter, a student-led mass uprising in the country compelled Sheikh Hasina to step down and flee on August 5 last year. In the three weeks of mass movement, which had erupted on July 15, witnessed a brutal suppression by the Hasina regime. Law enforcers and security forces killed around 1,400 people, injured more than 20,000 people. Lots of property were damaged. After the fall of the regime, the country descended into anarchy for some time, and the interim government struggled to restore normalcy. \nIn the third quarter of FY25 a relative stability returned. The business climate also started to improve, although not enough to attract new investment. This is also reflected in the inflows of FDI, as around 47 per cent of the total investment came from intra-company loans, 22 per cent from reinvested earnings, and 31 per cent through equity capital. Nevertheless, the increase in FDI helped support the balance of payments (BoP), providing a sense of reassurance about the country's economic situation. \nIt is worth noting here that the inflow of FDI dropped significantly in the last two fiscal years under the ousted Hasina regime, indicating country's limited capacity to attract FDI despite some policy support and considerable rhetoric of development aired by the ruling party leaders. Now, the course is reversing slowly, which is a positive development. \nMeanwhile, the foreign debt situation in Bangladesh has also improved modestly in the first nine months of the past fiscal year. The stock of the national external debt increased by approximately 6 per cent at the end of the third quarter of FY25 compared to the same period in FY24. However, compared with the end of FY24, the stock of external debt increased by around 1.31 per cent at the end of March this year. \nOver the years, the country's debt-to-GDP ratio has increased gradually. The ratio was 15.60 per cent in FY17, which increased to 22.60 per cent in FY24. The figure for FY25 is still not available. Although the ratio is considered safe, the burden has been growing over the years, and it is not possible to reduce it all at once. It is worth noting that at the end of FY24, total public debt stood at 37.62 per cent of GDP, comprising 21.52 per cent from domestic sources and 16.10 per cent from external sources.\nCurrently, around 80 per cent of the country's external debt is public debt, which was approximately 75 per cent a decade ago. The rise in public external debt is mainly due to the past government's excessive borrowing from external sources to finance various development and mega projects, mostly at inflated costs. Thus, long-term debt servicing liabilities have also increased. The country's per capita external debt crossed $600 in FY24, up from $258 in FY16. \nThe finance ministry projected that public sector external debt-to-GDP ratios would remain steady at around 15.74 per cent in FY28. The Medium-Term Macroeconomic Policy Statement: FY2025-26 to FY2027- 28, however, cautioned that though the country's debt-to-GDP ratio is currently within the IMF's safe threshold, the upward trend \"necessitates careful monitoring and proactive measures to ensure long-term fiscal sustainability and to safeguard socioeconomic development. Addressing the challenges of low revenue Mobilisation and rising debt servicing costs will be crucial for maintaining a stable and growing economy.\"\nThe UN Trade and Development (UNCTAD) has developed a dashboard that helps make insightful comparisons across countries, regions, and special country groups, including those based on development status and public debt. It showed that in many key debt-related indicators, Bangladesh is behind the average status of Least Developed Countries (LDCs). \nThe latest slowdown in external debt is a temporary phenomenon. Debt management in the coming days will be more challenging. In that case, attracting more FDI is necessary to reduce the burden of external debt in the long-term.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "FDI and external debt  management",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/fdi-and-external-debt-management-1752937844",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       July 20, 2025 00:00:00  \n\nA heroic scene was enacted in the capital's Wari area on last Sunday when collective action of local people saved a boy's life and led to the apprehension of two members of a teen gang. It happened in the rush evening hour when a 17-year-old boy found himself surrounded by a group of teenagers who began assaulting him with machetes. At one stage, the attackers picked up a brick and tried to hit him on the head, which was chillingly similar to the gruesome murder at Mitford area just a few days back. \nAt that critical moment, the public could no longer remain passive. Driven by a sense of duty and community spirit, local people bravely confronted the gang, undeterred by the fact that the attackers were armed. Their courage and unity not only saved a life but also served as a powerful example of what collective resistance can achieve, especially at a time when crimes like mugging and extortion are becoming increasingly common.\nIn spite of a growing clomour over the country's deteriorating law and order situation, there is no sign of improvement. Nor is police action very effective. And it is not possible for the police to patrol all the streets at all times. Nor the police can be expected to do so in the normal course of things. Therefore, minimising the incidence of crime should be everyone's responsibility.\nConsider two recent incidents - one in the Wari and the other in Mitford - occurring just days apart. The incident in Wari is a story of courage and heroism, while the tragedy in Mitford stands as a stark reminder of our collective failure. The brutal, broad-daylight murder of Sohag, a small trader in the Mitford area, shocked the nation. The act itself was savage, but perhaps even more disturbing was the inaction of bystanders, many of whom chose to record the incident on their phones instead of coming forward to save the victim. The tragedy might have been averted if the onlookers had shown the courage to intervene.\nCrimes should be resisted from within society, since a crime harms not only its individual victim but the entire society. Often it is found that a victim of robbery or attack screams and cries out for help but no one rushes to his rescue. When a person is attacked or robbed in public and no one comes to their aid, it not only endangers the victim but erodes the social fabric. It's understandable that individuals fear for their own safety, but such inaction only emboldens criminals further.\nThe residents of Wari, in standing up to the attackers, have set an inspiring example. When communities unite, crime prevention becomes a lot easier. Given the alarming rise in extortion and rent-seeking, the residents in every locality should consider forming local committees to resist criminals and ransom seekers. A similar community-led resistance against robbery was seen following the August 5 unrest in 2024, when citizens took to the streets in the middle of the night to guard against robbers.\nAnother pressing issue is the harassment of young girls on their way to and from educational institutions. In many cases, individuals who spoke out against such harassment were themselves attacked - and in some tragic instances, even killed. These incidents underline the need for community-wide action. If a whole community acted together, the hoodlums could be easily dealt with. \nThis is not to suggest that local resistance should replace the responsibilities of law enforcement. On the contrary, crime control becomes far more effective when mutual trust and cooperation exist between the police and the public. Unfortunately, that trust has long been missing. There are numerous recent instances where common residents have nabbed and overpowered the criminals, but then they take the law into their hands and lynch the criminal instead of handing them over to the police. This shows the danger of public distrust in law enforcement agencies.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Forging resistance against crime",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/forging-resistance-against-crime-1752937947",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 20, 2025 00:00:00  \n\nFood safety is a fundamental human right, yet millions of children in Bangladesh are unknowingly exposed to adulterated and contaminated food products every day. This silent crisis is not only a public health emergency-it is a direct threat to our nation's future. \nChildren's physical and mental development depends heavily on access to safe and nutritious food. Alarmingly, many commercially available products marketed for children are laced with toxic substances, harmful chemicals, and artificial dyes. These contaminants can cause a range of serious health issues, from foodborne illnesses and cancer to kidney damage, neurological disorders, and developmental impairments.\nAccording to the World Health Organization's 2023 report, around 600 million people globally fall ill from foodborne diseases each year, resulting in 420,000 deaths-a significant proportion among children being under five. In Bangladesh, this danger is compounded by the widespread availability of substandard and unsafe food.\nIt is, therefore, imperative that the government take immediate action. Enforcing strict, zero-tolerance policies on food adulteration; empowering food courts and mobile courts with greater authority; equipping consumer rights bodies with advanced laboratories and skilled personnel and tightening licensing and quality controls for food manufacturers. These steps must be prioritized.\nMd. Shamim Mia, Gaibandha\nshamim.writer2025@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Keep children away from toxic food",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/keep-children-away-from-toxic-food-1752937969",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-07-2025"
    }
]