[
    {
        "full_article": "The National Crime Records Bureau’s annual reports on crime and prison statistics have to be read with a strong caveat — most of the numbers cannot be compared between States because they are largely dependent upon the registration/reporting of crimes in the first place. However, certain national trends and sharp year-on-year changes within States can still reveal meaningful patterns that could demand policy intervention. The recent NCRB report for 2023 — delayed by a year — points to a worrying trend of postponed surveys, reports and even the Census under the current Union Government. But there are also three telling numbers: the 2.8% decrease in murder cases across the country; a staggering 28.8% surge in crimes against Scheduled Tribes (ST), and a 31.2% increase in cyber crimes. While the decrease in murder cases will come as a relief to law enforcement — most of the cases pertain to disputes, personal vendetta or enmity and “gain” — the other two numbers are alarming. The steep rise in crimes against STs is largely due to the ethnic violence in Manipur, with the registered numbers jumping from just one in 2022 to 3,399 in 2023 — which a more effective government could have mitigated. Madhya Pradesh and Rajasthan also recorded significantly high crime rates against tribals suggesting their vulnerability in the central Indian States. This is not a new phenomenon; previous NCRB reports have highlighted higher crime rates in regions with significant tribal populations.With greater Internet penetration across the country, there has been an increase in cybercrime, particularly related to financial fraud and sexual exploitation. Anecdotally, it is evident that these numbers must have gone up even further in the last two years with the greater use of digital financial instruments in daily transactions and investment. While policing has tried to keep up with the growing menace of cybercrime, with specialised cells, the ubiquitousness and deepening spread of digital crimes require more sophistication and dedication by the police to tackle them. Crimes against children rose by 9.2% in 2023 — with the offender known to the victim in 96% of the cases. While the increase could be a function of improved reporting across States, the high number (1,77,335 cases) suggests that States must work on a war footing to sensitise children about these crimes and inappropriate behaviour by adults. A subset of these crimes could also include the application of the POCSO Act in the case of consensual adolescent relationships and this is an area that needs to be carefully handled by the prosecuting and policing agencies. Reported crimes against women registered a modest increase of 0.4%, but this masks a 14.9% spike in dowry-related crimes, pointing to a persistent societal problem.\r  Published - October 11, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        crime\n                    \n                            /                      \n                        \n                        prison\n                    \n                            /                      \n                        \n                        population and census\n                    \n                            /                      \n                        \n                        Reservation\n                    \n                            /                      \n                        \n                        cyber crime\n                    \n                            /                      \n                        \n                        Manipur\n                    \n                            /                      \n                        \n                        Madhya Pradesh\n                    \n                            /                      \n                        \n                        Rajasthan\n                    \n                            /                      \n                        \n                        internet\n                    \n                            /                      \n                        \n                        sexual assault & rape\n                    \n                            /                      \n                        \n                        fraud\n                    \n                            /                      \n                        \n                        finance (general)\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        police\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        children\n                    \n                            /                      \n                        \n                        marriage\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "Crime patterns: On the National Crime Records Bureau’s report for 2023",
        "headline_2": "The 2023 NCRB report shows a sharp rise in cybercrime and crimes against tribals",
        "link": "https://www.thehindu.com/opinion/editorial/crime-patterns-on-the-national-crime-records-bureaus-report-for-2023/article70148719.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "11-10-2025"
    },
    {
        "full_article": "At a time of two wars in the world, a writer described as a “master of the apocalypse” has been awarded the Nobel Prize in Literature for 2025. Hungarian author László Krasznahorkai was chosen by the Swedish Academy “for his compelling and visionary oeuvre that, in the midst of apocalyptic terror, reaffirms the power of art”. The 71-year-old novelist and screenwriter has won many accolades and was a perennial candidate. Often compared to greats such as Franz Kafka, Fyodor Dostoevsky and Herman Melville, his dystopian, absurd and melancholic stories mirror life in Hungary under oppression and beyond in the pre and post-fall of the Iron Curtain era, with a chilling resonance to contemporary times. He gained recognition with his 1985 novel of ideas, Satantango, translated into English by George Szirtes in 2012. It revolves around a group of destitute residents of a collective farm on the eve of the fall of communism, waiting for a miracle, which needless to say would not happen. The tone is set with the epigraph, from Kafka’s The Castle: ‘In that case, I’ll miss the thing by waiting for it.’ Krasznahorkai has collaborated with film-maker Béla Tarr to adapt his works for the cinema. With his second book, The Melancholy of Resistance, he began to be hailed as a postmodern visionary. It was published in Hungarian in 1989, when the wall came down, and first translated into English in 1998.In The Melancholy, a circus comes to a town with the carcass of a giant whale, and sinister happenings follow. His unbroken sentences — like a fellow laureate, Jon Fosse, Krasznahorkai too often omits full stops — are often deemed difficult and demanding. His translator calls Krasznahorkai’s work “a slow lava flow of narrative, a vast black river of type”. Krasznahorkai’s travels to China and Japan in the early 2000s inspired his contemplative novel, Seiobo There Below. The breadth of his oeuvre is evident in the homage he pays to literary giants: Dostoevsky’s The Idiot gets a relook in Baron Wenckheim’sHomecoming; Melville’s ghost haunts Spadework for a Palace: Entering the Madness of Others, a story set in Manhattan. In an interview to writer Hari Kunzru for The Yale Review, Krasznahorkai says “the apocalypse is now”, pointing out that “hell and heaven are both on earth, and they are here now”. About the role of art in the future, he says: “Art is humanity’s extraordinary response to the sense of lostness that is our fate.” By awarding literature’s top prize to Krasznahorkai, the Swedish Academy signals that it is turning to serious but innovative literature and art in a world where little makes sense. Published - October 11, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        award and prize\n                    \n                            /                      \n                        \n                        World literature\n                    \n                            /                      \n                        \n                        Hungary\n                    \n                            /                      \n                        \n                        authors and poets\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Japan\n                    \n                            /                      \n                        \n                        award-winning books",
        "headline_1": "Making sense: On Krasznahorkai and the Nobel Prize in Literature for 2025",
        "headline_2": "Krasznahorkai gets recognition for melancholic stories in an absurd world",
        "link": "https://www.thehindu.com/opinion/editorial/making-sense-on-krasznahorkai-and-the-nobel-prize-in-literature-for-2025/article70148743.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "11-10-2025"
    },
    {
        "full_article": "Investors spooked by Trump’s policies have sought safety in gold, but expecting an endless rally would be a mistake\nGold crossed the $4,000 per ounce milestone this week. That’s over ₹1.2L per 10g in Indian market terms, an all-time record. The world’s 7.2L centenarians will remember a time when an ounce – 28.3g – used to be worth $20.7. In fact, this rate largely held steady for a century from 1834 to 1934, when it was raised to $35 and maintained for the next 34 years. Gold was a stable commodity then, and a stabilising influence on the global economy. Now, it’s a hedge, which explains why its price soars at the first sign of trouble.\nThat sign this year is Trump – born in the $35 era and now going on 80. Gold was at $2,700 on the day he was sworn in eight months ago, so it’s gained about 50% already. It hit $3,000 in March when Trump amped up talk of tariffs and spread uncertainty, and has crossed $4,000 now amid delayed US financial data and a US govt shutdown. Goldman Sachs sees it hitting $4,900 by Dec next year – over ₹1.5L per 10g.\nOf course, predictions are based on assumptions and shouldn’t guide action. When gold went from $38 per ounce in 1972 to $850 in 1980, financial advisers would have egged you on to buy more of it. But by 1999, it had crashed to $251. In 2022, gold tumbled from $2,000 to $1,600. What Trump does next will certainly determine gold’s trajectory, but unexpected events can overtake him and the rest of us. Gold crossed $1,000 amid the 2009 financial crisis, and $2,000 during the pandemic. Both times, fears of inflation from massive govt stimulus spending – over $20tn in the first five months of the pandemic – started the dash for the safety of gold.\nLarry Summers, US treasury secretary under Clinton, said investors rush to gold “when they don’t have confidence in the people who are managing the country”. But Trump’s ad hoc policy-making is affecting confidence beyond US borders. That’s why central banks have been lapping up gold too. As savers and investors, the thing to remember is that the surge in gold’s price isn’t organic. Gold is a haven, yes, but this mad rush could end in a stampede.\n\n",
        "headline_1": "Shine Language",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/shine-language/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-10-2025"
    },
    {
        "full_article": "Indians are racing to the new weight loss drugs like they did to processed foods. Who’s telling them it’s a vicious circle? \nEvidently, it’s not just the celebrities. Past months have seen many of them shed the kilos so dramatically that they just can’t convince peeps that it’s not because of the new weight loss drugs (WLDs), no matter how much they deny it. Yeh jo public hai ye sab janti hai, as the song goes. Now it seems that a lot of this speculation may be informed by first-hand experience. So briskly have Indians taken to Mounjaro that this injectable weight loss therapy has seen 42% and 60% kind of m-o-m growth since its March launch. It’s now looking set to displace our pharma market’s long-standing market leaders (an antibiotic and an anti-diabetic). But this WLD, starting at an average monthly cost of ₹14,000, is a pricey fad. Also a worrying one. \nIndians have acquired mass obesity within a generation. Its core explanation is no different than America’s, although we have shortened their timeline on this just as we seem to be doing with the WLDs. As Johann Hari writes in his sobering Magic Pill, we began to eat foods that didn’t exist before – “designed by the food industry to be maximally addictive, pumped full of just the right proportions of sugar and salt and starch to keep us chomping”. Only, alongside embracing America’s chips and colas, it feels like India’s now eating more samosas and jalebis in a day than previous generations got in a year. Ideally, the magic pills, which are actually weekly injections, should be carefully prescribed to patients who really need them to battle diabetes, heart disease, or other serious cousins of obesity. Instead, reports make it clear that the doctors are shilling these WLDs with little care or caution. \nNext year, when the patent for semaglutide, the active ingredient in major WLDs, expires in India, and their prices accordingly do a generic drop, their uptake may shoot up abnormally. Shouldn’t doctors and regulators be ready for that? Not just all the nausea, vomiting, diarrhea, constipation, loss of muscle mass that we already know about, but also the side-effects that we don’t yet know. In the face of a titanic drug industry plug, public health advice shouldn’t go AWOL. \n\n",
        "headline_1": "Stranger Things",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/stranger-things/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-10-2025"
    },
    {
        "full_article": "Fly to the moon, but the road’s still cratered  \nMumbai got a new airport yesterday at Navi Mumbai. All nice-nice, chakachak.  Delhi too will get a second one at month-end. That hawai adda is not at any Naya NOIDA, but ki farak painda? With both we’ll soar into global aviation’s stratosphere. Provided we don’t miss the flight thanks to down-to-earth jams. Fancy new infra gets jilted by plain old truth: What the big print giveth, the small print taketh away. \nLast week Shri Eknath Shinde was ‘in conversation’ with Shekhar Gupta. Hon Dy CM, Maharashtra, listed the goodies laid on and to be laid on by his Mahayuti govt. He still has clout even though he’s no longer CM, but plays half-second fiddle, along with Ajit Pawar, to his former DCM, now-CM, Devendra Fadnavis. This arrangement looks as convoluted as our daily detours thanks to these projects which will make our rashtra maha again. MMGA.\nSo what if every big-small road looks like it has committed hara-kiri, making it suicidal to get anywhere? Bhau, bund kar re kitkit. Means, it’s because so much infra is in the pipeline. Yes, yes, I know this also means a dash to that new  airport could be a pipe dream.\nShinde-saheb told us it will take just 40 minutes to get from South Bombay to the new airport via the 21.8km Atal Setu. No, our DCM wasn’t spinning a yarn. SoBo-ites can certainly zip to this transharbour bridge via other engineering marvels like Coastal Road, Sea Link and under-construction Worli-Sewri Connector. But, they still swear it out at bottlenecks choking the entry and exit of first two, and godknows when third will be complete. Dilliwalas will suffer same. Last month weren’t they stuck forever on clogged NOIDA expressway? \nSo close I’m living to Atal Setu means I can reach Navi Mumbai in minutes only. Pann bhau, my work is all in purani Mumbai, and that ride takes over an hour because of long-long jams and no buttered zipways! Maybe I should go only where new airport will fly me.                                \n                                  ***\nAlec Smart said: “Has SIR set the Bihar test paper?”\n\n",
        "headline_1": "Infra-Redlight",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/infra-redlight/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-10-2025"
    },
    {
        "full_article": "Prashant Kishor has outsider appeal against the culture of bakaiti (idle talk) shored by complex local networks. But is his idiom of productivity & personal betterment only a sales trick?\nIn this election cycle in Bihar, few have drawn as much curiosity as Prashant Kishor. After a decade crafting electoral wins for others, he now seeks one himself. His padyatra has been a feat, covering 2,697 villages across 235 blocks in 665 days. It has inspired both fascination and fatigue. And overall, his rise reflects a deeper churn in Bihar’s democracy.\nRead full story on TOI +\n\n",
        "headline_1": "PK’s Un-Bihari pitch",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/pks-un-bihari-pitch/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 11, 2025 00:00:00  \nDespite risks of slowdown in global growth due to AI-related labour disruptions, and other issues, South Asia is still the world's fastest growing region. Growth in this region is projected to be robust at 6.6 per cent this year, but is expected to slow down to 5.8 per cent in 2026. This is, however, a short-term outlook, which is subject to downside risks. But over the longer term, artificial intelligence (AI) could promote growth by boosting productivity especially among those 15 per cent of South Asian workers who are in jobs where AI strongly complements human labour. However, reforms to promote trade liberalisation and technology adoption could help the region create jobs and catalyse growth. Especially, tariff cuts on intermediate inputs could benefit younger and more skilled workers in the region including Bangladesh. \nThese are the prospects of South Asian growth including that of Bangladesh, according to the World Bank (WB)'s South Asia Development Update released recently. The Update emphasises the need for reforms to improve economic flexibility, connectivity, workforce upskilling, and private sector job creation, especially for youth and women. In this connection, the WB document particularly stresses carefully sequenced tariff cuts along with broader free trade agreements in order to encourage private sector investment and job creation in trade-related activities. The reason is that younger and higher-skilled workers are disproportionately engaged in trade-related activities over the past decade and contributed to most of the region's employment growth. \nRegarding the tariff regime of the region, the average tariff in South Asia is 16 per cent, which is still higher than global average. But in Bangladesh, it is 28 per cent. Obviously, it is a big barrier to openness in trade and such growth. The policymakers in the government would be required to give serious consideration in this regard. Adopting time-befitting policies is necessary as global development is at a juncture. This is especially so because of the adoption of AI on a massive scale in every sphere of the economy, manufacturing, agriculture, medicine, just to name but a few. Bangladesh cannot simply afford to lag behind when the rest of the world is moving at pace. \nWhile talking of tariff cuts to liberalise trade and promote competitiveness of the local industry including manufacturing and the service sector, there are issues that are also required to be looked into. Going too fast about trade liberalisation with tariff cuts risks killing some traditional domestic sectors that employ a large segment of the population. While adoption of AI in different sectors of manufacturing and service cannot be stopped given the impact of all-embracing fourth industrial revolution, there are still options for going slower in certain vulnerable areas. \nConsider the Readymade Garment (RMG) sector that earns 85 per cent of Bangladesh's earnings from exports. No doubt, introduction of AI will immensely contribute to enhancing productivity and growth of the RMG sector. But at the same time, it will kill the jobs of thousands of workers. This is not the case only with a developing economy like Bangladesh. In truth, even in the developed economies, AI is an issue of concern both in the manufacturing and service sectors. Especially, generative AI is an area of greater concern. So, one needs to be judicious and not going gung-ho about AI. Both policymakers in the government and experts in the sectors concerned need to devise a more balanced approach to the issues of trade liberalisation through tariff cuts as well as wholesale adoption of AI in the economy.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Taking a balanced approach to trade liberalsation, AI",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/taking-a-balanced-approach-to-trade-liberalsation-ai-1760101024",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       October 11, 2025 00:00:00  \nDuring his visit to New York for the UN General Assembly at the beginning of this month, Chief Adviser Professor Mohammad Yunus voiced a sentiment that revealed his government's growing frustration with India. In an interview with journalist Mehdi Hasan, clips of which have been making the rounds, he stated that \"one of the specialities of India now is fake news. A barrage of fake news.\" This episode was yet another indication of a diplomatic relationship that has been blowing cold. The chill had set in after the previous government of Sheikh Hasina was ousted and she took refuge in India following a mass uprising last year that put the current interim government at the helm. This tension is hardly surprising given that Delhi had long regarded Hasina as a reliable ally, backed her throughout her 15-year rule even as it grew increasingly authoritarian and elections became controversial. Many in Dhaka still fear that elements in Delhi may work behind the scenes to pave the way for her eventual return to power. \nThe cornerstone of good neighbourly relations is political non-interference that allows nations to manage their own destinies without external imposition. Yet, people witnessed New Delhi openly throwing its weight behind the Awami League government year after year even as it was accused of veering towards dictatorship. This one-sided support fuelled resentment among ordinary Bangladeshis who began to equate the excesses of the Awami League with Indian interference. This is a far-from-ideal outcome for two nations bound by deep cultural ties and a foundational history dating back to 1971. \nWhen Sheikh Hasina was granted refuge in India after the uprising, it could be seen as a humane gesture. Whatever her political record, providing safety to a person facing life-threatening danger was consistent with international norms of compassion, as Egypt did for the Shah of Iran in 1979 and Mexico for Evo Morales in 2019. On that basis alone, Bangladesh had little reason to fault India. Yet the gesture quickly lost its moral high ground when Hasina, from the safety of Indian territory, began organising virtual meetings and giving speeches to rally opposition against Bangladesh's interim government. For Dhaka, this was a clear political provocation that placed significant strain on bilateral ties. \nOrdinarily, when a neighbouring country undergoes political upheaval, the natural diplomatic instinct is to adapt and engage constructively with the new authority. From that perspective, India's approach has been disappointing and at the same time counterproductive. Rather than extending goodwill to stabilise relations, it has responded with hesitation, even hostility. One might have expected India, a country that maintains relations with governments of various political stripes globally including with Afghanistan under changed regime, to do the same with its nearest neighbour. Whether that stance will soften once a democratically elected government returns to office remains to be seen.\nAdding to the strain in bilateral relations is the inflammatory rhetoric coming from India's ruling Bharatiya Janata Party (BJP) that has done lasting damage to public perception in Bangladesh. For years, senior BJP figures have falsely asserted that millions of Bangladeshi Muslims are living illegally in India and must be expelled through measures such as the National Register of Citizens. These assertions wilfully ignore the reality that Bangladesh and India have broadly comparable levels of income, living standards and wages which makes the prospect of mass migration from Bangladesh to India economically implausible. In fact, these claims are designed to serve a domestic political agenda which is to portray Indian Muslims as foreign infiltrators and create suspicion against them.\nIndia has long projected itself as a secular democracy where citizens of all faiths are meant to stand as equals. The divisive narratives it now promotes dismantle that foundation and tears at the social fabric that holds the country together. More alarmingly, the targeting of Indian Muslims in certain states has escalated from rhetoric to violent state-sanctioned action. There have been documented cases where under the pretext of addressing illegal migration, the authorities have detained and pushed Indian Muslims across the border into Bangladesh. One such case that drew significant media attention is that of 65-year-old Sakina Begum. A member of Assam's indigenous Garia Muslim community who speaks only Assamese, she had no connection to Bangladesh. Despite this, she was forced across the border by Indian guards. Initially sheltered by a Bangladeshi family, she was later arrested by Bangladeshi authorities for unauthorised entry and is now detained in Kashimpur Women's Central Jail.\nThrough such actions, India's ruling establishment is not only inflicting grave injustice upon its own citizens but also offloading its domestic problems onto Bangladesh. Indian Muslims, regardless of their faith or ancestry, are India's responsibility. To abdicate this responsibility by forcibly displacing people is unjust and unacceptable. These hateful actions also poison the atmosphere within Bangladesh where bigots seize the opportunity to vilify and justify hostility against the country's own Hindu population. In the end, it is the minorities on both sides who become the ultimate casualties of this politics of hatred. \nIt is no secret that India aspires to be the leading power in South Asia. While this is a legitimate ambition, its heavy-handed methods of asserting dominance are rightly causing alarm. Grievances in Bangladesh are already fuelled by longstanding issues, such as routine killing of civilians by Indian border guards and the control of trans-boundary rivers through upstream dams which strangles Bangladesh's water security. Topping this off with provocative and irresponsible act of pushing its own minority citizens across the border will only cement India's reputation as a regional bully and undermine its claim to benevolent leadership. \nAs a sovereign nation, it is entirely India's prerogative to decide whom it considers friendly or adversarial. But it can hardly gain anything if it transforms a historic friend into a sceptical neighbour. If India genuinely wishes to see Bangladesh as an ally, this must be demonstrated through consistent and respectful actions. Regardless of which government holds power in Dhaka, the relationship should rest on a firm diplomatic foundation that engages not specific political parties but the nation as a whole. This essential and mature statecraft is required for the long-term prosperity and security of both peoples. \nshowaib434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "What's ailing India-Bangladesh relations?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/whats-ailing-india-bangladesh-relations-1760101074",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       October 11, 2025 00:00:00  \nPrivate tuition or coaching has been an essential part of the country's mainstream primary and secondary education for a long time. A large section of guardians has developed the notion that only coaching centres can help their children/wards to do better results in examinations. The shadow or parallel education industry has grown over the decades and has now become a source of earnings for thousands of teachers and businesspeople who operate the coaching centres. \nThe Private Education Institution Survey 2024, released by the Bangladesh Bureau of Statistics (BBS) in July this year, showed that there are approximately 99,000 private educational institutions in the country. Of these, around seven per cent, or 6,500, are coaching centres where some 60,000 teachers provide education to students. Around one-fifth of the teachers in these coaching centres are female. Again, the number of full-time employees in the coaching centres stood at around 36,000 at the end of December 2023, while the number of part-time employees was 24,000. \nThe BBS survey also showed that the growth of average salaries and wages is higher in the coaching centres than in schools and colleges. It showed that the rate of increase in average salaries and wages was 4.16 per cent in 2023 over 2022, whereas the rate was 3.61 per cent in regular educational institutions during the period under review. The higher growth in salaries and wages indicates a booming business of coaching centres. \nA newspaper report, published two months back, estimated the coaching industry is worth around Tk 14 billion in Bangladesh. In India, the industry is valued at around Rs 544 billion (or Tk 745 billion) and is expected to almost triple by 2033, according to a report published in India Today. In other words, the rise in the number of coaching centres is nothing unique for Bangladesh; rather, it is a global phenomenon now. What is troublesome in the country is the unregulated proliferation of the shadow education industry and unhealthy competition to attract students, primarily driven by business interests. A lack of adequate infrastructure, false claims of successful students or candidates, and intense pressure on students to achieve better results have already brought coaching centres under sharp criticism. Nevertheless, several factors contribute to the increase in coaching centres across the country, and without addressing these, it would not be possible to regulate the centres effectively. \nIt is well known that over the years, coaching centres have leveraged the deficiencies in the school education system. The flawed system of entrance tests for higher education and competitive examinations for employment also provides space for the growth of the coaching centres. The BBS survey showed that there were 275 coaching centres for university and medical admission and job preparation at the end of 2023. The actual number is more now. \nA large number of school teachers are engaged in the coaching business, and many schools promote the coaching so that the teachers can earn some extra money. In some cases, teachers are allowed to conduct coaching classes at the school premises in exchange for sharing a portion of their fees received from students. School authorities also force students to join coaching classes. In this process, guardians have been exploited heavily. Without attending coaching classes, a student may face various consequences, such as negative marking in periodical tests, bullying by teachers and peers, and even restrictions on appearing in public examinations.\nMany teachers also operate private coaching centres at their residences. Although termed as private tuition, the number of students in coaching classes sometimes exceeds that in regular schools. The BBS survey probably did not capture this type of home or private coaching adequately. \nMany students studying at universities and medical colleges serve as part-time teachers in various coaching centres, also for earnings to meet their education and local expenses. These students, however, mostly work at coaching centres dedicated to admission tests for higher educational institutions. \nOver the decades, various experiments on the education system and inconsistent changes in curricula have weakened the country's primary and secondary educational institutions at large. Teachers' training is also ignored, and salaries are not adequate in most cases. Society's perception of teachers has also changed as the spread of corruption and the proliferation of black money drive many to purchase education for their children, rather than investing in their children. The distorted attitude also encourages coaching.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Booming business of coaching centres",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/booming-business-of-coaching-centres-1760101099",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 11, 2025 00:00:00  \n\nMobile Financial Services (MFS) have revolutionised financial access for millions in Bangladesh. But alongside this convenience, we are witnessing a sharp rise in fraud within the sector. Fraudulent activities like SIM swap attacks, phishing scams, and account hacking are becoming increasingly common, and yet, the response from both MFS providers and regulatory authorities remains insufficient. The lack of urgency to tackle this growing issue is deeply concerning.\nEvery day, unsuspecting users fall victim to fraud. Often, fraudsters take advantage of gaps in security and a general lack of awareness among MFS users. Phishing calls, where fraudsters impersonate MFS service providers to steal sensitive information, are becoming all too common. As yet, many users don't know how to protect themselves or spot these scams. Here's what matters: fraud in MFS platforms is costing people more than just money. It is costing trust in the system, and without that trust, MFS could lose its effectiveness in reaching Bangladesh's most vulnerable populations.\nThe lack of comprehensive awareness campaigns is one of the biggest gaps. While MFS platforms are rolling out some security features like two-factor authentication, these efforts are only part of the solution. Users need to be informed about how these scams work and how they can safeguard their accounts. Awareness campaigns can equip users with the knowledge they need to protect themselves, whether it's identifying fraudulent messages or understanding how to prevent unauthorized transactions. The truth is, when people don't know the risks or how to mitigate them, they're much more likely to fall prey to fraud. So, why isn't there more focus on user education?\nFraud is a moving target. Fraudsters continually evolve their tactics to bypass the basic security measures that MFS providers set up. Even though the financial institutions are aware of the ongoing fraud, the level of urgency to deal with it is simply not there. There should be a national, coordinated response-a combination of stronger security, better detection systems and an education campaign that runs round the year. Without this, the problem will continue to grow.\nHasiba Nur\nStudent\nMasters of Business Administration\nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Dealing with MFS fraud",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/dealing-with-mfs-fraud-1760101118",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-10-2025"
    }
]