[
    {
        "full_article": "The timely arrival of the northeast monsoon, which benefits many parts of the southern peninsula, especially Tamil Nadu and the coastal and Rayalaseema regions of Andhra Pradesh, has brought relief to the region, given its importance from an agricultural as well as a disaster management perspective. Against its normal arrival date of October 20 (plus or minus seven days), the monsoon set in on October 16. The India Meteorological Department has forecast “above normal” rain with more than 112% of the long period average. Going by the data for 1971-2020, the season’s share in the annual rainfall is 48% for Tamil Nadu and over 30% for Andhra Pradesh. The monsoon also witnesses at least three cyclonic disturbances over the Bay of Bengal. There is also the added factor of cloudbursts, which are more frequent now, according to an Indian Institute of Tropical Meteorology study. Consequently, coastal States face urban flooding with residents of Chennai living in dread of it, going by their experiences of the past 10 years.Keeping this in mind, the Tamil Nadu government is putting in place a real-time flood forecasting system for Chennai to calibrate excess water discharge from the reservoirs in and around the city. In addition, the authorities, as in other southern States, are preparing the official machinery to handle any situation. Over the years, the loss of lives has dropped after effective coordination among the agencies concerned. However, there are still many areas in need of more focused attention. The state of stormwater drains and water courses through cities leaves much to be desired, but State governments alone cannot be held responsible for this. That sections of people still use waterbodies as dumping yards only aggravates the problem, highlighting the near absence of community ownership among urban residents. In the farm sector, the shortage of fertilizers, particularly urea, has been bothering agriculturists. About a month ago, Tamil Nadu Chief Minister M.K. Stalin, in a letter to Prime Minister Narendra Modi, flagged the issue. Other States which are dependent on rainfall during the southwest monsoon, had also complained of urea shortage. The Union Ministry of Agriculture is reported to have enhanced urea demand for October — it was 36.65 lakh tonnes a year ago. Looking at the macro picture of the monsoon, the message is that as rainfall is expected to be more intense, the authorities at every level have to be vigilant and act in unison so that any adverse impact is reduced, if not eliminated. Published - October 17, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Monsoon\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Andhra Pradesh\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        disaster management\n                    \n                            /                      \n                        \n                        weather science\n                    \n                            /                      \n                        \n                        flood\n                    \n                            /                      \n                        \n                        Chennai\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        forecast\n                    \n                            /                      \n                        \n                        fertiliser\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        rains",
        "headline_1": "None too soon: On the setting of the northeast monsoon",
        "headline_2": "The timely arrival of the northeast monsoon bodes well for farmers",
        "link": "https://www.thehindu.com/opinion/editorial/none-too-soon-on-the-setting-of-the-northeast-monsoon/article70172124.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "While addressing the Knesset, the Israeli Parliament, U.S. President Donald Trump declared that the ceasefire agreement between Hamas and Israel, which he had helped broker, marked “the historical dawn of the new Middle East”. In Sharm el-Sheikh, Egypt, Arab and Muslim leaders joined him in praising his 20-point peace plan. While all sides hailed Mr. Trump’s role as a peacemaker, the declaration of a new era of peace in West Asia, claiming to end a “3,000-year-old” conflict, glosses over deep and enduring complexities. The Gaza ceasefire, which appears to be holding with Hamas and Israel releasing hostages and prisoners, is undoubtedly a relief for Palestinians and hostage families. But the greater challenge lies in implementing the next phase, let alone building “a new Middle East”. A notable outcome of the Sharm el-Sheikh summit was the joint declaration by Egypt, Qatar, Türkiye and the U.S., also calling for the safeguarding of the fundamental rights of Palestinians and Israelis. It recognised the region’s historical and spiritual significance to multiple faiths, and committed signatories to dismantling extremism and radicalisation. But the declaration was silent on more contentious issues — Hamas’s disarmament, one of the central objectives of the Trump plan, or of Israel’s continuing military presence in Gaza.Mr. Trump later claimed that Hamas had promised to disarm, warning that “If they don’t disarm, we will disarm them..., perhaps violently”. But Israel, despite its two years in Gaza, has still failed to disarm Hamas. How then does Mr. Trump plan to disarm them? He also claimed that the Iran threat had been neutralised, and urged more Arab countries to join the Abraham Accords. While Iran’s regional influence has been dented, it remains an influential regional player. Hezbollah, despite military setbacks, continues to be a powerful socio-political actor within Lebanon, and U.S.-led attempts to disarm the Shia group have gone nowhere. In Yemen, despite relentless Saudi, American, British and Israeli bombing campaigns, the Houthis, another Iranian ally, still control key population centres, including Sana’a. Moreover, Arab countries now have growing security concerns about Israel, particularly after its bombing of Qatar in September. Against this background, Mr. Trump’s sweeping claims of regional peace ring hollow. What he should prioritise instead is ensuring that the Gaza ceasefire holds. The next step should be forcing Hamas to give up power in the enclave while pressing Israel to withdraw. Once peace is consolidated and reconstruction begins, the U.S., with its Arab and European allies, should work towards a practical road map for the establishment of a Palestinian state. Unless the Palestine question is resolved and the Israeli occupation ends, grand declarations about remaking the region will remain little more than empty rhetoric. Published - October 17, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        parliament\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        usa cricket\n                    \n                            /                      \n                        \n                        peace negotiations\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        prison\n                    \n                            /                      \n                        \n                        Egypt\n                    \n                            /                      \n                        \n                        Qatar\n                    \n                            /                      \n                        \n                        Turkey\n                    \n                            /                      \n                        \n                        Donald Trump",
        "headline_1": "New dawn: On Palestine and West Asia",
        "headline_2": "​Peace in West Asia hinges on resolution of Palestine issue",
        "link": "https://www.thehindu.com/opinion/editorial/new-dawn-on-palestine-and-west-asia/article70171999.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "OpenAI gets ready to get explicitly competitive. This was inevitable, as are questions that follow\nTreat adult users like adults, is an unexceptional principle, indeed a fine one. But what’s captured interest in Sam Altman’s post about ChatGPT committing more fully to this principle, is that it will be allowing erotica for verified adults. Users are already talking to chatbots about sex and romance. These conversations will clearly race XXXwards as the company relaxes the restrictions it has in place right now. This is very worrying for all those who, with good reasons, believe that pornography is already a public health crisis, seriously undermining the human capacity for healthy relationships. But hasn’t every technological leap of history in a way been a big leap for pornography? Expecting AI to transcend that tendency was always a pipe dream.\nThe printing press took erotica from the very wealthy to a much broader audience, the telephone created phone sex, VHS beat Beta by embracing pornography, which was also a huge driver in the internet’s development and popularisation. As for today’s tech leap, it’s tough to say where it will take us all. Maybe OpenAI will take lessons from platforms like OnlyFans, which does a decent job of ensuring minors don’t sign up. The great poser is how increasingly realistic AI-produced porn will reshape this human addiction.\nAnyway, OpenAI’s cuddle of erotica is eminently good business. What is laughable is Sam claiming this is not about “usage-maxxing”. Dude. Nobody’s buying that. Or that the restrictions that had been put in place for ChatGPT are only being loosened now because the company has “been able to mitigate the serious mental health issues and have new tools”. It’s clear from reportage from across the world that age-gating is still unreliable and mental health dangers are only intensifying. But so is market competition. OpenAI will not let the sexually explicit chatbot companions unveiled by Musk’s AI company and others hurt its growth curve – without some dirty dancing. \n\n",
        "headline_1": "XXXGPT",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/xxxgpt/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "Electing a panel of appointees is indispensable for the smooth functioning of our society\nA Gurgaon housing society where I happen to live, is abuzz with preparations for holding elections for a new Managing Committee to run the services of the community, as the current Managing Committee demits office having completed a statutory five-year term.\nThe word Committee has an aura of gravitas, an emanation of authority and elicits the use of capital letters as much as Trump’s tweets do. ‘By order of Committee’ appended to a list of do’s and don’ts has an injunctive resonance of magisterial finality, brooking no pettifogging arguments. The Committee’s first task is to appoint its Office Bearers, deemed so because they bear the Burden of Responsibility. The Office Bearers appoint subcommittees (lower case to distinguish them from the main Committee) to perform designated functions.\nThe main role of the committee with a capital C is to hold regular conclaves called Meetings in which discussions take place on the Agenda, or order of business.\nThe formulating of the Agenda involves a dialectic of pros and cons, duly recorded by a designated Committee member who notes down Minutes which, considering the protracted duration of such proceedings, might appropriately be called Hours.\nThe holding of a Meeting often requires the holding of a prior Meeting to determine when the actual Meeting will be held. It might be required to hold another meeting (lower case to differentiate it from the meeting to fix the date and time to have the Meeting) to decide when the actual Meeting takes place.\nIf when the Meeting does take place and there is no consensus on the Agenda, or list of priorities, with the Ayes being vetoed by the Nays, the Meeting is adjourned sine die.\nMan might work from sun to sun but a Committee’s work is never done. But despite their critics Committees are a vital necessity because left to our own devices, individuals like me, too indolent and/or incompetent to run anything, would let everything fall apart. That’s why Committees are Important. As is that Committee of all Committees called Parliament.\n\n",
        "headline_1": "Order of Committee",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/order-of-committee/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "SC is right. India should have a debate on what can replace hanging when it comes to capital punishment \nSupreme Court’s lament about govt not willing to modernise the delivery of death sentence – it was hearing a petition to replace death by hanging with lethal injection – needs some parsing, and continuous discussions beyond cases in court. Death penalty has three debates that run concurrently. First, whether capital punishment should be abolished. Second, a restrained and diligent application of the penalty. SC and CJIs have time and again appealed to HCs to be ultra-careful when sentencing convicts to death. The sentencing itself is harrowing for most convicts, however hardened the criminal. On death row, it is long years of appeals till death is delivered or sentence commuted. The third debate is on the ‘best’ – or ‘humane’ – way to service the sentence.\nNeither the debates nor the arguments are new. A British govt commission report in 1950s exploring modes of execution said of its goal: any method untried that would inflict death as painless and certain as hanging but with “greater decency” and without the “degrading and barbarous association with which hanging is tainted”. The argument against this debate is that there’s no ‘humane’ way; the very decision is troubling. That discussing ‘best methods’ is in fact, an attempt to protect shared values – the natural right to life and ‘dignity of death’.  The reality though is, so long as the death penalty is on the statute, it must be asked: is hanging the most certain, quickest, and least painful method with minimum bruising? Should there be options? If so, what?\nNo method is ‘best’. The world recoiled when Alabama last year used nitrogen gas asphyxia in a global first as a new mode, claiming death would be instant. Instead, the convict struggled for life for several minutes – nitrogen was on for 15 minutes. US prisons are exploring new ways because drugs for lethal injections (sodium thiopental) are difficult to source – countries are ceasing manufacture and banning export of drugs for capital punishment. US states have re-introduced electrocution and the gas chamber (hydrogen cyanide). Finding trained personnel is a challenge. Non-medical people carrying out a medical mode of execution have also seen botched executions. India on its part has a shortage of hangmen although executions are rare – there can be no worse torture than a botched hanging. To that end, SC’s point on GOI’s lack of response is on point. It is not alone about policy. It’s a complicated medico jurisprudential issue. However squeamish it makes one, the question of option is not to be sidestepped.\n\n",
        "headline_1": "Death By…?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/death-by-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "India should readjust its strategic policy: dependency on any country for anything, energy or arms or trade or tech, mustn’t exceed a quarter of total requirement. That’ll reduce vulnerability when any power pulls the plug\nAs trade wars harden into tariff wars and sanctions become political instruments, India’s challenge is to remain free in a world that punishes independence. Most countries pick sides. India picks stability. Its answer lies in a new rule for this age of coercion, one that is not about joining blocs but about managing dependencies. No more than 25% dependency on any single partner in any strategic area, whether energy, defence, trade, finance, or technology, so that no one partner can pull the plug.\n\nRead full opinion on TOI+\n\n",
        "headline_1": "New Delhi’s new target: 25%",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/new-delhis-new-target-25/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "We are deeply concerned by the alarming levels of antibiotic resistance reported in the country. According to a recent WHO report, some critical antibiotics in the country face resistance rates ranging from 79 to 97 percent, underscoring a worsening level of antimicrobial resistance (AMR). Resistance levels of some of these drugs are among the highest in South-East Asia, including India, Nepal, and Sri Lanka. Health experts warn that these rising AMR rates can lead to more severe illnesses, prolonged hospital stays, increased treatment failures, greater surgical and medical risks, and ultimately higher mortality. Without urgent action, this crisis could spiral out of control, driving up treatment costs, overburdening healthcare systems, and reducing productivity.\nAccording to the WHO, AMR occurs when bacteria, viruses, fungi, and parasites no longer respond to antimicrobial medicines, making infections harder or impossible to treat and increasing the risk of disease spread, severe illness, disability, and death. An earlier icddr,b AMR study that monitored ICU patients from July 2023 to January 2024, found similar alarming results, yet those have largely failed to prompt any decisive action from health authorities.\n\nThe misuse of antibiotics in the country has been quite widespread, with those being readily available at pharmacies without prescriptions. Although the Drug and Cosmetic Act, 2023, strictly prohibits the sale of antibiotics without prescriptions, enforcement remains weak. More worryingly, over-prescription by doctors has exacerbated the problem. Other contributing factors include patients not completing their antibiotic courses, overuse of antibiotics in livestock and fish farming, poor infection control in hospitals, and inadequate hygiene and sanitation.\n \nThe crisis also exposes our healthcare inequalities, as patients from low-income backgrounds, unable to access proper medical care, often rely on unprescribed antibiotics from local pharmacies.\nWhen healthcare is neither affordable nor accessible, misuse of medicines becomes inevitable. To tackle this crisis, authorities must strengthen antibiotic regulations and standardise surveillance methods with rigorous monitoring. Authorities should also ensure transparency between pharmaceutical companies and doctors, curb profit-driven prescribing, and promote diagnostic testing to ensure appropriate antibiotic use. Ultimately, a holistic approach is essential—one that improves healthcare infrastructure, enhances patient education, and enforces stronger regulations.\n",
        "headline_1": "Indiscriminate use of antibiotics must stop",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/indiscriminate-use-antibiotics-must-stop-4011466",
        "news_paper_name": "The Daily Star",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 17, 2025 00:00:00  \nWhile Bangladesh has long focused on removing non-tariff barriers (NTBs) in other countries to facilitate its exports, it now finds itself facing similar demands from the European Union (EU) -- its largest trading partner. The EU has formally asked Dhaka to eliminate a number of trade- and investment-distorting NTBs as part of efforts to deepen bilateral trade relations. According to official sources, the EU has identified around 60 types of NTBs -- categorised under 13 broad areas in a document prepared in consultation with EU member states -- that it views as major impediments to business expansion,.\nThe EU's list highlights sector-specific obstacles affecting trade in agriculture, food and dairy products and pharmaceuticals-sectors that have significant potential but remain constrained by procedural and regulatory bottlenecks. The identified NTBs span critical areas such as investment, services, customs procedures, government procurement, intellectual property rights (IPR), counterfeit goods, double taxation and profit repatriation. As Bangladesh prepares to graduate from the Least Developed Country (LDC) category in 2026, the EU has emphasised the need to align its commercial and regulatory practices with international standards. The EU also notes that restrictions on foreign access to bonded warehouses, inland container depots and quality-control operations continue to limit trade efficiency.\nIn the agro-business sector, the EU has pointed to complex licensing processes, inconsistent product standards and discriminatory duties -- especially on filled milk powder -- that discourage agricultural exports to Bangladesh. Other technical barriers include non-recognition of international test reports and mandatory radiation-testing requirements that complicate market access for European exporters. In the pharmaceutical sector, the EU has identified slow approval processes for new products, limited compliance with international marketing codes, and logistical challenges in cold-chain management and ground handling of sensitive medicines. Concerns have also been raised over non-transparent procurement practices and tendering rules that distort competition. Beyond these sectoral issues, the EU's document underscores weaknesses in tax administration, inadequate enforcement of IPR laws --particularly for seed-related innovations -- and regulatory hurdles that restrict the repatriation of profits, dividends and licensing fees by foreign companies. The EU has made it clear that in order to expand trade and investment ties, Bangladesh must demonstrate a firm commitment to fair, transparent, and rules-based trade governance. It also reaffirms the bloc's readiness to engage with Dhaka through constructive policy dialogue to address these challenges. Importantly, the EU stresses that ensuring a level playing field will benefit not only European exporters and investors but also Bangladeshi businesses that seek to operate in a predictable and competitive environment.\nIt appears that most of the reported barriers are process-related rather than rooted in legal or policy frameworks. Nevertheless, removing them would unlock significant opportunities for trade and investment on both sides and support Bangladesh's economic transition beyond LDC status. To meet these expectations, Bangladesh should adopt a comprehensive and time-bound action plan to address the EU's concerns on a priority basis. By enhancing regulatory transparency and aligning standards with global best practices, Bangladesh can strengthen investor confidence and consolidate its partnership with the EU in the post-LDC era.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Addressing NTBs to cement partnership with EU",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/addressing-ntbs-to-cement-partnership-with-eu-1760628360",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       October 17, 2025 00:00:00  \nObservance of the World Standards Day or International Standards Day on October 14 in this country has become routine but its confinement to the official circle and some private agencies has little helped create the mass awareness and spread the message. The rhetoric speakers at the function exude does not match with the grass-roots-level reality. When the officials claim that several laboratories of the Bangladesh Standards Testing Institute (BSTI) have been developed as world class facilities, they would be hard put to explain why the parent institute's certificate is not recognised by other countries. \nAccepted that some laboratories meet the international testing standards but there are several tests that no laboratory here can perform. The international standard plant quarantine for exports and some advanced food safety analysis are missing, let alone the specialised chemical analysis. When required, it is done by Societe Generale de Surveilance, a multinational company founded in France and headquartered in Geneva, Switzerland. Inspection, verification, testing and certificate services are its specialisation no other institute can challenge. \nHowever, the first two should have been within the reach of the local laboratories long ago but for the bureaucratic go-slow policy on developing testing infrastructure. Export of vegetables including the leafy ones and fruits is often restricted due to failure of meeting the phytosanitary requirements of the importing countries. In Bangladesh, the plant quarantine wing under the Department of Agriculture Extension (DAE) of the Ministry of Agriculture serves as the National Plant Protection Organisations (NPPO) in other countries. Now the question is if the wing concerned issues a phytosanitary certificate, if the destination country is obliged to recognise it. Clearance of a commodity by the NPPO is one thing and the same by the quarantine wing under the DAE is a completely different thing. \nWhy Bangladesh does not have a full-fledged NPPO? Consignments to and from other countries need to meet the international standards. Advanced technology and expert manpower are a prerequisite for ensuring that plants and plant products are free from pests and diseases. Further, it has to make sure that the ecological health of the destination country is not disturbed by introduction of invasive species. When potato export fails to take off because of failure to meet the phytosanitary requirements of the importing countries such as Russia, there is a need for reviewing the DAE's role in improving the entire gamut of cultivation, harvest and storage of agricultural produce. The inspection and monitoring must start from quality seeds to irrigation to use of fertilisers to spray of insecticides to harvesting and storage of crops. \nThis is how Bangladesh can transform its image as a producer of safe foods. Maintaining the standards of the consumables is a culture of ethical practices a people develop throughout ages. Unfortunately, this country is not famous for this. On the contrary, there are dark geniuses who can produce a carbon copy of anything starting from local brands to foreign brands of cosmetics and toiletries to life-saving drugs produced by pharmaceutical companies. Unsuspecting consumers often purchase the spurious products thinking those are genuine. Both adulterated foods and counterfeit consumer goods compromise or cause harm to public health. \nDigital technology has made copying so picture perfect that naked eyes often fail to distinguish the fake items from the genuine. For example, toothbrushes of the famous brands like Dr West's are available everywhere in the country. The prices of such items are a good indication of its local production. No one cares for the copyright laws that should have prompted the authorities launch drives against factories that churn out millions of the item. Standardisation of goods produced by genuine manufacturers thus suffers a setback in the process. At the same time, the country's aspiration for self-sufficiency in various products is stymied. As the market is flooded with fake products of foreign brands, the local brands find marketing of theirs very difficult. \nSo, there is a need for containing the invasive business of counterfeit goods. Notwithstanding the BSTI's endeavour to protect both consumer rights and maintenance of standards of local brands, the counterfeiters find ways of carrying out their forgery and fraudulent business. Unless the massive counterfeit business can be dismantled, standardisation of goods will not take a firm root in the system. Therefore, serious and effective drives should be launched in order to drive impostors out of business. This is a perquisite for improving quality of products of local brands and adding value to the national economy. \nObservance of the World Standards Day in the capital with the participation of the government officials concerned, representatives of the CAB and industries in the private sector will hardly produce any positive results unless people at the grassroots level are sensitised about maintenance of qualities of produce and goods and take a stand against adulteration and copying of goods. To that end, the DAE and representatives of SMEs should collaborate for observance of the day in villages and small towns. This year's theme, \"A Shared Vision for a Better World: Standards for Sustainable Development Goals\" leaves a cue to bringing first the house in order and then engaging with the wider world.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Beyond observance of the World Standards Day",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/beyond-observance-of-the-world-standards-day-1760628447",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       October 17, 2025 00:00:00  \nGlass-fronted buildings have nowadays become the new norm in cities in Bangladesh. Almost all corporate headquarters, luxury hotels, hospitals, and shopping malls in all big cities, particularly Dhaka, have adopted this new architectural style, as it represents progress and sophistication. But these glass buildings absorb an absurd amount of energy.\nBangladesh already suffers from frequent power outages due to rising electricity demands. These buildings, with their gleaming exteriors, only worsen the situation with demands for even more power. Experts recommend designing these buildings intelligently, as they are currently incompatible with the country's energy situation. It is time for starting use of high reflective glass or photovoltaic glass, as it will make the buildings more energy efficient.\nThe glass facades have become an icon of modernity, creating an international look that appeals to most clients. But in a country like Bangladesh, where the temperature often goes over 35°C, this style of architecture poses a great risk. The glass allows sunlight to enter the building, which raises the indoor temperature, leading to complete dependence on air conditioners. These glass-covered buildings use up to 30-40 per cent more electricity than traditional buildings. The issue is even more apparent in the summer seasons when the energy consumption of the country is at an all-time high with the air conditioning of such buildings accounting for the major portion of it.\nBangladesh has made remarkable progress in generating electricity, exceeding 25,000 megawatts. Yet it is plagued by frequent load shedding, mainly caused by inefficient energy use. Load shedding --- most frequent during heat waves ---affects households, industries and other essential services such as hospitals. On the other hand, Bangladesh's dependence on imported fuel is increasing, affecting the country's goal of reducing the same and replacing it with renewable energy.\nThe integration of high reflective glass in buildings could ease the problem. Coated with metallic oxide layers, high reflective glasses prevent a huge portion of solar radiation from entering the building, reducing air-conditioner usage and electricity consumption by 20 to 40 per cent. Neglecting these advantages, developers opt for cheaper, ordinary float glass. But the difference in initial cost is negligible when compared to the potential reduction of energy cost.\nOn the other hand, photovoltaic glass goes a step further and generates electricity with the solar cells integrated into it. It transforms some of the sunlight into electricity, allowing buildings to compensate for some of their electricity consumption. Besides several western nations, countries like Singapore, Japan, South Korea, Malaysia, and the United Arab Emirates are also using this technology in their skyscrapers. In a country like Bangladesh, where energy demands are higher than the production capacity, integrating high reflective and photovoltaic glass could be revolutionary with buildings turned into vertical power plants. Several obstacles keep this from becoming a reality. Many developers are still unaware of both the energy implications of glass-coated buildings and the improved alternatives to them. Furthermore, the country's building code currently does not require energy efficiency.\nOvercoming these obstacles requires raising awareness and revising the Bangladesh National Building Code. Awareness campaigns have to be conducted to educate both developers, property owners and the general public on the negative impacts of glass-coated buildings and the merits of their alternatives. The National Building Code should include provisions for buildings to be energy efficient while developers and architects should be trained to start incorporating high reflective glass and photovoltaic glass in their designs.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Opting for energy-efficient building glass",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/opting-for-energy-efficient-building-glass-1760628475",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 17, 2025 00:00:00  \n\nAs a riverine country, Bangladesh relies heavily on its waterways for transportation. In many cases, passengers find travelling by launch more comfortable than by bus or train. However, this sense of comfort vanishes into thin air when passengers face a host of irregularities and challenges.\nWhile short-distance trips tend to be relatively hassle-free, passengers travelling longer routes -- such as to Barishal or Bhola -- frequently face serious difficulties. During these long journeys, passengers often have no choice but to buy food from the canteens and shops inside the launches. This is where the problems begin. Most canteens serve unhygienic food, which can lead to illnesses such as diarrhoea, dysentery, typhoid, ulcers, heart disease, and hepatitis. Passengers often fall ill mid-journey, far from medical help, placing them in a dangerous and uncomfortable situation.\nIn addition to the poor quality of food, many onboard shops sell expired products. I personally experienced this. After purchasing a packet of biscuits from a shop on a launch, I discovered in my cabin that it had expired six months earlier. Unfortunately, selling such expired and unsafe food has become commonplace.\nWhen passengers attempt to protest, they often face intimidation from organised syndicates operating within the system. This is deeply troubling, especially considering that the right to food is one of the five fundamental rights of every citizen. Ensuring access to safe food is an essential part of that right. While food is necessary for survival, safe food is even more critical, as health and nutrition go hand in hand. Sustainable living and good health are impossible without access to safe and nutritious food. Unhygienic food remains a major threat to public health.\nIn the light of this alarming reality, I believe it is imperative for the authorities concerned to take sincere and proactive measures. Regular monitoring and enforcement, coupled with responsible behaviour from passengers, are essential steps towards ensuring food safety on launches.\nHasan Mahmud Shuvo\nMBBS student\nInternational Medical College Hospital, Gazipur\nhasanmahamudshovo9005@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ordeals on river routes",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ordeals-on-river-routes-1760628496",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-10-2025"
    }
]