[
    {
        "full_article": "Last week’s Bay of Bengal Initiative for Multi-Sectoral Technical and Economic Cooperation (BIMSTEC) summit — the sixth — which brought the leaders of seven neighbouring countries to Bangkok at a time of global turbulence, was an opportunity to reignite the regional grouping after years of stasis. Originally cast as a “bridging” mechanism between South Asia’s SAARC and South East Asia’s ASEAN countries, the grouping has languished due to a lack of purpose or due to political underpinnings. After the collapse of India-Pakistan ties, post-2014, SAARC has made little movement, whereas the micro-grouping of Bangladesh-Bhutan-India-Nepal ran aground after the Bhutanese Parliament rejected the Motor Vehicles Agreement between them, as a result of which New Delhi has invested in BIMSTEC. While the objective of having a summit every two years was derailed by the COVID-19 pandemic, what is important is that the summit was held in spite of a possible derailment after the earthquake in Myanmar and Thailand. But the summit proved useful, given the number of agreements and areas of cooperation. These include a BIMSTEC chamber of commerce and work on the India-Myanmar-Thailand Trilateral Highway that will connect India’s North-East region, billed a BIMSTEC “hub”, all the way to the Pacific ocean. The BIMSTEC region is prone to natural disasters and building a joint mechanism for disaster management is critical. Negotiating a free trade agreement (FTA) and Customs agreements are among other plans outlined in a ‘Vision 2030’ document that was adopted.Apart from the multilateral outcomes, the summit provided the leaders a rare opportunity for bilateral meetings. Prime Minister Narendra Modi and Bangladesh Chief Adviser Muhammad Yunus put aside months of acrimony and aired their grievances over the treatment of minorities, border killings and former Prime Minister Sheikh Hasina’s stay in India. Mr. Modi’s advice that “rhetoric” must be avoided between neighbours is important, but must be followed in Dhaka and Delhi. Mr. Modi’s meeting with Nepal leader K.P. Sharma Oli came after months of tensions over India’s refusal to issue Mr. Oli an invite, and it is hoped that these exchanges will lead to an early visit and the resolution of issues. The inclusion of Myanmar’s Prime Minister General Min Aung Hlaing was a special gesture by the BIMSTEC grouping, and it is hoped that Mr. Modi’s counsel to Gen. Min and Mr. Yunus on restoring democratic processes in Myanmar and Bangladesh will be heeded. While the summit was productive, many of its initiatives are replicas of agreements once adopted by SAARC, and it is important that member-states focus on the group’s cohesion and sustainability so that BIMSTEC is not allowed to atrophy the same way as SAARC did. Published - April 09, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Thailand\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        international relations\n                    \n                            /                      \n                        \n                        Bangladesh\n                    \n                            /                      \n                        \n                        Bhutan\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Myanmar\n                    \n                            /                      \n                        \n                        Nepal\n                    \n                            /                      \n                        \n                        SAARC\n                    \n                            /                      \n                        \n                        ASEAN\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        bengaluru\n                    \n                            /                      \n                        \n                        electricity production and distribution\n                    \n                            /                      \n                        \n                        natural disasters\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi",
        "headline_1": "​A regional revival: On the BIMSTEC summit",
        "headline_2": "BIMSTEC summit provided a platform for bilateral meetings",
        "link": "https://www.thehindu.com/opinion/editorial/a-regional-revival-on-the-bimstec-summit/article69427340.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "09-04-2025"
    },
    {
        "full_article": "In a world where the idea of state control of all economic activities is passé, and in a country where class differences have been overtaken by caste segmentations as entrenched identity markers, it is not a surprise that a party like the Communist Party of India (Marxist) has faced erosion in its support base and has struggled to retain a national presence. The refrain in the party’s resolutions after the end of its 24th congress suggest that it is aware of its inability to garner adherents to its ideological cause. But it is also cognisant of the opportunities available to build a coherent narrative against the entrenchment of right-wing thought and ideology in a polity dominated by the BJP. By articulating a strong position on issues related to federalism, civil liberties, gender rights, social justice, communal harmony, and collective action, and arguing against concentration of resources and wealth among a tiny elite, the party seeks to stay relevant as an anchor of a distinct ideological pole. What the party has been unable to do is to convert opportunities into steadfast action. It has elected a new general secretary, M.A. Baby, a long-time politburo member and leader from Kerala. Perhaps this transition from an earlier leadership that cut its teeth in student politics at the Jawaharlal Nehru University and provided ideological mettle to the party but lacked direct experience in mass and electoral politics, will help it. However, this requires fresh agency.Mr. Baby will face a Herculean task in reviving the party’s electoral fortunes. The only government that it leads today, the Left Democratic Front in Kerala, faces anti-incumbency as elections are due next year. In other erstwhile strongholds, West Bengal and Tripura, it has faced a dramatic decline and has not shown any urgency in reviving its lost fortunes. The CPI(M) today realises the need for an independent mobilisation that asserts its principles and ideology while not ruling out electoral alliances to take on the hegemonic BJP. Its fleeting electoral success elsewhere in the country has been made possible through a combination of progressive agitations and deft alliances with parties such as the DMK in Tamil Nadu and the Congress in Rajasthan. Yet, to attract more support for its ideological positions, the party must also adapt to present-day realities in a manner that differentiates it from other legatees of the global communist streams. It must shed the historical baggage of authoritarianism and flawed economic programmes that characterised a few of these streams, so as to make its agenda appealing to progressive-minded people who want to alter the status quo.\r Published - April 09, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Communist Party of India -Marxist\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        Left Democratic Front\n                    \n                            /                      \n                        \n                        Dravida Munnetra Kazhagam\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        Rajasthan\n                    \n                            /                      \n                        \n                        West Bengal\n                    \n                            /                      \n                        \n                        Tripura\n                    \n                            /                      \n                        \n                        students\n                    \n                            /                      \n                        \n                        university\n                    \n                            /                      \n                        \n                        election",
        "headline_1": "​Long march ahead: On the CPI(M) congress",
        "headline_2": "The CPI(M) makes a shift in leadership as it seeks to retain relevance",
        "link": "https://www.thehindu.com/opinion/editorial/long-march-ahead-on-the-cpim-congress/article69428083.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "09-04-2025"
    },
    {
        "full_article": "Thanks to our diaspora, we are the biggest remittance economy in the world\nInstead of ringing up sales on their cash registers exporters around the world, including in India, are wringing their hands in despair at the ruinous tariffs that Trump has imposed across the board.\nHowever, there is one Indian export that might well dodge the Don’s tariff bullet. This remarkable export has been a mainstay of the Indian economy for decades and remains so.\nIt brings in $129.1bn, more than our next biggest earner from abroad which are petroleum products, followed by gems and jewellery.\nThis single export brings in three times as much money as all foreign investments coming into India, and has helped to reduce our trade deficit.Indeed, in the early 2000s it reportedly reversed India’s trade deficit by earning us more than what we’d spent on our imports.\nThis singular, very special, very profitable export item is a product that this country has a super-abundance of:People – the migrants who keep adding to the great Indian diaspora, and out of their earnings send money back to support relatives at home. They have made our economy the biggest remittance economy in the world, beating that of China.\nMaharashtra brings in over 20% of the total remittances, with Kerala hard on its heels with over 19%, and Tamil Nadu coming into third place at 10%. Telangana and Karnataka account for 8% and 7%, respectively.\nPreviously, while most remittances came from West Asian countries employing labour migrants, now US, UK and Singapore are the biggest importers of highly skilled Indians.\nThough the Trump regime’s anti-immigration drive could see a decline in the US market, Indian inventiveness will find new openings elsewhere. It has to, thanks to the unintended incentive given to it by our economic policies, which have created jobless growth and resulted in mass unemployment.\nRemittances are the silver lining of the dark cloud of this new Quit India movement.\n\n",
        "headline_1": "Exported Indian",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/exported-indian/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-04-2025"
    },
    {
        "full_article": "Look beneath the viral direwolf story. It’s about human entertainment, not animal conservation\nNot all science fiction should become reality. De-extinction is an idea popularised by Jurassic Park. What those racing full steam ahead with ‘resurrecting’ extinct species ignore is how that story ended. Yes, technologies like CRISPR and AI have made ‘revival of the dead’ possible. Yes, there is big money in this. Colossal Biosciences, which has electrified the internet with the ‘world’s first successfully de-extincted animal’, has a $10bn valuation. But its claims are as dodgy as its ethics.\nThe three direwolf pups it has ‘grown’ are not genetically identical to the species that died out 12,500 years ago. One tooth fossil, one skull fossil and extant gray wolves were mixed to make a ‘functional’ copy. This is speciesism at its worst. A van Gogh and its reprints are not interchangeable, but an ancient living creature and a brand new, man-made hybrid are? No, they aren’t. Woolly mammoth, dodo and tasmanian tiger are also on the de-extinction to-do list. Think about how this selection is being done. It’s sort of how people make more cat videos because cat videos are super popular – not because those people necessarily love cats. Countless species and their habitats are gone, too many of them by ruthless acts of homo sapiens. But billions of dollars are only being put into bringing ‘charismatic megafauna’ back. This is staggering narcissism and hubris. It’s not about helping biodiversity at all, but only about entertainment and profits.\nThere are more tigers in captivity in Texas than in the wild worldwide, experts estimate. They are kept in backyards, basements, theme parks, private zoos. The three pups – one named Khaleesi after Game of Thrones which made the world fall in awe of (fictional) direwolves – are said to be enjoying a Ritz Carlton lifestyle. That’s the opposite of conservation. Saying we can bring back any extinct species we fancy, gives us cover while driving those that exist to extinction.\n\n",
        "headline_1": "The DeExtinction con",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-deextinction-con/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-04-2025"
    },
    {
        "full_article": "The difference between the phenomenon of Donald Trump and the spectre of pandemic lies in the search for an imponderables, bright minds who had worked tirelessly in labs, armed with the wisdom of science and hindsight of history, knew they would soon hit upon a remedy to counter Covid. After five years, when the world is overwhelmed by an upheaval of another kind, that faith is missing.\nRead full story on TOI+\n\n",
        "headline_1": "Markets can’t trust Trump",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/markets-cant-trust-trump/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-04-2025"
    },
    {
        "full_article": "By- Shailendra Pandey\n\nAnant Ambani, 29, concluded a 170km padayatra from Jamnagar, his ancestral hometown and karmbhumi, to Dwarka, one of India’s holiest cities on Ramnavami. After setting out on March 29, he covered about 20km daily, walking for about seven hours each night.\nIn Sanatan Dharm, the Sapta Puris – seven sacred cities – hold great significance. These are places where one can attain salvation and be freed from the cycle of birth and death. Among these Puris is Dwarka, the city of Krishn. This place is associated with salvation and symbolises duty, sacrifice, faith, and devotion. The padayatra, foot march, to Dwarka is as spiritually significant as the destination itself. Ambani’s padayatra is particularly remarkable, as he undertook this strenuous journey while overcoming significant health related challenges.\n\nAlong the way, Ambani has encountered goodwill – some have walked along with him in solidarity, others have given him pictures of Dwarkadhish, and others have come over with their horses to take photos with him. In Sanatan Dharm, religious padayatras and pilgrimages are considered spiritual journeys that lead toward self-purification, devotion, and Self-realisation. These journeys serve as a means for the devotee to connect with the Divine. A padayatra helps focus one’s thoughts, allowing the pilgrim to concentrate on more profound and meaningful questions of life. Yet, the mind is naturally restless; it tends to wander. Through mantras, stotras, and bhajans, it can be gently guided back to the right path. During the Dwarka padayatra too, if the mind begins to drift, it can be anchored by chanting Krishn’s name: ‘Hare Krishn hare Krishn, Krishn Krishn hare hare, hare Ram hare Ram, Ram Ram hare hare.’\nA padayatra is filled with challenges. Difficulties lie in wait at every step, ready to test the pilgrim’s resolve. In such moments, seeking refuge in Dwarkadhish offers protection and strength. For this, there is the powerful seed mantra of Dwarkadhish: AUM Kleem Krishnaya Namah.\nAnd when one seeks protection, it must be accompanied by complete surrender. One must let go of the self and fully trust Him, believing that if Krishn has willed it, it will surely be for the best.\nA padayatra is not merely about walking with the body – it is a journey of the mind. It begins when the mind sets aside worldly concerns and sets out to meet the Divine. When it forgets ego, anger, greed, and jealousy, and becomes absorbed in a single devotion, it is a form of tapasya, a quest to overcome hunger, thirst, and fatigue. It inspires one to look within and live a more disciplined, mindful life.\nAs one sets out on this path, there should be no burden of desires or attachments – only the spirit of surrender and a yearning to connect with Him. The journey to Dwarka is a journey to the Self. It is an opportunity to feel and become one with divine energy. Mantrasand bhajans support us along this path. That is why, at the Dwarkadhish Temple, one should chant: ‘Jai Dwarkadhish, Jai Shri Krishn.’\n\n",
        "headline_1": "Anant’s padayatra takes him to Anant within",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/anants-padayatra-takes-him-to-anant-within/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-04-2025"
    },
    {
        "full_article": "As a nation that has always stood firmly in solidarity with the people of Palestine, we are dismayed by what unfolded in several districts during Monday's countrywide protests against Israel's war on Gaza. The protests—comprising sit-ins, processions, and academic closures—followed a global call for strikes, under the banner \"The World Stops for Gaza\", demanding an end to the brutal military campaign that has already killed over 50,000 Palestinians. While this cause is close to our hearts, we cannot condone the vandalism and looting carried out in its name. According to a report by this daily, various business outlets with alleged links to Israel, including restaurants and shoe stores, were attacked during the protests in Sylhet, Chattogram, Cox's Bazar, Khulna, Gazipur, Bogura, and so on.\nLater, images and video footage showing some of the attacks went viral, redirecting the conversation from what was a well-intentioned act of solidary with a persecuted population. While the government has condemned these incidents, with subsequent police raids resulting in the arrest of at least 49 suspected miscreants, the question that stares us in the face is: how does ransacking and looting local businesses (or even those with international backing) serve the Palestine cause? What justice is served by trashing, for instance, a Bata showroom—a company with no ties to Israel? This doesn't help the global Boycott, Divestment and Sanctions (BDS) movement either, as it is meant to be nonviolent. The ignorance of the miscreants in this regard is matched only by their disregard for true solidarity, making a mockery of a noble cause.\nUnfortunately, their vandalism took place just as the government launched the Bangladesh Investment Summit 2025, a four-day event aimed at attracting global investors and reshaping our international image. How unfortunate it is that scenes of looted shops, torched signage, or terrified shopkeepers are being broadcast at the same time. This is not how a country invites confidence or foreign capital. And if the government cannot effectively address this trend of violence by opportunists and criminals hiding in the crowd, Bangladesh's image is unlikely to improve any time soon. As we have highlighted in a recent editorial, it is because of the lack of a proper response by police and the judiciary that mobs are being exploited to serve various purposes. Often, mere suspicions of crimes including mugging, extortion, murder or rape have resulted in deadly violence. Political and personal grudges are also fuelling such violence.\nThis calls for a critical reassessment of the government's approach to dealing with mob activities. But law enforcement alone is not enough. We need a national reckoning with this culture of impulsive violence through the engagement of political and religious platforms. We must uphold the right to protest, but never at the cost of peace, order, and our collective interests.\n",
        "headline_1": "Palestine doesn’t need our violence",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/palestine-doesnt-need-our-violence-3866961",
        "news_paper_name": "The Daily Star",
        "publish_date": "09-04-2025"
    },
    {
        "full_article": "Myanmar's recent announcement to repatriate 180,000 Rohingya refugees from Bangladesh has drawn international attention. But beneath this statement lies a familiar and troubling pattern. The declaration comes at a time when Myanmar is in deep political crisis, with widespread conflict, a collapsed administration, and worsening humanitarian conditions. Large parts of Rakhine State—home to the Rohingya—are now controlled by the Arakan Army (AA), while the military junta that issued the repatriation promise is steadily losing power and territory. Given these circumstances, it is hard to take this pledge seriously. It seems more like a political gesture to ease international pressure than a sincere effort to correct past wrongdoings.\nThis is not Myanmar's first repatriation attempt. Two major efforts in 1978 and 1992 followed large-scale violence that pushed hundreds of thousands of refugees into Bangladesh. In both cases, Myanmar agreed to take them back after strong international pressure. However, those returns were rushed, lacked oversight, and failed to address the core reasons why people fled. Returnees were denied citizenship, placed under strict restrictions, and treated with suspicion. These efforts did not lead to lasting peace but instead laid the foundation for further waves of violence and displacement.\nThe current situation is worse than in previous decades. Since the military coup in February 2021, Myanmar has been spiralling into chaos. The junta faces resistance from armed ethnic groups and civil movements across the country. The AA now controls key areas of Rakhine State. In many places, the military government no longer has the power to provide services, security, or even access. Under such conditions, how can they claim to guarantee a safe and voluntary return for the Rohingya refugees?\nWhat makes matters worse is the lack of real policy change. The 1982 Citizenship Law—which stripped the Rohingya of citizenship—remains in place. There has been no formal apology, no legal reform, and no move to recognise them as an ethnic group in Myanmar. The same systems of exclusion and discrimination that forced them to flee still exist. Inside Myanmar, more than 100,000 Rohingya remain in internal displacement camps. Many have lived in these camps for over a decade with limited access to healthcare, education, and freedom of movement. Since the coup, access for aid groups has become even more restricted. Under such harsh and unsafe conditions, calling any repatriation \"voluntary\" or \"dignified\" is unrealistic.\nThe design of the current repatriation plan is also flawed. Myanmar has agreed to take back individuals listed between 2018 and 2020. However, many children have been born in the camps since then and are not included in these lists. This raises the serious risk of splitting families—where parents are allowed to return, but their children are not. Such situations violate basic humanitarian principles and the right to family unity. Understandably, many families would refuse to return under such conditions.\nAnother major issue is that the voices of the Rohingya themselves are not well-reflected in this process. Studies and interviews from the refugee camps in Cox's Bazar consistently show that most Rohingya do not want to return unless their demands are met. These include full citizenship, safety guarantees, the freedom to move and work, and access to education and healthcare. Many refugees say they would rather stay in Bangladesh than return to a country that still refuses to recognise them.\nBangladesh, meanwhile, has carried a massive humanitarian burden since 2017. Nearly one million Rohingya live in camps along its border. International funding has declined, and frustration is growing among local communities and officials. It is understandable that Bangladesh seeks a solution. However, agreeing to a flawed repatriation plan that lacks guarantees of safety and rights could put vulnerable people at risk, retraumatise survivors, and increase instability in both Rakhine and the camps in Bangladesh. For any future repatriation to work, several key steps must be taken.\nFirst, Myanmar must change its laws to grant the Rohingya full citizenship. This means repealing or amending the 1982 Citizenship Law and recognising the Rohingya as an official ethnic group. Without this, any return will simply recreate the same injustices. Second, international organisations like the United Nations High Commissioner for Refugees (UNHCR) and the International Organization for Migration (IOM) must be involved at every stage—from verifying returnees and ensuring safe transport to monitoring their reintegration. Independent oversight will help build trust and protect the rights of returnees.\nThird, repatriation must include full families. It is unacceptable to separate children from their parents or leave out newly born members of a household. Repatriation should be a family-centred process based on dignity and choice. Fourth, the return process must be part of a broader justice effort. Myanmar must acknowledge the crimes committed against the Rohingya, hold perpetrators accountable, and offer reparations to victims. Justice is not just about punishment—it is about creating conditions where trust can be rebuilt and people feel safe in their own country. Finally, returnees must be supported with long-term reintegration plans. They need access to education, healthcare, housing, jobs, and land. They should not be sent back to camps or temporary shelters. They must be treated as full and equal citizens with rights and opportunities.\nMyanmar's latest repatriation promise may sound hopeful on the surface, but it fails to address the real causes of displacement. The country's worsening political crisis, unchanged discriminatory laws, and lack of accountability all suggest that this initiative is not about helping the Rohingya—it is about managing Myanmar's international image. Unless deep structural changes are made and the rights of the Rohingya are restored, repatriation will remain a false promise. The international community must not accept empty gestures. It must demand real reform, legal guarantees, and a rights-based approach to any return plan. Anything less than that is not repatriation—it is re-victimisation. For the Rohingya, who have suffered for generations, only a just and safe return can bring an end to their long journey of displacement.\nDr Md Nuruzzaman Khan is research fellow at the University of Melbourne, Australia. He can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Why Myanmar’s Rohingya repatriation plan rings hollow",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/why-myanmars-rohingya-repatriation-plan-rings-hollow-3866381",
        "news_paper_name": "The Daily Star",
        "publish_date": "09-04-2025"
    },
    {
        "full_article": "In 1972, when Bob Woodward was investigating the Watergate scandal, he was not getting any leads. He got a breakthrough from a secret informant with the pseudonym \"Deep Throat,\" saying \"Follow the money.\" In 2005, the identity of \"Deep Throat\" was revealed—it was Mark Felt, an FBI special agent. Mark passed away in 2008, but his advice to Bob Woodward became a golden rule in uncovering major crimes involving huge amounts of money.\nMark Felt's rule is still relevant to the question of laundered money from Bangladesh and its recovery. In this respect, \"time is of the essence\"—because the more time passes, the more difficult it becomes to \"follow the money.\" Any laundered money travels very fast, particularly in this digital age. It moves to various destinations and takes different forms—both tangible and intangible. So, after a while, the colour of the money gradually fades, and it simply becomes very difficult to track and identify laundered money.\n\nOne critical question is: how big is the amount of money laundered from Bangladesh? Estimates vary. However, the White Paper on the state of the Bangladesh economy indicates that Tk 28 lakh crore was laundered between 2009 and 2023—equivalent to $234 billion. This is just an indicative figure, based on various sources and assumptions. The ultimate point is that the sheer scale of laundered money from Bangladesh is simply huge. After it left the country, the money was used to buy homes or other tangible assets in Dubai, UAE, UK, Malaysia, and so on.\nThe million-dollar question is: how can Bangladesh recover the laundered money that has crossed its borders? Let us make it clear at the very outset that the recovery process is both complex and time-consuming. The complexity arises on both financial and legal fronts. The process often starts with identifying unusual and suspicious transactions, which can be done through anti-money laundering protocols. Authorities trace the funds through financial records, such as bank accounts, wire transfers, and export-import invoices, which requires forensic financial investigation to uncover how money was laundered. The detection and investigation of laundered money require both bilateral and international cooperation. For example, governments use Mutual Legal Assistance Treaties to request assistance from foreign governments in gathering evidence, freezing accounts, or tracing assets. With cooperation from foreign countries, the laundered money can be temporarily frozen to prevent further movement. International anti-crime organisations like Interpol can be involved in the investigation. International investigation firms are sometimes engaged in evidence gathering and investigations.\nNext comes the legal action. Legal action is initiated against those involved in money laundering, both in the country of origin and the country of destination. The legal action involves charges of money laundering, fraud, or other related crimes. Along with criminal charges, civil lawsuits may also be initiated. But two issues are critical in this respect. First, three basic points need to be established: one, in the country of origin, wealth was accumulated illicitly; two, wealth was taken out of the country illegally; and three, the wealth entered the country of destination illegally. Second, before initiating legal actions abroad, those involved in money laundering must be convicted in the courts of the country of origin. Sometimes, international law firms are appointed for legal actions abroad. If the laundered money is found to be illegal, confiscation orders are served by courts to seize the funds in the destination country. The confiscated laundered money is then returned to the originating country through legal agreements and treaties.\nThe process of convicting those involved in money laundering and recovering the laundered money critically hinges on collaboration between the country of origin and the country of destination. In that context, the existence of mutual treaties and agreements between those countries is a prerequisite. There must be compatible legal frameworks between the two parties. Different legal frameworks, weak enforcement of anti-money laundering protocols, and strict banking secrecy laws in the destination country may make the recovery process difficult. Furthermore, the goodwill of the destination country is also key. For example, the destination country may only be interested in whether the money has entered its borders legally, irrespective of where and how it was accumulated and how it left the originating country. This reflects that the destination country might be more interested in incoming resources. This may impede the recovery process.\n\nAdditionally, if the funds were settled in tax havens or offshore banking, the recovery process becomes more complex. Similarly, complexities may arise if the laundered money is turned into tangible assets such as houses. It has been found on many occasions that legal firms engaged by money-laundering victim countries to detect, trace, and recover laundered money have been bribed or paid large sums by those engaged in money laundering.\nQuestions are often asked if laundered money from different countries have ever been recovered. Two observations should be put forward before answering this question. One, there are positive examples where certain countries were able to recover laundered money. But there are also negative examples. Second, till now, no country has been able to recover the full amount of laundered money, so the success story is only partial.\nAngola is often cited as a positive example, where $5 billion was recovered through various means. It represents part of the billions of dollars laundered by the son of a past president of the country, Jose Eduardo dos Santos. In fact, about $3 billion of the $5 billion was willingly returned by a friend of the president's son. In Nigeria, during the rule of Sani Abacha, an estimated $5 billion was looted and laundered abroad. After extensive legal proceedings and cooperation between Swiss authorities, the World Bank, and the Nigerian government, $500 million was recovered in 2004. In 2020, a further $300 million was agreed to be repatriated from the US. Other recoveries were made in various countries, including the UK and Liechtenstein, bringing the total recovered to $1.3 billion. In Malaysia, 1Malaysia Development Berhad was involved in laundering $4.5 billion through complex schemes. In 2020, the US Department of Justice reached a settlement with Goldman Sachs, which agreed to pay $2.5 billion directly to Malaysia for its role in the scandal. US authorities also recovered over $1 billion in assets tied to 1Malaysia Development Berhad.\nMoney laundering is a sensitive issue. Recovery is neither costless nor easy. It will take time.People should surely be informed about the progress as well as the problems of the recovery process, but they should not be given any false notions about the timing or the extent of the recovery. Whatever success Bangladesh has in recovering the laundered money, the issue needs to be pursued, irrespective of time and cost, because it has a moral dimension. When the culprits are brought to justice, it will send a strong signal to everyone that nobody can get away with looting national wealth.\nSelim Jahan is former director of the Human Development Report Office under the United Nations Development Programme (UNDP) and lead author of the Human Development Report.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The golden rule in recovering stolen assets",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-golden-rule-recovering-stolen-assets-3866156",
        "news_paper_name": "The Daily Star",
        "publish_date": "09-04-2025"
    },
    {
        "full_article": "With the Rohingya repatriation process stalled and international funding to support them significantly reduced, the chief adviser has rightly urged the Bay of Bengal Initiative for Multi-Sectoral Technical and Economic Cooperation (BIMSTEC) to take visible actions for their repatriation. He called on member states to initiate dialogue between Myanmar's conflicting parties and work towards restoring stability in Rakhine State. Unfortunately, despite several attempts over the past eight years, not a single Rohingya sheltered in Bangladesh has been repatriated to Myanmar. Instead, around 100,000 more Rohingya have fled to Bangladesh since July last year, driven by escalating conflicts between the Arakan Army and Myanmar's military junta. Against this backdrop, it is crucial for international forums, including BIMSTEC, to actively engage in addressing this protracted crisis. The chief adviser has also cautioned that, if left unresolved, the situation has the potential to create instability in the entire region.\n\nBangladesh has been hosting approximately 1.2 million Rohingya, most of whom fled Myanmar during the military crackdown in Rakhine State in 2017. Following the military takeover in 2021, Myanmar descended into civil war, with the Arakan Army gaining control of nearly 90 percent of Rakhine State. Recently, the United Nations Development Programme (UNDP) issued a warning about an imminent famine in Rakhine. In light of these developments, the chief adviser has called for the establishment of a humanitarian channel in Rakhine to provide essential supplies to the people and prevent further displacement. This also raises the question: can the repatriation process realistically begin under such dire circumstances in Rakhine?\nReportedly, Myanmar authorities have identified 180,000 Rohingya as eligible for repatriation out of a list of 800,000 Rohingya currently sheltered in Bangladesh. The Chief Adviser's Press Wing stated that the original list was submitted by Bangladesh in six phases between 2018 and 2020. U Than Swe, Myanmar's deputy prime minister and foreign minister, further confirmed that the final verification of an additional 70,000 Rohingya is pending further scrutiny of their photographs and names. He also indicated that the verification process for the remaining 550,000 Rohingya on the original list will be expedited. While these assurances from Myanmar are promising, significant efforts are still required to guarantee the safe and dignified return of the Rohingya.\n\nMyanmar must ensure a conducive and secure environment in Rakhine to facilitate the safe return of the Rohingya. The authorities there must grant them full citizenship, freedom of movement, access to employment opportunities, and other basic human rights. Bangladesh, which is already under considerable strain in supporting the Rohingya refugees, is facing additional challenges due to the reduction in foreign aid. Thus, the sooner the repatriation process can start, the better it will be for both Bangladesh and the region.\n",
        "headline_1": "Rohingya repatriation long-overdue",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/rohingya-repatriation-long-overdue-3864156",
        "news_paper_name": "The Daily Star",
        "publish_date": "09-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 09, 2025 00:00:00  \nAt a critical stage of the national economy when the inflow of Foreign Direct Investment (FDI) has tapered off to a six-year low, the Chief Adviser (CA) of the interim government has invited the country's global partners to a four-day event, namely, 'Bangladesh Investment Summit 2025'. Evidently, the aim of the summit would be to highlight the transformative changes the economy has underwent recently driven by progressive investment policies introduced under his government and how those policies have created an investment-friendly atmosphere in the country. Notably, in his call to international investors, the CA did not fail to point out that on this special occasion, the prospective investors would also have the opportunity to have a data-driven insight into the most promising sectors of the economy for investment. \nAs expected, the four-day summit kicked off on April 7 (Monday) at a local hotel in the city by way of organizing an exposition highlighting the country's Startup ecosystem, titled, \"Bangladesh Startup Connect 2025' where some 1,500 delegates attended different sessions of the event. At the event, discussions were reportedly held on the opportunities this evolving field of investment offers as well as the challenges facing it. At the opening session of the event, the Executive Chairman of Bangladesh Investment Development Board Authority (BIDA), focused on how the government is trying to create an ecosystem to make business operation in Bangladesh much easier. As an investment promotion agency, as expected, its role would be to create a bridge between the assets the country possesses and the potential liquidity available in the global market. The areas of comparative advantage Bangladesh can offer to attract potential investors include cheaper utility services and trainable but cheap labour. Such inputs are cheaper compared to Vietnam, Cambodia, Thailand and Indonesia, its competitors. There is, however, no reason to believe that just showcasing the areas of comparative benefits can convince a potential investor. In that case, confidence building between the overseas investors and the country is important. \nAfter years of not-so-gratifying experience, the investment promotion agency of the government should have learnt some valuable tips to win investors' confidence. The good news is that three cases of startup investments were reported on the very first day of the aforementioned Startup exposition, as informed by the special assistant to the CA for the ICT Division. Undoubtedly, this augurs well. Now the need is to make the process sustainable so that the general ambience turns favourable for investment. \nOn the first day of the Summit, it could be further learnt that, a 60-member business delegation representing 25 countries was shown the Korean Export Processing Zone (KEPZ) and the National Special Economic Zone (NSEZ) to showcase the country's manufacturing facilities. It is worthwhile to note that the KEPZ is based in Chattogram and is the first-ever private, country-specific export processing zone established in October 1999 and owned by the Korean industrial conglomerate Youngone Corporation. In fact, Youngone is one of the pioneers in setting up garment factories in Bangladesh for overseas export. At a presentation during the said delegation's visit, the chairman of the Youngone Corporation, Kihak Sung did reportedly highlight the simple and efficient system of its management that is not encumbered by many layers of bureaucracy as is the case with many government agencies in Bangladesh. Indeed, the experience of dedicated pioneers in foreign investors like Yoingone Corporation, can show the way for others to consider Bangladesh as a desirable destination for investment.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Making BD an attractive investment destination",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/making-bd-an-attractive-investment-destination-1744123992",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       April 09, 2025 12:00:00  \nThe decision by the Dhaka Electric Supply Company (DESCO) to generate 120 MW of rooftop solar power by installing on-grid solar systems across its eight operational circles is a commendable initiative. These systems will be deployed on rooftops in urban areas and integrated into DESCO's distribution network through net metering. Each of the eight operational circles has been designated to generate 15 MW of solar power. To facilitate this, bids have been invited from international engineering, procurement, and construction (EPC) contractors to design, build, finance, operate, and maintain the systems. At a time when the global focus is shifting towards clean energy, this move is poised to significantly strengthen Bangladesh's energy sector. Moreover, DESCO plans to purchase electricity from the contractors at rates lower than the retail electricity prices set by the Bangladesh Energy Regulatory Commission (BERC), making it a cost-effective solution for sustainable power generation.\nBangladesh has been steadily advancing on solar power generation over the years. Currently, the country's total clean energy generation capacity stands at 1.558 gigawatts, with solar energy contributing 1.264 gigawatts. Notably, Bangladesh is a global leader in the adoption of Solar Home Systems (SHS), a vital segment of renewable energy that has been recognised as the world's largest off-grid renewable energy programme. According to a report by the Paris-based energy think tank REN21, as of 2020, more than six million SHS units and kits were operational worldwide, benefiting approximately 25 million people. Bangladesh alone accounts for over four million of these installations, making it the largest SHS market globally.\n\nThis achievement is a testament to the success of the SHS initiative. The Infrastructure Development Company Ltd (IDCOL) has played a pivotal role in spearheading this programme since its inception in 2003. This initiative has illuminated the lives of nearly 18 million people-approximately 12 per cent of the country's total population-which previously relied on kerosene lamps for lighting. The programme, supported by multiple donors, has proven particularly beneficial for inhabitants of isolated char areas and other remote locations where grid connectivity remains a distant dream. Currently, according to the Ministry of Power, Energy, and Mineral Resources, 2.86 per cent of the country's total electricity generation comes from renewable sources, including solar energy.\nThe REN21 report also highlights the crucial role of micro-credit schemes in expanding the SHS market in Bangladesh. The country's micro-credit model has enabled millions of households to adopt SHS, setting an example for other nations looking to develop decentralised renewable energy solutions. Furthermore, the rise of mini-grids and stand-alone systems, along with pay-as-you-go business models supported by mobile technology, has transformed energy access for many underserved communities.\nThe impact of SHS in off-grid areas is profound, though often underappreciated by those in urban regions. In the char, island, and haor areas, where conventional electricity access is nearly impossible, SHS has revolutionised daily life. Initially, many residents adopted SHS primarily for lighting. However, over time, the technology has facilitated economic transformation by enabling irrigation, small-scale industries, and other productive ventures. Small businesses, once inconceivable in these areas, are now thriving due to innovative solar-powered solutions.\nAs the momentum of SHS adoption continues, its expansion is expected to reach an even larger segment of the population. Currently, approximately 38 per cent of Bangladesh's population lacks access to electricity. While grid connectivity is increasing due to new power stations, a significant portion of the rural population will likely remain off-grid. This presents a crucial opportunity for SHS to bridge the electricity gap.\nTo fully capitalise on the potential of SHS, it is essential to support market expansion through strategic policy interventions. The existing mechanism has already demonstrated its benefits, and with the right measures, further progress is inevitable. However, challenges persist, particularly in balancing imports and local production. Domestic manufacturers are advocating for higher import duties on solar components to protect local investments. Policymakers must carefully evaluate the domestic manufacturing sector's ability to meet growing demand and maintain high quality. Achieving a sustainable balance between imports and local production will require close collaboration among stakeholders, including the government authorities, manufacturers, and energy providers.\nAnother pressing concern is the integration of solar power with national grid expansion. Reports indicate that in several rural areas, households that invested in solar panels are now facing uncertainty as grid connectivity is being introduced. A lack of coordination in government planning could lead to inefficiencies, resulting in financial losses for SHS users. To mitigate such challenges, a harmonised approach is necessary, ensuring that solar investments complement, rather than conflict with, national electrification efforts.\nIn conclusion, Bangladesh's progress in solar power adoption, particularly through the SHS initiative, is a remarkable success story in renewable energy.\n With DESCO's new on-grid rooftop solar project and the ongoing expansion of SHS, the country is making significant strides towards a cleaner and more sustainable energy future. However, to maximise the potential of solar power, a well-coordinated strategy is essential-one that balances local production with imports, integrates SHS with grid expansion, and fosters innovation through supportive policies. If these challenges are addressed effectively, solar power will not only supplement Bangladesh's energy needs but also serve as a catalyst for economic and social transformation across the country.\n wasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Solar power: Best energy source to bank on",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/solar-power-best-energy-source-to-bank-on-1744124089",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 09, 2025 00:00:00  \nBangladesh is a developing country with millions of young bloods. With approximately 5.0 million university students in Bangladesh, their impact on the economy is more than we realise. Apart from paying tuition fees, let us talk about the earnings from part-time jobs, freelancing, tuition and small businesses which numerous students are engaged in. Thus many of them are trying to survive in this fluctuating economy. It is a common trend among university students to take on tuition and earn from BDT 5,000-15,000 every month. Some are even making more than BDT 20,000 from providing tuition. Whilst some do part time jobs in IT and other small firms in small roles which they get exploited more often with less payment than they deserve because of their undergraduate status. \nNowadays, a significant number of students have started their small online businesses like Clothing brands, makeup and skin care retails, print on demand services, cake and bakery businesses and so on, which open a lot of scopes and generate handsome amounts of revenues. These small home-grown businesses are increasing at the right pace ensuring solvency of the concerned students. These students are holding the capacity to pay their own university tuition fees and also meet their regular expenses by doing so. Freelancing has also been a common way of income for lots of students who are skillful.\n Remote jobs or contractual jobs like video editing, website design, data entry, social media marketing are a few high paying jobs performed by students via platforms like Upwork and Fiverr. The concept of students not working and only focusing on their academic performance is vanishing day by day. The students are becoming more independent and aware of real-life experiences and its value. It's high time the parents emphasize on motivating and guiding their children into jumping into the real world and making it normalised for a student to work besides focusing on their education.\nMahiul Islam Tilak\nStudent\nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Students' contribution to economy",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/students-contribution-to-economy-1744124206",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 09, 2025 00:00:00  \n\nElectric vehicles (EVs) are changing the way we think about transportation, and it's an exciting shift towards a greener future. With climate change and air pollution becoming bigger concerns, EVs offer a much cleaner alternative to traditional gas-powered cars. Since they produce no tailpipe emissions, they help cut down on harmful greenhouse gases, improving air quality and, in turn, public health.\nThanks to advancements in battery technology, EVs now have a longer driving range and faster charging times, making them more practical and appealing for everyday use. More and more car companies are jumping on the EV bandwagon, and governments are offering perks like tax breaks and building more charging stations to encourage people to make the switch. Plus, there's the added benefit of powering EVs with renewable energy sources like solar and wind, which makes them even more eco-friendly.\nThat said, there are still a few hurdles to overcome. We need to expand charging stations, find ways to make batteries more affordable, and ensure that the materials used to make these batteries are sourced responsibly. However, with continued innovation and support from both the government and the private sector, EVs have the potential to completely transform how we get around and help create a cleaner, healthier world for the future generations.\nRahim Hossain\nStudent\nBachelor of Business Administration\nNorth South University\nrahim.hossain01@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Electric vehicles: Driving towards a greener future",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/electric-vehicles-driving-towards-a-greener-future-1744124218",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-04-2025"
    }
]