[
    {
        "full_article": "The Government of India has so far handled the issue of the 50% tariffs imposed by the U.S. with maturity and pragmatism. Despite provocative statements by senior U.S. government officials, India has refrained from being baited and has instead stuck to its established position. So, while U.S. Trade Adviser Peter Navarro called the Russia-Ukraine war “Modi’s war”, India has remained calm and has instead been preparing on how to deal with the new reality of 50% tariffs. At the same time, Indian officials have said that negotiations on a trade deal with the U.S., though paused, are not off the table. Even the additional 25% ‘penalty’ tariff imposed on India is not a deal breaker, they have said, even though it renders any trade deal inconsequential. This is an eminently practical approach. A knee-jerk cessation of trade talks with the U.S. would hurt India further, but the gains from any potential trade deal will also be undone if these penalty tariffs remain in place. The messaging by the government to industry, too, has not been of denial but of reassurance: they know there is pain coming, and a plan is in the works to alleviate it. The solutions seem to be looked at from a suitability point of view, and not for optics. Rather than announce flashy fiscal incentives, the government has demonstrated awareness that such incentives would hardly make a dent in the face of the 50% tariffs for India while competitors face less than half that. Instead, the government is focusing on what it can effectively address, such as the impending liquidity crunch exporters are going to face.The Centre has been reasonably pragmatic about how to secure the overall economy from the tariff impact as well. Exports make up about one-fifth of India’s GDP. The U.S. accounts for about one-fifth of that, and even within that, about 40% of India’s exports to the U.S. will not be affected by the 50% tariffs. So, even though the sectoral impact of the tariffs could be quite severe for some sectors, the macroeconomic impact is likely to be limited. The dual approach of rekindling dialogues with China, while also trying to propel domestic consumption through GST rate cuts should, therefore, go a long way in mitigating the hit. There is some talk in the government about easing the norms laid out in the COVID-19-era Press Note 3, which curtails Chinese foreign direct investment in India. This should be encouraged, with adequate guardrails to ensure national security. The Centre and States must also cooperate next week to ensure that the GST rate cuts go through, without compromising too much on the States’ fiscal health. Now is the time for level-headed action, not emotional outbursts. READ MORE Published - August 30, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        government\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        trade agreements\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        national security\n                    \n                            /                      \n                        \n                        macro economics",
        "headline_1": "​Rational response: On U.S.’s tariffs and statements, India’s response",
        "headline_2": "India has opted for level-headed action in the wake of U.S. tariffs",
        "link": "https://www.thehindu.com/opinion/editorial/rational-response-on-uss-tariffs-and-statements-indias-response/article69988451.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "31-08-2025"
    },
    {
        "full_article": "The four-month high July growth rate of 3.5% in the monthly goods output barometer, the Index of Industrial Production, must have come as a relief a day after India’s largest trading partner, the United States, operationalised its punishing “penalty” tariffs of 25% ostensibly for New Delhi’s continued oil purchases from Russia. While this July’s 3.5% is lower than last July’s 5%, a broad-based growth in manufacturing aided by year-on-year (y/y) expansions in capital (5%) intermediate (5.8%) and infrastructure goods (11.9%), suggests that recovery continues to be led by considerable capex spends driven by the government. This is evident from the impressive growth in basic metals (12.7% y/y), electrical equipment (+15.9% y/y), and other non-metallic minerals (led by cement; 9.5% y/y).What must also come as a relief is the first green shoots of rural demand recovery as both consumer durables (7.7%) and non-durables (0.5%) were positive for the first time in nine months, on the back of a retail inflation of 1.55% aided by a second consecutive month of food price disinflation of - 0.8%, lower than -0.2% in June and 5.1% in July 2024. It is noteworthy that consumer non-durables — food staples and household essentials — have been positive only in four out of the past 12 months, and have consecutively remained negative from December last year till this August in the face of runaway consumer food price inflation that peaked between last September and January this year. While mining activity has contracted for the fourth consecutive month this year, July’s -7.2% was a tad better than June’s -8.7%, but much worse than last July’s 3.8%. The recovery from the massive flooding of coal mines across the mining States of Jharkhand, West Bengal, Odisha and Chhattisgarh could be a protracted process, the effects of which would be felt for months. The electricity output in July (0.6%) was marginally better than June (-1.2%), but was much worse that last July’s 7.9%. But these numbers may well be the calm before the storm. Tariff-impacted sectors such as textiles (-1.4%), apparels (3.2%), and leather (-3%) have already begun exhibiting signs of stress. The fact that these sectors are labour intensive and heavily dominated by India’s MSME sector makes the strain on the economy more acute. While the Centre has promised to address the near-term liquidity concerns of these sectors, the more human fallout of the highly probable large-scale job losses must be addressed if the gains from the historic easing in retail inflation for nine consecutive months are to be leveraged in a sustained manner to maintain, if not expand, consumption demand, and support India’s rural economy.\rREAD MORE Published - August 30, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        economy (general)\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        food\n                    \n                            /                      \n                        \n                        flood\n                    \n                            /                      \n                        \n                        mining\n                    \n                            /                      \n                        \n                        Jharkhand\n                    \n                            /                      \n                        \n                        West Bengal\n                    \n                            /                      \n                        \n                        Orissa\n                    \n                            /                      \n                        \n                        Chhattisgarh\n                    \n                            /                      \n                        \n                        textile and clothing\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        employment",
        "headline_1": "​Calm before the storm: On the economy, impact of U.S. tariffs",
        "headline_2": "The fall-out from probable job losses needs to be addressed",
        "link": "https://www.thehindu.com/opinion/editorial/calm-before-the-storm-on-the-economy-impact-of-us-tariffs/article69989848.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "31-08-2025"
    },
    {
        "full_article": "When ambition & loyalty pull in opposite directions\nAmbitious is great and ambition is dangerous. JD Vance has had a singular focus on making yuge goals. He went from being a never-Trumper to yes-man without whiplash. His next big thing is obviously the 2028 presidential election. This means a tricky tightrope. Show Trump that you are champing at his job, and he could fling you into the fifth circle of hell. Slick Vance has played it like a fox so far. But he has slipped up in a USA Today interview. He said, gasp, if there’s a “terrible tragedy”, he’s there, and he’s gotten the bestest of on-the-job training over the last 200 days.\nNothing we know about Trump says that he will take kindly to these words. Actually, which leader, in any field, would like their No 2 speculating about them shuffling off the mortal coil? Vance’s father was also named Donald, so there could be Oedipus complex type of stuff going on inside him as well. Historically, getting a raw deal has been part and parcel of the veep’s job, a tradeoff for playing in the presidential league. Asked about his VP Nixon’s contributions, Eisenhower famously said, “If you give me a week, I might think of something.” Trump can likely do better. Will he do it by phone? Vance got aboard the Trumpmobile after a lot of, as Trump said, “kissing my ass”. Staying on it up to 2028 will need tonnes more of the same.\n\n",
        "headline_1": "The Vance Dance",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-vance-dance/",
        "news_paper_name": "The Times of India",
        "publish_date": "31-08-2025"
    },
    {
        "full_article": "Silence is golden, but India is nerve-wrackingly loud\nThe old Hindi saying, “a scabbard can’t fit two swords,” may seem pointless in this age, but like that coffee mug warning – “Caution. Handle with care. I’m hot” – it might still be useful. We could print it on smartphones for the edification of public transport users who watch reels without earphones. For, what is your mind if not a scabbard fitted to the sharp edge of your thoughts? The neighbour who blunts it with shorts or reels commits a grave misdemeanour indeed.\nBut maybe that’s too subtle a hint. We could take a leaf out of Transport for London’s book. They’ve launched a campaign to urge “headphone dodgers” to plug in on buses and trains, because the vast majority of passengers – 70% per their survey – do not like second-hand entertainment. Londoners call it “bare beating” – and “sodcasting,” when they’re not mincing words. Mind you, they’ve got strict laws against it – two years ago, a man was fined £300. But they’re trying to spare the rod now. Good luck to them, and the French, who fined a man 200 euros for making a speaker call at a train station in Feb.\nIn India, we won’t know where to start. Punjab Police is having a tough time checking bikes with loud exhausts. SC’s old order about the use of loudspeakers at night opted for early retirement, it seems. German laws prohibit hammering, drilling, sawing at home on Sunday. Lol. Psychologists have speculated that noise is a way of marking territory. On the road, in a train, late at night, the loud man or woman throws down the gauntlet to everyone else. But most people are averse to picking up the gauntlet. So, noise wins, mostly. A scabbard may be made to fit two swords after all.\n\n",
        "headline_1": "High desibels",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/high-desibels/",
        "news_paper_name": "The Times of India",
        "publish_date": "31-08-2025"
    },
    {
        "full_article": "Silence may be golden, but India sure loves being loud.\nHave you ever been on a bus or train and someone nearby is blasting reels or music without earphones? Annoying, right? In London, they actually have a name for it – “sodcasting” – like broadcasting, but really, really unwanted. They even fine people for it. One guy had to pay £300 (around ₹30,000!) for making too much noise. In France, another man got fined just for taking a loudspeaker call at a train station.\nIn India, it’s a whole different story. We’re noisy everywhere – bikes with roaring exhausts, loudspeakers blaring at night, drilling and hammering at odd hours. Rules exist, but they’re not really followed.\nWhy are people so loud? Some psychologists say making noise is like marking your territory – saying “This is my space!” Whether on the road, at home, or on a train, the loudest person kind of wins because most people don’t want to fight back.\nSo maybe, just maybe, our old saying about “two swords in one scabbard” does work: our minds are like scabbards (covers for swords), and noise from others can clash with our own thoughts. But in India, it seems we’ve made peace with carrying more than one sword at a time—whether we like it or not.\n\n",
        "headline_1": "High Desibels",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/high-desibels-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "31-08-2025"
    },
    {
        "full_article": "How his TV comic days shaped his wartime leadership\n“I am reporting here from the heart of Russia, if it has any heart left at all.” That was Zelenskyy filming a segment of his then weekly news parody from the edge of Red Square in Moscow in 2014. Just a few months after Russia had taken over Crimea. Zelenskyy had lived in Moscow for six years where his company, Kvartal 95, had massive productions from movies and sitcoms to variety shows. All in Russian. But Russia’s annexation of Crimea changed all that.\nThe Showman by Simon Shuster is the Zelenskyy book the world needed for insights into the mind of the Ukrainian leader. From barely known around the world as a comic-turned-politician, Zelenskyy is now one of the most recognisable faces, and for many, the leader Ukraine needed when the full-scale war began in 2022.\nShuster argues the beginning of this transformation goes back to Zelenskyy’s formative years in 1980s’ Kryvyi Rih. Zelenskyy belongs to the generation that saw the transition from the Soviet Union to free Ukraine, and this would impact his life choices going forward. Like his choice to be a performer instead of a more traditional profession that his Russian-speaking, Jewish, Soviet family wanted.\nShuster’s extensive reporting background on Russia and Ukraine gives him a good insider view into the Zelenskyy presidency and Kyiv’s response to the Russian invasion. Pieced together through extensive interviews with not just Zelenskyy but also those closest to him, both within his administration and personal circle, the book provides a riveting account of the early days of the full-scale war and the years leading up to it.\nWhen Russian guns opened up on Feb 24, 2022, nobody knew if Zelenskyy and his team would stick around. But as thousands of cars made their way out of Kyiv, Zelenskyy’s was moving in the other direction to the centre of the city where the presidential offices stood. When Oleksiy Danilov, then secretary of national security and defence council, pulled up to Zelenskyy’s office, the president asked a one-word rhetorical question in Russian: translated, it’s “Let’s kick some ass?”\nPer Shuster, this confidence in the face of odds is typical Zelenskyy. His entry into politics was a huge leap of faith too. Russia’s annexation of Crimea and the war in Donbas played a part in that decision. Those days he and his troupe would tour the frontline to entertain Ukrainian soldiers. Those interactions with men who were defending the country – unlike the elite sitting in Kyiv far removed from the war – proved to be pivotal in pushing Zelenskyy to run for office.\nBut in his initial years as president, he wanted to make peace with Russia. He had an innate belief that if he could directly talk to Putin, this madness could end and thousands could be saved. But Putin clearly had other ideas. The Russian massacre in Ukrainian towns and cities like Bucha following the full-scale war shook Ukrainians and the world, and would eventually stymie initial attempts at a negotiated settlement. Zelenskyy also thought he and Trump would get along given their reality TV background. But the Hunter Biden controversy put paid to that. It’s all this baggage that colours the war today: Putin’s cold calculations and Trump’s history with Zelenskyy – caught in the middle, a wartime leader who desperately wants peace.\n\n",
        "headline_1": "What made Zelenskyy what he’s today",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/what-made-zelenskyy-what-hes-today/",
        "news_paper_name": "The Times of India",
        "publish_date": "31-08-2025"
    },
    {
        "full_article": "We are quite concerned to learn about the errors and inconsistencies that remain in the Public Service Ordinance, 2025 despite two rounds of revisions. Following administrative unrest after the July 2024 uprising, the interim government amended the Government Service Act, 2018, to address issues related to discipline, accountability, and efficiency in public administration. As the amendment issued on May 22 sparked protests among civil servants, the authorities revised the ordinance again and published a second amendment on July 23. Yet, quite a few inconsistencies have still remained, drawing criticism from both service holders and experts who warned that the ordinance will remain ineffective unless its flaws are addressed.\nTake for example Section 37(Ka-9), which empowers either the \"appointing authority\" or \"the individual framing the charges\" to impose penalties on an official found guilty of breaching service rules. But allowing the individuals framing charges to impose penalties contradicts Article 135(1) of the constitution, which states that only the appointing authority may dismiss or penalise a civil servant. Besides, there is ambiguity regarding the scope for a public servant to seek a review of disciplinary punishment. While Subsections 10 and 11 outline punishments for misconduct, Section 37(Ka) is not referenced in Sections 34 and 36, which grant employees the right to appeal and request reviews. This raises concerns that those punished under Section 37(Ka) may be excluded from these protections.\nMoreover, the recently amended ordinance allows only one show-cause notice to the accused employee before punishment is imposed. But imposing a different penalty than stated in the notice, after the accused's reply, would violate Article 135(2) of the constitution, which guarantees a fair chance to respond to the specific proposed punishment. Furthermore, Section 37(Ka-1)(a) of the ordinance defines disobedience or violation of official directives as \"misconduct\", which is already covered under Rule 2(b) of the Government Servants (Discipline and Appeal) Rules, 2018. This overlap creates a risk of dual punishment under two separate legal frameworks.\nIt is baffling how such glaring inconsistencies could persist in the ordinance despite being reviewed by a high-level government committee. This clearly reflects the inefficiency and lack of sincerity of the team responsible for the amendments. Rules or laws of this nature should not be rushed; rather, adequate time and care must be taken to ensure they are comprehensive. We, therefore, urge the government to revise the ordinance once more and eliminate the existing flaws and inconsistencies. In doing so, it should also seek input from relevant experts.\n",
        "headline_1": "Don’t compromise public service rules",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/dont-compromise-public-service-rules-3972166",
        "news_paper_name": "The Daily Star",
        "publish_date": "31-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 31, 2025 00:00:00  \nWhile the severity of Bangladesh's air pollution is no longer surprising, a new study provides a grim new picture of its damage. The latest Air Quality Life Index (AQLI) 2025 update found that this invisible menace is robbing every citizen of 5.5 years of life expectancy today. In the capital Dhaka, the figure rises to an almost unthinkable 6.9 years, meaning compliance with WHO guidelines would grant Dhaka residents nearly seven additional years of life. In Chittagong, the second-largest city, the loss is more than six years. To put this into perspective, air pollution is now the single greatest external threat to human life in the country, surpassing the combined toll of tobacco use, malnutrition and unsafe water. Life is already too short, but the fact that the very air people must breathe to survive is what cuts it short constitutes a tragic irony. \nAccording to the AQLI study, every one of Bangladesh's 166.8 million people lives in an area where particulate pollution levels exceed both national and WHO standards. Even districts traditionally deemed less polluted are now suffering from dangerously high particulate concentrations. In Lalmonirhat, for example, levels are seven times higher than the WHO guideline. The problem is worsening over time, with the study showing that particulate pollution has risen by more than 66 per cent since 1998, cutting life expectancy by an additional 2.4 years. Much of this increase stems from human activity that produces airborne particulates with little regulation. In cities and towns across the country, construction projects of all sizes operate with blatant disregard for public health, blanketing neighbourhoods in dust. Added to this are vehicular emissions, factory discharges, power plants burning high-sulphur fuel and the widespread use of brick kilns. These combined sources of pollution have, over decades, degraded air quality to such dangerous levels that it has become a persistent public health crisis. Notably, the impact extends far beyond mortality, as long-term exposure inflicts severe non-fatal health consequences. It is closely linked to cardiovascular diseases, chronic asthma, pulmonary insufficiency and developmental harm in children who are especially vulnerable during critical growth phases.\nThe question is, how long will the government continue to treat this public health menace with indifference? Despite the scale of this crisis, little has been done to control it. Although the Department of Environment has rules to address such activities, enforcement remains weak and selective. This failure must end. Consistent and impartial enforcement of existing laws is essential and must target large developers and industrial polluters with equal vigour. Action is also required on the roads through stricter vehicular emission standards, alongside firm deadlines for removing unfit vehicles. On construction sites, dust-control measures have to be mandatory and backed by heavy penalties for violations. Urban planning should also integrate more green spaces, allowing vegetation to serve as natural air filters in crowded cities.\nCrucially, Bangladesh's struggle cannot be seen in isolation, as South Asia remains the most polluted region in the world. This is hardly surprising given the intense population density and the transboundary nature of polluted air which routinely drifts across borders and worsens conditions in many cities. Such realities make regional cooperation indispensable. Bangladesh must therefore complement domestic measures with joint efforts alongside its neighbours to address transboundary emissions. At the same time, the urgency of the crisis demands that the government treat clean air as the foremost public health priority because this is the most urgent and vital intervention the country can pursue.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Poor air quality: Indifference takes a heavy toll",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/poor-air-quality-indifference-takes-a-heavy-toll-1756564239",
        "news_paper_name": "The Financial Express",
        "publish_date": "31-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       August 31, 2025 00:00:00  \nThe bond market's performance last fiscal year was truly exceptional, particularly in the secondary trading of fixed-income government securities. The annual volume of secondary transactions in these securities soared to an unprecedented high, marking a significant 88 per cent growth over the previous fiscal year, and reaching a staggering Tk 3.21 trillion. This figure represents the highest annual secondary transactions of treasury bills and treasury bonds in the country's bond market, which is primarily dominated by government bonds. Notably, the third quarter of the past fiscal year witnessed a record-high secondary transaction of government securities, amounting to Tk 1.14 trillion, which is around one-third of the annual trading.\nEarlier in FY22, the market experienced the highest annual secondary transactions worth Tk 2.017 trillion, which then saw a sharp decline of 47 per cent to Tk 1.09 trillion. However, the secondary trading of the government securities didn't stay sluggish for long, but later rebounded reaching Tk 1.70 trillion in FY24. This resilience was further demonstrated during the last decade, when the lowest amount of secondary trading occurred in FY18, with a value of Tk 153.34 billion.\nThe significant increase in secondary trading of government securities carries profound implications for Bangladesh's financial market. It not only reflects a burgeoning interest in secure returns among institutional and individual investors but also signifies the market's steady march towards maturity.\n\nIt is worth noting that treasury bills are short-term debt instruments of the government, while treasury bonds are long-term in nature. Bangladesh Bank, on behalf of the government, issues the treasury bills to manage day-to-day liquidity. It also issues treasury bonds to mobilise long-term debt for the government to finance the budget deficit. Selected banks are now authorised primary dealers (PD) to purchase the bills directly through the auction conducted by Bangladesh Bank. Other banks and financial institutions are allowed to buy and sell the bills and bonds among themselves in the secondary market as a secure investment. Individuals can also invest in these fixed-income securities.\nA higher yield on treasury bills and bonds is a critical factor in attracting investors and facilitating the transfer of securities in the secondary market. Yield refers to the return that an investor receives from an investment, such as a stock or a bond. It is usually reported as an annual figure. In bonds, as in any investment in debt, the yield is comprised of payments of interest known as the coupon.\nBangladesh Bank statistics showed that the weighted average yield on 91-day, 182-day, and 364-day treasury bills increased to 11.94, 11.90, and 12.01, respectively, at the end of FY25, against 11.64, 11.98, and 12.01, in FY24. The rise in yield was significantly higher in FY24 compared to FY23, when the yield on all government securities was at a single-digit level. Moreover, the yield on all treasury bonds declined slightly at the end of FY25 compared to FY24, although it remains at a double-digit level. The higher yield, however, made borrowing through these securities costly for the government.\nThe central bank, in its latest annual financial stability report, stated that yields on government securities rose across all tenures, thereby increasing borrowing costs. \"The Treasury auction yields in December 2024 were considerably higher for all maturities compared to those of December 2023,\" it added. \"Consequently, the treasury auction yield curve shifted up notably and remained elevated in December 2024 for both the short-term treasury bills and long-term treasury bonds. The increasing cost of government borrowing is reflected in this upward shift in the yield curves.\"\nBangladesh Bank statistics showed that the government's net domestic borrowing in the last fiscal year stood at Tk 1193.65 billion against Tk 947.40 billion in FY24. Of these, the government borrowed Tk 416.85 billion through the issuance of treasury bills and Tk 1,225.87 billion through treasury bonds. The monthly report of the central bank in this connection said: \"Government domestic borrowing from the banking system during July-June of FY25 showed slower growth compared to the same period of FY24, owing to larger repayment of the previous debt. However, non-bank borrowing (net) for the same period under review showed a significant rise relative to the corresponding period of FY24, primarily due to substantial holdings of government securities by different institutions and individuals other than banks.\"\nGovernment borrowing through these instruments is linked to the secondary market in terms of issuance. After issuing these bills and bonds, the primary investors, specifically commercial banks, bring them to the secondary market for a higher return.\nAs the central bank maintained a tight monetary stance to curb inflation, it had to allow a rise in interest rates, which in turn affected the yield of the treasury bills and bonds. The issuance of treasury bonds with different maturities also increased in the past year, further influencing the market dynamics.\nAround 99 per cent of the secondary trading of government securities was conducted using the BB system (Over-the-Counter and Trader Work Station mechanism), while the remaining portion was traded on the stock exchange platform. Trading of these securities on the stock exchange platform began in 2023. It means that secondary trading of treasury bonds in the stock exchange is still tiny. Moreover, institutional investors, such as provident funds, insurance companies, and mutual funds, primarily use the stock exchange platform, where individual participation is limited.\nThe number of listed treasury bonds was 234 at the end of the last fiscal year, when transactions of these bonds in the DSE increased to Tk 1.46 billion from Tk 1.45 billion in FY24. Interestingly, the capitalisation of listed treasury bonds was 49.77 per cent in the last fiscal year, although the ratio of transactions in these bonds was less than one per cent of the total turnover on the DSE.\nNevertheless, corporate bonds are nowhere in this market. In the last fiscal year, the market capitalisation of the 16 listed corporate bonds was less than one per cent in DSE. The issuance of corporate bonds also declined, indicating a subdued nature. Without a vibrant corporate debt segment, the government's debt securities, which dominate the bond market, will not bring the optimal maturity in the financial market.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Govt bond market shows vibrancy",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/govt-bond-market-shows-vibrancy-1756564382",
        "news_paper_name": "The Financial Express",
        "publish_date": "31-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 31, 2025 00:00:00  \n\nClimate change is one of the most significant problems in today's world. We can see its effect everywhere. The weather is no longer typical. Sometimes it rains too much, sometimes there is no rain at all. Summers are hotter, winters are shorter, and floods or cyclones happen more often.\nHuman activities are the main reason. We cut down trees, use excessive plastic, and burn fuel in cars and factories. These actions produce smoke and harmful gases that contribute to global warming.\nMany people think climate change is a global issue and that only governments can solve it. However, the truth is that we all have a role. If we save electricity, plant trees, reduce waste, and use less plastic, we can help the environment.\nYoung people can play a huge role. They can raise awareness, use new ideas, and inspire others to live in a greener way. Schools and families should also teach children to love and protect nature.\nAt the same time, governments must take strong steps. They should utilise more renewable energy, enhance public transportation, and support individuals affected by floods or cyclones.\nClimate change is not just about nature-it is about our own lives and future. If we take care of the earth, the earth will take care of us.\nArshie Akter Sunny\nMass Communication and journalism\nJagannath University, Dhaka\nEmail:arshieakter205@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Climate change and our responsibility",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/climate-change-and-our-responsibility-1756564401",
        "news_paper_name": "The Financial Express",
        "publish_date": "31-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 31, 2025 00:00:00  \n\nCreating a Palestinian state on the West Bank of the River Jordan and Gaza on the Mediterranean coast has been a cherished dream of Palestinians since 1947. Palestinians in the West Bank and eastern Jerusalem have been living under Israeli occupation since 1967. Moreover, the settlements Israel has built in the West Bank are home to 500,000 Jewish people and are deemed to be illegal under international law, although Israel disputes this. There are also disputes over the status of diaspora Palestinians and the question of whether Palestinian refugees should be allowed to return to lands once they were displaced from. \nPalestinians have been striving for self-determination but have achieved only limited control over their affairs. Relations with the Israeli authorities have been marked by violent conflicts over the years. The economy of Palestine is fragmented and subject to Israeli restrictions. Now the people are starving and dying of hunger owing to the protracted conflict, war and blockade. The United Nations (UN) has declared famine in Gaza, West Bank and Jerusalem. But the world is unable to take bold action to stop the man-made famine. Gaza is shattered by the incessant bombing by Israel and normal life has been made impossible there. Much of the population is dependent on food aid. But Israeli army is now allowing entry of necessary food aids. At their whims, Palestinian people are also being killed at the relief distribution grounds like a Zombie-game. The neighbouring Arab countries are watching such massacres happening in Gaza.\nNow, we have to believe that these states are very feeble to take actions against the Zionists' ferocities. Instead, they are allowing them to lionise their attitude toward the establishment of Palestine sovereign state and the Palestinians' right to live. The nations across the world need to put pressure on Israel to stop the war and killing of civilians by using the weapon of starvation and hunger. Otherwise, the rest of the world will never be forgiven. \nAbu Taher\nKawran Bazar, Dhaka\nabutaher011@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Israel created famine to eliminate Palestinians",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/israel-created-famine-to-eliminate-palestinians-1756564414",
        "news_paper_name": "The Financial Express",
        "publish_date": "31-08-2025"
    }
]