[
    {
        "full_article": "The BJP-led NDA and the Congress-led Opposition parties have announced their respective candidates for the post of the Vice-President of India, which fell vacant after the abrupt and intriguing resignation of Jagdeep Dhankhar on July 21, 2025, setting the stage for a fresh face-off. The numbers are foretold and there is no surprise in store about the outcome. However, this is a significant ideological battle, and both sides see it as such. The NDA’s candidate, C.P. Radhakrishnan, is a veteran RSS activist from Tamil Nadu, who has served as a two-term Member of Parliament, from 1998 to 2004. He is the Governor of Maharashtra. The INDIA bloc parties have chosen B. Sudershan Reddy, a retired judge of the Supreme Court of India, born and raised in undivided Andhra Pradesh. The NDA has a majority and is on a drive to canvas additional unattached individual voters and parties such as the BJD and the BRS. The YSRCP, bitterly opposed to the TDP, the NDA’s partner, in Andhra Pradesh, has pledged its support to Mr. Radhakrishnan. Justice Reddy’s candidacy has set off some regionalist political posturing in Andhra Pradesh and Telangana, while Mr. Radhakrishnan’s has caused the same in Tamil Nadu. On this count, the INDIA bloc managed to push back the NDA’s attempt to put the DMK on the defensive ahead of the State Assembly election. The BJP hopes that Mr. Radhakrishnan’s elevation will gain it some mileage in the Assembly election.The political messaging cannot be clearer. By offering the second-highest office in the country to a life-long adherent of Hindutva, the BJP has fastened its ties with its mother ship, the RSS. Mr. Radhakrishnan’s profile is in stark contrast with Mr. Dhankhar, who was a late entrant into the Sangh Parivar and failed to fit in. The BJP has used state power, which it controls, in a systematic and effective manner to advance Hindutva. Numerous personality clashes notwithstanding, these shared convictions hold the Sangh Parivar together. Not only has the BJP managed to hold its existing partners firmly behind its candidate but it has also managed to win over the YSRCP. As for the Congress and the Opposition, Justice Reddy’s candidacy is an assertion of its resistance to the Parivar and an attempt to amplify their social justice slogan. Justice Reddy recently headed the 11-member independent expert working group that had analysed and interpreted the data collected during the Telangana Congress government’s Socio, Economic, Education, Employment, Political and Caste (SEEEPC) Survey 2024. They also hope to use this contest as a rallying cry for the Opposition to consolidate against the BJP.READ MORE Published - August 21, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        election\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        National Democratic Alliance\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Biju Janata Dal\n                    \n                            /                      \n                        \n                        Bharat Rashtra Samithi\n                    \n                            /                      \n                        \n                        Telugu Desam Party\n                    \n                            /                      \n                        \n                        Andhra Pradesh\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Assembly Elections\n                    \n                            /                      \n                        \n                        Yuvajana Sramika Rythu Congress Party\n                    \n                            /                      \n                        \n                        Caste\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        survey\n                    \n                            /                      \n                        \n                        Telangana",
        "headline_1": "​Making a point: On the election of the Vice-President",
        "headline_2": "The election of the Vice-President is an opportunity for parties to score points",
        "link": "https://www.thehindu.com/opinion/editorial/making-a-point-on-the-election-of-the-vice-president/article69956065.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "21-08-2025"
    },
    {
        "full_article": "The Manipur High Court’s order to the State to issue fresh academic certificates to Beoncy Laishram is at once a matter of individual justice and a larger commentary on the state of transgender rights. What should have been a simple administrative correction became a legal battle, not because the law lacks provisions but because its implementation remains frustrated by inertia and bureaucratic rigidity. In NALSA vs Union of India, the Supreme Court recognised the right to self-identify gender and ordered the state to treat transpersons as socially and educationally backward classes entitled to welfare measures. The principle was codified in the Transgender Persons (Protection of Rights) Act 2019, which also obligated authorities to recognise a person’s self-identified gender and issue official documents. Together with Articles 14 and 21 of the Constitution, transpersons are thus entitled to having their affirmed identity seamlessly recognised in all institutional records. Yet, their lived reality is very different. Despite the law being clear on self-identification, bureaucratic setups often do not act unless compelled by higher authorities. In Dr. Laishram’s case, her university refused to update her educational records citing procedural hurdles — symptomatic of a systemic malaise. Administrators routinely defer to the most restrictive reading of procedure rather than the spirit of the law. In the present matter, the university and education boards insisted that corrections must begin with the earliest certificate, qualifying recognition on a cascading set of bureaucratic approvals.Where the law envisages gender as a matter of self-determination for transgender individuals, many officials remain wedded to the binary markers assigned at birth, and the mismatch translates into a stunted application of a simple idea. The insistence on sequential corrections or elaborate justifications is essentially a refusal to accept that gender identity is not derived from paperwork. Dr. Laishram’s struggle also shows how institutional reluctance to operationalise this principle forces transpersons into prolonged legal contests over what should be routine matters. Such episodes reveal a troubling truth: transpersons, navigating stigma and discrimination, are forced to expend disproportionate time and resources to access rights that are legally theirs. The High Court judgment is undoubtedly positive: it also sets a precedent that may help other transpersons and signals to administrators that procedural rigidity cannot override constitutional and statutory guarantees. Bridging the gap between legal rights and their application will require both institutional reform and cultural change within the bureaucracy that draw from an understanding of gender as lived reality.\rREAD MORE Published - August 21, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Manipur\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        transgender\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        human rights\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        university\n                    \n                            /                      \n                        \n                        gender",
        "headline_1": "Punishing process: On gender identity recognition",
        "headline_2": "Gender identity recognition must not be trapped in bureaucratic hurdles",
        "link": "https://www.thehindu.com/opinion/editorial/punishing-process-on-gender-identity-recognition/article69956045.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "21-08-2025"
    },
    {
        "full_article": "Only a few things are for certain in India: that the price of onions will rise before an election, that an India-Pakistan match will be described as ‘more than cricket’, and that elections will never be held in monsoon. The calendar is ruthlessly clear: Our great democratic extravaganza unfolds in the comfortable shades of spring or winter. By June, when the clouds gather and the first raindrops hit, the ballot boxes are already tucked away. Coincidence? Hardly.\nIt’s not that the Indian monsoon is apocalyptic. It is not a Katrina, a Harvey or a typhoon with a Viking name. In fact, in most places the rain is oddly well-behaved. It arrives roughly on schedule, cools the earth, restores groundwater and gives farmers reason to exhale. But let it rain for two hours in Gurgaon and suddenly the Millennium City looks like an audition tape for Atlantis. Cars bob like half-hearted gondolas, office towers turn into aquariums, and WhatsApp fills with memes of corporate executives rowing to work.\nThe problem isn’t that the rain is catastrophic. The problem is that it is revealing.\nRead more on TOI+\n\n",
        "headline_1": "Of rains and votes",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/of-rains-and-votes/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-08-2025"
    },
    {
        "full_article": "Two recent acquittals have become part of a provocative discourse in India. First, on July 21, a division bench of the Bombay high court, in a 671-page ruling, overturned the 2015 MCOCA sentencing for the 7/11 serial train blasts, which had horribly torn up Mumbai in 2006.\nSecond, on July 31, an NIA court in Mumbai, after a protracted trial, acquitted all the accused in the 2008 Malegaon bomb blast case.\nThe key similarity in both acquittals is that the prosecutions failed to discharge their duties in establishing the offences beyond reasonable doubt. And then there are glaring dichotomies, which are of grave significance too.\nRead full story on TOI+\n\n",
        "headline_1": "A tale of two acquittals",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/a-tale-of-two-acquittals/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-08-2025"
    },
    {
        "full_article": "Sumit Paul\nThis is my simple religion. There is no need for temples, no need for complicated philosophy. Our own brain, our own heart is our temple; the philosophy is kindness.” – Dalai Lama.\nAug 19 is commemorated as World Humanitarian Day. While acts of humanity, sensitivity, empathy and camaraderie cannot be squeezed into just a specific day, this day reminds us of humanity’s shared destiny on earth. An individual can live fully only when he rises above individualistic concerns to broader concerns of all humanity because life’s most urgent question is, ‘What are you doing for others?’ This is the crux and purpose of human existence: What are we doing for others?\nRemember, the two most important days in the lives of all of us are the day we’re born and the day we find out why? Because it’s not enough to be just a human. We must exercise our humaneness and empathise with all. Service to others is the rent we pay for our room here on Earth. The Upanishadic concept of Vasudhaiv Kutumbakam – the world is a family – is not utopian or quixotic. The thread and spirit of humanity and empathy run through all souls and all individuals.\nIf our souls aren’t stirred by what’s happening in Gaza, Ukraine, Afghanistan and many parts of the world, we’re dead souls of Russian author Nikolai Gogol’s novel. Jalaluddin Rumi says in Dari (Afghan variant of Persian), “Kaz min anfaas nee insaan,” – just to breathe doesn’t make us a human. To be human, you must be humane and adopt a humanitarian approach and attitude towards all beings, not just humans.\nIt’s worthwhile to mention that in Islamic mysticism and spirituality, tasawwuf, there’s a subtle difference between aadmi and insaan . The former is one who breathes – jo’dam’le woh aadmi – the latter is endowed with Uns – universal love; Agape of Christianity, Uns or Unsiyat is Arabic for love. Jis mein Uns ho woh insaan hai . We can all experience love, no matter who we are or where we come from. No matter our differences in background, culture, or beliefs, love connects us all.\nIt is a powerful force that unites people from all walks of life and brings communities together in times of joy and sorrow. Love transcends boundaries and reminds us of our shared humanity, making it the most precious and enduring aspect of the human experience. Whether it is love for family, friends, or even strangers, it is the common thread that weaves us all together in a world that can often feel divided.\nAn individual’s humanity and humaneness can bring about a universal change. This is humanitarianism. In these uncertain and gory times when mankind is beleaguered, even the smallest act or deed of love and empathy can make a difference. Urdu-Persian poet ‘Nashtar’ Nishapuri said, “Ya toh har chehra muskuraye ya phir har chehra ro de/Jazbaat sab ke ek se hon, sabhi saath hansein, sabhi saath royein” – Every face should either smile or cry/ Feelings of all should be the same; all should smile and cry in unison. Let us act right now.\n\n",
        "headline_1": "Let’s make the world a humane place",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/lets-make-the-world-a-humane-place/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-08-2025"
    },
    {
        "full_article": "Talks end in no ceasefire, no peace agreement\nIt is impossible to win an argument with Kamala. Even when she is obviously in the wrong, she will sit me down like in a press conference and explain how I am actually responsible. And she can be very convincing. ECI should recruit her in its defence. Putin and Trump could also benefit from her negotiating skills. Every person in the room listening to her version of the story would be certain she was an innocent victim who did not deserve to be blamed.\nIt all started with a wedding on her side of the family. I went along dressed up in a bandgala, determined to keep my mouth shut. Her family politics is more complicated than the Russia-Ukraine war. There are uncles who will not speak to us, and aunties who may smile at us but are not to be spoken to. Everyone knows the old Thaatha sitting in the front row is the root cause of the conflict, but no one says so. Kamala left me stranded in the middle of this war zone and wandered off cheerfully to a group of matriarchs fussing over the bride’s jewellery.\nThe inevitable happened. An uncle walked up and enveloped me in a bear hug, the kind politicians use on the world stage. ‘You know me…I’m Piyush Uncle. I stayed in the house behind yours!’ A population of more than 1.4 billion could hold many people named Piyush. There could be eighty people living in the same house and their house numbers could all be zero. Their father’s name could be fcdpg for all I cared. Even a PowerPoint presentation could not make things obvious for me.\nHe began talking about his share of the ancestral property and I could see that I was being projected onto the big screen and Kamala had noted my discomfort. She swooped down and removed me from the scene like a street dog from Delhi-NCR. ‘Why are you talking to that man!’ she hissed at me angrily. Apparently he belonged to that side of the family that had encroached on the family property decades ago. I was summoned by the old Thaatha in the front row who attempted to broker a ceasefire. Or at least a peace agreement.\nEveryone huddled together and discussed matters seriously. Nothing seemed to change but someone was being nominated for the Nobel Peace Prize. Now Kamala insists I take an oath never to speak again in public or to submit a written apology. I elect to maintain a stoic silence. I have been commissioned as a husband to do so.\n\n",
        "headline_1": "Family war zone",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/family-war-zone/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 21, 2025 00:00:00  \nBangladesh's latest predilection for epithets like 'multimodal' seems to have become contagious. From multimodal logistics to multimodal networks to multimodal supply chain, it is likely to cover a whole range of activities in the name of development. These are fancy words that actually sound much only to end in a whimper. Better it would be to call a spade a spade and identify the real problem the country is going to face in the post-reciprocal tariff regime triggered by Donald Trump. Memorandum of Understandings (MoUs) and agreements -- bilateral or multilateral -- will never remain the same. Even the most generous partners in development of Bangladesh discover themselves in a tight corner. Japan has ever since remained a steadfast development partner of this country. Now, in the new global trade regime, the bonhomie between the two countries is sure to undergo some changes. The question is, how far that would be allowed to affect the mutual cooperation and relations based on development in Bangladesh. \nA report carried in this paper on Tuesday has referred to an upcoming four-day visit to Japan by a high-profile delegation led by finance adviser Salehuddin Ahmed. What is interesting is that the visit has been dubbed a diplomatic foray for exploring the possibility of attracting fresh Japanese investment. But then it hints at the glitches that have of late created a stalemate over the continuation of works in the on-going projects funded by the Japan International Cooperation Agency (JICA). Delegates representing the Dhaka Mass Transit Company Limited (DMTCL) and the Civil Aviation Authority of Bangladesh (CAAB) are surely an unerring indication of this fact. Both the DMTCL and the CAAB have been facing problems in implementing the JICA-funded, constructed and yet to be finished Mass Rapid Transit projects and the Third Terminal development at Hazrat Shahjalal International Airport.\nThe Economic Relations Division, however, has tried to give an impression that the tour is an experience-sharing one on advanced railway development and multimodal transport and tourism integration. This sounds rather hollow and irrelevant, particularly when the more pressing problems of metro rail construction and operation and the pressing into service the much-hyped third terminal of the Shahjalal International Airport are facing challenges over either their finishing touches or resolution of contract packages.\nIf bid prices are higher than the development project proposal (DPP) values, those, if agreed under the unalterable JICA conditions, are sure to tell on the affordability of commuters and air passengers or air freight. So, these crucial issues should get the priorities instead of the luxury of sending a mission for experiencing advanced multimodal transport and tourism integration. The more pressing economic and infrastructural issues have to be addressed right at this critical juncture of modern trade relations. Bangladesh can ill-afford losing any opportunity to seize the initiative in integration of its infrastructure, communication, supply and distribution channels in order to advance its international commercial interests that are sure to come its way. This is no time for luxury travel. The functionaries of the interim government must have their priorities right, at least at this highly testing time.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Let the government get its priority right",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/let-the-government-get-its-priority-right-1755701655",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       August 21, 2025 00:00:00  \n\nOver the years, much has been said about the necessity of export diversification to ensure sustainable growth in international trade and safeguard the economy against unforeseen global events. Yet, very little progress has been made in this regard. The ready-made garment (RMG) sector still plays an outsized role, contributing around 84 per cent of the country's export earnings. \nThere is nothing inherently wrong with the RMG industry being the cornerstone of Bangladesh's economy. Its extraordinary growth over the last three decades has lifted millions out of poverty and propelled the country from an impoverished state to middle-income status. The garment industry, which fetches about US$ 40 billion a year, is expected to grow even further, as Bangladesh's share of the global apparel market stands at only 6.5 per cent. This means as the second largest apparel exporter of the world after China, Bangladesh has considerable opportunity to expand its market share and increase foreign exchange earnings from the sector.\nHowever, over-dependence on a single sector is far from ideal for any economy, as it creates what economists call concentration risk, exposing the country to heightened vulnerability in the face of external shocks. A sudden drop in global demand, a shift in trade policies, technological disruptions, or geopolitical tensions can have a disproportionately severe impact, triggering sharp declines in export earnings, large-scale job losses and fiscal instability. Without a diversified economic base, recovery from such shocks could become slower and more painful.\nThe urgency of export diversification has gained further weight as Bangladesh prepares to graduate from the United Nations' Least Developed Country (LDC) category by 2026. Upon graduation, the country will lose preferential trade benefits currently enjoyed by LDCs, putting the RMG sector to the test whether it can sustain its global competitiveness without such advantages. Policymakers and experts, therefore, have long been saying that unless Bangladesh broadens its export basket, it risks undermining its resilience in the post-LDC era.\nBeyond garments, Bangladesh's notable exports include jute and jute goods, leather and leather products, agricultural produce, frozen foods, home textiles, pharmaceuticals, plastic products, light engineering goods, handicrafts and bicycles. The leather sector, in particular, holds considerable potential, yet its growth is constrained by the failure to ensure environmental compliance, such as obtaining Leather Working Group (LWG) certification. Without this certification, Bangladeshi leather goods face restrictions in key markets like the United States and Europe. Similarly, the desired export growth from frozen shrimp, processed foods and agricultural produce is held back by deficiencies in packaging and quality control. But the prospects and problems of other promising sectors receive far less policy attention compared to the RMG sector, which enjoys extensive state support through cash incentives, bonded warehouse facilities, preferential loans, and tailored policy measures.\nA White Paper Panel on the State of Economy last year showed that entrepreneurs aiming to diversify the export basket face a host of challenges. These include inadequate infrastructure, high logistics costs, shortage of skilled labour, slow technology adoption, limited access to finance, bureaucratic hurdles, exchange rate instability and costly regulatory compliance. Non-RMG exporters also struggle with weak product diversification, limited branding and marketing capabilities, and insufficient institutional support for small and medium enterprises (SMEs).\nThe White Paper highlights that poor transport networks, inadequate port facilities and frequent power shortages increase logistics costs and cause delays. At the same time, entrepreneurs face difficulties in securing loans due to high interest rates and limited access to financial instruments. Thus over-reliance on a few export sectors makes the economy vulnerable to market fluctuations and limits growth potential.\nAdded to the entrepreneurs' woes is the bureaucratic red tape. Lengthy administrative processes, excessive paperwork, and delays in obtaining necessary permits discourage diversification. SMEs, which could play a critical role in broadening the export base, have to grapple with limited access to finance, lack of incentives and weak government support. Therefore, in spite of the repeated calls for export diversification over the past decade, outcomes have been underwhelming. \nApart from removing the aforementioned bottlenecks to export diversification, another key priority should be to address the 'anti-export bias' in current trade policy, which makes production for the domestic market far more profitable than exporting. Anti-export bias refers to a situation where a country's trade and tariff policies make it more profitable to produce for the domestic market than for exports. This usually happens when high import tariffs protect domestic industries while exporters don't get equivalent support, discouraging firms from entering global markets and thereby limiting export growth and diversification. Since RMG sector is 100 per cent export-oriented and enjoys duty-free access for all its imported inputs, it does not suffer from this trade protection bias. But other promising sectors including footwear, leather goods, jute products, ceramics, home textiles and light engineering face substantial anti-export bias. But the implications of this trade protectionism are rarely discussed in our policy debates. The White Paper suggests that the government needs to create a more level playing field for exporters, either by reducing import tariffs or increasing export subsidies.\nOverall, a strong political will, coherent policy coordination and strong commitment for export diversification will be vital. If the country can tackle entrenched bottlenecks, foster innovation and nurture emerging industries with the same determination that fuelled RMG sector's growth, it can build a more resilient and competitive export base.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "What is holding back export diversification?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/what-is-holding-back-export-diversification-1755701960",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 21, 2025 00:00:00  \nThe job market for the youth in Bangladesh is undergoing rapid transformation. While technology and innovation are creating new employment avenues, competition in traditional sectors is intensifying. In this context, timely preparation and skill development are crucial for our young generation.\nAccording to the latest Labor Force Survey by the Bangladesh Bureau of Statistics, the national unemployment rate stood at 4.63 per cent in the second quarter of 2025. Alarmingly, the rate among educated youth is around 11 per cent, more than double the national average. Many graduates fail to secure jobs due to a lack of market-oriented skills alongside academic education. Surveys show that 29 per cent of job seekers remain unemployed for over two years, while 45 per cent do not even reach the interview stage, leading to both frustration and erosion of skills.\nOn the brighter side, Bangladesh's fastest-growing job opportunities lie in the information technology and digital sectors. Experts predict that by 2030, the IT services sector alone could generate 1.5-2 million jobs. Freelancing, web development, data analytics, cybersecurity, and digital marketing are in high demand globally. Other promising areas include renewable energy, e-commerce, agri-tech, and healthcare. Moreover, government and private investments, such as the World Bank's $850 million employment development project, are expected to directly benefit millions through skills training, entrepreneurship support, and microcredit facilities.\nTo seize these opportunities, the youth must focus on enhancing digital skills, completing accredited training and certification programmes, gaining practical experience through internships, and building professional networks. Encouraging entrepreneurship and innovation is equally important.\nBangladesh's ambition to become a high-middle-income country by 2041 will largely depend on the contribution of skilled youth. With education aligned to market needs and sustained support for entrepreneurship, our young generation can become the driving force of economic progress at home and abroad.\n\nSakibul Hasan\nDhaka College\nsakibulhasanlearning@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "New opportunities in the job market",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/new-opportunities-in-the-job-market-1755701991",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 21, 2025 00:00:00  \nMetro rail service in Dhaka city offers diverse benefits to the people residing in the capital and as well as to some in its close vicinities.\nIt has significant roles in easing traffic congestion, saving time and improving daily life of the commuters.\nRelying on this advanced transport system, people can travel across the city more comfortably and easily avoiding hazardous trips.\nBut much to the inconvenience of the commuters there has been kept no metro service after 09:40 pm from the Motijheel station.\nWith the number of commuters rising rapidly and public activities increasing day by day-especially office work, classes and social events taking longer after the dusk-many of the commuters feel an urgency of getting the most reliable transport service around 11:00 pm.\nCurrently, the last metro service is available till before 11:00 pm, which causes much inconvenience to those needing to travel even later.\nAn additional train at 11:00 pm would not only solve this issue but also encourage more people to use public transport during late hours.\nMost of the time, people are often forced to rely on expensive or unsafe alternatives.\nOn the other hand, all late-night travellers are seriously fed up with heavy traffic jams at Farmgate, Shahbagh, Bijoy Sarani, and Mirpur-10 intersections until midnight regularly.\nSo, it is hoped that necessary steps would be taken to extend metro train service up to 11:00 pm, taking into account the greater interest of the general public.\nPizush Kanti Mallick\nSenpara, Mirpur-10, Dhaka\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Extend metro rail service",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/extend-metro-rail-service-1755702021",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-08-2025"
    }
]