[
    {
        "full_article": "The Narendra Modi government has announced seven delegations to canvas support for India in global capitals, in the aftermath of its recent conflict with Pakistan. The declared intent of these delegations — with representatives from political parties, diplomats and strategic experts — is to demonstrate before the world, the unity and the character of India in the face of sectarian terrorism sponsored by Pakistan. That the members are from several political, religious, caste and regional backgrounds, is in itself a panoramic show of the founding vision of India. The modern Republic of India adopted for itself the principle that all diversities can coexist and flourish together. This is in stark contrast with the idea of Pakistan, which was reiterated with chilling clarity by its Army chief Asim Munir weeks before the Pahalgam terrorist attack on April 22, 2025. The two-nation theory that led to the bloody division of the subcontinent and the creation of Pakistan holds that Hindus and Muslims cannot be a part of the same national community. The decline of Pakistan and the rise of India in all fields of human progress prove beyond any doubt the fallacy and the dangers of Pakistan’s vision and the promise of India. In a time of national challenge, a reiteration of that founding vision can be rejuvenating.But there was inadequate appreciation of this fundamental distinction between India and Pakistan in many capitals in the aftermath of Pahalgam. There are many reasons and India has to win back world opinion in its favour through its actions and words, at home and abroad. Statements by several world leaders appeared to place India and Pakistan on the same footing. With decades of diplomatic efforts and its own performance as a pluralistic, secular democracy and a dynamic economy, India has built a healthy perception about itself in the eyes of the world. The capable and articulate delegates can be expected to restate that message of India effectively in world capitals. The Narendra Modi government showed statesmanship and wisdom in deciding to reiterate India’s unity and pluralism through these delegations. But the controversy around the selection of Congress representatives and continuing statements by BJP leaders that label political opponents as anti-nationals undermine the very attempt of unity. The government and the Congress, the principal Opposition party, should have communicated better with regard to the composition of these delegations. But now that the names have been decided, the Congress should not object to the nomination of its Lok Sabha MP, Shashi Tharoor, an international diplomat who has served as a Minister of State for External Affairs when it was in government. To politicise the nominations will serve no purpose and the Congress would only be seen doing what it accuses the BJP of: political mischief. Published - May 19, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Narendra Modi\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        armed conflict\n                    \n                            /                      \n                        \n                        international relations\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        religion and belief\n                    \n                            /                      \n                        \n                        India-Pakistan\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party",
        "headline_1": "Show of cards: on Operation Sindoor and government’s delegations",
        "headline_2": "Now is not the time to fight over the composition of the delegations",
        "link": "https://www.thehindu.com/opinion/editorial/show-of-cards-operation-sindoor-and-government-delegations/article69590311.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-05-2025"
    },
    {
        "full_article": "In contemporary spaceflight, cost, reliability and time form a tense triangle. Whether more money can ensure more reliability is tricky to answer, more so following the failure of ISRO’s PSLV-C61 mission to launch the EOS-09 earth-observation satellite into a sun-synchronous polar orbit. EOS-09 was designed to produce high-quality radar images for civilian applications such as land-use mapping and hydrology studies and for defence surveillance, even if inclement weather prevailed over the areas of interest thanks to a synthetic aperture radar and a C-band data-link. Against the backdrop of tensions with Pakistan, such all-weather data would also have informed tactical decisions. The Department of Space had also invited several Members of Parliament to the launch event, which would have been unusual for a strictly civilian earth-observation satellite. ISRO chairman V. Narayanan later said that his team noted a glitch in the vehicle’s third stage minutes after liftoff that prevented the satellite from reaching its intended altitude. While the cause is yet to be ascertained, the failure is a reminder that a “textbook” launch of a rocket even as well-understood as the PSLV is not a given.India is just embarking on its ambitious Space-Based Surveillance-3 programme to launch 52 surveillance satellites; 31 are to be built in the private sector, which still needs ISRO’s guidance. Focus on the programme also comes against the backdrop of Operation Sindoor, which revealed at least one gap in the country’s space-based military surveillance capabilities when it depended on a foreign commercial operator for more frequent data. Small margins of error in a rocket components’ operations separate success from failure, and thus cost from reliability. Time, however, is a separate matter: the pressing need for surveillance capabilities, if not improving the understanding of climate change and disaster risk over India, means that developers lack the luxury of time while also coming under greater pressure to deliver across both civilian and military domains. The PSLV-C61 failure follows the failure in January to place the NVS-02 navigation satellite into its designated orbit. Between an increasingly crowded launch manifest, research and development, data acquisition and processing pipelines, limited access to manufacturing capacity, and the human spaceflight programme, it will not be remiss to increase the resources available to ISRO if only to ensure its ability to meet India’s military needs while carrying on with other enterprises, all of which are becoming time-sensitive in a highly competitive global industry. Published - May 19, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        space programme\n                    \n                            /                      \n                        \n                        satellite technology\n                    \n                            /                      \n                        \n                        ISRO\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        defence\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025",
        "headline_1": "​Tough timing: on ISRO PSLV-C61 mission, India’s space programme",
        "headline_2": "ISRO needs more resources to support India’s military needs",
        "link": "https://www.thehindu.com/opinion/editorial/tough-timing-on-isro-pslv-c61-mission-indias-space-programme/article69590117.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-05-2025"
    },
    {
        "full_article": "Authored by GS Tripathi\nGreat people are publicly admired and face criticisms, too. However, a person who is publicly admired, but not criticised is not great; he might be mighty, but intolerant. Those who are neither respected nor criticised publicly are ordinary folks. It does not mean that these people are never admired or criticised. They have their short-range quotas among their limited admirers and critics. In other words, admiration and criticism for them occur somewhat privately.\n\nThe Bhagwad Gita advises that one should do one’s duty, whether it be pleasantor unpleasant, without bothering about admirations and criticisms. A common human tendency is to embrace pleasantness and avoid unpleasantness. However, life is not a bed of roses.\nWhen we wish to honour somebody, we usually admire him. This does not mean that the person has only virtues, and no vices. It is simply overlooking the negative side. Chanakya Niti says, “Learned people have only virtues, and no vices.” This is said to emphasise the role of learning in life; it should not imply that they have no weaknesses.\n\n\nAll human beings have both strengths and weaknesses. There is a saying that all saints had a past, which might not be so saintly. Folklore says that Maharishi Valmiki was a wicked man, Daku Ratnakar, in his teens and adulthood. Somewhat similar was the case with Angulimal, a cruel man, who changed after encountering the Buddha. Thus, transformations in life are not uncommon. It is also true with matter that transforms with temperature, pressure and other extraneous forces. Rigidity resists transformation, while flexibility allows it. Both life and matter have these traits.\n\nPeople are happy when their strengths are cited, but not when their weaknesses are pointed out. Some people enjoy mimicry and caricatures of others, but they feel irritated when it comes to them.\nThe Gita classifies human values in three categories – sattvic, rajasic, or tamasic. Sattvic character is associated with truth and honesty, rajasic character with motive, and tamasic character with negativity. Sattvic admiration surfaces when the admirer’s soul is in a joyous state. It is the purest and most transparent form of admiration. It is long-range, that is, its effect spreads far and wide. It creates positivity and brightness all around.\n\nRajasic admiration is like vishakumbham payomukham , nectar in the mouth, poison in the heart. It is characterised by flowery language coming out of a dark heart. This kind of admiration is widespread in a society that seeks material glory and benefit.\nA tamasic state is always devoid of admiration, be it public or private. It is always critical of everything. Attributes that describe this state are darkness, inertia, noise and chaos. Rise of unrighteousness can only be brought down by the spread of righteousness.\n\nMany are never admired publicly or privately. They spend their whole lives in ignominy. Oliver Goldsmith says, “They spend their whole lives without passionately declaiming against Providence or calling their fellows to be gazers on their intrepidity.”\nThe writer is an adjunct professor of Physics at Berhampur University\n\n\n",
        "headline_1": "Criticism and nature of admiration",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/criticism-and-nature-of-admiration/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-05-2025"
    },
    {
        "full_article": "On April 8, SC pronounced a historic judgment in State of Tamil Nadu vs Governor of Tamil Nadu. Perhaps few SC pronouncements have had, or will have the same impact on Union-states relationship as this judgment.\nRead full story on TOI+\n\n",
        "headline_1": "Does SC’s powers under Article 32 render President’s reference moot?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/does-scs-powers-under-article-32-render-presidents-reference-moot/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-05-2025"
    },
    {
        "full_article": "On Thursday, President Droupadi Murmu exercised her powers under Article 143 of the Constitution to send a ‘reference’ to Supreme Court, asking 14 questions on the extent of the legal powers of governors and the President. This marks only the fifteenth time since Independence that such a reference has made its way from Raisina Hill to Tilak Marg.\nRead full story on TOI+\n\n",
        "headline_1": "Why the President decided to dial the SC in TN governor’s case",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/why-the-president-decided-to-dial-the-sc-in-tn-governors-case/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-05-2025"
    },
    {
        "full_article": "Comms wars are shaping our reality, but we can fight back \nWe are in the midst of a communication war. From what we consume on TV and internet to our visits to shopping malls and our news consumption patterns, there is a constant battle for our attention. Surprisingly, the same mechanisms that influence our choices offline also nudge our decisions online, providing a powerful tool to communicators. So what is the truth? Do we really have a grip on reality?\nIn The War For Reality: How to Win in the World of Fakes, Truths, And Communities, Dmytro Kuleba, the former foreign minister of Ukraine, approaches the subject from the unique perspective of his country’s war against Russian aggression. While the book provides deep insights into the communication war being waged in Ukraine alongside the physical war, the lessons learnt can be applied universally. \nThe book says that the truth lies somewhere between fakes and real truths because everyone can have a different version of the truth. The internet is the natural battleground for communicators. Particularly because of the innate power of images and videos to evoke responses from our brain. This is also the reason behind the rise of GAFA – Google, Amazon, Facebook and Apple – who have figured out how to hack into our brains. Note that these organisations have no qualms about working with local govts of any kind. And authoritarian countries like Russia have taken advantage of this, says the book. \nBut can blockchain tech rid us of our sin? It certainly narrows the scope for manipulation. But the 51% rule and blockchain oracles present a dilemma. The requirement of approval by 51% participants to change a fixed blockchain fact is a high bar, but not impossible to overcome by corporations, billionaires and govts. Similarly, blockchain oracles have to rely on users and available data to adjudicate a contestation over a fact. For example, Ukraine claims that Russia occupied Donbas, whereas Russia insists on a civil war happening there. Both sides would want to introduce their facts in blockchain. But for blockchain oracles to make a decision it would have to rely on data that itself might be manipulated or incomplete. \nWhat about persuasion? Can critical thinking be incentivised? As Nobel laureate Daniel Kahneman postulated, human thinking can be of two kinds – instinctive and rational. The former is immediate and emotional. The latter needs to be constantly switched on by human effort. Therefore, people often make the easiest, and not the most rational, choices. \nYet, it’s possible to nudge people towards making desired decisions. Supermarkets in Ukraine started to mark Russian goods with the Russian flag after the beginning of the war in 2014. This immediately saw Ukrainians refuse to buy these goods. So, apart from internal effort, rational choices can be facilitated through external nudges, the book says. \nOf course, manipulators also have the same tools at their disposal. This is why it’s important to control our emotions. The book says communicators of aggression and temptation are aware that sex, internet and drugs have just the same impact. The goal is to produce dopamine. In this context, betrayal is also a very powerful emotion, while peace is meaningless to those who have not known war. Therefore, ‘betrayals’ and ‘victories’ are easily controlled by the toggle switch of communications. Politicians know this very well, and now have sophisticated tools to manipulate people more efficiently. \nSo, what should we do? Filter emotionally charged news and conspiracy theories, actively search for positive information, don’t look at the world through the lens of ‘betrayals’ and ‘victories’, and don’t get tired of fighting for real values: tough but doable.\n\n",
        "headline_1": "Of Betrayals, Victories And Blockchains",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/of-betrayals-victories-and-blockchains/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-05-2025"
    },
    {
        "full_article": "Medieval Bengal's links to the Straits world, a narrow stretch of water connecting to Southeast Asia and beyond, are overlooked. This world saw not only ocean-going vessels, but also coastal and localised traffic which, like riverine transport, has gone largely unrecorded.\nBengali Hindus and Muslims worked in the Straits world as warriors, goldsmiths, fishermen, slaves, interpreters, religious teachers, traders, and diplomats. A minor 'Bengali' dynasty of four Turki adventurers, fleeing the turmoil of Bengal's reunification c. 1352, ruled Samudra Pasai until 1390. An anonymous Portuguese document on Bengal in 1521 references Bengali Muslim shipping. A document from 1522 discusses the Banten-Melaka accord, citing a grandee 'Bemgar' (a Portuguese reference to his Bengali origin).\nFries' map (Image 1) depicts numerous port towns in the southern Bay, but Bengal (lying between India Intra Gangem [India within the Ganges] and India Extra Gangem [India beyond the Ganges]) is unrepresented. It features no port towns, only heathens and devil-worshippers. This is the northern Bay of Bengal—a coast marginal to European shipping. Its geographic fortunes reflect a continuity and uniformity of historical experience, which the following sections will underline.\n\nBengali Hindus and Muslims worked in the Straits world as warriors, goldsmiths, fishermen, slaves, interpreters, religious teachers, traders, and diplomats. A minor 'Bengali' dynasty of four Turki adventurers, fleeing the turmoil of Bengal's reunification c. 1352, ruled Samudra Pasai until 1390. \nNorthern Bay of Bengal\n\nSpanning Arid and Monsoon Asia, Bengal is climatologically distinctive. Ruled from Laknawati/Pandua/Gaur/Tanda—where Arid Asia ends—its robust mercantile section, the Bengal-Arakan-Burma continuum, begins in Monsoon Asia, in the dense forests and marshes of the southeast. Cultural and economic fulcrums tilted it toward the Straits world rather than the middle Gangetic plain. Physically distinctive with a coast defined by a low-lying tract called bhati, rivers link remote uplands (Image 2). This trans-regional topography (upland/lowland, river/sea) and climate (monsoonal, subtropical to tropical) made it a composite unit for seafaring before the rise of modern navigation.\nThese quirks dictated sailing conditions. As now, vicious cyclones battered the coast. North-eastern monsoon winds blow between October–November and February, enabling sailings from the east coast and Sri Lanka to Southeast Asia. From May–June until September, monsoon winds aided return journeys. The Straits run was an integral part of this perilous maritime world.\nThe Straits World\n\nMelaka port-city dominated the fifteenth-century Straits world. Per received history, Melaka rose with the Portuguese conquest of 1511 that inaugurated an age of commerce, along with Achin (1511), Banten (1527), and Johor (1528). This is incorrect. Emerging at a transitional moment in Bay, Straits and Island Southeast Asian history, Melaka dominated the Straits world from its founding in 1402, generating an Asian age of commerce with Ming China's support. Buddhist religious, diplomatic, and commercial networking was replaced by Islamic networks. Geoff Wade saw cash cropping and commercialisation generating a trade boom, a demand for money, and new common means of exchange. Newly established mints used sophisticated technology; new fiscal systems appeared. The arrival of the Southeast Asian junk, new navigational techniques, prominence of Theravāda Buddhism from Lanka and Bagan, adoption of Islam, and a military revolution were other manifestations. Additional developments included territorial consolidation, the birth of literate administrations and history-writing, the increasing prominence of legal codes, and new links between Southeast and South Asia. Ayutthaya's (c. 1438) prominence echoed the cosmopolitanism of Melaka and Arakan's Mrauk U (c. 1431). In 1450, Gaur became the Sultanate's capital and remained, until its decline in 1575, a primate city with a population estimated at 200,000.\nDid Melaka's rise as a singular prominent intermediary marketplace at the intersection of the Bay of Bengal, South China Sea, and Java Sea regional networks (Image 3) benefit Bengal? John Deyell's analysis of Bengal's bullion trends shows 1390–1415 marked by heavy, yet disturbed, bullion inflows; 1416–29 saw the reverse—a net outflow from Bengal, suggesting negative trade balances; 1430–92 saw a moderate but sporadic inflow of silver. From 1493 to 1533 (a period spanning the Sultanate's later years and Portuguese Melaka's early years), Bengal saw increasing silver inflows. The Melaka–Bengal trade took off in the 1530s, but was hampered by a customs duty of 8% compared to the usual 6% for other Asian shipping at Melaka. By the sixteenth century's end, it was again disadvantaged by the imposition of an exit duty for goods destined for Bengal. This forced mariners to explore alternate routes and ports—Achin, Banten, and the Malay Peninsula ports of Kedah, Trang, and Perak.\nSixteenth-Century Bengal\nUnlike the fifteenth century, the sixteenth century offers abundant documentation of Bengal's trade. Sanjay Subrahmanyam noted that the Bengal–Melaka trade was dominated by Klings from the Orissa–Andhra coast rather than by Persians from Bengal, as popularly believed. There were four arcs: the first to Melaka—essentially a textiles-for-cloves trade; the second to the Pegu port of Cosmin (Kusuma); the third to Lanka, Malabar, and the Maldives; and a fourth to Gujarat and the Red Sea, less to the Persian Gulf.\nThe Malay Annals note that in 1509:\n\"…there came a ship of the Franks from Goa trading to Malaka: and the Franks perceived how prosperous and well-populated the port was. The people of Malaka for their part came crowding to see what the Franks looked like…and said 'these are white Bengalis'!\"\nObviously, Bengalis were familiar. In 1513, on Melaka captain Rui de Brito's advice, Melaka's bendahara Nina Chatu sent a ship to Bengal to 'give news of us in that land truthfully, so that they might come here without fear.' In 1516, an official Portuguese expedition was tasked with 'discovering the Bay of Bengal'. It dispatched João Coelho, who reached Chittagong on a ship owned by a Muslim merchant, Ghulam Ali (Gromalle), a 'relative of the governor of Chittagong'. Coelho remained there until 1518, when the first Portuguese fleet of three vessels under D. João da Silveira's command arrived. More squadrons claiming trading rights were dispatched to Gaur and Mrauk U in 1521 and 1534, and Domingo de Seixas was sent from Ayutthaya to Chittagong to secure supplies for Melaka's constant wars against Achin.\nThe Melaka–Bengal trade took off c. 1530. Around 1538, seeking help against Sher Shah Suri's invasion, Mahmud Shah granted João Correa part of Satgaon's customs revenues. Nuno Fernandes Freire was appointed collector of Chittagong's customs. By the 1540s, two carreira existed—one each for Chittagong and Satgaon. Pipli entered Portuguese networks around 1560, also as part of the concession trade. By the late 1570s, Portuguese networks re-oriented towards the Coromandel coast, and the Chittagong and Pipli concessions declined. Around 1582, Chittagong came under Arakan. Concessions bypassed Arakan's meagre trade offerings. Satgaon, attracting the Crown trade, and Hugli after 1580, became hubs.\nThere were also 'quasi-informal' concessions. On 30 April 1559, Bakla's Paramananda Rai and Viceroy Constantino de Bragança signed a treaty at Goa. Bakla was opened to Portuguese shipping with fixed and low customs duties if the Portuguese discontinued their visits to Chittagong, then under Arakan. In return, Bakla received licences for four ships to trade with Goa, Hormuz, and Melaka. This run, supplemented by stops at the port towns of Sripur and Sandwip, extended this network into smaller ports like Loricoel and Catrabuh. As the formal and informal met at these port towns, religious conversion accelerated. Loricoel got an Augustinian church. Sripur's Kedar Rai allowed Francis Fernandez to build a church in 1599, giving land and money for the purpose. Around 1599/1600, Bakla's Pratapaditya allowed the Jesuit Father Fonseca to erect churches and carry out conversions. The first Catholic church of Bengal was built in Ishwaripur with his financial support.\n\nImage 3: From Kenneth R. Hall, 'Ports-of-Trade, Maritime Diasporas, and Networks of Trade and Cultural Integration in the Bay of Bengal Region of the Indian Ocean: c. 1300-1500', Journal of the Economic and Social History of the Orient 53 (2010): 111.\n\nWas this an age of commerce? Did geographic factors aid or hamper trade?\nGrowth or Decline?\n\nUrban fortunes fluctuated as rivers shifted. Pandua vanished, to be replaced by the first city of Gaur on the interfluve between the Kalindri and Bhagirathi rivers. The Gaur we reference is actually the second city of Gaur. It was damaged in the 1505 earthquake, which affected river courses. Earlier, the Bhagirathi had flowed east of Gaur, but in the second Gaur, the river lay to its west. Devastated by floods, it was finally abandoned in 1575; a plague outbreak was the last straw. Its port Satgaon decayed; Hugli port appeared in 1580. Bengal's capital shifted to upland Tanda, but fluvial instability generated a west-to-east migration, and upland Bengal's unstable physical morphology overturned port-capital-hinterland relations. In the southeast, Bakla port-town was destroyed by a cyclone and storm-wave in 1584.\nFortunes fluctuated in the Straits world as well, but for different reasons. Melaka's rise presaged Singapura's decline; Melaka's trading hegemony was challenged by Samudra Pasai and Ayutthaya, and its fall to the Portuguese in 1511 benefited Ayutthaya, Achin, Banten, and Pegu. Banten became an alternative to Melaka. Ayutthaya rose in 1438 at Sukhothai's expense; the Dutch conquest of Melaka in 1641 benefited Achin and Johor.\nSoutheast Bengal in the 'Age of Commerce'\nWe now revisit Anthony Reid's 'Age of Commerce' thesis insofar as the southeast is concerned. Not only can this age be pushed back into the fifteenth century but, as the sixteenth century also showed decline (hinterland and coastal polities fell concurrently: Ava [1527], Bengal [1538], Pegu [1539], Lan Na [1558], Ayutthaya [1596]), the decline was not confined to the seventeenth century alone as Reid argued.\nMoreover, the trajectory of decline varied from region to region, suggesting overland pressures at play. Victor Lieberman saw the seventeenth-century crisis as part of a global trade depression, population decay and political fragmentation in major markets (such as Ming China), accompanied by a decline in prices, a drop in world temperatures (negatively affecting harvests) and decay in world silver supply. Consequently, polities moved away from cash crops and maritime trade to staple crop cultivation. They pursued self-sufficiency, resulting in lost port-cities, de-urbanisation, and political decentralisation. Reid and Lieberman saw mainland Southeast Asia's interior states—less dependent on maritime trade—expanding and establishing control over coastal rivals. Along with the continuity of long-term developments in core polities such as Burma, Vietnam, and Thailand, smaller mainland Southeast Asian states on the periphery experienced crisis and decline in response to core state expansion. While cores expanded, centralised and defined themselves and their cultures, smaller fringe polities like Lan Na and Cambodia declined and got lost in the shadow of their expansive neighbours.\nThis happened in Bengal as the west strengthened at the southeast's expense. Fluvial shifts, fragmenting the southeast with new channels, precipitated a crisis with swampy marshlands and recurring plagues. New agrarian frontiers opened up with rice-growing areas, and revenues rose. But slave raids and desertion offset these positive trends. The southeast's physical and economic integrity was predicated on the Bengal–Arakan networking, but now the sea route to Arakan was abandoned. Trade through the uplands to Ava, Yunnan, and China decayed. Assam, Tripura, and Manipur reported an escalation in animal pestilences and smallpox epidemics. Smallpox, allegorical or real, was severe. In Tripura, Dharma Manikya (1462), Dhanya Manikya and Vijay Manikya (dates unknown), and Chatra Manikya (1670s) died of the disease. Smallpox is recorded for 1574, 1637, and 1768 in the Ahom state, and in Manipur for 1520, 1531, 1541, 1581, 1651, 1672, 1685, and 1699.\nParadoxically, as river shifts, raids and disease undermined local communities and dislocated shipping and trade, mobility increased. One reason was the famines from 1630–35 in southeast Bengal and lower Burma. Glanius' testimony, which contemporary Persian records corroborate, noted a particularly severe one between 1662 and 1666, which spread to Assam. The slave trade increased and Pipli, Sagor, Sandwip, Chittagong, Mrauk U, Kedah, Johor, and Achin became slave ports. Achin was a premier slave market where ships from Bengal, Borneo, and Macassar brought slaves in the 1660s. Mrauk U became another market with raided slaves from Bengal and forced converts. Sebastian Manrique claimed he converted, on average, around 2,000 Bengali Hindu and Muslim peasants every year at Dianga, a fishing village adjoining Chittagong. Another 'slave' port, Angarcale, brought in similar numbers.\nArakan's slave trade was both domestic and international. It had entered this trade not only through the compulsions of international trade but also because of its chronic shortage of manpower. While initially used for clearing jungles and as agriculturists for additional rice cultivation, mercenaries and skilled craftsmen were increasingly abducted for resettlement. Mughal chronicler Shihabuddin Talish observed that \"[o]nly the Feringi pirates sold their prisoners. But the Maghs employed all their captives in agriculture and other kinds of service\".\nResilience Against Adversity: The Melaka Factor\n\nThe northern Bay of the seventeenth century saw Portuguese power decaying. Per Subrahmanyam, after the Dutch siege of 1606, Melaka's customs revenues fell steadily; by 1620 they totalled 18,000,000 reis against 27,000,000 in 1606. Its fortifications were in disarray, and few fighting men remained to defend the city. This dismal picture was exacerbated by expulsion from Sandwip in 1602, from Chittagong and Dianga in 1607, and from Sandwip again in 1617. Felipe de Brito e Nicote, leader of a small Portuguese commercial outpost in Syriam, was killed by the Mon Burmese in 1613. To the Estado, this was a disaster, for Syriam was helping Melaka to control trade flows that were passing into ports outside the Estado's direct control—alternate ports like Perak, Kedah, Trang, Ujangselang, and Mergui. The Portuguese lost in the west when Emperor Shah Jahan expelled them from Hugli and Hijli in 1632 and 1635. Bocarro's Livro das Plantas lamented the end of the Bay trade in the 1630s:\n...the great Bay of Bengala, and Pegu, where...we once had great settlements of Portuguese...all of them came to an end with great destruction and devastation, and hence today one only navigates to the port of Orixa in the kingdom of Bengala (Pipli), where there is a Portuguese captain appointed by the viceroy only in order to treat with the Moorish vassals of the Mogor, to whom the port belongs...but he has nothing else there, not even a house, save some made of straw…\nI end with a question. Did the Melaka factor ultimately destroy southeast Bengal? The southeast eventually recovered and retained the maritime outlet of Chittagong. But despite the founding of Calcutta port after 1690, western Bengal became a hinterland region, and the sea receded in popular imagination.\nThis also brings us to the question of resilience. The southeast's chequered career was linked not so much to Melaka, but to Arakan. When Arakan surrendered to Mughal forces in 1666, it lost a port crucial to its survival—Chittagong. The Bengal nawabs recovered Chittagong in 1729 as a vastly reduced commercial asset and ceded it to the East India Company in 1793. Boats from Bassein, Rangoon, and Martaban made annual voyages, exchanging Burmese rice and teakwood for cloth, but Chittagong's cloth industry decayed when European companies sent textiles to be 'finished' in western Bengal. Commercially unsustainable and devoid of trade goods, Joseph Cordier (1823) saw it as a declining mart-town with 12,000 people, now exporting only rice and salt. Yet, trade persisted. Chittagong's deepwater harbour enabled commerce with Jugdia, Srirampur, Dhaka, Sylhet, and Goalpara. Tamil Muslim shipping from Penang called there in 1838. Howard Malcolm (1836) saw at Chittagong around 300 vessels of between 40 to 100 tons, including \"several large Maldivian boats of incredible construction\", indicating networks into the central Indian Ocean. Given this resilience, the port was reorganised in 1887 and in 1928 was declared a 'Major Port' of British India. Today, its shipping tonnage far exceeds that of Kolkata.\nRila Mukherjee is a retired Professor of History at the University of Hyderabad in India, specialising in the history of the Bay world.\n",
        "headline_1": "Bengal’s Ties to the Straits World",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/focus/news/bengals-ties-the-straits-world-3897836",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-05-2025"
    },
    {
        "full_article": "In Bangladesh, the process of securing a loan from most banks and non-bank financial institutions (NBFIs) feels like a maze. A small business owner walks in with a mountain of paperwork, a salaried professional submits their home loan application with fingers crossed, and a credit officer begins the tedious task of checking documents and preparing loan appraisal reports. This cycle plays out day after day, with loan decisions made based on outdated risk management practices. Weeks, even months, pass, only for many of these hopeful applicants to face rejection, not because they lack potential, but because the system never truly understood their financial story.\nThis situation is the silent crisis of our banking system. In a country where the middle class is expanding and millions of small businesses drive the economy, the financial system still struggles to meet their needs. Why? Because credit risk management has not evolved with the times. But there is a solution, and it lies in reimagining the way we assess risk through the lens of data.\nBangladesh is a country of 170 million people. One in four now belongs to the middle class, and that number is growing thanks to rapid urbanisation and digital adoption. This upward shift is opening up big opportunities, especially in retail banking.\nMeanwhile, around 10 million CMSMEs (cottage, micro, small, and medium enterprises) comprise 90 percent of industrial units and account for 80 percent of industrial employment. Despite their vital significance, access to finance remains limited simply because they don't have formal documentation, collateral, or traditional credit histories.\nThis is not a capacity problem. It is a visibility problem. And that is where data-based risk management can change everything.\nData-driven credit analytics offers a powerful alternative to the old way of credit risk management. Instead of relying on a rigid set of forms and a credit officer's intuition, financial institutions can use machine learning, an algorithm trained on years of data from past borrowers, to evaluate the creditworthiness of a potential borrower. This model does not just look at income or collateral; it captures patterns in mobile transaction records, utility bill payments, digital wallet activity, geo-location data and other alternative indicators to assess how a borrower earns, spends, and saves. For CMSMEs, it means analysing business turnover, supplier relationships, cash flow position, and other relevant data points. Within minutes, a machine learning model assigns a credit score rooted in actual outcomes, not outdated assumptions.\nThe need for smarter risk assessment has never been more urgent. As of December 2024, non-performing loans (NPLs) in Bangladesh reached an all-time high of 20.2 percent of total outstanding loans. The banking sector remains fixated on a small number of large classified loans while overlooking thousands of creditworthy individuals and small businesses. As Bangladesh aims to rebuild its banking system, leveraging data analytics is pivotal for its banking sector to remain competitive and resilient.\nOne of the greatest advantages of data-driven risk management appears in the post-disbursement phase. In a traditional risk management approach, financial institutions only learn about borrower distress after it is too late, when a payment is missed or a default occurs. By then, recovery becomes costly and complicated. On the contrary, real-time data analytics allows for proactive monitoring. If a borrower's transaction volume drops or their repayment behaviour changes, analytics systems can flag the risk immediately. Financial institutions can step in early with a reminder and the right recovery plan.\nHistorically, banks and NBFIs avoided small loans because of the high cost of customer acquisition and supervision. But digital technology is flipping that logic on its head. With the right data infrastructure, financial institutions can automate most of the credit lifecycle: from application to approval to monitoring. This reduces operating costs and makes small-ticket retail and SME lending not just viable, but profitable.\nBeyond traditional financial product offerings, data analytics is also opening doors to embedded finance, a model where credit is offered directly through platforms people already use. Think of a ride-hailing driver getting a loan from the app they work for. Or an online seller receiving instant credit based on their digital sales history. According to a report published by ResearchAndMarkets.com, embedded finance is projected to grow at a 48 percent annual rate from 2024 to 2029, with revenues expected to hit $5.8 billion. However, to tap into this opportunity, financial institutions need to shift from product-based offerings to ecosystem-based thinking. That means building APIs, investing in cloud-based infrastructure, and most importantly, using data as the foundation of all credit decisions.\nThe good news is that the transition to data-based risk management doesn't require a complete overhaul. Most banks already have years of valuable data sitting in their systems. Building a scorecard model using that data to predict default risk is both doable and cost-effective. Integrating modern loan origination systems (LOS) with existing core banking platforms is a proven path. What is needed now is a mindset shift: from fearing risk to understanding it, from gatekeeping to enabling and from guesswork to insight.\nSeveral forward-thinking banks and NBFIs in Bangladesh have already taken this step. By integrating a robust LOS with their legacy core banking platforms, they have successfully adopted data-driven risk management systems. These institutions are thriving, benefiting from faster loan processing, more accurate credit assessments, and reduced default rates.\nImagine a Bangladesh where a woman running a home-based clothing business can get a small loan based on her online sales, where a local grocer in Bogura is evaluated not by collateral but by years of consistent supplier payments and sales turnover, and where a ready-made garment worker can access an affordable home loan to construct a semi-pucca building on the outskirts of Dhaka, in Savar. That future is not far off. It is waiting at the edge of data and the financial institutions willing to harness it.\nFinancial institutions that lead this shift will not only find new markets and revenue streams. Surely, they'll build something far more valuable: trust, inclusion, and long-term resilience. The future of credit risk management is not about rejecting loans. It is about knowing who to trust and letting data tell the story.\nShah Jalal is a risk management professional working at a non-bank financial institution. He can be reached at [email protected].\n\nViews expressed in this article are the authors' own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Data-driven lending solution for Bangladeshi banks",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/data-driven-lending-solution-bangladeshi-banks-3897401",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-05-2025"
    },
    {
        "full_article": "We are concerned about how journalists continue to be targeted through retaliatory cases since the fall of the Awami League (AL) government in August last year. Very recently, 26 journalists were accused in an attempted murder case filed by Rezaul Islam, a lawyer affiliated with the Jatiyatabadi Ainjibi Forum's Chattogram unit. The case, filed on May 13, alleges that the journalists, along with others, were involved in an attack on Rezaul on May 1, 2025. However, many of the accused journalists strongly deny the charges, claiming that the allegations are based on distorted facts. They assert that they are victims of retaliatory cases, similar to previous incidents where journalists were indiscriminately targeted. Such arbitrary filing of criminal cases against journalists undermine press freedom.\n\nIn the case statement, Rezaul alleges that many of the accused are affiliated with the AL, Jubo League, and their associated groups. He accuses them of extortion, murder, and attacking protesters during the July uprising. He further claims that they repeatedly threatened him to withdraw cases filed on behalf of the families of July victims, and that they attempted to abduct him, robbed him, and even hurled a crude bomb at him. However, the journalists accused in the case have narrated a completely different version of events. According to them, Rezaul threatened to disrupt a picnic event via a Facebook post on April 30. On the day of the picnic, May 1, he and his group allegedly assaulted one of the journalists near Premier University. Furthermore, several journalists who were nowhere near the scene that day were nonetheless implicated. Additionally, law enforcement officials have raised doubts about some of the claims in the case statement. The Officer-in-Charge of Kotwali Police Station stated that no reports of a crude bomb explosion had been received in his jurisdiction. The inconsistencies between Rezaul's allegations and the journalists' accounts must be addressed through a fair and impartial investigation, as demanded by the Chattogram Union of Journalists (CUJ).\n\nWe therefore urge the government to conduct a fair investigation into this case and take strong measures to prevent the misuse of the legal system. While the government previously stated that legal action would be taken against those filing false cases, we have yet to see any meaningful steps to this effect. This is deeply concerning. At present, journalists remain imprisoned due to cases filed out of personal or political vendettas. These cases should be resolved through due process.\n",
        "headline_1": "Fairly investigate cases against all journalists",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/fairly-investigate-cases-against-all-journalists-3896941",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-05-2025"
    },
    {
        "full_article": "On Monday, the government introduced a significant reform measure: dissolving the National Board of Revenue (NBR) to replace it with two new agencies. The goal is to separate the tax policymaking and implementation processes, in line with a key conditionality of the International Monetary Fund (IMF) for the $4.7 billion loan deal. We agree with experts that this is a \"bold\" and \"timely\" move that can help modernise our tax system.\n\nBy dissolving the NBR along with the Internal Resources Division (IRD) through an ordinance, the government is paving the way for the Revenue Policy Division and Revenue Management Division. The first will be tasked with designing our tax policy framework, formulating tax laws, determining various rates, and overseeing the coordination of international tax treaties and trade-related tariffs. The second, on the other hand, will be responsible for tax administration, compliance, audit, and enforcement of income tax, VAT, customs, and other taxes and duties. The separation of duties is meant to make the tax system more efficient and boost overall revenue earnings. Until now, the NBR has been in charge of all these tasks—both policymaking and policy enforcement—something that has been criticised for creating an overlap of functions leading to poor performance and coordination.\n\nThe separation of duties is meant to make the tax system more efficient and boost overall revenue earnings. Until now, the NBR has been in charge of all these tasks—both policymaking and policy enforcement—something that has been criticised for creating an overlap of functions leading to poor performance and coordination.\nGiven that Bangladesh has one of the lowest tax-GDP ratios in Asia (around 7.4 percent), restructuring the country's tax authority has been long overdue. The NBR has consistently failed to ensure effective resource mobilisation, increase revenue generation through direct taxes, and plug loopholes to prevent tax evasion, among other things. Moreover, in its mission to meet revenue collection targets, it has often ended up enforcing policies that created unjust pressure on taxpayers and businesses. Under the new system, we expect to see a shift away from this state of affairs.\n\nMerely overhauling the structure, however, will not bear the desired results if the underlying problems are not addressed. As experts have said time and again, the government should reduce its overreliance on indirect taxes and expand the tax base to improve our tax-GDP ratio. Tax exemptions must also be reconsidered and allowed more conservatively, and corrupt practices in tax collection must be stopped. The entire system must be designed in a way that eligible taxpayers feel encouraged and are able to pay taxes without hassle.\n\nMerely overhauling the structure, however, will not bear the desired results if the underlying problems are not addressed. As experts have said time and again, the government should reduce its overreliance on indirect taxes and expand the tax base to improve our tax-GDP ratio. Tax exemptions must also be reconsidered and allowed more conservatively, and corrupt practices in tax collection must be stopped. The entire system must be designed in a way that eligible taxpayers feel encouraged and are able to pay taxes without hassle.\nOf course, the latest decision is not without contention. NBR officers and staff members have been protesting against the move, arguing that the new ordinance sidelines experienced tax professionals. We believe this can be sorted out through dialogue and necessary readjustments. But the ongoing overhaul must be followed through, because it is in line with international best practices and, if done right, will improve tax governance and transparency.\n",
        "headline_1": "Splitting the NBR is a timely step",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/splitting-the-nbr-timely-step-3895076",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 19, 2025 00:00:00  \nAfter several days of protest, Jagannath University (JnU) students called off their movement on Friday following the government's assurance to meet their demands. While this development is reassuring, the incident calls for a careful scrutiny and stocktaking by the authorities concerned to determine why a protest over legitimate demands escalated to a standoff with the government. What the students demanded was neither unique nor unreasonable for the government to address. They have long been demanding an increased budgetary allocation for the university, arranging residential facilities for students or providing them with housing allowance, and expediting the construction work of the university's new campus. \nJnU is the only public university - apart from the newly established ones - without residential facilities for students. It has just one dormitory for female students, while as many as 11 dormitories of the former Jagannath College - now Jagannath University - remain occupied by locals and politically influential individuals. The university has a long history of students waging intense protests to demand residential facilities. The previous Awami League government, instead of reclaiming the occupied halls, decided to move the university to a second campus in Keraniganj from Old Dhaka's densely populated area. Students had welcomed the decision, but it has been nearly a decade since the promise was made but there has been little headway. Students, therefore, have every reason to feel disappointed and discriminated against. The question, however, is why the students' renewed movement over these legitimate demands escalated to a standoff with the government, prompting even teachers and former students to join in.\nStrangely enough, while students were protesting against discrimination-in a system where some public universities have residential facilities and others do not-they faced yet another form of discrimination. Just a week earlier, when a group of protesters launched a 'march towards Jamuna, the Chief Advisor's current residence, demanding a ban on the Awami League, the law enforcers did not take stringent action for violation of the ban on holding demonstration there and yielded to their demands. In stark contrast, JnU protesters were met with baton charges, tear gas, and rubber bullets, which caused eruption of tension. The students were right to ask, why this double standard? \nEven more curious is the complete absence of the Education Advisor from the scene. Several other universities, including KUET, along with other educational institutions, have plunged into a state of chaos - yet the Education Advisor has been conspicuously absent, showing little sign of taking on a crisis management role. Timely dialogue might well have dissuaded students from taking to the streets or launching a 'March towards Jamuna.' Ultimately, the government yielded to the students' demands but under circumstances that risk setting yet another troubling precedent --- organised groups can press home their demands by arranging a march towards CA's residence.\nSince the interim government assumed state power, Dhaka has become a city of protests. Rarely does a day pass without groups of demonstrators taking to the streets and blocking roads. Just last week, at least four different groups were staging demonstrations and blocking roads simultaneously at various locations across the city, paralysing traffic and causing immense suffering to the commuters. It demands serious analysis. Given that most of the protests are originating from educational institutions, the government should consider forming an education reform commission to address the long-standing grievances in the sector. Ignoring grievances or resorting to violence to disperse street protests will only worsen the already fragile political situation, creating opportunities for vested quarters to fish in troubled waters.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Dealing with street protests",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/dealing-with-street-protests-1747582671",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       May 19, 2025 00:00:00  \n\nThe country's poultry sector is again in distress. But it is not due to any manmade crisis often created in the sector by the so-called profit-hungry syndicates. As in the past years, here nature is at work. A report published early last month (April) referring to the Bangladesh Meteorological Department (BMD) said that mild to moderate heatwave was sweeping across 14 districts of the country and it might continue. The affected districts include Manikganj, Faridpur, Rajshahi, Pabna, Dinajpur, Sirajganj, Tangail, Lakshmipur, Feni, Jashore and Chuadanga. Last month, Baghabari of Sirajganj experienced the temperature at 38.2 degree Celsius, which experts termed moderate. However, as in the previous year (2024), the heatwave showed no sign of respite and on the 10th of this month (May), Chuadanga recorded 42 degree Celsius. Dhaka, too, did not lag behind, because on the same day, it recorded its highest temperature at 40.1 degrees Celsius. Similarly, according to the BMD, last year, 51 out of 64 districts of the country suffered blistering heat between 40 degree Celsius and 43 degree Celsius. What was the fallout from this extreme heat particularly on the poultry sector of Bangladesh? A report said, poultry farmers in the countryside might face 30 per cent production loss. The story is more or less the same this year, too. As claimed by the Bangladesh Poultry Association (BPA) in a recently published report, during the month-long heatwave, the poultry farmers have sustained a loss of about Tk 3.0 billion. The reason, according to BPA, is death in large numbers of the chickens of broiler and layer varieties. Broilers, notably, are reared for meat, while the layers for egg. As the reports go, thousands of these birds are dying everyday due to extreme heat. The situation has been further compounded by load-shedding. The administration, on its part, appears to be either clueless, or accepted it as fait accompli. Especially, most at risk are the broiler and the Sonali varieties of poultry birds that are dying, according to reports, at a 10 per cent rate, while the mortality rate of the layers is 5.0 per cent, the report goes. The victims of the heatwave are obviously not the corporate poultry companies, but the traditional marginal farmers who cannot afford air coolers and other modern facilities to protect their chickens. Since the marginal chicken farmers lack the capital to recuperate their investment so lost, they would usually give up on chicken farming altogether and look for other ways for survival. They may even migrate to cities to make a living either by selling labour or doing odd jobs. Since, these millions of marginal chicken farmers across the country meet more than 80 per cent of the demand for cheap protein both in the form of meat and egg, it is easily imaginable what a devastating impact they would leave on the country's nutritional health as well as food security if the marginal poultry farmers go out of business in droves. In fact, the corporate sector with its 20 per cent share of meat and egg production will not be in a position to bridge the nutritional gap any time soon. There is no scope to think that heatwave is a fortuitous event. It is clearly a product of climate change.\nThe elaborate report on the temperatures caused by heatwaves is to stress the fact that heatwaves and the high temperatures they generate are not a passing event. The deleterious impact of this prolonged heatwaves on the country's primary source of nutrition, poultry farming, is not going to ease off in the future. It is not only the poultry sector alone, the entire livestock sector will suffer the consequences of heatwaves, moderate or extreme. The coming years may be still worse. So, we have already passed the phase of complaining about how the marginal poultry raisers are at the receiving end and how much loss they have incurred during the last one month of extreme heatwave. Even so, it would be worthwhile to have an assessment what the marginal chicken farmers have gone through during the last one month of uninterrupted heatwave. Since the poor poultry farmers have no arrangements for keeping their chicken coops cool say by using air coolers as the corporate poultry industries do, they either leave the birds to their own devices or may provide them with sufficient water to drink or sprinkle water on them. This traditional approaches to keep the animals cool no doubt work. But what can they do when the chickens begin to eat less or even stop eating? If the temperature is above 35 degree Celsius and the relative humidity is above 70 per cent, the birds are in a hazardous condition. Unlike many mammals, chickens have no sweat glands. So, under extreme heat they cool themselves mainly by panting. But that is the natural way they try to survive in the face of extreme heat. Moreover, extreme heat along with attendant high level of humidity brings with it avian infections from Clostridia, Salmonella, Coliform bacteria and so on. These conditions worsen during extreme heat. But without necessary intervention from the government both in terms of veterinary service and finance, how can these marginal poultry farmers hope to survive? \nNow the challenge before the government is enormous. The government will be required to come to the aid of the millions of poultry farmers spread across the country in a big way. Since the heatwave is not a temporary issue, the government will have to adopt a long-term strategy to address the heatwave-related problems in order to save the marginal chicken farmers. In this connection, the veterinary department will be required to be updated with modern researches on how the advanced nations are coping with extreme heat so far as protecting their poultry birds are concerned. However, traditional knowledge would also be important here, since our chickens grow in the open and have higher level of immunity. The country's veterinary scientists will have to blend traditional knowledge with modern knowhow to find out the most appropriate answer to protecting chickens against extreme heat.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Protecting marginal  chicken farmers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/protecting-marginal-chicken-farmers-1747582744",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       May 19, 2025 00:00:00  \n\nSo, Donald Trump has made a great discovery, \"A lot of people are starving\" in the Gaza Strip. This brief remark, notably, comes at a time when the first foreign tour of his second term saw him about to conclude his itinerary in several Gulf countries but not in Israel, a US key ally. Whether he has come up with this observation simply out of his genuine concern for the starving Palestinians or as part of diplomacy hardly leaves much to conjecture. The fact is that the two-month ceasefire collapsed simply because of Israel's imposition of blockade on Gaza and renewal of fresh attacks killing scores of civilians on a daily basis has so far been none of his concern. \n Well, starvation is a serious matter but when unarmed civilians are being exterminated every day---a clear case of genocide, the US president, like his predecessor Joe Biden, plays deaf and dumb. Mass killing of people day after day is more serious than starvation. In fact, it is a disgrace for human civilisation. On the concluding day of his Gulf tour, Trump even told reporters at Abu Dhabi, \"We're looking at Gaza. And we're going to get that taken care of.\" That was Thursday, May 15. The same day 50 Palestinians were killed by Israeli bombing. Not a single day passes without such attacks which are now carried out in small hours when people are asleep. Israel has, moreover, launched a new offensive codenamed Operation Gideon's Chariot purportedly to intensify airstrikes before launching ground incursions further deeper in Gaza. At least 115 ---146, according to another report---people, most of them women and children, perished in the bombing on Saturday. \nHad the US administration not played to the gallery, Trump would send a clear message for stopping the routine mass massacre first and withdrawal of the blockade that does not allow UN agencies to reach food and medical aid to the starving and suffering people in Gaza. It is quite clear that if the US administration wished, it could stop Israel from restarting the war on the Palestinian people after the two-month truce. It claims to have mediated the ceasefire between India and Pakistan. Trump bragged that he could stop the Russo-Ukraine war within 24 hours. It has not happened; instead an agreement has been signed between the US and Ukraine for sharing profits from future sale of the latter's natural resources including minerals and energy. This shows where his priority lies. \nThe bone of contention for Israel to carry on the offensive is the non-release of 57 of its citizens still held hostage by Hamas. Now, Jerusalem has all along relied on its military might for its territorial expansion in Gaza and the West Bank. Israeli settlements have continued in violation of the agreement on demarcation of boundaries between it and Palestine. That the Israeli state has been carved out of Palestinian territories is not even admitted by the present Jewish administration and its Western allies including the US and the UK which was responsible for creating a country for the Jewish people from all over the world. \nIsrael should have been grateful to Palestine for the gift of land on which their state stands. The Western powers lately led by the US also should be thankful to the Palestinian people for accepting a rogue state in the neighbourhood. To understand why the Palestinian Liberation Organisation, Fatah movement and Hamas came into being, there is no need to be a political thinker. The West should take full responsibility for this mischievous political game. \nHamas may have started the latest conflict by unleashing a deadly attack deep inside Israel in October, 2023 but the militant groups would not even come into existence if the Palestinian right to statehood had been recognised earlier. Although the Oslo Treaty reached between Yasser Arafat and Yitzhak Rabin was not perfect but had the potential to be a cornerstone of future peace and coexistence if Israel and its chief patrons in Washington built on it. That Rabin was assassinated shows the right-wing rabid Zionism got the better of moderate and peace-loving leadership in Israel. Thus Netanyahu staged a political comeback to derail the peace process. \nBoth Biden and Trump, despite their political differences, are leaders of different ilk compared to Jimmy Carter. With such leadership in power, an independent Palestinian state is a remote possibility and peace in the region elusive.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Double standard of political leadership",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/double-standard-of-political-leadership-1747582844",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 19, 2025 00:00:00  \n\n We welcome the government's decision to split the National Board of Revenue (NBR) into two separate divisions-Revenue Policy Division and Revenue Management Division-and to abolish the Internal Resources Division (IRD). This move aims to streamline the country's revenue sector and raise the tax-to-GDP ratio.\nReforms are indispensable in any vibrant society to improve service delivery, ensure good governance, and enhance the well-being of its citizens. Reforms such as this can improve the effectiveness of policy-making and address long-standing challenges where the NBR has struggled.\nThe Government has assured that this step will help broaden the tax base and strengthen direct taxation, thereby reducing the overdependence on indirect taxes. \nExperts have noted that placing both tax policy formulation and implementation under a single institution is problematic. It creates conflicts of interest among officials and hampers efficiency. Furthermore, weak governance and bureaucratic overlap have made the organisation ineffective and demoralised for both staff and stakeholders.\nIt is now crucial for the government to maintain harmony between the two new divisions as revenue policy and revenue management are inherently complementary. Policy must always be informed by practical insights from the management side to ensure the development of realistic plans and procedures.\nAs ordinary taxpayers, we strongly wish to see a more efficient and robust revenue system in our country. There is an urgent need for an automated taxation system that increases direct tax collection and consequently reduces reliance on indirect taxes.\nWe humbly urge that the newly formed divisions be managed by experienced personnel with a strong background in revenue administration, and that they operate with honesty, neutrality, and professionalism. Above all, the attitude of revenue officials must be taxpayer-friendly, proactive, and non-authoritarian. Otherwise, this commendable reform initiative may fall short of achieving the desired objectives.\n\nMd. Refatul Hossain\nAdditional Director (retd.)\nDepartment of Agricultural Extension (DAE)\nFaridpur Region.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "NBR bifurcation: A welcome move",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/nbr-bifurcation-a-welcome-move-1747582898",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-05-2025"
    }
]