[
    {
        "full_article": "While there may be much relief after the détente in the tariff war between China and the U.S., in Busan, South Korea, following the meeting between U.S. President Donald Trump and his Chinese counterpart Xi Jinping, the uneasy truce has laid bare a structural inversion of power between the two economies. What began in the 1980s as a reluctant embrace of World Bank/IMF-prescribed neoliberal reforms by an overwhelmingly agrarian China, has now evolved into an unimaginable assertion of industrial dominance. A nation that once bartered sovereignty for technology transfer and market access has, through patient accumulation of manufacturing depth, labour arbitrage, and global supply-chain integration, positioned itself as the indispensable node of world production. The irony is sharp. The U.S., whose export and technology corporations once defined global trade cycles, now finds its four-year political rhythms ill-suited to contest a rival that plans in decades. The concessions Mr. Trump has extended to Mr. Xi include some reductions in tariffs, a pause on additions to the “no-trade list” of Chinese firms, and a partial rollback on levies linked to the fentanyl supply-chain dispute. China has promised resumption of purchase of American farm products, particularly soybean, and an easing of export restrictions on critical minerals.America’s tariff offensives since Mr. Trump’s first term in 2017 did yield some numerical optics. U.S. goods trade deficit with China narrowed by roughly 30%. But economists across the spectrum agree that this was less a triumph of re-industrialisation than a diversion of trade flows. The deficit was largely re-routed through near-shoring and friend-shoring: Mexico, Vietnam and parts of ASEAN became new intermediaries for supply chains once centred in China. Meanwhile, China’s exporters diversified markets and adjusted prices, while the tariffs’ direct burden was borne mostly by U.S. importers and consumers. The human geography of the impact was asymmetric: in the U.S., retaliatory Chinese tariffs targeted farm-belt commodities, hurting those very rural constituencies that powered Mr. Trump’s rise. Federal subsidies softened the blow, but only temporarily. In China, the pain was concentrated in export-processing hubs such as Guangdong and Suzhou, where migrant and urban workers in electronics, semiconductor, and smartphone assembly absorbed the shock. Yet, the political fallout remained contained, cushioned by Beijing’s domestic-stimulus measures and its “dual-circulation” strategy of inward and outward rebalancing. This trade war has thus underscored a decisive shift: the U.S. remains the world’s largest consumer market, but China has entrenched itself as the world’s foremost factory with global leverage over intermediate goods, high-end technology and critical minerals. Published - November 01, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        economy (general)\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        industrial production\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        critical minerals\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        Mexico\n                    \n                            /                      \n                        \n                        Vietnam\n                    \n                            /                      \n                        \n                        ASEAN\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        semiconductors and active components\n                    \n                            /                      \n                        \n                        PDAs and smartphones\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        electronics",
        "headline_1": "​Chinese check: On the détente in the U.S.-China trade war",
        "headline_2": "China has entrenched itself as the world’s foremost factory",
        "link": "https://www.thehindu.com/opinion/editorial/chinese-check-on-the-detente-in-the-us-china-trade-war/article70226269.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-11-2025"
    },
    {
        "full_article": "Sometimes, the most manifest gains are won after the most Herculean of battles. For France to establish that “force is the crime” to establish that the use of force without consent causing injury, rape, fear or annoyance is a criminal act, took years; extraordinary courage from one woman, and an uprising where other women stood in solidarity with her. France has adopted a law that defines rape as any non-consensual sexual act, a milestone for the women in the country, but overall, a strike against sexual violence. The law was passed in response to urgent calls from society to infuse consent into the law, and make sure that the law protects sexual autonomy, particularly with reference to women. Last year, Gisèle Pelicot fought her toughest battle when she took the stand in court, in a case accusing her husband of drugging and allowing her to be raped by several men, some complete strangers. In December last year, the court granted 51 convictions in the case, but it was more significant in how it became a watershed moment to establish consent as a pillar of law. It has been well established that survivors of sexual violence have an arduous journey bringing their case to a court of law, and many women from disadvantaged social and economic backgrounds, indeed do not have that privilege. There is a great deal of stigma, and worse, judgement of the survivors in cases of rape, as recent public statements in India by leaders blaming the women have painfully underlined again, and again. Even when a case of rape enters the trial stage, the chances of securing a conviction are not encouraging. According to the NCRB’s data, conviction rates for rape were between 27%-28% from 2018 to 2022. And this, despite the fact that Section 129 of the Bharatiya Nyaya Sanhita recognises “criminal force”.To establish sexual autonomy as the cornerstone of the judicial process, while a first step, is scarcely all. Preventing sexual violence will also involve shaping community views on gender roles, dismantling rigid patriarchal codes with a measure of law, but also awareness programmes that begin early, and orienting the police force to these principles, besides funnelling resources into assisting survivors cope with the trauma. The road ahead is long and arduous; for the journey of the survivors to be eased, governments should start with a complete intolerance for sexual violence, and a commitment to stand by survivors, employing empathy in the investigation and trial processes. To do any less, would be an injustice that would interrupt the momentum of the women’s ‘Arab Spring’ Pelicot had set in motion.  Published - November 01, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        France\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        social issue\n                    \n                            /                      \n                        \n                        crime",
        "headline_1": "Consent is all: On sexual violence, support for survivors",
        "headline_2": "There must be complete intolerance of sexual violence and support for survivors",
        "link": "https://www.thehindu.com/opinion/editorial/consent-is-all-on-sexual-violence-support-for-survivors/article70226300.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-11-2025"
    },
    {
        "full_article": "Nitish appears to be turning anti-incumbency into leverage by absorbing and redirecting it. His incrementalist approach may again position him as the best bet in case of another fractured mandateNotwithstanding exit polls and television debates, a familiar script could unfold in Bihar. After intra-alliance bickering over seats and the sudden announcement of a deputy CM, prospects of an outright Mahagathbandhan (MGB) victory have diminished in the past fortnight. A many-cornered contest might deliver that most Bihari of outcomes: a hung assembly.\nRead full story on TOI+\n\n",
        "headline_1": "Bihar’s Chanakya 2.0",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/bihars-chanakya-2-0/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-11-2025"
    },
    {
        "full_article": "Courts have responded to celebrity petitions by giving sweeping judgments, without hearing the other party. Plus, each ‘violation’, unfair competition, privacy, false endorsement, merits a specific response\n\nDelhi and Bombay HCs, over mere weeks, granted a number of sweeping judgments – ex parte ad interim injunctions – protecting ‘personality rights’ of several actors. All these orders mirror each other, obfuscating the exact ‘cause of action’ that merited the injunction. An ex parte ad interim injunction is a discretionary remedy meant to be granted in exceptional circumstances, without hearing the other side, to safeguard rights of a party that might suffer irreparable harm without the remedy.\nRead full story on TOI+\n\n",
        "headline_1": "The wrongs of rulings on personality rights",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-wrongs-of-rulings-on-personality-rights/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-11-2025"
    },
    {
        "full_article": "By Narayani Ganesh\nEach year, in many cultures across the world, ancestors are propitiated and ceremonies performed to welcome them on their earthly visit as spirits. Pitr Paksh, Shraadh, Samain, Halloween, Bhoot Chaturdashi are some of the different ways by which respectful observances are made and memories shared, of the departed. Good spirits apart, Halloween displays caricatures of ghouls and demons, whereas perhaps what is really being referred to are the inner demons we face in our daily lives.\nAmong the most persistent demons within is the negative emotion of anger, rage, among others like fear, greed, jealousy and lust. An interesting story attributed to Gautam Buddha, called ‘King Sakka’s Demon’ is narrated by Josh Korda in Lion’s Roar , the magazine on Buddhist teachings: A demon fed on people’s resistance and anger. One day, thedemon climbed onto the king’s throne whilehe was away. King Sakka’s guards saw the little demon and yelled at it, “How dare you sit on the throne? This is an outrage!” As they yelled, the demon became a ferocious beast, breathing fire and terrifying the guards, who fled.\n\nWhen King Sakka returned, he tried a different approach. He greeted the demon with kindness. “How can i make you feel comfortable?” he asked. “Can i offer you something to eat? Do you want to put your claws up on the table?” With each nicety, the demon shrank in size. It became smaller and smaller until eventually the king could easily remove it from the throne.\nThis story is, of course, a metaphor for the way to relate to our anger and other challenging emotions, that are in fact our inner demons. If we try to get rid of, repress, or battle them, they only get stronger. The real practice is to do what Sakka did: turn towards the anger, make it comfortable, and create a safe place in the body where it can be felt.\nMost negative emotions feed on frustration, discontent, stress and anxiety. Says Madeleine L’Engle, “Remember that sometimes monsters only need to be kissed to be turned into beautiful princes and princesses.” Attitude is a key factor: How we deal with these emotions that may surface involuntarily in us, is what will decide whether the monster devours us or we tame it and ultimately bid it a friendly goodbye.\nA popular Cherokee story talks of inner conflict as two wolves battling within. One is positive, the other, negative. The grandfather is narrating the story to his grandson who asks him, “Which wolf will win?” The grandfather replies, “The one you feed will win.” Life coach Michelle Weimer says the story doesn’t end here, there is more. In another version of the story, the Cherokee says that feeding them both right will ensure that the dark wolf hunkers down and the white wolf dominates, co-opting the virtues of the dark wolf that is daring, courageous, persistent and fearless, qualities perhaps lacking in the pacifist white wolf. In other words, embrace the negative, befriend, understand and acknowledge them – instead of suppressing or repressing them, so that they do not resurface in a more vicious form.\nWe could say that every day is Halloween as we encounter different monsters, ghouls and ghosts of different dimensions, contributing to conflicts within; once they are acknowledged and we do not let them overtake us, all will be well.\nganeshnarayani@yahoo.com\n\n",
        "headline_1": "Ghouls & demons as metaphysical metaphors",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/ghouls-demons-as-metaphysical-metaphors/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-11-2025"
    },
    {
        "full_article": "Trump-Xi Busan truce could be tactical. But a confident China could return to bullying. India should be wary \nThe Trump-Xi meeting in Busan, South Korea, appears to have brought the fraying US-China relationship back to management mode. Trump, who seemed more optimistic, said both sides had agreed on almost everything and had reached a trade deal that could be signed soon. Beijing didn’t go so far but admitted that a basic consensus was reached on addressing major concerns. \nThe immediate outcome is that US will reduce fentanyl-related tariff on China by 10%, bringing the overall tariff rate on Chinese goods to 47% – which is below that of India’s rate – and China will pause rare earth export controls for a year in exchange for US suspending restrictions on Chinese companies from buying American tech, including advanced computer chips. The latter, however, is unlikely to apply to Nvidia’s Blackwell chip, said to be the best for AI.  \nOn the geopolitical front, two interesting points emerge. First, Trump and Xi reportedly agreed to work together to try and halt the Russia-Ukraine war. Second, Trump framed the meeting as a G2 summit. This will please Beijing. For, it has long aspired to be treated as an equal to US, managing global affairs jointly. But after the G2 concept first came into vogue during the Obama administration in late 2000s, the relationship quickly devolved to strategic competition. Plus, the first iteration of G2 also saw China adopt a bullying approach to India, confident in the knowledge that Washington wouldn’t jeopardise its relationship with Beijing. That dynamic could return now, to India’s detriment. \nMeanwhile, Trump might have changed his tone on China perhaps because he no longer sees Putin as reliable. Driving a strategic wedge between Moscow and Beijing is a key Washington goal. So, if Putin can’t be co-opted, perhaps Xi can be. But Trump is unpredictable. Moments before meeting Xi he ordered resumption of US nuclear testing in response to advanced weapons testing by China and Russia. This shows that the Busan truce may be more tactical, and fundamental strategic issues remain unresolved. Washington and Beijing, therefore, could just be preparing for their next bout. \n\n",
        "headline_1": "G2 Returns",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/g2-returns/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 02, 2025 00:00:00  \nAn enabling environment for young businesses is vital to any economy seeking sustainable growth. When entrepreneurs are given access to capital and institutional backing, they can turn ideas into initiatives that generate jobs and innovation. As such, the forthcoming public company for start-up investment is a forward-looking step that fills a crucial gap in financing for early-stage enterprises. The proposed company, to be called Bangladesh Startup Investment Company PLC, will be formed with an authorised capital of Tk 20 billion and paid-up capital of Tk 6.5 billion. It will be owned by 52 commercial banks represented through eight shareholders that includes four banks and four independent directors. The Bangladesh Bank is reported to be facilitating its formation. This direct institutional action is undoubtedly welcome news for the country's start-ups, as it will address the long-standing funding challenges they are facing due to their unconventional business models and limited collateral. What makes this intervention even more critical is the socio-economic environment it seeks to transform. Here, a significant share of educated youth is traditionally oriented towards secure employment in the BCS, government services or established corporate roles, leaving the fertile ground of entrepreneurship untilled. By providing a tangible financial pathway, this company can shift this risk-averse mindset and cultivate a more vibrant entrepreneurial culture.\nThe timing of this initiative coincides with a growing demand for venture capital in Bangladesh's expanding digital and service-based economy. The success of companies like bKash, Pathao and Chaldal shows that local innovation can grow rapidly when the right ecosystem is in place. Yet government refinance schemes and donor-backed programmes, though helpful to some extent, have fallen short of meeting the needs of a generation of entrepreneurs looking to scale. In this context, this new fund emerges as a potential catalyst for private innovation. Its real test, however, will lie how effectively it is implemented. Commercial banks by nature are oriented towards short-term returns and risk-averse lending practices, whereas start-up investment demands patience, sectoral insight and the willingness to absorb early losses. Given this inherent conflict, if banks attempt to manage these funds directly, the initiative may fail to deliver its intended impact. There is a palpable risk that a traditional banking approach could mire the fund in conventional, cautious decision-making, thereby defeating its very purpose and leaving the most promising ventures unfunded.\nTherefore, the critical imperative is to ensure that operational control is vested in seasoned professionals rather than the shareholder banks. The proposal to appoint foreign consultants is a partial solution, but a more robust approach would be to formally adopt a model where the banks act as passive limited partners, providing the capital, while the investment decisions are delegated to an independent team of general partners with proven expertise in venture capital. This structure would insulate the funding process from traditional banking biases and bring in the necessary expertise to identify and nurture promising ventures, ensuring that the capital is deployed effectively and strategically. Apart from financial support, the company should also build linkages with incubators, accelerators and private venture funds to strengthen the broader entrepreneurial ecosystem. \nThe launch of this company is a commendable leap of faith. For it to truly succeed, it must consciously break from the mould of its banking origins and embrace the distinct ethos of venture capital. If managed wisely, this initiative could well be the spark that inspires a new generation to embrace entrepreneurship and, in doing so, propel Bangladesh toward a knowledge-based and self-sustaining economy.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bridging the startup funding gap",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bridging-the-startup-funding-gap-1762010943",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       November 02, 2025 00:00:00  \nCan the trade and environmental policies interact? If yes, what will be its influence on climate change, biodiversity loss, pollution, and global trade flows? The questions are not new, and the answer to the first question is a resounding 'yes': it is both possible and necessary to interact with trade and environmental policies to make trade sustainable. This potential offers a hopeful and optimistic outlook, as it is the use of techniques and processes in trade that are beneficial for the environment by reducing pollution and enhancing the optimal utilisation of resources. The World Trade Organisation (WTO) rules also allow members to adopt trade-related environmental measures, provided that these are not for protectionist purposes that distort free trade. WTO has a committee on trade and environment, which is the standing forum for dialogue among the members of the multilateral trade rule-making body on the 'impact of trade policies on the environment and of environment policies on trade.' \nAlthough the WTO has no separate or dedicated agreement or set of rules on the environment or sustainable trade, a plurilateral initiative by several countries envisions a global trading system that protects and preserves the environment in accordance with sustainable development principles. Titled Trade and Environmental Sustainability Structured Discussions (TESSD), it was launched in 2020 to advance discussions on the intersection of trade and environmental sustainability. Currently, 79 WTO members are participating in discussions to develop a framework for sustainable trade.\n\nConsidering the importance of sustainable trade, various international organisations have also took initiatives to examine the diverse aspects of trade and sustainability. Some are also tracking how different countries are moving towards the green trade. The Hinrich Foundation is an organisation that has been working for almost a decade to publish an index of sustainable trade for selected economies, including Bangladesh. The foundation is an Asia-based philanthropic organisation dedicated to advancing mutually beneficial and sustainable global trade. Last month, it released the sixth edition of the Sustainable Trade Index with its partner, the International Institute for Management Development (IMD). IMD partnered with the Hinrich Foundation in 2022 to expand and enhance the index's comprehensiveness. Since then, the index has included 30 economies and is published annually. In the previous three indices, only 20 countries were included, and the publication was biennial.\nThe idea behind ranking different economies on trade sustainability is to gain a comprehensive understanding of how and what countries are doing to make trade more sustainable. This comprehensive understanding, which is crucial as there is no single model for achieving sustainable trade, is derived from examining the social, environmental, and economic benefits of international trade. The Hinrich-IMD Sustainable Trade Index 2025 evaluates how 30 economies navigate the intricate interplay between economic growth, social inclusion, and environmental stewardship within the global trade system. These 30 economies cover around three-fourths of the world's population and 80 per cent of international trade. \nThe latest index showed that economies that reduce reliance on natural resource exports have performed better in terms of overall sustainability in trade. The analysis of the index showed that mounting pressures across economic, societal, and environmental dimensions are reshaping traditional pathways to prosperity through trade. Moreover, economies are no longer aligning behind shared best practices, such as liberalisation, openness, or multilateralism; instead, they are operating in a fragmented world shaped by strategic divergence rather than consensus. It reflects the heightened uncertainty in the global economy and is primarily fuelled by US President Donald Trump's tariff war. In this connection, the report said: \"Following President Trump's return to office, the United States dramatically increased tariffs to reindustrialise its economy. Other economies responded by doubling down on domestic industrial policies already underway.\" Against the backdrop, advancing the green trade becomes more challenging.\nThe index is based on three pillars: economic, societal and environmental and these are divided into 72 indicators in total. The first pillar assesses an economy's capacity to foster and sustain growth through participation in international trade. The second pillar captures the human dimensions that make trade sustainable over the long term. The third pillar encompasses various stages of integrating trade-driven growth with environmental stewardship among nations. The entire exercise is undoubtedly a complex task.\nThe United Kingdom (UK) topped the latest index, followed by New Zealand, which moved into second place, as the countries swapped rankings from the previous year. Australia and Singapore remained in third and fourth place, whereas South Korea and Hong Kong moved up to fifth and sixth, respectively, leaving Japan in seventh position. Canada remained in eighth place, and the US advanced one notch to ninth place from the previous year. China and India remained 16th and 23rd in the index, as in the last year. \nBangladesh, however, dropped to 26th position, which was 25th in last year's index, whereas its rank was 23rd in the 2023 index. It means the country's performance in making the trade sustainable has deteriorated or has not improved like its peers. \nThe index showed that although the country has improved its performance in cutting trade costs and stabilising exchange rates, it has deteriorated in removing tariff and non-tariff barriers and advancing trade liberalisation. Bangladesh has also fallen behind in monetary policy intervention, technological innovation and technological infrastructure. As a result, its economic pillar remained weak.\nAccording to the index, Bangladesh performed better in the societal pillar due to some improvements in the sub-indices of political stability, forced labour, human trafficking, universal health coverage, and inequality. There is, however, little scope for complacency, as improvements in these areas are still small and, to some extent, fragile. \nAgain, except for a few sub-indices, such as energy consumption and wastewater treatment, Bangladesh's performance in most of the sub-indices of the environmental pillar remained unchanged. For instance, the country has made no progress on environmental standards in trade. \nSome observations about Bangladesh in the analytical report of the index are noteworthy. For instance, under the trade legitimacy matrix, which depicts strategic models of inclusion, Bangladesh is placed under the growth-first model along with India and the Philippines. \"Growth-first models incorporate countries like Bangladesh and India that pursue export-led development while their social protection mechanisms lag behind,\" said the report.\nUnder the trade realignment matrix, Bangladesh is placed at the intersection of low liberalisation and high tariffs, leading to protectionist pathways. \"Countries like Bangladesh, China, and India, for instance, demonstrate how such economies use trade as part of industrial policy, maintaining control over their pace of integration to support domestic development goals,\" the report mentioned in this connection. \nBy summing up the findings and messages of the index, it can be said that Bangladesh needs to undertake some drastic reforms in the areas of economic and environmental policies to move towards green trade. At the same time, policymakers in the country need to address the social drawbacks and barriers to human development.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bangladesh's struggle to make trade sustainable",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bangladeshs-struggle-to-make-trade-sustainable-1762011079",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       November 02, 2025 00:00:00  \nIn recent years, Bangladesh has been under a rising threat of food insecurity. This concern is not merely a matter of public perception; several international rankings that measure poverty and food security, such as the Global Food Security Index, Global Hunger Index, and Multidimensional Poverty Index, corroborate this view. A recent report jointly released by the Food Planning and Monitoring Unit (FPMU) of the Ministry of Food and three United Nations agencies warn that by December this year, around 16 million people in the country may experience severe food insecurity, while approximately 1.6 million children are likely to suffer from acute malnutrition.\nDespite this grim reality, Bangladesh experiences a significant amount of food wastage and loss. According to a report by the United Nations Environment Programme (UNEP), the average per-person food wastage in the country is higher than the global average. Globally, each person wastes or spoils about 79 kilogrammes of food at home annually, whereas in Bangladesh the figure stands at 82 kilogrammes-exceeding the wastage levels of many developed nations. In a country where countless people struggle to get three meals a day and stand in queue for hours to buy essentials at subsidised rates from TCB trucks, such extravagant wastage in households, restaurants, and wedding parties is nothing short of being criminal.\nFurthermore, a substantial portion of food is lost in Bangladesh at various stages of the supply chain mainly because of the lack of storage facilities and paucity of knowledge about food preservation and processing. An estimated 30 per cent of Bangladesh's fresh produce is lost annually due to inadequate storage mechanisms and limited knowledge of food preservation techniques. Fruits, vegetables, onions, milk, and fish etc. often perish at various stages of the post-harvest supply chain, resulting in millions of tonnes of food loss each year.\nNotably, Bangladesh's current storage facilities are built with a focus on rice and potatoes, leaving limited space for perishable goods such as fish, meat, and vegetables. Farmers face substantial losses, particularly during peak seasons. For example, nearly every winter, farmers are forced to destroy tomatoes when market prices plummet below production costs. However, tomato prices in the off-season soar to as much as Tk 200 per kg. With adequate storage and processing facilities, farmers could store surplus produce for future sale at fairer prices, preventing the needless destruction of this valuable crop.\nTo ensure food security, only increasing crop production and increasing food supply in the market are not enough. Equally important is to reduce wanton food wastage and food loss by raising public awareness and increasing preservation facilities. Agricultural experts argue that by establishing cold storage facilities at major production hubs as well as major wholesale marketplaces, such food losses could be reduced to a bare minimum. Improved storage infrastructure would not only expand the supply of fresh produce but also increase farmers' incomes by enabling them to earn higher profits from preserved produce. With the right infrastructure, surplus yield could be processed and exported, bolstering the economy. \nResearchers also highlight the potential of regional grain reserves to alleviate food wastage and improve food security. Forming cooperative groups among farmers and producers to share resources for conservation and preservation could strengthen local food supply systems. The government should also incentivise private-sector investment in food processing. Overall, concerted efforts must be made to ensure that the food grown and harvested within the country is used to nourish its people rather than mindlessly allowing it to go waste.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Putting an end to food wastage",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/putting-an-end-to-food-wastage-1762011137",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 02, 2025 00:00:00  \n\nThe recent incident of students from two universities clashing overnight over an accidental act of spitting cannot be viewed in isolation from the broader context of social intolerance and the fragile law and order situation in the country. In recent months, reckless clashes among students in educational institutions have become almost routine. Such anarchic activities not only cause extensive damage to institutional property but also severely disrupt academic life and leave many students injured. This situation is deeply concerning for all - students, parents, and citizens alike.\nOn Sunday night, students of Daffodil International University and City University in Ashulia, Dhaka, were involved in a series of chases, attacks, and counterattacks that left at least 150 students injured. City University students reportedly attacked a mess of Daffodil students, while Daffodil students retaliated by vandalising parts of City University. It is appalling that such large-scale violence erupted over a trivial issue like accidental spitting - something that could have been resolved with a simple apology.\nDespite the prolonged clash, law enforcement agencies were not seen taking effective action to stop the violence, which reflects a serious failure on their part. The role of the university administrations, including the proctorial teams and student advisors, also appeared inadequate. Educational institutions must prioritise discipline and conflict resolution training to prevent such disgraceful incidents in the future.\nAshikujaman Syed\nsyedashikujaman@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Severe conflict over spitting",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/severe-conflict-over-spitting-1762011189",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-11-2025"
    }
]