[
    {
        "full_article": "The seven Indian delegations of mostly Members of Parliament and some former diplomats, tasked by the government to carry diplomatic messages after Operation Sindoor, have completed their travels. The 59 members visited 32 countries to convey the country’s position on the outrage felt over the Pahalgam terror attack and its links to Pakistan, the restrained and precise nature of Indian strikes on Pakistan’s terrorist infrastructure, and the “new normal” the government has adopted for terrorist strikes. The message was meant not just for foreign governments but also for lawmakers, the foreign media and the general public, especially in countries where New Delhi has felt it has not found the expected support. Many of the countries visited are members of the UN Security Council (UNSC), and include those which are elected non-permanent members or will join next year. This is important as India faced a diplomatic setback when Pakistan, an elected UNSC member for 2025-26, was able to amend the UNSC statement to omit references to The Resistance Front (TRF) that had claimed responsibility for the Pahalgam attack. That Pakistan managed to be chosen Chair of the Taliban Sanctions committee and Vice-Chair of the UN Counter-terrorism Committee will make India’s task of holding the terrorists responsible for the attack accountable through UN designations and at the Financial Action Task Force more difficult. Another area of focus was the membership of the Organisation of Islamic Cooperation that has been particularly critical of India. Finally, the focus on the U.S. was pointed, where the delegation visited New York and Washington. This may have stemmed from the appearance that ties with Washington are strained over President Donald Trump’s persistent claim that he had mediated the ceasefire between India and Pakistan, using trade ties as a leverage to avert a “nuclear conflict”.It remains to be seen just how successful these tours of political diplomacy have been, given criticism in India that more time was spent speaking to the Indian diaspora, and giving interviews to the accompanying Indian media rather than in influencing interlocutors abroad. The delegations also had to contend with a copy-cat move from Pakistan to counter the Indian narrative. However, the overarching message of the delegations, comprising representatives from a number of Indian States, faiths and political parties, is a powerful one — of Indian unity and consensus on the issue of national security. At a time when the Modi government is under criticism internationally for “democratic decline” and increasing majoritarianism, New Delhi chose its messengers wisely, with a view to projecting abroad a positive and pluralistic image of a country that was resolute against terrorism.\r Published - June 09, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        diplomacy\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        United Nations\n                    \n                            /                      \n                        \n                        Indonesia\n                    \n                            /                      \n                        \n                        Malaysia\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        democracy",
        "headline_1": "​Influencing interlocutors: On Operation Sindoor, India’s delegations",
        "headline_2": "The delegations projected a united image of pluralistic India",
        "link": "https://www.thehindu.com/opinion/editorial/influencing-interlocutors-on-operation-sindoor-indias-delegations/article69671556.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "09-06-2025"
    },
    {
        "full_article": "Ethnic conflicts, unlike other variants of strife, are more difficult to end because of the nature and the level of grievances of the communities hostile to each other. This persecution complex is fed by those who drive passions to such an extent that taking a position on reconciliation through mutual compromises and peace-building becomes difficult even if a silent majority are in favour of it. Using threats by brandishing arms, chauvinist sections try to drown out voices of reason by drilling in fear and ideas of further vengeance. That seems to be the case with Manipur too, where, after months of dilly-dallying over taking on the patrons of violence, the Bharatiya Janata Party-led Union government has finally decided to isolate such elements and subject them to the long arm of the law. That the Imphal valley has again erupted in protest over the arrest of leaders of the extremist identitarian outfit, Arambai Tenggol, highlights the necessity and the difficulty of implementing law enforcement measures in an ethnic conflict. This group had engaged in acts of wanton lawlessness with impunity, targeting those who did not agree with its militant agenda with violence and threats. It had also coerced MLAs into signing pledges for its chauvinist cause. Shockingly, the then BJP-led State government looked the other way – a consequence of Chief Minister N. Biren Singh’s inability to rise above his partisanship. The security forces were also unable to act because of public protection for the violent offenders. Soon, such groups went to become a major threat to peace and it was only after implementing President’s Rule that the government managed to get the group, among others, to return most of the weapons looted from police constabulariesThe arrests have coincided with similar actions against other militant volunteers in the hills who were allegedly involved in violence against law enforcement officers. The government of Manipur, which is currently under President’s Rule, must make a clear case of the involvement of those arrested in crimes and bring them to justice. It should not give in to the threats made by those stoking communal passions, and must convince the people – across ethnic lines – that these are lawful actions against malefactors. It must simultaneously engage in talks with other stakeholders, also asserting that such steps will coincide with peace-building and rehabilitation measures. It must use devices such as convening all-party meetings and involving civil society representatives from across all ethnic lines to reinforce this message, and must not give in to pressure to reverse the legal steps taken against the offenders. Published - June 09, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        Manipur\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        government",
        "headline_1": "​Lawful measures: On Manipur and law and order",
        "headline_2": "Breaking the cycle of impunity in Manipur requires unpopular measures",
        "link": "https://www.thehindu.com/opinion/editorial/lawful-measures-on-manipur-and-law-and-order/article69672120.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "09-06-2025"
    },
    {
        "full_article": "Supposing a song, book, movie pulls a tourist to India, how might this journey go? \nPerhaps nothing gladdens an ersatz desi heart more than a Western ode to Indian beauty. All the complexities of that EM Forster novel about that cave are nothing in comparison to how it continues to send the odd traveller our way. That one Odissi dancer in one Michael Jackson video is never to be forgotten. More current examples of course result in convulsions of joy. Wes Anderson to Coldplay, we scan any India-ish creation with a Sherlock magnifying glass. Did you spot Jodhpur’s Mehrangarh fort or this spice bazaar or jhumka gali or that Varanasi ghat or Worli gaon? Ed Sheeran’s new song Sapphire has also sent the socials on this look, don’t miss, hunt. \nAs a solidly underperforming tourist destination, India can really do with this kind of free advertising. It’s one thing to be totally overshadowed by France, quite another by petite Dubai with nary a world heritage site. Even domestic tourists have begun switching their Goa bookings to Hanoi, Phuket, Bali and Siem Reap. Hence any global song, book, movie pitching Destination India sparking a national amour propre is logical. But supposing tourists far and near do hark the invite and do hoof over, it still may not, sadly, make for a fairy tale.\nAs Abhijit Banerjee has written in TOI, we may be a very big country, but most tourists don’t seem to know that. Crowds gravitate to the same historical ports of call, the same hill stations, the same beaches. For the most part, authorities don’t even try to moderate the overcrowding, whether it means pollution turning ancient marble to grey or stacked monstrosities destabilising Himalayan mountains, which means tourists having a poor to dangerous experience. Full circle then, the tourist will curse the song, book, movie that made the nightmare look like a dream.\n\n",
        "headline_1": "Holiday CRush",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/holiday-crush/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-06-2025"
    },
    {
        "full_article": "When a long California queue flatters to deceive\nThere are few things in life more suspect than a long queue of students outside an ice cream shop – except perhaps a professor starting class on time. Yet there I stood, hypnotised by the serpentine line outside Maruwu Seicha, a Japanese tea specialty store on University Avenue, Bay Area, famed for its Matcha ice cream and even more for the number of selfies clicked in front of it.\nThe aroma of exclusivity was thick in the air. After 20 minutes of pondering life, love, and lactose, I reached the counter and asked the fatal question: “Is this gluten-free?” The cashier, clearly trained in the ancient art of customer discouragement, stared at me as if I’d asked her to explain quantum physics in iambic pentameter. With a weary sigh, she barked, “Hey, anyone know if there’s flour in the ice cream?” Several heads nodded vaguely – either in agreement or early signs of fatigue. I took that as a ‘probably safe’.\nOrdering was a bit like investing in cryptocurrency – you don’t understand it, but everyone else seems to be doing it, so you throw caution (and cash) to the wind. My order was punched in without knowing what it was, only that it wasn’t sold out. We were united in ignorance, the cashier and I – two souls adrift in a sea of Matcha.\nThe wait stretched on like a Tolstoy novel. Around me, young scholars buzzed with the vigour of finals-week caffeine. Their devotion to Maruwu’s green swirl suggested that either the tea had magical properties or tuition didn’t buy much else.\nFinally, my prize arrived: a dainty spiral of jade-green mystery, perched atop a cone like a temple offering. One lick in, I paused. Was this dessert or penance? The second confirmed my fears – it tasted exactly like a bitter tea gone cold, frozen in time.\nI passed the rest to my unsuspecting family, murmuring with poetic resignation, “Not my cup of tea.” They nodded with pity. I had been Maruwu’d.\nTo be fair, this may be a delicacy for those who enjoy their dessert with notes of ancient philosophy and powdered austerity. For the rest of us, Salt & Straw exists – and with flavours that don’t double as dissertations.\nMoral of the cone: sometimes FOMO leads you to enlightenment; sometimes, it just leads you to a very cold green regret.\n\n",
        "headline_1": "Not My Cup of (Matcha) Tea",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/not-my-cup-of-matcha-tea/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-06-2025"
    },
    {
        "full_article": "Ottawa must take action against Khalistani groups to bring ties with New Delhi fully back on track \nEnding days of speculation, Canadian PM Mark Carney has finally extended an invitation to Modi for the upcoming G7 summit. Carney now says that India is a must at the global high table since it is critical to global supply chains and other important geopolitical matters. Odds are that India and Canada will now be on the right path after a rough phase under the previous Canadian administration led chaotically by Justin Trudeau. \nThat said, Ottawa must know that full restoration of positive ties will depend on it taking appropriate action against Khalistani elements involved in anti-India plots. It is precisely because Trudeau refused to acknowledge this issue – thanks in large part to pro-Khalistan Jagmeet Singh being his coalition partner – that ties between New Delhi and Ottawa soured in the first place. And when Trudeau, without a shred of evidence, blamed Indian govt agents for the death of Khalistani separatist Hardeep Singh Nijjar, it was the last straw. Thankfully, Carney says that law enforcement dialogue between the two sides is now back on track. This is good. But given the political clout that Khalistanis in Canada have come to enjoy over both major parties in that country, sensitivity towards India’s legitimate concerns risks being piecemeal. \nNote that following the Pahalgam terror attack and Operation Sindoor, India has enunciated a new, tough position on terrorism. This is non-negotiable. And there is sufficient evidence that Khalistani groups have been coordinating with Pakistan-sponsored extremist outfits. A 2021 Hudson Institute study highlighted interlinked Khalistani and Kashmiri groups that potentially receive funding, support and military training from Pakistan. Hence, there are serious Indian security concerns at play. \nFor Canada, mutually beneficial ties with India make sense today given how the Trump administration has upended Washington-Ottawa ties. Add to this Trump’s propensity to weaponise tariffs, and both India and Canada have enough reasons to cooperate on trade. Canada is a natural resources powerhouse. India needs those resources to power its own growth. Plus, the two can play a significant role in the Arctic where a strategic scramble for resources is already underway. Canada, as the current G7 chair, played to its self-interest too to invite Modi for the summit – he’s been a regular since 2019. The people-to-people equation between India and Canada already has a strong foundation, thanks to the Indian Diaspora. It’s time to get the strategic dimension of the relationship right. \n\n",
        "headline_1": "Canada calling",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/canada-calling/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-06-2025"
    },
    {
        "full_article": "Defence minister Rajnath Singh lays out GOI’s new position of zero-tolerance of and assured retaliation against Pak-sponsored terrorism, also suggesting five ways the global community can fight terror\nTerrorism is a scourge on humanity. It thrives on misguided notions of revolution, martyrdom, and a romanticised view of violence. The assertion that “one man’s terrorist is another man’s freedom fighter” is a dangerous misnomer – true freedom can never be built on fear and bloodshed.\nThe currency of terrorism is fear. Yet, even in spreading fear, they have failed to instil any sense of pessimism. India is testimony to this fact. Whether it’s 26/11 or the 2001 Parliament attack or the recent Pahalgam attack, India stands taller, stronger, and more resolute than ever. All peaceloving nations need to come together to eradicate this menace once and for all.\n\nRead full story on TOI+\n\n",
        "headline_1": "‘We’ve shown how to defeat terror’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/weve-shown-how-to-defeat-terror/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-06-2025"
    },
    {
        "full_article": "On World Environment Day, the conversation around plastic pollution takes centre stage—globally, in treaty rooms and international campaigns, and locally, as we stare at rivers choked by waste and fields littered with non-biodegradable remnants of daily survival. But too often, we isolate the plastic crisis from the human beings at its centre: the families, farmers, vendors, and millions for whom plastic is not a convenience but a necessity—a needed tool for carrying goods to work on a rainy day, building shelter to withstand torrential rains when there is no roof overhead, or simply storing belongings when even a tin trunk is unaffordable.\n\nPlastic must be removed from our lives, for it kills—whether through choking rivers and oceans, or through the CO2 emitted in its production. But this can only happen when alternatives become reachable for the unrecognised faces who use it daily, not just for ease but for necessity. In a country like Bangladesh, where the vast majority live on the edge of survival, affordability and availability dictate choice. The conversation around alternatives must begin by asking: What will people use instead? And how will they afford it? If those answers remain unclear, expecting sudden behavioural shifts or blanket bans is not only unrealistic, it is unjust.\nWe need to find a solution that is both humane and environmentally responsible. We cannot presume to restrict plastic use only through regulation. We must provide alternatives and instil an understanding of the harm it causes, especially among those who rely on it most. People must feel connected to the cause, to understand that this is about protecting the rivers, the land, and the environment we all share. When the message speaks to the heart, not just through statistics or enforcement, it inspires collective responsibility. That is where real, lasting change begins.\nToday, we speak of climate treaties and plastic bans. But unless the state becomes personal—unless the farmer understands why it matters to him, unless the mother in a char village sees what plastic waste might do to her child's future—we will not see real transformation. A policy that asks millions to give up a necessity must not descend like an order. It must rise from understanding, built through empathy and communicated in language that respects people's lives and acknowledges their realities.\nThe global plastic treaty being negotiated, as reported in IISD's Earth Negotiations Bulletin, is a welcome step. But it must not absolve us of our responsibilities at home. Plastic is already having an incredibly negative impact on the quality of our lives. Our rivers are clogged. Our waste systems are inadequate. While international consensus can help us gain legitimacy in our actions, we are already suffering daily from the lack of regulation and alternatives. We cannot wait for consensus to take shape. We need to act now—but act wisely—so that the millions who rely on plastic today are able to shift to alternatives, even if those alternatives are not yet as useful.\nAt the same time, we must resist imported narratives that do not fit our context. Western countries, with their histories of industrial growth, carbon emissions, and pollution, have created much of this crisis. But this is not about them feeling guilt. Guilt can be brushed aside—by individuals, by corporations. What we must appeal to is conscience. One person's conscience can lead hundreds to positive action. If there is to be a global commitment to healing, it should not be framed as reparations for the past, but as a response to the suffering of the present. Let conscience, not compensation, guide the way forward.\nBack home, we must learn to see the nuances. Not all plastic is single-use or wasteful. In Bangladesh, we reuse everything. A plastic bottle may be used for months. Plastic furniture allows families to live with dignity. On a recent visit to a shop in Kachua, I was handed a plastic bag labelled \"100 percent biodegradable.\" Bioplastics like those being developed by Sonali Bag may hold promise. But we must ensure that sustainability does not become another form of inequality, where the poor are penalised for using what they can afford, while the rich purchase expensive \"eco\" products.\nEven a seemingly progressive decision, such as banning plastic and requiring only glass in offices, raises valid questions. The intention is noble. But how do small businesses comply? What happens to vendors who cannot afford the transition? Policy without inclusion becomes exclusion.\nSo, what should we do?\nWe must begin with awareness that respects, not lectures. Speak to people in their own language—not only linguistically, but through their lived experience. Show them that if the rivers are blocked, if the fish die, if the soil degrades, their own lives will be affected. And then, crucially, provide real alternatives. No one wants to harm the environment. But no one should be forced to choose between dignity and sustainability.\n\nIt is possible to mobilise people—especially the young—when they feel part of a collective mission. It is possible to educate without blame. To act without alienating. To build, not just ban.\nLet us mark this World Environment Day not with more slogans, but with sincerity. Let us appeal not just to policies and politics, but to the hearts of people. Because only when environmental responsibility becomes personal, deeply human and emotionally understood, will we begin to see real change.\nLet us make the state personal. Let us make conscience our most powerful policy.\nRuna Khan is founder and executive director of Friendship.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Why change must start with people",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/why-change-must-start-people-3912156",
        "news_paper_name": "The Daily Star",
        "publish_date": "09-06-2025"
    },
    {
        "full_article": "As Muslims around the world prepare to celebrate Eid-ul-Azha, it is a time to reflect on the values of sacrifice and gratitude that this festival embodies. These principles resonate deeply especially when millions in Gaza are facing hunger and death under Israeli attacks, and hundreds of Rohingya children are being denied their right to education. Closer to home, some workers are returning to their villages without receiving salaries or bonuses. Then there are the road accidents that have become a tragic routine during every Eid, as tens of thousands of people travel from cities to spend the holidays with loved ones.\n\nAlthough, like during Eid-ul-Fitr earlier in the year, bus, train, and launch journeys have so far been relatively smooth, several road accidents and at least one robbery on the highway have already occurred, despite increased patrols by law enforcement. However, the responsibility of ensuring safety on highways and river routes does not rest solely with the authorities—it is shared by passengers, transport owners, and drivers alike. Passengers, too, must avoid overcrowded or unfit vehicles, while owners and drivers must prioritise safety over profit, avoiding reckless driving. Law enforcement officials must also remain vigilant.\n\nAnother critical aspect that calls for both responsible behaviour and proper planning is the sacrifice of animals. As we celebrate this act of devotion, we must not lose sight of our duty to show kindness to all living beings. Sacrificial animals should not be subjected to unnecessary cruelty. In cities and municipalities, we must ensure that animal waste and other refuse from our households and neighbourhoods are properly disposed of, and that streets, footpaths, and house premises where animals are kept or sacrificed are thoroughly cleaned.\n\nThis Eid-ul-Azha marks the first in which municipal and city corporations are being overseen by administrators rather than elected representatives. Many of these administrators are also juggling responsibilities in other government departments. However, this must not be used as an excuse for delays in post-Eid cleanliness drives. On the contrary, swift waste disposal should be treated as a top priority, especially as monsoon rains could worsen the stench and spread of blood, creating ideal conditions for the breeding of dengue mosquitoes. We also hope that the efforts of Dhaka South City Corporation will not be disrupted, as they were for 21 days when supporters of BNP leader Ishraque Hossain staged protests at Nagar Bhaban.\nWe wish everyone a safe and joyful Eid.\n",
        "headline_1": "We must uphold the spirit of Eid-ul-Azha",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/we-must-uphold-the-spirit-eid-ul-azha-3911846",
        "news_paper_name": "The Daily Star",
        "publish_date": "09-06-2025"
    },
    {
        "full_article": "We are surprised to learn of the promulgation of the National Freedom Fighters Council (Amendment) Ordinance-2025 that replaces the National Freedom Fighters Council Act-2022, redefining some key aspects related to the Liberation War. At a time when the nation is navigating an extremely fragile transition to democracy, this adds yet another element of confusion and controversy that we could do without. Codifying a more restrictive, combat-oriented definition of freedom fighters (FFs) and the war itself might seem justified in an ideal sense, especially given the history of political exploitations under Awami League. But it also reflects a potential reframing of national memory that no bureaucracy should be entrusted with.\n\nIt's true that much of the initial confusion about the ordinance stemmed from flawed reporting, particularly erroneous claims about the \"revocation\" of the recognition of Bangabandhu Sheikh Mujibur Rahman, Tajuddin Ahmad, and other national heroes as freedom fighters. But partly responsible for it is the redefinition of a \"freedom fighter\" and the introduction of three new categories, including that of an \"associate of the Liberation War\"—thus dividing all previously recognised under the broad term of freedom fighters into distinct groups. For example, all Members of the National Assembly (MNAs) and Members of the Provincial Assembly (MPAs) who were aligned with the wartime provisional government and later became members of the Constituent Assembly will now be considered \"associates,\" whereas those who led the provisional government will continue to be recognised as FFs. These categories overlap in some cases, and exclude in others, creating grounds for ambiguities.\n\nWhile the reclassification may not affect the benefits received by freedom fighters or their families—as later clarified by the adviser to the Ministry of Liberation War Affairs—the real question is: was this reframing, and the symbolic rollback of recognition for some, necessary at all? If there are concerns about \"fake\" freedom fighters, this approach will certainly not help. On the contrary, it piles on existing bureaucratic workload by necessitating fresh examinations of status. By defining a \"freedom fighter's family\" strictly as their spouse, son, daughter, father, or mother, the ordinance appears to align with the post-uprising restructuring of job quotas that no longer extend to their grandchildren. But again, these objectives could have been pursued without wading into what some perceive as a revisionist attempt. At the very least, the government could have consulted with political parties to generate consensus on such a divisive issue.\n\nThe government has interfered in such historical matters in the past as well. Instead of doing what is ideally the responsibility of historians or society at large, we feel the interim government, which by definition is meant to do only crucial tasks, should focus on more urgent and present-day reforms that the nation is eagerly waiting to see. And whatever it does, it should stop bringing a top-down approach to critical reforms.\n",
        "headline_1": "How is this a priority for the government?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/how-priority-the-government-3911416",
        "news_paper_name": "The Daily Star",
        "publish_date": "09-06-2025"
    },
    {
        "full_article": "The extent to which the right to file cases has been exploited in the wake of the July uprising boggles the mind. It was only the other day that we commented on the questionable manner in which a 69-year-old former professor accused in an attempted murder case was treated. The case—filed by a former Jagannath University Chhatra Dal leader who was injured in a clash at the height of the uprising—had several hallmarks of a dubious case, including its lodging after about seven months since the alleged crime and mass listing of accused individuals (193 in total). Yet she was singled out, arrested, denied bail, and sent to jail. As we try to process the role likely played by police and magistrate courts in enabling such cases, we are again reminded of their absurdities by yet another case reported by this daily.\nThe victim this time, strange as it may seem, is a \"dead\" man coming alive. According to our report, Md Selim, a grocer from Mymensingh's Phulbaria, was falsely declared dead in a murder case filed over the July uprising. Lodged by his elder brother, with two other brothers serving as witnesses, the case claims that Selim was shot dead by police in Dhaka's Jatrabari on August 3 and later buried in Gopibagh. It also falsely implicates 41 people, including the ousted PM Sheikh Hasina.\n\nSelim is now fighting a surreal legal battle just to prove he exists, scurrying from office to office, facing severe harassment, and fearing for his life as a potential murder would fit the narrative of his \"death.\" The motive behind this case, as recent police investigations have uncovered, is a family dispute over inherited land. With Selim having no sons, his three brothers allegedly sought to seize his share by exploiting the chaos of the uprising to eliminate him, at least on paper.\nSelim is now fighting a surreal legal battle just to prove he exists, scurrying from office to office, facing severe harassment, and fearing for his life as a potential murder would fit the narrative of his \"death.\" The motive behind this case, as recent police investigations have uncovered, is a family dispute over inherited land. With Selim having no sons, his three brothers allegedly sought to seize his share by exploiting the chaos of the uprising to eliminate him, at least on paper.\nThat the legal system could be weaponised so easily for personal gain, and that such a bizarre case could progress as far as it did, speaks volumes about the merit of many of the cases filed over July atrocities. The incident also raises alarm about the integrity of those responsible for vetting or handling such cases. If an alive man can be shown as dead, and a 69-year-old widow arbitrarily jailed, how many other opportunistic or retaliatory cases have slipped through the cracks? We call on the authorities to urgently review all such politically or personally motivated cases, and hold to account those filing or enabling them. No one must be allowed to exploit the legal system or the July uprising.\n",
        "headline_1": "'Dead' man coming alive is the new face of July case fiasco",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/dead-man-coming-alive-the-new-face-july-case-fiasco-3909296",
        "news_paper_name": "The Daily Star",
        "publish_date": "09-06-2025"
    }
]