[
    {
        "full_article": "By calling for an all-party meeting on March 5 to discuss the delimitation exercise, Tamil Nadu Chief Minister M.K. Stalin has sought to stir up a national debate. Delimitation, as an exercise, has not seen any increase in the legislative seats since 1973, having been frozen as per the 1971 Census for parity in population growth across States. This was done to prevent States with a higher population growth from getting “rewarded” with a higher number of representatives at the cost of other States with better health indices and lower growth. The 84th constitutional Amendment had stipulated that the delimitation exercise would be based on the first Census after 2026. Is the Union government inexplicably delaying the Census exercise to allow for the delimitation exercise to be held earlier? In the normal scheme of things, the exercise would have been done after the 2031 Census, but it is now possible after 2026 once the Census (due in 2021), is conducted.The concern of Tamil Nadu that the exercise could hurt its representation in Parliament is legitimate if the Centre intends the process to be only proportionally representative of each State’s population. This is illustrated in the population growth rates (1971-2024) in Tamil Nadu and undivided Bihar. The electorate, for which recent data is available, grew by 171% in the former as against 233% in the latter, while they had a comparable number of Lok Sabha MPs (39 versus 54, including Jharkhand). If delimitation was held and constituencies redrawn to match population growth, and even if the overall Lok Sabha tally was increased, the final number for Tamil Nadu would clearly be much lower than Bihar’s. Other States with reduced fertility rates, such as Kerala and Karnataka, will also be affected. Home Minister Amit Shah has said that there will be no “reduction on a pro-rata basis” for Southern States and that they would get their “rightful share” but there has been little clarity on whether this would mean that their proportion of representatives will be retained after delimitation. The significant increase in population since 1973 should lead to an increased number of representatives, and, therefore, a higher number of seats, especially in north India’s highly populated States. Yet, the equally important principle of federalism should suggest the need for the proportions of representation to be maintained to keep the balance of power intact across States. More importantly, the government must expedite the Census just to allay concerns that it has been delayed to facilitate an earlier and controversial delimitation. A nation striving to reach the higher pedestals of world power cannot afford to delay the basic exercise of counting the number of its own people. Published - February 28, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        politics\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        Assembly Elections\n                    \n                            /                      \n                        \n                        population and census\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        Karnataka",
        "headline_1": "​Counting matters: On delimitation, federalism, the Census",
        "headline_2": "Delimitation must remain true to both representation and federalism",
        "link": "https://www.thehindu.com/opinion/editorial/counting-matters-on-delimitation-federalism-the-census/article69271537.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-02-2025"
    },
    {
        "full_article": "President Donald Trump has invited Ukrainian President Volodymyr Zelenskyy to Washington to sign a deal that would give Washington access to Ukraine’s rare earth mineral deposits, in exchange for the White House’s support in ending the three-year war there since the Russia invasion. While Mr. Trump has — to his domestic constituents — positioned the deal as favourable to the U.S., to help American taxpayers “get their money back” in the context of U.S. aid to Ukraine, he has also emphasised that responsibility for the security angle of the Ukraine situation would fall on Europe. Hinting at what appears to be a limited future U.S. commitment to and involvement with the conflict, the Trump administration has so far avoided providing any security guarantee to Ukraine that would accompany the minerals deal, even though Mr. Zelenskyy has said: “If we don’t get security guarantees, we won’t have a ceasefire, nothing will work, nothing.” Nevertheless, both sides are closing ranks on an agreement that revolves around a “Reconstruction Investment Fund”, towards which Ukraine would be required to contribute 50% of “all revenues earned from the future monetisation of all relevant Ukrainian Government-owned natural resource assets [… including] deposits of minerals, hydrocarbons, oil, natural gas, and other extractable materials, and other infrastructure relevant to natural resource assets”. An early draft suggests that the fund will be managed by both countries, yet details on its governance and operation have not been hammered out yet.On the one hand, the unambiguous positive outcome to hope for would be a robust ceasefire between Moscow and Kyiv, followed by bilateral territorial and institutional agreements that ensure peace as a precursor to reconstruction and rehabilitation of the areas devastated by Russia. Yet, sceptics may wonder whether this deal tips more in favour of resource extraction by the U.S. rather than any broader peace-seeking efforts, especially because the EU, as a critical stakeholder to any denouement in Ukraine, has been left in the cold; and because the Trump White House appears to have discussed with Russian President Vladimir Putin the possibility of Moscow working with U.S. companies to “mine rare earth mineral deposits in both Russia, and parts of Russian-occupied Ukraine”. There is nothing wrong with healthy competition and bilateral or multi-party deals for the extraction and sale of rare earth minerals, now a vital resource. However, when investment deals in this sector are used to blunt and deflect from strategic questions regarding Russian aggression and the large-scale violations of human rights, it becomes considerably harder to distinguish Mr. Trump’s plans for the region from an unapologetic neo-colonial agenda. Published - February 28, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Ukraine\n                    \n                            /                      \n                        \n                        rare earths\n                    \n                            /                      \n                        \n                        minerals\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        finance (general)\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        natural resources\n                    \n                            /                      \n                        \n                        peace negotiations\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        European Union",
        "headline_1": "​Art of the deal: On Trump and a Ukraine mineral deal",
        "headline_2": "Trump’s plans for peace seem a part of a neo-colonial agenda",
        "link": "https://www.thehindu.com/opinion/editorial/art-of-the-deal-on-trump-and-a-ukraine-mineral-deal/article69270855.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-02-2025"
    },
    {
        "full_article": "We need fresh perspectives on keeping the peace. Old ways will keep failing in old ways\nWar is the continuation of business by other means, Brecht famously said, in his play, Mother Courage and Her Children. He wrote it in direct response to Hitler’s invasion of Poland in 1939. And certainly the military industrial complex finds wars inordinately profitable. But this is not at all the case for most other businesses. Indeed, what we actually see in Brecht’s play is how painfully challenging everyday economic activity becomes when war arrives on the scene. And in a super interconnected world, the hits don’t remain local, but go global. We are not making the case that ending or avoiding wars is easy. But, were this to become the prime imperative, fresh approaches to making peace, and keeping peace, will follow.\nSome developments in the Trump 2.0 administration are interesting from this prism. For example, the Ukraine-US minerals deal, which at first look drew horrified gasps. It has now taken very promising contours, so much so that even a faint outline of Ukraine-Russia detente is on the horizon.\nSame is the case with Trump wanting to buy Greenland from Denmark. It first made jaws drop. But then came second thoughts. And since then, many earnest policy wonks have begun to argue that not only would such a deal make strategic sense for US, Greenlanders would also be much better off. There are 57,000 of them, sovereignty compensation ranging from $100,000 to $1mn per person is the buzz. If such an idea were to really take root in the world, if nations could buy and sell territory, with people’s consent, wouldn’t they stop going to war? And if nations stopped going to war, imagine what all the mammoth expenditure on bombing and killing could be diverted to instead. Imagine global trade without fractures, far higher spending on health and education – and countries without armies.\n\n",
        "headline_1": "Make deals, not war",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/make-deals-not-war/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-02-2025"
    },
    {
        "full_article": "How’s an ‘anti-national slogan’, however defined, a crime? What about the right to free speech? \nOnce again, that undefined-in-law non-offence, ‘anti-India’ slogan, is a reason for police action. A 14-year-old boy and his parents in Navi Mumbai were deemed threats because of the teen’s vocal support for Pakistan’s cricket team, voiced inside his house. Courts will – incredibly – now be asked to determine whether any Indian cheering a rival team can disrupt India’s harmony, or harm the nation. But even as things stand, the case unravels itself. Police acted swiftly upon a complaint by locals walking by the house who heard the boy cheering during Sunday’s India-Pakistan cricket match. They confronted the parents, who stood by their son. Over to cops, who obliged by arresting the parents and sending the teen to a remand home. No less egregious was the fact that administration found enough cause to raze the scrap dealer’s business place within two days, on the fig leaf of the property being “unauthorised”.\nFirst, the arrests. Police promptly filed an FIR under BNS Sections 196 (promoting enmity between groups, doing acts prejudicial to maintenance of harmony) and 197 (imputations/assertions prejudicial to national integration). These are serious allegations that invite up to three years in jail. Surely police should be trained enough to know these clauses don’t apply, by simple common sense. But clearly, since they acted basis locals reportedly saying there were “vulgar” slogans, misapplication of the law wasn’t an issue for cops.\nBut more important is the issue of the constitutional guarantee for freedom of speech. Are we to believe that cheering Pakistan weakens the Indian state, and therefore ‘reasonable restrictions’ apply? If the issue weren’t so serious, the question would be deemed absurd. India’s govts, politicians, govt officers and cops must ask themselves what they say about this country when they arrest people who have broken no law. Courts must make it clear that ‘anti-national slogans’ don’t constitute a crime.\nSecond, the razing of a place of trade is flagrant violation of the Supreme Court’s detailed guidelines issued in Nov 2024 to be followed before tearing down alleged unauthorised construction. Directions included a 15-day prior notice to the owner, and a step-by-step process including a date to hear the owner. But for Sindhudurg district’s Malvan municipal council, this was unnecessary. Letters from cops and the local MLA were reason enough. SC had said officials flouting its directive would be prosecuted and officers would have to restore demolished structures at personal cost. Courts should remember this too.\n\n",
        "headline_1": "Arresting thoughts",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/arresting-thoughts/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-02-2025"
    },
    {
        "full_article": "Ranveer Allahbadia’s comment has sent waves of outrage across the country and beyond\nTwo Twitterati, collectively known as Twits, discussing Ranveer Allahbadia.\n1st Twit: The fellow should be forever banned, not only from YouTube but from all platforms, digital and non-digital for saying what everyone’s saying he said!\n2nd Twit: And he’s got the cheek to claim freedom of speech.\n1st Twit: That’s not freedom of speech, that’s freedom of sleaze, that’s outraged the moral sensibility of decent folks. Wasn’t your moral sensibility outraged?\n2nd Twit: And then some. On a scale of one to 10, I’d put my moral sensibility outrage at 11.\n1st Twit: Wow. That’s one heck of a lot of outraged moral sensibility. So what did you do with all that outraged moral sensibility?\n2nd Twit: I did what any right-thinking person would do. I shared it with people, like the Auntieji next door who’d never heard of Ranveer Allahbadia, or YouTube, which she thought was something to do with your intestinal tract.\n1st Twit: And was your next door Auntieji’s moral sensibility outraged?\n2nd Twit: You bet it was. Outraged moral sensibility is like Covid.When one person gets it, everyone gets it. And in the case of outraged moral sensibility, frequent washing of hands won’t help.\n1st Twit: Golly. No wonder this outbreak of outraged moral sensibility has gone all the way to the Supreme Court. What next? Parliament? The UN General Assembly?\n2nd Twit: But how did all this moral sensibility get outraged? What did the guy actually say?\n1st Twit: I don’t know what he actually said, and I don’t want to know what he actually said as that would outrage my moral sensibility even more.\n2nd Twit: You mean people shouldn’t say anything, because anything could outrage someone’s moral sensibility?\n1st Twit: Bang on. We don’t need Moral Police – to keep everyone’s mouth shut we need Oral Police…\n\n",
        "headline_1": "Immoral of the story",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/immoral-of-the-story/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-02-2025"
    },
    {
        "full_article": "What’s rotten in the state of Germany mirrors the rot eating into other countries: loss of trust in democratic institutions. It’s a warning shot for a vacillating liberal establishment\n\nLike Bengalis, Germans are very partial to Shakespeare, whom they have firmly adopted as their own. This is particularly true for Hamlet. In the nineteenth century, the brooding, vacillating Prince, preoccupied with navel-gazing, was even regarded as an embodiment of the German spirit. “Germany is Hamlet,” declaimed the patriotic poet Ferdinand Freiligrath in 1844, lamenting the dithering of his compatriots in taking arms against a sea of political repression.\nRead full story on TOI+\n\n",
        "headline_1": "To be or not to be far right",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/to-be-or-not-to-be-far-right/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-02-2025"
    },
    {
        "full_article": "Having been a journalist since 1972 and an editor-publisher since 1993, it saddens me deeply to see some editors, instead of embellishing, strengthening, and bringing more honour and dignity to their position, are doing the exact opposite: bringing shame, disrepute, and indignity by acting as public relations officers (PROs) of their owners.\nEditorship is, no doubt, a job. However, far more importantly, it is a position of public trust. It is on that trust that the credibility of a particular media outlet depends, which, at the end of the day, determines its success. An editor must adhere to the fundamental ethics of journalism: truth, objectivity, honesty, and a complete absence of bias. Every story must be fact-based, verified by multiple sources, and the person or the institution being written about be given a chance to respond. Yes, proprietors may, and can and sometimes do, have an agenda of their own, but it is the editor's duty to protect his/her institution from gross misuse.\nA prerequisite of being an editor—qualities far more important than his/her ability to write, edit, direct, lead, brief reporters, have a nose for stories, etc—is to have sufficient self-respect, personal courage, and dignity to never to allow the media under his control to be used to spread lies and hatred, defame, and falsely malign. When a proprietor forces an editor to publish something, the latter must ensure two things: one, that it is fact-based; and, two, that the other side is given a chance to respond. If all his/her efforts fail, he/she should resign and go public to show how he/she tried to save journalism from being exploited. That is how the editorial institution is built and the public respect for it grows.\nIt is not uncommon for proprietors and editors to have political leanings. But that should be in the opinion section and should never cloud reporting, which should only be fact-based and adhere to the fundamental ethics of journalism.\nA proprietor can own anything permitted by law. But there is a difference between owning a shoe factory and a pharmaceutical company. As the owner of the former, he/she can experiment with practically anything: design, colour, material, shape, etc. But in the case of the latter, the owner must totally and completely submit to the professional management and allow complete freedom to operate the factory according to all scientific specifications. Can an owner tell a doctor how to treat a patient or which medicine to prescribe for which malady? Similarly, the media must be run by professional journalists. An owner must allow total independence of the professionals, led by the editor, to run a media establishment in an unbiased and fact-based manner.\nThe purpose of this column is to raise the issue of owner-driven journalism versus professional journalism, a PRO-editorship versus professional editorship.\nLet us remember with pride that only two professions are given protection in any democratic country's constitution: the judiciary and mass media. Why? Because experience has shown that an independent judiciary acts as a pillar of democracy, and free media serves the essential purpose of assuring accountability and transparency of the governance process.\nWhat I write below—without mentioning the names of either the newspapers or their editors—is not aimed at shaming journalists or fellow editors, but at raising the issue of how we are destroying the editorial institution and thereby bringing disrepute and ignominy to our highly esteemed profession.\nOn February 23, three newspapers—two Bangla and one English—published the same report, with the same headline, \"Prothom Alo, Daily Star: The 'masterminds' behind plot to eliminate Begum Zia from politics,\" referring to the events that occurred in 2007—18 years ago. What sort of journalism is it when the same text—word for word—is published in multiple newspapers, each claiming it to be written by their own \"special correspondent\"? What does it say about the \"editor's\" authority in deciding on content? Where does such content originate from, what is the process of its verification, and what leads editors to carry such content without any explanation to its readers? This is when editors relinquish their authority and become PROs of their media owners.\nThe story line is: Prothom Alo and The Daily Star masterminded the ouster of Khaleda Zia from politics. The reports begin like this, \"In 2007, a blueprint was devised to destroy democracy in Bangladesh and depoliticise the country. One of the key architects of the blueprint was the Prothom Alo and The Daily Star group. The two newspapers not only played (a) key role in formulating the plan but also engaged in relentless smear campaigns to eliminate BNP Chairperson Khaleda Zia from politics.\"\nThe origin of the story is a press conference held by Abdul Mannan Bhuiyan, the then secretary general of BNP, which was covered by all newspapers and TV stations at the time. We were able to gather the following few: \"Khaleda Zia baad\" by Ittefaq; \"Khaleda Zia out\" by Sangbad; \"BNP's reform initiative keeping Khaleda Zia out\" (translated) by Inquilab; \"Proposal to reduce the power of BNP chairperson\" (translated) by Naya Diganta; \"BNP reform plan shows door to Khaleda\" by The Bangladesh Observer; and \"BNP's reform proposals\" (translated) by Janakantha. The reports of the three newspapers singled us out and did not mention that all others newspapers published the same story. We had similar heading and content as the others.\nWhat is striking is that this very line of propaganda was followed by the fallen regime, which is now being repeated by these three papers. The Daily Star and Prothom Alo—because we spoke truth to power—were accused by Sheikh Hasina and Awami League ministers and party leaders that we were behind the 1/11 army-backed caretaker government—again without submitting an iota of proof. For 15 years, Hasina and her party held unquestioned power. They must have investigated us as thoroughly as can be imagined. They found no proof. That is why, in spite of lodging 84 cases against this writer—16 of which were for sedition—they did not follow through.\nOn what basis, using what proof did the three newspapers' journalists write this common copy, and why did three separate editors allow this story to be printed? What fact-checking did they do? What sort of authentic—as against biased—investigation did they undertake? And how could the editors violate the most basic norm of journalism, and not give the subjects of the report any chance to respond?\nAmong many reforms that Bangladeshi newspapers must undertake—and we are looking forward to the report of the Media Reform Commission—an important one is to move away from \"owner-driven journalism\" to \"editor-driven journalism.\"\nThe three newspapers in question have published false, twisted, distorted reports against us many times before, similarly without evidence. On April 21, 2011, the Bangladesh Press Council passed a stern judgement against one of the said newspapers on its reporting against Matiur Rahman, editor of Prothom Alo, saying that \"… reporting constituted yellow journalism which is a violation of newspaper ethics.\" A similar judgement was passed against the other Bangla newspaper on May 12, 2011 on another report against the Prothom Alo editor, saying \"… the report was false, fictitious and was an example of yellow journalism.\" On both occasions, the editors and publisher of those newspapers were reprimanded. Similar condemnatory judgements was passed by the press council and delivered against all three newspapers on May 22-24, 2013, who were accused of publishing false, fictitious, derogatory, and unsubstantiated news against Prothom Alo and its editor.\nRecently, I came across a term in Bangla—\"shikari sangbadikota\" (\"target journalism\"), meaning journalism designed to target an individual, institution, personality, editor, or newspaper without proof. The purpose is to denigrate, malign or discredit someone. Just as one hires an assassin to kill someone, one hires \"shikari sangbadik\" to assassinate the character of a person of high repute or a newspaper of high standing.\nI appealed to journalists in a piece I wrote on April 7, 2023, titled \"Only journalists can protect journalism.\" This was in response to a vicious, Goebbels-style campaign, conducted by a private TV station against Prothom Alo about a photo of a child published with a quote from a day labourer as a photo card. The TV station accused Prothom Alo of \"conspiring to destabilise our independence and make our Liberation War questionable.\" The Prothom Alo editor was sued under the infamous Digital Security Act (DSA) and his Savar correspondent was picked up, gangster-style, without a warrant. Sadly, other than the Dhaka Reporters Unity (DRU), no other journalists' body or media organisation said a word.\nToday, I appeal again to all journalists, and especially to fellow editors, to move away from all our past prejudice, hatred, biases, and tendency to make fatal compromises and, alongside rebuilding Bangladesh in the post-July-August 2024 era, also rebuild journalism with renewed pledge to our journalistic ethos and commitment to democracy, freedom of expression, freedom of the press, and public service.\nEditors, please don't sacrifice your dignity and become PROs of the proprietors.\nMahfuz Anam is the editor and publisher of The Daily Star.\n\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Editors, don't become PROs of proprietors",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/the-third-view/news/editors-dont-become-pros-proprietors-3835496",
        "news_paper_name": "The Daily Star",
        "publish_date": "28-02-2025"
    },
    {
        "full_article": "Given the July uprising's promise of a new political landscape free from toxic and self-serving partisanship, students' involvement in politics or any other organised activity has since attracted great interest. On Wednesday, we saw the launching of a new student organisation—Bangladesh Gonotantrik Chhatra Sangsad (BGCS)—led by some former leaders of the Students Against Discrimination (SAD) platform that coordinated the uprising. This was expected to be a step towards that lofty vision. However, we were greatly disappointed to see skirmishes erupting between BGCS supporters and a group of private university students during the launching event.\nAccording to a report in this daily, private university students were protesting their \"exclusion\" from the central committee of BGCS, demanding its dissolution. This led to scuffles that left several injured, including female students, with at least two hospitalised. Later, the private university students blocked the Bangla Motor intersection for an hour protesting the \"attack\" by supporters of the BGCS.\nThe names of six of BGCS's central committee—including chief organiser, convener, member secretary, and spokesperson—that were initially announced had no private university representation. However, on Thursday, at a press conference, the BGCS announced a full 200-member committee that included students from both private and public universities, madrasas, colleges under the National University, and so on. This raises questions about whether Wednesday's clash was a misunderstanding or a symptom of deeper tensions. Whatever may be the reason, such incidents bear disturbing similarities to the violent, power-hungry politics that plagued our university campuses for decades—precisely what the uprising sought to move beyond, among other authoritarian tendencies and practices.\nWednesday's incident thus goes against the values and ideals students were expected to represent. We urge the leaders of the new student organisation, and all pre-existing student bodies, to distance themselves from the divisive politics of the past, unequivocally reject any sort of violence, and ensure that such incidents do not recur. If they are to embody the values of the uprising, they must prove that student politics can be democratic, inclusive, and free of factionalism.\n",
        "headline_1": "Refrain from student politics of old",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/refrain-student-politics-old-3835486",
        "news_paper_name": "The Daily Star",
        "publish_date": "28-02-2025"
    },
    {
        "full_article": "The quota system in Bangladesh's academic admissions has long been a subject of debate, with students repeatedly challenging its fairness and transparency. Originally designed to support underprivileged groups, the system has increasingly faced scrutiny for fostering inefficiency and favouritism. Despite substantial struggles—including the July uprising that demanded an end to inequality and discrimination—the challenges surrounding this system remain unresolved. The growing wave of student protests against quotas across public universities highlights an urgent need to reform admission policies to ensure fairness, credibility, and alignment with merit. A transition to a flexible, data-driven quota system—leveraging technology and demographic surveys to adjust quotas dynamically based on real-time eligibility—can ensure fairness without compromising academic benchmarks. \nAt Jahangirnagar University (JU), students recently protested against the ward quota through a hunger strike that began on February 2. In response to mounting pressure, the JU ward quota was abolished. Earlier, the JU Central Admission Test Committee had abolished the vice-chancellor quota and the quota for the grandchildren of freedom fighters. A similar wave of discontent emerged at Rajshahi University (RU) as well at the beginning of this year. Initially, the administration attempted a partial reform. However, under continued student pressure, RU Vice-Chancellor Professor Dr Saleh Hasan Naqib fully abolished the heir quota on January 2. Such disputes highlight the persistent concerns regarding quota systems in public universities, where 11 different types of quotas exist. While some are intended to address social inequities, others contribute to inefficiency and favouritism, underscoring the urgent need for comprehensive reforms to ensure a merit-based and equitable admission process.\nThe issue is not limited to general university admissions but extends to specialised fields, such as medical education. The MBBS admission test for the academic year 2024-25 took place on January 17, with 131,729 candidates competing nationwide. Among the 5,380 seats available in 57 government medical colleges, 269 were reserved for the children of freedom fighters (FF), and 39 for candidates from backward communities. However, out of the 269 FF quota seats, only 76 candidates secured admission based on merit, while 193 were admitted solely due to their quota eligibility. This meant that 70 percent of FF quota recipients were granted admission without meeting the usual merit criteria, leading to widespread criticism and the subsequent withholding of their results.\nThe core issue with the quota system lies in allocating fixed percentages without considering the actual number of eligible candidates in a given year. This rigidity often results in inefficiencies and undermines public trust in the system. During the 2019-20 academic year at RU, the administration lowered the passing mark for dependent quota candidates from 40 to 30 to ensure all reserved seats were filled. This sparked widespread criticism for compromising academic standards and fairness. Such incidents underscore the limitations of fixed quotas that fail to adapt to real-time eligibility data. Fixed quotas often lead to unfilled reserved seats, which are usually filled through controversial adjustments.\nA potential solution lies in transitioning to a flexible, data-driven quota system. The first step towards reform is systematically collecting accurate data on quota applicants. Institutions should track the number of eligible candidates per admission cycle. This data would enable dynamic seat allocation, aligning reserved seats with actual needs instead of rigidly enforcing fixed quotas. To further enhance fairness and effectiveness, institutions should implement real-time monitoring to analyse trends in quota applications, academic performance, and admission outcomes. Machine learning and predictive analytics can help refine policies. Regular audits would identify gaps or inefficiencies, ensuring quota allocations align with national educational goals. Additionally, universities must ensure that quota policies are assessed periodically to reflect societal changes and evolving educational standards. \nTransparency is crucial. Annual reports detailing quota allocations, backed by data and analysis, would foster public trust and accountability. Open discourse would allow policymakers to fine-tune the system based on feedback and evolving societal needs. Verification of eligibility is another key aspect. Institutions should enforce rigorous verification procedures, supported by a centralised registry. Quota applicants should submit verifiable documents—such as academic certificates or proof of socio-economic disadvantage—which would be cross-checked against an official database to ensure benefits reach the genuinely deserving. A robust verification mechanism would also minimise discrepancies, ensuring the fairness of admissions.\nBy embracing technology and flexibility, Bangladesh can reform its quota system to reflect societal needs better while upholding academic standards. Moving towards a data-driven approach ensures fairness, efficiency, and transparency. This transformation is not just a policy update—it is a commitment to a more equitable and future-ready education system. Addressing quota-related concerns systematically and transparently will not only enhance the credibility of the education system but also ensure that it continues to serve as a powerful tool for social mobility and national development.\nRuhina Tabasshum Prome is research associate at the Bangladesh Institute of Governance and Management (BIGM).\n\nShirin Sultana is research associate at the BIGM.\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Reform quota system in academic admissions",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/reform-quota-system-academic-admissions-3835401",
        "news_paper_name": "The Daily Star",
        "publish_date": "28-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Curbing drug companies' sway on doctors",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/curbing-drug-companies-sway-on-doctors-1740668303",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Equal opportunity in education  can address social disparity",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/equal-opportunity-in-education-can-address-social-disparity-1740668358",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Viability of capital  relocation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/viability-of-capital-relocation-1740668402",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Falgun:Misinterpretation of love and culture",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/falgunmisinterpretation-of-love-and-culture-1740668434",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-02-2025"
    }
]