[
    {
        "full_article": "Nearly four months into her tenure as Chief Minister of the National Capital Territory (NCT), Rekha Gupta seems to have more agency and resources to address Delhi’s infrastructure issues and economic woes. The governance deficit seen during the previous government led by the Aam Aadmi Party (AAP) due to political differences with the Bharatiya Janata Party (BJP) government at the Centre is noticeably absent now. Interacting with a cross-section of society at The Hindu Mind, a platform for leaders from all fields to converse with curious minds, Ms. Gupta said that she wanted to be known as someone who is dedicated to resolving the daily problems of the people of Delhi. Problems abound. From electricity to education, transportation to public infrastructure, and sewage treatment to water availability, there is a litany of issues that plague the national capital. Ms. Gupta blamed the previous AAP and Congress governments for the situation. It is true that the AAP’s style of governance provided succour to the poorest segments, but shallowed out the promise of Delhi as an investment destination and an enabler of the middle-class dream for housing facilities and jobs. AAP used Delhi as a staging post of its chief Arvind Kejriwal’s electoral ambitions.That said, no incumbent can succeed by blaming predecessors. The one in charge currently is the one answerable. Ms. Gupta said the Minto Bridge underpass in Connaught Place in central Delhi would no longer flood in the rains, and she was proved right this week when the city received a heavy downpour. But numerous other places in the city were waterlogged, and this is just a small part of the challenges. Ms. Gupta said all the water logging points in Delhi have been identified, and a nodal officer has been put in charge for each of them, who will be accountable. This must be enforced strictly. Haphazard and unpredictable land use regulations over the decades are one of the main reasons for Delhi losing out to surrounding places as a destination for housing and office space. The land pooling policy in the capital which has been meandering, now needs to be urgently streamlined and implemented. Thousands of people who have invested their hard-earned money with the dream of a house in Delhi cannot be punished for policy confusion that is not their fault. Schooling in Delhi needs to have predictable regulation, and both private and public schools must follow standards. Huge disparities in school educations can have cascading ill effects for the society. Freeing up Delhi’s so-called agricultural land for planned development must be a priority, and the Chief Minister seems to be cognisant of this. Ms. Gupta said a new Master Plan for the city will account for all these, and the fact that the BJP is in power at the Centre, NCT and in all Municipal Councils of Delhi will make things easy. It is a great chance for Ms. Gupta to lead a definitive transformation of the national capital. Published - June 20, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        New Delhi\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        public works & infrastructure\n                    \n                            /                      \n                        \n                        Aam Aadmi Party\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        electricity production and distribution\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        transport\n                    \n                            /                      \n                        \n                        water\n                    \n                            /                      \n                        \n                        rains\n                    \n                            /                      \n                        \n                        school",
        "headline_1": "​Capital charter: On Delhi, its infrastructure",
        "headline_2": "Delhi needs to solve the infrastructure deficit and the housing crisis",
        "link": "https://www.thehindu.com/opinion/editorial/capital-charter-on-delhi-its-infrastructure/article69713948.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-06-2025"
    },
    {
        "full_article": "Less than a week after South Africa emerged triumphant in the ICC World Test Championship (WTC), a new cycle has begun. Bangladesh is already in Sri Lanka, busy playing a Test, while a more high-profile series will commence once India takes on England at Headingley in Leeds from Friday (June 20, 2025). A new-look Indian squad under the stewardship of Shubman Gill will step out for duty while a clean break from the past has been implemented due to the retirements of Virat Kohli, Rohit Sharma and R. Ashwin, and the omission of Ajinkya Rahane and Cheteshwar Pujara. A tour of the Old Blighty is never easy and that has been the case since 1932 when India made its Test debut at Lord’s. Series triumphs were etched in 1971, 1986 and 2007, but otherwise it has been a tale of Indian batters floundering against swing under whimsical English skies. Even as India beat Australia in its backyard over the last decade despite the loss in the last encounter, England has remained a tough place to tour. However, cricket’s spiritual home has also gifted some special Indian memories like B.S. Chandrasekhar’s spells, the 1983 World Cup victory, Dilip Vengsarkar’s three consecutive hundreds at Lord’s, and the Test debuts of Sourav Ganguly and Rahul Dravid, to name a few.A sense of a beginning is evident in cricket’s birthplace and seen in that light, Gill and his men are in the right place. Ravindra Jadeja, K.L. Rahul, Jasprit Bumrah and Karun Nair, busy charting a comeback, constitute the seniors in a unit high on youth with even Gill being just 25. The Punjab star has to deliver on two counts, both as batter and skipper. A 35.05 average after 32 Tests does not reflect the quality innate in him. It is not just that the batting core has changed as even the slip-cordon will have new personnel, and the way Gill guides his outfit through this transition will determine how India will fare in the latest WTC cycle. Bumrah will remain the spearhead but with workload management being the key, he will not play all the five Tests at stake. His old ally Mohammed Shami will be missed but in Mohammed Siraj and others, Bumrah has a set of talented fellow pace bowlers. Squaring against them would be Ben Stokes and his men busy relishing home advantage with Joe Root being the lead anchor among their batters. In a challenging tour stretching all the way to August 4, Gill, in tandem with vice-captain Rishabh Pant, gets an opportunity to forge a fresh and strong Indian unit. Published - June 20, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        South Africa\n                    \n                            /                      \n                        \n                        Bangladesh\n                    \n                            /                      \n                        \n                        Sri Lanka\n                    \n                            /                      \n                        \n                        Test  cricket\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "​A new cycle: On a new-look Indian cricket squad",
        "headline_2": "India begins its quest for the Test Championship with young players",
        "link": "https://www.thehindu.com/opinion/editorial/a-new-cycle-on-a-new-look-indian-cricket-squad/article69713995.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-06-2025"
    },
    {
        "full_article": "Hitting working nuclear facilities, as Israel is doing & US may do, is reckless, given the chance of radiation leak \nAug will mark 80 years since the bombing of Hiroshima and Nagasaki resulted in over 2.2L deaths. The aftermath affected victor, vanquished and the rest, and almost all nations agreed that nukes must not spread. The ‘Treaty on the Non-Proliferation of Nuclear Weapons’, or NPT, resulted from this consensus in 1970. Iran was among its original signatories, Israel was not. And the pact has held up well, with only nine nuclear-armed states so far. All significant nuclear events since Nagasaki – Three Mile Island, Chernobyl, Fukushima – have been accidents in times of peace. And each one has led to enhanced safeguards.\nBut an old recklessness is creeping back. Soon after it invaded Ukraine in Feb 2022, Russia shelled and seized the Zaporizhzhia nuclear power plant – Europe’s largest. Luckily, there was no radiation leak. And last Friday, Israel bombed three of Iran’s major nuclear facilities at Natanz, Isfahan and Fordow. Now it has bombed Iran’s Arak nuclear reactor, while the world’s attention is riveted on Trump’s plan to pulverise Fordow with ‘bunker buster’ bombs. These are extremely irresponsible and dangerous moves, as damage to an operational nuclear site can result in another Chernobyl.\nOne thought this cavalier attitude had become taboo a long time ago. But it’s like 1981 again when Israel destroyed Iraq’s brand-new, French-made Osirak reactor at the Tuwaitha complex on the same pretext of self-preservation that it’s been brandishing against Iran for decades. But Osirak was still a month away from being fuelled up. The Israelis themselves admitted they couldn’t have touched it afterwards for fear of blanketing Baghdad with radiation. They exercised care in 2007 also, when they destroyed Syria’s under-construction al-Kibar facility.\nUS was so upset with Israel’s 1981 raid it had termed it a “source of utmost concern”. Now, Putin, Bibi and Trump have no qualms at all about attacking functioning reactors. The last time US did something more irresponsible was during the 1991 Gulf War when it destroyed two operational reactors at Tuwaitha. What will throwing caution to the wind now, after 34 years, achieve? Will it weaken Iran’s resolve to make a bomb? Unlikely. In fact, Iran has already indicated its intent to exit NPT. If it does, it will be a setback for the whole non-proliferation consensus. Many other countries that have been watching these developments with alarm will think it prudent to get their own nuclear shield. We’re 89 seconds from midnight on the ‘Doomsday Clock’. A nuclearised world will only push us closer. \n\n",
        "headline_1": "New clear danger",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/new-clear-danger/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-06-2025"
    },
    {
        "full_article": "The use of language as a form of deliberate miscommunication \nIn a London pub I heard a man at the bar expressing displeasure about something or other, saying “Up the Khyber”. \nHe wasn’t talking about a trip he’d made to the mountain pass close to the Pakistan-Afghanistan border; he was using what is called Cockney rhyming slang to vent annoyance.\nIn the Cockney argot of London’s East End, Khyber refers to a person’s derriere, Khyber Pass rhyming with the vulgarism for one’s bottom, or what in American English is called an ass. \nCockney rhyming slang is a coded language, or cryptolect, which is said to have originated in the 1840s among residents who lived “within the sound of Bow Bells”, referring to an area around the Church of Saint Mary-le-Bow in Cheapside. \nThe first published record of this form of double talk is the Dictionary of Modern Slang, Cant and Vulgar Words, compiled in 1859 by James Camden Hotten.\nRhyming slang was devised as a coded sub-language, which only the initiated could understand, and which would be meaningless to unwanted outsiders and eavesdroppers, like policemen. \nSo, a ‘tea leaf’ means thief, and a ‘pork pie’ is a lie. With its misogynistic overtones, ‘trouble and strife’ stands for wife, and ‘China’, short for China plate, refers to a mate, an idiomatic term for a friend. \nTo compound confusion, the second word, which rhymes with what’s being referred to, is often dropped. To say “I’m going up the apples” means “I’m going up the stairs”, apples and pears chiming with stairs. \nWhile Cockney slang has rhyme if not reason, similar double talk in other parts of the world has its own motivated reason, if not rhyme. \nFor instance, in India’s political patois, ‘urban Naxal’ refers to anyone whose ideology is different from that of the speaker, an alternative trope being a ‘subversive element’. \nBut perhaps the most confounding example of double talk, which is really doublespeak, is to be found in Pakistan, where the term ‘freedom fighter’ is a code term for terrorist, a word that does not exist in Islamabad’s lexicon.\n\n",
        "headline_1": "Double talk",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/double-talk/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-06-2025"
    },
    {
        "full_article": "Even by realpolitik standards, US loving terror sponsor Pak is a new low. India should assume worse will come \nTrump saying ‘I love Pakistan’ must be understood both in the historical and current context of US policy. That America’s president is proclaiming love for a country widely known for funding, training, and protecting terrorists links back to decades of Washington policy. America has long perfected a kind of doublespeak when it comes to Pakistan-sponsored terror. Americans chose to unsee even the fact that Islamabad gave sanctuary to 9/11’s architect bin Laden. Or that 26/11, which claimed American victims, was an ISI op. \nNow, with Israel’s war on Iran, and some American strategists advocating Israeli-US bombing runs, Washington’s ‘realpolitik’ argument would run like this: Pakistan is the only Islamic nation with nuclear weapons, it has so far backed Tehran with which it shares a 909-km border, and Beijing has a key presence in all matters Pakistan, therefore, keeping Islamabad happy makes sense. That Trump met and dined with jihadi-in-uniform Munir reinforces the point that US sees Pakistan as a tool of war. \nSure, nation-states are expected to operate in national interest. Despite West’s pressure, New Delhi stayed the course on buying oil from Moscow, the aggressor in the other war. But Russia, however unlovely Putin’s regime is, isn’t a terror sponsor. Only a few countries use terrorism as a strategic tool – Pakistan is one of them, and its target, as even Trump should know, is India. Therefore, ‘loving Pakistan’ and supping with its field marshal, who’s a radical religious fundamentalist, isn’t the same as India buying Russian oil. More so since, reportedly, Trump is offering Munir ‘weaponry’ in return for airspace access into Iran. Modi did well to tell Trump India won’t brook any mediation. But New Delhi will have to assume things can get worse.   \n\n",
        "headline_1": "President strangelove",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/president-strangelove/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-06-2025"
    },
    {
        "full_article": "His fate is in Parliament’s hands now, and the odds are stacked against him. The first-ever sacking of an HC judge would be degrading for the judiciary’s position\nI was deeply saddened and shocked by the extraordinary discovery at Justice Yashwant Varma’s residence in March. A man of enviable legal competence, great judicial efficiency, equable temperament and balance on the Bench, his visage had come to embody calm, reasoned authority.\n\nWhen the first firefighters arrived on the scene, they found several bags of unaccounted cash among the burnt remains. This appears not only to be the finding of the in-house inquiry but also the admitted position, since the judge’s defence is that the outhouse was not in his exclusive control.\nRead the full story on TOI+.\n\n",
        "headline_1": "Please quit, Justice Varma",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/please-quit-justice-varma/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-06-2025"
    },
    {
        "full_article": "It was only the other day that we commented on the simultaneous resurgence of coronavirus and dengue, warning how their potential outbreaks at the community level could have devastating effects. As our previous experience shows, Bangladesh is simply unable to handle the convergence of such infectious diseases due to poor public awareness as well as inadequate testing and treatment facilities. Against this backdrop, it is extremely concerning to learn of the resurgence of another infectious disease, chikungunya, which, like dengue, is also mosquito-borne. The emergence of these diseases in close succession threatens to overwhelm an already strained healthcare system, requiring proper interventions.\n\nChikungunya still seems restricted to urban areas, particularly in Dhaka, but the current trend indicates it may increase in numbers and spread to other areas. This is partly because of the just-concluded Eid holiday during which millions of people travelled across the country, increasing the risks of a silent community transmission. To ensure the disease does not spread unchecked or undetected, it is vital that the authorities act swiftly. First, there must be an effective surveillance mechanism for chikungunya nationwide, especially in high-risk areas. Diagnostic facilities should also be made available beyond Dhaka so that cases can be identified early and treated properly.\nChikungunya, however, has yet to reach the level of the other two diseases. According to a report citing data from the Institute of Epidemiology, Disease Control and Research (IEDCR), from January 1 to May 28, at least 337 suspected chikungunya cases were reported in Dhaka. As well as adding to the burden on the healthcare system, one additional problem with chikungunya is that it shares many clinical features with dengue, thus complicating or delaying diagnosis and treatment. Moreover, given the absence of a routine national surveillance system for chikungunya and limited diagnostic capacity in the country, the IEDCR has acknowledged that the numbers it reported may not convey the actual scale of infections.\nChikungunya still seems restricted to urban areas, particularly in Dhaka, but the current trend indicates it may increase in numbers and spread to other areas. This is partly because of the just-concluded Eid holiday during which millions of people travelled across the country, increasing the risks of a silent community transmission. To ensure the disease does not spread unchecked or undetected, it is vital that the authorities act swiftly. First, there must be an effective surveillance mechanism for chikungunya nationwide, especially in high-risk areas. Diagnostic facilities should also be made available beyond Dhaka so that cases can be identified early and treated properly. Public health messaging—now focusing on Covid and dengue—should also include chikungunya, particularly its symptoms and preventive measures. As experts have told The Daily Star, forming a tiered system—comprising primary, secondary, and tertiary levels of care—is also essential to ensure the health system does not get too overwhelmed.\nOur reactive approach to public health threats has cost us dearly in the past. With three viral diseases now emerging simultaneously, we can ill-afford such an approach now. We, therefore, urge the authorities to treat the triple threat of Covid-19, dengue, and chikungunya as a single, interconnected health emergency and ensure prompt and coordinated interventions.\n",
        "headline_1": "Are we looking at a triple health crisis?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/are-we-looking-triple-health-crisis-3921081",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-06-2025"
    },
    {
        "full_article": "The Orwellian G7 statement described Israel's military attacks on Iran as \"self-defence.\" By twisting language to fit political ends, the communiqué normalises aggression and offers diplomatic cover for Israel's serial violations of international law. Rather than condemning Israel's dangerous escalation, the G7 resorts to vague calls for \"de-escalation,\" effectively endorsing impunity under the guise of neutrality.\nConspicuously absent from the statement was any mention of Israel's use of starvation as a weapon against 2.3 million Palestinians in Gaza, Israeli violation of the ceasefire agreement in Lebanon or its years‑long bombing of Syria. In effect, the G7 has now aligned itself fully with Netanyahu's open‑ended wars.\nThe Iranian nuclear programme was recently confirmed by the head of the US intelligence community, in testimony to Congress, stating that Iran is not building a nuclear weapon. Yet the G7's statement reflects not objective assessment, but political posturing—another expression of Western supremacy towards non-Western nations. Nowhere is this bias more dangerous than in Washington and Europe's tacit endorsement of Israeli attacks on Iran's civilian nuclear facilities—sites that are safeguarded under international treaties. Such actions constitute a blatant violation of Article 56 of the Additional Protocol I to the Geneva Conventions, which prohibits targeting nuclear power facilities.\nStriking an operating enrichment plant or spent fuel pool poses a grave danger. Such an act could release massive amounts of radiation, leading to civilian deaths and contaminating aquifers, farmland, and entire ecosystems for generations. The effect would be tantamount to a nuclear attack, regardless of the delivery method. Yet, Western capitals that rightly warn of similar dangers at Ukraine's Zaporizhzhia plant paradoxically endorse Israeli raids under the euphemism of \"self-defence.\"\nThe spectre of a catastrophic leak is almost certainly why Israel has so far held back from bombing Iran's deeply buried Fordow enrichment complex, where uranium is refined to 60 percent. The environmental, diplomatic, and regional fallout could be incalculable. While Netanyahu wants to see the facility destroyed, he prefers on delegating that risk to the US, betting that the Trump administration will be more willing to shoulder the consequences.\nTargeting nuclear infrastructure—civilian or military—sets a dangerous precedent. It ignores lessons from Chernobyl and Fukushima, shatters the taboo against striking nuclear plants, and exposes the hypocrisy of Western states that decry proliferation while tolerating allies flirting with nuclear disaster.\nThat moral blindness is neither new nor accidental. It is rooted in the same imperial pedigree that nourished slave trade, annihilated Indigenous nations, engineered colonial famines, Holocaust, and twice unleashed atomic bombs on civilian targets. The same so-called Western \"civilisation\" that supplies the weapons, satellite intelligence, and diplomatic cover enabling Israel to flirt with nuclear catastrophe in Iran and starve children in Gaza. This complicity was laid bare by German Chancellor Friedrich Merz, who openly admitted that Israel is doing today \"the dirty work for us.\"\nProdding Washington to join a new, made-for-Israel American war, Netanyahu's operatives in the US—driven by an \"Israel first\" agenda—are working overtime to convince Trump to complete the most difficult phase of Israel's new Middle East demonic venture. Their argument? That Israel has already crippled Iran's defences enough to make American involvement low-risk for US forces and interests in the region\nInto this meticulously staged farce steps Netanyahu himself—a master manipulator who understands Trump's psychological vulnerabilities better than Trump's own advisers. All it takes is a single phone call, heavy with flattery and inflated visions of historic greatness. Appealing to Trump's fragile ego—telling him he'll be remembered as the \"saviour of Israel\"—could be enough to fling open the gates to a catastrophic military escalation.\nMuch like in 2003, when the \"Israel First\" Jewish neocons, including Netanyahu's own lies before Congress in 2002, manipulated another gullible US president with the fantasy that regime change in Iraq would ignite a wave of democracy across the Middle East. Over two decades later, the region—and to a significant extent, the US—is still paying the price for being dragged into a catastrophic foreign war built on lies, hubris, and blind loyalty to Israeli strategic interests.\nPredicting Trump's decisions has always been notoriously difficult—not due to any strategic genius, but because of his combustible mix of grievance, ego, and impulsiveness. For example, his trade wars began with sweeping tariffs and unravelled into chaotic carve-outs; his hardline immigration policies crumbled into talks about exempting farm and hospitality industries. The same erratic pattern defines his foreign policy: bombastic threats, sudden reversals, and renewed aggression whenever flattery intersects with cable news talking points. His unhinged posts and reckless declarations on Iran are no exception—they're just the latest flare-ups in a long trail of incoherence.\nThis combustible mix—Israel's ethically reckless strategy paired with a US president prone to impulsive decision‑making—creates a disturbing path to escalation. It risks fulfilling Netanyahu's ambition to \"reshape the Middle East,\" a slogan that already produced the 2003 Iraq war. Twenty years Iraq still bears the scars of that made‑for‑Israel war; American involvement in a new war on Iran would begin yet another chapter of chaos in Netanyahu's \"new Middle East.\"\nWestern leaders have failed to learn from their catastrophic lessons of history. Time and again, they repeat the same blunders born of arrogance of power—only this time, the stakes are even higher. By offering unconditional support to Israel, they are not merely turning a blind eye; they are actively underwriting Netanyahu's genocidal policies, and Israeli Jewish supremacy.\nWestern leaders' complicity is not passive. They have become enablers—co-authors in the unfolding genocide in Gaza and active sponsors of a potential nuclear catastrophe in Iran. Despite decades of evidence showing how imperial hubris breeds chaos and suffering—from Africa to Vietnam, from Iraq to Libya and beyond—these leaders continue to embrace the illusion that might makes right, enable today's livestream genocide in Gaza, and pave the way to bring about a nuclear Holocaust in Iran.\nThis article was first published by Counterpunch.org on June 19, 2025.\n\nJamal Kanj is the author of Children of Catastrophe: Journey from a Palestinian Refugee Camp to America, and other books. He writes frequently on Arab world issues for various national and international commentaries.\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "From livestream genocide in Gaza to the war on Iran",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/livestream-genocide-gaza-the-war-iran-3920896",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-06-2025"
    },
    {
        "full_article": "The post-WWII recoveries of Germany and Japan remain iconic examples of national rebirth and rapid reconstruction after complete devastation. Within a decade, both nations had not only rebuilt their economies to the zenith but also quickly emerged as the two leading industrial and technological powers. The Japanese concept of Kōdo keizai seichō and the German Wirtschaftswunder, both meaning \"economic miracle,\" encapsulate their astonishing post-war economic advancements that still awe the world.\nThese miracles, however, were not reactive or mere flukes; they were well-designed, deliberate, and proactive. Patriotism, ethos, national vision, diligence, ethical leadership, good strategies and planning, proper reforms, conducive political culture and relentless pursuit of excellence were their keys to success. Despite contextual differences, their experiences offer replicable vital lessons for the transformation of our mindset and culture, from street agitations and uprisings to innovation and productivity.\nWest Germany's Wirtschaftswunder was underpinned by the Marshall Plan, Cold War geopolitics, and an already skilled industrial workforce. Japan's post-war recovery similarly blended domestic reforms with external support, complemented by national longing and resolve.\nBangladesh secured independence in 1971 after many sacrifices, but its pace of recovery and rebuilding remained slow, betraying the nation's dream even though it has made progress in poverty alleviation, women's education, health outcomes and other social indicators, albeit at a snail's pace and exorbitant prices. Looking forward, the critical question is whether Bangladesh can accelerate its trajectory and attain a high-income, sustainable status soon.\nStill struggling after five decades, Bangladesh has turned into a development paradox. On one hand, it has achieved consistent GDP growth, built a globally competitive garments sector, and improved some human development indices. On the other hand, it remains heavily dependent on external support, remittances, and low-value manufacturing, instead of a shift towards a knowledge-based, advanced economy. It lacks functional democracy, good governance, policy consistency, and stable law and order. Corruption is rampant, and so is labour unrest. It inherited fragile state institutions, poor infrastructure, and limited geopolitical leverage with trivial scope for value addition, research, innovation and use of technology.\nHowever, Bangladesh can offset its inherent deficiencies by reforming pernicious political culture, consolidating democracy, infusing a development-oriented psyche, institution building and modernisation. It must improve public sector performance, digitise and upgrade overall service delivery, increase regulatory oversight, maintain policy consistency and uphold the rule of law. Ethical leadership, transparency, accountability, institutional independence and integrity are not development luxuries—they are the bedrock of sustainable progress.\nInvesting in human capital is indispensable. Bangladesh's youthful demography offers a powerful advantage, though boons may turn into banes unless developed and utilised well. The education system must be reoriented towards the Fourth Industrial Revolution—digital literacy, artificial intelligence, problem-solving, and creativity.\nFor Bangladesh, economic diversification is imperative. Reliance on ready-made garments exposes the economy to global volatility and hinders value creation. A robust industrial strategy must prioritise high-value sectors—pharmaceuticals, IT, electronics, and agro-processing—alongside stronger intellectual property regimes and industrial clustering.\nStrategic industrialisation and digital infrastructure must be scaled up. The resilience of a modern economy hinges on its capacity to produce essential goods domestically while diversifying exports. Bangladesh must develop core essential industries—steel, chemicals, machines and parts, electrical and electronic goods, household essentials, ICT items and precision tools—while strengthening supply chain linkages.\nInitiatives such as a \"Digital Sovereignty Fund\" for local tech ventures and the establishment of tech valleys focused on AI, robotics, and quantum computing can secure Bangladesh's position in the digital economy. Developing digital universities and vocational centres in every economic zone, and fostering knowledge exchange with countries like Japan, China, Singapore, and the West, will build the foundation of a tech-savvy workforce.\nUrbanisation will also be a significant factor, as it was in Japan. Dhaka's unplanned sprawl is likely to make it unliveable and unsustainable. Drawing on models of Vietnam and Japan, Bangladesh can implement green urban policies, climate-resilient infrastructure, and decentralised development through vibrant secondary cities.\nBangladesh, being one of the most climate-vulnerable nations, must embed climate resilience in all development strategies. Promotion of renewable energy, introduction of green financing tools, and implementation of carbon pricing mechanisms are necessary steps. Local governments should be empowered to undertake grassroots climate action, ensuring inclusive and effective adaptation and mitigation.\nBangladesh should skillfully leverage its geostrategic position to play a meaningful role in regional and global trade. Upgrading ports, streamlining customs, and joining booming trade blocs can open up vistas of opportunities, new export markets, and investment flows. Economic diplomacy and reaching out to ASEAN, BRICS, SCO, the Middle East, North America and Africa should be the major focus of the Ministry of Foreign Affairs.\nA digital corridor with regional fibre-optic networks, smart logistics, and digital port systems would connect Bangladesh with global supply chains. Strategic alignment with Indo-Pacific frameworks can provide access to critical infrastructure and defence technologies, as long as the country maintains a balanced non-aligned diplomatic posture.\nSustainable development requires more than economic growth. Besides infrastructure and wealth, it should focus on quality of life, civic issues, eliminating corruption, curbing discrimination and injustices for holistic, inclusive development. It needs to bolster the civil service for digital governance, revamp education to produce responsible citizens, critical thinkers, ethical leaders, and construct creative ecosystems that align government, academia, and industry.\nBangladesh, following the July uprising, is now at a crossroads. The time seems propitious, as the nation has resurged, reunited, and realigned, simmering with spirit and yearning for advancement. The defining difference between Japan-Germany and Bangladesh's cases is the patriotism, honesty, national unity and will.\nMaj Gen (retd) Abul Kalam Mohammad Humayun Kabir is a former diplomat of the Bangladesh government.\n\nMohammad Rashedul Islam is a lecturer and PhD candidate at the International Islamic University Malaysia (IIUM).\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Can Bangladesh forge its own 'economic miracle'?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/can-bangladesh-forge-its-own-economic-miracle-3920901",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-06-2025"
    },
    {
        "full_article": "We are concerned about the rising volume of bad loans in the banking sector, which reached a record Tk 420,335 crore at the end of March. This accounts for 24.13 percent of the sector's total loans of Tk 17,41,992 crore. In other words, nearly one-fourth of all loans have become defaulted, which is staggering. According to the latest central bank data, state-run banks had bad loans amounting to Tk 146,407 crore, making up 46 percent of their total disbursed funds, while private banks faced Tk 264,195 crore in defaults, or 20.16 percent of their loans. Moreover, foreign banks had Tk 3,239 crore in bad loans, while specialised banks had Tk 6,494 crore. Additionally, the banking sector faced a provisioning shortfall of Tk 170,666 crore, further weakening its financial stability.\nIt should be mentioned that this increase in bad loans is largely the result of irregular lending practices during the now-ousted Awami League government, which are now turning into defaults. Reportedly, the rise in defaulted loans has been driven by various factors, including the rescheduling of term loan maturities through a central bank directive, the reclassification of large loans from certain clients as substandard by the Bank Inspection Department, the failure to reschedule existing loans, delays in repaying instalments of rescheduled loans, and the accrual of interest on already classified loan accounts. The recent tightening of loan classification rules has also contributed to this surge. Whereas previously loans were classified as overdue after 270 days, starting from April 2025, they are to be classified as non-performing after just 90 days. In some cases, defaults have also occurred due to genuine business struggles under global economic pressures.\nWhen the Awami League assumed power in 2009, the total volume of defaulted loans stood at just Tk 22,481 crore. Since then, the amount has risen steadily. Economists allege that influential figures close to the then-government siphoned large sums from banks through irregular means, much of which was laundered abroad. Moreover, the government allowed banks to conceal the true scale of the crisis. Political appointments, manipulative accounting, nepotism, and a lack of transparency in lending during the AL tenure contributed significantly to the sector's current instability.\nWe urge the government to take stringent measures to address the growing crisis of non-performing loans. It must act decisively against habitual defaulters and improve financial governance in the sector. At the same time, credible businesses should continue to receive necessary support, while efforts must be made to steadily reduce the volume of bad loans.\n",
        "headline_1": "A staggering increase in default loans",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/staggering-increase-default-loans-3919196",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 20, 2025 00:00:00  \nHowever strange it may sound, the practice of whitening black money has long been accepted -- albeit controversially -- by successive governments, including the current interim administration, as a source of substantial tax revenue. Despite repeated and strong opposition from economists, think-tanks, and budget analysts every year following the national budget announcement, the trend continues unabated. There is no disputing the fact that legitimising undisclosed income grants impunity to financial wrongdoers, undermines public trust, and promotes a culture of non-compliance. Yet no government has had the political will or resolve to end the practice. The current interim government, which had initially declared it would not allow black money or undeclared income to be legalised through investments or by paying a premium tax, appears to have walked back on that promise. In the Tk 7.9 trillion budget proposed by Finance Advisor Dr. Saleuddin Ahmed, the provision to whiten black money through investment in the real estate sector remains intact, though with a significantly higher tax penalty.\nThe Finance Ordinance promulgated on June 2, 2025 to ratify the budget retains the provision allowing undisclosed income to be whitened through purchase of land, apartments, and construction of residential buildings. While the tax rate has been increased up to fivefold and other government agencies (apart from tax officials) can question the source of income, the incentive remains compelling for people with illicit money looking for easy amnesty. Though there are reports that the government's advisory council may review the provision at its June 22 meeting, expectations of a reversal remain slim. \n The reason is not difficult to fathom. The National Board of Revenue (NBR) earns considerable revenue through this route, and with minimal effort. According to a report, in FY 2021 alone, 11,839 individuals whitened around Tk 205 billion -- the highest ever in a single year. Of this, Tk 168.3 billion in cash was legalised (whitened) by 7,055 individuals. The remaining amount was channelled into land, flats, or stocks. The NBR received Tk 20.64 billion in revenue from these disclosures. Some may argue that bringing black money into the formal economy supports economic activity. But at what cost? This policy not only legitimises ill-gotten wealth -- often amassed through corruption, tax evasion, or illegal trade -- but also demoralises honest taxpayers who comply with the law. It sends a troubling message: wrongdoing pays, and compliance is optional.\nIt is, therefore, neither a sustainable nor ethical proposition to justify such measures in the name of revenue generation. The government must not treat earnings from unethical sources as a quick fix for revenue shortfalls or as compensation for the inefficiencies of the NBR. No conscious citizen will endorse the idea as it largely ignores the inherent illegality of holding black money through immoral and illegitimate means. What is urgently needed is a comprehensive overhaul of the revenue collection system. Reforms should focus on automation, restructuring, capacity building, and robust regulatory enforcement. Only through systemic changes can the country hope to boost domestic revenue sustainably -- without compromising integrity or fairness.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The pernicious practice of whitening black money",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-pernicious-practice-of-whitening-black-money-1750347774",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Makhan Lal Dutta   |  \n       June 20, 2025 00:00:00  \n\nIn the verdant, river-laced plains of Bangladesh, agriculture remains more than just an economic sector, it is the very pulse of the nation. With over 41 per cent of the population engaged in farming and agriculture contributing around 14 per cent to the GDP, the sector's relevance cannot be overemphasised. Yet, it stands at a crossroads. From erratic weather patterns driven by climate change to dwindling arable land and labour shortages due to urban migration, agriculture here is under siege. Amid these constraints, the country's agricultural transformation is being reimagined through a new lens -- drone-assisted smart agriculture.\nOnce perceived as a futuristic concept, drone technology, or unmanned aerial vehicles (UAVs), is steadily reshaping approach to farming across Bangladesh's fields. From Barishal to Bogura, aerial robots are no longer just spectacles; they are tools for precision and survival.\nThese drones are far from hobbyist gadgets. They are increasingly being fitted with high-resolution cameras, infrared sensors, GPS modules, and machine learning algorithms. Their roles are multi-pronged: mapping farmlands, monitoring crop health, identifying pest outbreaks, assessing post-disaster damage, and even spraying fertilisers and pesticides with high precision. This is not just efficiency -- it's evolution.\nThe core advantage drones bring to agriculture is rooted in their ability to provide real-time, data-driven insights. Equipped with multispectral sensors, drones can analyse soil moisture levels, detect plant diseases before they become visible to the naked eye, and assess nutrient deficiencies with pinpoint accuracy. This not only enables more judicious application of fertilisers and pesticides -- cutting costs and reducing environmental harm-but also ensures higher yields through timely interventions. Traditional methods of scouting entire fields on foot are rapidly becoming obsolete.\nThis technological pivot has not occurred in isolation. A significant push has come from institutional backing. In 2024, the Department of Agricultural Extension (DAE), in partnership with the Asian Development Bank (ADB), rolled out pilot initiatives that integrated drones and satellite imaging into routine field assessments. More than 300 agricultural extension officers across multiple upazilas received training in remote sensing technologies, learning to interpret aerial imagery for drought stress, pest patterns, and flood-induced crop losses.\nThe World Bank has also stepped in decisively. Under its $578 million Climate-Smart Agriculture Investment Plan, launched in 2023, more than 127,500 Bangladeshi farmers have adopted smart technologies, including UAVs. Initial outcomes are compelling: many participating farmers report yield improvements ranging from 15 per cent to as high as 60 per cent a hectare, depending on crop type and region. In a country where per capita arable land is shrinking and climate volatility is increasing, such gains are not just desirable, they are imperative.\nThe government has recognised this momentum and is taking concrete steps to facilitate broader adoption. The Ministry of Agriculture is currently working with the Civil Aviation Authority of Bangladesh (CAAB) to develop a regulatory framework for drone usage in the agri-sector. This includes licensing provisions, airspace management, data governance, and user training. While these regulations are still in nascent stages, their formulation is crucial for building trust and ensuring safe, scalable operations.\nYet, challenges persist. Cost is a major barrier. High-end agricultural drones, especially those capable of spraying or covering large fields autonomously, can cost up to Tk 300,000-500,000. For the majority of smallholder farmers -- who make up over 80 per cent of Bangladesh's farming community -- such an investment is prohibitive. To address this, cooperatives and farmer producer groups (FPGs) are being encouraged to jointly own and operate drones. Private sector startups like AgriBotX and iFarmer have also emerged, offering drone services on a per-acre rental basis, thus reducing entry barriers.\nTechnical know-how is another hurdle. The operational sophistication of drones demands trained personnel. Recognising this, organisations like Solidaridad Network and BRAC have initiated community-based drone literacy programmes in rural areas. These initiatives for training young agri-entrepreneurs in drone operations, maintenance, and data interpretation seek to create a new cohort of tech-savvy service providers within the farming communities.\nThere is also a growing momentum in the academic and R&D space. Universities like the Bangladesh Agricultural University (BAU) and institutions like BARC (Bangladesh Agricultural Research Council) are now incorporating drone technology into their research and extension curricula. Collaborative research efforts are underway to refine drone-assisted pest forecasting models and integrate UAV data into national crop insurance schemes-a crucial step in risk mitigation.\nMeanwhile, artificial intelligence (AI) is quietly supercharging the capabilities of drones. The Smart Agro Development Technology project, an initiative developed by a team of AI researchers and agronomists, exemplifies this synergy. Using neural network-based classifiers trained on thousands of annotated crop images, SMARD-enabled drones can identify over 30 different crop diseases with an accuracy exceeding 92 per cent. Once disease is detected, the system recommends treatment protocols and nearest input sources via an integrated mobile app. This intelligent feedback loop minimises crop loss, maximises productivity, and empowers farmers with actionable intelligence.\nThe benefits of drones are not just agronomic, they are economic and environmental. With drones enabling precise, need-based application of agrochemicals, the ecological footprint of farming is reduced. Less pesticide runoff into water bodies, fewer emissions from mechanised field equipment, and improved soil health are tangible environmental dividends. Economically, drones reduce labour costs and speed up field operations. A drone can spray a hectare of rice in 10-12 minutes -- a task that could take a labourer half a day, especially in summer heat or post-disaster conditions.\nPost-disaster assessment is another area where drones are proving invaluable. In the aftermath of Cyclone Sitrang in 2022 and the floods of 2023 in Sylhet, drones deployed by NGOs and district administrations provided rapid assessments of damaged croplands, enabling prompt compensation disbursement under government relief programmes. This not only cut response time but also reduced corruption and misallocation of funds -- issues that have long plagued traditional damage assessment practices.\nThe future, too, is promising. Trials are underway in Rajshahi and Khulna to link drone imagery with blockchain-enabled farm traceability systems. This would allow buyers, including exporters and supermarkets, to verify farm conditions and input practices through time-stamped drone footage -- opening doors to premium pricing and international market access for local producers. Imagine a UK consumer scanning a mango label and seeing a drone-captured aerial snapshot of the orchard in Meherpur from where it was sourced -- that's the level of transparency the future promises.\nStill, for this vision to materialise at scale, policy and infrastructural alignment are critical. Experts advocate for a national Smart Agriculture Policy that unifies standards for drone tech, AI systems, data protection, and public-private collaboration. There is also a need for a national agri-tech innovation fund to support startups and farmer groups adopting drone technology.\nSimultaneously, donor agencies and development banks must continue to support capacity-building initiatives. Partnerships with telecom companies will be essential too, as most drones depend on stable 4G/5G connectivity to relay real-time data -- a limitation in many rural and remote regions of Bangladesh.\nBangladesh stands at a pivotal juncture. Its agricultural heritage is rich, but the challenges ahead are formidable. By adopting drone-assisted smart agriculture, the country is not just responding to adversity, it is pioneering a model for climate-resilient, tech-enabled farming that other Global South nations can emulate.\nIn the skies above Bangladesh, a quiet revolution is taking flight. From the hands of the farmer to the hum of rotors slicing through the air, drones are scripting a new chapter in the story of agriculture. A chapter where science, sustainability and sovereignty converge and data are harvested alongside crops, and where the future of farming soars above the fields.\nDr. Makhan Lal Dutta is a development professional with expertise in climate-smart agriculture, food security, agribusiness, value chain development, and rural livelihoods. \nMakhan_Dutta@hk-bd.org\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Drone technology is revolutionising agriculture",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/drone-technology-is-revolutionising-agriculture-1750347909",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       June 20, 2025 00:00:00  \n\nIt is common for Bangladeshi people to wrongly describe basic necessities of life like food, clothing, shelter, healthcare and education as fundamental rights. This misconception of rights prevails not only among regular folks, but also among highly-placed people. Newspapers sometimes run articles written based on such misconceptions. Due to the misunderstanding, they portray the basic necessities as fundamental rights on one hand and skip many human rights on the other. Low level of awareness among citizens about fundamental rights and human rights, thanks mainly to lack of initiatives from the government despite the obligation to it to publicise rights documents, is mostly responsible for the misconception.\nThe Bangladesh Constitution has incorporated many of the principles of the Universal Declaration of Human Rights (UDHR), which is considered a cornerstone of international human rights law and a foundational document for global efforts to protect human rights. The national charter guarantees a wide range of UDHR, such freedom of expression, movement, assembly and association, equal protection under the law, non-discrimination, and safeguards against arbitrary arrest, as fundamental rights, by placing them in the Fundamental Rights part. The supreme law provides that anyone can move the High Court for redress in case they are deprived of any of these rights. The constitution has incorporated several other UDHR in its Fundamental Principles of State Policy part with the provision that the State shall strive to attain them for its citizens but no one can seek court intervention in case the State cannot ensure it. Several of the basic human necessities that we often mistakenly described as fundamental rights, including food, clothing, shelter, education and medical care, are included in this part.\nAnyway, Bangladesh also ratified most of the key international rights documents, including the International Covenant on Civil and Political Rights (ICCPR), the International Covenant on Economic, Social and Cultural Rights (ICESCR), the Convention on the Rights of the Child (CRC), the Convention on the Elimination of All Forms of Discrimination Against Women (CEDAW), and the UN Convention on the Rights of the Child (UNCRC). Yet, awareness among Bangladeshi people of the rights guaranteed by the statutes is alarmingly low. Lesser-known rights, such as those related to the environment, persons with disabilities, minority and indigenous communities, informal sector labourers, and digital rights, are especially neglected.\nThe main reason behind this deficiency lies in the failure of successive governments to fulfil their responsibility to publicise rights-related statutes. The Constitution and the international statues Bangladesh is party to impose an obligation on the State to inform citizens about their rights. The government has, however, kept its responsibility limited only to translating them into Bangla; no other tangible efforts to make the documents reach out to citizens are evident. \nThere is no denying that the lack of awareness about rights means that violations go unreported and unaddressed. Low rights awareness is partially responsible for the high rate of domestic violence, discrimination, exploitation and corruption, and cheating of workers. Non-governmental organisations (NGOs), media outlets, and rights groups are making efforts to raise awareness about rights. But their reach is still limited.\nThe government needs to step up efforts to create adequate awareness among citizens about fundamental rights, human rights and their obligations. If it falls short in its duty to publicise rights documents and educate people, the promise of justice, equality, and dignity will remain out of reach for many. Bridging the awareness gap is not a matter of choice; it is a legal and moral obligation to the government.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Low awareness leads to human rights denial",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/low-awareness-leads-to-human-rights-denial-1750347949",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 20, 2025 00:00:00  \n\nIn the past few years, a noticeable change has swept through Dhaka's young career seekers. The old dream of a stable 9-to-5 desk job is slowly ceding ground to a hunger for freedom, fresh ideas, and real impact, pushing more graduates toward starting their own ventures.\nCheap mobile data, open-learning sites, and a steady flow of homegrown success stories now feed these new ambitions. Fed up with stiff office rules and cramped opportunities, many young Bangladeshis are choosing to create something meaningful that speaks to their interests and offers a purpose that reaches far beyond the next salary.\nNonetheless, the trend does not come without its problems. Aspiring entrepreneurs continue to be faced with major obstacles like financial uncertainty, absence of mentorship and bureaucratic red tape. Most of the young people quit well-paying jobs without proper planning and end up in the pitfalls of business life. The next step is to have a friendlier ecosystem; an ecosystem that provides access to finances, training and mentorship to first-time founders.\nPolicymakers, educational organisations, and the private sector should see this change and take some action. In order to embrace all the potential that the young people of Bangladesh have, investments into the development of their entrepreneurship must be pursued; not only in words but also with actual institutional support and resources.\nAusesh Biswas\nBBA (Finance)\nNorth South University \nausesh.biswas@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Beyond the 9-to-5 desk job",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/beyond-the-9-to-5-desk-job-1750347971",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-06-2025"
    }
]