[
    {
        "full_article": "Donald Trump is no peacemaker. While out of power, he railed against America’s “forever wars”. He claimed that if he were the President, the Ukraine war would never have started. The Trump base blamed America’s globalists for its forever wars. Yet, on Mr. Trump’s watch, Israel, Washington’s closest ally, began attacking Iran on June 13, 2025, even as the U.S. and Iran were still in talks. At first, Mr. Trump and his Secretary of State Marco Rubio stated that America was not involved in the war, and warned Iran against targeting U.S. soldiers or bases in West Asia. Iran did not. Tehran’s response was directed solely at Israel, the aggressor. But a week later, when Israel was struggling to intercept Iranian ballistic missiles, American B2 bombers dropped bunker-busting bombs at Fordow, Iran’s most heavily fortified nuclear facility, while U.S. submarines fired Tomahawk missiles at the Natanz and Isfahan nuclear plants. This is now unmistakably Mr. Trump’s war. He came to power promising peace. And in just six months, he has become a warmonger and a globalist aggressor.When it comes to wars, the U.S. hardly learns from its mistakes. It invaded Afghanistan in 2001, vowing to destroy al-Qaeda. defeat the Taliban and “democratise” the country. But 20 years later, it handed it back to the Taliban. It invaded (and destroyed) Iraq in 2003, lying that Baghdad possessed weapons of mass destruction. It invaded (and destabilised) Libya in 2011 in the name of protecting Libyans from their government. In the case of Iran, America’s intelligence agencies concluded in March that Iran did not have an active weaponisation programme. Iran once signed a nuclear agreement with the U.S. and other major powers and accepted checks on its nuclear programme. It was Mr. Trump who tore up the deal. Iran again joined talks with the U.S., and it was Benjamin Netanyahu, Israel’s Prime Minister, who destroyed diplomacy this time. This war will have serious consequences for West Asian stability and global order. Major powers will now have less incentives to trust Mr. Trump’s overtures for dialogue. Smaller powers will have greater incentives to join the arms race for their own survival. North Korea will never give up its nukes. If Iran’s regime survives this storm, it could seek to rebuild its nuclear programme. If it decides to strike American bases, the war could spiral into something more dangerous. Mr. Netanyahu’s unchecked militarism, which is in part aimed at protecting his hold on power at home, has plunged the region into a deep security abyss. Mr. Trump has made it catastrophically worse by turning Israel’s war into America’s war. Darker days lie ahead for West Asia. Published - June 23, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        war\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        Ukraine\n                    \n                            /                      \n                        \n                        Iraq\n                    \n                            /                      \n                        \n                        Iran\n                    \n                            /                      \n                        \n                        missile systems\n                    \n                            /                      \n                        \n                        nuclear policy\n                    \n                            /                      \n                        \n                        Afghanistan\n                    \n                            /                      \n                        \n                        Libya\n                    \n                            /                      \n                        \n                        espionage and intelligence\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        North Korea\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        Donald Trump",
        "headline_1": "​Man of war: On why Donald Trump is no peacemaker",
        "headline_2": "Donald Trump has made Israel’s war with Iran more dangerous for the region",
        "link": "https://www.thehindu.com/opinion/editorial/man-of-war-on-donald-trump-is-no-peacemaker/article69724823.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "23-06-2025"
    },
    {
        "full_article": "UK’s assisted dying bill is a momentous law. The conversation must start in India \nThird time lucky. After rejecting versions of the bill in 1997 and 2015, UK lower house voted for a law to allow assisted dying in England and Wales. This means patients terminally ill, as defined in law, and likely to die within six months, can apply for an exit. The legislation will have to be set in motion within four years (2029). If delayed in the Lords – it’s highly contested and the lower house win was by just 23 votes – the bill will lapse. It may not be done and dusted yet, but a historic social change has begun. Exhaustive debates and tweaks to the bill included dropping provision of a judge having to sign off on the decision. Importantly, no other person is ‘obliged’ to take part. Patients will have to administer the drugs, whatever is decided, themselves, so it’s a first step to active euthanasia. Reportedly, UK govt estimates there may be 4,000 such patients.   \nTo legislate on assisted dying is never a straight road in any country. Fears and concerns are real that vulnerable, disabled and older people risk being coerced to use the law, to reduce the financial and care burden on the family. UK bill’s penalty for coercion is a 15-year jail. While such fears have been voiced to reject assisted dying, the Indian reality is that terminally ill people and families are often left to fend for themselves as a result of lack of access to treatment and/or unaffordability of care. At the privileged end of affordability/access, there is little policy or regulations to limit life-sustaining interventions inappropriate at end-of-life stage. The Supreme Court upheld advanced directives, the right to refuse treatment: passive euthanasia. UK’s bill is an opportunity to take further the conversation around a 360-degree end-of-life care that includes palliative care and covers assisted dying for the terminally ill. \n\n",
        "headline_1": "Coding for the end",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/coding-for-the-end/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-06-2025"
    },
    {
        "full_article": "What really are the positives, even for US, after it hit Iran? The possible negatives are plenty, though\nFordow is gone, Trump posted on Truth Social early on Sunday, even before experts had time to analyse the aftermath of the raid. In his telling, “Iran’s key nuclear enrichment facilities have been completely and totally obliterated.” If that’s true, Israel is the lone, undisputed nuclear power in West Asia now, and the war must stop. For, eradicating Iran’s bomb-making infra was the stated aim of Israel’s June 13 strikes. Trump has also said, “Our objective was the destruction of Iran’s nuclear enrichment capacity.” \nBut you can’t hold Trump to his word. As late as June 10, he said he would like to avoid a conflict. Yet, on June 13, after Israel’s airstrikes, he admitted: “We knew everything.” And on Saturday, when he lamented he wouldn’t get a peace Nobel, “no matter what I do”, his fleet of B-2 bombers was already on its way to hit nuclear facilities at Fordow, Isfahan and Natanz. \nTrump, the consummate dealmaker, perhaps reckons that a humbled Iran will sue for peace. But this isn’t business. Here’s a regime fighting with its back to the wall. Isolated and sanctioned for 46 years, it derives legitimacy from strength, or a semblance of it. It cannot cower before Trump’s “if peace does not come quickly” threat. And Iran has not run out of moves yet. Although it shouldn’t, it can attack military bases in the region that house 40,000 US troops. Iran can also inflict pain globally – as it threatened on Sunday – by shutting off the Strait of Hormuz, through which 20% of the world’s oil passes. So, wittingly or otherwise, Trump has walked America and his MAGA voters into another West Asia swamp after vowing not to do so.\nFor what? As experts point out, Iran – world’s number one state sponsor of terror, in Trump’s words – didn’t have planes or missiles to hit America. US friends in the neighbourhood – Oman, Qatar, Iraq – disapprove of the strikes. Even the Saudis, for the second time in 10 days, have “condemned and denounced the violation of the sovereignty of the Islamic Republic of Iran”. Whose war is Trump fighting then, and what will it achieve, besides steeling Iran’s resolve to build its nuclear deterrent, like N Korea? Each GBU-57 that Trump’s B-2s dropped shook the international order on Sunday. Global treaties like NPT, and principles of engagement are under a cloud now. And with Pakistan in Trump’s embrace, India should be very watchful.\n\n",
        "headline_1": "Bombastic",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/bombastic/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-06-2025"
    },
    {
        "full_article": "Bibi’s an edgy chap who’s rewriting the playbook: Now every duck by a player is a coded attack signal\nAmerica has just been made great again. It’s thrown out the dusty constitution, the will of its simple hardworking people, and outsourced the brain of its executive. Its leadership no longer goes by the book. \nThey go by Coach Bibi. No, not the fair-playing, rulebook-led grey-haired bloke you imagine. But an edgy chap who thinks every duck by a player is a coded attack signal. \nBibi sees a threat everywhere – the kind that only he can spot. Limited edition Bibi-goggles, mostly trained on the barbecue fires in people’s back yards, saw “most dangerous weapons” being cobbled together. Bibi’s words, not mine. \nThe International Atomic Energy Agency brought its own binos to double-check. They faithfully reported it was meat, not plutonium – no heavy water in the mocktail mix. It wrote a memo too. But the voice of Coach Bibi was too loud, too repetitive. One has to, after all, listen to the force of civilisation. \nEnter Donald, uhh…Captain America to the world, who was really just a VIP bystander in the match in which Bibi was lead coach. \nPerfect opportunity, coach! Rope him in before your boys tire out, they haven’t had a break for months now. Make Donald think Team America is playing in a match between Team Israel and Team Iran – a game America isn’t even in. Confuse him, let him lend you his boys so you can end the match before the coin toss. \nSo the coach muddies the playbook, which is easy to do. He starts with a few pre-game videos. Grainy stuff, with a bit of AI generated magic in which a bunch of unknowns are supposedly sloganeering “Death to America”, and some rookies are tripping and falling. A few knees bruised and so on; you know how it is when boys play rough. \n“They think they can play rough?” says Captain America, “Oh boy, I can play rougher.”\n“Strike the barbecue pits to end the game,” whispers the coach. “No food, no energy, no game.”\nAnd that’s how we have all ended up watching a fixed match – big, beautiful, magnificent and utterly avoidable. Game on. \n\n",
        "headline_1": "Captain America’s new coach",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/captain-americas-new-coach/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-06-2025"
    },
    {
        "full_article": "It’s likely to be another close poll. Neither NDA nor INDIA, partly because their playbooks are similar in some ways, has a winning formula yet. Smaller parties will look to cash in\nModi’s rally in Siwan yesterday showed that the build-up to the Bihar assembly polls is well and truly underway. It’s a truism that Biharis do not merely cast their vote, but vote their caste. The state has become synonymous with what the political scientist Edward Banfield termed ‘amoral familism’.\n\nIn an agrarian society defined by the Permanent Settlement, a narrow understanding of self-interest, limited to one’s nuclear family and its extensions, undermines any notion of the common good.\nRead the full story on TOI+.\n\n",
        "headline_1": "Bihar: Kings & kingmakers",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/bihar-kings-kingmakers/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-06-2025"
    },
    {
        "full_article": "We're deeply alarmed by the United States forcing itself into Israel's war on Iran after days of provocative rhetoric. Early Sunday, the US Air Force's B-2 Spirit stealth bombers struck three key nuclear sites in Iran, using the powerful GBU-57 \"bunker buster\" bombs. President Donald Trump later claimed the strikes had \"totally obliterated\" these sites, although the extent of the damage is yet to be established. Fordow, Iran's most heavily fortified uranium enrichment site buried under 80 metres of rock, was reportedly hit with a full payload; Natanz and Isfahan were similarly targeted. While both the International Atomic Energy Agency (IAEA) and Iranian authorities have confirmed that no off-site radiation has been detected so far, the strategic and psychological toll of this attack is undeniable.\n\nFirst of all, it marks a dangerous escalation in the ongoing war. Iran, which condemned the attack as \"outrageous,\" warned of \"everlasting consequences.\" Although by now Iranians appear degraded in their military capabilities thanks to the persistent, targeted Israeli attacks over the past week, \"they have all sorts of asymmetric ways that they can respond [to the US attack],\" as a former Middle East negotiator for US administrations has said. The US strike and threats of further attacks could, according to some analysts, provoke Tehran into retaliating by closing the Strait of Hormuz, attacking US military bases in the Middle East, stepping up its missile barrage on Israel, activating proxy groups against American and Israeli interests, etc. Of course, this is just a hypothetical scenario, as there is no telling what the reactions of a weakened, desperate, but still-resolute Iran will be in the long run.\n\nThe US-Israeli strikes, we must say, should be viewed as part of an overall continuum that began with Israel's genocidal campaign in Gaza—which received full US backing—and then continued with Israel's attacks on Hezbollah in Lebanon and the fall of the Iran-backed Assad regime in Syria. The irony with the latest episode is that although Israel attacked Iran based on unfounded claims about the latter's nuclear programme, it likely has little to do with Iran actually acquiring nuclear weapons. As per an observer, Israeli Prime Minister Benjamin Netanyahu has been claiming for over 20 years that Iran was \"merely weeks, months, or a few years away\" from obtaining them—much like how the US falsely cited the development of weapons of mass destruction to justify its war on Iraq.\n\nIt is deeply shameful that such false claims are being repeated to commit war crimes while the world watches on silently. This has to stop. Israel and the US must end their illegal campaigns in Iran and Palestine. We urge the international community to intervene decisively to stop such deadly geopolitical power games and manoeuvres that bring suffering not only to civilians in the affected regions but across the world.\n",
        "headline_1": "World cannot afford another forever war",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/world-cannot-afford-another-forever-war-3923011",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-06-2025"
    },
    {
        "full_article": "US President Donald Trump has bombed Iran, as many had predicted. Rumours of Trump's intention to intervene in the ongoing Iran-Israel conflict had been circulating since June 18, starting with the Israeli media. On June 19, legendary journalist Seymour Hersh reported that, according to his sources, the intervention \"will entail heavy American bombing,\" and that \"the Trump administration is in full support of Israel's current plan to rid Iran of any trace of a nuclear weapons programme, while hoping the Ayatollah-led government in Tehran will be overthrown.\"\nNevertheless, many had hoped that the self-proclaimed \"anti-war president,\" the \"America First president,\" would refrain from dragging the US into another major conflict.\nBut those hopes have now been shattered, as Trump—like every US president arguably since JFK—has put \"Israel first\" and bombed three of Iran's nuclear facilities: Fordow, Natanz, and Esfahan. The great irony here is that this entire episode—from Israel's pre-emptive and illegal attack on Iran on June 13 to Trump's subsequent escalation—likely has little to do with Iran actually acquiring nuclear weapons. Indeed, Israeli Prime Minister Benjamin Netanyahu has been claiming for over 20 years that Iran was merely weeks, months, or a few years away from obtaining them.\nMany experts, including former US army generals and senior intelligence officials, have argued that Iran's greatest mistake was its decision not to acquire nuclear weapons—something that could have served as a deterrent against the relentless pressure it faces, as well as outright attacks on its sovereignty.\nThey point to what happened in Libya, Iraq, and Syria—countries that agreed to abandon their weapons programmes—as opposed to North Korea. The North Korean leadership remains in place, while the leaderships in those other countries that made deals with the US have been removed—and, in most cases, eliminated. Those countries have also been bombed and devastated. North Korea, by contrast, has not, because it possesses the nuclear deterrent.\nPrior to the US bombing, Iran had warned that it would target American assets in the Middle East if the US intervened. Many experts noted that US assets in the region were extremely vulnerable to retaliation. Some even argued that a US attack would compel Iran to conclude that it has no option but to acquire nuclear weapons if it wishes to survive.\nNow that Trump has crossed that Rubicon, it is impossible to predict what comes next. But in the aftermath of the attack, Israeli Prime Minister Netanyahu may—perhaps for the first time—have said something that will prove accurate: Trump's decision, he claimed, \"will change history.\" And it just might, for all the wrong reasons.\nIran's immediate response was to go into \"rage mode\" and launch a significant number of missiles at Israel—including, for the first time, its Khyber missile—which appears to have caused substantial damage. Iran's foreign minister accused the US of launching a \"dangerous war against Iran\" by striking its nuclear sites. He described the attacks as a violation of international law and warned that Iran would respond to defend its security \"by all necessary means.\"\nMeanwhile, in a televised address from the White House, the US president told the nation: \"Our objective was the destruction of Iran's nuclear enrichment capacity and a stop to the nuclear threat posed by the world's number one state sponsor of terror.\" He reiterated that \"there will be either peace or there will be tragedy for Iran far greater than we have witnessed over the last eight days.\"\nTrump went on to say, \"Remember, there are many targets left… If peace does not come quickly, we will go after those other targets with precision, speed, and skill. Most of them can be taken out in a matter of minutes.\"\nAccording to Stephen Zunes, director of Middle Eastern Studies at the University of San Francisco, Iran, too, \"has a number of options\" at its disposal. \"They can attack US forces directly. There are up to 40,000 Americans within range, not just of Iranian missiles but of drones and other weaponry. The fleet in the Persian Gulf, just off the Iranian coast, is also vulnerable to Iranian attacks, and that could impact global shipping, oil prices, and indeed the entire global economy.\" The proxy militias in Iraq could also \"target American bases there.\" And so, there are \"a number of ways that American forces could be vulnerable,\" and it would be surprising \"if the Iranians don't target at least some of these.\"\nHowever, as surprising as it may be for Iran to back down, that may be its best option. Following Israel's devastating success in eliminating Iran's top leadership in the surprise attack on June 13, the conflict has taken some shocking turns. Iran now seems to have been more successful in penetrating Israel's Iron Dome and inflicting damage. While it was initially believed that Iran wouldn't withstand Israel's intense barrage, it is becoming increasingly clear that it is Israel that is struggling to cope with Iran's missile strikes, as its defence systems are becoming exhausted trying to intercept them.\nIsrael had always sought to drag the US into this war, and in recent days it has tried even more desperately, as Iranian missiles continue to pummel the country. This has led to growing dissatisfaction among Israelis with Netanyahu, whose only path to retaining power appears to be fuelling further chaos.\nIt should now be clear to Iran that Netanyahu stands to benefit the most from any further escalation between the US and Iran. And that Trump, in bombing the three Iranian nuclear facilities, has effectively bombed his own base, a large portion of which supported him for his anti-war rhetoric. Now that his rhetoric has proven hollow, there could be significant domestic blowback.\nThe rest of the world, too, has once again witnessed how the US says one thing and does another. Global trust in the US's word has diminished further. Countries such as Russia and China—though unlikely to support Iran directly—may be more inclined to offer indirect assistance, viewing themselves as targets of the same adversary.\nTherefore, it may be in Iran's best interest to play the long game: to survive and allow the US and Israel to further expose their hypocrisy to the world, rather than escalate the conflict and give Washington another excuse to raise the stakes and push for rapid regime change in Tehran.\nEresh Omar Jamal is head of the editorial department at The Daily Star. His X handle is: @EreshOmarJamal\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The fallout of Trump’s Iran strike",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/the-overton-window/news/the-fallout-trumps-iran-strike-3922916",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-06-2025"
    },
    {
        "full_article": " \nThe protracted and increasingly volatile conflict between Iran and Israel—and with the US recently entering the fray by bombing Iran—has raised profound questions and concerns regarding fundamental tenets of international law, fostering an inherently unstable environment for global relations. Ongoing discussions frequently centre on the roles of Donald Trump and the US in this intricate dynamic. International legal frameworks—notably the UN Charter and International Humanitarian Law (IHL)—delineate specific provisions governing states' use of force and the imperative protection of civilians during armed conflict.\n\nThe conflict's origins and proliferation extend far beyond a bilateral dispute, significantly impacting both regional and global power balances. Russia's and the US' indirect involvement through proxy wars, particularly influenced by the policies of the Trump administration, has further exacerbated an already complex situation. Russia, a long-standing ally of Syria and Iran, maintains its influence through arms provision and diplomatic backing. Conversely, the Trump administration's \"maximum pressure\" policy, coupled with unwavering support for Israel, has demonstrably heightened regional tensions. These proxy wars, while not direct military confrontations, nevertheless incite various factions and intensify existing conflicts.\nOn June 18, Iranian Supreme Leader Ayatollah Ali Khamenei proclaimed on X (formerly Twitter), \"In Haider's name, war is beginning,\" issuing a resounding call for severe retaliation against Israel. His invocation of \"Haider\"—a reference to Ali, revered as the first Imam of Shia Muslims—underscored his statement: \"We must respond harshly to the terrorist Zionist regime. We will show no mercy to Zionists.\" Concurrently, Israel's increasingly aggressive posture further intensifies the escalation. In this dire scenario, ordinary citizens in both nations endure immense suffering—a situation utterly unacceptable and a clear violation of international law.\nDrone and missile deployment represents a significant facet of this conflict. Both belligerents utilise advanced drone technology and missiles capable of precise targeting. Iran's drone and missile strikes within Israel and Israel's retaliatory attacks against Iranian military and associated facilities invariably raise serious questions about transgressions of international law. IHL, which establishes rules for the protection of civilians and the conduct of military operations during armed conflict, appears to be repeatedly breached.\nThe UN Charter, the foundational document of international relations, exhorts member states to abstain from the threat or use of force against the territorial integrity or political independence of any state. However, when a state conducts military operations within another state's territory, it frequently violates Article 2(4) of the UN Charter. Both Israel and Iran are demonstrably failing to uphold this principle during their military operations against each other—as did the US when it bombed Iran.\nA fundamental principle of international law is state sovereignty and non-interference in internal affairs. When superpowers such as Russia and the US indirectly fuel the Iran-Israel conflict, they also infringe upon this basic tenet. Supporting one side through arms supplies, military training, or financial aid constitutes an intervention in another state's sovereignty. Under the International Court of Justice (ICJ) and the UN Charter, every state possesses an obligation not to interfere in another state's internal affairs.\nThe laws of war—commonly known as International Humanitarian Law (IHL)—are extensively violated in this conflict. Drone and missile use by Iran and Israel, especially in densely populated areas, elevates the risk of civilian casualties. IHL mandates a clear distinction between military and civilian targets. Indiscriminate attacks, where no differentiation is made between military and civilian objectives, constitute a severe violation of international law. Drone use, particularly when remotely controlled, poses ethical and legal challenges in avoiding civilian casualties. While military technology has advanced, it remains crucial that its use does not contravene core IHL principles.\nSpecifically, the deployment of hundreds of drones and missiles may violate the \"Principle of Proportionality.\" This principle dictates that the military advantage gained from an operation must not be excessive relative to the harm caused to civilians or civilian property. If a drone attack causes more civilian harm than military gain, it violates this principle. Similarly, the \"Principle of Necessity\" states that military action is legitimate only when essential for achieving a military objective and when no less harmful alternative exists. Extensive drone attacks, especially if they cause damage to civilian infrastructure or loss of life, could violate this principle. Another crucial aspect of international law involves \"War Crimes\" and \"Crimes Against Humanity.\" If any party intentionally targets civilians, destroys civilian infrastructure, or commits serious IHL violations, it could be considered a war crime. Individuals and states can be held accountable for such crimes.\nRussia's and America's proxy wars pose a palpable threat to international peace and security. Under Article 1(1) of the UN Charter, the UN's primary purpose is to maintain international peace and security. When superpowers incite conflicts in other regions for geopolitical interests, it negatively impacts global peace and stability, complicating regional conflicts and rendering resolution more difficult. Furthermore, such conflicts can encourage nuclear weapons proliferation and the use of other destructive arms, posing a grave threat to humanity.\nThe UN Security Council's role is questionable in this context. The permanent members' (the US and Russia) veto power is often utilised to protect their geopolitical interests, hindering the application of international law. When a conflict clearly violates international law, the UN Security Council should act impartially and hold the responsible parties accountable. But in proxy wars, due to superpower interests, it often fails to take effective action, undermining the credibility of the international justice system.\nThe 1949 Geneva Conventions and their Additional Protocols ensure civilian protection during wartime. These laws prohibit attacks on civilian homes, hospitals, schools, and religious sites, excluding military installations. Drone and missile attacks often lack accurate targeting, leading to accidental strikes on civilian areas and causing numerous innocent casualties. This can amount to a war crime.\n\nThe Iran-Israel conflict in 2025, with Russia's and the US's proxy war contributions (and now the US' direct involvement via the bombing of Iran's nuclear facilities), challenges several fundamental international law principles. Civilian targeting, sovereignty violations, and other potential IHL breaches have complicated this conflict, demanding a clear and firm response from the international community to uphold the rule of international law and prevent future conflicts of this nature.\nWhy are major powers failing to take effective action to stop this conflict? Several reasons exist. Firstly, Russia and the US both prioritise their geopolitical interests in the region. They do not want rivals to gain strength, so they support Iran or Israel to maintain their spheres of influence. Secondly, a complex game of power balance is being played in international politics, where major powers avoid direct conflict, using proxy wars as a strategy. Thirdly, international organisations such as the UN are often unable to take effective action due to the major powers' veto power. If a major power vetoes a UN Security Council resolution, it cannot pass, which is a significant obstacle to maintaining international peace and security.\nIn this ongoing situation, serious questions have arisen about how effectively international law can maintain peace and security. How can the international community overcome these geopolitical obstacles to ensure adherence to international law and protect innocent civilians?\nAtiqur Rahaman is a legal researcher and human rights activist. He can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "How geopolitical interests trump international laws",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/how-geopolitical-interests-trump-international-laws-3922941",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-06-2025"
    },
    {
        "full_article": "It is disappointing that, like so many of our water bodies near urban centres, Gulshan Lake is also being destroyed by the relentless dumping of all forms of garbage and waste. According to a Prothom Alo report, waste in the lake accumulates mostly near its final stretch as one approaches Baridhara DOHS. There, a four-to-five-inch-thick layer of garbage has formed on the water's surface, emitting a strong foul odour. Because of the unbearable stench, no one wants to sit on the terraces or balconies of the buildings lining the lake. Residents on the second to fourth floors of these lake-facing buildings are even forced to keep their windows and doors shut just to keep the smell out.\nAlthough such dumping has become a perennial problem, the situation has recently worsened due to the disposal of entrails and blood from sacrificial animals during Eid. Reportedly, no government workers have come to clean the area so far. A cleaner hired by a nursery owner said that, in addition to sacrificial waste, his cleaning tools have been pulling up all kinds of rubbish. A resident of a nearby building also stated that garbage is regularly dumped into the lake from buildings on both sides.\n\nAlthough such dumping has become a perennial problem, the situation has recently worsened due to the disposal of entrails and blood from sacrificial animals during Eid. Reportedly, no government workers have come to clean the area so far. A cleaner hired by a nursery owner said that, in addition to sacrificial waste, his cleaning tools have been pulling up all kinds of rubbish.\nAccording to the president of the Gulshan Society, they have been cleaning floating waste from Gulshan Lake using their own funds; however, the larger issue is that all the sewage from Gulshan-Banani and Baridhara DOHS is reportedly being dumped into the lake. He further alleged that, despite repeated appeals to the authorities, no action has been taken. Residents in the area have also expressed frustration with Dhaka WASA, accusing it of allowing waste to be dumped. However, an official of WASA has denied this allegation.\nAn environmental expert who has conducted research on pollution in Gulshan Lake has revealed that the level of dissolved oxygen in the lake is less than half the required standard. For instance, the minimum amount of dissolved oxygen should be 5 milligrams per litre of water, but in Gulshan Lake it is only 2 milligrams. Additionally, the level of dissolved solids is twice the acceptable limit, which has severely damaged the lake's aquatic ecosystem, making fish deaths increasingly common.\nThe relevant authorities must explain why they have allowed the situation to deteriorate to this extent. That Gulshan Lake is in a terrible state is clear as daylight. And it is high time the government took action to reverse it. A regular cleaning mechanism must be established, and the government should work with experts to find a scientifically viable solution to the lake's pollution.\n",
        "headline_1": "How much longer must Gulshan Lake suffer?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/how-much-longer-must-gulshan-lake-suffer-3921621",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 23, 2025 00:00:00  \nThe government is under mounting pressure to boost revenue collection amid its persistent shortfall and the ballooning of public debt. There is also a pressing need to meet the International Monetary Fund (IMF) condition of raising the tax-GDP ratio as part of a $4.7 billion loan agreement. Given that Bangladesh's tax-GDP ratio is one of the lowest in the world, the objective of augmenting revenue collection is logical and pragmatic in favour of fulfilling the IMF condition and broader economic stability. But the question is, how to achieve the desirable revenue target? A timeless saying goes, \"The art of taxation consists in so plucking the goose as to obtain the largest amount of feathers with the least possible amount of hissing.\" This metaphor vividly captures the essence of maximising taxation while simultaneously minimising public resistance and dissatisfaction. Ideally, this is the principle that should guide the government's tax policy.\nRegrettably, the government has opted to increase the tax burden on existing tax-payers, instead of prioritising the much-needed broadening of the tax net. One such counterproductive measure is the quadrupling of the turnover tax for cottage, micro, small, and medium enterprises (CMSMEs), which jumps from 0.25 per cent to 1.0 per cent. Similarly, companies and firms with an annual turnover of Tk 50 lakh or more, as well as individuals with a turnover of Tk 40 million or more, will now face a minimum turnover tax of one per cent, up from the previous rate of 0.6 per cent. The very concept of slapping a turnover tax is flawed and goes against the inherent principle of taxation. Turnover tax is levied on gross revenue, not net income. This means that even if a business is operating at a loss, it is still compelled to pay tax based on its total sales; and this minimum tax is non-refundable. If a business generates no income, how can imposition of an income tax on it ever be justified?\nThe hike in turnover tax, when the policy itself is fundamentally flawed, is not only unjustified but also ill-timed and unsustainable. It comes at a time when businesses are already grappling with prolonged political uncertainty and a significant economic slowdown. This presents a double whammy for struggling enterprises, especially those of CMSMEs, which employ approximately 85 per cent of the industrial workforce and are called the backbone of the economy. This onerous burden will stifle the growth of many prospective businesses, and it is absurd to think that entrepreneurial growth must be sacrificed to meet fiscal needs. In a word, it is reminiscent of colonial-era policies. It will inevitably put a damper on domestic investment and send a discouraging signal to potential foreign investors, who seek predictable and fair tax regimes.\nFaced with a lofty revenue collection target, the National Board of Revenue (NBR) seems to have opted for the easy route of a wholesale turnover tax hike instead of focusing on increasing its efficiency to go after tax dodgers and curb tax evasion. This approach, once again, vividly exemplifies why tax policy-making must be separated from tax collection. When these two distinct tasks are entrusted with the same authority, there is a risk that it will set policies in a manner that primarily suits its convenience, disregarding the issues of fairness or the adverse impact on the broader economy. The government, therefore, must not budge in the face of protest from a section of NBR officials against the crucial reform of bifurcation. So, the hike in turnover tax must be reconsidered. A fair, predictable, and efficient tax environment is necessary for a sustainable economic and revenue growth.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Turnover tax hike  is untenable",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/turnover-tax-hike-is-untenable-1750601352",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       June 23, 2025 00:00:00  \nThough price of oil in the global market has not so far gone through the roof since Israel's June 13 attack on Iran followed by the latter's retaliatory missile and drone strikes, there is no guarantee that it will remain so in the coming days. It's already unstable. Overall, the price of crude oil rose by 4.0 per cent over the week. But in case, the conflict spirals out of control and Iran blocks the Strait of Hormuz, it is hard to say where it would finally end up. If the US enters the scene and starts a bombing campaign on Iran to what it says destroy Iran's nuclear facilities and Iran blocks the Strait of Hormuz in retaliation, the oil price may even shoot up to US$150 a barrel, some experts fear. In that case, countries that depend completely on imported energy including oil and Liquefied Natural Gas (LNG) are going to be at the receiving end. Definitely, Bangladesh with its economy trying hard to recover from the ashes it had been reduced to during the long period of autocracy till August last year, will find it real hard to stand on its feet again. In this connection, the Power, Energy and Mineral Resources Adviser Muhammad Fouzul Kabir told the media some days back, when the tension in the region was escalating, that though Bangladesh was in a vulnerable position as its energy security is dependent on imports, there is no question that the country would be 'in trouble'. However, he still believed that the situation (relating to Iran-Israel conflict) would not go out of control. Even if the price of oil increases by Tk 18 to Tk 20 per litre, the economy would be able to 'absorb the shock', he assured. Clearly, the reason for his relative calm about the country's energy security in the face of any flare-up between the two arch enemies in the Middle East is that Bangladesh earlier in May purchased oil for consumption in the June-July period. \nHowever, the latest developments in the Middle East, to all appearances, show no reason to be complacent. The ongoing strikes and counterstrikes on each other's strategic infrastructures point to something more sinister in the making than one would like to believe. For the US and its Western allies are solidly behind Israel and they would protect Israel at all costs. Here lies the crux of the matter. This is a do or die situation. The oil rich Gulf Arab States lie at the epicentre of the conflict and are the prime target of either party in the war. If oil and natural gas infrastructures of the Gulf region are attacked by either party, energy supply in the entire world will be disrupted for an indefinite period. How does Bangladesh, an energy-starved nation, hope to survive for long in such a situation? Smooth and dependable supply of fossil energy is still the backbone of the world economy. The six months' oil deal from July to December that Bangladesh has reached with its suppliers in the Gulf, is not enough to protect us indefinitely. To be frank, given the volatile political situation in the oil producing region of the Middle East, which is not improving but worsening by the day, Bangladesh's dependence on this region for its energy supply in the long term cannot be a viable option. Had the leadership of the country been forward-looking, the country would meanwhile have developed its alternative sources of energy long since. The 'If-not' approach to energy issue when its source of supply is the Gulf countries, or the diplomatic language that 'we would be monitoring the market' situation' is no sustainable positions to make when it is a question of survival of the economy. It is also not purely about energy supply. We have to be mindful also of the fact that a major source of the country's hard currency in the form of remittance comes from the migrant workers, who are basically unskilled, staying in the Muddle East. If the entire Gulf region is embroiled in a protracted conflict, the migrant workers will become the first victim of the development. Hundreds of thousands of migrant workers would then return home. That would create an added burden on the economy until an alternative destination for their employment is found. As it is with the mainstay of the country's export, the other major source of foreign exchange, which is dependent on a single type of commodity, the apparel products, so is it with the energy source. It's a one-road to the nation's energy security and foreign exchange earning. Experts including Professor Mustafizur Rahman, a distinguished fellow of a local think tank, the Centre for Policy Dialogue (CPD), held that oil price surge in the global market would leave a very negative impact on the trade balance and current account balance in the eventuality of a sustained after-effect of the energy price escalation. The shipping routes for trade of energy and other vital commodities in the Persian Gulf, the Gulf of Aden, the Red Sea and the Mediterranean Sea if severely disrupted, costs of import and export would escalate. Bangladesh is a nation heavily dependent on import of its energy, industrial raw materials and food. The country's export, too, depends on the undisturbed shipping routes through the international waters. But Bangladesh with its present level of forex reserves can hardly foot the bill for about four months' import. That means, it cannot sustain for long once import costs of its vital supplies rocket up and remain so indefinitely. However, economies with sound reserves or developed industrial base can sustain longer in that situation. Obviously, Bangladesh does not fall in that category.\nThe maritime routes, especially in the Red Sea, the Gulf of Aden and the Mediterranean have been facing uncertainties since the Houthi rebels of Yemen started their attacks on merchant or military vessels friendly to Israel since October 2023. But politicians in power then and now have remained clueless or too engaged otherwise to prepare the nation for such an emergency. In fact, no excuse is enough to justify the failures to take early steps to meet such existential emergencies. \nThe interim government should look for alternative sources of oil and LNG in other parts of the world, preferably in the East, that are not as dicey as the Middle East. Such steps are also required for its exports and markets for migrant workers.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Diversifying energy sources, export markets",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/diversifying-energy-sources-export-markets-1750601409",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       June 23, 2025 00:00:00  \nTo say Israel is committing crimes against humanity is an understatement. The mind behind the daily routine killing of unarmed and relief-seeking hungry Palestinians is diabolical at its worst. Even at a time when the Zionist state is at war with Iran, its pogrom continues unabated---lately its targets being Palestinians desperately looking for UN food aid including drinking water for mere survival. History's irony is that the people who suffered the 'final solution', an euphemistic expression for extermination of the Jewish people of Europe, are now the perpetrators of an equally outrageous mass murder of a people on whose soil an artificial state called Israel was created from nowhere to rehabilitate the former. \nIf the Nazi programme orchestrated to eliminate the Jews continued from 1941-45, the lesson learnt should have been sobering and humane. Instead, brutality and barbarity of the extreme form mark the Jewish state's existential mantra. To the Jewish leaders like Netanyahu, the Palestinians are not just enemies---they are vermin which can be destroyed at will. The ultimate disgrace of the modern civilisation is that the so-called civilised nations not only approve of this genocide but also provide Israel with the killing machines and other material supports. A nation of less than 10 million in a land area of only 8,355 sq miles could not wield so much power unless its Western bosses helped it to be armed to the teeth. In fact, the Western powers are pulling the strings from behind the scene.\nNo wonder that 14 cargo planes loaded with military equipment and hardware from the US and Germany landed in Israeli airport right at the time the Jewish state and Iran are trading barrages of missiles following the aggression of the former on the latter. Middle East media including the Times of Israel have confirmed this. This fresh batch of military supply is on top of more than 800 cargo planes that have arrived in Israel since the start of the genocidal war on the Gaza Strip on October 7, 2023. \nThe US, no matter if it is under a Republican or Democratic president, has been leading the pack of Israel's Western allies. Colonial powers may have gone and the blatant exploitation of resources from Asia, Africa and Latin America may also have ceased but it has taken a vicious form of inciting internal conflict within a country or region thanks to Western powers' ruthless chessboard diplomacy. To establish monopoly access to natural resources such as fuel oil and minerals as also to ensure sale of arms aimed at stoking feuds and destabilising nationalist governments and regional peace, these materially developed nations can go to any length.\nThe exporters of democracy thus practise something diagnostically opposite to what they preach. Not that the peoples who fall victim to their Machiavellian designs are unaware of the sinister purposes but they are helpless. The hypocrisy and double standard of the defenders of democracy and moral guardians thus get exposed. Their sustained campaigns to paint a regime as evil have time and again proved unsubstantial. It has happened in case of Afghanistan, Iraq and wide swathes of the Middle East, Asia, Africa and Latin America. Now they have targeted Iran.\nIt is not difficult to see how the Western macabre scheme at times gets exposed. One recent example is Donald Trump's question-answer session on the White House lawn on the day of installation of new flag poles there. In answering to a question, he said 'we' control the sky. This referred to the Israeli and Iranian skies. The US was not officially involved in the war but his use of 'we' bares it all. Then again, an Israeli minister called it a war crime when an Iranian missile struck a hospital called Soroka Medical Center in southern Israel. Contrast this with the destruction of one after another healthcare facilities in Gaza strips. Gaza City hospital, Nasser Hospital, European Gaza Hospital and finally the last fully functional Ahli Arab Hospital all were partially or totally damaged.\nThe choice of words by some of the Western media outlets also favours their governments' stands. There lies the moral turpitude of the Western civilisation. Despite all its materialistic progress, it is morally depraved and debased.\n nilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Western civilisation  in the dock",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/western-civilisation-in-the-dock-1750601469",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 23, 2025 00:00:00  \n\nDespite the rapid advancement of science and technology in the twenty-first century, snakebite remains a fatal but neglected public health issue in Bangladesh. Each year, numerous lives are lost-many unnecessarily-due to the lack of timely medical intervention and limited access to effective antivenom.\nThe issue is compounded by widespread reliance on traditional healers, delays in seeking hospital care, and the inadequate availability of antivenoms at upazila health complexes. This is especially concerning as the monsoon season approaches, a period during which snakebite incidents sharply rise across the country.\nBangladesh's geographic location, tropical climate, high population density, and frequent human-wildlife interactions make it one of the world's snakebite hotspots. Yet, the country still lacks sufficient research and production capacity for locally effective antivenoms.\nSnake venom is a complex mixture of enzymatic and toxic proteins, varying significantly by species, habitat, and environment. While most antivenoms currently used in Bangladesh are imported from India, these are often designed for Indian snake species. Due to ecological and genetic differences, their effectiveness against native Bangladeshi snake species is not always reliable.\nIt is therefore essential to invest in research and development of antivenoms specifically targeted at endemic venomous species in Bangladesh. Locally produced polyvalent antivenoms-effective against multiple venom types-could greatly enhance treatment efficacy, reduce costs, and ensure more reliable availability in rural and underserved areas.\nThis issue requires urgent attention from policymakers, researchers, healthcare providers, and public health authorities. Developing a national strategy for snakebite prevention and antivenom production could not only save countless lives but also strengthen our rural healthcare infrastructure. At the same time, development of the local polyvalent antivenom may decrease the cost of developing medical facilities in rural networks.\nSamia Jahan Shefa\nStudent\nGenetic Engineering and Biotechnology \nJashore University of Science and Technology\nashikwodchem@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Antivenom research and development",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/antivenom-research-and-development-1750601491",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-06-2025"
    }
]