[
    {
        "full_article": "The festering unrest in the Union Territory of Ladakh turned violent on September 24, 2025, which resulted in the deaths of four persons and several others being injured. In the eyes of the Centre, the protest leaders had acted in bad faith even as efforts were underway to address their long-standing demands. These are Statehood for Ladakh, inclusion under the Sixth Schedule of the Constitution (which grants autonomy to tribal areas), reservation in jobs for locals, and greater political representation. The leaders and organisations at the forefront of the agitation have, however, said that the arson and violence were carried out by those outside their control. The protesters and the Centre have appealed to the youth of Ladakh to remain calm. The Ladakh protests have been championed by two major civil society coalitions — the Leh Apex Body (LAB), representing Buddhist-majority Leh, and the Kargil Democratic Alliance (KDA), representing Muslim-majority Kargil. While these groups do have many disagreements, they are united in a four-point agenda for constitutional safeguards and greater political autonomy for the region. On Wednesday (September 24, 2025), a shutdown called by the youth wing of LAB turned violent in Leh, which included the burning of the office of the Bharatiya Janata Party and the vandalising of the headquarters of the Ladakh Autonomous Hill Development Council (LAHDC).The Centre and these outfits had reached an agreement in May 2025, which seemingly addressed core concerns through measures such as 95% reservation in jobs for locals (including STs and EWS), 33% reservation for women in the Hill Development Council, strict domicile criteria, and recognition of local languages such as Bhoti, Purgi, Balti and Shina. However, on September 23, the hospitalisation of two elderly protesters, who were on a hunger strike with climate activist Sonam Wangchuk, triggered a fresh round of public protest mostly led by youth. The Centre now alleges that Mr. Wangchuk is instigating violence while a resolution to all demands has been in the works. The Centre has also hinted at the involvement of foreign elements. There is evidently a gap between the perceptions of the protesters and the Centre on both the issues at hand and the way forward. Ladakh is a sensitive security spot for the country. This makes it all the more important that the people of the region are taken into confidence even while troublemakers are brought under control. The legitimate aspirations of the people can be addressed without compromising India’s security requirements. Published - September 26, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Ladakh\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        Reservation\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        national security\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        language\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party",
        "headline_1": "​Mistrust in Ladakh: On the violence, legitimate aspirations",
        "headline_2": "Legitimate aspirations of a people need to be taken into account",
        "link": "https://www.thehindu.com/opinion/editorial/mistrust-in-ladakh-on-the-violence-legitimate-aspirations/article70094446.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "26-09-2025"
    },
    {
        "full_article": "NMC must end the preferential treatment it’s been giving to doctors’ complaints. Treat patients fairly\nFive years ago National Medical Commission was formed with the hope that it would bring greater accountability and ethical standards in the medical profession. The death of its infamous predecessor, Medical Council of India, was not mourned. But one thing MCI used to do and NMC has consistently failed to do, is accept appeals from patients and families “aggrieved by the decision of the state medical council on any complaint against a delinquent physician”. What makes this a glaring injustice is that appeals by doctors aggrieved at state council decisions are happily “allowed”. Is there any public interest served by such a double standard? Of course not.\nPlenty of adverse outcomes in medical treatment have nothing to do with negligence. But plenty do. Consider how in April this year, Madhya Pradesh police arrested a ‘cardiologist’ on charges of performing surgeries on the basis of forged medical documents. The thing is when patients or their families do suspect that they have suffered because of professional lapses, specific acts of commission or omission, the burden of proof on them is significant. As a July paper in the Medicine and Law journal says, “the evidence is skewed under the custody of the doctors.” On top of this power balance, state medical councils keep terrible health. For example, over the last four years, Maharashtra’s council has acted on less than 1% of the complaints of medical negligence, malpractice, fake certificates etc it received. Only two complaints were resolved in this period and even that was in 2022. \nIn India, there are strong structural barriers limiting patients’ practical ability to exercise their rights. Awareness and advocacy of these rights is also weak. There is no independent ombudsman listening to patient appeals, as in UK and Canada. But at least its regulatory body should not treat patients like hostile entities. Patients need doctors…but doctors need patients, too.\n\n",
        "headline_1": "Doctor no",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/doctor-no-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-09-2025"
    },
    {
        "full_article": "What Germany’s envoy told TOI should become the immigration blueprint for developed nations\nWithin days of America jacking up H-1B visa fees, to deter immigration for work, Europe’s top two economies have signalled their keenness to take in foreign talent. UK’s finance minister-equivalent, Rachel Reeves, said on Tuesday, “We are expanding our global talent and high potential individual visa routes.” A day later, German ambassador to India, Philipp Ackermann, told TOI that skilled workers should consider the opportunities that Germany has to offer.\nThis isn’t surprising. Top talent is a prerequisite for technological advancement and economic growth. So long as America’s doors were wide open, its premier research universities, business ecosystem and relatively higher salaries made it the first choice. Now, with the high barrier of a $100,000 visa fee, and increasingly shrill anti-immigrant rhetoric, other nations can draw more skilled workers. China, which is not only the second largest economy but also has the largest number of patent filings each year – three times more than US in 2023 – will reportedly launch a ‘K visa’ on Oct 1 to attract STEM workers.\nWhen it comes to attracting Indians, UK and Germany still have the advantage of democracy. UK’s pitch is interesting because, as late as May this year, Starmer was drumming up a different sentiment: “We risk becoming an island of strangers.” But it’s chiefly directed against low-wage and low-skill immigrants. In Germany also, there have been anti-immigrant stirrings, but as Ackermann said, “Migration is…a problem when it comes to refugees and asylum seekers, but skilled labour from India is excluded from this discussion.” Already, some 3L Indians have overcome the language hurdle to work in Germany.\nAlthough Germany remains Europe’s biggest economy, it has struggled with technological change. Its health system still relies on fax, and few govt services are online. Its auto industry has lost ground in the China-led electric revolution. An infusion of Indian tech workers could help it in these areas. For Indian students, the low cost of studying at Germany’s public universities, and the freedom to stay on for 18 months after graduation, increase the chances of finding work and settling down eventually. It’s a win-win situation for both sides. Recognition of Indian degrees, and ease of getting visas, will make it that much easier to attract the best talent from India. Trump, a descendant of German immigrants, might want to take notes. \n\n",
        "headline_1": "Germane idea",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/germane-idea/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-09-2025"
    },
    {
        "full_article": "From wine shops to whatnots, everything and everyone might be worthy of a sarkari stamp of merit\nA large sign I pass daily in Gurgaon says Govt Approved Wine Shop. This is clear evidence that nitpicking critics notwithstanding, govt is on the ball and doing its job 24/7. \nDespite America’s slapping a punitive 50% tariff on Indian products to stop us buying Russian oil, despite persistent food inflation and a falling rupee against the dollar, despite infiltrators continuing their dastardly doings in Kashmir even after the resounding success of Operation Sindoor, despite all these and the many worries and burdens of elected office, govt finds time and get-up-and-go to scout around and identify, presumably after meticulous scrutiny by certified sommeliers, a Gurgaon wine shop worthy of its approval, and presumably do the same for similar establishments elsewhere.\nIn the public interest govt might extend its seal of approval to other entities. A govt approved pizza takeaway would assure customers that all the ingredients that went into the making of the comestible were of the best quality, and the mozzarella was the asli cheez, and not a second-rate substitute. \nSimilarly, bookshops might also come under the purview of govt approval, which would ensure that nothing objectionable and likely to offend the sensitivities and sensibilities of any and all sorts was to be found within their sanitised premises. \nRetail outlets apart, govt could bestow approval on entire professions. A govt approved physician, for example, would allay anxiety that the person the patient was consulting was not a bigger quack than Donald Duck with a fake degree, but a bona fide taker of the Hippocratic oath. \nBarbers and hair stylists, as well as darzis, could seek govt approval to show that they were a cut above the rest. Govt approved carpenters could be depended upon not to chisel customers or hammer them with inflated bills. And govt approved masons could be relied upon not to drop a brick but to cement strong ties with employers. \nPerhaps the ultimate govt approval might be awarded to govt approved electoral candidates who could assure voters of a govt approved govt. \n\n",
        "headline_1": "Approving govt",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/approving-govt/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-09-2025"
    },
    {
        "full_article": "Civility is not about restricting freedom of expression. It’s about managing sharp disagreements, a reminder that we must show a modicum of respect even to those whose ideas we find offensive\n\nJimmy Kimmel is back. A campaign urging consumers to cancel their subscriptions might have swayed Disney, which owns ABC , the network that airs the comedian’s late-night show. But the suspension of Kimmel last week – for remarks critical of Trump administration’s response to the assassination of Charlie Kirk – is only the latest incident in the drastic decline in free expression worldwide.\nRead full story on TOI+\n\n",
        "headline_1": "Kimmel & the free speech question",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/kimmel-the-free-speech-question/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 26, 2025 00:00:00  \nThe government's decision to review once a year the benefits provided under cash-based social safety net (SSN) programmes in line with the Consumer Price Index (CPI) is a timely and pragmatic move. The objective is clear -- to ensure that the allowances offered under these schemes remain realistic and meaningful for beneficiaries rather than being eroded by inflation. The decision was taken at a meeting of the Finance Division, where policymakers agreed on the need to systematise and institutionalise benefit adjustments.\nAt present, there are nearly 95 social safety net programmes in operation, of which about 21 are cash-based. The meeting recommended three approaches for a review of these benefits: adjusting them against the CPI, Gross National Income (GNI) per capita, or a weighted average of the two. CPI-based adjustments would help allowances retain their purchasing power against inflation, while GNI-based adjustments could link them to overall economic progress. A weighted average, meanwhile, would capture both dimensions -- price stability and national prosperity -- making the system more comprehensive. Among the programmes under consideration, the key schemes expected to undergo regular reviews include old-age allowance, widow and husband-deserted women's allowance, disability allowance, and education stipends under the Social Welfare Ministry. Additionally, programmes such as life's quality improvement for backward communities, mother-and-child support and employment for the ultra-poor are also included in the review. A panel composed of representatives from the ministries concerned will likely use CPI as the guiding indicator to conduct annual revisions of these allowances.\nWhile the periodic review of cash benefits is a step forward, it addresses only part of the broader challenges that beset SSN programmes. Corruption, mismanagement, and overlapping of initiatives across ministries continue to undermine efficiency. A lack of coordination and monitoring often prevents benefits from reaching the real target groups. Instances of mistargeting-where ineligible people receive allowances while deserving ones are left out-have further diluted the impact of these schemes. To maximise the effectiveness of SSNs, reforms must go beyond indexation. A comprehensive review of all safety net programmes is urgently needed. Proper targeting begins with the creation of a detailed, up-to-date database of households living below the poverty line. Such a database would enable policymakers and implementing agencies to tailor interventions to the needs of specific groups, reduce duplication and channel resources more effectively. Equally important is strengthening, monitoring and accountability mechanisms. Transparent implementation, robust oversight, and efficient use of resources are vital to prevent leakages and ensure that the intended beneficiaries truly benefit. Addressing these systemic gaps would not only enhance the credibility of SSNs but also reinforce their role as a cornerstone of inclusive development.\nThe government's decision to link benefits with inflation is thus a welcome initiative. But it must be part of a broader, sustainable reform agenda that focuses on efficiency, transparency and proper targeting. Only then can the social safety nets fulfil their promise of protecting the poor and vulnerable while helping advance the country's goal of equitable growth.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Review of social safety net programmes",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/review-of-social-safety-net-programmes-1758814287",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       September 26, 2025 00:00:00  \nA webinar titled \"Economic Dynamics and Mood at Household Level in Mid 2025\" has explored a wide range of issues of national life including payment of bribes for official services and optimism about the country's future. The Power and Participation Research Centre (PPRC) arrived at mostly disquieting findings on the basis of responses from 33,207 members of 8,067 families. Contrary to the people's expectation, the culture of underhand dealings or extortion money has not ceased to be even when an interim government, not a political one, is at the helm of affairs. When one in every 12 households has to pay bribes for government services or 75 per cent of the families surveyed respond that without speed money, no official service is obtainable, the picture that unfolds is far from rosy. \nAlthough the percentage dropped from 8.5 per cent before August 2024 to 3.7 per cent this April, the old habit has died hard with the government employees and officials leading the list of bribe takers from half of the respondents. The much maligned police accepted bribes from 39 per cent of service seekers followed by political leaders or activists who received extortion money from 33 per cent of the respondents. Deterioration of law and order is usually responsible for proliferation of official corruption or graft and no wonder that the governance concerns have troubled the urban and higher income groups most. The bureaucracy failed to live up to the spirit of the July-August uprising simply because of the interim government's overreliance on and appeasement of it. \nThe views, as expressed by different segments of society, are bound to vary for reasons understandable. If the low-income groups are unconcerned about some issues the rich and higher income groups confront alone involving their businesses, there is nothing to be surprised. Similarly, the poor and marginal segments are more concerned about their own burning issues such as survival and medical expenditure or educational costs of their children. Yet there is an underlying theme of common concerns when it comes to law and order, justice and official corruption. \nIf 41 per cent of the low-income groups have cited official corruption, 41.6 per cent of the rich households have found it disturbing. Again, 40.1 per cent of the low-income people have pointed accusing fingers at the law and order situation but among the rich 52.1 per cent expressed their dissatisfaction with this issue. Freedom of speech, a vital element of democratic rights for the educated and elite group, hardly bothers the common masses. The message is clear here: corruption and law and order go hand in hand making the social fabric unstable and unsustainable. A country that emerged independent after nine months of bloody war should have long settled some issues allowing the rule of law to reign supreme. But political circles and bureaucracy have joined hands together to serve their coterie interests at the expense of the well-being of the common people. All the ills follow from the collaboration ---both open and clandestine --- of the two. The interim government may have formed several commissions in order to establish some check and balance in governance but unanimity among different stake-holders and power brokers is yet to be reached. When there was a need for a consensus and national reconciliation, cracks are appearing threatening the process of returning to an orderly and peaceful democratic dispensation. \nSocio-economic justice looks set to elude the nation once again. This sentiment was vented by frustrated respondents until April this year. There is every chance that the percentage of optimistic people has continued to dwindle after April and by this time it has hit the rock bottom. When people fail to meet their basic needs and become a witness to deteriorating administrative and socio-economic environment all around from absence of jobs to higher inflation, pessimism assails them in all its crude and cruel forms. \nHowever, not all are pessimistic. Poorer people can hardly expect now that the dream of an equitable society they started to harbour after the uprising will ever come true. Only 1.6 per cent of such respondents expressed their confidence in a turnaround of the country. Even only 14.4 per cent of the richest felt optimistic about the country's future. Younger people have been more optimistic with 33.7 per cent of them expressing a positive vibe. In this context both youth and their seniors have expressed their desire to eliminate corruption, establish good governance and make do away with political violence. The country has been held a hostage to 'mobocracy' instead of democracy with politically organised and motivated groups defying law and order. This anarchic social dimension has exposed the weakness of not only the interim government but also of a section of people with their doubtful past. \nAfter so much blood-letting, sacrifice and expression of no-confidence in misgovernance, people at the bottom rung of society deserved better but even its most optimistic members now realise that rebellion against autocracy is one thing and accepting the challenge of cleaning the augean stables is quite another proposition. A researcher and columnist has put it succinctly that 46 per cent has given up hope largely because of instigation of revenge and hatred. The class divide also shows no sign of bridging in the absence of any effective socio-economic reform programme. There is every chance of ruing yet another missed opportunity.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "A betrayal of a national dream!",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/a-betrayal-of-a-national-dream-1758814330",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 26, 2025 00:00:00  \n\nBangladesh stands at the crossroads. Rising sea levels, salinity intrusion, frequent cyclones, and flooding are no longer distant threats; they are realities confronting millions. According to government assessments, the country needs about US$12.5 billion annually, equivalent to nearly 3.0 per cent of its GDP, just to address escalating climate risks. Yet, despite its urgent needs, financing falls short of these requirements, threatening the resilience of communities and ecosystems.\nOver the past decade, Bangladesh has mobilised resources from both national and international sources. On the one hand, the Bangladesh Climate Change Trust Fund (BCCTF), financed through domestic revenues, represents an inspiring example of government ownership and accountability. On the other hand, international mechanisms such as the Green Climate Fund and Adaptation Fund channel larger amounts of money, but often come with complex donor priorities and rigid conditions.\nUnfortunately, these two streams of funding rarely work in harmony. Bangladesh requires about US$270 billion in foreign climate finance to fully realize its conditional Nationally Determined Contributions (NDCs), but has so far received only 1.25 per cent of that amount. While international support is significant, for example, the World Bank recently committed US$900 million to improve environmental sustainability and urban climate resilience, and the Asian Development Bank approved a US$400 million loan for enhancing adaptation and emission reduction, the gap between what is promised and what is delivered remains stark.\nMoney alone cannot shield Bangladesh from climate shocks. What matters equally is how transparently and accountably funds are managed. Civil society organisations and independent watchdogs have consistently highlighted governance gaps, including projects that lack durability, policies that remain unimplemented and communities that remain sidelined from decision-making.\nThe challenge is not just about attracting climate finance but ensuring that every taka and dollar delivers long-term and sustainable benefits. \nTo truly mainstream climate finance, Bangladesh must ensure that its national policies and international funding streams are not just parallel tracks but converging pathways. That means aligning development and adaptation goals, strengthening institutional capacity and empowering local communities to have a voice in climate decision-making.\nMowtushi Poit\nAssistant Professor\nBangladesh Institute of Governance and Management (BIGM)\nmowtushi.poit@bigm.edu.bd\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bridging policy gaps in climate finance",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bridging-policy-gaps-in-climate-finance-1758814353",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 26, 2025 00:00:00  \n\nTeenagers often feel the need to fit in with their friends, for whom peer influence is extremely important. At this age, friends can provide positive guidance, such as encouraging study, sports, or social activities. However, friends can also pressure teenagers into actions they should avoid-this is known as peer pressure.\nPeer pressure occurs when teenagers feel compelled to do something simply because their friends are doing it. It can range from small matters, like following a fashion trend, to more serious actions, such as trying cigarettes or skipping school. Many teenagers fear saying \"no\" because they do not want to be excluded.\nThe effects of negative peer pressure can be serious. Teenagers may make poor choices, experience stress, or lose confidence. On the other hand, good friends can encourage positive behaviour, such as studying hard, helping others, and participating in sports or community activities.\nTo resist harmful peer pressure, teenagers need confidence and self-awareness. They should think carefully before taking any action, politely refuse what they know is wrong, and choose their friends wisely. Parents and teachers also play a crucial role in providing guidance and support.\nPeer pressure is a normal part of teenage life. The key lies in following one's own choices while valuing friends who encourage positive growth and decision-making.\nArshie Akter Sunny\nStudent\nJagannath University, Dhaka\narshieakter205@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Pressure among teenagers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/pressure-among-teenagers-1758814373",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-09-2025"
    }
]