[
    {
        "full_article": "The Maharashtra Special Public Security (MSPS) Bill, 2024 follows the disturbing pattern of executive overreach in the name of security. Existing laws are often misused against political opponents and critics of the ruling party, including commentators. Charges are often vague and sweeping, and the process itself becomes the punishment in many of these cases. Given this pattern, the move by Maharashtra’s Mahayuti government led by the BJP to create an entire law to criminalise a certain kind of thought portends danger to freedom and democracy. Chief Minister Devendra Fadnavis has said that the new law would only target those who try to undermine the constitutional order, but the possibility — indeed the probability — of its misuse is apparent. The State says that it is seeking to prevent Maoists from brainwashing youth, professionals, and civil servants through front organisations. As in the proposed law, which is now awaiting the assent of the Governor before coming into force, the State government can declare any suspect “organisation” as an “unlawful organisation”. Offences under the proposed law include membership of such organisations, fundraising on their behalf, managing or assisting them, and committing unlawful activities.The Bill’s focus is on people and organisations that act as a front for Maoists, and what is unlawful is so broadly defined that anyone can be its target. Among other things, according to the Bill, ‘unlawful’ is “any action taken by an individual or organization whether by committing an act or by words either spoken or written or by sign or by visible representation or otherwise, which constitute a danger or menace to public order, peace and tranquility”. Offences are cognisable and the accused can be arrested without a warrant. Punishment includes jail terms of two years to seven years, along with fines ranging from ₹2 lakh to ₹5 lakh. The State argues that Chhattisgarh, Telangana, Andhra Pradesh and Odisha have enacted Public Security Acts and banned 48 Naxal frontal organisations. The Opposition parties offered feeble resistance to the Bill and raised some broad concerns regarding its misuse but it was passed in the Assembly through a voice vote. As an afterthought, the Congress and the Shiv Sena (UBT) protested on the floor when it was taken up in the Legislative Council. The Bill had gone through a long deliberative process, but as it turns out, all parties appeared to be in agreement, barring the lone CPI (M) MLA who protested against it on the floor of the Assembly. The idea that thought and speech, howsoever unpalatable they might be to the ruling establishment, should be policed poses a grave danger for India as an open society.\r Published - July 24, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        laws\n                    \n                            /                      \n                        \n                        Maharashtra\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        Chhattisgarh\n                    \n                            /                      \n                        \n                        Telangana\n                    \n                            /                      \n                        \n                        Andhra Pradesh\n                    \n                            /                      \n                        \n                        Orissa\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        Shiv Sena-Uddhav Balasaheb Thackeray\n                    \n                            /                      \n                        \n                        security measures",
        "headline_1": "​Danger of thought: On the Maharashtra Special Public Security Bill",
        "headline_2": "The public security Bill endangers India as an open society",
        "link": "https://www.thehindu.com/opinion/editorial/danger-of-thought-on-the-maharashtra-special-public-security-bill/article69847157.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-07-2025"
    },
    {
        "full_article": "Last week’s violence in southern Syria, which saw the killing of hundreds from the Druze community, was a grave reminder of the country’s deep-rooted sectarian tensions, now ruled by a former Sunni jihadist. When the Hayat Tahrir al Sham (HTS), formerly an al-Qaeda affiliate, captured power in Syria in November 2024, its leader Ahmed al Sharaa (who until recently was known as Abu Mohammed al-Jolani) pledged to protect the rights of all communities. But the realities on the ground tell a different story. Syria is approximately 80% Sunni, with minorities including Alawites, Shias, Christians and Druze making up the rest. The ascent of the HTS triggered widespread anxiety among these groups. These fears were only reinforced when violence erupted against the Alawites, the sect of former President Bashar al-Assad, in March in the western coastal region. Hundreds were killed in days long attacks orchestrated by pro-government militias, most of them jihadists. It took only four months before the next atrocity unfolded — this time in Sweida, a Druze heartland in the south. Clashes initially broke out between Druze and local Bedouin members, which prompted Mr. Sharaa to send in security forces. What followed was a massacre.The sectarian violence escalated into a regional crisis after Israel began bombing Syrian government forces and military infrastructure in Sweida and Damascus. While Israel does have a Druze minority of its own, its claims of humanitarian intervention ring hollow in the context of its ongoing genocidal war on Gaza. Israel has long conducted strikes in Syria — earlier, its targets were Hezbollah and Mr. Assad’s troops. Now that the HTS is in power, Tel Aviv does not want a consolidated Syrian military presence near its border. These internal and external pressures have left Mr. Sharaa vulnerable. Syria, which witnessed coups and counter-coups in the 1950s and 1960s, achieved some stability under the secular Baathist rule in the 1970s. When the Baathist regime became a dynastic dictatorship, cracks began to emerge in the political and social consensus that Hafez al-Assad, Bashar’s father, had built, to culminate in a devastating civil war. The best chance for Mr. Sharaa to redeem himself and Syria was to rebuild a pluralistic state, with Kurds, Alawites, Christians and Druze enjoying equal rights. Instead, his push to establish a centralised Islamist regime in Damascus has deepened the sectarian wounds. And the HTS’s armed jihadists, who go on killing sprees against minority dissenters, are pushing the country towards disintegration. Unless Mr. Sharaa takes urgent steps to rein in his fighters and rebuild a national consensus, Syria risks descending deeper into chaos. Published - July 24, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Syria\n                    \n                            /                      \n                        \n                        minority group\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict",
        "headline_1": "Sectarian wounds: On the violence in Syria",
        "headline_2": "Syria under Islamists is at risk of falling into chaotic violence",
        "link": "https://www.thehindu.com/opinion/editorial/sectarian-wounds-on-the-violence-in-syria/article69846860.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-07-2025"
    },
    {
        "full_article": "What the fake embassy of a fake nation, next door to our capital, says about us & our sarkars\nHindustan in some ways is fakeistan. There are the standard fake iPhones and Guccis and Johnnie Walker , forged Jamini Roys and Labubus. Then there are the more exotic nakli GST notices and caste certificates. But a certain Harsh Vardhan Jain has taken the game to nexxxt level: Creating a fake nation. Out of a standard Ghaziabad rented house, he ran a very very freaky ‘West Arctic Embassy’. Until a UP police special task force busted it, this gentleman presented himself as ambassador of Saborga, Poulvia, Lodonia and other fictional micronations. The creativity of it all is really dazzling con-noisseurs.\nThey say a good conman doesn’t steal your money but convinces you to give it to him. On the big screen, that’s what we love about a Danny Ocean (Ocean’s Eleven) or a Frank Abagnale Jr (Catch Me If You Can). It’s not just that they’re dangerously charming but also that they’ve really cracked human psychology. You have to know people to fool people. No surprise then the ‘West Arctic ambassador’ has really set social media abuzz. Lionising comments like ‘Only respect’ and ‘India is not for beginners’ outnumber horrified ones. Lodonia has acquired its own fan club. It sounds no less enchanting than Narnia. The inventiveness is con-summate indeed.\nAll this applause also explains how such swindles flourish in India. Sure, goggling at those Audis and Mercs, with blue diplomatic looking number plates, is not complicity with the crime. The problem is that various authorities, evidently, share this quality of tolerance. Forged diplomatic passports and MEA stamps tell a bigger tale. That it takes an STF to tell a real embassy from a fabricated one is what’s con-sequential. The only thing about this that ain’t funny is the laxity of security that made the hoax possible. \n\n",
        "headline_1": "The talented Mr Lodonia",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-talented-mr-lodonia/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-07-2025"
    },
    {
        "full_article": "Attacks on immigrants in West & internal migrants in India extract big socio-economic costs\nIn one variation of the trolley dilemma, you can stop a runaway tram and save five lives by throwing a heavy man on the track, but almost nobody likes this solution. It’s because humans – despite all the gore in history – are not normally comfortable with violence. Yet, Charanpreet Singh was bashed up in Adelaide on Saturday evening. A few hours later, another Indian was brutally assaulted in Dublin. Both cases have the appearance of hate crime, which is a growing problem around the world.\nIt might not be the age of peak hate against foreigners because something like America’s Chinese Exclusion Act of 1882, which practically barred immigration from China for about 60 years, seems unthinkable today. But that could be the result of political correctness. Data from America – self-appointed guardian of democracy and liberal values – shows a 13% jump in hate crimes in the top 10 cities between 2022 and 2023. As Indians, we narrowly focus on attacks targeting Indians, whether in US, Canada, UK, Australia, or elsewhere, but other nationalities are equally targets of hate. In Jan, Nigeria issued an advisory for its citizens travelling to Australia. Let’s not forget that internal migrants in India are often targeted by goonish groups.\nIt is normal for people to be suspicious of the outsider – different in speech, appearance, garb, customs – and be reserved, but violence is hard to explain. What might trigger it? Toxic ideology was the culprit in Nazi Germany. Now, there are reactionary ideologues everywhere. Even Trump’s Maga push relies on the vilification of immigrants. But as economist Michael Martell points out in a paper, hate is not the way to achieve national greatness. In fact, it has enormous social and economic costs.\nMartell cites the 2012 shooting at a gurdwara in Wisconsin that left six dead. Not a high toll at first glance, but its cost to society quickly added up. The gurdwara upgraded its security. Alongside, mosques and Hindu temples took note of the attack and spent on better security systems. Terrorised immigrants curbed their movement, affecting local businesses. And this was just one case of hate crime among many. The cumulative cost of fatal and non-fatal hate crimes in US, in 2019, was estimated at $3.4bn.\nThe economic loss from all the hate crime around the world would be many times more. The social cost enormous. As a community leader in Dublin pointed out, immigrants are crucial for keeping services running. Even demographically young India needs Chinese manufacturing experts, and US needs Indian scientists and engineers. So, all countries – India included – must make an effort to dial down xenophobia. \n\n",
        "headline_1": "‘Us’ bashes ‘Them’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/us-bashes-them/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-07-2025"
    },
    {
        "full_article": "India and Iran converge again in Cambridge\nThe temptation was strawberries, but I savoured learning’s creamy layer. In 1998, I’d interviewed Richard Blurton — yes with an ‘l’ – when,  as director of British Museum’s South  Asian section, he’d brought ‘The Enduring Image’ exhibition to Mumbai. We reconnected 26 years later, at Malavika Banerjee’s ‘Kalam’ in Bhubaneswar, where he presented his latest tome, India: A History in Objects. On my recent trip to London, he said, ‘Do come to the Ancient India and Iran Trust (AIIT) garden party in Cambridge. There’ll be plenty of strawberries, cream and bubbly.’ He added, ‘You’ll meet its new Chair, Almut Hintze.’ Wow! Being appointed Zarthoshty Brothers Professor of Zoroastrianism at London’s SOAS had till then been the latest recognition of her long scholarship; she belonged to the august lineage of non-Zoroastrians dedicated to the study of my 3,000 year-old faith.  And there she was in person – and so personable. \nIn a very English way, a patron’s generous bequest was exclusively meant for this garden at 23 Brooklands Avenue. It had come along with the house bought by Sir Harold Bailey, Cambridge Professor of Sanskrit and the other four founding Trustees who had dug as deep into the study of South and Southeast Asia — some physically too, having doubled as archaeologists. The Trust was established in 1978 to ‘promote the study of  prehistory, archaeology, art history and ancient languages of South & Southeast Asia, Central Asia and Iran –but it has gone beyond. \nIf journalism is history ‘To go’, scholarship is history ‘on the slow’. My goosebumps rose as I padded through rooms bringing alive Zoroastrianism’s lifelong researchers such as Mary Boyce and John Hinnells. Their personal libraries were among AIIT’s precious trove of  30,000 volumes and 20,000 records. All being safely digitised. \nThe Bridget Allchin Archive included photographs of everything  displayed in the Kabul Museum in the early 1950s; priceless because it was trashed in Afghan’s civil war. India Room’s mantelpiece displayed a celebrated quartet of Burmese bronze figurines from another founding-Trustee collection,  that of the Dutch van Lohuizen couple, Joan and Jan. It captured men cracking open a coconut,  playing a flute, and two, 17 cm high, engrossed in the rattan-ball game of chinlone, which I learnt was deeply embedded in Burmese cultural history. \nA month later Richard was to address London bankers. Whhyy? He explained. “In today’s world anyone operating internationally is at a disadvantage without an understanding of  the fundamentals on which South Asian society is built. This is increasingly important since more and more people of South Asian origin, especially Indian, are at the summit of commercial, financial, academic and political activity; this understanding we try to deliver at the British Museum.”  \nGood to hear authoritative, non-bigoted lips proclaim our past and present greatness.\n                                       ***\nAlec Smart said: “Train blasts: Was justice derailed?”\n\n",
        "headline_1": "Strawberries and scholarship",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/strawberries-and-scholarship/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-07-2025"
    },
    {
        "full_article": "The sudden resignation of Vice President Jagdeep Dhankhar is, arguably, the first highprofile exit from high constitutional office in recent times. It’s likely to embarrass Modi govt unless it has credible explanations to offer for Dhankhar’s action. While the latter said that he was resigning for health reasons and to “abide by medical advice”, few people are buying this, especially as the resignation came on ther first day of the monsoon session of Parliament. The fact that Congress is now asking for Dhankhar to stay, when it has all along been critical of his conduct of Rajya Sabha, suggests that the opposition has gained one more issue with which to corner govt.\nRead more on TOI+ \n\n",
        "headline_1": "The Dhankhar Dhamaka",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-dhankhar-dhamaka/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 24, 2025 12:00:00  \nThe presence of a large number of unbanked people in a country is indicative of their little or no financial inclusivity. They either have no regular income or if they have, it is too paltry for saving in a bank account. The World Bank's Global Findex Database has been focusing on financial inclusion of people all across the world since 2011. The purpose is to track how people in different countries access, use and interact with financial services starting from digital payments to borrowing, saving and account ownership. This year's Global Findex report highlights regional disparity as well as yawning gaps within segments of society including gender discrepancy. It is indeed a poor commentary on Asia and some countries in Africa that more than half of the world's adults have no financial accounts and they are concentrated in just eight countries of those regions. \nWell, two most populous countries India and China find themselves in the bracket of those eight countries. So do Bangladesh, Pakistan and Indonesia ---all of which have quite large populations after India and China. Egypt and Nigeria from Africa and Mexico from North America complete the list. What is significant here is that these economies are large with China and India leading the pack not only in size but also in their economic growth. When just eight countries are home to 53 per cent of the world's total unbanked people, it suggests some problem with not just social discrimination on the fringe but also maldistribution of wealth and financial services. Of course, in countries like Bangladesh, where informal economy governed by black money or unaccounted-for economy is thought to be larger than the formal, the transactions often remain traceless. Question does not arise about the marginal and poor people holding bank accounts. \nSo, it is clear that economy can be large and yet backward unless financial inclusion expands to the maximum number of people. This is further highlighted by the fact that some people in Bangladesh suspect of income from dubious sources maintain 30 to 40 accounts with banks. The Anti-Corruption Commission has found a large number of such people whose bank accounts have been frozen. On the other hand, it certainly is a problem with the majority of market economy where a large number of people find themselves unemployed or they earn only a pittance leaving no margin for saving. \nSure enough, financial literacy for maintaining bank accounts or digital transactions is a must. That 78 per cent account holders in Bangladesh still make digital payments is quite satisfying. Credit certainly goes to financial services like bKash which have significant penetration in rural areas. Village people can now avail of the opportunity to receive remittance at home. But still the economy of not only Bangladesh but also those of the South Asian nations have a long way to go before they reach a stage where financial inclusion will be on a par with that of modern economies. The number one challenge is to digitise the economy to such an extent where informal or black economy finds no space for operation. This done, the income of the exchequer will also rise to a reasonable level eliminating the need for making deficit budgets.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Unbanked people present economic malaise",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/unbanked-people-present-economic-malaise-1753288462",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       July 24, 2025 00:00:00  \nBangladesh is not at war, nor does it wish to engage in any conflict in the foreseeable future. However, with the drumbeat of war growing increasingly louder across the globe and several nations bearing the brunt of foreign aggression, Chief Adviser Muhammad Yunus, speaking at the Bangladesh Air Force's annual exercise programme last April, warned that not getting prepared for war would be suicidal.\nLess than three months later, the country faced a war-like situation on Monday afternoon. The primary students of Milestone School and College in Uttara were preparing to leave the school for the day. They gathered in the school corridor. Just then, a fighter jet, out of nowhere and without any warning, rammed directly into the school building, engulfing it in a ball of flame.\nIn a split second, the school's joyous atmosphere, filled with laughter and chatter of innocent children, turned into a living inferno, a scene of unspeakable horror. At least 25 children were burned to death on the spot, 171 were injured and are now fighting for their lives in hospitals, and some guardians are still desperately searching for the whereabouts of their beloved ones. \nThe death of so many blooming children in a single incident is unprecedented in the country's history. The entire country is shocked and heartbroken as media sites are replete with agonising photos and video footage of the innocent victims' ordeal. The images of their lifeless bodies, the wails of bereaved parents and the scattered, blood-stained shoes, school bags, and ID cards of the little ones at the crash site evoke a chilling resemblance to tragedies in war-torn countries. One particularly shocking video shows a severely burned child, with his clothes and even hair completely burned off, limping down the street in desperation. These shocking and sickening scenes will haunt the collective memory of the nation for years to come. But more importantly, who is responsible for this grave tragedy? How to console the bereaved parents who have lost the apple of their eye?\nReturning to the CA's comment on war preparation - yes, not getting prepared for war may be suicidal, but in a tragic twist of irony, the very act of preparation turned out to be suicidal. It wasn't a foreign fighter jet that struck the school, but one piloted by a trainee from our own Air Force. So, is this how we prepare for a war by killing our own children?\nAccidents may occur due to human error, technical faults, or unavoidable circumstances at any moment. But some questions naturally pop up concerning the accident. Inter Services Public Relations (ISPR) said that the FT-7 BGI fighter aircraft of the Bangladesh Air Force (BAF) crash-landed due to a mechanical failure shortly after take-off from BAF Base in Kurmitola, and that the pilot had tried to steer the plane towards a less-populated area.\nBut the question is, why did the BAF choose to conduct fighter jet training over such a densely populated area, when it could have been carried out in remote char areas, in coastal regions? Conducting fighter jet training over densely populated Dhaka is tantamount to gross negligence and a clear violation of safety regulations, especially given that crash landings of BAF training aircraft and fighter jets are not uncommon. FT-7 BGI fighter jets have crashed multiple times in recent years. The previous incidents received little attention because they occurred in remote areas with minimal casualties. This time, it caused a massive tragedy in the heart of the capital. \nDhaka, as one of the world's most densely populated cities, is already prone to a host of dangers like fire, road accidents, building collapse and so on. Now, if dangers descend from the sky, where would the city dwellers go?\nThe tragedy appears more painful when it is realised that a forewarning had been given about the dangers of using the civilian runway of Hazrat Shahjalal International Airport (HSIA) for military training purposes. The FT-7 BGI fighter jet travels at speeds nearly three times faster than commercial aircraft. Allowing such jets to operate on a civilian runway is not only a serious breach of safety protocols but also an open invitation to disaster.\nSpeaking to journalists, civil aviation experts have claimed that they have repeatedly warned both the BAF and HSIA authorities about the risks. But the authorities trivialised the warning and adopted no precautionary measures. As one expert lamented in Bangladesh, no action is taken until lives are lost.\nAdding to the problem is the unchecked urban sprawl and haphazard growth of high-rises around the airport. Milestone School and College's Uttara branch, for example, is located just three kilometers from the HSIA runway. There are regulations prohibiting the construction of establishments like schools, malls, or multi-storey buildings near airport approach paths. Yet, the area is dotted with high-rises where only one- or two-storey structures should exist, posing a serious threat to aviation safety.\nLast but not least, the catastrophe exposed a deep fault line in the country's air defence capabilities. The Chinese-made FT-7 BGI model of fighter jet is based on 1960s-era technology and had already gone out of production in 2013. Aviation websites describe them as relatively non-automated and risky. While the BAF fleet also includes a few Soviet-era MiG-29s, these second and third-generation aircraft has become obsolete in today's world of advanced stealth and radar systems. Their effectiveness in maintaining air safety is highly questionable, and using them for training purposes poses a mortal danger to both pilots and civilians alike. Therefore, as the nation mourns, it is also time for taking a hard look at the loopholes in air defense system and disaster preparedness, and demand accountability from those responsible.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why conducting flight training  over  populated areas?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-conducting-flight-training-over-populated-areas-1753284733",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Sameen Huq   |  \n       July 24, 2025 12:00:00  \nIt is no news that India has been hostile towards Bangladesh, politically or otherwise, since the fall of Sheikh Hasina's fascist government. The giant neighbour finds it hard to accept the ouster of a friend like Sheikh Hasina, who served its cause better than her own country. An enraged India has not only granted refuge to a fugitive dictator but also done everything to sour relations with a small neighbour; it has restricted the issuance of visas and movement of goods between the two countries through land and sea ports. Shipments of goods such as apparel and jute have become costlier because of the Indian actions.\nLately, the leaders of the largest South Asian nation, who during Hasina's regime used to rate the relations with Bangladesh as 'historic highs', have taken their hostility towards Bangladesh to the sports arena. \nIndia's cricket control board cancelled its scheduled tour of Bangladesh next month. Indian national team was supposed to play three ODIs and three T20Is. Two boards decided on the fixture last April. The matter did not end there. The Board of Control for Cricket in India (BCCI) has also informed the Asian Cricket Council (ACC), presently headed by Pakistan, that it would not attend the ACC Annual General Meeting scheduled for today (Thursday) in Dhaka. It had asked the ACC to shift the meeting to a neutral venue. This development puts the future of the forthcoming ACC T20 Cup in jeopardy.\nWith India abstaining, neither ACC T20 Cup matches, nor ACC AGM will be held as scheduled, for the country is regarded as a cricket superpower. Because of its financial might, it has been dictating terms in global cricket. The International Cricket Council (ICC) has become subservient to BCCI. There have been plenty of instances where the ICC gave in to Indian whims and indulged in discriminatory behaviour to other national teams, minnows being the worst victims.\n\nIt seems India will not be alone in boycotting the ACC Cup and ACC AGM. Full ACC members like Sri Lanka, Afghanistan and Oman and some associate members might follow suit, coming under Indian influence. Since holding of the ACC AGM is of crucial importance, an air of uncertainty is now there. \nAll-India Football Federation also withdrew from the SAFF U-20 Women's Championship, now in progress in Dhaka with four teams---Bangladesh, Bhutan, Nepal and Sri Lanka, citing no reason. The Indian boycott has also come according to a plan, it seems.\nThe rivalry between Pakistan and India in the cricket world is more or less a known fact. It is linked with the sour relations between the two South Asian nuclear powers since their birth. They have fought at least four small and big wars over Kashmir since 1947. Thus, national-level cricket matches between these two sworn enemies draw the attention of millions of cricket lovers across the world. The rivalry proves financially beneficial for both countries and also ICC. \nBut Bangladesh is not that sort of enemy for India. Except for a very insignificant border incursion at Padua some years back, there have been no military incidents along the border of the two countries. \nA change of government, either through ballot or in the wake of mass uprising is an internal matter of any country. And, there should be no reason for a neighbour or a distant country to be unhappy or angry over such a development. India itself should be ashamed that it has granted refuge to a dictator who ordered the killing of more than 1400 people, most of whom are students and children. In addition, several thousands of people received injuries. The plundering of national resources worth billions by her family members and top party leaders is now a proven fact. Why is India supporting these people? Why should it defend those thugs and sour relations with a next-door neighbour?\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bangladesh: A victim of Indian sports hegemony",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bangladesh-a-victim-of-indian-sports-hegemony-1753284798",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 24, 2025 00:00:00  \n\nThe recent Air Force jet crash at Milestone School and College in Uttara has left the nation mentally devastated. A Bangladesh Air Force FT-7 BGI fighter trainer lost control shortly after take-off and crashed into the school premises, killing at least 31 people-many of them children-and injuring more than 170, some critically. The destruction went far beyond shattered walls; it tore through families, classrooms, and the emotional core of an entire community.\nYet amid the widespread grief and outrage, one urgent issue remains largely unaddressed: the need for trauma and psychological support for the survivors and their families.\nTrauma does not end when the fire is put out. Parents who sent their children off to school, only to receive their lifeless bodies, are grappling with unimaginable sorrow. Students who saw their friends perish and teachers pulled from rubble will not forget those images. The psychological wounds are deep, long-lasting, and potentially devastating if left untreated.\nTrauma can manifest in many forms-post-traumatic stress disorder, anxiety, depression, survivor's guilt, and behavioural changes. These can affect a child's ability to learn or an adult's ability to function in daily life. This is not just a personal tragedy; it is a public mental health emergency.\nUnfortunately, mental health care in Bangladesh is still heavily stigmatised. Seeking therapy is often viewed as weakness. But grief counselling is as essential as physical first aid. It helps people process trauma, stabilise emotionally, and rebuild resilience. The families affected by the Uttara crash deserve easy, free access to psychological support. That support should begin at hospitals and continue into homes and schools. Child psychologists must lead long-term therapy programmes to help young students cope with the trauma.\nThe government and relevant authorities must act without delay. Professional trauma counsellors should be deployed in affected areas, psychological support integrated into burn unit care, and long-term mental health programmes initiated. These actions are not optional-they are necessary steps toward genuine recovery.\nBangladesh has always shown strength in the face of tragedy. But true resilience means caring not just for broken bodies but also for broken hearts. If we are to honour the memory of those we lost, we must protect the emotional well-being of those who remain. Only then can we begin to heal-fully and meaningfully.\nAishi Dastidar\nDhaka\naadastidar08@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Trauma support is vital for victims",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/trauma-support-is-vital-for-victims-1753284815",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-07-2025"
    }
]