[
    {
        "full_article": "The call at an all-party meeting chaired by Tamil Nadu Chief Minister M.K. Stalin, in Chennai on Wednesday (March 5, 2025), to freeze the strength of the Lok Sabha and State Assemblies for 30 years beyond 2026 might seem like pushing away a pressing problem into the distant future. The challenges in 2056, when delimitation is eventually taken up, could be far more complex than those of the last exercise, conducted after the Delimitation Commission was set up in 2002. Even if the northern States bring down the fertility rate to replacement level by that time, the grouse of the southern States, that seat share as a proportion of the total strength of the Lok Sabha will come down, will still not find redress. Moreover, the imbalance in the number of electors across constituencies varies in each State. Between 2004 (the last general election before the 2008 delimitation) and 2024, the country’s electorate has grown by approximately 45%. In just over 15 years, there has been significant malapportionment in many constituencies. In Karnataka, Bangalore North has 3.2 million voters, while Udupi Chikmagalur, with an electorate of just under 1.6 million, has less than half that number. One solution, doubtless a partial one, could be to allow delimitation within each State, but not across the country. This would be in keeping with federal principles but might be unfair to large States that have seen a huge, disproportionate population jump over the last 50 years.The concerns of the southern States regarding a potential unfair outcome are valid. There is a risk of losing significant representation in the Lok Sabha if population strictly governs seat allocation. However, the Constitution recognises that apportionment should be done “so far as practicable”, allowing room for considerations beyond mere numbers. Mr. Stalin has expressed apprehension that if the 2026 Census data is used as the basis for delimitation, and Tamil Nadu’s seat share is reduced, it would lead to “indelible injustice”. The all-party meeting rightly pointed out that Tamil Nadu is not opposed to delimitation per se, but that the process should not penalise progressive States (the entire southern region). Since delimitation has remained a contentious issue, the Union government should build a consensus on the terms of reference for the next Delimitation Commission. A transparent and inclusive approach can help restore the missing trust between the ruling party at the Centre and the non-BJP Opposition. Moreover, those advocating for an early delimitation should respect the Constitution’s federal character and demonstrate flexibility in addressing regional concerns. Published - March 07, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        parliament\n                    \n                            /                      \n                        \n                        Lok Sabha\n                    \n                            /                      \n                        \n                        Assembly Elections\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        General Elections 2024\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        population and census\n                    \n                            /                      \n                        \n                        Karnataka\n                    \n                            /                      \n                        \n                        Delimitation",
        "headline_1": "​Tyranny of numbers: On States and the issue of delimitation",
        "headline_2": "Federal principles and democratic impulses are in conflict over delimitation",
        "link": "https://www.thehindu.com/opinion/editorial/tyranny-of-numbers-on-states-and-the-issue-of-delimitation/article69298810.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "07-03-2025"
    },
    {
        "full_article": "President Donald Trump used the bully pulpit of his first joint address to Congress to emphasise, among other priorities, his administration’s intent to up the ante on the trade war that began with the U.S. slamming India, China, Canada and Mexico with tariffs of 25% or higher. Amidst walkouts by numerous Democratic lawmakers, he flagged his administration’s 100 executive orders and 400 executive actions to date as proof of his “swift and unrelenting action”, including on issues critical to American voters, such as reducing the cost of energy and “working tirelessly to end the savage conflict in Ukraine”. Early on in the speech, Mr. Trump underscored the U.S.’s withdrawal from the Paris climate accords, WHO and the U.N. Human Rights Council, even as he reiterated his administration’s commitment to the mantra of fossil fuel exploitation — “drill, baby, drill” — as the key approach to bringing down energy prices. He also railed against woke culture, specifically focusing on “getting men out of women’s sports,” as he had promised in his election campaign. In a hat tip to Elon Musk, the boss of the newly founded Department of Government Efficiency (DOGE), he claimed that the initiative had already “found hundreds of billions of dollars of fraud”. This was notwithstanding shockwaves reverberating across the world from funding cuts and firings at organisations such as USAID, involved in critical projects in numerous countries; and lawsuits aimed at blocking DOGE’s access to confidential government data.On the one hand, it is hardly surprising that Mr. Trump is pushing a conservative agenda, for example through his administration’s aggressive drive towards smaller government. On the other, there is a serious question of whether some of his second-term policies risk self-goals. Tariffs are a case in point, as independent economists have argued that higher import costs resulting from increased tariffs could lead importers to pass the economic burden onto consumers through higher prices, driving inflation, contrary to his economic promises. However, this warning has largely fallen on deaf ears among MAGA supporters. Similarly, there is a distinct possibility of the U.S. saving resources and materials of war if it “pauses” military support to Ukraine, yet this strategy does not apparently concern itself with the longer-term, possibly trans-Atlantic, consequences of signalling weakness of defence against Russian territorial ambitions looming over Europe. While the 2024 election revealed the depth of the partisan chasm between sections of American voters over crucial, emotive issues such as immigration, reproductive rights, and the economy, the tone and tenor of the second Trump administration does not instil confidence that this gap might be bridged in four years.\r Published - March 07, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        trade dispute\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Canada\n                    \n                            /                      \n                        \n                        Mexico\n                    \n                            /                      \n                        \n                        Paris Climate Summit COP21\n                    \n                            /                      \n                        \n                        United Nations\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        US PRESIDENTIAL POLLS\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        international relations",
        "headline_1": "​Unsettling plans: On Trump’s address to Congress and his policies",
        "headline_2": "Trump seems oblivious to the long-term consequences of his policies",
        "link": "https://www.thehindu.com/opinion/editorial/unsettling-plans-on-trumps-address-to-congress-and-his-policies/article69299259.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "07-03-2025"
    },
    {
        "full_article": "A journey through time and distance to a long ago and far away city\nLast week I went back to Calcutta, the city of the mind, in which I grew up, and which I still think of as home.\nThe journey, through time and distance, was effected by my going to a Bengali restaurant in Gurgaon with the apt name of Abar Khabo, I’ll eat again.\nI once read that home is the taste of the food of your childhood. Of all our senses perhaps that of taste is the most evocative of the past. Taste incorporates the senses of aromatic smell, appealing sight, tactile touch, and the sound of the satisfied sigh of a meal enjoyed.\nMy Calcutta of long ago and far away was resurrected in the tang of the mustard oil in which the food had been made, in the hint of coconut which gave the gravy a silky savour, the nose-tingling keenness of the kasundi, sharp as happy surprise.\nIt was a feast, in more ways than one. All around was exclamatory Bengali which, along with Urdu, is perhaps the most melodious of the many languages of the subcontinent and which, together with Kutchi, was the most spoken in our Calcutta home.\nPerched on the wall, its sound drowned in the sea of animated conversation, a small black-and-white TV played what looked like a Tollywood movie of the early 1960s.\nAnd was it my imagination or did I hear amid this excited vocalisation the bass lullaby of the wheels of the last tram of the night which would lull me to sleep in our flat on Chowringhee Road, the north-south axis around which revolved the world of the city which I knew?\nAnd could those be the strains of dulcet Robindrosangeet coming from a sleepy Sunday afternoon radio in Bhawanipur to the counterpoint of the faint sibilance of begoon bhaja frying for lunch?\nAnd, thanks to the diaspora, from Manhattan to Melbourne, from Bradford to Baltimore, in places such as this, in the ember glow of memory, dispelling the illusion of time and distance, Calcutta is reborn, phoenix arising.\n\n",
        "headline_1": "Calcutta homecoming",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/calcutta-homecoming/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-03-2025"
    },
    {
        "full_article": "Outdated bans, policies, data can mean both short-term injustices and long-term harm\nIn fashion, one person’s outdated style can be another’s top style. In etiquette, Baby Boomer rules like ‘speak only when you’re spoken to’ belong to a bygone era but needn’t cause active harm wherever they still prevail. But in so many other spheres, obsoleteness connotes painful wastefulness, or worse. Mohammed Shami has just reminded everyone that if rules made to combat Covid are unthinkingly preserved, it can be kinda unjust. Continued ban on using saliva to shine the cricket ball, long after the pandemic’s over, isn’t fair to pacers. Think broader: at a public policy level, outdated ideas inflict much more widespread injustices and other hurts.\nA delayed Census has left us with a huge outdated data problem, which compromises governance on several counts. Just consider food security. Different experts may stand in different places on how the use of 2011 Census data is shortchanging PDS claimants in 2025, but they all agree on the criticality of updating the national level demographic and economic data. Our food security policy also remains out of time with our nutritional security needs. For example, whether it is MSP or import duties, pulses still don’t get anything like the support enjoyed by rice, wheat and sugarcane. Sadly, the highest costs of continuing to fall behind on nutritional density will be paid by our children, not us.\nEven the master plans for our major cities are obsolete. This so wretchedly ruins our ability to tackle today’s infra challenges that our future planning often sounds delusional. Last but not the least are our outmoded laws. Marital rape has to be criminal in a society in which women have equal rights, yet it isn’t. Criminal defamation means egregious injuries to free speech, yet BNS hasn’t binned it. Personal liberties keep getting bowled out. Shami’s also getting hate for breaking ‘roza’, Muslims’ ritual fasting during Ramzan. Surely, it’s his choice? Bans, like moralising, make us fall further and further behind today’s needs. Let’s play like Shami instead, and keep up with the times.\n\n",
        "headline_1": "Pace it like Shami",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/pace-it-like-shami/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-03-2025"
    },
    {
        "full_article": "Most complex products are produced across countries. That’s why tariffs don’t benefit tariffers \nCowboy Trump shoots first, asks questions later. Mexico, Canada, China know this. Tariff bullets are whizzing India’s way also. But being trigger-happy has a downside – you sometimes shoot your amigos. So, just a day after enforcing 25% import duty on Mexican and Canadian goods, Trump announced concessions for cars after GM, Ford and Stellantis – the last owns Chrysler, Dodge and Jeep brands – appealed. Thanks to a Trump 1.0-era FTA, their car production is spread across all three countries. Components and finished cars move across freely, benefitting all. By pressing the tariff button, Trump 2.0 jeopardised production. Now, he’s given them a month’s breather, but China’s riled, and has retaliated with 10-15% tariffs on US farm products. That will hurt MAGA farmers – a ricochet wound. US soy, corn, beef, chicken will be costlier in China. Cotton also. But China fulfils a quarter of America’s apparel needs – costlier cotton means costlier tees. Plus, China’s declared it’s ready for “a tariff war, a trade war or any other type of war”. What if it makes its rare earths rarer for US firms?\nThere are no winners in a tariff war. America’s Smoot-Hawley Tariff Act of 1930 prolonged the Great Depression. And that was almost a century ago. Now, industrial production is much more integrated globally. Every complex product – phones and cars, of course, but also shirts – is part of a global value chain. OECD estimates that 70% of international trade involves global value chains. Raw materials, components and finished goods criss-cross borders repeatedly. Take Indian cars, for example. The vast majority are proudly made in India. But what does that mean? Is the complete car – every single component – made here? No. In 2023-24, India imported auto components worth $20.9bn. Things like automatic transmissions, sensors, chips and circuit boards are largely imported. Hit Germany, Thailand, China, etc with higher tariffs and your car gets costlier. India learnt this not too long ago while trying to promote phone production. Slapping high tariffs on phone components didn’t work, but reducing tariffs did. After all, you can’t make phones cheaply with costly parts.\nThe golden rule for cowboys – confirmed by Nobel-winning physicist Niels Bohr – is to never draw your gun first. Because, drawing takes longer than responding. About 10% longer. So the one who draws first is usually – to use Trump-style dissing – a loser.\n\n",
        "headline_1": "Don be a loser",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/don-be-a-loser/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-03-2025"
    },
    {
        "full_article": "By Pulkit Sharma\nAccording to The Lancet, around one billion people worldwide suffer from psychological difficulties and mental health concerns. Emotional distress has been a leading cause of global disease burden for the past two decades. Globally, we are seeing an increasing number of people grappling with fear, inertia, loneliness, hopelessness, helplessness and a lack of meaning in their lives. However scientific research reaffirms that speaking freely to someone about our deeply felt emotions is helpful.\nRecent neuro-imagining studies conducted at University of California observe that when people talk about their bottled-up feelings, their emotional reactivity decreases, and they feel calm and composed. This process helps them in understanding their feelings, modulating sweltering emotional intensity and taking away unwarranted sense of fear and stigma from them. As people talk freely about their emotions, they realise that what they are going through is quite normal, there are ways to deal with it and that it is certainly not end of the world.\n\nShort, crisp and abbreviated dialogues via smartphones have altered human communication to truncated and stilted fragments. Consequently, people feel clueless and hesitant to express themselves and end up suppressing disquiet, agony and pain. But these stubborn negative emotions keep pushing for expression and when this expression is denied, they create strong ripples inside our body and our mind, harming and sabotaging us in multiple ways. We feel tormented and take twisted routes to express these emotions often in the form of depression, self-destructive behaviours, physical diseases, suicidal tendencies, addictions, violence or aggression. In other words, unexplained chaos that we often see in our physical bodies, intrapsychic spaces, interpersonal world and social relationships can be easily traced to these repressed and unmetabolised emotions. To work through this chaos, reclaim our health and bring back positivity in our lives, we must learn to deal with our negative emotions in a constructive manner.\nBetween the two extremes of suppressing our emotions and unleashing them in a raw manner, there is a third choice that we often forget – speaking our heart out. Chandogya Upanishad explains that our heart is meant to serve as a bridge between external reality and our inner divinity. “Go into the cave and you find treasures of heaven. The sun, moon, stars, space, clouds, lightning and rains – all these miracles of creation are within man’s heart. When it rains outside, it rains inside also, and stellar regions shine resplendently within the heart of man.” But we can find the pathway to these luminous zones only when our heart is released from suffocating grip of emotional turmoil.\nOtherwise, we will continue to see the darkness, feel it, identify with it and believe that darkness is our true nature. Therefore, let us learn to express our bottled-up emotions freely in words, in benign presence of someone whom we trust, so that our pain heals, and our heart feels liberated to travel once again to its primordial and eternal state of bliss.\n\n",
        "headline_1": "Talking out our negative emotions",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/talking-out-our-negative-emotions/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-03-2025"
    },
    {
        "full_article": "For any crime or breakdown in law and order, law enforcement is naturally the first to be held accountable. It falls upon police and other security forces now active on the ground to prevent and bring to book those involved in mugging, robbery, rape, extortion, etc. Curbing mob violence is also their responsibility. That such violence has reached an alarming level of late—with at least 119 people killed and 74 injured in 114 mob incidents since August, according to the Human Rights Support Society—is largely due to weak policing. However, placing sole focus or responsibility on security forces risks overlooking the role played by other influential actors in the surge of crimes.\nThose getting involved in mob violence, often fuelled by righteous indignation, are partly enabled by the support they receive from a section of social media influencers, the relative silence of political, social, and religious leaders, and the general instability in the country. If we analyse the pattern of some recent incidents—such as the hostile mobilisation at the Shahbagh police station demanding the release of an alleged sexual harasser, or the fallout of alleged public smoking by two women at Lalmatia—the prevailing mentality seems to support, strange as it may seem, both rule of law and frequent exceptions to it, provided they align with the notion of justice held by a certain majoritarian group in society. That the home adviser has survived the metaphorical guillotine (calls for his resignation) after his controversial remark on the Lalmatia incident is likely due to the right-wing support behind such incidents. This situation is further exacerbated by the lack of legal consequences for those taking the law into their own hands.\nOf course, righteous indignation or frustration with inadequate judicial mechanisms is not the only motivation behind the formation of mobs. While previously the key reasons included suspicions of theft, robbery, or mugging, after the political changeover on August 5, there have been reports of many opportunistic or politically vengeful mobilisations as well. Think of the mob that stormed a Gulshan flat allegedly linked to Awami League leader HT Imam over a rumour of a secret stash inside, or the two Iranians allegedly robbed of cash and mobile phones in Bashundhara Residential Area. More often than not, such mobilisations led to tragic consequences. Along with deaths in the most brutal fashion, mob beatings have often made for horrifying headlines—the eyes of a victim being gouged out in Bhola, two individuals being beaten and hung upside down in Dhaka's Uttara. The list goes on.\nWhile the government insists that there is no room for mob justice or moral policing in the country, the fact is, its relative inaction has only served to embolden such acts. The effect has transcended mob violence—with clashes, political repression, harassment of women and children, suppression of freedom of expression, and all sorts of crimes being reported across the country. Under these charged circumstances, we urge all stakeholders in post-uprising Bangladesh to help restore the rule of law. That means everyone doing their part as they should—police taking prompt and stern action, political parties disciplining their unruly members, community/religious leaders preventing mob formations, and social media influencers promoting unity rather than division. Leaders and influencers, in particular, must refrain from bellicose rhetoric that only destabilises our society. \n",
        "headline_1": "Police alone cannot take on violent mobs",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/police-alone-cannot-take-violent-mobs-3841251",
        "news_paper_name": "The Daily Star",
        "publish_date": "07-03-2025"
    },
    {
        "full_article": "The Bangladesh Mahila Parishad reports the following for January 2025 alone: 85 girls and 120 women were subjected to torture in Bangladesh, among whom 67—including 42 minors—were raped. Fourteen minors were gang-raped, one girl was murdered after rape, and two more survived attempted rape. In February, 72 girls and 117 women were subjected to similar kinds of violence.\nFor all the ways, Bangladeshis remain divided—by class, language, religion, and political ideology. But there is one shared, unshakable truth that unites us: our misogynistic attitude towards women. It is so normalised that it moves seamlessly across political parties, economic classes, and generational divides.\nIn its most recent manifestation, we saw two young women, who were smoking at a tea stall, being berated, surrounded, and physically assaulted by a group of men. Asked about that event, Home Affairs Adviser Lt Gen (retd) Md Jahangir Alam Chowdhury's reminder that smoking is banned for both men and women (read: smoking in public is banned for both men and women but only women will be beaten for it) served as an implicit endorsement of the assailants' attacks.   \nThe recently published United Nations (UN) fact-finding report related to July-August mass uprising in Bangladesh in 2024 found that there was systematic targeting of female protesters during the uprising that we so hoped would bring us freedom. Armed members of the Chhatra League, the student wing of Awami League, were reported to beat, grope, and threaten female protesters with rape, often in the presence of law enforcement. In detention, these women endured sexual harassment, inhumane treatment, and threats of sexual assault by members of police, the Directorate General of Forces Intelligence (DGFI), and the Rapid Action Battalion (Rab). The stigma surrounding sexual violence suggests that the true extent of these abuses is likely underreported. The Monsoon Revolution that we so hoped would bring us freedom, did not.\nMisogyny in Bangladesh is a thriving ecosystem, carefully cultivated and sustained by institutions and the society at large. Women are harassed in the name of culture, battered in the name of tradition, raped as a show of power, and silenced in the name of \"family honour.\" This ecosystem includes politicians who refuse to pass meaningful laws, law enforcement officials who laugh off reports of assault, judges who hand down lenient sentences, journalists who sensationalise or downplay reports of rape and harassment, teachers who tell girls to dress modestly to avoid trouble, and employers who refuse to hire women for certain roles because they might become \"distracted\" by marriage or children.\nIt also includes fathers who tell their daughters not to speak too loudly, aunties who warn against giving your daughters too much independence, uncles who make fun of sons who cherish their wives, men who joke about marital rape, sexualise women in everyday conversations, and neighbours, or passengers in buses, who look the other way when screams pierce the night. \nAlso, the glorification of toxic masculinity, the locker room talk and the \"men will be men\" remarks, lawmakers who speak in circles about \"protecting women\" while drafting policies that strip them of autonomy, and religious leaders who weave divine authority into systemic oppression.\nAnd it is not just Bangladesh. Misogyny is a global phenomenon—built into the laws of nations, cultures, institutions, belief systems, and the unspoken rules of daily life. It thrives in parliaments and prayer halls, in corporate boardrooms and community gatherings, and in the way justice is served and denied. In the US, a woman's right to control her own body is under attack with the overturning of Roe v. Wade. In Afghanistan, women have slowly been disappearing from public spaces; there is also a ban on secondary education for girls, barring 14 lakh girls from schooling. In France, Giselle Pelicott got drugged and raped by her husband and 50 other men, which her husband facilitated. In India, Moumita Debnath, a 31-year-old female doctor in Kolkata, was brutally raped and murdered at her workplace. In Kenya, Ugandan Olympic marathon runner Rebecca Cheptegei died after her boyfriend reportedly poured petrol over her and set her on fire. In Iran, the brutal crackdown on women who defy the country's mandatory hijab laws continues even after 19-year-old Mahsa Amini was beaten to death by Iran's morality police for showing hair. Bangladesh seems perfectly in tune with the rest of the world, at least in this regard.\nAt the risk of sounding like a broken feminist record, patriarchy is the oldest and most enduring system of oppression, morphing to fit each society's unique contours but never disappearing. Every political movement, every so-called revolution, every war has used women's bodies as battlegrounds. As Bangladesh navigates the crossroads it stands at, confronting its internal challenges and external perceptions, it is no surprise that what emerges most prominently in the threads weaving the \"new Bangladesh\" is the characteristic misogyny. So, whether it is an authoritarian regime clamping down on freedom or opposition parties using women's safety as political rhetoric, the violence never stops. As more and more cracks in the political and legal systems are exposed by political upheavals—some surprising, some not—the one thing that remains glaringly obvious and unsurprising is: there isn't, and never was, a time when women are truly safe. Possibly, there never will be.\nShagufe Hossain is a Bangladeshi advocate dedicated to justice, equity, and youth leadership based out of Canada.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "United in misogyny?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/united-misogyny-3841076",
        "news_paper_name": "The Daily Star",
        "publish_date": "07-03-2025"
    },
    {
        "full_article": "There was a time when world leaders were known for their policies and governance. Now, they're known for their one-liners. Once upon a respectable time, politics was a realm of great speeches, robust debates, and grand visions. Today? It's an endless stream of meme-worthy moments, savage clapbacks, and leaders who deliver zingers instead of solutions.\nIn the latest episode of When World Leaders Collide, Donald Trump and Volodymyr Zelenskyy sat down for what was supposed to be a diplomatic discussion that quickly turned into a masterclass in passive-aggressive exchanges. It was less of a high-stakes political meeting and more of a reality TV showdown, featuring one leader fighting for his country's survival and another fixated on optics.\nBecause, of course, of all the things to discuss—military aid, strategic alliances, Russia's ongoing aggression—a journalist at the meeting thought it was the perfect moment to ask, \"Why don't you wear a suit?\" Yes, in the middle of a conversation about a literal war, the focus shifted to Zelenskyy's attire. Because nothing says geopolitical awareness like a well-tailored blazer.\nZelenskyy's response? Iconic. \"I will wear a suit when this war is finished.\"\nMic. Drop. Internet won. \nAnd just like that, in one single line, he delivered a bigger statement than most politicians manage in entire speeches. Because let's be honest—what kind of question even is that? If Churchill had shown up to WWII meetings in his bathrobe, would anyone have cared? (Actually, they might have, but the man had a cigar and a war to win.)\nMeanwhile, Trump—never one to let a conversation be about anything other than himself—had already managed to turn the meeting into a spectacle. Before the suit saga, he accused Zelenskyy of \"gambling with World War Three.\" Because obviously, the leader of a country actively being invaded is the one \"gambling\" here. Not, say, the guy who keeps suggesting that Ukraine should just let Russia take what they want and be done with it.\nIt was a bizarre moment, but let's be honest—this is Trump we're talking about. This is the man who thinks diplomacy is a reality show and who once threatened nuclear war over Twitter. The idea that Ukraine should simply \"negotiate\" with Russia, as if Putin is a disgruntled hotel guest demanding a refund, is peak Trumpian logic.\nBut what makes the suit comment truly fascinating is how perfectly it encapsulates the state of modern politics. We're living in a world where aesthetics often \"trump\" (pun absolutely intended) actual substance. A leader can be in the middle of navigating one of the biggest conflicts of our time, and yet, what do people focus on? His outfit.\nImagine applying this same energy to other historical moments. \"Mr Mandela, why didn't you wear cufflinks while dismantling apartheid?\" \"Mr Lincoln, that top hat is nice, but could we see you in something a little more fitted?\" The absurdity of it is almost too much to process.\nZelenskyy, to his credit, handled it like a pro. He didn't roll his eyes. He didn't laugh. He didn't ask the journalist if they'd recently suffered a head injury. Instead, he gave the kind of response that reminds the world that some leaders have real priorities. He doesn't care about looking polished—he cares about winning a war.\nAnd that, right there, is why this meeting was such a perfect display of everything wrong with how we consume politics today. While Ukraine fights for survival, the US is having its own existential crisis about whether it even wants to care. The room was less about negotiations and more about optics—Zelenskyy standing as the exhausted, battle-hardened leader trying to keep his country alive, while Trump made it clear that his main concern was how this all played for him.\nAt the end of the day, it's not about suits. It's about who takes this war—and by extension, democracy itself—seriously. One leader left that meeting as a man fighting for his country's existence. The other left it trying to make himself the main character.\nAnd in the middle was this journalist who just wanted to know if Zelenskyy had considered upgrading his wardrobe.\nThe result? Politics is no longer about policies or governance—it's about performance. Leaders are now entertainers, their every move carefully curated for maximum virality. The more dramatic the statement, the better.\nThis isn't to say that politics hasn't always had its theatrics. But the difference is that now, the theatrics are the politics. We're no longer electing leaders; we're selecting the best main characters for the ongoing drama that is world affairs. And in this endless cycle of political entertainment, one thing is certain: if democracy ever collapses, at least we'll get a great headline out of it.\nAnd what do we, the audience, do? We engage. We react. We rank presidents based on their Twitter burns and roast politicians like they're contestants on The Great British Bake Off. We consume politics the same way we consume pop culture: fast, dramatic, and with minimal emotional commitment. One day it's global conflict; the next, we've moved on to Miley Cyrus' Grammy Arms.\nBarrister Noshin Nawal is an activist, feminist, and a columnist for The Daily Star. She can be reached at [email protected].\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Mic-drop moment in Oval Office ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/mic-drop-moment-oval-office-3840921",
        "news_paper_name": "The Daily Star",
        "publish_date": "07-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "VAT reform",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/vat-reform-1741274870",
        "news_paper_name": "The Financial Express",
        "publish_date": "07-03-2025"
    },
    {
        "full_article": "Labour  unrest ",
        "headline_1": "Labour laws fail to match global standard",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/labour-laws-fail-to-match-global-standard-1741274949",
        "news_paper_name": "The Financial Express",
        "publish_date": "07-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Technology varsities not up to reputation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/technology-varsities-not-up-to-reputation-1741275048",
        "news_paper_name": "The Financial Express",
        "publish_date": "07-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "When will rape epidemic end?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/when-will-rape-epidemic-end-1741275075",
        "news_paper_name": "The Financial Express",
        "publish_date": "07-03-2025"
    }
]