[
    {
        "full_article": "In a blow to the outlawed Communist Party of India (Maoist), its general secretary was killed in security operations in Chhattisgarh on Wednesday (May 21, 2025). The elimination of Namballa Keshav Rao, alias Basavaraju, is perhaps the biggest blow to the insurgents since the death of Cherukuri Rajkumar, the then CPI (Maoist) spokesperson in 2010, also in a security operation. Basavaraju, who had been the head of the party’s central military commission before becoming the general secretary in 2018, had masterminded several attacks against paramilitary and police forces. His rise within the CPI (Maoist) marked the insurgents’ reiteration of its militarist strategy, to continue their “protracted peoples’ war” as against the alternative of political struggle and agitations to achieve their aims. His death — a number of Maoist personnel have been killed in the last couple of years — represents the failure of this strategy. Home Minister Amit Shah has been on record to say that the government is keen to overcome the Maoist threat by 2026 and Basavaraju’s killing would suggest a major win. The fact that the Maoists had reportedly sought peace talks, even while continuing their armed struggle, calls into question whether the Maoist leaders and activists could have been apprehended rather than eliminated. The surrender of Maoist cadres in recent days is also a case in point. But it is also well understood that the senior Maoist cadre, with roots in the People’s War naxalite movement in united Andhra Pradesh, have shown little inclination to give up their armed struggle and such “encounters” are perhaps inevitable.In recent years, and according to the Maoists’ own admission, there has been a significant reduction in recruitment by the insurgents, with flagging support from the tribal population in south Chhattisgarh. Tribal youth, many of whom have experienced enormous suffering in the decades-long insurgency, are no longer inclined to adhere to the radical agenda of the Maoists. The group’s poor understanding of the Indian state and its complete rejection of the electoral process as a “mere facade” have found fewer takers in the forested areas that were hitherto inaccessible to the Indian government. With the government’s increased tribal welfare measures and outreach and its redoubled emphasis on defeating the guerilla warfare, the Maoists have seen an erosion of their limited military and support bases. With the death of senior leaders, the Maoist movement is surely gasping for survival, but the intensive security operations have also resulted in scores of tribal youth being killed. The government should use this situation to renew its call for peace talks to pressure the Maoists to abandon their armed struggle rather than continue the policy of “annihilation” as that could only engender fresh resentment among the tribal people.\r Published - May 24, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        security measures\n                    \n                            /                      \n                        \n                        tribals\n                    \n                            /                      \n                        \n                        Chhattisgarh\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        welfare",
        "headline_1": "​Decisive moment: On Chhattisgarh anti-Maoist operation",
        "headline_2": "Basavaraju’s killing could defang Maoists and serve as chance for peace",
        "link": "https://www.thehindu.com/opinion/editorial/decisive-moment-on-chhattisgarh-anti-naxal-operation/article69611465.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-05-2025"
    },
    {
        "full_article": "Civic life in the United States stands on multiple, strong and independent institutions in different fields. These institutions, whether constitutionality mandated or not, have a continuity, life and standing of their own, beyond particular individuals. They enable diversity and pluralism, and provide protection against arbitrary decisions by those in power. Ironically enough, U.S. President Donald Trump is intent on damaging its oldest and wealthiest educational institution — Harvard. After harassing the institution with investigations, orders to turn over records, and freezing funds and grants running to hundreds of millions of dollars, the U.S. government has said that Harvard cannot enrol foreign students in 2025-26. Some 6,800 international students, including more than 750 from India, constitute more than 27% of its current student strength. They will have to transfer to other institutions within the U.S. or leave, as per the government, which does not want any new international student there in 2025-26 either. The U.S. government has said that the student visa programme is a privilege that it has granted and Harvard “relies heavily” on foreign students to “build and maintain their substantial endowment”, which is said to run to over $55 billion. And it sees foreign student visas and tax-exempt status as weapons in its arsenal against Harvard.Across the world, the authoritarian’s playbook for pluralistic societies is to identify an enemy against whom a campaign is unleashed based on real and imagined grievances. The campaign keeps the “enemy” in a state of disarray, even turmoil, with long-term damage and a chilling effect. Though sullied by unsavoury links, from the Salem witch trials to Enron, Harvard attracts some of the brightest talent from across the world and trains them for leadership roles in their chosen fields. It represents liberalism and knowledge creation that advances globalisation. Mr. Trump’s working and middle class support base looks at Harvard as one among elitist vehicles of globalisation that have excluded them while promoting affirmative action for minorities, especially African-Americans. While lineage and family background of prospective students are a factor for Harvard, an extensive scholarship programme seeks to balance that. Harvard has said that it will go to court against the government’s move just as it sued the Trump administration for freezing government funds. While the courts may well stay the ban, the damage has been done not just to Harvard but also to the image of American higher education and democratic principles. It is damage that cannot be easily remedied. Published - May 24, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        university\n                    \n                            /                      \n                        \n                        higher education\n                    \n                            /                      \n                        \n                        students\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        democracy",
        "headline_1": "​Permanent damage: On the Trump administration and Harvard",
        "headline_2": "Trump administration’s attack on Harvard will have long-term impact",
        "link": "https://www.thehindu.com/opinion/editorial/permanent-damage-on-the-trump-administration-and-harvard/article69611442.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-05-2025"
    },
    {
        "full_article": "English serves India well in diplomacy & beyond\nOn a Sept night in 1983, the world almost came to an end. At a Soviet monitoring station 100km from Moscow, supercomputers flashed warnings about five incoming US ICBMs. It was a false alarm triggered by satellites misinterpreting reflected sunlight as missile flashes. But one man, Stanislov Petrov, kept his head and prevented MAD – mutually assured destruction. That incident, more than anything else, shows the dangers of misunderstandings.\nWhile Petrov was up against code, misunderstandings can arise even among same-language speakers, as happened at the battle of Imjin River near Seoul in 1951. British Brigadier Tom Brodie reported, “Things are a bit sticky, sir.” His American superior, Gen Robert H Soule, thought it was nothing serious and didn’t send reinforcements. Over 500 of the 600 British troops were captured.\nNew Diplomacy | It’s to avoid misunderstandings of any kind that India has formed delegations of experienced and articulate leaders from all parties for its post-Op Sindoor global outreach – GOI is earnest about this. The intent is to draw global attention to Pak-sponsored terrorism, and the first of these meetings happened in Japan and UAE on Thursday. Altogether 33 countries will be covered. After a display of India’s new security doctrine, this is a glimpse of its new diplomacy.\nRight Words | On a whirlwind tour of this magnitude, it’s important to get the messaging right the first time. That’s where the experience of delegates counts. What counts no less is the language employed. It has to be one with the least chance of being misunderstood globally. And while some Indian leaders will publicly disagree, everybody knows only English has that capacity – we must be earnest about promoting English. Modi himself switched to English in Madhubani, when he declared India’s intent to punish the perpetrators of Pahalgam.\nLingua Franca | There’s no disputing English’s paramountcy. True, within Europe, it’s only the sixth most common native language behind Russian, German, French, Turkish and Italian. Globally, it has 380mn native speakers – only 35mn more than Hindi. But 1.5bn people speak English worldwide, more than any other language. That means 1.1bn have made an effort to learn it as a second or third language. No other language comes close. Why? Because English’s so useful. It’s an official language in at least 55 countries; second placed French only in 29. It’s the lingua franca of diplomacy and business.\nSoft Power | But English’s soft power extends beyond its speakers. At the recently concluded Eurovision, Austria’s JJ won with an English song, Wasted Love. In the first 63 years of the contest, English songs won 46% of the time although a Briton has won only five times. Countries like Netherlands and Germany have very high English proficiency scores for a reason.\nTime For Inglish | Per the 2011 Census, over 10% of Indians spoke English. Even if the percentage hasn’t increased, that’s 140mn English speakers – twice the British population. It’s a strength we need to recognise, be proud of, and build further. By becoming a nation of confident English speakers, we won’t become any less Indian, just as English-speaking Germans aren’t less German. Language learning is not a zero-sum game. There’s much to gain by learning English, and nothing to lose.\n\n",
        "headline_1": "The importance of being earnest",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-importance-of-being-earnest/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-05-2025"
    },
    {
        "full_article": "How a Biden clique hid his mental incapacity\nIn 2020 Biden won the US presidential election. In 2024 he ran again, until the Democratic Party pushed him out of the race. Both times, defeating Trump was his campaign’s existential rationale. In their book Original Sin: President Biden’s Decline, Its Cover-up, and His Disastrous Choice to Run Again, CNN’s Jake Tapper and Axios’s Alex Thompson find that the ‘Biden theology’, instead of being an antithesis, itself embodies the narcissism, self-delusion and outright lying that Democrats accuse Trump of.\nRepublicans have been pointing to signs of Biden’s physical and cognitive decline for years, saying it made him unfit for the presidency. In public, Democrats dismissed all such doubts as pure partisanship. In private, it was an altogether different story.\nFor the world, the cover was blown by the Biden-Trump debate of June 2024. As David Plouffe, Obama’s celebrated 2008 campaign manager, put it, it was a DEFCON 1 moment, where two men only three years apart felt separated by thirty instead.\nThe Biden that the world gasped at this June night had been around, the book finds, since at least 2022. The one who doesn’t just forget names and lose his chain of thoughts in a way everyone does sometime or the other, but who looks to be suffering dementia or Alzheimer’s or something else neurological.\nAhead of the debate, George Clooney hosted the biggest ever Democratic fundraiser, raking in more than $30mn. But, ouch, when Biden hobbled over, with an aide guiding him by the arm, and another aide prompting, “You know George,” the president didn’t recognise the actor despite the millions and the movies.\nAt the D-day commemoration the same month, Macron witnessed Biden shuffling and forgetting, and said he was gêne on Biden’s behalf. Embarrassed. Some weeks later, a top Democrat met the First Couple privately, and found Jill having to complete Joe’s thoughts. “He was clearly not f***ing fine.”\nA private Biden family motto is, “Never call a fat person fat.” This cocooned them in a strange circle of groupthink. Everyone put their shoulder to scripting his public appearances heavily. This meant exhausting amounts of prep by staff, not to mention coaching by Spielberg. Even so, the hours during which Biden could put up an effective performance shortened. He grew heavily reliant on note cards even for private discussions, including cabinet meetings.\nHow did family and staff who hid this Biden from America justify it? One after another, they tell Jake and Alex that the fundamentals of the presidency are about making sound decisions, and there they thought Biden solid.\nBut not too many people saw him on a day-to-day basis, or unmediated by his closest advisors. The book calls this small group ‘the politburo’. They shielded him in every meeting, from all bad news. Most worryingly, if the president’s decisions were being elaborately influenced and shaped by the politburo, were they even his decisions?\nPlus, the presidency isn’t just about making decisions, the book underlines. It’s also about communicating the decisions to the public. Biden had slipped in talking to the American people, and also in listening to them. Nothing announced this as loudly as the walkback from his 2020 words: “Look, I view myself as a bridge, not as something else.”\nEmpathy is his superpower, the loyalists kept insisting. It’s what makes him the Anti-Trump. Yet, in the end, Bidenomics became about telling Americans what they were feeling about the economy was wrong.\nThe lessons of the book go beyond one man, one political party, one country. It remembers George Orwell saying, we are all capable of believing things that we know to be untrue for an indefinite time – but sooner or later the false belief bumps up against solid reality. Usually on a battlefield.\n\n",
        "headline_1": "Bad old Joe and his politburo",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/bad-old-joe-and-his-politburo/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-05-2025"
    },
    {
        "full_article": "Ten days ago, the nation was still absorbing events of Op Sindoor, ably briefed by two outstanding officers – Col Sofiya Qureshi and Wg Cmdr Vyomika Singh. Most felt a sense of collective pride. Some asked deeper questions. Professor Ali Khan Mahmudabad, an academic and historian, for instance, remarked on social media that while the military’s display of female leadership, from two different religions, was commendable, should “rightwing commentators” also critique mob lynching, hate speech, and illegal demolitions.\n\nRead full opinion on TOI+\n\n",
        "headline_1": "The problem with section 152",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/not-categorized/the-problem-with-section-152/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-05-2025"
    },
    {
        "full_article": "What’s the point of decolonising western university curriculums and museum collections when the colonial instinct is so deeply embedded in international political and policy processes it’s not even recognised for what it is? Three examples from the past few weeks:\nUS-Ukraine minerals deal that Ukrainian parliament recently ratified. The agreement seems to coerce an embattled country into paying for the privilege of its freedom. It’s broadly reminiscent of the arrangement France struck with Haiti in return for recognising its 1804 independence.\n\nRead full opinion on TOI+\n\n",
        "headline_1": "If they are going to be sahibs anyway…",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/if-they-are-going-to-be-sahibs-anyway/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-05-2025"
    },
    {
        "full_article": "At a time when chaos and uncertainty are gripping the nation—thanks to wave after wave of protests, ever-widening political divides, and, to cap it all off, striking reports of a potential resignation by a \"frustrated\" Dr Yunus—it may be tempting to dismiss their cumulative effects on citizens as mere trivia in the bigger scheme of things. But this is precisely where we must turn our attention, for ultimately, it is the only thing that truly matters. It is also the only reality that is clear amid the thickening smog of confusion that envelops us. True, we need to find a way to ensure that the aspirations of a new Bangladesh are preserved at all costs. But treating citizens' daily well-being as collateral damage in the pursuit of that future would not only be short-sighted, but also counterproductive.\nThis is what comes to mind after seeing Dhaka residents suffer through yet another agonising day on Thursday. From morning till late afternoon, large parts of the city including Shahbagh, Kakrail, Matsya Bhaban, Purana Paltan, Gulistan, Motijheel, Jatrabari, and other connected streets were choked with traffic, bringing life to a near standstill. This was largely due to various protests and political demonstrations, including by groups affiliated with BNP. The problem was further compounded by poor traffic management, waterlogging from scattered bouts of rainfall, dug-up roads left unrepaired by utility agencies, VIP movements, etc. As traffic stood still for hours, thousands were forced to walk through sludge-filled roads and broken pavements. Some, while talking to this daily, described the situation as a \"trap,\" with no way forward, backward, or out.\nIn recent days, the frequency of such protest-induced blockades at peak hours has left commuters quite exasperated, especially as rain and summer heat coalesced to increase their sufferings. The sufferings of the elderly and women, particularly those travelling alone or with children, have been even more severe. This situation can no longer be justified by paying homage to the right to protest, which, while an inalienable democratic right, cannot be allowed to infringe on the rights of so many others: the right to freedom of movement, right to access healthcare, right to work and livelihood, right to public safety, right to education, etc. Any protest, therefore, must be exercised responsibly, without turning citizens into hostages of political agendas and group interests.\nAfter about nine months of living in such a charged atmosphere, the question is no longer how we in Dhaka got here, but how much longer this can continue. Clearly, citizens have had enough of such disruptions. They need a break from the continued street chaos. We urge the government, political parties, and all other stakeholders of the July uprising to urgently collaborate to ensure that basic civic life is not held hostage by the unchecked protest politics.\n",
        "headline_1": "This is not how a city can survive",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/not-how-city-can-survive-3901516",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-05-2025"
    },
    {
        "full_article": "A disturbing paradox defines Bangladesh today. More and more reports of child sexual abuse are coming to light, yet those who are working to educate and inform about it are being silenced, even punished. This contradiction is not just illogical; it is a dangerous societal failure that demands urgent change. The case of Dr Tasnim Jara is a stark illustration of this backward approach. This medical professional was recently served a legal notice for allegedly spreading \"obscenity\" through her online health content. Her \"crime\" was putting her effort into openly discussing sexual health and the human body. With educators targeted, teenagers are left to learn about sexual and reproductive health from dodgy sources, including pornography, absorbing distorted ideas that degrade women and normalise violence. Without proper education about consent, boundaries, and respect, many grow up misinformed and desensitised, fuelling the rise of sexual violence, especially the peer-on-peer kind.\nA devastating fact is that, over the last 10 years, as many as 318 children were killed after being raped. What's especially alarming is the increasing involvement of juveniles as perpetrators. Recently, in Natore, an eight-year-old girl was raped and murdered by a group of boys aged 14-17 years, and a 25-year-old adult. According to police reports, the child was raped, strangled, and dumped in a nearby area. Her face was burnt with chemicals, a horrifying attempt to destroy evidence. In Chapainawabganj, a 13-year-old boy was accused of sexually assaulting a five-year-old girl on Eid day. The child had gone to a neighbour's house to play, where the assault took place. Last month, in Gopalganj, an 18-year-old allegedly raped a six-year-old girl by luring her to a garden with the promise of toys. \nThese cases reveal a disturbing pattern: children and teenagers are committing acts of extreme violence, often against peers or even younger victims. This is not just a criminal issue, but also a social failure rooted in our reluctance to teach the basics of consent, respect, and bodily integrity to our children. These children are growing up in a culture that denies them access to accurate sex education while bombarding them with harmful content online. Without the balance of comprehensive sex education and moral-religious guidance, we are leaving an entire generation vulnerable to misunderstanding, manipulation, and misbehaviour. \nThe absence of formal, age-appropriate sex education—along with a lack of values-based instructions—is leaving young people unprepared to understand their developing bodies, emotions, and moral responsibilities. Instead, many are turning to easily accessible pornography, peer myths, or social media where intimacy is often portrayed through a lens of violence, control, and dehumanisation. Comprehensive sex education equips young people with the knowledge to make informed choices, understand consent, and build healthy relationships. It addresses key issues like sexually transmitted infections (STIs), unplanned pregnancies, and gender respect.\nReluctance to seek medical help for sexual health problems is another major concern. The stigma surrounding sexual diseases, compounded by a lack of proper sex education, leads to many suffering in silence. People often hesitate to consult doctors, exacerbating their conditions. This is especially prevalent among individuals with STIs, who may avoid seeking treatment because they lack awareness of the importance of early intervention. Comprehensive sex education not only promotes healthier sexual practices but also encourages individuals to seek medical care without fear or shame, ensuring better outcomes for public health.\nBangladesh's Seventh Five-Year Plan (FY2016–FY2020) recognised the importance of sex education, aiming to expand access to reproductive health education and services. The plan called for curriculum reforms, adolescent-friendly health corners, and community involvement. Yet, poor implementation continues to leave a dangerous gap filled with myths and misinformation. First and foremost, comprehensive sex education has to be integrated into school curricula at every level, ensuring that young people learn about consent, bodily autonomy, healthy relationships, and reproductive health in an age-appropriate, factual, and respectful manner. This education must be complemented by values-based guidance, helping students develop a moral framework grounded in compassion, respect, and accountability.\nCountries such as the Netherlands, Sweden, and Canada have seen measurable success after adopting nationwide sex education policies. They report lower rates of sexual violence, teenage pregnancies, and STIs. Their approach is rooted in openness, science, and respect—principles that can and should guide Bangladesh's path forward. The government has recently taken some positive steps, such as proposing amendments to shorten investigation and trial periods for rape cases and mandating DNA evidence. A hotline has also been introduced to report violence. These are welcome initiatives, but they must be backed by comprehensive educational reforms to truly bring a change.\nGovernment campaigns are crucial to raising awareness and breaking the stigma that surrounds sexual health. Public health initiatives should focus on educating the masses about sexual diseases, preventive measures, and the importance of consulting medical professionals when necessary. The government must make a concerted effort to create an environment where individuals feel empowered to take control of their health and well-being.\nThe real obscenity lies not in the responsible teaching of health and consent, but in our continued failure to address the urgent need for sex education. By avoiding these conversations, we are allowing abuse and ignorance to thrive. If we keep turning away from the truth, the cycle of violence, shame, and misinformation will only continue. Bangladesh must choose education over silence, prevention over punishment, and dignity over shame. It's time to confront these issues head-on and ensure that every child has access to the knowledge, respect, and safety they deserve.\nRuhina Tabasshum Prome is research associate at Bangladesh Institute of Governance and Management (BIGM). She can be reached at [email protected]. \n\nSabila Binta Saif Sondhi is research associate at BIGM. She can be reached at [email protected].\nViews expressed in this article are the authors' own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Sex education is our best defence against child abuse",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/sex-education-our-best-defence-against-child-abuse-3901481",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-05-2025"
    },
    {
        "full_article": "\"Don't use Google\"—that was the warning in our time. When the internet was just beginning to spread its wings, teachers feared this new tool would lure us away from books and \"real\" learning. Ours was perhaps the last generation to straddle two eras: the analogue world of TV guides in newspapers and the digital age of streaming and smartphones.\nToday, the fear isn't about Google anymore. It's about AI, digital classrooms, and how technology is reshaping education. What is the future of learning in a world where AI evolves rapidly and knowledge is freely available online? Can digital education replace classrooms, or should it only support them?\nWhen it comes to education, we need clear guidelines to navigate these uncharted waters. Tools like ChatGPT offer possibilities, but we must decide how—and how much—to rely on them. Especially for children, we must distinguish what helps from what could harm. For students' sake, we must learn how to control technology, not let it control us.\nFor countries like ours, the digital divide is real. It's never just about buying tablets for online classes. We must think about every child—the one in a remote village, in a slum, and in a Dhaka apartment. If we are serious about equity, we must ask: is this the time to prioritise digital education? Is EdTech truly the best solution to deepening educational inequality?\nThe truth is, we don't know yet. But we must not ignore the reality of AI and EdTech entering our teaching-learning spaces. Students will use AI; teachers will, too. How do we ensure that we become more productive, creative, and efficient with AI, rather than lazier, more corrupt, and quick to cut corners?\nSoon, every educational institution will need AI experts, just as they need mental health professionals. We must consider AI training to inform us of the pros and cons in our educational and daily lives. We also need to listen to scholars studying AI and EdTech—like the stimulating work being done by Global South researchers on what it means to decolonise our thinking and perceptions in the age of AI, with all its embedded biases.\nLet's be honest. AI does hold potential—if used wisely. One powerful promise of AI is its ability to level the playing field. In a deeply unequal society, AI tools can offer students from less privileged backgrounds access to explanations, resources, and support they wouldn't otherwise get. A student in a rural school can now ask questions, practise problems, and receive feedback—all for free. AI won't erase inequality, but it can offer opportunity based on curiosity and ability, not just privilege.\nStill, we must brace ourselves. AI in the hands of someone unable to think critically is like handing a sharp knife to an unknowing child. And teaching someone to think critically isn't just about teaching someone new tricks—it's about helping them lead more meaningful lives.\nThe reality is that education is more than content delivery. A strong system must also be engaging. The popularity of digital platforms among students reflects real gaps in our traditional classrooms: gaps in excitement, motivation, and relevance. Until students enjoy learning and want to go to school—not just have to—we can't blame them for turning to the internet for what schools fail to provide. Yet, no matter how good online material is, education is more than learning facts. A classroom offers discussion, debate, and interaction, not just with teachers but with peers. A 10-minute video might teach you something. But it's not the same as being in a classroom.\nWith AI already popular and accessible, it's time to stop being in denial and accept that it's naive to say, \"Don't use AI\" and expect to be obeyed. If we embrace AI wisely—with rules, access, equity, and intention—we can harness its strengths without losing the essence of what education really is. In this new world, our challenge is not to resist change, but to shape it. To ask the right questions. To pause before we leap. To make sure that, in fixing education, we don't forget its purpose. Let's not forget that education is not just about what we learn; it's also about how we learn, whom we learn with, and the journey it takes us on.\nThe key is to stay critical and vigilant, but also realistic. We couldn't stop the internet from taking over our lives, and we won't stop AI either. The challenge is to figure out how to co-exist—and how to use these new tools for better, not worse. Learning where to draw the line remains the greatest lesson.\nDr Rubaiya Murshed is an education economist and assistant professor in the Department of Economics at the University of Dhaka.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Education in a world of AI",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/education-world-ai-3901336",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-05-2025"
    },
    {
        "full_article": "We commend the government's decision to create a fund to compensate victims of financial irregularities using the money and assets recovered from alleged embezzlers and money launderers. According to the Bangladesh Bank governor, frozen assets of the accused, including shares held in various banks and companies, will also be included in the fund. He further stated that substantial sums deposited in various banks by individuals under investigation or facing trial have already been seized, along with control of shares owned by fugitives and those facing charges. This suggests that the government has already begun to make some progress in recovering stolen assets, which is indeed encouraging.\nThe governor said the fund would be used in the public interest, with priority given to compensating victims—chiefly depositors harmed by financial irregularities. He also stated that it would be used to provide some relief to the poor. Although estimates vary regarding the amount of assets stolen and syphoned out of the country during the Awami League regime, the White Paper on the state of Bangladesh's economy indicates that Tk 28 lakh crore was laundered per year between 2009 and 2023, amounting to $234 billion. That is a staggering amount. For the government to stand any chance of recovering this money, or a substantial portion of it, it must act swiftly.\n\nWhile we are encouraged by the government's actions in locating and recovering stolen assets so far, much remains to be done. We urge the government to act swiftly and in close collaboration with foreign countries and institutions to ensure that most of the syphoned assets are recovered, those responsible are held accountable, and the victims receive justice.\nPreviously, the central bank governor himself acknowledged that the authorities were racing against time to recover the stolen billions, warning that the funds could vanish if not located quickly. More recently, while discussing the progress made by the joint investigation team into 10 business groups and the family of the ousted prime minister, he said new assets were still being discovered and investigated. In the meantime, cases have been filed based on the assets identified so far, and those assets have been seized, although the total value has not yet been disclosed.\nAccording to the chief adviser's press secretary, since the interim government took charge, immovable assets of the 10 business groups and Hasina's family—worth Tk 1,30,758 crore domestically and $164.03 million abroad—have been attached. Additionally, Tk 42,600 crore in movable properties has been frozen. It was further revealed that the central bank is working with foreign institutions through mutual legal assistance to recover laundered money. Even though the entire process—proving that the money was illicitly obtained and tracing it to specific individuals—is complex, there is a strong possibility that foreign countries will be able to assist us.\nWhile we are encouraged by the government's actions in locating and recovering stolen assets so far, much remains to be done. We urge the government to act swiftly and in close collaboration with foreign countries and institutions to ensure that most of the syphoned assets are recovered, those responsible are held accountable, and the victims receive justice.\n",
        "headline_1": "A promising start to financial justice for victims of scams ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/promising-start-financial-justice-victims-scams-3899061",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 24, 2025 00:00:00  \nThe official launching of the much-anticipated commercial operation of Starlink, as reported, will evidently contribute to creating a competitive market for the internet service providers in Bangladesh. It is for the first time that the Bangladesh Telecommunication Regulatory Commission (BTRC) has issued licence to a Non-Geostationary Orbit (NGSO) satellite internet service for its operation in the country. Starlink's NGSO satellites' signals reach the Earth faster and can provide a broader range of radio frequencies allowing for increased bandwidth and better data transfer speed. This internet service reportedly promises to offer unlimited data with speeds up to 300 Mbps (Megabits per second), a unit to measure the speed of data transfer. Compared to the existing broadband services in operation in Bangladesh, Starlink's would be, according to reports, more expensive with a one-time residential installation fee of Tk47,000 and a monthly subscription of Tk6,000 and Tk 4,200. So, considering the income level of common internet users in Bangladesh like students, researchers and freelancers, the service would hardly be affordable for them. \nThe question arises because Starlink's service is reportedly more suitable for users living in the countryside, remotely-placed areas including rugged terrains where the existing optical fibre infrastructure for broadband services has not reached. This undoubtedly gives this (Starlink) internet service a big advantage over those currently available in the urban areas. But in that case, considering the higher fees of Starlink service, its potential users in the underserved areas would obviously be at a disadvantage. The government would be required to take the cost issue into consideration while extending this high-speed, low-latency internet service to the country's remote areas. The government's financial support as well as arrangement for cheap credit from banks or financial services would be of help for students, self-earning women in online business and others operating in the countryside. \nThe government is reportedly also working to create a financial package to make Starlink available to those who would provide citizen service. To this end, the government is also learnt to have been planning to facilitate financing through microcredit authorities, financial organisations and banks. So far so good. Hopefully, Starlink's operation would not disrupt, but rather create a well-balanced ecosystem with the broadband infrastructures of the local internet service providers.\nOn the issue of data sovereignty, the special assistant to the Chief Adviser for the Ministry of Posts, Telecommunications and Information Technology, Faiz Ahmad Taiyeb, is learnt to have assured that all Starlink data traffic would be routed through local gateways (Internet Service Providers, ISPs) in compliance with the national regulations. That is only expected of a tech company, foreign or local, willing to invest and operate in the country and, especially when as important an issue as all the sensitive data of the nation is involved. In this case, more important is the people looking after the law than the abstract law itself. One might recall at this point how National Identity Card information was leaked to third parties from the Election Commission (EC)'s database. Given that the country does not have so enviable a record on data protection, it is important to ensure that sensitive data of the nation are always in safe hands. This is more so when a number of international tech giants are learnt to have expressed their interest to operate in Bangladesh.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bangladesh enters the era of high-speed internet",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bangladesh-enters-the-era-of-high-speed-internet-1748014404",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       May 24, 2025 00:00:00  \n\nIn Shamsuddin Abul Kalam's Path Jana Nai, Jonabali builds a road connecting a secluded, remote village to nearby towns, hoping it will lead to progress and prosperity. While the road does bring some financial stability to the villagers, it also introduces price hike, famine, corruption and disease. That, in essence, describes what is happening today with the advancement of technology. The rapid growth of digital services has indeed expanded convenience and access, but it has also opened the door for financial scams and digital frauds.\nUntil recently, financial scams were not part of the everyday Bangladeshi experience. People encountered them mainly through movies or television dramas, more as entertainment than reality. But how times have changed! Today, financial scams are so widespread that people from all walks of life regularly fall victim to them. The sophistication of these schemes has evolved just as rapidly as the technology itself. In the past, a typical scam might involve late-night phone calls from individuals pretending to be jinns -- supernatural beings in Islamic belief -- offering promises of miraculous wealth. Today's scammers are far more cunning. They not only speak persuasively but also access personal information from the databases of various organisations, making their schemes disturbingly convincing. \nOne of the most prevalent scams today is the government office scam. This typically involves a call from an individual claiming to represent a government department, often equipped with specific personal details about the recipient. For instance, a caller might know that an individual performed Hajj the previous year, information likely gleaned from a government database. This precision immediately instils a sense of legitimacy. The caller then fabricates a story, such as a government refund for Hajj expenses, and requests sensitive financial information like debit or credit card details or mobile financial service (MFS) account credentials, subsequently moving on to asking for OTP code. Similarly, fake social welfare office scams target beneficiaries of government safety nets and prey on vulnerable groups such as the elderly, widows, disabled persons and members of small ethnic communities. \nAnother common tactic involves simpler, yet equally effective, schemes targeting MFS users. A scammer waits at a bKash agent point, watches a transaction and notes the recipient's number and amount. Moments later, he calls the recipient, pretending to be the bKash agent, and claims the money was accidentally sent twice. He then requests an OTP supposedly sent to the recipient's phone to \"reverse\" the error. Honest individuals, unaware of such deceptions, often comply without suspicion. Thus, these scammers exploit human emotions, ranging from benevolent impulses to greed, desire and even hope.\nSo how can people avoid falling victim to financial scams? Frank Abagnale, a former con artist turned anti-fraud consultant whose life inspired the film Catch Me If You Can, once said all scams share either of two fundamental red flags. The first is an immediate demand for money or payment. The second is a direct request for sensitive personal information, such as date of birth, banking details or credit card numbers. Recognising these red flags is the first line of defence which may help individuals identify fraudulent attempts. \nAwareness campaigns, though necessary, have not been enough to shield people from the growing threat of financial scams. Banks and mobile financial services regularly send warnings to customers asking them not to reveal sensitive information like OTPs, PINs and passwords and card information. Yet these warnings, though well-intentioned, often fall short of providing real protection. Many users, particularly those without digital literacy, either disregard the warnings or do not fully grasp their implications.\nWhen victims do realise they've been scammed, many go to police stations to file general diaries, hoping for redress and the recovery of their lost money. The sheer volume of reported cases, coupled with the digital nature of these crimes, presents considerable challenges. Since digital scams require no physical proximity, a scammer can operate from hundreds of kilometres away. When a local police station traces a scammer's location to another district, pursuing them becomes logistically difficult. It requires additional time, travel, official authorisation and funds, all of which are typically in short supply.\nLegal loopholes further complicate the matter. Financial scams typically fall under clause 24 of the Cyber Security Act, 2023, which criminalises the misuse of digital tools to deceive or harm others. However, clause 52 of the same act categorises these offences as non-cognisable and bailable. In simple terms, this means the police cannot arrest suspects without a warrant, and even when arrests are made, scammers often secure bail to continue their illicit trade. This disheartens law enforcement agencies and emboldens criminals. Hence, many officers feel the effort just isn't worth it. The government has recently taken initiative to replace the Cyber Security Act, 2023 with the Cyber Security Ordinance, 2025. It remains to be seen whether the bailable and non-cognisable nature of scamming offences will be re-evaluated in the new ordinance.\nBeyond legal measures, prevention remains far more effective than post-crime investigations. Just as personal information is vulnerable to theft, so too is sensitive data stored in government databases. The government must take concrete steps to secure its databases and tighten access controls. It must also invest in digital forensics and cross-district law enforcement cooperation to enhance response capability. \nAbove all, the most powerful tool against financial scams is education. These scams thrive due to a lack of financial literacy and a naive engagement with technology. People need to be clearly informed about how scams operate, the warning signs to look out for, and how to verify the legitimacy of anyone requesting money or personal information. Understanding basic principles such as never sharing OTPs or knowing that government offices never ask for PINs can make a significant difference. Without such awareness, individuals will remain vulnerable and continue to fall into the same traps.\nshoeb434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The epidemic of financial scam",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-epidemic-of-financial-scam-1748014475",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       May 24, 2025 00:00:00  \n\nOptimism flickers defying the odds. With financial support from the World Bank, the interim government will introduce electric buses in Dhaka. If everything goes well, the capital city of Bangladesh will see green, clean public buses plying on roads from July 1 this year. Some 400 e-buses will be introduced gradually in a bid to reduce environmental pollution and ease the crisis of public transport in Dhaka. \nIn a city of terrible congestion coupled with unfit and dirty public buses, millions of daily commuters have to suffer terribly. Over the decades, making public transport efficient and commuter-friendly was not a priority for successive governments. Despite some measures taken during one and half decades of the now-ousted Hasina regime to improve public transport, the net outcome was disappointing. The measures were half-hearted, largely unplanned and mostly uncoordinated. Instead, allowing rent-seekers to control the public transport sector made things worse. From the circular bus to Nagar Poribahan service, all failed despite being welcomed by the regular passengers. \nAround two years ago, the previous regime also announced that the Bangladesh Road Transport Corporation (BRTC) would procure 100 e-buses along with 350 regular buses. It was also decided that the e-buses would start to ply in Dhaka by the end of 2023. Nothing happened after the announcement, and no e-bus has yet joined the public transport fleet. \nThe adoption of e-buses, also known as green buses, in urban transport fleets is growing worldwide. Starting in China, e-buses have already gained popularity in developed and some developing countries. As cities grapple with increasing pollution, greenhouse gas emissions, and congestion, e-buses offer a better solution for the future of transit systems where more people can choose public transport over private vehicles. \nA study conducted by the Asian Development Bank (ADB) showed that the Asia-Pacific electric bus market size was over US$ 26 billion in 2020, growing yearly. It also showed that in March 2022, only 30 electric buses were deployed by TransJakarta in Indonesia, with a plan to procure 10,000 e-buses by 2025. Malaysia announced a plan to convert 40 per cent of all public transport into electrically run or fuelled by CNG/LPG/biofuel by 2030. Singapore wants to make one in two public buses to be electric by 2030. India has also tried to enhance e-buses in major cities where Delhi is leading. In 2022, Delhi flagged off 97 e-buses, and the number already crossed 1,500. The Indian capital will gradually see more e-buses replacing existing diesel-run and CNG-driven public buses in the coming days. In January 2023, Pakistan's first e-bus service was introduced in Karachi. \nThough the move to introduce e-bus is the right step, there are several challenges to make the programme successful. Selection of the routes for operating the e-buses is critical. How the existing diesel-run buses will be phased out in these routes is another issue that needs to be addressed carefully. Whether or not the transport owner-workers associations will cooperate is also a matter of concern. It is almost impossible to ply e-buses on Dhaka's roads without these associations' support. Despite the political changeover, the associations have enough strength to foil any good move to discipline public transport in Dhaka. The leaders of the transport associations have created a severe barrier to plying the BRTC-run buses on different routes in the city and across the country.\nAgain, e-buses need dedicated charging stations. Due to space constraints in Dhaka, setting up an adequate number of charging stations will be another challenge. Well-maintained e-bus depots are also a must. Training the drivers will be, however, easier. Unruly and chaotic traffic on roads is likely to reduce the optimal mobility of e-buses. As there is no control over the growing number of para-transits like CNG-driven auto-rickshaws, motorcycles, battery-run rickshaws, and human-pulled rickshaws, rooms on main roads have shrunk for buses. \nNevertheless, the city of Dhaka needs e-buses for better mobility and less pollution. A civilised city cannot allow chaos and pollution to continue forever. So, it is a big challenge before the interim government to reduce traffic chaos and remove pollution-generating vehicles from the roads. Operating the e-buses will be a test case in this connection.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "E-bus in Dhaka",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/e-bus-in-dhaka-1748014533",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 24, 2025 00:00:00  \n\nThe rise of cryptocurrency is reshaping the global financial landscape, posing both challenges and opportunities for traditional banking institutions. Digital currencies like Bitcoin, Ethereum, and stablecoins operate on decentralised blockchain networks, allowing users to conduct transactions without intermediaries such as banks. This shift threatens the traditional banking model, which relies on centralised control over financial transactions.\nOne of the major impacts of cryptocurrency on banks is the reduction in transaction fees. Cross-border payments, which traditionally take days and involve high costs, can now be completed in minutes using cryptocurrencies. Additionally, decentralised finance (DeFi) platforms offer services like lending and borrowing without requiring a bank account, making financial services more accessible. These innovations are particularly beneficial in underserved regions, where access to traditional banking infrastructure is limited.\nHowever, the volatility of cryptocurrencies, regulatory concerns, and security risks pose significant challenges. Governments worldwide are working on policies to integrate cryptocurrencies into existing financial frameworks while addressing risks like fraud and money laundering. The lack of standardised regulations across countries further complicates global adoption and oversight.\nTo stay relevant, traditional banks are exploring blockchain technology and launching their own digital currencies. Instead of resisting change, collaboration between banks and crypto platforms could lead to a more efficient and inclusive financial system. Such partnerships could also foster innovation in payment systems, customer identity verification, and real-time settlement mechanisms. As the digital economy evolves, the coexistence of traditional banking and cryptocurrency seems inevitable, potentially leading to a hybrid financial ecosystem that combines the strengths of both worlds.\nNowrin Ahmmed\nBBA Department\nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Cryptocurrency and traditional banking",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/cryptocurrency-and-traditional-banking-1748014687",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-05-2025"
    }
]