[
    {
        "full_article": "India’s next decadal population census, initially delayed by the COVID-19 pandemic, is now scheduled to conclude by March 2027, after a further delay apparently fuelled by political motivations. The Census in 2021 did not take place as planned, thus impacting different aspects of governance, especially social security schemes for vulnerable populations that rely heavily on updated demographic data for effective and efficient delivery. For the first time, the Census will be digitally administered, enabling faster data gathering and easier accessibility for analysis, thereby allowing population-level data to be more dynamic. However, this technological adoption also heightens concerns regarding data theft and privacy. While the nature of the Census will evolve, transparency at all levels will be crucial to building public trust in the exercise. Preparations for this massive operation, which will reach every household, are underway, with more logistical details anticipated in the weeks ahead.India stands at a demographic crossroads, facing the challenges of growing populations of the young and the old alongside significant regional variations in key indicators. Fresh data from the Census can help address many issues. For the first time since 1931, caste categories will be enumerated. While more reliable data on the socio-economic standing of caste groups can inform development planning, the potential for further social segmentation makes caste enumeration a double-edged sword. A critical aspect of the upcoming Census is its link to the next delimitation of Lok Sabha and Assembly constituencies, which will redraw India’s electoral map. The Constitution mandates that the next inter-State delimitation be based on population figures from the first Census after 2026. The current distribution of Lok Sabha seats is based on the 1971 population spread. With the reference date for the Census set as March 1, 2027, for most of the country, this can pave the way for the next delimitation exercise. States that have experienced lower population growth in recent decades, particularly in the peninsular region, have expressed concern that their parliamentary representation will diminish if population becomes the sole criterion for redistribution. The Centre has yet to clarify its stance on this matter. With the Census now in motion, it is imperative for the Centre to engage with all stakeholders and build consensus on the sensitive issue of delimitation. Otherwise, the delay in the announcement of the Census will be taken to mean as an attempt to ensure that the ruling BJP benefits from the increased representation for the Hindi-speaking States. Published - June 06, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        population and census\n                    \n                            /                      \n                        \n                        social security\n                    \n                            /                      \n                        \n                        personal data collection\n                    \n                            /                      \n                        \n                        Right to Privacy\n                    \n                            /                      \n                        \n                        demography\n                    \n                            /                      \n                        \n                        Lok Sabha\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        Delimitation\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        language\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        senior citizens",
        "headline_1": "​Injustice in the delay: On the next Census",
        "headline_2": "The announcement of the Census is welcome, but the delay is unjust",
        "link": "https://www.thehindu.com/opinion/editorial/injustice-in-the-delay-on-the-next-census/article69661389.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "06-06-2025"
    },
    {
        "full_article": "In less than 24 hours, ecstasy turned into despair. Royal Challengers Bengaluru’s (RCB) maiden Indian Premier League (IPL) title, secured on Tuesday night (June 3, 2025) in Ahmedabad, triggered unabated joy and raucous celebrations in Bengaluru and the rest of Karnataka. However, by Wednesday evening (June 4, 2025), a thick shroud of grief hung over the southern metropolis as a ghastly stampede in and around RCB’s home ground, the M. Chinnaswamy Stadium, left 11 dead and more than 50 injured. The hallowed venue was hosting a felicitation event in honour of the victorious team while fans outside, desperate to get in, ended up as a heaving chaotic mass with many gasping for breath. Asphyxia was the primary cause of death besides injuries suffered in the stifling rush. Sport is often a tight pact between the performing athlete and the adoring fan; it triggers emotions, and in the case of the IPL, forges a connection between the franchise and a vast audience. RCB has always had a loyal fan base, and the IPL triumph was bound to attract followers running into lakhs, towards the Central Business District of M.G. Road, Brigade Road, Cubbon Road, Queens Road and KSCA Clubhouse Link Road. Karnataka Chief Minister Siddaramaiah admitted that the crowd was beyond expectations.However, to use a massive gathering as an explanation for an avoidable accident, is unacceptable. The multitude of fans near the Vidhana Soudha, the State legislature, from Wednesday morning (June 4, 2025) should have compelled the authorities to tighten crowd control protocols. RCB had proclaimed that there would be an open-bus parade, but the police clarified that it would not happen. With no access to the Vidhana Soudha where the Chief Minister felicitated the players, the frenzied gathering rushed towards the stadium for a glimpse of stars such as Virat Kohli. The rumours about the gates being open to the public, and the contradictory messages about entry by invitation only, exacerbated the crisis. As the venue was packed, gates were closed but fans tried to force their way in. Be it the Karnataka State Cricket Association’s (KSCA) security or police personnel, staffing was inadequate and a fatal climax was inevitable. The State Government, the RCB management, the KSCA and the BCCI have expressed their condolences while some have indulged in finger-pointing. The Chief Minister has announced that the Bengaluru Police Commissioner and all officials responsible for the jurisdiction where the stadium is have been suspended, pending an inquiry. There will also be a judicial inquiry. However, the grim truth is that the fan, who drives the commerce of every sport, is the last priority for administrators. Clear communication, effective policing and proper advance notice for an event of this scale are all essential or else, such tragedies might recur periodically. Published - June 06, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Indian Premier League\n                    \n                            /                      \n                        \n                        disaster and accident\n                    \n                            /                      \n                        \n                        bengaluru\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        people\n                    \n                            /                      \n                        \n                        police\n                    \n                            /                      \n                        \n                        Karnataka",
        "headline_1": "​Trampled over: On the RCB cup celebration and Bengaluru stampede",
        "headline_2": "Poor communication and bad policing led to the stampede in Bengaluru",
        "link": "https://www.thehindu.com/opinion/editorial/trampled-over-on-the-rcb-cup-celebration-stampede-in-bengaluru/article69661285.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "06-06-2025"
    },
    {
        "full_article": "Govt did well to address some of Ladakh’s concerns. Remaining issues must be resolved sensitively\nGOI did the right thing by introducing a new reservation and domicile policy for Ladakh. Guaranteeing 85% reservations for locals in govt jobs – excluding EWS category – will address local anxiety about high unemployment. It’s important to recall that Ladakhis have been peacefully pressing for their demands, in the best traditions of democracy. This was best exemplified by activist Sonam Wangchuk’s walk from Ladakh to Delhi and subsequent 16-day hunger strike last year. To its credit, govt did consult Ladakh’s civil society organisations before working out the new policies. However, key demands remain unfulfilled.\nLadakh’s demands stem from the fact that following nullification of Article 370 in 2019 that abrogated special status for the erstwhile state of Jammu & Kashmir – of which Ladakh was a part – the region was hived off and converted to a UT without a legislature. While initially welcomed – because Ladhakis often felt govts in Srinagar were biased against the region – the new setup was soon seen as inadequate in addressing key issues like unemployment, preservation of local culture, and protection of a fragile ecosystem.\nHence the demand for inclusion of Ladakh in the Sixth Schedule of the Constitution. It can’t be stressed enough that ecological conservation is central to Ladakh’s aspirations. The region is experiencing serious glacier retreat, with some glaciers like Parachik retreating by 12-20 metres per annum. Therefore, development here can’t happen the same way as in other regions. We have already seen the adverse impact of non-ecologically compliant infra projects in mountainous states. Also, Ladakh’s status as a border region with China and Pakistan brings additional security challenges. Ecology and security are joined at the hip here. Therefore, defence infra projects and people’s aspirations must be in harmony. People of Ladakh are our shield. Listen to them.\n\n",
        "headline_1": "Northern crown",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/northern-crown/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-06-2025"
    },
    {
        "full_article": "Why two HCs’ observations on freedom of expression make for troubling reading\nFreedom of expression is a precondition for democracy, and progress. Ideas are easily expressed through words, but sometimes more powerfully through art, as England-based street artist Banksy demonstrates frequently. India’s Constitution guarantees freedom of speech and expression, with reasonable restrictions. The key word is ‘reasonable’. However, two recent high court observations appear to strain the word.\nAt first glance, Calcutta HC’s remarks for social media content creator Sharmistha Panoli, and Karnataka HC’s rebuke to actor Kamal Hassan, seem indisputable. Panoli is in the dock for her alleged comments against a community, after Op Sindoor. Calcutta HC told her, “Look, we have freedom of speech, but that doesn’t mean you will go on to hurt others.” To Hassan, who has ruffled feathers by suggesting Kannada is an offshoot of Tamil, Karnataka HC said, “You may be Kamal Hassan or anybody, you cannot hurt the sentiments of the masses.”\nEffectively, both courts have said: take care your words don’t hurt others. If this sets a precedent, all conversation, discussion, debate in this country will need to be convivial. Speakers, writers, artists will need to err on the side of caution not to annoy their audience. Even then, the sword of causing hurt will hang over their heads. The safest thing would be to shut up. Freedom of speech and expression is a hard-earned modern right. Italian philosopher Giordano Bruno was burnt alive for propagating the idea of an infinite universe, which offended the Church. Galileo lived his last years under house arrest for holding the view that Earth revolves around the Sun. One person’s conviction is another’s heresy, that’s why making others’ “sentiments”, opinions and feelings the test of good/bad speech is the surest way to destroy free speech.\nSupreme Court recently took this view while deciding the Imran Pratapgarhi case. It said the effect of words “cannot be judged on the basis of the standards of people who always have a sense of insecurity or of those who always perceive criticism as a threat to their power or position” and “even if a large number of persons dislike the views expressed by another, the right of the person to express the views must be respected and protected.” Unpalatable or hostile words certainly vitiate the atmosphere, but the solution is not to pack commentators inside jails. SC has a better prescription: counter views with views. \n\n",
        "headline_1": "The bigger hurt",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-bigger-hurt/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-06-2025"
    },
    {
        "full_article": "Among the many things Indians and Italians have in common is a taste for the sweet life\nIn Torino, Italy, with its panoramic piazzas and its graciously galleried porticos, Bunny and I are once again struck by the many affinities shared between Indians and Italians.\nBoth are given to voicing their opinions, loudly and at length, on a wide variety of subjects, from the shenanigans of politicians, to the latest scandal, from what show is trending on TV, to the shocking price of everything, all this given expression to with eloquent gesticulation as much as verbalisation.\nIn Italy, as in India, family is the axis around which daily life revolves in a social intermingling that often involves the participation of three generations.\nThere is however, one thing in common where Italians outdo Indians, and that is in their shared love of La Dolce Vita, the sweet life.\nEverywhere we go, Bunny and I find ourselves surrounded by sweetness, manifested in myriad avatars. The showcase windows of cafes, bars, restaurants, display in seductive array, a mountainous munificence of cakes, pastries, tarts, confections oozing jam, chocolate, cream, and other sugary allurements.\nAnd, of course, there are the ubiquitous gelaterias, specialising in the Italian version of ice cream, with their towering, multicoloured, multi-flavoured, Alpine peaks of irresistible temptation.As a popular saying goes, a day without gelato is a day wasted.\nTypically, Italians begin the day with a breakfast of coffee, accompanied by a sweet croissant. Other meals, particularly la cena, or dinner, are incomplete without Dolci, the dessert course.\nDespite its sweet tooth, Italy doesn’t seem to have an obesity problem, unlike US or UK. This might be because the civic authorities have taken pains to ensure an almost total lack of public transport, even in Rome, the capital. This necessitates people having to walk or cycle everywhere to burn off excess calories.\nTrading on the Italian passion for the sugary, India should promote the export of its own wide range of confectionery – jalebis, barfis, laddoos, gulab jamuns, et al – to a welcoming Bella Italia.\nFor both parties, it would be a sweet deal, which more than mithais the aye.\n\n",
        "headline_1": "La Dolce Vita",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/la-dolce-vita/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-06-2025"
    },
    {
        "full_article": "As of yesterday, US has doubled its tariffs on steel and aluminium imports to 50%. It’s done this citing national security. This is quite ironic. After all, it’s shielding two of the world’s dirtiest industries, responsible for nearly 9% of global CO₂ emissions. And in doing so, it is violating established global trade rules. Read full story on TOI+\n\n",
        "headline_1": "GOI needs nerves of steel",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/goi-needs-nerves-of-steel/",
        "news_paper_name": "The Times of India",
        "publish_date": "06-06-2025"
    }
]