[
    {
        "full_article": "President Donald Trumpappears to have set the cat among the pigeons yet again so far as recent Indian foreign policy actions are concerned, this time with regard to an alleged assurance by Prime Minister Narendra Modi that India would halt its oil imports from Russia. Speaking at the White House, Mr. Trump said that Mr. Modi had assured him on Wednesday (October 15, 2025) that India “will not be buying oil from Russia... Now we’ve got to get China to do the same thing”. This utterance follows in the wake of a summer of heightened temperatures in the bilateral space, after multiple claims by Mr. Trump that he played a role in bringing Operation Sindoor to an abrupt halt, with a full and immediate ceasefire agreed only after “a long night of talks mediated by the United States”. India was quick to challenge the White House’s narrative, with a Ministry of Foreign Affairs spokesperson saying that he was unaware of a conversation between the leaders on the previous day, even if discussions were “ongoing” about deepening India’s energy cooperation with the U.S. Nevertheless, he did not unequivocally confirm or deny Mr. Trump’s assertion that India would be halting its purchases of Russian oil. A similar ‘soft denial’ approach seemed to be the chosen tack in the aftermath of Operation Sindoor.The quandary faced by Indian foreign policy strategists is that India is in a sensitive phase of bilateral engagement with the U.S., specifically regarding its hopes for bilateral trade deal in the nearer term and shared regional goals in the context of the rise of China, over the longer arc of the evolving balance of power in Asia. Additionally, Mr. Trump’s sheer chimerical nature, which is either the trait of an impulsive but popular leader on American soil, or the standard “art of the deal” playbook trait of a President seeking to bring global counterparts to the negotiating table, appears to be routinely frustrating South Block mandarins seeking predictability in their engagements with U.S. interlocutors. India may have found an appropriate response in avoiding knee-jerk public reactions to the sometimes outlandish claims of Mr. Trump. However, the bigger challenge for New Delhi is to clarify its global posture on issues such as the purchase of Russian oil in the context of Russian aggression in Ukraine. It would do well to remember that it is not so much the strident voices of the North Atlantic that matter as much as India’s hopes to be a true global power one day, and speak with the moral clarity that accompanies such a title. Published - October 18, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        imports\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        Donald Trump",
        "headline_1": "​Claim, counterclaim: On India and foreign policy",
        "headline_2": "India must speak out on world issues with moral clarity, not tactical ambiguity",
        "link": "https://www.thehindu.com/opinion/editorial/claim-counterclaim-on-india-and-foreign-policy/article70175673.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-10-2025"
    },
    {
        "full_article": "In a brazen admission, U.S. President Donald Trump has confirmed authorising covert CIA operations in Venezuela targeting the government of Nicolás Maduro. This escalation follows weeks of deadly strikes on boats in Caribbean waters, threatening to destabilise the region by violating fundamental principles of international law. The prospective actions fall under a grim historical pattern of actions by the CIA — the 1954 coup in Guatemala, the Bay of Pigs disaster in Cuba, the orchestration of the 1973 coup in Chile that resulted in President Salvador Allende’s death and the Contra wars in Nicaragua in the 1980s. Such interventions have led to catastrophic consequences such as decades of instability, democratic backsliding and authoritarian rule, leaving scars across Latin America. Mr. Maduro’s disputed election victory in 2024 has compounded his regime’s economic mismanagement which, combined with sanctions, has devastated Venezuela’s economy. In recent years, millions of Venezuelans have been forced to flee because of the crisis, with many undertaking perilous journeys through Colombia, the dreaded Darién Gap and Mexico to reach the U.S. The refugee influx has provided the Trump administration with ammunition to weaponise the immigration issue and to issue claims about Venezuelan drug trafficking to up the ante against the Chavistas, as the followers of former President Hugo Chávez are called. Mr Trump has repeatedly, without proof, characterised Mr. Maduro as a “narcoterrorist”, alleging that the country operates as a drug corridor, with criminal trafficking organisations under his control. This has been contradicted by the U.S. intelligence agencies, much to Mr. Trump’s disapproval, leading to consequences such as the firing of a National Intelligence Council director who refused to alter his assessment of the drug issue and the Maduro regime.It is not difficult to ascertain the true motive of the Trump administration — to control Venezuela’s massive petroleum reserves and substantial natural gas deposits. The fact that Caracas has maintained strong trading relations with Russia and China, and close ties with the U.S.’s bête noire, Cuba, also presents a geopolitical challenge to American hegemony in the region — this has also explained the hostility by preceding American administrations but none was as brazen as Mr Trump is. This is not to absolve the Maduro regime. Its authoritarian trajectory and manipulation of electoral processes deserve international censure. But acknowledging these failures does not justify illegal U.S. intervention. The international community must resist the Trump administration’s recourse to illegal and Cold War-era regime change policies and instead pursue diplomatic solutions that respect Venezuelan sovereignty while supporting its genuine democratic forces. Venezuela must determine its future without external intrusion.\r Published - October 18, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Venezuela\n                    \n                            /                      \n                        \n                        international law\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        espionage and intelligence\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        natural gas\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        diplomacy",
        "headline_1": "Blatant aggression: On the Trump administration and its Venezuela actions",
        "headline_2": "The Trump administration’s illegal intervention in Venezuela is built on false pretexts",
        "link": "https://www.thehindu.com/opinion/editorial/blatant-aggression-on-the-trump-administration-and-its-venezuela-actions/article70174882.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-10-2025"
    },
    {
        "full_article": "In an all-too-familiar headline, China’s ministry of commerce announced new and wide-ranging export controls on rare earth elements (REEs) and related technologies from December 1, 2025. The latest export controls on REEs have become a familiar move in its geopolitical playbook, designed to create short-term buzz ahead of high-stakes trade negotiations.\n\nOld hand: Beijing’s threats this time confirm its intention to negotiate\nHowever, this recurring tactic is quickly losing its potency. While the restrictions will cause immediate supply chain disruptions, they ultimately serve as a catalyst for the very thing Beijing wants to avoid: global diversification. Under Beijing’s new rules, foreign companies now need its approval to export any product containing more than 0.1% Chinese REEs or manufactured using their extraction technology. The ministry added five more REEs to its control list, bringing the total to 12. Moreover, applications from defence contractors will be denied outright, while semiconductor manufacturers face case-by-case reviews.\nThe timing is predictable. These restrictions give China negotiating leverage ahead of the Trump-Xi summit at the Asia-Pacific Economic Cooperation forum later this month. Beijing used the same playbook in June when it first imposed REE controls, only to negotiate a six-month deal with Trump that lifted restrictions in exchange for exemptions on Chinese student visas.\nHowever, the situation has changed since. The US is no longer caught flat-footed. In August, the department of defence took a 14.9% equity stake in MP Materials, the only operating rare earth mine in the Western Hemisphere, that aims to double processing capacity. The Pentagon is also funding Australian company Lynas to build a processing facility in Texas. These moves represent the first serious American effort to rebuild capacity since the 1990s.\nNumerous industries like automotive, electronics, and defence rely on a stable supply of Chinese REEs. China controls roughly 70% of global mining and nearly 90% of the refining and processing of these minerals. But this short-term pain is limited and negotiable. The US, for example, imported only $170 million in rare earths in 2024, down from $186 million in 2023. The India figures are even lower. More importantly, China has shown a willingness to negotiate.\nChina’s rare earth stranglehold was never inevitable. The country’s dominance is not because it possesses superior technology that cannot be replicated elsewhere, but through decades of govt subsidies and predatory pricing. When Western companies attempted alternative supply chains in the 2000s, state-subsidised dumping forced them into bankruptcy. But export restrictions eliminate that threat. Beijing cannot simultaneously restrict supply and flood markets with cheap REEs. Additionally, the underlying technology is neither new nor proprietary. Moreover, the technological landscape too is shifting away from rare earth dependence. Tesla has announced that its next-generation vehicle platform will eliminate rare-earth magnets completely. Toyota and European suppliers have demonstrated permanent magnets that replace half the heavy rare earth content with more abundant lanthanum and cerium.\nBy imposing such export controls, China accelerates all these trends. High prices incentivise substitution research. Supply uncertainty drives companies to qualify alternative suppliers. Each time Beijing plays the rare earth card, it burns credibility and pushes customers toward China+1 strategies.\nThe way forward? Impose countervailing duties against Chinese REEs to protect upcoming projects from predatory pricing. Establish joint stockpiles through multilateral frameworks like the Minerals Security Partnership. Accelerate recycling and substitution research. Urban mining from discarded electronics and motors can recover substantial volumes. Finally, promote friendshoring through equity investments in allied countries’ projects.\nIndia possesses an estimated 1.6 million tonnes of rare earth oxides (the world’s sixth-largest reserve). IREL is establishing a rare-earth permanent magnet plant in Visakhapatnam. The newly launched National Critical Mineral Mission provides the policy framework to accelerate these efforts. India’s lower demand provides a buffer during short-term disruptions. Yet that alone should not lead to complacency. India’s immediate priority should be to deregulate all parts of this supply chain, and fast-track approvals. Simplifying licensing for domestic exploration and mining, and funding exploration projects to reduce information asymmetry, will help. China has revealed the same card many times over. The first time caught the world off-guard. The nth time is simply confirmation that Beijing has no other leverage of comparable potency. The opportunity is for others to take.\n\n",
        "headline_1": "Beijing’s rare earth playbook is tired. It’s time India wrote its own",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/beijings-rare-earth-playbook-is-tired-its-time-india-wrote-its-own/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-10-2025"
    },
    {
        "full_article": "Thirty years of ‘Diwale Dulhania Le Jayenge’, the film that invited a subset of urbane women to ‘come fall in love’. My qualifications to trace its journey involve being an accidental chronicler of the economics and mathematics of Shah Rukh Khan and his female fans. For fifteen years, I thought I was interviewing women about how they saw Khan. Instead, I discovered how these women saw themselves and their frustrated attempts to find love and livelihoods.\n\nFiner minds than mine have dissected every inch of the film; there is thirty years of discourse out there. Stunning photographs of audiences at Maratha Mandir signal how the film continues to offer escape from the drudgery of daily life. For parts of the commentariat, the romance of Raj and Simran captures India’s enduring love affair with patriarchy and caste endogamy. After all, Simran can only marry Raj if her father approves. Raj prefers patriarchal permission games to the rebellion of elopement. Familial regulation of women’s bodily autonomy remains at the heart of the plot. None of the women in the film seem to have jobs beyond loving and caring for men. Simran writes great poetry but possesses no clear profession. Her girl gang and Europe trip looks fun, until a group of entitled boys crashes into it. Raj most certainly meshes harassment with wooing.\nThe film marks the beginning of elite Indians awkwardly managing the pretense of modernity. In post-liberalisation India, with candy floss and GDP growth in the air, here is the fusion of traditional rituals, wealth and retail consumption.\nSo, in its thirtieth year, what does DDLJ mean? I am not brave or foolish enough to make summary pronouncements on how most, or even many women feel about the film. DDLJ may be one movie, but each of us has experienced it in our own unique way. Some of my closest friends have grown up to be cynical about the love story. “He will grow old to be an unhelpful unsexy Uncle”, they say. They surmise that Simran would be better served by revolution than Raj. Others continue to prefer the promise of Raj’s wide-open arms and sanskari happy endings.\nFor some elite urban women like myself, the film is a reminder of the years spent in the captivity of romantic love, hoping to find the One. We were foolish and privileged when we watched DDLJ as teenagers; we are foolish and privileged in our forties. For women our age from the precariat, it was often the first film they recalled watching in a hall or a screening at home or their neighborhoods. Songs from the movie haunted my fieldwork across India; home-based women workers I surveyed had memorised the film’s beautiful soundtrack.\nAditya Chopra fashioned a new masculinity through Khan. He raced airplanes, cried beautiful tears, fasted for karwa chauth, broke Preeti’s heart, helped women with housework and sarees. In the second half of the film, Raj transforms into a man who performs emotional and care labour with elegance and elan. Dialogues were equally proportioned between men and women, a rare event in Hindi films.\nOne scene seemed to stir every fan I interviewed. It involved Simran’s mother remarking on how men would never sacrifice their well-being, while women were expected to give up their desires without complaint. She urges the young couple to run away. Simran is willing and raises this option repeatedly, Raj declines. So many women would wonder about Simran’s fate. If she gave up on Raj or gave up on the protection of her family home — where would she go? Would she risk an honour killing? Could she find safe housing? Could she afford to live on her own? Could she bear the loneliness of her revolt? Would the state or market offer credible protection?\nSince DDLJ’s release in 1995, the times have certainly changed for women, as has the economy. However, the binding constraints on Simran’s horizons remain the same. In 1994, 23% of urban women held paid jobs or were looking for work compared to 80% of urban men. In 2024, the gap remains significant — 76% urban men participated in the labour force compared to 28% women. Public space and the housing market remains odiously masculine. Rates of domestic violence suggest the home is deeply unsafe. Ten percent of our police force is female.\nA young home-based worker I followed, with a brief history of running away from home, insisted that elopement was the easier choice for men, more so when their families supported the match, as was the case in DDLJ. Since intimate violence was assumed as a fact of life, women would always need a safe place to escape. I heard the same explanation from a posh Rajput woman in an abusive marriage. Abandoning the family would make Simran’s ‘fall back’ position weak. Projecting their precarities onto the film’s couple, these women understood Raj as securing Simran a way home should their marriage fall apart. Where earlier all I saw was capitulation and conformity, I began to see bargains and trade-offs. I started to realise that the calculus of rebellion can look very different for women. There are days when a clumsy regressive Raj feels better than liberal men who find no greater joy than lecturing ladies without ever comprehending our bitter constraints.\nDDLJ marks three decades of women’s complicated relationship with their own freedom, the conformist compromises forced upon some, while happily chosen by others. But much like Simran’s mother, I’m impatient now. I have long given up on Raj, the belief that a handsome man can offer happiness. I prefer a political regime that prioritises liberating Simran to fall in love with her own possibilities. I long for the romance of public institutions that credibly care for women’s safety and safety nets. Raj can wait. Come fall in love with your freedom. Jee lete hai apni zindagi.\n\n",
        "headline_1": "DDLJ at 30: Why modern Simrans are giving up on Raj",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/ddlj-at-30-why-modern-simrans-are-giving-up-on-raj/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-10-2025"
    },
    {
        "full_article": "It has to head home. There’s no certainty US hostility against Indian talent will go away with Trump. India’s elite will have to demand & work towards building world-class universities here\nAvenues that once brought Indians to richer countries are shrinking as nations like the United States turn increasingly hostile to immigration. Is this a passing storm or the glimpse of a new era?\nRead full story on TOI+ \n\n",
        "headline_1": "Where’ll our brain train go?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/wherell-our-brain-train-go/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-10-2025"
    },
    {
        "full_article": "Obesity is not principally a result of India’s traditional staples of rice and roti, despite conclusions of a recent study. The key reason is consumption of ultra-processed foods\nICMR-INDIAB Survey-21 has triggered a national debate by linking India’s growing obesity to carbohydrate-heavy diets and by implication, to rice and roti as a source of refined carbs. The study’s findings have made headlines highlighting how these two staples ruin our health.\nRead full story on TOI+\n\n",
        "headline_1": "This Diwali…Here’s what to know about eating",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/this-diwaliheres-what-to-know-about-eating/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 19, 2025 12:00:00  \nThe sharp fall in the 2025 HSC and equivalent examinations pass rate to its lowest level in twenty years, though deeply distressing, seems to have been accepted by both educators and the public with a weary sense of inevitability. The overall pass rate of 58.83 per cent at this critical stage of education exposes deep cracks in education sector built up over years, if not decades. This decline has undeniably created a major challenge for the education system and a profound personal setback for the students who did not succeed. Nearly half a million students out of 1.25 million across 11 boards have found themselves on the wrong side of the result while the number of top scorers has been halved, dropping from 145,911 last year to 69,097 this year. Even among those who passed, many barely crossed the minimum threshold of 33 per cent in several subjects. While technically a pass, this marginal success reveals their lack of genuine understanding and sets students up for a difficult future, as they may find themselves on the back foot in their subsequent educational pursuits and careers due to this poor foundational result. \nThe immediate cause of this sharp decline appears to be a deliberate move away from the grade inflation of recent years, specifically the widespread awarding of \"grace marks\" that artificially boosted results and created a distorted perception of academic achievement. The pandemic era, with its abridged syllabuses and alternative assessment methods, created an artificial peak in performance, with pass rates soaring above 95 per cent and the number of top-grade recipients multiplying. This year's HSC results, the first under a new interim administration and the first to be conducted with full marks and duration since the pandemic without such compensatory measures, have simply pulled back the curtain on a reality long obscured by lenient practices. The fact that a similar drop occurred in the SSC examinations suggests a broader effort to recalibrate evaluation standards, however jarring the immediate outcome may be. \nEducation adviser Dr Chowdhury Rafiqul Abrar has rightly pointed out that years of inflated results have masked a real crisis in learning. Learning gaps begin at the primary level and widen over time, yet a culture developed where pass rates were seen as the ultimate indicator of success and the number of GPA-5 achievers as the sole measure of progress. The current results are a direct reflection of that misplaced emphasis. Teachers too must share part of the responsibility, particularly for poor classroom instruction and for routinely abandoning their classes to protest for various demands. Walkouts by teachers at primary, secondary and higher secondary levels have become routine as agitation for their higher pay, better benefits and nationalisation is perpetual. Right now, for instance, MPO-listed teachers are staging protests for housing and other allowances, disrupting classes in the process. However legitimate, these near-constant protests have inevitably taken a toll on both the quality and quantity of instruction and contributed to the learning deficit shown by the latest results. \nPolicymakers and educators must treat these results as a much-needed wake-up call. A passing grade should once again signify true readiness for the next stage of education, not merely the ability to clear a minimal bar. The national conversation must also move immediately from a narrow fixation on pass rates to the hard work of real learning and better teaching. Countries that have raised themselves through education did so by confronting failure, reforming policies and pursuing continuous improvement. Bangladesh must take the same path, ensuring that its education system not only meets the immediate needs of the job market but also keeps pace with the demands of a rapidly-changing world.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Hard lessons from 2025 HSC results",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/hard-lessons-from-2025-hsc-results-1760797289",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       October 19, 2025 00:00:00  \nThe multilateral trading system, under the framework of the World Trade Organization (WTO), has been facing a set of complex challenges in producing an optimal outcome over the last couple of years. Prolonged negotiations on various trade issues without any outcome have already disappointed many of the WTO members. The situation has now worsened due to the tariff war launched by United States (US) President Donald Trump in the beginning of the year. Trump's declared assault against the rule-based multilateralism has already made many wary of the future of the WTO. Nevertheless, there is also a move to keep the WTO functional through some reforms. One of the possible reforms is advancing the plurilateral trade negotiations.\nAs mentioned in this column last week, plurilateral negotiation is a system where like-minded countries join together to discuss, cooperate, and advance in areas of their common interests not yet addressed by the WTO. So, under a plurilateral agreement, only participating countries are subject to a new set of disciplines, and those unwilling to consider new disciplines in a trade policy area can stay out. \nAt present, almost all the members of the WTO are parties to at least one of 16 plurilateral agreements, which are under various stages of negotiations. Only 12 members of the WTO are not a party to any plurilateral talks. Among them, four are from South Asia (Bangladesh, India, Nepal, and Sri Lanka), which is interesting. Some may interpret this as the so-called common position of South Asia in the WTO, which was once considered relatively high but lacked a clear commitment. Instead, under the guise of the South Asian common position, it often becomes India's stance in multilateral trade negotiations, supported by some other countries in the region.\nSix years ago, this scribe was in Geneva to attend a week-long programme at the WTO. At that time, he had the opportunity to meet the then-Bangladesh Ambassador and Permanent Representative in Geneva. This scribe asked him whether Bangladesh should get involved in the plurilateral negotiations on e-commerce and other related issues, and what the country's actual position is in this regard. The reply, in written form, was that getting involved in any plurilateral talk depended on how much Bangladesh is aware of the challenges it faces and would face in future on a number of fronts. \"Based on that appreciation, it will be necessary to take positions that need to be articulated, defended with appropriate statistical and other basis,\" he added. \"Once that happens, it would be the question of whether to take part in the plurilaterals. For sure, when that moment comes, there will be more to deal with as others who are taking part, would have progressed.\"\nThe essence of the diplomat's answer is that the country is not well prepared to join any plurilateral talks. Six years later, it appears that the official position of Bangladesh is almost the same as reflected in the General Council of the WTO on February 17-18, 2025. A key agenda of the meeting was the inclusion of e-commerce and investment facilitation as plurilateral agreements in the WTO rule book. Around three-quarters of the members of the WTO have negotiated an investment facilitation deal, while around half of the members have joined the e-commerce agreement. Only a few countries, however, opposed the inclusion of these two agreements in Annexe 4 of the WTO agreement. These countries were Bangladesh, Brazil, Indonesia, Pakistan and Turkey. \nBrazil and Turkey did not technically object to the inclusion of the e-commerce deal in the WTO rule book but expressed their inability to support the latest version of the text. Bangladesh, Indonesia, and Pakistan clearly objected to the inclusion of the e-commerce plurilateral agreement in Annex 4. In the meeting, Bangladesh said that it was not ready to support using Annex 4 for the e-commerce initiative because it had not properly studied the impact. To become a part of the WTO framework, any plurilateral agreement has to be included in Annex 4 of the WTO agreement, which is officially titled the Marrakesh Agreement Establishing the World Trade Organization. For this, it is necessary to get approval of all the members of the WTO or at least not opposed by any member, as every member has a veto power. If a single member applies the veto or raises an objection to the inclusion of any deal or any move, it cannot be included. \nIndonesia and Pakistan did not oppose the inclusion of the investment facilitation agreement under Annex 4. Pakistan, like Bangladesh, however, added that it was not ready to support using Annex 4 for the e-commerce agreement because it needed to know more about how the provisions for reviewing the moratorium would relate to the separate extendable WTO-wide moratorium. (www.tradebetablog.wordpress.com, February 24, 2025)\nIt isn't easy to understand why Bangladesh took an open position against including the e-commerce plurilateral deal in the WTO framework instead of remaining silent. As the country does not join any plurilateral initiative, no such agreement will be binding for Bangladesh. Moreover, by arguing that it had 'not properly studied the impact' of the e-commerce plurilateral agreement, the country also exposed its weakness in following the many critical developments in international trade. By joining the plurilateral talks, it is possible to meticulously follow the developments centring the same and get a clear idea of what other countries think about the system. \nAs Bangladesh is set to strip off the Least Developed Country (LDC) category by the end of 2026, the country has to deal with several complex and new issues after the graduation. To deal with those issues, hectic preparation is necessary, and apparently, the country has been working on that for the last couple of years. \nNevertheless, there is a dearth in the country's capacity in international trade negotiations and homework on the complex dynamics of global trade. Over the decades, the governments did not take adequate measures to develop human resource in this regard despite getting international funds. Still there is no adequate support for those who want to improve their capacity on WTO-related issues and other areas of global trade. The activities of WTO wing of the commerce ministry face disruption due to frequent transfer of the officers. Bangladesh Tariff and Trade Commission (BTTC) has been suffering due to lack of sufficient budget and undue interference of the ministry. The need for capacity building is urgent, as demonstrated by Bangladesh's decision to refrain from joining any plurilateral talks.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why Bangladesh opts out  of plurilateral deals",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-bangladesh-opts-out-of-plurilateral-deals-1760797406",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       October 19, 2025 00:00:00  \nThe popular expectation that the present government would take more effective and determined measures than its predecessors to improve the business climate has largely been belied. The latest Business Climate Index (BBX) for FY2024-25, jointly prepared by the Metropolitan Chamber of Commerce and Industry (MCCI) and Policy Exchange Bangladesh (PEB), testifies to the fact that the country's business environment has shown no worthwhile improvement over the past year. On the contrary, conditions have deteriorated in several key areas.\nAccording to the survey, access to regulatory information, infrastructure facilities, labour regulations, trade facilitation, technology adoption, and environmental compliance have all worsened compared to the previous year. The overall BBX score stands at 59.69, up slightly from 58.75 in FY2023-24, but the marginal increase of less than one point offers little comfort. The report cites political instability, geopolitical tensions, rising production costs, high inflation, and increased bank lending rates as major drags on investment and business confidence.\nEven though the government managed to stabilise the economy to a large extent from the mess it inherited, it is evident that prolonged political uncertainty is undermining efforts to regain investors' confidence. What has compounded the crisis is rampant extortion, an alarming slide in law and order, mob lynching, robbery, and other crimes. In an atmosphere of fear and intimidation, no enterprise can thrive, and no one can feel secure. About the investment climate, the less said the better. Domestic and foreign investors will not be willing to sink their money into an economy that cannot provide a safety net and assurance of return on investments.\nAmid the bleak investment scenario, the World Bank's forecast of a 4.8 per cent GDP growth for fiscal year 2025-26 is reassuring. But it also underscored the challenges of slowdown in private investment and job creation, risks in the banking sector, and declining revenue collection.\nAnother major problem for investors is the steep rise in bank lending rates. A persistently tight monetary policy over the past three years, aimed at reining in inflation, has driven up the lending rate from the previous 9 per cent to around 16 per cent. This has significantly increased the cost of doing business.\nInvestors have complained that it is unimaginable for them to expect a profit margin of 16 per cent from their operations, so paying an equivalent or higher amount as interest on bank loans is simply unfeasible. Moreover, banks impose various hidden charges on loans, which effectively push the real interest rate up to 18-20 per cent. This abrupt hike in lending rates has become a thorn in the side of investors. One of the main reasons behind the closure of 182 garment factories over the past year is the hike in interest rates.\nMoreover, the prevailing liquidity crisis in banks is severely affecting the industry sector. Garment exporters often allege that although they have sufficient deposits in their accounts, including export proceeds, they cannot withdraw the money due to the liquidity crunch. As a result, many factories are struggling to pay workers' wages on time, leading to worker grievances and growing unrest.\nTo restore economic growth momentum, the government must stabilise the banking sector, reduce credit costs and regain investors' confidence. Banking sector reforms need to be expedited so that banks can extend proper support to businesses. By doing so, it will not only revive credit growth but also open new avenues for job creation and offer new hope.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "What is hurting the business climate?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/what-is-hurting-the-business-climate-1760797481",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 19, 2025 00:00:00  \n\nBlood, the vital essence of human life, symbolises the highest form of generosity - the act of saving another's life. Yet, this noble deed has been desecrated by unscrupulous syndicates who have turned blood donation into a deadly business. Recent revelations in Bangladesh about mixing saline into collected blood have exposed a shocking level of corruption that endangers countless lives.\nAccording to media reports, dishonest groups collect blood at a nominal price from slum dwellers and drug addicts, ignoring health risks and safety standards. They then mix normal saline with the collected blood to increase its volume, diluting its life-saving components like haemoglobin. \nOne such horrifying case was recently uncovered at a private blood bank in Savar, where authorities found bags of blood being mixed with saline. Similar illegal and unhygienic blood centres reportedly operate across Dhaka, posing grave risks to both donors and recipients. \nThis is not merely fraud; it is a crime against humanity. To end this deadly trade, strict legal action must be taken against those involved. The government should form a joint task force comprising health and law enforcement agencies to conduct regular inspections and ensure compliance. The licensing process for blood banks must also be made transparent and strictly enforced. \nSadia Islam Kasfia\nStudent, \nDepartment of Bengali,\n Jagannath University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Not all that is red is blood",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/not-all-that-is-red-is-blood-1760797498",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-10-2025"
    }
]