[
    {
        "full_article": "The number of Internet shutdowns in India was slightly lower in 2024 than in 2023, according to the Software Freedom Law Center (SLFC), India’s annual report. A separate report by the web rights advocacy, Access Now, shows that India continues to lead globally in the number of government-ordered Internet shutdowns. The Union government has maintained that mobile Internet shutdown is an indispensable instrument in the toolkit to control law and order situations. Most of the Internet use in India is mobile. A closer examination of the shutdowns imposed even over the last year reveals some disturbing data: 41 of the 84 shutdowns in India in 2024 were imposed during protests, compared to the 23 that were imposed for communal clashes. Five were even issued for cheating during examinations. In situations on the brink of violence where rapidly spreading disinformation may swerve out of control of the authorities, there may be a case for considering restrictions on communications. But no shutdown is without a cost — the delayed information regarding violence can also impede fast response. The Supreme Court of India recognised this when it ruled, in Anuradha Bhasin vs Union of India, that each shutdown must meet the tests of necessity and proportionality. Internet shutdown impedes people’s livelihoods, access to medical care and education. It is a blunt weapon and the least the government could do is to measure its impact and use it sparingly. The government has been urged on preparing such an assessment for years, but no headway has been made here.Even for those in favour of retaining shutdowns as a tool in the repertory of emergency policing, the process being followed is cause for alarm. Many a time, as Access Now and SFLC report, there is no valid order uploaded on government websites detailing the duration and the causes in detail, as required by the Telecommunications (Temporary Suspension of Services) Rules, 2024 and its preceding rules of 2017. Ideally, every shutdown should be followed by a sombre examination of whether it was necessary and what its deployment cost was. The ideal number of Internet shutdowns in any country is zero. It is especially troubling that 296 of them were imposed on millions around the world last year. India’s case shows that there is an urgent need for circumspection and restraint. The Internet shutdowns index is, after all, one of the indices in which India should not aspire to lead. Published - February 26, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        internet\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        mobile phones\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        religious conflict\n                    \n                            /                      \n                        \n                        test/examination\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        health\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        laws",
        "headline_1": "Blunt weapon: On Internet shutdowns",
        "headline_2": "India should end Net access curbs, especially when imposed without good reason",
        "link": "https://www.thehindu.com/opinion/editorial/blunt-weapon-on-internet-shutdowns/article69262680.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "26-02-2025"
    },
    {
        "full_article": "Recent human fatalities due to wild animal attacks, deep inside forests, in forest-fringed human habitations, and even within villages, have highlighted growing human-wildlife conflict in Kerala, where nearly 29% of the land is forested. With a dry spell and an unusually hot summer expected, urgent measures are needed to prevent further escalation of this conflict, which now has political, social, and environmental dimensions. The Kerala government is facing criticism for its perceived inability to manage wildlife. Groups such as the Kerala Independent Farmers’ Association (KIFA) and sections of the church advocate for culling wildlife, citing an alleged population boom. However, Forest Department data suggest otherwise. The wild elephant population, linked to 18% of human fatalities, has declined by 7%. Snakebites, responsible for 75% of wildlife-related deaths, have fallen from 113 in 2012 to 34 in 2023. Overall, human deaths from wildlife encounters have decreased from 146 in 2018 to 57 last year. Yet, this is no cause for complacency. A concerning trend is that many victims are from tribal communities, traditionally adept at coexisting with wildlife. The government should investigate this as part of its newly announced mission to document and assess the traditional knowledge of Kerala’s 36 tribal communities in tackling wildlife encounters.There are also several anthropogenic factors. Habitat fragmentation, particularly in elephant corridors such as Aralam Farm (Kannur) and Chinnakkanal (Idukki), has forced animals into human settlements. Unregulated tourism, cattle grazing near forests, encroachments, and food waste dumping on forest fringes further exacerbate the issue. Invasive plants (Senna spectabilis) and monoculture industrial plantations have also disrupted wildlife feeding patterns. In response, the Kerala government, in 2022, empowered local bodies to eliminate feral wild boars damaging farmland. Last year, the Cabinet classified human-wildlife conflict as a State-specific disaster, allowing the Disaster Management Authority to intervene. The government’s decision to emphasise participatory forest and wildlife management is a step in the right direction, given the extreme views propagated by some sections. The Forest Department has restored 5,031 hectares of natural forest and built ponds and check dams. However, restoring areas dominated by industrial plantations such as eucalyptus and acacia is a challenge. While solar fencing has shown some success, the ₹52-crore elephant-proof wall at Aralam, one of 12 conflict landscapes, remains incomplete. The State’s 10 missions to mitigate human-wildlife conflict must be prioritised. Given the region-specific nature of the problem, a multi-agency approach involving the Disaster Management, Revenue, Local Self-Government, Tribal Welfare, Agriculture, Health and Forest Departments is crucial to balancing human safety and sustainable wildlife management.\r Published - February 26, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        wildlife\n                    \n                            /                      \n                        \n                        social issue\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        forests\n                    \n                            /                      \n                        \n                        environmental issues\n                    \n                            /                      \n                        \n                        tribals\n                    \n                            /                      \n                        \n                        tourism\n                    \n                            /                      \n                        \n                        solar\n                    \n                            /                      \n                        \n                        local authority\n                    \n                            /                      \n                        \n                        government departments\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        safety of citizens\n                    \n                            /                      \n                        \n                        politics",
        "headline_1": "​Wild and safe: On growing human-wildlife conflict",
        "headline_2": "Habitat fragmentation has led to rise in human-wildlife conflict",
        "link": "https://www.thehindu.com/opinion/editorial/wild-and-safe-on-growing-human-wildlife-conflict/article69262701.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "26-02-2025"
    },
    {
        "full_article": "We urgently need to find out what makes our deported migrants so desperate to leave the country\nAs planeloads of our deported migrants land in the country a number of questions are being asked. Why are they handcuffed? Why are all the planes landing in Amritsar?\nBut the most important question has yet to be raised, let alone answered. Why did they risk and lose their life savings, and in some cases even their lives, in such do-or-die attempts to get out of our country, the world’s fastest-growing major economy and the world’s most populous democracy boasting a global soft power outreach from yoga and Ayurveda to Bollywood and bhangra rap?\nIncredible India is indeed incredible. And one of the more incredible things about it is that so many of its citizens will go to such dire lengths to get out of it, legally or otherwise. The wealthy do so by acquiring qualifications that will enable them to become foreign citizens. The poor, or the not-so-wealthy, try to do so through the dangerous route of illegal migration.\nUnemployment is one of the biggest problems facing the country, so the lack of jobs and ways of earning a livelihood would seem to be the most compelling reason.\nHowever, most of the deportees are from states like Punjab, Haryana, and Gujarat, billed as being among the most prosperous in the country. Many of the deportees reportedly paid agents sizeable sums, enough to start a small business or provide other means of self-employment.\nThis is the mystery of the illegal Indian migrant, the unknown Indian. The Indian who escapes India physically like a prisoner breaking out of jail, and yet carries along the mother country in heart and mind, in language, cultural custom, and caste and community identity.\nWe should discover from the returning migrants what made it so imperative for them to forsake their country and do so at such jeopardy. It’s through getting to know the mind of the unknown Indian that perhaps we’ll get to know what we don’t know about our country, or what we choose not to know about it, in an ignorance of complacent bliss. \n\n",
        "headline_1": "Unknown Indian",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/unknown-indian/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-02-2025"
    },
    {
        "full_article": "SC right to reverse oppn Bihar MLA’s expulsion for ‘parodying Nitish’. Best antidote to bad joke is a good joke\nThe top court’s judgment reversing the expulsion of a Bihar legislator is not just correct but also has a wider application. In 2024, an assembly ethics committee expelled RJD politician and opposition chief whip Sunil Kumar Singh from the chamber for allegedly imitating and parodying Bihar CM Nitish Kumar. SC ruled the decision to expel was “highly excessive and disproportionate”. Its observation that penalty is not a tool for “retribution” is relevant not just in the current judicial context, but across politics and govts.\nThat Singh stayed expelled for seven months was extraordinary. So long was his absence that Election Commission was even set to organise a bypoll for electing a new member. SC quashed this notification too. It also said Singh’s remarks were “abhorrent” and “unbecoming of a member of the council”. It’s true that crudity of a certain kind is increasingly popular in political discourse. The lowering of standards is evident from Parliament to assemblies. Grievously and genuinely offensive remarks, often far worse than those allegedly made by the Bihar MLA, are made in assemblies across the country, without an eyebrow raised. That’s why hardly any legislator has ever been pulled up for making the worst kind of remarks against women.\nLost in this sordid list, is the fact that wit is an art long lost in politics. From good-natured ribbing to sharp satire to hilarious takedowns, fellow politicians, cartoonists and caricaturists are expected to be unsparing of politicians. But now, there are too many holy cows countrywide – men and women politicians who get peeved or much worse when laughed at. Their responses range from jailing cartoonists to expelling legislators. Jokes, jibes and jabs should be part and parcel of netagiri. Surely a thick skin is a politician’s second nature. Instead of simply their girths expanding, politicians must try to expand their minds, to accommodate all manner of criticism, whatever form it may take. If it is crude, raise the bar. Get your comeback via a witty reply to an offensive remark. A good joke at the cost of your political rival is the sweetest revenge.\n\n",
        "headline_1": "Laughing matter",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/laughing-matter/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-02-2025"
    },
    {
        "full_article": "Heinous crimes by children underline the limits of adult understanding and control\nWordsworth was waxing far too poetic when he described childhood as “trailing clouds of glory”. Reality is more prosaic, even grim at times. Still, the idea of childhood as a special stage of being shielded from the challenges of grown-up life, continues to be elemental to modernity. Parents, teachers and govts are meant to devote all necessary resources to nurture children into health, happiness and a bright future. This task, as always, remains work in progress. But per one indicator, instead of progress, a particularly grievous regression may be underway. There is an uptick in serious crimes by minors, mostly teenagers under 18.\nDelhi, for example, reports around 40 murders by juveniles every month. There is an extreme level of brutality in several cases. Last year, a teenager was booked for stabbing a youth over 50 times and then dancing over his lifeless body. Violent robberies, shootings, stabbings, rapes, even gang rapes – minors committing such crimes regularly make the news across the country. The issue also receives a lot of attention from experts. Different stakeholders, including police, educationists, child mental health experts, are very much on the job of trying to understand what is going on, and how to find solutions. One oft-quoted gloss is that minors commit crimes because they think they will get lenient treatment from the law, and even the record of their crime will be erased. But surely this cannot suffice to explain why a minor carries out a heinous act, when most children and teenagers are repulsed by the very thought of it.\nThe fact is that all those who make the decisions about the lives of older children, do so with a lot of gaps in their knowledge. From early onset puberty to social media impacted brains, the changes underway are fundamental. Fixed frames of teenagedom at 13 and adulthood at 18 are inadequate. By the time adults figure out some slang usage, many new ones have replaced it. If that’s happening with language, how much more complex is whatever’s happening in teenage minds? Classically it is childhood that’s been the state of unknowing to the knowing of adulthood. But for many adults now, what and how teenagers think is unfathomable. \n\n",
        "headline_1": "Minor-ity report",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/minor-ity-report/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-02-2025"
    },
    {
        "full_article": "Selfless service is unaffected by results. It is like rays of the sun that serve the world by shining alike on all creation: grass, fields, birds, mankind; saint and sinner, rich and poor, strong and weak – wholly impervious to their attitude or reaction. It is of vital importance, however, that service, though utterly selfless, be guided by spiritual understanding, for even selfless service unintelligently handled often creates complications and chaos. To be a pure blessing to humanity, the most selfless act of service must be born of absolute understanding of life and governed by faultless wisdom.\n\nSelfless service consists of rendering service to others without thought of gain, reward, or result; it is free from the idea of placing others under obligation. One does not put him under obligation when serving a fellow human being in the spirit of spontaneous, selfless love. On the contrary, the one helped confers upon the helper the blessing of an opportunity to serve his true Self. There is complete disregard for one’s convenience or welfare in selfless service; it is characterised by absolute subjugation of one’s happiness – by unalloyed joy in sacrificing everything for the well-being of others. In selfless service, the comfort of others is one’s convenience, health, healing, happiness, and delight. By giving one’s life to others, one gains a glorious life for oneself. Sheltering others in one’s heart makes one inhabit theirs. An act of helpfulness, a word of comfort, the spontaneous warmth of selfless love, give to others what they greatly need. Their thoughts of gratitude and goodwill, the heightened surge of their spirit and the increased flow of God-love released by the selfless act bring to the giver infinitely more than he can ever give.\nFrom a spiritual point of view, the real danger in service lies more in the possibility of your rendering it from a false motive. If you render service to oblige a person and feel proud of doing it, you are doing spiritual harm to the recipient of your service and yourself. If, while serving, you take delight in it and develop pride in doing a good thing, you are getting attached to your act and thereby binding yourself. Hence, the way to remain free from karma is to stay comp letely detached in service. The consciousness that, ‘I am obliging someone’, is the first to occur during the process of serving; but it can be annulled by the contrary thought, ‘I am obliged by being given this opportunity of serving.’ This latter thought facilitates the attitude of detachment and secures freedom from bondage of actions. Service based upon comprehensive understanding is not only selfless and adjusted to the spiritual demands of the recipient but is rendered with complete detachment. Such a service takes the aspirant to the goal most rapidly.\nThe perfect master serves the whole universe out of finality of his infinite consciousness; those who serve the master or submit to his guidance share in his universal work.\nToday is Avatar Meher Baba’s 131st birth anniversary\n\n",
        "headline_1": "Perfect master serves the whole universe",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/perfect-master-serves-the-whole-universe/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-02-2025"
    },
    {
        "full_article": "Only yesterday, we criticised the home adviser's overly optimistic portrayal of the law and order situation, and now a report citing statistics on crimes—from government sources, no less—shows how far from \"satisfactory\" the situation really is. According to police data based on filed cases, incidents of murder, abduction, robbery, burglary, dacoity, and theft have all increased across the country in January this year, compared to the same month over the last five years. For instance, at least 294 murder cases were recorded in January 2025, up from 231 in the same month last year. Meanwhile, robbery cases rose to 171 in this January, compared to 114 in January 2024, while abduction cases rose to 105 compared to 51 last year.\nThis trend, fuelling public outrage and security concerns simultaneously, is anything but a sign of a normal situation. On what basis, then, did the home adviser draw his conclusions? Even the much-publicised Operation Devil Hunt, resulting in over 9,000 arrests since February 8, hasn't had the desired effect in restoring order or public confidence. While there is no denying that law enforcement activities have increased significantly of late, experts say that it is the rise in high-impact crimes—rather than overall crime rates—that most influences public perceptions of safety.\nFor instance, the multiple muggings reported in different parts of Dhaka on Sunday night or the robbery and sexual assault incident on a moving bus on February 17 have, understandably, tapped into anger accumulating over months resulting in an outburst of calls for the home adviser's resignation. True, social media can sometimes disproportionately highlight certain cases while overlooking others that may be more grievous. But a modern police force cannot be distracted by that. It must stay ahead of evolving crimes and criminals, and take effective, multi-pronged steps that improve both safety and public perceptions of it. We have yet to see that happening.\nWe must recognise that law enforcement agencies are facing challenges on multiple fronts. Leave aside the alleged machinations of the cohorts of Awami League and other political actors. Beyond murder, mugging, and extortion, we have also seen repeated protests, clashes, and mob violence involving different groups over the last few months. Many incidents of attacks on mazar (shrines), darbar sharif (Sufi centres), and Baul akhras were reported. There has been a spike in rape and sexual violence as well. The release of some top criminals after the mass uprising as well as continued circulation of arms and ammunition looted from police stations have also contributed to the rising crime. According to police sources, of the 758 mugging suspects arrested in Dhaka from January 1 to February 20, some 115 have been released on bail. Add to that the role of rumours and misinformation on social media, which is only making matters worse.\nGiven this explosive situation, we need visible improvements in law and order, not assurances or boastful claims. For that, it is not enough to simply increase law enforcement activities; those in charge must too be made accountable. Given the alarming crime statistics as well as impending security risks associated with Ramadan and election-related activities down the year, the government must treat law enforcement as its number one priority going forward.\n",
        "headline_1": "Home adviser must face reality, not try to spin it",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/home-adviser-must-face-reality-not-try-spin-it-3833801",
        "news_paper_name": "The Daily Star",
        "publish_date": "26-02-2025"
    },
    {
        "full_article": "Col Anisuzzaman was a brave soldier, a loving father, a devoted husband, and a caring son. He was 50 when his life was cut short by a hail of bullets from rebellious jawans during the bloody Bangladesh Rifles (BDR) mutiny on February 25, 2009. He died valiantly along with his courageous colleagues while doing his job, serving his country.\nAnis was born on August 16, 1959 in Rajshahi's Naogaon district. His handsome appearance and endearing nature made him a captivating personality. His childhood was spent mostly in Dhaka, but often he travelled across the country with his bureaucrat father, who was transferred to various regions within and outside the country. He sat for his Secondary School Certificate examination from St Gregory's High School and High School Certification from Notre Dame College. While attending Dhaka University in the management department he wanted to serve his country and went to Bhatiary to attend the officers' training programme at the Bangladesh Military Academy in Chattogram. He became a commissioned officer of the army in 1980. He loved his country dearly and served with dedication and exemplary leadership. His various postings included adjutant of Bangladesh Military Academy, adjutant of East Bengal Regiment Centre, commanding officer, and personal assistant to the chief of army. he was also sent on deputation to the UN missions in Kuwait and Liberia. He passed the National Defence College (NDC) course with distinction. He served Bangladesh Rifles several times during his illustrious army career of over 29 years, the last one being fatal when he was posted at the Rifles Headquarters in Pilkhana as director of operations and training. Prior to his last posting, he was sector commander in Mymensingh. At that time, his team succeeded in recovering a large cache of arms. For his gallant role in that operation, he was awarded the Rifles Award, the highest honour for bravery in Bangladesh Rifles.\nHe married Nazma Zaman in 1991 and raised a loving family of two beautiful daughters and a son. He was very proud of his family and spent as much time with them as his demanding official responsibilities would allow him. His devotion to his mother was praiseworthy. After his father passed in early 2008, he moved his family to Dhaka to be with his ailing mother. While his posting was in Mymensingh, he was allowed to do his duty from Dhaka which took quite a toll on him. He devoted himself to taking care of his mother which he did out of deep love and sense of responsibility. Such was his devotion, that when he was transferred to Chattogram, just prior to his death, he requested a posting in Dhaka or to be retired from the army so that he could be with his mother. Every child has a special bond with one's mother but Anis' seemed special—loving, demanding, and tumultuous. His mother knew this and called him her sonar chhele or golden boy. \nAnis was methodical and organised in his approach, a trait he always had that was further refined by his military training. He was a champion debater and like his father, was good in extempore speech. He won awards for his oratory during his student life and during his military academy days. He loved to travel and did so widely at home and abroad visiting many countries of the world, initially with his father and later with his family. He had a passion for video recording and recorded events and his visits to places with patience. On one of his trips to the US, he recorded the major landmarks of Washington DC and had to answer for his activities to the Federal Bureau of Investigation (FBI) and the US Terrorism Task Force. When he was interviewed by them along with his only brother, he replied in his characteristic bold manner, \"I believe it is my right as a visitor to record my visit, wouldn't you say?\" At such response, the FBI and the Joint Terrorism Task Force officers were flabbergasted and admired his courage. He was loved dearly by his peers, colleagues, and his subordinates. He was kind, caring, and enthralled all he met with his engaging presence. He was a magnetic figure and commanded respect and attention wherever he went. A patriot, he loved his country with passion. In one of his letters to his younger brother who was then going through the process of gaining permanent residency in a foreign land, he mused \"…no matter what you do, never forget you are Made in Bangladesh.\" The ringtone of his mobile phone was \"Ami Banglay gaan gai, ami Banglar gaan gai, ami amar amike chirodin ei Banglay khuja pai,\" which went silent forever on February 25, 2009. \nMay the Almighty forgive Anis and his fallen comrades and grant them Jannah.\nMd Ahsan-uz Zaman is a banker and brother of Col Anisuzzaman.\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "My mother’s golden boy",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/my-mothers-golden-boy-3833331",
        "news_paper_name": "The Daily Star",
        "publish_date": "26-02-2025"
    },
    {
        "full_article": "The mass uprising of July-August 2024 has not only shaken Bangladesh's internal political structure but also brought a monumental shift in its foreign policy and diplomatic approach. One significant outcome has been the government's newfound ability to distinguish between its true allies and adversaries in the international arena. This signifies a break from past submissive policies, marking a new era in Bangladesh's diplomacy—one that prioritises national dignity, self-respect, and equal status on the global stage.\nFor decades, Bangladesh followed the policy of \"friendship to all, malice to none,\" a principle inherited from its early years of independence. However, the events of 2024 have exposed the weaknesses of this antiquated dogma. A sovereign nation cannot afford to extend equal friendship to all while ignoring the power dynamics and self-interest that define global politics. Instead, Bangladesh must embrace a pragmatic and strategic foreign policy that acknowledges global realities, while serving its own interests.\n\nThe government's recent stance reflects a break from dependency-based diplomacy. Despite knowing that India will not support its current leadership, the government has declared its intent to rely on the people rather than foreign powers. This newfound assertiveness signals a shift towards an independent and self-respecting approach, aligning foreign policy with the aspirations of its citizens rather than external pressures.\nHowever, breaking free from a redundant foreign policy is not a new phenomenon; many nations have recalibrated their diplomatic strategies. China embraced economic openness in 1978, Turkey diversified alliances in the 2000s, and France asserted sovereignty in 1966. Yet, Bangladesh's previous regime long adhered to outdated policies, resisting necessary shifts in global engagement.\nIt prioritised select alliances over national interest and maintained a one-dimensional approach, compromising sovereignty and economic potential. This failure to modernise left Bangladesh diplomatically weak and economically dependent, hindering progress.\nHowever, the previous regime's foreign policy was not merely about \"friendship to all\"—it extended \"extra friendship\" to certain countries, often at the cost of Bangladesh's sovereignty. A clear example of this was seen in transit and transshipment agreements with India. Economists and pro-government analysts promoted the idea that Bangladesh would achieve economic prosperity similar to Singapore through these arrangements. However, rather than benefiting from a win-win scenario, Bangladesh found itself trapped in one-sided agreements where its interests were repeatedly undermined. This realisation, fuelled by public sentiments in the wake of the mass uprising, has led to a re-evaluation of diplomatic engagements. Moving forward, Bangladesh must engage only with those who respect its sovereignty, and distance or insulate itself from those who exploit its resources under the guise of cooperation.\nA nation's foreign policy should be a reflection of its people's aspirations. For Bangladesh, these aspirations are deeply rooted in the Liberation War of 1971, which was fundamentally a struggle for self-respect and human dignity. The uprising of 2024 has reignited these values, demanding that Bangladesh's diplomatic strategies uphold the same principles that guided its fight for independence.\n\nFirst, human dignity must be a core principle in foreign relations. Bangladeshis are a major labour force across the globe, and their rights and dignity abroad must be a priority in diplomatic negotiations. Without a strong foreign policy that protects Bangladeshi citizens internationally, the nation will fail to assert itself as a dignified global player.\nAlso, the legal protection, fair wages, and humane treatment of the growing Bangladeshi diaspora seeking opportunities abroad must be ensured, making them an integral part of foreign agreements. If Bangladesh does not demand equal respect on the global stage, its citizens will continue to face discrimination and exploitation abroad.\nThis shift marks a significant departure from the submissive policies of previous administrations which often prioritised economic concessions over national pride. The government's new approach emphasises equal status, ensuring that Bangladesh is not treated as a subordinate in global negotiations.\nAnother key transformation in Bangladesh's foreign policy is the pursuit of equal dignity among nations. This principle dictates that Bangladesh, regardless of its economic or geopolitical stature, must be treated as an equal partner in international relations.\nThe United Nations Charter guarantees equal dignity to all nations, including Bangladesh, ensuring that no country, regardless of its size or economic power, is treated as inferior in international relations. Article 1(2) affirms the right of all peoples to self-determination and equal participation in global affairs, reinforcing that Bangladesh has the same standing as any other nation.\nSimilarly, Article 2(1) upholds the sovereign equality of all UN member states, meaning Bangladesh has the right to be treated as an equal partner in diplomacy, trade, and negotiations.\nThe UN Charter gives Bangladesh the legal and moral foundation to demand equal treatment, ensuring that it engages with the world on its own terms. This shift is not an act of defiance but a rightful alignment with international law, allowing Bangladesh to emerge as a respected and independent voice in global affairs.\nTherefore, Bangladesh must reject policies that position it as a dependent state. Just as countries like Belarus, Chile, Mexico, and Pakistan assert their sovereignty, Bangladesh must demand the same level of respect. This shift in policy requires a strong leadership stance, one that refuses to bow to international coercion and instead negotiates from a position of strength. For that, sustainable diplomatic strategy is needed which will ensure that Bangladesh remains resilient against external pressures while steadily strengthening its global influence.\n\nHistorically, Bangladesh has been positioned as a \"soft state,\" easily manipulated by regional and global powers. The uprising of 2024 has fuelled a new confidence, pushing the nation to adopt a bargaining stance rather than a submissive one. By shifting from reactive diplomacy to proactive engagement, Bangladesh can strengthen its democracy and economic standing without compromising its values.\nThe July-August uprising has redefined Bangladesh's approach to governance and diplomacy. The movement has not only exposed internal injustices but also highlighted the flaws of Bangladesh's submissive foreign policy. As the country moves forward, the following principles must guide its diplomatic path: i) self-respect over subordination; ii) human dignity beyond borders; iii) equal status among nations; iv) sovereignty above external influence; and v) a sustainable, assertive approach to foreign policy.\nThe era of passive foreign policy is over—a new Bangladesh is emerging, and it refuses to be dictated by external forces and instead asserts itself as an equal and sovereign player on the global stage.\nAlauddin Mohammad is the secretary of international relations and diplomacy at the Jatiya Nagorik Committee. He can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Bangladesh must discard its archaic foreign policy",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/bangladesh-must-discard-its-archaic-foreign-policy-3833226",
        "news_paper_name": "The Daily Star",
        "publish_date": "26-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Digital hub to boost trade, investment",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/digital-hub-to-boost-trade-investment-1740499040",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Skill gap in digital and green  tech impacts competitiveness",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/skill-gap-in-digital-and-green-tech-impacts-competitiveness-1740499160",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Qualitative expansion  of job market",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/qualitative-expansion-of-job-market-1740499257",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Networking for business success",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/networking-for-business-success-1740499304",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-02-2025"
    }
]