[
    {
        "full_article": "The 2008 Malegaon blast, killing six and injuring 95 others, during Ramzan, was an extreme act of terror. The initial investigation by the Maharashtra Anti-Terrorism Squad (ATS) posited a chilling conspiracy by Hindutva extremists to exact revenge through a “blast for a blast”, emulating the polarising methods of Islamist terror groups. This narrative seemed solidified by circumstantial evidence, including electronic transcripts of secret meetings and a confession by Sangh Parivar activist Aseemanand. The case was politically fraught from the start. The ATS investigation was a pivotal moment, as it sought to identify perpetrators irrespective of religion, especially after Muslim youth were wrongly charged and later acquitted in the 2006 Malegaon blasts. However, this unbiased approach appeared to falter with the consolidation of Hindutva political power. After the case was transferred to the National Investigation Agency (NIA), the agency filed a supplementary charge sheet. Amid allegations that the NIA was under pressure to be lenient, a Special Court rightly ruled in 2018 that a full trial was the best course. Seventeen years later, the final acquittal of all accused, including Lt. Col. Prasad Purohit and Pragya Singh Thakur, leaves a profound sense of unease. Far from refuting the existence of Hindutva-led extremism, the judgment is an indictment of the prosecution’s methods and a reminder of how justice can be undone.The court exposed a foundation of unreliable evidence, noting that key witnesses turned hostile, alleging coercion by the ATS — a claim also noted by the NIA. The explosive electronic transcripts were deemed inadmissible for failing to meet mandatory legal safeguards against tampering. The court also rejected the defence of Purohit, who argued that he was a military intelligence officer infiltrating the group, but acquitted him as the evidence failed to meet what it saw as the legal standard for a conviction. The political circumstances suggest a consistent attempt to reframe the alleged acts of terror not as criminal, but with a communal narrative. In 2019, while still under trial for grave terror charges, Pragya Thakur was fielded as a parliamentary candidate by the Bharatiya Janata Party and won from Bhopal. Her political elevation as a Hindutva icon was precisely because of her purported role in fomenting retaliatory attacks against Muslims. Her subsequent career, marked by an endorsement of Mahatma Gandhi’s assassin, Nathuram Godse, has only confirmed the dangerous mainstreaming of extremist voices. The acquittal lays bare the unsettling reality that when state agencies fail, extremist organisations can get away with heinous crimes. Terror has no single religious face and, without a competent and scrupulous policing, prosecution and justice system, its perpetrators, whoever they may be, can walk free. Published - August 04, 2025 12:30 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        explosion\n                    \n                            /                      \n                        \n                        Maharashtra\n                    \n                            /                      \n                        \n                        hate crimes\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        investigation\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        crime, law and justice\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        religion and belief",
        "headline_1": "An unravelling: On the Malegaon acquittals",
        "headline_2": "Malegaon acquittals expose systemic investigative failures",
        "link": "https://www.thehindu.com/opinion/editorial/an-unravelling-on-the-malegaon-acquittals/article69890434.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-08-2025"
    },
    {
        "full_article": "Powerful perpetrators are rarely made accountable for their actions, and in that backdrop, the conviction and life sentencing of Prajwal Revanna, former Janata Dal (Secular) Member of Parliament and grandson of former Prime Minister H.D. Deve Gowda, for a heinous crime comes as a relief. This is the first of the four cases of rape and sexual harassment against the 34-year-old Gowda scion. The former Member of Parliament had raped a 48-year-old domestic worker twice at the family’s homes in Hassan and Bengaluru in 2021, and recorded it on his mobile phone. In April 2024, ahead of the general election, explicit clips of his sexual misdemeanours were leaked through pen drives strewn across public places in Hassan, the Gowda home town. In the videos, Revanna’s face is not visible, only the women’s, a gross violation of their safety and privacy. The former help and other women came forward with their complaints but their agony was far from over. Using political muscle, and aided by his parents, former Minister H.D. Revanna and Bhavani Revanna, he did his best to arm twist the system, threatening a survivor, trying to stop her from testifying. But a Special Investigation Team (SIT) worked with alacrity and he was finally arrested in May 2024. The SIT filed the first charge sheet in August 2024.The video, where the domestic worker is seen pleading with Prajwal Revanna to spare her, DNA analysis and her testimony formed key evidence in the trial which began in May this year. The Special Court of Sessions to hear criminal cases against former and present Members of Parliament and MLAs pronounced the verdict on August 1. The speedy trial and conviction will give hope to other survivors battling for justice in sexual assault cases. The court convicted Revanna on all charges framed against him, including under Sections 376(2)(n) (repeated rape on the same woman), 506 (criminal intimidation), 201 (disappearance of evidence) of the Indian Penal Code (IPC) and 66E (violation of privacy) of the Information Technology Act, 2000. Section 376(2) of the IPC states that a person convicted under it “shall be punished with rigorous imprisonment for a term which shall not be less than 10 years, but which may extend to imprisonment for life....” Often, even when multiple complaints are raised, leaders with political clout get away. The laws are in place. All that the government machinery needs to do is act swiftly and sensitively, and create a safe space so that survivors of sexual abuse can come forward without fear. Published - August 04, 2025 12:15 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        sexual assault & rape\n                    \n                            /                      \n                        \n                        political candidates\n                    \n                            /                      \n                        \n                        Janata Dal - Secular\n                    \n                            /                      \n                        \n                        General Elections 2024\n                    \n                            /                      \n                        \n                        investigation\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        crime, law and justice\n                    \n                            /                      \n                        \n                        Karnataka\n                    \n                            /                      \n                        \n                        bengaluru\n                    \n                            /                      \n                        \n                        Hassan\n                    \n                            /                      \n                        \n                        politics",
        "headline_1": "Rape and punishment: On the life sentencing of Prajwal Revanna",
        "headline_2": "Victims of assault must be encouraged to testify without fear",
        "link": "https://www.thehindu.com/opinion/editorial/rape-and-punishment-on-the-life-sentencing-of-prajwal-revanna/article69889791.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-08-2025"
    },
    {
        "full_article": "When road rage becomes air rage, it’s a whole lot more dangerous. Every incident must be dealt with firmly\nCommercial planes commonly have a cruising altitude of 36,000 feet. Loss of temper at that height can set off domino effects unimaginable on the road or in a train. This is what flight crew have on their mind when they work to calm any passenger who loses their wits. The incident on the IndiGo Mumbai-Kolkata flight on Friday, where a passenger slapped another passenger, has to be understood in this context. What the SpiceJet crew suffered at the Srinagar airport a week ago, on the other hand, alarmingly underlines that not all passengers walk into planes in a civilised frame of mind in the first place.\nWith SpiceJet ground crew suffering a spinal fracture and injuries to the jaw, an army officer has been charged with “murderous assault”. The flashpoint was his cabin baggage exceeding the set weight limit. On flights themselves, there are abundant triggers. Someone leaning their seat back into your knees, not getting the meal of your choice, someone’s baby being grumpy for loud, long stretches, being zen through it all ain’t easy. But anything else could be, literally, deadly. One slap, retaliation, others jumping into the fray, it could all go out of control so easily. And a planeful of lives would be endangered. Air travel is stressful, no doubt. But that’s no excuse at all for breaking the peace. \nIn 2023, the number of unruly passengers put on no-fly lists increased by 78% to 108. Again, this data has to be understood in the context of a very small minority of passengers being able to cause mass hurt. So, while many road rage cases go unreported, every air rage case must be filed with police. Not just the ones that cause injuries or go viral. The other thought from all this is that tolerance for lumpenism in some spaces, means it finally leaks everywhere.\n\n",
        "headline_1": "Flying into a slap",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/flying-into-a-slap/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-08-2025"
    },
    {
        "full_article": "After pets get registered, why can’t they claim residency too?\nThe fat cats frowned that two Bihar babus, in a place they’d never heard of: Masaurhi in zilla Patna, found it legit to issue an identity card to a dog, complete with parental details. So dad was Kutta Babu and mom Kutiya Devi. The two black sheep who made the identity card a reality were packed off by Patna’s top dogs without so much as hearing their POV.\nIt was clear soon enough though that the two paper tigers didn’t believe in treating man’s best friend like dogs, were in part annoyed to be sheep bleating yes SIR, yes SIR, and it was just monkey business in a dog-eat-dog world of meaningless activity – telling locals where the sorry sods lived lest they forget their way home. \nThe shock and haww heaped on tch-tch Bihar and extended to all things four-legged and bipedal was quite the circus. But no one asked why it was such a big deal. It wasn’t the fake Aadhaar surely, for that is, eyeroll, so yesterday.\nSo, what if dogs really could get i-cards? Pets have to be registered anyways. So, think. It is neither illegal nor unethical to issue a residence certificate to a dog. Show me a law that says dogs cannot claim residency. Why can a dog or cat or crocodile or peacock not claim residency? A livestock census is kosher, so why go delulu over doggo ids? \nWe all wear dog collars. So, dog bites man is news – far from times when only man bites dog was news, and strays weren’t pariahs. That shampooed ribboned superfood-chomping bozo is now globe-trotting, its indie country cousin outside the gate is the ‘mad outsider’. Even though it’s the stray that guards the streets, where it would scare the twilight out of bipedal snakes in the grass stalking those trudging the last mile home. Appalling city upkeep triggers road rage – in bipedals.\nLoan sharks and vulture capitalists, white elephants and weasels, tiger moms and lame ducks, lambs to the slaughter: everyone gets an id, but not a dog. It was but a lark – the id was cancelled within two minutes of being produced – but the silliness was taken so seriously. But that isn’t the elephant in the room, is it?\n\n",
        "headline_1": "Dog Babu asks",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/dog-babu-asks/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-08-2025"
    },
    {
        "full_article": "High tariffs or not, self-sufficiency in critical areas must be a national imperative \nIt is possible for a people to be self-sufficient. The Sentinelese in the Andamans, for example. But such living is extremely limiting. That’s why all great nations have pursued trade, although not as a dogma in the modern way. Ancient Romans were big traders. Millennia later, Mussolini declared Italy would manage alone, only to concede as oil imports rose: “Let us not delude ourselves about autarky.” As he continues lighting tariff fires well into the first year of his second term, Trump has not declared autarky or self-sufficiency as his economic goal, but his actions are tending in that direction. He wants US to make everything from chips to ships; buy little and sell a lot. \nThe problem with America’s protectionist turn is that it affects the global order. When the largest economy, and market, raises barriers for sellers, the whole free trade edifice is at risk. India has been especially stung by Trump’s tariffs. In a speech last week, Modi flagged the resultant uncertainty and urged Indians to buy swadeshi. It does not signal India’s retreat into its pre-91 walled garden, but a pragmatic pause. Globalisation may pick up pace again when Trump leaves office in Jan ’29, or as our top column today suggests, it may not as the world shifts “from open to managed trade”. \nIndia will have to rethink strategy in that case. The ease of buying everything from computer chips to warplanes – Trump’s been pushing the F-35 at India – in the 21st century can lull nations into a false sense of security. But China and America’s recent actions are a wake-up call. India’s a laggard in manufacturing semiconductors and fighter planes – the air force is currently depleted – and needs to catch up in the field of drones now. Then there are so many high-tech articles of civilian use that we don’t make. Almost all specialised medical equipment is imported and contributes to the high cost of treatment.\nSo, setting up an industrial base to manufacture advanced equipment – along with a research base to develop them –  should be a national priority. If low tariffs return, it will make India an export powerhouse. If they don’t, we won’t be vulnerable at least. In an essay he wrote in 1933, Keynes, who grew up believing in free trade, said self-sufficiency may be a worthwhile luxury for countries that want it and can afford it. “Let goods be homespun whenever it is reasonably and conveniently possible…” It’s good advice.\n\n",
        "headline_1": "Make In India",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/make-in-india/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-08-2025"
    },
    {
        "full_article": "Phrases like ‘you are just a groundsman’ are part of a familiar genre of Indian anger where dominance is asserted by reminding someone of their job. This insult is more Indian than a McAloo Tikki. These aren’t slips of the tongue, but echoes of a system that trains us from childhood to link dignity with designations\n \nAt a seemingly routine net session at The Oval, something dramatic happened. When curator Lee Fortis allegedly instructed the Indian coaching staff to maintain a distance from the pitch, India’s head coach Gautam Gambhir reportedly waved his finger and snapped, “You’re just a groundsman, you stay in your capacity. You are just a groundsman, nothing beyond.” The exchange, captured on video, went viral. To many, he was just another entitled elite man humiliating a salaried professional. To others, he was a postcolonial hero standing up to western authority, a symbol of new India that no longer bends before a white man.\nAltercations aren’t rare in sport. As George Orwell put it, serious sport is “war minus the shooting”. But this moment came layered with enough irony to linger beyond the match.\nDifferent strokes: Gambhir may not have meant much by his outburst but some saw him as an entitled elite and others as a postcolonial hero standing up to the West\n \nWe saw a coach mildly irritated about pitch protocols. But in India, nothing is ever just about turf. Every interaction carries the sediment of class, caste, and a long history of bruised egos at being told what to do. Let’s start with the obvious: the insult.\nPhrases like ‘you are just a groundsman’ are part of a familiar genre of Indian anger where dominance is asserted by reminding someone of their job. This insult is more Indian than a McAloo Tikki. It’s so rooted, it might as well be muscle memory.\nIt reminds me of that viral airline video from a few years ago, where a passenger yelled at an airhostess: “You are a servant of the passenger”. She replied: “Sir, I am an employee, not your servant.” Or the countless panel debates where spokespersons from our top political parties refer to someone as chaprasi se bhi badtar (worse than a peon). These aren’t slips of the tongue, but echoes of a system that trains us from childhood to link dignity with designations.\nBut to view the Gambhir episode only through the lens of classism is to stop at the first layer. After all, he is the coach of a sport famously called a gentleman’s game.\nCalling cricket a gentleman’s game is a bit like awarding Barack Obama the Nobel Peace Prize just months into his presidency, not because he ended any war, but because the world hoped he wouldn’t start new ones. It’s a hope disguised as a compliment. The title arrives early, and with it, a quiet manifesto of moral behaviour.\nCricket in England has long been steeped in class. The term ‘gentleman’s game’ reflects hierarchy more than virtue. From 1806 to 1962, a high-profile series called ‘Gentlemen vs Players’ divided cricketers into two categories. The Gentlemen were wealthy, upper-class amateurs; the Players were working-class professionals who played for pay. You can still spot echoes of this in today’s India, where someone from Greater Kailash might call himself a farmer after planting a few broccoli seeds in his Mehrauli farmhouse. At Lord’s, they had separate dressing rooms and separate entries — symbols of a class system that lasted until the distinction was formally abolished in 1963.\nThe irony, of course, is that Gambhir’s outburst was a classic act of classism performed inside a sport that was engineered to preserve it.\nThen came the third and most theatrical layer: colonialism. Unlike classic Indian classism, this wasn’t a coach yelling at a security guard at Wankhede. This time, the curator was white and Gambhir, in that awkward colour category the West calls brown. The groundsman became the British Empire, armed with a lawnmower, and Gambhir the last angry nationalist asserting his right to have a look at the sacred soil. This kind of showdown has a large audience in India.\nThe whole heated exchange was celebrated as proof that India has arrived, and will now speak to the ex-coloniser in the only language they understand: assertion.\nFair enough. But is this really decolonisation or even assertion? The obsession with turning every minor spat into a grand symbol of resistance is, ironically, the most enduring symptom of a colonised mindset. When net practice confrontations are reframed as anti-imperial defiance, you’re not exacting revenge, you’re just frantically cramming too many lemons into your mouth with aggression, hoping to cure a special kind of hangover named the Colonial Hangover.\nObviously, it doesn’t cure the hangover. Even if the curator was at fault, this wasn’t some underdog moment. This wasn’t a moment of resistance, nor one of grand injustice. Times have changed. BCCI is now roughly around 38 times wealthier than the England and Wales Cricket Board. In the world of cricket, It is the empire. With such dominance comes expectation, not just to win but to behave like a grown-up power. In the theatre of global influence, humility is a smart, deliberate accessory worn by those who want power without resentment.\nGambhir may not have meant much by his outburst. But meaning travels faster when it’s wearing a BCCI tracksuit. In the cricketing world of 2025, India is no longer the rebel village team. It is the empire. In cinematic terms, this isn’t Bhuvan from ‘Lagaan’ asking for a fair match. This is Captain Russell politely explaining the new revenue model.\nEmpires, even insecure ones, don’t need to shout. Especially not at people doing their job, even if you disagree with how they do it. Decolonisation will begin not when we shout back at authority, but when we stop mistaking shouting for authority.\n\n",
        "headline_1": "Turf wars to power plays, decoding Gautam Gambhir’s viral outburst",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/voices/turf-wars-to-power-plays-decoding-gautam-gambhirs-viral-outburst/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-08-2025"
    },
    {
        "full_article": "They have been the playthings of powers for decades, and there is no promise that this will end soon. Empires and powers seem to come and go, yet the plight of the Palestinians remains more horrific than ever. Now, in the next instalment of the grand morality game, France, the UK, and Canada promise to recognise Palestinian statehood at the September meeting of the 80th session of the United Nations General Assembly. \nFrom the perspective of soothing the conscience, this is a mighty thing—for those in Paris, London, and Ottawa. It does not save a single life on the ground in Gaza or the West Bank, provide a single meal for a starving family, or rebuild a single destroyed school. But President Emmanuel Macron and Prime Ministers Sir Keir Starmer and Mark Carney can all commune as a triumvirate of principled statesmen.\nMacron, the first of the three, made signals on the issue earlier in the year. The French leader had hoped that a UN conference sponsored by France and Saudi Arabia would be the venue for joint recognition, but it came to naught with the resumption of hostilities in Gaza and Israel's attacks on Iran's nuclear facilities. In turning to the G7 nations, he hoped to amplify the urgency of recognition.\nIn doing so, the onus was also on the Palestinian Authority (PA) to make certain concessions to add momentum. A letter from PA President Mahmoud Abbas sent to Macron duly came, condemning the attacks of October 7, 2023 by Hamas, demanding the immediate release of all hostages, and making the pledge to hold elections and introduce reforms to governance. Hamas—not that Abbas had any claims on this point—would also \"no longer rule Gaza\" and would have to surrender \"weapons and military capabilities to the Palestinian Security Forces, which will oversee their removal outside the occupied Palestinian territory, with Arab and international support.\" \nOn July 24, Macron confirmed in a letter to Abbas, conveyed via France's consul general in Jerusalem, that recognition of a Palestinian state would follow in September \"in light of the historic commitments that were made\" and the threatened two-state solution. On July 28, in his opening speech to a plenary session of the High-Level International Conference on the Peaceful Settlement on the Question of Palestine and the Implementation of the Two-State Solution, France's Minister for Europe and Foreign Affairs Jean-Nöel Barrot stated the \"prospect of two states, whose rights are recognised and respected, is in mortal danger.\" But assurances and momentum had been achieved, with Barrot acknowledging the condemnation by the Arab League of the Hamas attack and the insistence by its members on the release of the remaining hostages, the disarming of the group and conclusion of its rule in the strip.\nOf the G7, Starmer was the next to be swayed, but with a notable proviso, \"The UK will recognise the state of Palestine by the United Nations General Assembly in September unless the Israeli government takes substantive steps to end the appalling situation in Gaza, agree to a ceasefire, and commit to a long-term sustainable peace, reviving the prospect of a two-state solution.\" To this could be added the need for Hamas to release the hostages, accept a ceasefire, disarm and \"play no part in the government of Gaza.\" In a shabby fashion, room is left to withdraw the offer for recognising Palestinian statehood. \"We will make an assessment in September on how far the parties have met these steps.\" \nCarney, the latest addition, claimed on July 30 that the two-state solution growing from a negotiated settlement between Israel and the Palestinian Authority had been eroded as a prospect by four factors: the threat of Hamas to Israel; accelerated building across the West Bank and East Jerusalem, including numerous instances of Israeli settler violence; the E1 Settlement Plan and the July vote by the Knesset calling for the annexation of the West Bank; and the ongoing failure by the Israeli government to arrest \"the rapidly deteriorating humanitarian disaster in Gaza, with impeded access to food and other essential humanitarian supplies.\"\nThe Canadian PM, in reasons almost identical to Macron, was also swayed by \"the Palestinian Authority's commitment to much-needed reforms\" in governance, including the promise to hold elections in 2026 that will exclude Hamas, undertaking anti-corruption measures, and the creation of a demilitarised Palestinian state. \nA resounding theme comes through in the latest flurry of statements: Palestinians continue to be lectured and harangued under the guise of humanitarian understanding, told who can represent them or not (a reformed Palestinian Authority promisingly good, Hamas decidedly bad), and whether they can have any semblance of a military force. \"Recognising a State of Palestine today,\" states Barrot, \"means standing with the Palestinians who have chosen non-violence, who have renounced terrorism, and are prepared to recognise Israel.\" Standing, it would seem, with a certain type of idealised Palestinian.\nThe Palestinians have become diplomatic merchandise or bits of currency, to be gambled with in the casino of power politics. Starmer is the worst exponent of this, hoping for such returns as Israel's halt to the slaughter and famine in Gaza as well as the release of the hostages by Hamas and its disarmament. But the idea of Palestinian recognition remains, at this stage, a moot point. \nAt the end of any diplomatic tunnel on this lies certain requirements that would have to be met, not least the criteria of the Montevideo Convention from 1933. Despite gathering some dust over time, it outlines the relevant requirements for statehood: any recognised state in international law must have a permanent population, a defined territory, a discernible government, and the capacity to enter into relations with other states. In the UK, some 43 cross-party peers have sent a letter of warning to Starmer arguing against recognising a Palestinian state, citing such familiar, legal grumbles. There was, for instance, \"no certainty over the borders of Palestine\" nor \"a functioning single government, Fatah and Hamas being enemies.\" Neither could enter into relations with foreign states, with one entity having not held elections for decades, and the other being a \"terrorist organisation.\" Despite the UK not signing the Montevideo Convention, recognising Palestine \"would be contrary to the principles of governing recognition of states in international law,\" the convention having become part of international customary law.\nOn the bloodied ground, where legal abstractions dissolve into fleshy realities, Israel is doing its level best to make sure that there will be nothing left of a Palestinian state to recognise. For Israel, the case is not one of if or when, but never. The machinery of slaughter, deprivation and dislocation is now so advanced, it risks smothering the very idea of a viable Palestinian entity. The Israeli policy till October 2023 was engineered to stifle and restrain any credible progress towards a Palestinian state, crowned by feeding the acrimonious divisions between Hamas and Fatah. After October 7 that year, the sharpened focus became one of expulsion, subjugation or plain elimination of the general populace. Palestinian sovereignty remains, to date, incipient, a bare semblance of a political self. This egregious state of affairs continues to be supported, even by those wishing to recognise Palestine. In some ways, those sorts are arguably the worst.\nThis article first appeared on the Concurrents.org and the Middle East Monitor on August 2, 2025. \n\nDr Binoy Kampmark was a Commonwealth scholar at Selwyn College, Cambridge. He is a senior lecturer at RMIT University, Australia. He can be reached at [email protected].\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Diplomatic merchandise: Exploiting the issue of Palestinian recognition",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/diplomatic-merchandise-exploiting-the-issue-palestinian-recognition-3954456",
        "news_paper_name": "The Daily Star",
        "publish_date": "04-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 04, 2025 00:00:00  \nThe recent publication of Bangladesh's first-ever national Multidimensional Poverty Index (MPI) by the Planning Commission's General Economics Division (GED) has brought to light a harsh reality that roughly 40 million people remain trapped in multidimensional poverty. This is a cause for serious concern, as even fifty-four years after independence, over 24 per cent of the population, or one in every four people, are trapped in poverty in its myriad forms. These sobering findings expose the fault lines in the country's poverty reduction strategies adopted thus far. Historically, poverty reduction efforts have been focused primarily on income-generating activities, and policymakers have relied on an expenditure-based method to measure poverty, which has been showing that the country made considerable headway in poverty reduction. The latest Household Income and Expenditure Survey (2022) reported a poverty rate of 18.7 per cent, leading to a sense of complacency among policymakers. \nBut the MPI underscores that poverty is not solely about a lack of income. Rather, it is a complex form of deprivation encompassing limited access to education, healthcare, and basic living standards. The MPI measures poverty across ten indicators, including nutrition, child mortality, years of schooling, cooking fuel, and access to sanitation and electricity. A person is considered multidimensionally poor if they are deprived in at least one-third of these weighted indicators. Thus the MPI provides a far broader view of the actual poverty situation. Against this backdrop, the publication of the first-ever MPI report is commendable, especially since the United Nations' Sustainable Development Goals (SDGs) recommend the MPI, which reflects people's access to basic necessities and living standards. \nThe report's findings also reveal a stark regional disparity. The rate of multidimensional poverty is nearly twice as high in rural areas compared to urban areas and is more prevalent among children than adults. Furthermore, the data points to a discriminatory attitude of the country's governance system towards certain segments of the population and specific regions. For example, Sylhet Division has the highest rate of multidimensional poverty at 37.7 per cent, and at the district level, Bandarban ranks highest, with over 65 per cent of its population trapped in vicious cycle of poverty. The report also breaks down deprivation by specific indicators. The highest levels of deprivation was found in housing, where nearly 62 per cent of people lack adequate flooring, walls, or roofing; followed by internet access (over 59 per cent), sanitation (more than 57 per cent), and asset ownership (nearly 45 per cent). On a more positive note, some indicators show relatively low levels of deprivation: only about 5 per cent of the population lacks access to reproductive healthcare, and around 8 per cent are without electricity. These findings point to measurable progress in specific sectors, even as broader challenges persist.\nThe MPI report, however, is based on data from the 2019 Multiple Indicator Cluster Survey (MICS). Since six years have passed, a new survey is urgently needed to determine whether the situation has improved or worsened. Given the persistent inequality in the country's system of governance, it is unlikely that the affected people and regions have seen much improvement. The current interim government, which emerged from a popular uprising against discrimination, is undertaking various reforms across political, administrative, and institutional spheres. However, the core issue that fuelled the July uprising -- the need to build a truly discrimination-free Bangladesh -- appears to be relegated to the backburner. The MPI offers an opportunity for the government to set its priorities right and address the multidimensional deprivations in future national development plans.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Addressing the many faces of poverty",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/addressing-the-many-faces-of-poverty-1754234069",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       August 04, 2025 00:00:00  \n\nAccounting for close to 30 per cent of the global consumer spending, the USA has been the favoured export destination of the rest of the world. The incumbent US president, Donald Trump, thinks it's unfair. Since, in his view, exporting countries are selling more to America than they are buying. So, they should pay the price and hence the tariff war. \nBut President Trump threatened all, regardless of their being allies or adversaries, with the weapon of tariff. Now, the question is, why is it that the US president has the power to declare a tariff war against all of its trading partners, big and small, and not the other way around? The answer is the post-World War II (WW II) realities that helped the USA to assume its unique position. In fact, with the destruction of the European economies following the great war, the biggest and the strongest economy that emerged on the global stage was the USA. Naturally, it took the leading role, especially in the reconstruction of the war-devastated Europe and Japan. As a result, it played the key role in establishing and shaping the post-WWII global economic order and was instrumental in establishing the global financial institutions, the World Bank (WB) and the International Monetary Fund (IMF). The WB looks after long-term economic development and poverty alleviation in the developing countries with loans and grants, while the IMF stresses global financial stability through helping countries address their balance of payments issues and manage economic crises. The US controls both the institutions. Through introducing the Bretton Woods system in 1944 to regulate currency exchange rates and promote global trade, it pegged the currencies of the Bretton Woods parties to the US dollar (USD), while USD was pegged to gold at a fixed rate of USD35 per ounce. But in 1971, the US government ended the USD's convertibility to gold, thereby putting an end to the Bretton Woods system. \nHas by now the USD's status as the world's reserve currency for over the last seven decades been challenged by any alternative system? Is intergovernmental body of the world's fast growing economies -- Brazil, Russia, India, China and South Africa (BRICS) -- a threat to US's dominance in global economy and trade? Though US is still the world's largest economy, it is clearly wary of its declining trend. But how to reverse it? President Trump's formula to achieve it is by starting from scratch and turning America again into a net producer, not a net consumer. But the US is no more the pre-WWII economy. It is already a completely financialized one. But Trump wants to reindustrialize America. Therefore, it is a last-ditch attempt by Trump to turn the tide.\nThe US's position is now being challenged by China as a the rising (perhaps, it is already the biggest world economy) economic superpower. And China has been selling more of its industrial goods in the US market than the latter is buying. Complaining that US is being unfairly treated, president Trump during his presidential election campaign in 2016, vowed to take a tough stance against China as well as its other international trading partners once in office. His argument was, due to, what he claimed to be unfair business transactions with its trading partners, America's blue collar workers are losing jobs. So, he imposed tariffs on Chinese solar panels and washing machines, Later, the Trump administration slapped 25 per cent tariff on imported steel and 10 per cent on imported aluminum. After taking office for the second time in 2025, he imposed 10 per cent blanket tariff on all imports from China. China also retaliated by levying 25 per cent tariff on imports of some 94 different food and agricultural products from the USA. \nHowever, the notion of punishing one's business rival with tariff is basically a flawed one. For instance, China levied a 25 per cent tariff on US soybean, of which it is a big buyer and switched to Brazil as an alternative source. The US had to pay the price by spending billions of dollars to protect its soybean farmers. But China, too, could not gain much by importing Brazil's soybean, since the price of Brazilian soybean meanwhile increased in response to increase in its demand.\nNow, who won after president Trump's global tariff war that it declared in the beginning of April last? No doubt, Trump's declaration sent the world reeling from panic. The reason for the panic was unpredictability of what might come finally. For governments and businesses worldwide plan their investments, set export and import targets, strategise expansion, create jobs and so on based on what is given and what decisions other major world economies are going to make. The US being the world's largest economy, its decisions matter. But president Trump became the source of indecision on a global scale. However, the state of uncertainty that caused the panic is now over. For the tariff deals that the US has struck with some of its allies or the punitive ones it has levied on others, are already known. So, they can now plan their next move. Even to its traditional European allies, Japan, South Korea, Canada, Australia, New Zealand, etc., the US is no more a dependable partner. The UK, for instance, got a blanket 10 per cent on about all its export to the US. Though initially shocked, it (the UK) later found that the EU and Japan got 15 per cent. Evidently, in the case of the allies, the size of the tariff was determined by the amount of the trade deficit. The US's deficit with EU was USD240 billion, while with Japan it was USD70 billion last year. At this point, one might also term Trump's tariff war as a war against trade deficit. And it does not just end with tariff -- you have to buy US products, invest in America and all such conditions. Japan, to save its car export to the US, had to promise that it would invest to the tune of USD500 billion in the US economy. Bangladesh, too, will buy plane, wheat, cotton, soybean, etc., in exchange for reciprocal 20 per cent tariff (plus the average 15 per cent or so it was already paying) imposed on it to get access to the US market for its products. \nEssentially, the US is cannibalizing its partners. So, they will be looking for fresh alliances.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Who won or lost in  Trump's tariff war?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/who-won-or-lost-in-trumps-tariff-war-1754234238",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 04, 2025 00:00:00  \nIn our country, Members of Parliament are directly elected through general elections to serve in a unicameral legislative system. Their primary duties revolve around legislative responsibilities, including passing laws and ensuring oversight of the executive branch to hold it accountable and ensure it fulfills its duties effectively. Another key responsibility is passing the annual Finance Act, which governs government revenue collection and expenditure.\nHowever, it is regrettable that Members of Parliament (MPs) still do not have formal offices in their respective constituencies. This lack of dedicated workspace prevents them from properly monitoring government activities at the local level and from maintaining regular contact with constituents. If a voter wishes to meet their MP, they often have to travel either to the MP's private residence or to the MP hostel in Dhaka. This is both inconvenient for the public and intrusive to the personal privacy of our elected representatives.\nMost of the time, MPs have to rely on the Deputy Commissioner's (DC) office for meetings or updates on constituency matters. However, the DC office, often lavishly decorated and highly resourced, unintentionally creates an environment where bureaucrats may come across as overly authoritative. In contrast, MPs-who are the highest elected representatives of the people-lack basic facilities, privacy, and logistical support, often making their role uncomfortable and restricted.\nTherefore, it is essential to establish a full-fledged, modern office for each MP in their constituency-ideally within the District Council premises. This office should be equipped with all necessary logistical facilities and support staff. The office secretary may be appointed from the MP's own party, as per their preference, and should be removable in cases of negligence or misconduct, without any bureaucratic red tape.\nAs state reform initiatives are ongoing, establishing formal constituency offices for MPs deserves urgent consideration. Such a move would help ensure better representation, oversight, and connection with the people whom MPs were elected to serve.\nMd. Refatul Hossain\nAdditional Director (Retd.)\nDepartment of Agricultural Extension (DAE)\nFaridpur Region\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why MPs need offices in their constituencies",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-mps-need-offices-in-their-constituencies-1754234273",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 04, 2025 00:00:00  \nIn today's data-driven world, Management Information Systems (MIS) have become the central nervous system of modern businesses. Just as the brain connects and coordinates the human body, MIS integrates all key functional areas of an organisation-finance, human resources, marketing, operations, and more. It ensures that information flows smoothly, decisions are timely, and processes remain transparent and efficient.\nWith the exponential growth of big data and the increasing adoption of technologies such as cloud computing, artificial intelligence, and machine learning, MIS has evolved into a powerful engine of business intelligence. It processes vast amounts of data in real time, identifies trends, and delivers actionable insights that turn guesswork into informed strategy. This leads to smarter decisions, improved productivity, and a stronger competitive edge in today's fast-paced markets.\nMIS also plays a crucial role in risk management by continuously monitoring internal and external data for anomalies, helping leaders anticipate and mitigate potential challenges before they escalate. In addition, it enables businesses to understand customer behaviour, identify emerging demands, and respond more effectively to shifting market dynamics.\nAs organisations grow more complex, even minor gaps in communication or data handling can disrupt performance. That's why MIS must not merely serve as a data repository-it must think, analyse, and guide. It no longer just supports business operations; it drives them. To remain competitive, agile, and future-ready, businesses must view MIS not as a background tool, but as the strategic brain of the enterprise.\nSafwaanul Haque\nStudent\nBachelor of Business Administration\nNorth South University\nsafwaanul.haque@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Brainpower behind modern businesses",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/brainpower-behind-modern-businesses-1754234303",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-08-2025"
    }
]