[
    {
        "full_article": "As political parties are repositioning themselves in response to changed circumstances, a realignment of politics appears to be underway, nearly a year after the general election in 2024. The non-Bharatiya Janata Party (BJP) parties, that assembled as a putative national opposition under the INDIA banner, do not have a shared goal now. In fact, the Assembly elections in Bihar in late 2025, and in Assam, West Bengal, Tamil Nadu and Kerala in early 2026 will scatter these parties further, and possibly pave the way for a reconfiguration of politics in these States and beyond. Some indicators are clear. Communist Party of India (Marxist) leader Prakash Karat said recently that INDIA was meant only for the Lok Sabha election and was specific to particular States. The Left and the Congress will face off in Kerala in what is going to be one of their most combative contests ever. In West Bengal, the Left and the All India Trinamool Congress (TMC) cannot form an alliance while the Congress will weigh its options between the two. In Tamil Nadu, the Left and the Congress could both be in the Dravida Munnetra Kazhagam’s tent, but that is not a certainty yet. The Aam Aadmi Party (AAP) and the Congress, that revived their old rivalries amid heightened bitterness during the Delhi Assembly election recently, are set to continue their clash in Punjab, Gujarat and Goa.The marginal gains of these parties had the aggregate impact of pushing the BJP to the brink of defeat in the general election but it was more happenstance than a new trend as developments in the following months have shown. Insurmountable contradictions in the calculations of individual non-BJP parties soon made INDIA dysfunctional, though the parties coordinate their parliamentary strategy to some extent. These parties are united in demanding more transparency in the electoral process and the accountability of the Election Commission of India. The BJP, meanwhile, has acted with alacrity to shore up its base and win the Assembly elections in Haryana, Maharashtra and Delhi. The BJP and the All India Anna Dravida Munnetra Kazhagam are also showing signs of a thaw in their relationship after having been routed in the general election that they fought separately in Tamil Nadu. Emerging conversations around questions of education and language policy and delimitation are generating a fresh political churn. The regional parties are facing a crisis in parts of the country, and the eclipse of some of them looks increasingly possible. But a lot more churn is likely before political alliances have a settled look.\r Published - March 12, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        politics\n                    \n                            /                      \n                        \n                        General Elections 2024\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Assembly Elections\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        Assam\n                    \n                            /                      \n                        \n                        West Bengal\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        Communist Party of India -Marxist\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        All India Trinamool Congress\n                    \n                            /                      \n                        \n                        Dravida Munnetra Kazhagam\n                    \n                            /                      \n                        \n                        Aam Aadmi Party\n                    \n                            /                      \n                        \n                        Punjab\n                    \n                            /                      \n                        \n                        Gujarat\n                    \n                            /                      \n                        \n                        Goa\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        Haryana Assembly Elections 2024\n                    \n                            /                      \n                        \n                        Maharashtra Assembly Elections 2024\n                    \n                            /                      \n                        \n                        Delhi Assembly Elections 2025\n                    \n                            /                      \n                        \n                        All India Anna Dravida Munnetra Kazhagam\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        language",
        "headline_1": "​Opening moves: On politics, the Opposition space, the INDIA bloc",
        "headline_2": "A political churn is happening after the Lok Sabha election",
        "link": "https://www.thehindu.com/opinion/editorial/opening-moves-on-politics-the-opposition-space-the-india-bloc/article69317785.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "12-03-2025"
    },
    {
        "full_article": "The newly elected leader of Canada’s ruling Liberal Party, Mark Carney, who is now Prime Minister-designate, has a tough task ahead in what is expected to be a short period of time. Mr. Carney, who is set to take over from Justin Trudeau when he formally steps down this week, will almost immediately face a confidence vote in Parliament, after it reconvenes on March 24. Federal elections in Canada are due in October 2025, but observers say Mr. Carney could call for snap polls first, hoping to ride a surge of unexpected popularity for the Liberal Party for standing up to threats made by the U.S. President Donald Trump since he took office. Mr. Trump has consistently targeted Mr. Trudeau, suggesting that Canada would be better off as the “U.S.’s 51st State”, and has been threatening to impose a slew of tariffs, accusing Canada of unfair duties as well as allowing fentanyl drugs and immigrants across the border. Canada has threatened counter-tariffs, and is considering a 25% surcharge on electricity exports to the U.S., with Mr. Carney claiming that “in trade, as in hockey, Canada will win”. Mr. Carney, who is unelected and not a traditional politician, will have to convince voters of his ability to ensure that, as he takes on his rival, Conservative Party leader Pierre Poilievre, who has been far ahead in the polls until recent weeks. To that end, Mr. Carney’s non-political skills will come handy. He was an economist and a central bank Governor; that he was not a member of the Trudeau cabinet means that he is free of any taint from its actions.The exit of Mr. Trudeau is cause for relief for India, and an opportunity to reset ties that have been on ice. His intemperate decision to name “Indian government agents” and then expel Indian diplomats, implicating them in a purported plot to kill Khalistani activist Hardeep Singh Nijjar, without proffering any proof, was a miscalculation and diplomatic blunder. The actions, seen in comparison to more discreet dealing by the U.S. in a linked case, sent India-Canada ties to their lowest ebb since the 1980s. It is significant that India is considering restoring a High Commissioner to Ottawa, while Canada is sending its intelligence chief to a conference in Delhi. Mr. Carney and Mr. Poilievre have made it clear that they would like to rework the relationship with India, and there will be opportunities to do so, particularly in education, investment and trade, all of which have taken a back seat after the violence and schisms within India’s diaspora community, and its supporters in Canada’s government. The interlude is also a fitting period for New Delhi to consider how it wishes to take ties forward. Regardless of the change in leadership, the Khalistan issue cannot be wished away, and requires sustained, considered diplomacy and respect for each other’s concerns, while ensuring India’s national security priorities. Published - March 12, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Canada\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        immigration\n                    \n                            /                      \n                        \n                        electricity production and distribution\n                    \n                            /                      \n                        \n                        banking\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        national security",
        "headline_1": "​New opportunity: On a reset in India-Canada ties",
        "headline_2": "India and Canada can discuss a reset in ties after new Prime Minister takes over",
        "link": "https://www.thehindu.com/opinion/editorial/new-opportunity-on-a-reset-in-india-canada-ties/article69318085.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "12-03-2025"
    },
    {
        "full_article": "Satellite internet will finally come to India. Make haste to end the digital divide\nAirtel and Elon Musk-owned Starlink’s deal to bring satellite-based internet services to India is excellent news. Wired broadband has obvious limitations in a vast country like India, and latest govt data puts the number of subscribers at just 41mn. While mobile internet reaches 903mn people, connecting remote settlements with 4G or 5G towers may not be economical. But given enough satellites, satellite internet can touch every corner of earth, and Starlink has that capability. At last count, it had over 7,000 working satellites, and a plan to build a mega-constellation of 42,000. No other company comes even close, chiefly because Musk also has the capability to launch satellites at rock-bottom rates on his SpaceX rockets. The speed with which Starlink connected Ukrainian troops at the start of the war three years ago is proof of its efficacy.\nIncidentally, Starlink won’t be the first satellite-based internet service in India. State-owned BSNL had announced its satellite-to-device service last Oct. But Starlink didn’t finish second for want of trying. In Nov 2021, it had started pre-booking subscribers, hoping to get the requisite permissions. That plan didn’t work out. Indian telcos firmly resisted its entry, citing the high costs of spectrum and cellular infra they had borne. As late as last Oct, they were insistent that Starlink participate in a spectrum auction to launch in India. However, International Telecommunication Union rules for satellite spectrum were a hurdle. Better sense – join them, if you can’t fight them – has prevailed after five months. But the collaboration with Airtel means Starlink won’t enter India as a disruptor. A “tariff war” of the kind that Jio unleashed is unlikely. The real benefit here is not lower bills for existing broadband users, but bringing hitherto unconnected areas online. Yes, satellite internet may be too expensive for the poor inhabitants of remote villages, but govt can provide subsidised or free community connections, now that someone is beaming down signals.\nIndia’s digital divide may be less glaring than its rich-poor divide, but it affects the quality of learning for children and the quality of information and public services for elders. Any technology that helps end this divide should be welcomed. Eventually, Indian telcos would have built their own satellite internet services, but waiting years or decades for them to get there would have been unfair to the unconnected. \n\n",
        "headline_1": "Sky’s not the limit",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/skys-not-the-limit/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-03-2025"
    },
    {
        "full_article": "Hijacked train in Balochistan poses dangerously difficult questions for Pak, including China dimension\nA hijacked train, soldiers among hostages, in a rebellious province awash with militants – what happened in Balochistan yesterday is a huge challenge for Islamabad. Baloch Liberation Army (BLA), which has waged a decades-long insurgency against Islamabad, has claimed responsibility for hijacking the Quetta-Peshawar Jaffar Express. Reportedly, around 400 passengers are onboard, including Pakistani security personnel. BLA has warned that any attempts by Pakistan’s army to launch a rescue operation would lead to catastrophic consequences.\nBut Islamabad would have no choice but to mount such a rescue operation if negotiations to release the hostages fail. That Pak army has a brutal track record in Balochistan doesn’t make the situation easier – the bad blood between BLA and military runs deep. Plus, since Taliban’s return in neighbouring Afghanistan in 2021, militancy in Pakistan’s violence-prone western regions has seen a sharp uptick. More than 1,600 people were killed in attacks in Pakistan in 2024. In Nov last year, BLA claimed responsibility for a bombing at Quetta’s main railway station that killed 26, including 14 Pakistani soldiers.\nThere are two bigger issues. First, Islamabad has long been accused of turning Balochistan into a security state. Despite being the most resource-rich area in Pakistan, it remains the country’s poorest province. This situation has disenfranchised local Balochis, creating fertile grounds for insurgency. Second, there’s a geopolitical dimension. Islamabad has tried to normalise its colonial relationship with Balochistan through China’s BRI investments, most notably the development of Gwadar port. But this has been rejected by Balochis, as highlighted by numerous militant attacks on the port and Chinese workers. China, on which Pakistan depends for everything from bailing out its forex reserve to military equipment, won’t be thrilled by the train hijack. But receding state authority is an even bigger problem for Pakistan.\n\n",
        "headline_1": "Wheels coming off",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/wheels-coming-off/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-03-2025"
    },
    {
        "full_article": "The economic boycott the Mahatma used to fight the Raj, might make Donald duck\nBy the simple expedient of removing his Lancashire-woven garments in favour of those homespun on a charkha, Bapu launched a nationwide mass movement of economic boycott that struck a non-violent body blow to the might of the British Raj.\nToday, as India, along with a host of other countries, faces the neo-imperialism of Trumpistan, could a similar strategy literally put paid to a country that has famously, or infamously, described itself as “the only indispensable nation in the world”, implicitly relegating all other parts of Planet Earth to a limbo of discards.\nTrump has declared what investment icon Warren Buffet has called a “war” against the rest of the world by threatening ruinous tariffs against those who don’t toe the US line.\nBut the economic jihad that US has unleashed against the international community might not prove to be the walkover that MAGA chest-thumpers believe it will be.\nAmerica is a super-fatted society of unbridled consumption of goods and natural resources. With less than 5% of the world’s population, US is the biggest consumer of hydrocarbon energy sources.\nIts imports – of everything from foodstuff to automobiles, pharmaceuticals to smartphones – exceed its exports by a huge amount. America’s national debt, at $36tn, is $6tn more than its GDP: America eats more than it earns.\nIf the world were to impose an economic boycott of America’s goods and services, US would become bankrupt. Already, Canadians have stopped buying American products, and have been urged to avoid leisure travel to US.\nEurope and other countries are scrambling to form trade agreements that would bypass an America that is increasingly isolationist and isolated.\nAccustomed to cornucopian plenitude, could a fenced-in America cope with the hardships of austerity? Can it achieve self-reliance, atmanirbharta? To help it to learn, as a parting gift India might send it a consignment of Bapu’s chakras. \n\n",
        "headline_1": "Bapu vs Trump",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/bapu-vs-trump/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-03-2025"
    },
    {
        "full_article": "Written by: Sadhguru Jaggi Vasudev\nA prominent journalist recently asked me, “Sadhguru, if I am a Muslim or a Christian, can I enjoy Mahashivratri?” I replied, “Muslims cannot participate. Christians cannot engage. Hindus definitely cannot join the celebration. Only human beings can come, because this is a celebration of human nature.” Mahashivratri is not about a particular community, culture, or creed. It is a night dedicated to celebrating the core of human nature – ability to reach beyond oneself. Mahashivratri, the year’s darkest night, holds a special place among 13 Shivaratris in the lunar calendar. Planetary positions on this night create a natural upsurge of energy within us.\nYogic sciences recognise this natural phenomenon and provide tools to make the most of it. When we talk about staying awake on Mahashivratri, it is not simply keeping our eyes open. It is about awakening the deepest parts of ourselves. Most people walk through life like sleepwalkers, their eyes open, but their consciousness asleep. The great night of Shiv offers a chance to break free from this slumber. The very posture of staying upright throughout the night is not for ritualistic purposes but to allow energy to flow freely through the spine, promoting heightened states of awareness.\n \nShiv, the Adiyogi, exemplifies this boundless possibility. He is not a god in the conventional sense but the embodiment of stillness and dynamism. He sits in absolute stillness, yet the cosmos dances around him. His presence reminds us that we, too, can find stillness within and let the world around us flow without entangling us. Today, this message is more relevant than ever.\n\nLook around – wars, conflicts, divisions of all kinds. What we lack is not resources or intelligence but a conscious human being. When it turns against us, human mind becomes the greatest source of misery. People make their heaven and hell right here, in their minds. The mind, which can be a miracle, has become a misery machine. This is why we introduced the ‘Miracle of Mind’ app. The journey is inward, but in this technological age, tools are needed to guide people gently on this path. The app is a free offering – a simple tool for seven minutes of daily meditation.\n \nImagine the transformation if even half the population of the world can sit still and turn inward for just seven minutes a day. You do not brush your teeth because you like it; you do it because you understand its impact on your well-being. Meditation is hygiene for the mind. When in harmony, the mind can create well-being, joy, and bliss. But when it is out of sync, it creates stress, anxiety, and chaos. We are seeing this today on a global scale. Plastic in our oceans is a problem, but plastic in the brain is a bigger issue. Toxic thoughts, compulsive reactions, and a lack of conscious response have led humanity down a precarious path.\n \nWhen people learn to harness the mind, they naturally become more compassionate, inclusive, and capable of seeing life in all its dimensions. A mind that is not entangled becomes a doorway to the infinite. It is not about rituals or religion, but about the inner freedom you can evoke. When a human being becomes still, not just physically but in the very core of their being, they become a conduit for grace.\n\n",
        "headline_1": "A chance to awaken miracle of mind",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/a-chance-to-awaken-miracle-of-mind/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-03-2025"
    },
    {
        "full_article": "It is disappointing that Bangladesh and the landlocked nation Chad have been ranked as the world's most polluted countries in 2024, with their average smog levels exceeding WHO guidelines by more than 15 times, according to Swiss air quality monitoring firm IQAir. It is little wonder, then, that air pollution causes 102,456 deaths in Bangladesh every year, as the Centre for Research on Energy and Clean Air (CREA) recently estimated. Other studies over the years have painted a similarly grim picture. These findings should spur frantic efforts to reverse this trend. The question is, why don't they?\nThe CREA study highlighted that young children are particularly vulnerable, with 5,258 annual deaths from PM2.5-related lower respiratory infections. It estimated that controlling air pollution could prevent 5,254 child deaths each year and avert 29,920 deaths from heart disease, 23,075 from strokes, 20,976 from COPD, 9,720 from pneumonia, and 3,063 from lung cancer. Additionally, pollution-related illnesses lead to 669,000 emergency hospital visits annually and 263 million lost workdays, significantly harming the economy. Similarly, a World Bank report estimated air pollution caused between 78,145 and 88,229 deaths in Bangladesh in 2019. Another study found it shortens the average Bangladeshi's life expectancy by 6.8 years. Despite these staggering consequences, successive governments have taken minimal action. Vehicle pollution remains high, industrial and power plant emissions go largely unregulated, and construction activities and waste burning continue unchecked.\nThe persistently high pollution levels highlight not only a lack of ambition in policymaking but also a failure to enforce existing regulations. The absence of regular monitoring mechanisms to uphold air quality standards is another major shortcoming. In spite of these failures, the responsible authorities are never held accountable. This must change. Despite concerns caused by the recent US decision to end a programme that many countries relied on for air quality data, the government must take responsibility for developing its own robust air quality monitoring and improvement systems. Investing in its own air quality monitoring infrastructure would be a crucial first step.\nBangladesh also needs to adopt a multi-pronged approach to tackle the deteriorating air quality. Stricter enforcement of emission regulations for industries and vehicles is essential. Brick kilns and factories—both major polluters—must be required to use modern filtration systems, while large-scale afforestation and urban greening initiatives should be undertaken to help absorb pollutants. Construction activities should also be regulated with dust-control measures, and waste burning should be strictly prohibited. Ultimately, the government and other stakeholders must realise that without urgent, science-backed intervention, the country risks an even graver public health and economic crisis in the coming days.\n",
        "headline_1": "Choking on apathy and neglect",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/choking-apathy-and-neglect-3845606",
        "news_paper_name": "The Daily Star",
        "publish_date": "12-03-2025"
    },
    {
        "full_article": "\"Villains are not born; they are created\"—this saying contains a profound reality that defies the conventional tales we frequently accept without inquiry. In civilisations where filial responsibility is highly engrained, children who abandon their parents are viewed as ungrateful, uncaring, and cruel. The idea of an elderly person bemoaning that their offspring have sent them to a nursing facility elicits both pity and fury, with blame nearly invariably focused on the children. But rarely do we pause to consider what caused this separation. Why would someone willingly cut ties with the folks who raised them?\nThe emotional weight of such stories lends itself to painting a one-sided image in which the elderly are always victims and their children are the villains. It is awkward, if not unsettling, to consider that the story could be more complex. Perhaps the adult who now refuses to care for their elderly parents was once a helpless child who suffered years of mistreatment, neglect, or abuse. In our culture, parental power is unquestionable. Questioning it is frequently met with opposition, with the belief that a parent has an unassailable right to discipline their child how they see fit. However, this discipline often crosses the line into abuse, leaving long-lasting psychological scars.\nThere is a troubling pattern that repeats itself across generations. A child who grows up in dread of their parents may show respect, but is unlikely to truly love them. The bruises, harsh words, relentless belittlement, and smothering control do not form connections of affection; rather sow seeds of resentment that blossom over time. A parent may believe that rigorous punishment is in the child's best interests and that obedience and submission demonstrate good parenting. But obedience born out of fear is fleeting—it lasts only until the youngster is old enough to flee. Once free of parental influence, they have to decide whether to forgive and continue the relationship, or to walk away and heal on their own terms.\nThis takes us to the disturbing reality that many people refuse to acknowledge. The same parents who feel betrayed and abandoned in old age may have once betrayed their own children's trust. Social media videos of a father verbally abusing his child or a woman beating hers in a fit of rage serve as a harsh reminder of this. It is a picture that is all too typical in homes where physical punishment is acceptable. Society dismisses it as \"strict parenting\" or \"necessary discipline,\" but how does it seem from the child's perspective? To them, punishment is brutal, and lack of affection is a reminder that their feelings are unimportant. Years later, when that same child chooses to create distance from their parents, society will rush to condemn not considering the suffering that led to their decision.\nNobody is born with resentment toward their parents. A youngster seeks love, stability, and warmth. Upon receiving these, they will develop into adults who naturally reciprocate care. However, if they grow up in terror, constantly walking on eggshells to escape punishment, they will see their parents are oppressors rather than guardians. They learn that love in their home is conditional and that they are only valued upon compliance without question. This awareness eventually hardens into emotional detachment. And one day, when the roles are reversed and the parents are in need, they may be met with the same indifference they once demonstrated in response to their child's anguish.\nThis does not imply that all the children who distance themselves from their parents are justified. There are several cases where children, despite being nurtured with love, care, and sacrifice, turn their backs on their ageing parents out of selfishness, greed, or outright disregard. In every community, there are those who regard their parents as burdens rather than people who commit their lives to raising them well. Many families have children who disrespect their parents from adolescence to maturity, take advantage of their goodwill, and forsake them when no longer needed. They are not acting out of trauma or pain, they are just heartless. Some people abandon their elderly parents without a second thought, refusing to check on them. Others take advantage of their parents financially, only to abandon them when they have nothing more to give. These people taint the actual hardships of those who have endured at the hands of abusive parents, making it more difficult for society to discern between justifiable alienation and simple neglect. In such circumstances, the children, not the parents, have failed as human beings.\nEvery case of parental abandoning is not justifiable and not every parent-child relationship fits this pattern. However, this is an important point of view. In a society where children grow up reading the stories of Bayezid Bostami's devotion to his mother, we must question what went wrong that led some to do the exact opposite to their parents. Before blaming children for abandoning their parents, one must consider what prompted that decision. Love must be nurtured, not demanded. Respect cannot be forced upon a youngster; it must be gained through love and understanding. \nThe unfortunate truth is that many parents, in their desire for control, unintentionally shape their own fate. Loneliness in old age is not always the outcome of an ungrateful child, but sometimes of a child who was raised to believe that their grief was insignificant. And when that child is eventually given the opportunity to choose, they may choose a life free of the folks who caused them pain. The cycle of villainy in this case does not begin in maturity, but in childhood. Villains are not born; they are manufactured.\nMd. Shawkat Alam Faisal is an apprentice lawyer at Bangladesh Bar Council.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our submission guidelines.\n",
        "headline_1": "Parental neglect may create uncaring children",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/parental-neglect-may-create-uncaring-children-3845031",
        "news_paper_name": "The Daily Star",
        "publish_date": "12-03-2025"
    },
    {
        "full_article": "Umama Fatema, a student of Kabi Sufia Kamal Hall, Dhaka University, and spokesperson for the Anti-Discrimination Student Movement, talks to Naznin Tithi of The Daily Star.\nIn the past six months, we have seen that the state has completely failed to ensure the safety of women. If the increased oppression of women in society is seen merely as a deterioration in overall law and order, it will only exacerbate their insecurity. Instead, the question of women's safety needs to be addressed with special importance because 50 percent of our population are women, and they are being targeted specifically because of their gender. Whether it's harassment on the streets or the rape of young children, these incidents have increased to an alarming level.\nClearly, many are taking advantage of the deteriorating law and order situation and assaulting and sexually harassing women and girls across the country. However, the government could have taken initiatives to ensure justice in these cases. It could have made an effort to address violence against women and cyberbullying that took place previously. Sadly, the government has been evading its responsibility by putting the blame on the worsening law and order situation. I believe that the current situation has arisen because of a lack of action taken against the perpetrators in previous cases. The situation will likely worsen further in the future if the government does not take responsibility for this.\n\nWe have formed a platform named Dhorshon Birodhi Moncho, protesting this situation and demanding justice. We have gone around our university campus calling upon all students to come and join us. Together, we have announced this platform. Our aim is to spread this movement across Bangladesh. We want the students of every university and general citizens of the country to take a stand against persistent violence against women, demanding justice for the rape incidents and proper steps from the government to remove the insecurity faced by women in general. We want to move forward collectively with our demands.\nAlthough women played a significant role in the mass uprising of July 2024, their voices have now become secondary. Whenever women raise their voices about their rights, they are subjected to violence and given various labels. Due to such \"tagging,\" the voices of women have become weaker. We want to make it clear that no matter how much tagging, bullying, or oppression we face, we will stand firm in our demand and end violence against women once and for all. If we, as women, do not raise our voices collectively, no one will come and change the situation for us; no one will come to secure our rights for us. We must unite and make our voices heard.\nIf women's political participation increases, their opinions will gain importance in policymaking. Greater inclusion of women in politics would also foster sensitivity towards gender issues. However, if women are included in politics merely as tokens, they hold no power within their parties. Even though women hold reserved seats in the government, they often lack importance. Therefore, we do not see any genuine representation of women's voices in the government. Within the existing power structure of Bangladesh, women are still considered secondary. As a result, issues like violence against women, sexual harassment, and rape are not given much importance by the state. A major reason for this is that the state is not sensitive enough towards these issues, nor are its policymakers. So, they do not view these issues as important; they consider them a secondary matter.\nWe are currently holding protests to demand justice for the existing incidents of sexual violence in society, including the rape of an 8-year-old child from Magura and other cases. Additionally, we are calling for amendments to the existing rape laws.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our submission guidelines.\n",
        "headline_1": "State must ensure women’s safety",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/state-must-ensure-womens-safety-3844991",
        "news_paper_name": "The Daily Star",
        "publish_date": "12-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Finding a solution to industrial gas tariff disputes",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/finding-a-solution-to-industrial-gas-tariff-disputes-1741704956",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Protecting consumer rights - more than a legal priority",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/protecting-consumer-rights-more-than-a-legal-priority-1741705051",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Where is women's safety?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/where-is-womens-safety-1741705080",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Breaking the cycle of food insecurity",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/breaking-the-cycle-of-food-insecurity-1741705115",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-03-2025"
    }
]