[
    {
        "full_article": "The security breach where a Khalistani protester approached External Affairs Minister S. Jaishankar’s car in London overshadowed the headlines on his week-long visit to the United Kingdom and Ireland. And the Ministry of External Affairs (MEA) made its displeasure clear to the Minister’s British hosts. The scheduled visit, however, was not changed and Mr. Jaishankar side-stepped the scare, announcing that India-U.K. relations were set for a “very big pickup” despite their “complex history” and current problems. India is building its capacities in the U.K., with two consulates, in Manchester and Belfast, while Mr. Jaishankar’s extended talks with U.K. Foreign Secretary David Lammy focused on the much-delayed conclusion of a Free Trade Agreement (FTA). The Agreement, which was due to be finished after U.K.’s ‘Brexit’ in 2020, has missed deadlines. Talks over an FTA dominated discussions in Ireland too, and came days after India and the European Union (EU) committed to concluding their Bilateral Trade Agreement (BTA) — for which talks began in 2007 — by the end of 2025. Bilateral trade with the U.K. ($52 billion) and Ireland ($17 billion) are underpowered, and discussions on enhancing collaborations, especially in high-tech trade, were on the agenda in both capitals. The FTA talks, India-U.K. (restarted last month) and India-EU (another round this week), will benefit from India’s more conciliatory position on import duties with the U.S., which have been a sticking point for them as well. The government’s decision to reduce tariffs on wines and spirits, motor and electric vehicles, in deference to U.S. President Trump’s demands, is a case in point, and more cuts are expected in negotiating an India-U.S. BTA.In that sense, Mr. Trump’s reordering of U.S. alliances and trade policy may well have been the wind in Mr. Jaishankar’s sails. The trip followed visits to Delhi by a high-power EU delegation led by European Commission President Ursula von der Leyen and a senior ministerial and business team led by Belgian Princess Astrid, that imparted the sense that Europe is looking for new, more dependable friends. Mr. Jaishankar’s visit also came close on the heels of the dramatic showdown at the White House between Mr. Trump and Ukrainian President Volodymyr Zelenskyy, which led to an urgent summit of non-U.S. NATO countries being held in London, where U.K. Prime Minister Keir Starmer committed to support Ukraine with a “Coalition of the Willing”. As geopolitical and geo-financial calculations are being reworked across the Atlantic, India stands to gain by accelerated diplomacy and offering a hand of friendship to both sides.\r Published - March 10, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        Ireland\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        European Union\n                    \n                            /                      \n                        \n                        beverages\n                    \n                            /                      \n                        \n                        automobile\n                    \n                            /                      \n                        \n                        Electric vehicles\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Ukraine\n                    \n                            /                      \n                        \n                        NATO\n                    \n                            /                      \n                        \n                        Canada\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        Brexit",
        "headline_1": "​Building capacities: On India and Europe trade talks",
        "headline_2": "India can gain from accelerated trade diplomacy in Europe",
        "link": "https://www.thehindu.com/opinion/editorial/building-capacities-on-india-and-europe-trade-talks/article69309972.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "10-03-2025"
    },
    {
        "full_article": "It was Donald Trump who sabotaged the 2015 Joint Comprehensive Plan of Action (JCPOA), better known as the Iran nuclear deal. When Mr. Trump, in his first term as President (2017-21), unilaterally withdrew the U.S. from the agreement in May 2018, Iran was fully compliant with the terms. Mr. Trump then adopted his ‘maximum pressure’ policy aimed at forcing Iran to renegotiate the deal — a move which Tehran rebuffed. Last week, Mr. Trump said he had sent a letter to Iran’s Supreme Leader Ayatollah Ali Khamenei, asking him to reopen dialogue or risk military action. While the letter’s details are still private, it took only two days for the Iranian leader to reject the outreach. Mr. Khamenei said “some bullying governments” insist on talks not to resolve the issue but to impose their deals. Iran’s reaction is not entirely surprising. In 2013, Tehran had taken Barack Obama’s overtures quite seriously. Mr. Khamenei had fully backed the Hassan Rouhani presidency’s bid to negotiate with the West. And they had reached a result-oriented agreement which cut Iran’s path towards nuclear weapons in return for the lifting of international sanctions. Now, when the American leader who demolished the functional agreement reaches out to them, the Iranians are sceptical for obvious reasons. Yet, there is a compelling argument to retake the path of diplomacy.In 2018, when Mr. Trump imposed maximum pressure, Iran responded with maximum resistance. This mutual brinkmanship escalated regional tensions — Saudi Arabian oil facilities came under attack, Iran shot down an American drone, the U.S. assassinated Gen. Qassem Soleimani and Tehran retaliated with a missile strike on an American base in Iraq. While Mr. Trump’s White House exit in 2021 ushered in the hope that the nuclear deal could be revived under the Biden administration, it did not happen. Over the four years, the region has seen dramatic developments. Today’s Iran is weaker than what it was in 2020. Israel’s war against Hamas and Hezbollah has weakened the ‘Axis of Resistance’. Last year saw Israel and Iran exchange attacks. The fall of Syria’s Assad regime, Tehran’s only state ally in West Asia, in December 2024, shrank Iran’s strategic depth in a hostile region. The country is also in deep economic pain, and the Israelis seem willing to take greater military risks, provided they have American backing. Amid challenges, Iran reportedly possesses enough high-grade fuel to produce weapons — Mr. Trump has acknowledged this with his ‘we are reaching a critical point’. The U.S. wants to resolve the nuclear problem and Iran wants lasting economic and diplomatic reprieves. Beneath the hostility, there is a strategic possibility to resume dialogue. There is no harm in the Iranians giving it a second chance. Published - March 10, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Iran\n                    \n                            /                      \n                        \n                        nuclear policy\n                    \n                            /                      \n                        \n                        defence\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        economic sanction\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        Saudi Arabia\n                    \n                            /                      \n                        \n                        Syria\n                    \n                            /                      \n                        \n                        nuclear weapons",
        "headline_1": "​Second chance: On the U.S. and the Iran nuclear deal",
        "headline_2": "Iran has reason to be wary of Trump’s dialogue proposal",
        "link": "https://www.thehindu.com/opinion/editorial/second-chance-on-the-us-and-the-iran-nuclear-deal/article69309402.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "10-03-2025"
    },
    {
        "full_article": "Playing the party game with your mental rolodex\nSo we are at this swank party and enjoying the ambience when a guy thumps me on the back and says, my goodness it is you, fancy meeting you here, long time no see, where have you been hiding? I am blank, no clue as I desperately riffle through my mental rolodex. Now, it would be so much more sensible to say sorry, can’t quite place you but no, we have to play the social game and pretend and lie through our teeth as we Sherlock our way through a forest of social niceties.\nSo, I open the bid with good to see you too, how are you these days, that being par for the course. Mostly in Cape Town, he says, you still living here, how long has it been, over twenty years since we last met. I nod, now searching for some other spotlight, some glimmer of recognition but the turn of the century, now that is a clue. “And how’s work, doing well?” Not bad…and you? “Pretty good, a million here, a million there, you know how it is in my business.”\nActually, I don’t, so I say, tough times, still blankety blank about who he is and nothing further coming on his business. You are looking good, he says, you have kept fit. Not so bad yourself, I respond, you look just the same. All this feeling around brings us to a momentary silence then I say, staying in town long? He says, a week at least, then off to Japan. \nIn a bid to make up for the guilt of not being able to place him I dive deeper into the darkness and say then we must get together. Catch up with old times, he says, will be fun, you in touch with any of the old gang? Good lord, did we belong to the same gang? Where was this gang? I am in touch with Ravi, he says. Now I am wrestling with which Ravi. Everyone knows a Ravi or two.\nHalf a dozen clichés tumble out from both sides about stuff like great to catch up, let’s not wait this long for the next round, recall the good times, let’s make it soon. Then he says, by the way, what’s your name? I raise my eyes in surprise. You don’t know my name? He says nope, as a matter of fact I don’t know you either, we haven’t ever met, I just do this for fun, adds zip to the evening, everyone falls for it. No one has ever called me on it, isn’t that incredible, it is a riot watching folks struggling to place a stranger. Then he puts out his hand and introduces himself.\n\n",
        "headline_1": "Catch me if you can",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/catch-me-if-you-can-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-03-2025"
    },
    {
        "full_article": "Trump’s offer of a new nuclear pact may be a long shot. India, however, will be hopeful of a Tehran reset \nIn another interesting move, Trump sent a letter to Iran over the weekend asking the Islamic Republic to negotiate a fresh deal over its nuclear programme. Recall that it was Trump himself who had withdrawn from the 2015 Iran nuclear deal during his first term as part of his so-called “maximum pressure” campaign. That, of course, was a huge US self-goal. It did not crack the Islamic Republic, pushed it closer to China and made it an ally to Russia in the ongoing Ukraine war. Moreover, at the time Trump pulled out of the deal, Tehran was fulfilling all its obligations under the nuclear pact. \nInexplicably, however, even Biden did not make a course correction during the last four years. While the Ukraine war made this politically unfeasible from 2022 onwards, he could have set things right in 2021 itself. Nonetheless, Trump’s offer now seems to be an admission of mistake on Washington’s part. But Tehran, having been betrayed once, is naturally more sceptical. Plus, its involvement in the Ukraine war means that it’s now solidly in the China-Russia camp. \nOf course, US sanctions on Iran have been a huge problem for countries like India that fulfilled a significant quantity of their energy needs through imports from Tehran. The sanctions also stymied the development of India’s transit route to Afghanistan via Iran’s Chabahar port. Therefore, a new deal that lifts sanctions on Iran will be great news for New Delhi. But will Tehran take the offer? Initial reactions from Tehran are not encouraging with Ayatollah Khamenei rejecting talks with “bullying govts”. Besides, Iran’s nuclear enrichment has advanced significantly in the interim, reaching 60% purity – just below weapons grade. \nAlso, with China and US now locked in a trade war, Beijing will play its all-weather-friend card with Tehran to keep it on its side. All of this could also be a Trump bluff to get the Arab nations to fall in line over Israel and Gaza. So, the new Trump offer is a long shot. But a deal that normalises US-Iran relations would be good for India and much of the Global South. \n\n",
        "headline_1": "Iran deal 2.0?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/iran-deal-2-0/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-03-2025"
    },
    {
        "full_article": "Hampi tourists’ nightmarish suffering isn’t a one-off. It’s part of what women live through in India \nThe crime scene, near Hampi, is painfully picturesque. Gently swirling canal waters ahead, craggy rocks beyond and clear sky above, it’s easy to see why a friendly group chose this site to stargaze and play the guitar. Then, the idyll turned into a nightmare. Don’t variations of this happen to many women in India? The two women in Hampi, an Israeli tourist and her homestay host, were raped. The three men, tourists from US, Maharashtra and Odisha, were thrown into the canal. The Odia tourist hasn’t survived. Yes, police has swung into action, arrests have been made. But once again, we have been reminded that a decade plus after the Nirbhaya case, brute sexual violence continues to run rampant across our country. And while it brutalises women the worst, the men who love them, or simply accompany them, have no security either. \nA lot of political outrage is along party lines. This too is common and reflects a hellish normalisation of sexual brutalities. Last year, after a Spanish tourist travelling with her partner, was gang-raped in Jharkhand, guess what our National Commission for Women was concerned about? That the entire country shouldn’t be ‘vilified’. Its chairperson proclaimed that “over 6mn tourists arrive in India every year, many of them are single women, and they holiday safely in India, as India takes the safety of women very seriously.” Note that Albania, one-sixth the size of Karnataka, gets 12mn foreign tourists. And India regularly ranks among the most dangerous countries for solo women travellers. The basic fact is that Indian women are unsafe in India, and foreign women necessarily end up sharing this condition. \nRape is a “national problem”, said UN’s human rights chief post Nirbhaya. Do those words sound over-harsh? But hearing them can in no way be harsher than living them. Indian women live in a society where marital rape is legal. Even a wife’s subsequent death doesn’t weaken a husband’s immunity, a high court said last month. Perhaps the Hampi rapists’ experience with the law had taught them that it wouldn’t take their crime too seriously. Because, really, neither does India. \n\n",
        "headline_1": "Rape & reality",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/rape-reality/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-03-2025"
    },
    {
        "full_article": "Yajnadevam, aka Bharath Rao, is a rare cryptographer – among epigraphists, archaeologists, linguists etc – who can claim to have cracked the code to deciphering the Indus Valley script. The earliest pottery with Indus script symbols dates to 4,000 BCE. Ever since, the Indus script has resisted attempted decipherments.\nMany ancient scripts were deciphered using bilingual or trilingual inscriptions. Champollion’s decipherment of Egyptian hieroglyphics was based on the fact that the Rosetta Stone (found during Napoleon’s invasion of Egypt) had the same Greek names written in ancient Greek and hieroglyphics.\nRead full story on TOI+\n\n",
        "headline_1": "Decoding 6K-year-old language can bury modern myths",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/decoding-6k-year-old-language-can-bury-modern-myths/",
        "news_paper_name": "The Times of India",
        "publish_date": "10-03-2025"
    },
    {
        "full_article": "Women are generally considered more religious than men. But do women get equal opportunities to develop their spiritual selves, get closer to God, or improve their devotional practices? In this essay, I address this question from the perspective of how Ramadan is observed in Muslim societies.\nTo foreground my discussion, I describe below some stereotypical notions about men and women.\nFor a long time in the West, men and women were presented as binary opposites. Women were associated with the body, fleshliness, emotion, etc and men with the soul, spirituality, and reason. Women's roles and responsibilities were determined by their relations with men, not with God. As Swiss-French philosopher Jean-Jacques Rousseau (1712-78) put it:\n\"[Women's] education must be wholly directed to their relations with men. To give them pleasure, to be useful to them, to win their love and esteem, to train them in their childhood, to care for them when they grow up, to give them counsel and consolation, to make life sweet and agreeable for them: these are the tasks of women at all times for which they should be trained from childhood.\"\nRousseau's Emilius and Sophia (1763) contains many such ideas. In Britain, an entire genre of conduct books was devoted to inculcating such beliefs and values among women. They include James Fordyce's Sermons for the Young Women (1766), Hester Chapone's Letters on the Improvement of the Mind (1773), John Gregory's A Father's Legacy to His Daughters (1774), Thomas Gisborne's An Inquiry Into the Duty of the Female Sex (1797), and Jane West's Letters to a Young Lady (1811).\nMary Wollstonecraft's A Vindication of the Rights of Woman (1792) presented a detailed critique of such sexist ideas of Rousseau, Fordyce, Gregory and other philosophers.\nWomen's subservience to and their need to tailor their life to satisfy the needs of men were embedded in the Victorian psyche. European colonists spread such ideas in colonies and shaped indigenous gender ideologies and practices. Thus, many Victorian notions of women's status and roles entered Muslim societies and even gained a quasi-religious colouring.\nIn Islam, men's and women's roles and responsibilities are determined by their relation with God, not with the opposite gender. Obedience to humans is conditional to obedience to God. God has set certain boundaries which all believers are obligated to maintain and not to transgress. Moreover, in Islam, basic responsibilities of men and women are largely the same, and both genders are complementary to each other in leading a righteous life. The Qur'an (9:71) states, \"The believing men and believing women are allies of one another. They enjoin what is right and forbid what is wrong and establish prayer and give zakah and obey God and His Messenger. Those—God will have mercy upon them. Indeed, God is Exalted in Might and Wise.\"\nThe Qur'an (33:35) contains a long list of attributes of believing men and women, including \"men who fast and women who fast.\" That is to say, the command to fast in the month of Ramadan is identical for Muslim men and women. Verse 2:183 says, \"O you who have attained to faith! Fasting is ordained for you as it was ordained for those before you, so that you might remain conscious of God.\"\nBut do men and women get equal opportunities to make the best of the fasting month?\nOne key aspect of fasting is that believers are required to abstain from food and drink from dawn to dusk. According to Muhammad Asad (1900-92), among the reasons why God has prescribed the fast is \"to make everyone realise, through his or her own experience, how it feels to be hungry and thirsty, and thus to gain a true appreciation of the needs of the poor.\"\nMuslims are supposed to consume less food in the month of Ramadan. But the reality is far from this ideal scenario. Most Muslims have deviated from the true teachings of Ramadan by turning the practice of fasting into feasting. The price hike of food items in Muslim countries during Ramadan is an incontrovertible proof that, instead of consuming less, Muslims consume more food in the holy month.\nIn her essay \"Roshona Puja (Worship of the Tongue),\" Begum Rokeya says, \"Regrettably, in Ramadan the food frenzy among Muslims reaches the highest point. Instead of abstaining from the worldly activities and devoting oneself to heartfelt worship, the whole day is spent preparing for iftar [the evening meal for breaking the fast]. As a result, food intake [in Ramadan] increases instead of Muslims exercising restraint.\"\nMuslims' food habit in Ramadan contradicts the spirit that should characterise the holy month. There is a tendency to prepare sumptuous and abundant food for iftar and sehri (pre-dawn meal). This results in a lavish gastronomic extravaganza, which in turn leads to food waste. Consequently, in most Muslim countries, the amount of food waste in Ramadan is much higher than it is outside the fasting month.\nThe food frenzy in Ramadan has gender implications because, in domestic life, women are expected to cook. Even though it is common knowledge that Prophet Muhammad (PBUH) performed household chores, not many Muslim men are eager to follow his example. Men expect women to prepare food and put it on the table for them.\nIn fact, like Muslim men, Muslim women need to get closer to God through increasing their devotional practices in Ramadan. However, if they have to spend long hours in the kitchen to fulfil the illogical culinary demands of family members, how can they engage in prayerful activities and devote more time to reading the Qur'an and performing other righteous deeds? By expecting Muslim women to shoulder the full burden of household chores, caregiving and other domestic responsibilities, Muslim men are turning away from the Prophet's teachings. By the way, if preparing iftar and sehri is a virtuous act, it is so for both Muslim men and women.\nTransforming Ramadan from a month of fasting into one of feasting and then forcing women to cook extravagant iftar and sehri meals ruins the purpose of the holy month. During Ramadan and beyond, Muslims should organise family life in such a way that both men and women have equal opportunities to engage in devotional activities and achieve God consciousness.\nDr Md Mahmudul Hasan is professor in the Department of English Language and Literature at the International Islamic University Malaysia. He can be reached at [email protected].\n\nThis essay is based on a talk the author gave at ISM Brookfield in Wisconsin, US on February 23, 2025.\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Gender and spirituality: Role of men and women in Ramadan",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/gender-and-spirituality-role-men-and-women-ramadan-3843276",
        "news_paper_name": "The Daily Star",
        "publish_date": "10-03-2025"
    },
    {
        "full_article": "Coming of age\nAnisur Rahman and I have traveled together across the troubled landscape of Bangladesh's history over many years. We first came together in October 1957, when we were recruited as teachers by Professor M.N. Huda, then the Chairman of the Economics Department at Dhaka University (DU). Amongst his contemporaries, Anis was clearly the best-equipped to be an economist of distinction. He commanded formidable theoretical skills, underwritten by a creative mind, which enabled him to produce academic work of considerable originality. His Ph.D. thesis was a theoretical work dedicated to addressing the issue of regional disparity, which was deemed by his supervisor at Harvard to be of a level worthy of publication as an article in one of the profession's most prestigious journals, the Quarterly Journal of Economics (QJE).\nFrom an early age at the Economics Department, Anis engaged himself with social and political issues where he could use his skills as an economist to add value and quality to the public debates on regional economic disparity, which dominated the public discourse. When Anis returned from Harvard in 1961, equipped with a Ph.D., he was elevated to a Readership in the Economics Department.\nIn those days, along with Nurul Islam, Anis, Abu Mahmood, and me, the Economics Department served as a major source of comment and dissent on the issues of regional disparity, social injustice, and the political economy of policymaking under the cantonment-based regime of Field Marshal Ayub Khan. Nurul was invited to be a member of the Finance and Price Commissions set up by the central government, while Abu Mahmood, Anis, and I wrote on a variety of issues in the newspapers of that period. It was not surprising that the Economics Department of DU was viewed by the Ayub regime and its local satrap, Monem Khan, as a hotbed of subversion against the Pakistani state. The regime's hostility to the Economics Department culminated in a physical assault on its then Chairman, Abu Mahmood, by a group of hoodlums associated with a government-patronized student party, the National Students Federation (NSF).\nAnis believed that there was little scope for serious academic work within such a poisonous atmosphere in DU and so moved abroad on a fellowship to Yale University and eventually resigned from his position at Dhaka University. When Anis chose to return to Pakistan, he was not inclined to return to Dhaka University. Along with Professor Wahidul Haque, who was then teaching at the University of Toronto, Anis accepted a position as a Professor of Economics at Islamabad University, where he and Wahid together built the Economics Department into a faculty of recognized quality.\nIn this position, Anis could reach out to some of the brightest graduates of the Economics Department at DU, such as Wahiuddin Mahmud, S.R. Osmany, and Atiqur Rahman, among others, who moved to Islamabad to study for a master's degree in Economics under his tutorship.\nPolitical engagement\n\nDuring the last days of the Ayub regime, at the fateful Round Table Conference (RTC) in Islamabad in February 1969, which was attended by Bangabandhu Sheikh Mujibur Rahman, he invited Anis, Wahidul, and Nurul Islam to advise him during the negotiations. This was perhaps Anis' first encounter with Bangabandhu and, through him, with national politics. While some of us economists wrote and spoke on the politically incendiary issue of regional disparity, we remained academics. I had been more engaged with the political process through my relationship with H.S. Suhrawardy and, through him, with Bangabandhu, who had eventually invited Kamal Hossain and me to contribute to the preparation of the AL manifesto for the National Elections in 1964. But this was an episodic occasion. My more substantive engagement in the political process really dates from 1969, when Nurul Islam, Anis, and I were invited by Bangabandhu and Tajuddin Ahmed to become more directly involved with the democratic and nationalist struggle.\nWhilst still teaching at Islamabad, Anis joined Kamal Hossain, Nurul Islam, and me to prepare the election manifesto of the AL for the 1970 elections. Anis and Wahidul Huq eventually moved to Dhaka University to join the Economics Department as Professors, where Anis could more actively engage himself in the struggle. He wrote a number of influential articles in Forum, a weekly set up by Kamal, Hamida Hossain, and me, where he discussed the economic policy options for a forthcoming elected government in a self-ruled Bangladesh.\nIn the post-election period, Bangabandhu again invited Anis, Nurul, me, Sarwar Murshid, and Muzaffar Ahmad Chowdhury to advise him on how to incorporate the Six Points into the draft of the constitution being prepared by AL, which would underwrite the agenda for self-rule for the Bengalis, for presentation at the forthcoming meeting of the Constitutional Assembly scheduled to be convened in Dhaka in March 1971.\nThe sine die postponement by General Yahya Khan of the convening of the Assembly provided a clear signal that self-rule could not be attained peacefully within a United Pakistan and set the stage for the liberation war. The month of March 1971 witnessed a massive political mobilization across Bangladesh, which had few equals across the post-colonial world in contemporary history. Not only did all segments of the population in Bangladesh—public, official, and business—withdraw their cooperation from the government of Pakistan, but they pledged their allegiance to Bangabandhu, entrusting him with the responsibility to run the government. During this historic month, Bangladesh emerged de facto as an independent nation-state under the leadership of Bangabandhu.\nWhilst negotiations were eventually initiated between Yahya and Mujib to seek a peaceful resolution to the crisis, Anis was convinced, along with many others, that during the month of March, the Pakistan army was preparing for an impending massacre of the people of Bangladesh. He wrote letters to his many professional colleagues abroad, alerting them to such a prospective genocide and encouraging them to speak out against this impending atrocity.\nBoth Anis and I have written, in our respective memoirs, of our adventures in traveling out of Bangladesh following the military aggression on an independent Bangladesh, our encounters with the Indian leadership and Tajuddin Ahmed, the first Prime Minister of an independent Bangladesh, and our eventual engagement with the liberation struggle in 1971. During this period, Anis moved to the US, where he had been invited by Williams College in Massachusetts to serve as a visiting Professor. During this time, he periodically took time off to campaign for an independent Bangladesh along with the entire probashi Bangali community then active in the US. I was assigned by Tajuddin Ahmed to campaign for stopping global foreign aid to Pakistan, which engaged me throughout 1971 in the US, UK, and France. During this period, Anis invited me to give a lecture at Williams College on the Bangladesh liberation struggle. He then informed me that, as an act of solidarity with the freedom fighters, he slept on the floor throughout the war.\nPlanning for the people\n\nFollowing the liberation of Bangladesh on December 16, 1971, Anis immediately opted to return to Bangladesh and expected to resume his teaching position at Dhaka University. Bangabandhu frustrated this idea by insisting that Anis join Nurul Islam and me in setting up the Planning Commission and work with him in the challenge of constructing a 'socialist' Bangladesh committed to building a just and inclusive society. In this task, we were joined by Mosharraf Hossain. Both Mosharraf and Anis were skeptical about the idea of building such a progressive society within the prevailing political dispensation, but they decided to accept the challenge.\nI have written in the second volume of my memoir, Untranquil Recollections: From Dawn to Darkness, about the varying approaches of the four Members of the Planning Commission toward their responsibilities in government. Among the four of us, Anis was in many ways more emotionally involved with the idea of social change and was perhaps the most idealistic of his colleagues. He came into the Commission with misgivings, as he was not fully convinced that the ruling party really wanted change. However, once inside, he believed that they could be educated to take up the most radical positions.\nHe strongly believed in the importance of our leaders practising austerity in their lifestyles to set an example to the people who were themselves facing hardships. Among other suggestions, Anis proposed that the Prime Minister and his colleagues, including the Members of the Planning Commission, should get rid of their official cars and ride to their offices on bicycles. This may have been a good idea since the cars made available to the Ministers and the Planning Commission were hardly roadworthy. My own official vehicle, an ancient Land Rover, periodically broke down at public functions, much to my embarrassment. The Planning Commission declined to allocate public funds for purchasing new cars for official use due to the need for budgetary austerity.\nAnis argued that the Planning Commission should present the Cabinet with broad policy guidelines for constructing a more just society and should secure their commitment to these positions. Since the Ministers were rarely inclined to put themselves into confrontation with their rhetorical radicalism, it was hardly possible for Anis to secure categorical responses from the Cabinet or PM to such generalized proposals.\nAnis, however, lacked the inclination to work out his policy recommendations in detail. The process of studying the files or holding inter-ministerial consultations needed to prepare projects to operationalize his ideas was something he found profoundly tedious. In the first six months, as the Member in charge of the General Economics Division, he involved himself in much of the detailed work associated with budgeting, including the preparation of the First Annual Plan. He prepared a document that was both informative and self-critical, which is today unusual for a government publication. He was also associated with the work of the Committee on Agrarian Reform, set up by the Planning Commission under the leadership of Mosharraf Hossain, and helped in the drafting of the final report. Little came out of this progressive initiative by the Commission, but we received an education on the political economy underlying such reforms. Such a lesson may need to be learned by the Interim Government, led by Prof. Yunus, in setting out to implement its reform agenda.\nAnis remained frustrated with the details of administration. The lack of response to his policy guidelines, his own growing unease at being involved in a regime that he believed to be indifferent to the compulsion for social change, led to his progressive withdrawal from the day-to-day work of the Commission.\nFrom February 1973, Anis returned to his job as a Professor of Economics at Dhaka University, but he continued to remain a part-time Member of the Planning Commission. In this position, he attended meetings of the Commission, Cabinet meetings, and meetings with the Prime Minister, who was now Chairman of the Commission.\nAnis eventually took to writing a series of policy papers designed for the eyes of the Prime Minister. In this task, he had the concurrence of the Commission. In these papers, Anis gave expression to his philosophy and expectations for promoting change through the government. Whenever he prepared one of his visionary papers for giving direction to the economy and society, he requested Nurul, as Deputy Chairman, to pass it directly to the Prime Minister. Anis occasionally sought a bilateral meeting with the Prime Minister to persuade him to move on his proposals. It is not clear to what extent the Prime Minister responded to these ideas, but from the revealed actions of his regime, it would appear that little was done on Anis' recommendations. Anis has put all his missives to the Prime Minister on record in a volume published by him about his days in government titled, The Lost Moment.\nFrustrated by the lack of response from the regime to his ideas, Anis began involving himself in an initiative to engage his students at Dhaka University in village uplift work, which gradually took up more of his time. When he eventually resigned from the Commission in November 1973, he had for some time before virtually ceased to be a Member. He, however, did associate himself with the First Plan, which was prepared by the Commission in a record time of one year. Though he did not participate in its formulation, he made a number of useful comments on various sections, which were incorporated into the Plan. The document, which was finally presented to the Cabinet in the last quarter of 1973, had his approval and carried his signature. The First Plan remains a landmark document on the possibilities and preconditions for social change in Bangladesh at that time.\nFollowing the publication of the Plan, Mosharraf Hossain resigned from the Planning Commission at the end of 1973 and joined the Economics Department of Dhaka University as a Professor. I resigned from the Commission in September 1974 and took over as President of BIDS. Nurul Islam took leave from the Commission in 1975 and moved to Nuffield College, Oxford, where he remained until he joined the FAO in 1976.\nThe tensions within\n\nSome months prior to the assassination of Bangabandhu on August 15,  1975, Anis was invited to participate in a research project at the Asian Development Institute (ADI) in Bangkok. He was, thus, in Bangkok on August 15. Whatever his differences with Bangabandhu on policy, he remained a great admirer and was deeply shocked at the killings in Road 32. He was further disturbed by the jail killings on November 3 of the four leaders of the Mujibnagar government of 1971—Tajuddin Ahmad, Nazrul Islam, Mansur Ali, and Qamruzzaman—and took the fateful decision not to return to Bangladesh. He moved from Bangkok to the Institute of Development Studies (IDS) in Sussex on a fellowship but eventually took up a more permanent position at the ILO in Geneva towards the end of 1976 and remained in Geneva until his eventual retirement in 1990. Mosharraf Hossain and I joined Nurul Islam in Oxford at the beginning of 1976, but we eventually returned to Dhaka in 1979.\nIn effect, Anis remained in a state of self-exile from Bangladesh for around 15 years. As with Nurul Islam, who also permanently exiled himself from Bangladesh after August 1975, Anis was never comfortable with his status as an exile because his heart remained in Bangladesh. However, both Nurul and Anis felt obligated to their respective families and particularly their children to ensure them a stable, tension-free life with prospects for a good education.\nAnis never quite exorcised the tension from his consciousness over his abandonment of Bangladesh in favor of living a secure family life abroad. At the ILO, he did not occupy a very senior position worthy of his talents but sought to assuage his conscience by working on issues related to the self-empowerment of the resource-deprived all over the world. His pioneering work at the ILO on people-oriented research programmes (PORP) earned him a niche in the ILO policy pantheon. However, he discovered from his field experience that the fate of the disenfranchised could hardly be changed by UN advisors, however deeply motivated they were. He recognized that he needed to be engaged on the ground, accepting all the risks and discomforts associated with any enterprise for social change if he was to have an impact on improving the lives of the disempowered.\nBy the time Anis retired from the ILO, he had become disenchanted with the discipline of economics and refused to be categorized as an economist. Back in Bangladesh, now in his 60s, Anis joined one of his close friends and colleagues in the UN, Shamsul Bari, to establish Research Initiatives Bangladesh (RIB), where he could propagate the philosophy of PORP by encouraging self-directed research on and among some of the least privileged communities in Bangladesh. However, this was no substitute for fully re-engaging himself with his earlier aspirations of changing the lives of the underprivileged.\nThis contradiction within Anis—of wanting to work for and with the shorbohara but never being able to sacrifice his middle-class compulsions to prioritize his family needs and to continue to live a life, however austere compared to the new middle class of Dhaka—could never be reconciled by him. Sadly, such contradictions are not unique to Anis and apply to a wider constituency of left-wing intellectuals in Bangladesh, who have moved away from the austere lifestyles once practiced by the left in South Asia in an earlier era.\nFortunately, Anis could redirect some of his frustrations as a social reformer through his passionate commitment to the works of Rabindranath Tagore, particularly Rabindra Sangeet. In Geneva, Anis served as the cultural guru who brought the resident Bengalis together every Sunday to enjoy the practice of Rabindra Sangeet and to preserve links with their cultural roots. Anis retained his commitment to the Bard, continued to practice Rabindra Sangeet at a level where he could periodically give public recitals, and eventually wrote a scholarly volume of some originality on modes of singing Rabindra Sangeet, which put him into fierce contestation with traditionalists at Chhayanaut, such as Waheedur Rahman and Sanjida Khatun. He was eventually associated with and co-edited a scholarly volume with Muchkund Dubey and Imtiaz Ahmed, commemorating the birth centenary of Tagore.\nA sad farewell\nAnis lived a highly disciplined life wherever he was. I had the occasion to experience his lifestyle when I was invited by Dr. Manmohan Singh at the end of 1989 to spend two months with him in Geneva at the South Commission, working to prepare a report on reforming the global economy from the perspective of the South. During my time in Geneva, Anis insisted that I stay with him in his small apartment outside the city. His wife, Dora, was away in the US with her daughters but had carefully packaged and labeled meals for us to last two months.\nDuring my stay, I shared Anis' disciplined lifestyle, which meant rising at 6:00 am, departing for work in Geneva at 7:00 am, taking an evening walk with him along the lakefront—where I could never keep up with his brisk pace—having an early dinner, and retiring to bed by 10:00 pm. Saturdays were devoted to marketing, and Sundays to Rabindra Sangeet. I cannot claim to have faithfully adhered to this monk-like lifestyle, as my own way of life is constructed on more anarchic terms. However, I can certainly say that I emerged in better health after my two months with Anis, during which I came to more fully appreciate his disciplined and principled approach to life.\nIronically, such a disciplined and healthy lifestyle should have rewarded Anis with a long, healthy, and comfortable life. But, sadly, Anis developed a severe case of diabetes. This required an even more disciplined lifestyle and dietary pattern, but it did little to contain the seriousness of his disease.\nThe stroke that silenced and immobilized his wife, Dora—also a dear friend of Rounaq and me—appeared to have had a life-changing impact on Anis. Dora was Anis' great love and life support. He spent the last few years of Dora's life sitting by her side, but she never recovered from her stroke. When she eventually passed away, Anis went into a state of decline and eventual withdrawal from the world. His last years, lying silently in bed in his apartment in Segun Bagicha, cut off from the world, with no family members around and looked after by aides, provided a sad end to one of Bangladesh's most committed and talented sons.\nI hope that the memory of Anisur Rahman can be revived and immortalized through the compilation and publication of his diverse body of work across disciplines, and that an accurate and insightful account of his services to Bangladesh and Bengali culture can be faithfully recorded and shared with posterity.\nProfessor Rehman Sobhan is one of Bangladesh's most distinguished economists and a renowned public intellectual. He is also the founder and chairman of the Centre for Policy Dialogue (CPD), a leading think tank in Bangladesh.\n",
        "headline_1": "Anisur Rahman Farewell to a fellow traveler",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/focus/news/anisur-rahman-farewell-fellow-traveler-3843641",
        "news_paper_name": "The Daily Star",
        "publish_date": "10-03-2025"
    },
    {
        "full_article": "The reference to \"fascist\" appears prominently in the Preamble proposed by the Constitution Reform Commission. I shall argue that there are good reasons for avoiding that reference.\nThe very first paragraph of the proposed Preamble asserts that \"(we have) forged united resistance against autocratic and fascist rule in order to establish democracy.\" The second paragraph goes on to proclaim \"the ideals of democracy and anti-discrimination that united (us) against fascist rule in 2024.\" It is obvious that, without naming names, the Preamble is referring to the \"July uprising\" against Sheikh Hasina's autocratic regime. The student leaders who valiantly led that mass uprising made frequent use of the words \"fascism\" and \"fascist\" while describing the regime they were fighting against, and not surprisingly, these words soon came to permeate the entire popular discourse on the uprising. Evidently, in trying to reflect the spirit of \"July uprising,\" the proposed Preamble also captured the most ubiquitous vocabulary that came into currency along with that spirit.\nIt is nonetheless a mistake for the Preamble to use that vocabulary. Two kinds of error are involved here—one conceptual and the other political. The conceptual error is that, strictly speaking, the term fascism is not a correct description of the oppression meted out by the last regime. And the political error is that by describing Hasina's regime as fascist, we are unwittingly granting it a somewhat elevated status it does not deserve. The latter error is more important for practical reasons, since, as I am going to argue, it amounts to watering down the ugliness and barbarity of the Hasina regime.\nBut let me begin with the conceptual error, from which the political error follows as a logical corollary. The root of the problem lies in an inadequate appreciation of what the idea of \"fascism\" actually stands for. Like most other \"isms\" such as communism, nationalism, liberalism, conservatism, etc, fascism is essentially a political ideology that has a distinct ideal—a conception about the kind of society worth striving for. The core of this ideal is the conviction that the objective of politics (in the broadest sense) should be to serve the interest of the \"collective entity\" of the state or the nation, as opposed to the interest of the \"individual persons\" who constitute the state. In other words, it is the \"greatness\" of the collectivity called state, rather than the \"well-being\" and \"freedom\" of individual persons, that is the supreme goal of all activities of a fascist regime.\n\nThis ideology leads inevitably to a number of pernicious consequences that have historically been responsible for giving fascism the bad name it has, rightly, acquired. First, in search of \"greatness\" of the state, fascist rulers have tended to engage in \"militarism\" and \"expansionism,\" leading to disastrous military conflicts in Europe in the 20th century. Second, since individual persons are supposed to exist only to serve the interest of the collective called state, fascist rulers have found it fit to ruthlessly suppress all kinds of individual freedoms, such as freedom of speech, freedom to dissent, etc, so as to prevent anything that could be even remotely deemed to be subversive of the state. The same ideology also paves the way for rule by a \"great\" dictator, who is supposed to be a human embodiment of the \"collective,\" and who usurps the responsibility of pursuing the greatness of the state, at whatever cost of the well-being and freedoms of individuals. On the economic front, the faith in the supremacy of the collective tends to create a highly regimented and state-controlled economic system, where private initiatives are viewed with deep suspicion. A fascist regime is thus characterised by the following features: inherently militaristic in its outward orientation, unashamedly authoritarian in its political system, and strictly regimented in its economic institutions.\nIt is now easy to see why the term fascism does not correctly describe Sheikh Hasina's regime. For one thing, her regime was not militaristic in its outward orientation. Secondly, the economic system was far from being state-controlled and inimical to private entrepreneurship. On the contrary, it was an utterly rotten case of crony capitalism in which Hasina's cronies were given a free hand to loot public resources for private gain. Apparently, then, the only similarity with fascism was the authoritarian political system, but there is a fundamental difference here, which is the main focus of my argument.\nAs noted above, the authoritarianism of a fascist regime stems from a political ideology that eulogises the collective over the individual. In contrast, one can argue that Hasina did not have any ideology at all. It was her megalomania and an unquenchable thirst for personal power, rather than the interest of the \"collective state,\" that motivated her brutality.\nThe gist of the matter is that while all fascist regimes are authoritarian, not all authoritarian regimes are fascist. An authoritarian regime can be called fascist only when it is driven by the political ideology of the supremacy of the collective over the individual. Hasina was not driven by any such ideology; hence, it's a mistake to use the term fascism to describe her regime.\n\nAt this point, one might be tempted to ask: does this semantic issue really matter for practical purposes? What's the problem if we continue to use the word \"fascism\" in its popular meaning of \"brutal authoritarianism\" so long as everyone understands that this is what it means? This is where the matter of political error comes in.\nRecall that fascist authoritarianism stems not from personal greed for power (although in some cases such greed may accentuate the brutality of fascist rule), but from an ideological reverence of the collective over the individual. There is thus an element of \"selflessness\" associated with the ideology of fascism—and this element can by default impart a degree of respectability to any regime described as fascist. True, it would only be a limited respectability since fascism has itself fallen into disrepute because of its association with militarism and suppression of individual freedoms. Nonetheless, its association with \"selflessness\" does leave room for a modicum of respectability, which a non-fascist authoritarian regime, based on selfish greed, cannot claim. So, if we describe Hasina's regime as fascist, then whether we intend it or not, we are implicitly giving the regime a veneer of respectability by suggesting that she was driven by a selfless political ideology rather than by purely selfish greed for power.\nThat's the political error. The student leaders might have thought that by describing Hasina's regime as fascist they were condemning it more strongly than they could by describing it simply as authoritarian or autocratic or tyrannical, but they failed to realise that they were actually doing the opposite.\nI suspect the dynamics of language are such that brandishing of the terms fascism and fascist will continue to pervade the popular political discourse in Bangladesh, no matter who says what. Perhaps, one can live with that. The layperson may be excused for not appreciating the fact that not all authoritarian regimes are fascist. The students should have known better, but perhaps they may be excused too.\nBut the same cannot be said for the members of the Constitutional Reform Commission. The constitution of a nation is a sacred document—one that will be preserved for posterity. We must not allow its pages to be desecrated by the misuse of language that involves conceptual and political errors of grievous nature. We should, therefore, delete all references to fascism in this document and describe Sheikh Hasina's fallen regime for what it was—a brutally tyrannical autocratic regime built upon megalomania, selfishness, and unbridled greed for power.\nS. R. Osmani is professor of economics at Ulster University in the UK.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Hasina regime was uglier than fascism",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/hasina-regime-was-uglier-fascism-3842566",
        "news_paper_name": "The Daily Star",
        "publish_date": "10-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Cutting food aid for Rohingya is inhuman",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/cutting-food-aid-for-rohingya-is-inhuman-1741532763",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Meeting anaesthesiologist crisis in hospitals",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/meeting-anaesthesiologist-crisis-in-hospitals-1741532887",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Uncertainty and hopelessness stare Rohingya in the face",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/uncertainty-and-hopelessness-stare-rohingya-in-the-face-1741532930",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Reduce cold storage charges",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/reduce-cold-storage-charges-1741532953",
        "news_paper_name": "The Financial Express",
        "publish_date": "10-03-2025"
    }
]