[
    {
        "full_article": "For the first time in over 50 years, India has been told that it is on the threshold of a full-scale war. The drills seek to bring that war into the people’s consciousness, not as a media event but as a way of preparing them for what could unfold in their lives. Civil defence preparedness is a key element of war strategy. These drills will help to take stock of how common people, those responsible for key civil assets and trained personnel, will interact and act in a war-like situation. Defence preparedness is another matter altogether. The government led by Prime Minister Narendra Modi has not baulked at national, war-like mobilisations. From demonetisation through Swachh Bharat to the lights off during COVID-19 that also tested electric grid resilience, there have been many projects that have sought to tell the people that they have to be in mission-mode. Grid resilience is once again being tested by the drills through blackouts.Wars and war-like simulations can serve to bring up consciousness and produce more social cohesiveness and a focus on common, larger goals. They can prepare the people for hardships without their losing morale. The other side is, of course, destruction. In the eyes of many, including possibly the government, Pahalgam was India’s 9/11, if not in its scale but in the response. This view holds that Pakistan is the Afghanistan of 2001 — a nation coming apart with only religious zealots holding it together using terror as the only statecraft. George W. Bush’s “I hear you” in the rubble of the World Trade Center was followed by a blitzkrieg that sought to bomb the nation into the Stone Age. The U.S. had zero risk of any retaliation then. Prime Minister Narendra Modi’s promise to pursue terrorists to the end of the earth comes with the risk of a furious retaliation if the pursuit means full-fledged war. While testing civil defence preparedness is one thing, a real war is a highly dangerous escalation that will do little good to the narrative of India being an economic powerhouse ready to take its place in a multipolar world as a true and responsible leader. The government must keep its options open so that Pakistan may be persuaded to walk back from the brink by agreeing to hand over terror leaders of the LeT, JeM and fringe outfits. India’s non-muscular response to 26/11 brought much shame to Pakistan and the Pakistani media willingly brought more shame to its government by turning its focus on Ajmal Kasab’s village and family. Perhaps the civil defence preparedness drills will serve as psy-ops, signalling India’s intent that could make Pakistan see the folly of using terror as a tactic in geopolitical disputes.\r Published - May 07, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        safety of citizens\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        war\n                    \n                            /                      \n                        \n                        India-Pakistan\n                    \n                            /                      \n                        \n                        Demonetisation\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        Afghanistan\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        terrorism (crime)",
        "headline_1": "​Persuasion strategy: On the civil defence preparedness drills",
        "headline_2": "Pakistan must hand over designated terrorists to India",
        "link": "https://www.thehindu.com/opinion/editorial/persuasion-strategy-on-the-civil-defence-preparedness-drills/article69545212.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "07-05-2025"
    },
    {
        "full_article": "Gaza, as the Red Cross has put it, has already become “hell on earth”. In 19 months, Israeli forces have killed more than 52,000 Palestinians in the enclave, most of them women and children. Nearly all of Gaza’s 2.3 million residents have been displaced, many, multiple times. Tens of thousands have been wounded in a territory that lacks even basic medical facilities. Israel has imposed a renewed siege on the 365-sq.-km strip, deepening an already dire hunger crisis, and threatening, as the UN Human Rights Office warned, the viability of the Palestinians continuing to live in Gaza. Prime Minister Benjamin Netanyahu’s government has decided to call up tens of thousands of reservists and launch an intensified ground offensive in the enclave, aimed at capturing and holding territory, and taking direct control of aid delivery. Israel has already reduced to rubble much of northern Gaza, and forcefully moved the over one million people who used to live there before the war began in October 2023. Now, Mr. Netanyahu says that as part of the new offensive, Palestinians would be moved again from their makeshift shelters and refugee camps. The Israeli government claims that “military pressure” is the only way to force Hamas to release the remaining hostages. But in the name of combating Hamas, Mr. Netanyahu has unleashed a relentless assault on the entire population of the Gaza Strip, even as the rest of the world watches passively.\rDespite the use of callous, inhumane military tactics, which led the International Criminal Court to issue an arrest warrant against Mr. Netanyahu, Israel has faced little resistance from the most powerful nations. West Asia’s only nuclear power continues to receive weapons from its western allies. The Biden administration provided consistent military and diplomatic support throughout the war. And President Donald Trump, who once threatened to empty out the Palestinians from Gaza, appears to have given a carte blanche to Mr. Netanyahu. With no meaningful restraints, Mr. Netanyahu is now poised to make another grave mistake by expanding the offensive. Over the past 19 months of war, the best opportunity for peace was the implementation of the January 2025 ceasefire agreement. It required, in the second phase, Israel’s withdrawal from Gaza and Hamas releasing the remaining hostages. But Israel’s refusal and also Hamas’s refusal to hand over the hostages without Israeli pull-back led to the resumption of fighting. If Mr. Netanyahu proceeds with his plans, it will not just deepen the moral and humanitarian crisis but also deal a devastating blow to any attempt to end the conflict through talks. The world should show greater moral and institutional courage in confronting mass violence and forced displacements perpetrated by nation-states.\r Published - May 07, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        international court or tribunal\n                    \n                            /                      \n                        \n                        arrest",
        "headline_1": "​Hell on earth: On Israel and Gaza",
        "headline_2": "The world should restrain Israel from occupying Gaza",
        "link": "https://www.thehindu.com/opinion/editorial/hell-on-earth-on-israel-and-gaza/article69545226.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "07-05-2025"
    },
    {
        "full_article": "We keep inventing names for those who rule – or want to rule – over us\nIs Elon Musk, Donald Trump’s sidekick, the archetypical broligarch? Are broligarchs like him turning America, the world’s most vaunted democracy, into a broligarchy?\nBroligarchy is a word coinage that combines the term bro, the abbreviation for brother, with archy, derived from the Greek word for rule or govt. \nA broligarchy is defined as a govt or administration in which an elite group of extremely rich men, generally CEOs of tech companies, call all the shots in forming national policies.\nWhile Musk has been called the world’s first broligarch, tech oligarchs such as Jeff Bezos and Apple’s Tim Cook are also members of this totemic tribe.\nBroligarchy, first used on Twitter in 2009, made its debut in print in 2024 and is the latest archy to join the hierarchy of those who rule, or want to rule, our lives.\nA monarchy, from mono, meaning one, is a state in which a single person, a king or queen, holds power. An oligarchy is where a small group of wealthy or influence-wielding individuals are in command. \nA patriarchy is the political and social governance by men while matriarchy, which in our male-dominated world is extremely rare, is rule by women.\nDespite this proliferation of archys, we in India seem bent on creating more and more of them. Those of us who would like the country to turn its back on the constitutional provision of secularism might be labelled as advocates of Hindutvarchy.\nProponents of promoting Hindi at the expense of regional languages, want to establish a Hindiarchy, a state of affairs likely to be opposed firmly by those determined to preserve regional rights in a federarchy.\nThe growing demands of some groups who seek to impose taboos against the consumption of specific foods might be deemed to be supporters of a veggiarchy, while their non-veggie opponents might be all for carnivorarchy.\nWith all these conflicting archys, India might truly be said to live up to its description of being a functioning anarchy.\n\n",
        "headline_1": "Archy types",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/archy-types/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-05-2025"
    },
    {
        "full_article": "First details of India-UK FTA show plenty of upside for both. The trick was both making key concessions\nAfter three years of talks, India and UK have finalised terms of a free trade agreement (FTA). When talks started, India-UK bilateral trade was at $17.5bn, now it’s touched a meatier $57bn. That partly explains why Modi called the deal “historic” on X yesterday, and Starmer termed it “landmark”. Both countries – fifth and sixth largest economies, respectively – needed this deal in the current atmosphere of Trump-induced uncertainty, although UK arguably needed it more than India. And while it’s tempting to linger on cheaper Scotch and single malt as a result of reduced Indian tariffs, the impact of the FTA will be far-reaching.\nTake tariffs first. A GOI press release said 99% of Indian exports to UK will face zero duty. These include labour-intensive products like textiles, leather, footwear, toys, gems and jewellery, besides white-collar services – IT/ITeS, finance, etc. In exchange, India will slash tariffs on 90% of British product categories. So, right from British chocolate and cookies to aeroplane parts – Rolls Royce is a major engine supplier to Boeing – will get cheaper. More significant is India’s decision to let British-made cars in at just 10% duty – albeit with an import quota. This is a first, and a sign that India’s auto sector will be less protectionist in future. It also bodes well for a deal with US. Tariff on British whisky and gin, meanwhile, has been halved from 150% to 75%. Cheers!\nCheer also the double contribution convention that both sides have agreed on. That means Indian workers in UK – and vice versa – won’t need to make social security contributions there for the first three years. So, bigger remittances, hopefully. India’s press release says the FTA will ease mobility for a range of professionals. That was a sticking point for India for a long time. With this FTA under its belt, it’s time for India to move fast on trade deals with US, EU and Australia, all of whom are wary of China. FTAs enmesh economies and align national interests like nothing else. Trade deals can be everyone’s security guarantee.\n\n",
        "headline_1": "Cheers mate",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/cheers-mate/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-05-2025"
    },
    {
        "full_article": "GOI’s deliberative approach should continue, never mind rhetoric from Pak or from some voices in India\nPakistan came up empty – unsurprisingly – in its attempts to seek UNSC intervention or even a statement at the closed-door consultation to discuss escalated tensions with India. Pakistan’s rhetoric has made it even more evident that the murder of 26 people in Pahalgam was part and parcel of the proxy war it has waged for decades. Inflammatory rhetoric from Pakistan’s ministers and its army chief – known as ‘Maulana Munir’ – is part of this proxy war. Disruption of Indian society is the sole aim. The Pakistan establishment – its govt-ISI-army and politicians of all shades – has broken its society and brought its economy to the brink of catastrophe. The country is surviving on IMF bailouts and bilateral aid. Islamabad’s warmongering noises are actually cries of desperation, searching for some salience in a global order where India plays an increasingly bigger role. Pakistan, bluntly put, is little more than a wobbly basket case – beholden to now America, then to Beijing, sometimes to both, and for all purposes reduced to a puppet state.\nMeanwhile, GOI continues in its resolve to keep all options open in its response to Pahalgam. But as it does so, it must completely ignore the noise from across the border. The cleverest thing India can do is to convincingly appear deliberative and sophisticated. There’s no need for daily updates or ministerial rhetoric. India’s news television, to no one’s surprise, is in battle cry mode. But India’s govt, doubtless looking at the big picture in all its dimensions, should appear to go about its business in stark contrast to the frenzy on the small screen. GOI is in charge of the world’s fifth largest economy, one that’s now part of almost every major global company’s business plans. It has a bustly stock market driven in almost equal parts by foreign funds and a growing domestic investor class. India, unlike Pakistan, has a future to consider. Official statements from New Delhi should reflect this.\nNews television anchors and social media warriors may want ‘action’ now. GOI should, as it is already doing, concentrate on acting wisely.\n\n",
        "headline_1": "Ignore the noise",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/ignore-the-noise/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-05-2025"
    },
    {
        "full_article": "Why Trump’s tariff on non-US films will put Hollywood in a creative Alcatraz\nAmerica closed its securest prison, Alcatraz, in 1963, less than a year after three men escaped from it. The decision was based on cost, not hurt pride. Alcatraz then became a tourist hangout and the setting of some popular films, including 1979’s Escape From Alcatraz. Back then, Hollywood could spot a good story, tell it well, and rake in millions. That’s how it became world’s biggest and most powerful film industry.\nOnly twice in the past 50 years has a non-American film topped the global box-office. First in 2020, a freak year, and now, when Chinese animation film Ne Zha 2 has earned over $2bn since its release on Jan 29. For Trump, who announced in Jan he would make Hollywood “bigger, better and stronger”, this is too much. Early on Monday, he declared Alcatraz would be turned into a prison again, and 23 minutes later, slapped a 100% tariff on “any and all movies coming into our country that are produced in foreign lands”.\nThe order isn’t surprising because tariffing is Trump’s answer to all of America’s economic woes. But it’s odd because films aren’t goods. They are like software and services that earn billions of tariff-free dollars for India. Will he tariff services next? India’s GCCs might be worried. The film industry certainly is. Hindi and Telugu films have raked in millions of dollars over the past several years, but with Trump’s typically vague diktat, the cost to US distributors could double. There’s no clarity on what “produced in foreign lands” means. If part of a Hollywood film is shot abroad, is it American or foreign? Does the order also apply to films and series made for OTTs?\nNobody’s denying Hollywood’s decline. Only 20% of American films and TV shows are made there now, and big-name films regularly bomb. Atlanta, New York and Texas are rivals at home, while Mexico – Netflix will invest $1bn there annually to make films and shows – Europe, Australia, Canada, etc, are all wooing American studios with lower costs. By raising a tariff wall, Trump can counter their cost advantage, but US will lose big if other countries tariff its films. Right now, Hollywood earns about two-thirds of its revenues abroad. Avatar, the highest grossing film ever, made 73% from foreign screens, its sequel 70%, and so did Titanic.\nTrump forgets that these three films – among Hollywood’s top four earners – were directed and produced by James Cameron, a Canadian. Kate Winslet, star of Titanic, is British. Hollywood’s biggest strength is that it’s a melting pot of global talent – Priyanka Chopra, Freida Pinto and the late Irrfan included. The last thing it needs is a tariff fortress – its own Alcatraz.\n\n",
        "headline_1": "Bad movie",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/bad-movie/",
        "news_paper_name": "The Times of India",
        "publish_date": "07-05-2025"
    },
    {
        "full_article": "Our health sector has long been plagued by corruption, inefficiency, and a lack of accountability and good governance. Over the past decades, while healthcare costs have significantly increased, the quality of services has not improved as expected. The lack of adequate healthcare facilities across the country has been a persistent problem, while the absence of healthcare professionals at upazila and union-level facilities has deprived rural and marginalised populations of even basic services. Against this backdrop, the Health Sector Reform Commission's proposals give us hope for building a system that will be efficient, people-oriented, and accessible to all.\nUnfortunately, public health has never been a top priority for successive governments. While sectors such as public administration, energy, transport and communication, local government and rural development, and defence, among others, have received significant budgetary allocations, the health sector has been comparatively neglected. Therefore, the commission's suggestion that our total public health expenditure should rise to around 15 percent of the total budget, or at least 5 percent of GDP, is appreciable. Reportedly, countries making significant progress in achieving universal health coverage globally spend 5 percent or more of their GDP on healthcare. Greater investment is thus crucial, as it will expand healthcare services, reduce out-of-pocket expenses, and ensure financial protection for ordinary citizens.\nThe commission also recommends that the authorities make primary healthcare a constitutional obligation, providing it free of cost to all. It also recommends strengthening the primary healthcare system by integrating union-level health and family planning centres into fully functional primary healthcare centres. In urban areas, such centres should be managed at the ward level. We believe these reforms are crucial to ensure universal access to primary healthcare. Forming an independent Bangladesh Health Commission to ensure a transparent and effective health system is another important recommendation. Additionally, creating an autonomous Bangladesh Health Service by restructuring the current health cadre to enhance professionalism, skills, and accountability, and establishing a dedicated Public Service Commission for healthcare recruitment are steps whose time has come.\nOther major proposals include forming a National Institute of Women's Health, establishing 11 regional health authorities at the divisional level to decentralise healthcare management, integrating multiple government agencies under the Directorate General of Health Services (DGHS), and setting up a pharmacy network to distribute essential medicines either free or at subsidised rates. Additionally, prohibiting pharmaceutical companies from influencing doctors through gifts or free samples, and encouraging doctors to prescribe medicines using their generic names, seem like well-thought-out suggestions.\nThat said, while the recommendations made by the commission are crucial, implementing them will undoubtedly be challenging, especially under an elected political government. We hope the interim government will help overcome these challenges with the support of political parties and work sincerely to achieve the goals set by the commission.\n",
        "headline_1": "The health sector needs a complete overhaul",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/the-health-sector-needs-complete-overhaul-3888226",
        "news_paper_name": "The Daily Star",
        "publish_date": "07-05-2025"
    },
    {
        "full_article": "Recently, the faculty hiring process at Dhaka University has received intense scrutiny and has been criticised for its lack of focus on merit and for failing to seek the most qualified candidates for any department. It is indeed true that our most important national academic treasure, Dhaka University—where the best and brightest receive their education—will not be able to maintain its status in this competitive world unless proper attention is paid to hiring the best and most qualified faculty to educate the future generation.\nThe institution only needs to look back into its own history to see how it once focused on merit-based hiring at its inception, which catapulted its reputation both in the Indian subcontinent and beyond. A glimpse of history is presented here, where emphasis was strictly on merit-based hiring, international in scope and offering the best possible compensation to attract true scholars to Dhaka. PJ Hartog, who was the first vice-chancellor of the university in 1920, left no stone unturned in personally seeking out the best and brightest for the university, which opened its gates in July 1921. PJ Hartog (1864-1947) was the most influential figure in the leadership of Dhaka University in its foundational years. He had 17 years of experience as the registrar of the University of London between 1903 and 1920 before coming to Dhaka to lead Dhaka University during both its inception and early years.\nDhaka University began its journey with a clear goal of appointing the most capable faculty. The British Board of Education (BOE) provided essential assistance in faculty selection. A selection committee was formed in 1920 with key members in the areas of English literature, history, political economy, phonetics, mathematics, chemistry, and physics. The members of the selection committee were exceptional academics. For example, for English literature, there were three members on the committee. Two of them were Professor William P Ker, who was the Oxford professor of poetry, and Sir Sidney Lee, a professor of English classics at the University of London. On the search committee for physics, Sir Arthur Schuster was a member. He was a fellow of the Royal Society (FRS) and a professor at the University of Manchester. One of the other members out of the three was Sir William Bragg, also an FRS. Professor Bragg won the Nobel Prize in Physics in 1915 and was a professor of physics at University College London. In the search for a head of the department of physics, the committee was having difficulty finding a suitable candidate.\nThe physics search committee asked Vice-Chancellor Hartog to write to Professor Ernest Rutherford, another Nobel laureate, who was then the director of the Cavendish Laboratory in Cambridge. Hartog contacted Rutherford, who recommended a physicist, Dr JL Glasson. Hartog then asked Bragg to compare him with Professor Jenkins of Dhaka College. Ultimately, the position went to Jenkins. The quality of the selection committees ensured that highly qualified faculty would be part of the new university. This serves as an example of Hartog's attention to detail, and it is remarkable that Dhaka University was consulting Nobel laureates for the selection of its science faculty as early as 1920.\nThe search for excellent faculty was one of the highest priority agendas of the vice-chancellor, Sir Philip Hartog. In a private letter to Lord Ronaldshay on June 30, 1920, the governor of Bengal, he outlines the initial hiring of eight professors and five readers in various subjects. This was about one year prior to the opening of the university. His commitment to excellence is evidenced in this letter, in which he sought a high-calibre scholar for the head of the department of Islamic Studies.\nHe writes: \"A point of great importance is the question of the Headship of the Islamic Department. Zia-uddin was very keen that the Head should be an Englishman, and the rest of the Commission deferred to his judgment on that point. But I have made private enquiries and there seems to be no Arabic scholar in England of sufficient standing who would be likely to accept such a post. On the other hand, Arnold, of the India Office, himself one of the most distinguished Arabic scholars, tells me that Dr Siddiqui, who worked at Cambridge under Browne, and also under the most distinguished German scholars for seven or eight years, is a scholar of the first rank, and in his judgment by far the best available person. Dr Siddiqui is now at Aligarh.\"\nHartog had set the stage from the university's inception that merit would be the basis for the selection of faculty and administration. This vision of leadership was instrumental in defining Dhaka University as one of the outstanding institutions in all of India.\nInternational fame for Dhaka University came with physicist Satyendranath Bose's communication with Einstein in Berlin and Einstein's interest in the paper sent by Bose. Bose was hired by PJ Hartog. He joined Dhaka University as a reader in physics in 1921. He became head of the department and later dean of science. Einstein translated his paper on \"Light Quantum\" into German for publication. Aware that his derivation was the logical outcome of Einstein's own line of thought, in June 1924 Bose sent his paper to Einstein, who, recognising its merit, immediately translated it himself. Their collaboration led to Bose-Einstein statistics, and his contribution later led to the naming of an elementary particle—the \"boson\"—in his honour. The experimental proof of the Bose-Einstein condensate led to a Nobel Prize being awarded to three American physicists in 2001. Professor Bose was sent to Europe with funding from Dhaka University in 1926 and spent time with Louis de Broglie, Marie Curie, and Einstein. He visited well-known physics laboratories and attended technical meetings. He provided many years of dedicated service as a teacher, mentor, and academic leader. His life's best scientific work was conducted at Dhaka University.\nIt is recognised that Dhaka University is much larger now and that even if Hartog were here today, he would not have time to personally seek the best candidates for faculty positions. However, it is a lesson for all of us that focusing on proven scholarship should be the main criterion in hiring the most qualified faculty, and that a merit-based hiring system must be fiercely implemented to continue the institution's early traditions. In this new century, we expect nothing less from Dhaka University.\nAnique Newaz has an MPhil degree in South Asian Studies from the Cambridge University, UK.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Dhaka University: Faculty hiring in its early years ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/dhaka-university-faculty-hiring-its-early-years-3888106",
        "news_paper_name": "The Daily Star",
        "publish_date": "07-05-2025"
    },
    {
        "full_article": "The struggles in the banking sector, stemming from a weakened capital base after years of unchecked irregularities during the Awami League's tenure, continue to attract attention. According to data from Bangladesh Bank, the capital-to-risk weighted asset ratio (CRAR)—which measures a bank's capital relative to its risk-weighted assets—fell to just 3.08 percent across the sector at the end of 2024. This is significantly below the 10 percent minimum required under the Basel III framework, down from 6.86 percent recorded three months earlier and 10.64 percent recorded in June 2023.\n\nWhile some banks continue to maintain healthy capital buffers, there is a stark divide within the industry with a number of banks facing alarming shortfalls. For example, at the end of December, state-run banks recorded a CRAR of negative 8.42 percent, Islamic banks stood at negative 4.95 percent, and specialised banks at negative 41.02 percent. In contrast, private commercial banks posted a CRAR of 10.98 percent, while foreign banks reported a robust 42.09 percent.\n\nAccording to industry insiders, these capital shortfalls could jeopardise the stability of the entire financial sector. Moreover, investors and depositors are likely to lose confidence in the affected banks. As a result, the credit ratings of these institutions could be downgraded, making it more difficult and costly for them to raise funds and improve their financial positions.\n\nIt is also worth noting that several banks failed to finalise their annual financial statements by the April 30 deadline. Bangladesh Bank has applied to the finance ministry for a one-month extension on behalf of these banks. In the past, banks were granted various regulatory forbearances, including deferrals on provisioning requirements during the finalisation of annual statements. However, this time the banking regulator has not provided any such relief. Furthermore, in March this year, the central bank tightened the dividend policy for banks, barring those that availed of deferral facilities to meet provisioning requirements from paying dividends from 2024 onwards.\n\nThe ongoing instability in the sector is a direct legacy of the Awami League government's negligence and the corruption it allowed within the sector. This includes permitting banks to defer provisioning requirements, implementing a lax dividend policy, and other regulatory shortcomings. Therefore, although delayed, it is encouraging to see that the central bank has taken measures that, though painful, were long overdue. In the past, we have seen how weak and problematic banks have used such regulatory forbearance to hide capital shortfalls. Rather than continuing to provide the same facility that failed to improve the banks' health and worsened banking discipline, the central bank would be better off exploring other measures to improve overall stability in the sector.\n",
        "headline_1": "Keep a close eye on banks’ health",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/keep-close-eye-banks-health-3888001",
        "news_paper_name": "The Daily Star",
        "publish_date": "07-05-2025"
    },
    {
        "full_article": "We are concerned about the rising dengue cases across the country as the monsoon begins to set in. According to the Directorate General of Health Services (DGHS), 20 people have died from dengue so far this year (as of Friday morning), while 2,586 others have been hospitalised. The situation may further deteriorate in the coming months, with persistent rainfall and thunderstorms forecast by the Bangladesh Meteorological Department. Reportedly, there has already been a sharp rise in the Breteau Index (BI), a measure of Aedes mosquito density, across the country. The BI value was over 10 in April, compared to less than 10 on average last year. Experts have warned that if this trend continues, the BI could exceed 20 in June, which is alarming. Thus, the government needs to take early measures to prevent another deadly outbreak this year.\nReportedly, the government's dengue control measures were largely inadequate last year due to a lack of leadership and manpower in local government bodies following the fall of the Awami League government in August. But since we now have administrators in both DNCC and DSCC, as well as other cities and municipalities, we hope they will take organised measures before it is too late. Moreover, since dengue has already spread across the country, with cases outside Dhaka steadily rising, special focus needs to be given to other districts. Experts have suggested forming dedicated mosquito control units nationwide and establishing a specialised department comprising entomologists and epidemiologists to effectively address the heightened dengue risk this year. The government, therefore, should consider their suggestions and develop a year-long dengue control plan involving local communities. Additionally, the DGHS must conduct its regular dengue surveys to identify hotspots. At the same time, our hospitals and healthcare facilities—particularly those outside Dhaka—must be adequately prepared to treat the increasing number of dengue patients.\nSince preventive measures are key to avoiding a major outbreak this year, the Ministry of Local Government, Rural Development and Co-operatives must urgently issue directives to its departments to control the spread of Aedes mosquitoes. Managing breeding grounds and controlling larvae should be our primary focus now. To this end, the authorities must immediately launch cleanliness drives across the country while also conducting regular fogging. They should establish a mechanism to inspect various construction sites, which are potential breeding grounds for Aedes mosquitoes. Moreover, regular awareness campaigns must be conducted to inform citizens about the dengue threat. Timely interventions are essential to prevent a situation similar to 2023, when 1,705 people lost their lives to this preventable disease.\n",
        "headline_1": "Take urgent steps to curb dengue threat",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/take-urgent-steps-curb-dengue-threat-3886051",
        "news_paper_name": "The Daily Star",
        "publish_date": "07-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 07, 2025 00:00:00  \nThe expatriate workers are apparently showing their trust in and support for the interim government run by its chief Adviser, Dr Muhammad Yunus. If the volume of remittance sent through official banking channels is any indicator, then the expatriate workers have proved this observation by sending a record amount of remittance during the first 10 months of the current fiscal year (2024-25). In fact, with a total remittance of US$24.39 billion between July 2024 and April 2025, the amount has surpassed the total remittance receipts during the previous fiscal at US$23.91 billion by 0.48 billion--- up by 2.0 per cent. The data on remittance have reportedly been supplied by the Bangladesh Bank (BB). If this trend of remittance inflow continues, by the end of the current fiscal, the total remittance could reach US$27 billion or even US$28 billion, according to banking sector projection. With steady supply of remittance, the economy, to all appearances, is looking up as it has been able to meet foreign obligations including debt repayment. \nWhy remittance inflow is on the rise has no single answer. It has to do with factors like the narrowing gap between official and market-based exchange rate of dollar, clampdown on money laundering and similar other actions taken by the government against manipulators including, for example, the so-called, hundi or hawala operators active in the foreign exchange market. Admittedly, one of most positive impacts of the remittance surge is that Bangladesh's foreign exchange reserve has increased to a comfortable level of US$27.35 billion, according to BB's calculation and US$22 billion by IMF's formula. Obviously, the present outlook for the forex reserve is positive.\nA positive impact of increased remittance inflow is that, as reported in this paper, foreign corresponding banks are easing the limits of their line of credit for local banks and the international suppliers of energy or fuels, are also, reportedly lowering their risk premiums. These are no doubt uplifting pieces of news for the economy. According to monetary analysts, by stabilising the foreign exchange market and strengthening forex reserve, the incoming remittance is also contributing to increasing liquidity flow in the money market. In this connection, an official of Petrobangla is learned to have told this newspaper that the higher remittance flow has helped the state-owned company to clear external debts amounting to US$3.74 billion ahead of schedule. Naturally, the energy suppliers are now asking for lower premium on the spot market. This would definitely go to reduce import cost of, for instance, Liquefied Natural Gas (LNG).\nEvidently, the upturn in remittance inflow helps normalise import, which economists believe facilitates fight inflation. But remittance alone is not going to cure all the ills afflicting the economy. For instance, would the increasing remittance receipts be enough to answer the chronic shortage of gas supply that has almost crippled the textiles and garments sectors that constitute 85 per cent of the country's export? Since running industries with imported energy is not a feasible proposition for an energy-starved economy like Bangladesh, the solution obviously lies in developing domestic gas reserves. According to Petrobangla, of the total 4.26 billion cubic feet of gas demand in the country, only 831 million cubic feet come from imported LNG. So, the energy supply crunch is going to stay. Admittedly, this is another reason for a lack of industrial investment. Since ensured supply of energy is a precondition for local and overseas companies, especially foreign direct investment (FDI) to come, the interim government needs also to turn its full attention to the industry sector, which is but the backbone of the economy.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Increasing remittance to keep economy on track",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/increasing-remittance-to-keep-economy-on-track-1746551354",
        "news_paper_name": "The Financial Express",
        "publish_date": "07-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       May 07, 2025 00:00:00  \nDespite Bangladesh's impressive strides in agricultural production, its agro-food processing sector remains underdeveloped and far below its true potential. Successive governments have declared it a thrust sector, yet meaningful progress has been elusive. The enabling environment needed to drive growth, innovation, and export readiness has simply not materialised in the way it should have.\n Agro-processed foods, marked by value addition, hold significant promise both domestically and globally. With rising global demand for processed food products, Bangladesh-home to millions of farmers and a wide range of agricultural outputs-is uniquely positioned to thrive in this area. The sector is not only crucial for economic growth but also directly linked to rural livelihoods, offering an unparalleled opportunity to uplift farming communities while contributing to the national economy.\n Given its diverse agro-climatic conditions and year-round agricultural activity, Bangladesh has every reason to be a major producer of agro-processed foods for both domestic and export markets. However, despite commendable growth in agricultural production over the decades, the country has fallen short in leveraging this strength to capture export opportunities. Exporting processed foods is a complex endeavour, but the reluctance-or inability-to tap into international markets undermines the achievements made in primary agricultural output.\n The domestic food processing industry has grown moderately, mainly serving rising local demand with limited engagement in exports. Yet a key obstacle to greater expansion, particularly in overseas markets, lies in the country's inadequate laboratory testing and quality compliance infrastructure. Globally, food exports face rigorous sanitary, phytosanitary, and quality standards. Without internationally accredited laboratory facilities capable of certifying compliance with these standards, Bangladesh's processed food exports remain constrained, unable to fully access high-potential markets.\n This issue has become even more pressing as importing countries, especially in the developed world, enforce increasingly strict non-tariff barriers. Food safety, hygiene, and quality certifications are no longer optional-they are mandatory prerequisites for market entry. Unless Bangladeshi food exports are channeled through credible, internationally recognised testing protocols, their chances of penetrating these markets will remain limited. The consequence is a glaring mismatch between the sector's potential and its actual performance.\n Agro-processors are acutely aware of this challenge. Industry stakeholders have long urged the government to establish an internationally accredited quality control laboratory to ensure that processed foods meet global standards. Such a facility would not only enhance product branding but more critically, enable market access. Without the ability to meet importing countries' compliance requirements, branding efforts alone are insufficient. Worse, a single embargo or quality rejection from a key market could have a damaging ripple effect across the entire industry.\n Experts point to chronic underinvestment in the sector as another key constraint. Beyond financing, the lack of coordinated planning has also hindered growth. Many processing plants are located without consideration for proximity to raw material sources, making it difficult to efficiently channel agricultural produce into processing hubs. While more than 200 food processing firms operate in Bangladesh, only a few are actively exporting with modest export volumes.\n Other structural challenges further inhibit growth. Heavy reliance on imported packaging materials, the absence of a central regulatory body to oversee the sector, and fragmented supply chains all contribute to limit competitiveness. Without a well-integrated ecosystem linking farmers, processors, logistics, quality control, and marketing, the sector struggles to achieve economies of scale or meet international benchmarks.\n Nevertheless, Bangladeshi processed foods have found markets across the globe, from advanced economies to developing regions. Key destinations include the United Kingdom, the United States, Canada, Malaysia, and countries in the Middle East-primarily driven by the diaspora population. Popular export items range from spices, fruit juices, biscuits, and processed nuts to potato chips, flakes, and pickles. Bangladeshi migrants form the core consumer base for these products, and their preference for familiar, homegrown brands creates a steady demand. However, the market potential extends beyond the Bangladeshi diaspora. Other South Asian communities abroad share similar culinary preferences, offering a broader target market if products can be tailored to their tastes and meet necessary quality standards. Expanding beyond ethnic markets would require strategic product development, branding and compliance with international food safety regulations.\n Domestically, demand for agro-processed products is also growing as consumers increasingly opt for ready-to-cook and ready-to-eat foods. While local demand has been the main driver of industries' growth so far, scaling up service to both domestic and global markets necessitates a stronger emphasis on quality assurance and compliance. Export destinations like the European Union have particularly stringent requirements, and meeting these standards can open doors not only to new markets but also to diversified product offerings.\n To unlock the full potential of agro-food processing, Bangladesh needs a coordinated, multi-faceted approach. Investment in modern processing facilities, integration of supply chains, development of export-oriented infrastructure, and above all, establishment of internationally accredited quality control labs are critical steps. Ensuring compatibility with international testing and certification protocols is vital to gain global acceptance. Human, technical, and logistical resources alone are insufficient without the backing of officially recognised quality control mechanisms. Without these, the sector risks stagnating despite its natural advantages and growing global demand.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Unlocking potential of agro-food processing sector",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/unlocking-potential-of-agro-food-processing-sector-1746551431",
        "news_paper_name": "The Financial Express",
        "publish_date": "07-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 07, 2025 00:00:00  \nThe process of correcting national identity (NID) cards has become a major source of frustration for citizens. For even the most minor updates-such as spelling of name, date of birth, or address-people are often compelled to make multiple visits to the Election Office, navigating layers of confusing paperwork, unclear instructions, and poor management.\nWhile an online portal exists for NID services, its functionality leaves much to be desired. Frequent server issues, login failures, slow performance, and a non-intuitive interface have made the digital process equally burdensome. Consequently, many are forced to turn to brokers, risking financial exploitation and the potential for fraudulent activity.\nThis crisis is even more pronounced in rural areas, where limited internet access, low digital literacy and the need to travel long distances make the service nearly unreachable. The result is not just wasted time and resources, but a violation of citizens' basic rights and dignity.\nTo address this, urgent reform is necessary. The national ID correction system must be made simpler, more transparent, and truly digital. A user-friendly online platform, reliable server infrastructure, mobile app-based services, and the establishment of local service centres would enable citizens to complete corrections efficiently and independently.\nThe Election Commission and other authorities concerned must take immediate and concrete steps toward improving the system. The right to accurate and accessible identification is fundamental and must not be compromised by bureaucratic inefficiency.\nProgga Das\nStudent, Department of Economics\nEden Mohila College\nproggadas2005@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Simplify NID correction",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/simplify-nid-correction-1746551475",
        "news_paper_name": "The Financial Express",
        "publish_date": "07-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 07, 2025 00:00:00  \nImagine a morning when the world has come to a halt. There are no newspapers, no TV broadcasts, no radio signals, and only internet is on. People's restless eyes search for reliable information. In this void, would you still trust social media alone?\nIn Bangladesh, the distinction is becoming impossible to ignore: social media, despite its reach and speed, cannot replace traditional media.\nSocial media platforms have rapidly become a dominant force in communication. Yet their rise has not displaced newspapers, radio, or television - institutions that have long served the public by delivering verified information under pressure and intense scrutiny.\nUnlike traditional media, social platforms often circulate information without rigorous verification. Misinformation, half-truths, and rumours flourish, sometimes escalating into public panic or posing threats to national security.\nThe internet shutdown during the mass protests of July and August 2024 exposed this weakness. As social media platforms went dark, traditional news outlets kept working. Despite censorship and restrictions, newspapers and broadcasters continued to publish reliable updates, underscoring their essential role in public life.\nThis moment revealed a fundamental truth: without internet access, social media collapse. Traditional media, grounded in credibility and accountability, endure. \nSocial media are now a vital part of the media ecosystem. However, without maintaining standards of accuracy, ethics, and responsibility, those cannot claim the authority or trust that traditional journalism commands.\nThis experience exposed a crucial truth: without internet, social media vanish - but traditional media stand firm.\nToday, social media are even used for nasty and highly destructive purposes. They can be abused due to their lack of accountability like established institutions. But without a commitment to accuracy, credibility and ethics, they cannot and will not replace real journalism.\nIn the end, old is indeed gold. When truth matters most, we turn not to trending hashtags, but to trusted headlines.\nFiad Nowshad Yeamin\nStudent\nDepartment of Media, Communication and Journalism,\nCanadian University of Bangladesh\nnowshadyeamin415@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Can social media replace traditional media?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/can-social-media-replace-traditional-media-1746551506",
        "news_paper_name": "The Financial Express",
        "publish_date": "07-05-2025"
    }
]